{
   "Name": "Sons of Champlin",
   "rawData": [
      "The Sons of Champlin are an American rock band, from Marin County in the San Francisco-Bay area, formed in 1965. They are fronted by vocalist/keyboardist/guitarist Bill Champlin, who later joined rock band Chicago, from 1981–2009, placing Sons of Champlin on hiatus from 1981–1996.  They brought to the late 60's music scene in the Bay Area a soulful sound built around a horn section, sophisticated arrangements, philosophical themes, Bill Champlin's songwriting and blue-eyed soul singing, and Terry Haggerty's jazz-based guitar. They are one of the 1960s San Francisco bands, along with Jefferson Airplane, the Grateful Dead and Moby Grape.\n",
      "Champlin started his musical career in high school (Tamalpais in Mill Valley) as a member of a local band, The Opposite Six.  One of his teachers encouraged Champlin to drop out of school and pursue music full-time.  In 1965 the draft claimed the drummer and bass player of the Opposite Six, and Champlin joined forces with guitarist Terry Haggerty, sax player Tim Cain, bassist John Prosser and drummer Jim Meyers in the band that became the Sons of Champlin.  By late 1967 the lineup had changed to include keyboardist/saxman Geoff Palmer, trumpeter Jim Beem, bassist Al Strong, and drummer Bill Bowen, creating a Hammond B3-and-horns sound that was distinctive from the rest of the Bay Area's psychedelic guitar bands.\n",
      "The Sons recorded their first album, Fat City in 1967 for Trident Records, owned by Kingston Trio manager Frank Werber.  They released a single, \"Sing Me a Rainbow,\" (B-side \"Fat City\") which got airplay in the Bay Area but did not crack the national charts.  The plan was to follow this release with another song from the album, a Barry Mann/Cynthia Weil composition called \"Shades of Grey\", but the Monkees released their version before this could happen. The album was not released and the Sons left Trident Records. In February 1999, this collection was released on a British CD under the title Fat City.\n"
   ],
   "infobox": {
      "Also known as": [
         "The Sons, The Opposite Six, Yogi Phlegm, The Nu Boogaloo Express, The Masterbeats"
      ],
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "R&B, psychedelic rock, funk"
      ],
      "Years active": [
         "1965–1970, 1971–1977, 1985, 1997–present"
      ],
      "Labels": [
         "Capitol, Columbia, Ariola, Arista, Goldmine Records, Trident Records, Sons of Champlin, Dig Music, Big Beat"
      ],
      "Associated acts": [
         "Tower of Power, Cold Blood, Chicago, The Rhythm Dukes"
      ],
      "Website": [
         "SonsofChamplin.com"
      ],
      "Members": [
         "Bill Champlin",
         "Geoffrey Palmer",
         "Tim Cain",
         "Tamara Champlin",
         "Carmen Grillo",
         "Jeff Lewis",
         "Alan Hertz",
         "Richard Mithun",
         "Douglas Rowan"
      ],
      "Past members": [
         "Terry Haggerty",
         "James Preston",
         "John Prosser",
         "Jim Meyers",
         "Jim Beem",
         "Al Strong",
         "Bill Bowen",
         "Bill Vitt",
         "Mark Isham",
         "Mic Gillette",
         "Tal Morris",
         "David Schallock ",
         "Tom Saviano",
         "Rob Moitoza"
      ]
   },
   "albums": []
}