{
   "Name": "Steve Miller Band",
   "rawData": [
      "The Steve Miller Band is an American rock band formed in 1966 in San Francisco, California. The band is led by Steve Miller on guitar and lead vocals. The group had a string of mid- to late-1970s hit singles that are staples of classic rock radio, as well as several earlier psychedelic rock albums. Miller left his first band to move to San Francisco and form the Steve Miller Blues Band. Shortly after Harvey Kornspan negotiated the band’s contract with Capitol Records in 1967, the band shortened its name to the Steve Miller Band. In February 1968, the band recorded its debut album, Children of the Future. It went on to produce the albums Sailor, Brave New World, Your Saving Grace, Number 5, Rock Love, Fly Like an Eagle, Book of Dreams, among others. The band's Greatest Hits 1974–78, released in 1978, sold over 13 million copies. In 2016, Steve Miller was inducted as a solo artist in the Rock and Roll Hall of Fame.\n",
      "In 1965, after moving to Chicago to play the blues, Steve Miller and keyboardist Barry Goldberg founded the Goldberg-Miller Blues Band along with bassist Roy Ruby, rhythm guitarist Craymore Stevens, and drummer Maurice McKinley. The band contracted to Epic Records and recorded a single, \"The Mother Song\", which they performed on Hullabaloo, before Miller left the group to go to San Francisco.\n",
      "Miller then formed The Steve Miller Blues Band. Harvey Kornspan, managing partner, wrote and negotiated the band's contract ($860,000 over five years as well as $25,000 of promotion money that was to be spent at the band's discretion) with Capitol/EMI Records then-president Alan Livingston in 1967. Shortly after, the band's name was shortened to The Steve Miller Band at the recommendation of George Martin in order to broaden its appeal. The band, consisting of Miller, guitarist James Cooke, bassist Lonnie Turner, drummer Tim Davis (who replaced the departing Lance Haas on drums) and Jim Peterman on Hammond B3 organ, backed Chuck Berry at a gig at the Fillmore West that was released as the live album, Live at Fillmore Auditorium. Guitarist Boz Scaggs joined the band soon after and the group performed at the Magic Mountain Festival (festival was held June 10/11, 1967) and the following week at the Monterey Pop Festival (festival was held June 16/17/18, 1967).\n"
   ],
   "infobox": {
      "Also known as": [
         "The Steve Miller Blues Band",
         "The Miller Band"
      ],
      "Origin": [
         "San Francisco, California, U.S."
      ],
      "Genres": [
         "Rock",
         "blues rock[1]",
         "psychedelic rock[1][2]",
         "southern rock[3]",
         "rock and roll"
      ],
      "Years active": [
         "1966–present"
      ],
      "Labels": [
         "Capitol",
         "Mercury",
         "Polydor",
         "Roadrunner",
         "Loud & Proud"
      ],
      "Associated acts": [
         "Goldberg-Miller Blues band, Boz Scaggs"
      ],
      "Website": [
         "www.stevemillerband.com"
      ],
      "Members": [
         "Steve Miller",
         "Kenny Lee Lewis",
         "Gordy Knudtson",
         "Joseph Wooten",
         "Jacob Petersen"
      ],
      "Past members": [
         "Sonny Charles\n",
         "Lonnie Turner\n  ",
         "James Cooke\n  ",
         "Tim Davis\n",
         "Jim Peterman\n  ",
         "Boz Scaggs\n",
         "Ben Sidran\n",
         "Nicky Hopkins\n",
         "Bobby Winkelman\n",
         "Jack King\n",
         "Ross Valory\n",
         "Gerald Johnson\n",
         "Dick Thompson\n  ",
         "Roger Allen Clark\n  ",
         "Gary Mallaber\n",
         "John King\n  ",
         "David Denny\n",
         "Greg Douglass\n",
         "Byron Allred\n  ",
         "Norton Buffalo\n",
         "John Massaro\n",
         "Billy Peterson\n",
         "Ricky Peterson\n  ",
         "Bob Malach\n  "
      ]
   },
   "albums": [
      "Children of the Future",
      "Sailor",
      "Brave New World",
      "Your Saving Grace",
      "Number 5",
      "Rock Love",
      "Recall the Beginning...A Journey from Eden",
      "The Joker",
      "Fly Like an Eagle",
      "Book of Dreams",
      "Circle of Love",
      "Abracadabra",
      "Italian X Rays",
      "Living in the 20th Century",
      "Born 2 B Blue",
      "Wide River",
      "Bingo!",
      "Let Your Hair Down"
   ]
}