{
   "Name": "For Against",
   "rawData": [
      "For Against is an American post-punk/dream pop band from Lincoln, Nebraska, United States. Despite numerous lineup shuffles and some periods of dormancy, the band has produced material steadily since 1984.\n",
      "Something of an anomaly in Midwestern America, For Against—especially early in its career—has looked to a distinctly British aesthetic for inspiration, most obviously the post-punk scene exemplified by the early rosters of the Factory and 4AD record labels.\n",
      "Featuring members of underground Lincoln bands Cartoon Pupils and Hymn to Joy, the band first called itself Glue, and then D.B.L., finally settling on Four Against One, a name that reflected its status as a quintet at the time. Bassist Liz Panarelli's early departure gave way to keyboardist Jeffrey Runnings' shift to bass, as well as the band's truncation of its name to For Against. By 1985, singer Jon Fynbu had departed as well, leaving the core trio of guitarist Harry Dingman III, drummer Gregory Hill and bassist Jeffrey Runnings. The latter would become (with very few exceptions) the band's sole vocalist and lyricist.\n"
   ],
   "infobox": {
      "Also known as": [
         "Glue",
         "D.B.L.",
         "Four Against One",
         "Stahlversion"
      ],
      "Origin": [
         "Lincoln, Nebraska, United States"
      ],
      "Genres": [
         "Alternative rock, shoegaze, post-punk, dream pop"
      ],
      "Years active": [
         "1984-present"
      ],
      "Labels": [
         "Republic Issue, Independent Project, Rainbow Quartz, Words on Music, Captured Tracks"
      ],
      "Associated acts": [
         "Cartoon Pupils, Hymn to Joy, the Millions, the Gladstones, Holiday"
      ],
      "Members": [
         "Jeffrey Runnings",
         "Harry Dingman III",
         "Nick Buller"
      ],
      "Past members": [
         "Liz Panarelli",
         "John Fynbu",
         "Greg Hill",
         "Jeff Gaskins",
         "Steve Schultz",
         "Steven \"Mave\" Hinrichs",
         "Paul Engelhard"
      ]
   },
   "albums": [
      "Echelons",
      "December",
      "Aperture",
      "Mason's California Lunchroom",
      "Shelf Life",
      "Coalesced",
      "Shade Side Sunny Side",
      "Never Been"
   ]
}