{
   "Name": "As Blood Runs Black",
   "rawData": [
      "As Blood Runs Black is an American deathcore band from Los Angeles, California. They have released three albums. Their first album, Allegiance, was released on June 6, 2006. Their second album, Instinct, was released on March 15, 2011. Instinct reached number 1 on the Billboard Heatseakers Albums chart and number 111 on the Billboard 200 for the week of April 2, 2011. On June 30, 2013, As Blood Runs Black announced that they will be self-releasing their newest album, Ground Zero, with the help of crowdfunding via IndieGoGo; this was successful and the album was released on October 27, 2014.\n",
      "As Blood Runs Black was created in 2003 in Los Angeles from an existing band known as Broken Stems by co-vocalists Louie Ruvalcaba and Enrique \"Ricky\" Martin, bassist Richard Reyes, and guitarists Bijon Roybal and Kyle Hasenstab. Brian \"Animal\" Matute, the drummer of Broken Stems, left and was replaced by Hector \"Lech\" De Santiago. After some practices and writing, the band decided to name itself As Blood Runs Black and played its first show at Toberman in San Pedro, Los Angeles, performing 3 original songs and 3 cover songs. Vocalists Louie Ruvalcaba and Ricky Martin wrote lyrics for their first track, \"Before the Break of Dawn\", while bassist Richard Reyes wrote the lyrics to \"Hester Prynne\" and \"In Dying Days\", both of which would be featured on their debut album. Two demos were released in 2004 and 2005, both containing \"Hester Prynne\" and \"In Dying Days\".\n",
      "In 2005, the band was preparing to enter the studio to record their debut album. However, Ruvalcaba, Martin, Reyes, Roybal and Hasenstaab all departed from the band, leaving De Santiago as the only member. De Santiago recruited Nick Stewart as the new bassist, Ernie Flores as the new guitarist, and, in place of the two former vocalists, the band brought in Chris Blair as the sole vocalist. As Blood Runs Black got back to the studio and recorded their debut album, Allegiance, which was released on June 6, 2006. Shortly after the release of the album, Sal Mendez was recruited as the band's second guitarist. For the next two years, As Blood Runs Black toured in support of Allegiance, including as part of the 2007 Summer Slaughter tour.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "melodic death metal"
      ],
      "Years active": [
         "2003 (2003)–2015"
      ],
      "Labels": [
         "StandBy, Mediaskare"
      ],
      "Associated acts": [
         "Upon a Burning Body, The Browning"
      ],
      "Members": [
         "Hector \"Lech\" de SantiagoNick StewartGreg KirkpatrickChristopher Bartholomew"
      ],
      "Past members": [
         "See members section"
      ]
   },
   "albums": [
      "Allegiance",
      "Instinct",
      "Ground Zero"
   ]
}