{
   "Name": "Awolnation",
   "rawData": [
      "Awolnation (stylized in all caps) is an American rock band, formed and fronted by Aaron Bruno, formerly of Under the Influence of Giants, Home Town Hero, and Insurgence. The band is signed to Better Noise Music, formerly being signed to Red Bull Records, and their first EP, Back from Earth, was released on iTunes on May 18, 2010. They released their first studio album, Megalithic Symphony, on March 15, 2011; it featured their most notable hit, \"Sail\", which peaked at number 17 on the Billboard Hot 100, number 4 on the Billboard Rock Songs chart, and number 5 on the Billboard Alternative Songs chart. The song has been certified 6× platinum by the RIAA and has sold 6,000,000 copies in the United States. As of February 29, 2016, the album has been certified platinum.\n",
      "The band's second studio album, Run, was released on March 17, 2015. The band's third studio album, Here Come the Runts, was released on February 2, 2018. Their fourth studio album, Angel Miners & the Lightning Riders, was released on April 24, 2020.\n",
      "Aaron Bruno was approached by Red Bull Records in 2009, asking if he wanted free use of the Red Bull recording studio in Los Angeles. He recorded a few songs in the studio and ultimately signed with the label, calling it more of a \"partnership\", and was allowed to make the recordings that he wanted. Bruno has been with numerous bands before he created Awolnation, including Home Town Hero with Drew Stewart and Under the Influence of Giants with Dave Amezcua. Bruno writes all of his songs himself, but confides in close friends and family or respected artists for guidance. The band released their first EP Back from Earth on May 18, 2010. The name Awolnation is derived from Aaron Bruno's high school nickname. In an interview with Kristin Houser of the LA Music Blog, he stated that he \"would leave without saying goodbye\" because it was just easier, so that's where the name AWOL (slang from the military acronym for Absent Without Leave) came from.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Alternative rock",
         "electronic rock",
         "indie rock",
         "dance-rock",
         "pop rock"
      ],
      "Years active": [
         "2009–present"
      ],
      "Labels": [
         "Better Noise",
         "Red Bull"
      ],
      "Associated acts": [
         "Under the Influence of Giants",
         "Home Town Hero",
         "Blind Melon"
      ],
      "Website": [
         "awolnationmusic.com"
      ],
      "Members": [
         "Aaron Bruno",
         "Isaac Carpenter",
         "Zach Irons",
         "Daniel Saslow",
         "Josh Moreau"
      ],
      "Past members": [
         "Jimmy Messer",
         "Billy Mohler",
         "Dave Amezcua",
         "Christopher Thorn",
         "Devin Hoffman",
         "Hayden Scott[1]",
         "Drew Stewart",
         "Kenny Carkeet",
         "Marc Walloch",
         "Michael Goldman"
      ]
   },
   "albums": [
      "Megalithic Symphony",
      "Run",
      "Here Come the Runts",
      "Angel Miners & the Lightning Riders "
   ]
}