{
   "Name": "Eels (band)",
   "rawData": [
      "Eels (often typeset as eels or EELS) is an American rock band, formed in Los Angeles, California in 1991 by singer/songwriter and multi-instrumentalist Mark Oliver Everett, known by the stage name E. Band members have changed across the years, both in the studio and on stage, making Everett the only official member for most of the band's work. Eels' music is often filled with themes about family, death, and unrequited love. Since 1996, Eels has released thirteen studio albums, seven of which charted in the Billboard 200.\n",
      "In 1991, Everett signed a contract with Polydor and released A Man Called E under the name E a year later. The single \"Hello Cruel World\" was a minor success. Touring to support the album, E opened for Tori Amos. A Man Called E was followed by Broken Toy Shop in 1993. This year also marked the beginning of E's collaboration with drummer Jonathan \"Butch\" Norton. After Broken Toy Shop, E was released from his record deal with Polydor. E himself has recovered two of the songs ('The Only Thing I Care About' and 'Manchester Girl') from Broken Toy Shop for his own live shows with the Eels.\n",
      "Eels were officially founded when Butch and E met Tommy Walter. The name \"Eels\" was chosen so that the band's records would be close to E's solo records in an alphabetical ordering, although it was too late once they realized that numerous Eagles and Earth, Wind and Fire releases were in between. Eels became one of the first groups to sign a record deal with DreamWorks Records, followed by Elliott Smith.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Feliz, Los Angeles, California, U.S."
      ],
      "Genres": [
         "Alternative rock, indie rock[1]"
      ],
      "Years active": [
         "1991–1995 (E) 1995–present"
      ],
      "Labels": [
         "DreamWorks",
         "Vagrant",
         "E Works"
      ],
      "Members": [
         "E (Mark Oliver Everett)",
         "The Chet (Jeff Lyster)",
         "Koool G Murder (Kelly Logsdon)",
         "P-Boo (Mike Sawitzke)",
         "Knuckles (Derek Brown)",
         "Big/Krazy/Tiny/Honest/Upright/Royal Al (Allen Hunter)"
      ]
   },
   "albums": [
      "A Man Called E",
      "Broken Toy Shop"
   ]
}