{
   "Name": "Hepcat (band)",
   "rawData": [
      "Hepcat is a ska and reggae band formed in southern California in 1989. Their soulful harmonies and mellow rhythms were unlike those of contemporaries and more akin to musicians from the heyday of 1960s Jamaican ska (also referred to as the first wave) with elements of soul, jazz and R&B.\n",
      "Hepcat's debut album, Out of Nowhere was released in 1993 on the New York-based ska label Moon Records. Two years later, they followed it up with Scientific on BYO Records. In 1998, after signing with Epitaph Records subsidiary HellCat Records, they released Right on Time, scoring a modest hit with the swinging \"No Worries\" and scored a spot on the Vans Warped Tour. 2000 saw the release of Push n' Shove, their first album without founding members Raul Talavera and Alex Désert, although the latter appears as a guest vocalist on two tracks.\n",
      "By the early 2000s, the ska scene became oversaturated and commercially less interesting, so the band was dropped by their label. Hepcat went on a hiatus, then reunited in 2003 and continued touring. In 2007, the long-time bassist David Fuentes died, which resulted in the band being less active again. In 2015, the guitarist Aaron Owens died as well. Hepcat continues performing at concerts and festivals, but infrequently.\n"
   ],
   "infobox": {
      "Origin": [
         "California, United States"
      ],
      "Genres": [
         "Ska, Rocksteady, Ska-jazz, Soul, R&B"
      ],
      "Years active": [
         "1989–2000, 2003–present"
      ],
      "Labels": [
         "BYO, Moon Ska, Hellcat"
      ],
      "Associated acts": [
         "The Aggrolites",
         "The Slackers",
         "Dubcat"
      ],
      "Members": [
         "Greg Lee",
         "Alex Désert",
         "Deston Berry",
         "Efren Santana",
         "Kincaid Smith",
         "Lino Trujillo",
         "Greg Narvas"
      ],
      "Past members": [
         "David Fuentes (deceased)",
         "Joey \"Pepe\" Urquijo",
         "Raul Talavera",
         "Lino Trujillo",
         "Greg Narvas",
         "Dave Hillyard",
         "Joey Aguilera",
         "Jeremiah Ben Zion",
         "Dennis Wilson",
         "Aaron Owens  (deceased) ",
         "Chris Castanon",
         "Scott Abels"
      ]
   },
   "albums": [
      "Out of Nowhere",
      "Scientific",
      "Right on Time",
      "Push 'n Shove",
      "Out of Nowhere (Hellcat re-release with two bonus tracks)",
      "Live at The Whiskey a Go-Go"
   ]
}