{
   "Name": "The Human Abstract (band)",
   "rawData": [
      "The Human Abstract is an American metalcore band from Los Angeles, California. Formed in 2004, the group was originally signed to the independent label Hopeless Records, the band then released the two albums Nocturne (2006) and Midheaven (2008) before signing to eOne Music and releasing Digital Veil (2011). The Human Abstract has gone through several lineup changes over the years, with the current consisting of founding members Dean Herrera, A.J. Minette and Brett Powell, in addition to Henry Selva and Travis Richter.\n",
      "The Human Abstract formed in Los Angeles, California in 2004 with guitarists Dean Herrera and A.J. Minette, drummer Brett Powell, bassist Kenny Arehart, and vocalist Nick Olaerts. The group's name was derived from the title of a William Blake poem published in Songs of Experience in 1794. The band soon released a two-track demo to sell at live performances. They would later record additional demos with Jonny Santos of Spineshank and Silent Civilian, and Logan Mader formerly of Machine Head, Soulfly and Medication. The Human Abstract signed to the independent record label Hopeless Records in 2005.\n",
      "In late 2006, Nick Olaerts was replaced by Nathan Ells before heading into the studio to record the band's first full-length release, Nocturne. They released their debut album on Hopeless Records on August 22, 2006.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Progressive metal,[1] metalcore, [2] mathcore[3]"
      ],
      "Years active": [
         "2004 (2004)–present"
      ],
      "Labels": [
         "Hopeless, eOne Music"
      ],
      "Members": [
         "Dean Herrera",
         "Brett Powell",
         "A.J. Minette",
         "Travis Richter",
         " Henry Selva"
      ],
      "Past members": [
         "Nick Olaerts",
         "Kenny Arehart",
         "Nathan Ells",
         "Mike Nordeen",
         "Sean Leonard",
         "Andrew Tapley",
         "Trevor Taylor"
      ]
   },
   "albums": []
}