{
   "Name": "The Lassie Foundation",
   "rawData": [
      "The Lassie Foundation is an indie band from Southern California. Their style has been described as \"pink noise pop.\" They disbanded in 2006 after having released three albums as well as several EPs, but have reunited and are working on a new full-length album.\n",
      "Formed in 1996, The Lassie Foundation released their first EP, California. California defined the group’s sound, a mix of the smooth 1960s and early 1970s West Coast pop music and the sonic power of British shoegaze music. Lassie followed up its EP with their first full-length album, Pacifico. Pacifico caught British attention by being featured in the \"What's on the NME Stereo\" section of New Musical Express magazine. In 1998 the band released the El Rey EP (also featured in NME), whose title track was featured on TV's \"Buffy the Vampire Slayer\", \"Popular\", \"MTV's The Real World\", and \"MTV Road Rules\". Singles in the U.S. and Australia followed, and the band continued its regimen of performing in Southern California clubs with bands like Phantom Planet, At the Drive-In, Mates of State, Creeper Lagoon, and Imperial Teen.\n",
      "2001 saw a turn in the band’s musical direction with its split soundtrack for the independent film I Duel Sioux and the Ale of Saturn, followed soon thereafter by The El Dorado LP, their second full-length album. Both albums abandoned their traditional shoegaze elements for a cleaner pop sound. It also marked the end of the band.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, USA"
      ],
      "Genres": [
         "Indie pop, noise pop, dream pop"
      ],
      "Years active": [
         "1996–2006; 2007–present"
      ],
      "Labels": [
         "Velvet Blue Music, Grand Theft Autumn, Northern"
      ],
      "Website": [
         "www.lassiefoundation.com"
      ],
      "Members": [
         "Wayne Everett",
         "Eric Campuzano",
         "Happy Tsugawa",
         "Jeff Schroeder",
         "Joel Patterson",
         "Jason 71"
      ]
   },
   "albums": [
      "Pacifico",
      "The El Dorado LP",
      "Face Your Fun",
      "Through and Through"
   ]
}