{
   "Name": "Rilo Kiley",
   "rawData": [
      "Rilo Kiley (/ˈraɪloʊ ˈkaɪli/ RY-loh KY-lee) was an American indie rock band  based in Los Angeles, California. Formed in 1998, the band consisted of Jenny Lewis, Blake Sennett, Pierre de Reeder, and Dave Rock.\n",
      "The group released their debut album Take-Offs and Landings under Seattle-based independent label Barsuk Records in 2001.  After that, they released three additional studio albums and several EPs.  In 2007 they were signed with Warner Bros., and subsequently made their major-label debut with the album Under the Blacklight.\n",
      "Rilo Kiley performed their first concert at Spaceland in Los Angeles in January 1998. Their debut EP, Rilo Kiley (later reissued as The Initial Friend EP) was released in 1999. The band signed with independent label Barsuk Records for its first full-length album, Take-Offs and Landings, in 2001. The band later signed with Omaha's Saddle Creek Records and released The Execution of All Things in 2002. In 2004, it released More Adventurous on its own imprint, Brute/Beaute Records, which was distributed by major label Warner Bros. Records. The band later signed directly with Warner Bros.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California"
      ],
      "Genres": [
         "Indie rock, indie pop, emo[citation needed]"
      ],
      "Years active": [
         "1998–2013"
      ],
      "Labels": [
         "Warner Bros., Brute/Beaute, Saddle Creek, Barsuk, Rilo Records"
      ],
      "Associated acts": [
         "The Elected, The Watson Twins, The Postal Service, The Young Veins, Jenny Lewis, Jenny and Johnny"
      ],
      "Website": [
         "www.rilokiley.com"
      ],
      "Past members": [
         "Jenny Lewis",
         "Blake Sennett",
         "Pierre de Reeder",
         "Jason Boesel",
         "Dave Rock",
         "Mike Bloom"
      ]
   },
   "albums": [
      "Rilo Kiley",
      "The Initial Friend",
      "Take Offs and Landings",
      "The Execution of All Things",
      "More Adventurous",
      "Under the Blacklight",
      "Rkives"
   ]
}