{
   "Name": "Daron Malakian and Scars on Broadway",
   "rawData": [
      "Daron Malakian and Scars on Broadway (previously known as just Scars on Broadway) is an American rock band founded by Daron Malakian of the metal band System of a Down. The band's eponymous debut album was released on July 29, 2008.\n",
      "In late 2008, the band entered a hiatus, with Malakian citing a lack of enthusiasm and \"his heart not being into touring\", as the primary reasons for the band's cessation. Despite reforming with various line-up changes in 2010 and 2012, and announcing a second album, the band ceased any further announcements by 2013. In April 2018 Malakian announced that the band would be releasing their second album titled Dictator on July 20, 2018.\n",
      "In December 2005, Malakian stated in an interview that he \"could release ten solo records tomorrow.\" He revealed that he has \"tons of material laying around\", as well as his plans for the future: \"After these albums, – (Mezmerize and Hypnotize) – I'm gonna go off and do something on my own, just like Serj.\" Following System of a Down's hiatus in May 2006, Malakian announced his latest project — Scars on Broadway — a band which would include System of a Down drummer John Dolmayan and himself. Malakian stated \"I haven't decided if I'm going to make it a revolving door of musicians or one solid band but it all revolves around my writing.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, US"
      ],
      "Genres": [
         "Alternative metal",
         "experimental rock"
      ],
      "Years active": [
         "2006–2009, 2010–2012, 2018–present"
      ],
      "Labels": [
         "Interscope[1]"
      ],
      "Associated acts": [
         "System of a Down, Amen, Axis of Justice, Viza, The Chronicles of Israfel, Hella, Pulse Ultra, Scum, Team Sleep, DKFXP"
      ],
      "Website": [
         "www.scarsonbroadway.com"
      ],
      "Members": [
         "Daron Malakian"
      ],
      "Past members": [
         "Dominic Cifarelli",
         "John Dolmayan",
         "Jules Pampena",
         "Franky Perez",
         "Danny Shamoun"
      ]
   },
   "albums": []
}