{
   "Name": "Slightly Stoopid",
   "rawData": [
      "Slightly Stoopid is an American band based in the Ocean Beach neighborhood of San Diego, California, who describe their music as \"a fusion of folk, rock, reggae and blues with hip-hop, funk, metal and punk.\" As a band, they have released thirteen albums (four live), with their ninth studio album entitled Everyday Life, Everyday People on July 13, 2018. The band was originally signed by Bradley Nowell from the band Sublime to his label Skunk Records while still in high school.\n",
      "In 1994 Slightly Stoopid was formed in Ocean Beach, California by Miles Doughty and Kyle McDonald, both childhood friends, as well as high school friend and drummer Adam Bausch. Soon after, Sublime frontman Bradley Nowell discovered the band, asking them to perform in Long Beach, California at the Foot Hill Tavern. Nowell shortly after signed them to his label Skunk Records while the members were still attending high school. In 1996 the band released their first studio album, the punk-tinged Slightly $toopid (featuring a guest appearance by Nowell on the song \"Prophet\" – later covered by Sublime and released on their box set, Everything Under the Sun) and 1998's surf-inspired The Longest Barrel Ride.\n",
      "The group self-released 2001's Acoustic Roots: Live & Direct (a 40-minute acoustic set, captured live at San Diego 's 91X radio station) – the first for their own label, Stoopid Records, before issuing 2003's Everything You Need on Surfdog Records (a musical departure for the band, that sold more than 185,000 copies).\n"
   ],
   "infobox": {
      "Origin": [
         "San Diego, California, U.S."
      ],
      "Genres": [
         "Psychedelic rock, reggae, punk rock, reggae rock,[1] dub, blues, folk"
      ],
      "Years active": [
         "1994–present"
      ],
      "Labels": [
         "Skunk, Stoopid Records, Surfdog Records"
      ],
      "Associated acts": [
         "Sublime, Bob Weir, G. Love, Don Carlos, Karl Denson, Chali 2na"
      ],
      "Website": [
         "slightlystoopid.com"
      ],
      "Members": [
         "Miles Doughty",
         "Kyle McDonald",
         "Ryan Moran",
         "Oguer Ocon",
         "DeLa",
         "Paul Wolstencroft",
         "Andy Geib"
      ],
      "Past members": [
         "Adam Bausch",
         "Kelly Vargas",
         "Dan Lancelot",
         "Paul Vrieling",
         "Damion Ramirez",
         "Doze",
         "C-Money"
      ]
   },
   "albums": [
      "Acoustic Roots: Live & Direct",
      "Winter Tour '05-'06 Live CD/DVD",
      "Live in San Diego",
      "Slightly Stoopid & Friends: Live at Roberto's TRI Studios"
   ]
}