{
   "Name": "The Weirdos",
   "rawData": [
      "The Weirdos are an American punk rock band from Los Angeles, California. They formed in 1976, split-up in 1981, re-grouped in 1986 and have remained semi-active ever since. Critic Mark Deming calls them \"quite simply, one of the best and brightest American bands of punk's first wave.\"\n",
      "The band was formed in 1976 by singer John Denney and his guitarist brother Dix (sons of Hollywood actress Nora Denney), initially using the band names the Barbies and the Luxurious Adults. The Weirdos were originally a 1950s-inspired hard rock and roll band that, like the Ramones in New York City, predated the UK punk scene. While initially trying to distance themselves from the genre name \"punk\" that was created in New York, ultimately the band, in the words of John Denney, \"just kinda became more like this punk ROCK N ROLL type thing and we kinda went with it because the fans wanted it. They wore us down and we just said 'OK, fine! We're punk rock, similar to the Ramones. Whatever you say.'\"\n",
      "In a 1990 Flipside interview, John Denney listed the Ramones, New York Dolls and Iggy Pop as fundamental musical inspirations, adding:\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California"
      ],
      "Genres": [
         "Punk rock"
      ],
      "Years active": [
         "1976–81, 1986-1992, 2004–05, 2013–present"
      ],
      "Labels": [
         "Bomp!, Dangerhouse, Numbskull, Rhino, Frontier"
      ],
      "Associated acts": [
         "The Dickies, the Circle Jerks, the Skulls, Red Hot Chili Peppers, Devo, Wall of Voodoo"
      ],
      "Members": [
         "John Denney",
         "Dix Denney",
         "Jeff Friedl",
         "Bruce Moreland"
      ],
      "Past members": [
         "Cliff Roman",
         "Dave Trout",
         "Nickey \"Beat\" Alexander",
         "Cliff Martinez",
         "Billy Persons",
         "Danny Benair",
         "Willy Williams",
         "Art Fox",
         "Sean Antillon",
         "Zander Schloss"
      ]
   },
   "albums": [
      "Condor",
      "Live on Radio"
   ]
}