{
   "Name": "Youth Brigade (band)",
   "rawData": [
      "Youth Brigade is an American punk rock band formed in Hollywood, Los Angeles, California, United States, in 1980 by the brothers Mark, Adam, and Shawn Stern. The band subsequently founded BYO (Better Youth Organization). Many later punk bands cite Youth Brigade as an influence, including The Nation of Ulysses and The Briefs.\n",
      "Youth Brigade has released five studio albums (counting one released as The Brigade), of which the last was released in 1996. Almost each album was recorded with the original lineup of the Stern brothers (Mark, Adam and Shawn); bassist Bob Gnarly replaced Adam in 1985 during the recording of The Dividing Line, which was released as The Brigade. Adam returned in 1991 (when the band reunited) and contributed to the band's 1992 EP Come Again and their next two albums (Happy Hour and To Sell the Truth) before leaving once again in 2007. Youth Brigade continues to tour to this day, although, other than six new tracks on the 1999 split album BYO Split Series Volume II, they have not released a full-length studio album since To Sell the Truth in 1996.\n",
      "The Stern family, consisting of older brothers Shawn (guitar and vocals) and Mark (drums) and younger brother Adam (who would later play bass), moved from Toronto, Canada to Los Angeles in 1970, because their father worked in the film industry.  As teenagers, Shawn and Mark were surfers who would skip school to smoke marijuana and attend rock concerts. At 16 and 17, they played in their first band, called Mess, which would play Led Zeppelin and Jimi Hendrix covers at parties. A year later in 1978, they discovered punk rock, and formed a quirky prog/New Wave band called The Extremes, releasing a four-song EP in which Shawn would sing with a fake English accent.\n"
   ],
   "infobox": {
      "Also known as": [
         "The Brigade"
      ],
      "Origin": [
         "Hollywood, Los Angeles, California, United States"
      ],
      "Genres": [
         "Punk rock",
         "melodic hardcore",
         "hardcore punk (early)"
      ],
      "Years active": [
         "1980 (1980)–1987 (1987), 1991–present"
      ],
      "Labels": [
         "BYO"
      ],
      "Associated acts": [
         "Royal Crown Revue"
      ],
      "Website": [
         "myspace.com/youthbrigadebyo"
      ],
      "Members": [
         "Shawn Stern",
         "Mark Stern",
         "Adam Stern",
         "John Carey"
      ],
      "Past members": [
         "Greg Louis Gutierrez",
         "Bob Gnarly",
         "Jonny Wickersham",
         "Joey Garibaldi",
         "Mike Carter"
      ]
   },
   "albums": [
      "Sound & Fury",
      "Sound & Fury",
      "The Dividing Line",
      "Happy Hour",
      "To Sell the Truth"
   ]
}