{
   "Name": "The Coup",
   "rawData": [
      "The Coup is an American hip hop band from Oakland, California. Their music is an amalgamation of influences, including funk, punk, hip hop, and soul. Frontman Boots Riley's revolutionarily-charged lyrics rank The Coup as a renowned political hip hop band aligned to radical music groups such as Crass, Dead Prez and Rage Against the Machine.\n",
      "The Coup's music is driven by assertive and danceable bass-driven backbeats overlaid by critical, hopeful, and witty lyrics, often with a bent towards the literary. The Coup's songs critique, observe, and lampoon capitalism, American politics, white patriarchal exploitation, police brutality, marijuana addiction, romance, and disparities among races and social classes.\n",
      "The Coup's debut album was 1991s The EP and almost all of the songs on it (except \"Economics 101\") were put on 1993's Kill My Landlord.  In 1994, the group released its second album, Genocide & Juice. The group took a four-year recording hiatus to work as community activists before releasing Steal This Album to critical acclaim in 1998. The record's title pays tribute to 1960s radical Abbie Hoffman's yippie manifesto, Steal this Book. Steal This Album featured the stand-out single, \"Me and Jesus the Pimp in a ’79 Granada Last Night.\" The online magazine Dusted called Steal This Album \"the best hip-hop album of the 1990s\".\n"
   ],
   "infobox": {
      "Origin": [
         "Oakland, California, United States"
      ],
      "Genres": [
         "Hip hop"
      ],
      "Years active": [
         "1991–Present"
      ],
      "Labels": [
         "Wild Pitch, EMI, Dogday, 75 Ark, Tommy Boy, Warner Bros., Epitaph, ANTI-"
      ],
      "Associated acts": [
         "Street Sweeper Social Club, Dead Prez, Talib Kweli, E-40, Black Thought, Spice-1, Rage Against the Machine, Anti-Flag, Star Fucking Hipsters, Les Claypool, Galactic, Del the Funky Homosapien, Das Racist, Latoya London, Atari Teenage Riot, Killer Mike, Jolie Holland, Joe Henry, Japanther, Vernon Reid"
      ],
      "Members": [
         "Boots Riley",
         "Silk-E",
         "B'nai Rebelfront",
         "Hassan Hurd",
         "J.J. Jungle",
         "L.J. Holoman"
      ],
      "Past members": [
         "E-Roc",
         "T-K.A.S.H.",
         "Latoya London",
         "Grego Simmons",
         "Pam the Funkstress (deceased)",
         "DJO"
      ]
   },
   "albums": [
      "Kill My Landlord",
      "Genocide & Juice",
      "Steal This Album",
      "Party Music",
      "Pick a Bigger Weapon",
      "Sorry to Bother You"
   ]
}