{
   "Name": "Grizzly Bear (band)",
   "rawData": [
      "Grizzly Bear is an American rock band from Brooklyn, New York, formed in 2002. The band consists of Edward Droste (vocals, guitar, keyboards, omnichord), Daniel Rossen (vocals, guitar, banjo, keyboards), Chris Taylor (bass, backing vocals, woodwinds, producer), and Christopher Bear (drums, backing vocals). The band employs traditional and electronic instruments. Their sound has been categorized as psychedelic pop, folk rock, and experimental, and is dominated by the use of vocal harmonies.\n",
      "Grizzly Bear began as a moniker for songwriter Ed Droste's music in the early 2000s. Regarding the band's origins as a solo project, Droste noted, \"It was just like doing a little home project, and I thought \"oh, this is fun, I'm just going to call this stuff Grizzly Bear.  Our name was actually just a nickname for an old boyfriend of mine.\"\n",
      "In 2004, Droste released Grizzly Bear's debut album, Horn of Plenty. Predominately a solo album, the album featured contributions from future drummer Christopher Bear. Rolling Stone magazine wrote of the first album, \"the pure atmospheric power of the songs is more than enough to hypnotize.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Brooklyn, New York, US"
      ],
      "Genres": [
         "Indie rock[1]",
         "folk rock",
         "psychedelic pop",
         "neo-psychedelia[1]",
         "art rock",
         "experimental"
      ],
      "Years active": [
         "2002–present[2]"
      ],
      "Labels": [
         "Kanine",
         "Warp",
         "RCA"
      ],
      "Associated acts": [
         "Department of Eagles",
         "Miles Benjamin Anthony Robinson",
         "Body Meat"
      ],
      "Website": [
         "grizzly-bear.net"
      ],
      "Members": [
         "Ed Droste",
         "Daniel Rossen",
         "Chris Taylor",
         "Christopher Bear"
      ]
   },
   "albums": [
      "Horn of Plenty",
      "Yellow House",
      "Veckatimest",
      "Shields",
      "Painted Ruins"
   ]
}