{
   "Name": "Sheer Terror",
   "rawData": [
      "Sheer Terror are an American hardcore punk band from New York City. The band was one of the first to combine elements of heavy metal with a hardcore punk base, pioneering a heavier style of hardcore that would create many bands in the following decades. Formed in late 1984, the band stayed together until 1998, through numerous lineup changes and shifts in musical style. In October 2004, the band reunited and gave two shows at New York City's CBGB Club.\n",
      "The band first came into existence in December 1984 when former Fathead Suburbia vocalist Paul Bearer answered an ad in the Village Voice for a hardcore punk singer. Filling out the original lineup was guitarist Alan Blake, bassist Baron \"Barry\" Misuraca, and drummer Sam \"Reid\" Lohman. The band was featured on the 1985 One Big Crowd compilation, and released two cassette demos, No Grounds For Pity and Fall From Grace. Soon after the band broke up due to personality conflicts. Afterwards, Bearer would spend some time in southern California before returning to New York, where he reformed Sheer Terror with Blake, adding Mark Neuman on bass and Jason Martin on drums.\n",
      "The band soon after began a longtime association with Blackout Records, who released some of their songs on the label's compilation Where the Wild Things Are, in 1989, along with a 7 inch Live At CBGB release. The following year, the band recorded their debut full length Just Can't Hate Enough. The record was engineered by Tommy Victor of Prong. As Victor also worked at CBGB, he was able to allow the band to record live at the famous bar in the morning and afternoon hours before shows were held. The record was released in Germany on Starving Missile Records, and later released stateside under the Blackout name. Just Can't Hate Enough quickly became one of the records that defined the new, heavier sound of hardcore that was emerging at the time, played by bands such as Biohazard and Killing Time, among others. The guitar tone and riffs, in particular, display a large heavy metal influence, especially from Swiss speed metallers Celtic Frost, who were allegedly one of Alan Blake's favorite bands. The band also became known for Bearer's no-nonsense stage personality, with some finding him offensive, and others enjoying his often blunt and obscenity filled humor.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, U.S."
      ],
      "Genres": [
         "Hardcore punk, crossover thrash[1]"
      ],
      "Years active": [
         "1984–1998, 2004, 2010–present"
      ],
      "Labels": [
         "Blackout"
      ]
   },
   "albums": [
      "Just Can't Hate Enough",
      "Ugly and Proud",
      "Thanks Fer Nuthin",
      "Old, New Borrowed, and Blue",
      "Love Songs For The Unloved",
      "Standing Up for Falling Down",
      "Unheard Unloved"
   ]
}