{
   "Name": "Weep (band)",
   "rawData": [
      "Weep is an American rock band from New York City whose music combines elements of ethereal wave, gothic rock, shoegaze, post-punk and synthpop. Formed in 2008 by singer and guitarist Eric \"Doc\" Hammer (formerly of Requiem in White and Mors Syphilitica, and writer and voice actor for the animated television series The Venture Bros.), the band's lineup also includes bass guitarist Fred Macaraeg, keyboardist Alex Dziena and drummer Bill Kovalcik. Their debut EP, Never Ever, was released in 2008 by Hammer's Astro-Base Go company and Projekt Records, followed by the full-length albums Worn Thin (2010), Alate (2012) and Weep (2014).\n",
      "Weep's music has been described as dark and expansive, with \"shimmering guitars and spacy synthesizers\". Hammer's singing voice has been noted for its gravelly, robotic qualities which provide a counterpoint to the lush song arrangements. Critics have compared the band to a number of post-punk, alternative rock and shoegaze acts of the 1980s and 1990s.\n",
      "Prior to forming Weep, Hammer had performed in the gothic rock acts Requiem in White (from 1985 to 1995) and Mors Syphilitica (from 1995 to 2002), both with his then-wife Lisa Hammer on vocals. Over the next several years, he continued to write music, while also working as a writer and voice actor on the animated television series The Venture Bros., beginning in 2004.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City"
      ],
      "Genres": [
         "Ethereal wave, gothic rock, shoegaze, synthpop"
      ],
      "Years active": [
         "2008 (2008)–present"
      ],
      "Labels": [
         "Astro-Base Go, Projekt, Organs of Generation"
      ],
      "Associated acts": [
         "Requiem in White, Mors Syphilitica"
      ],
      "Website": [
         "myspace.com/weeptheband"
      ],
      "Members": [
         "Doc Hammer",
         "Fred Macaraeg",
         "Alex Dziena",
         "Bill Kovalcik"
      ]
   },
   "albums": [
      "Worn Thin",
      "Alate",
      "Weep",
      "Too Much Nothing"
   ]
}