{
   "Name": "Ismail and Junaid",
   "rawData": [
      "Ismail and Junaid (Pashto: اسماعیل او جنید‎) is a Pashto musical band originating from Peshawar, Khyber Pakhtunkhwa The band consists of two members - Ismail Khan, the lead vocalist, poet and composer and Junaid Javed, a guitarist, composer and supporting vocalist.\n",
      "Ismail was born in Peshawar in a family of political background hailing from Charsadda. Junaid is described as hailing from a \"multicultural background\".\n",
      "Ismail and Junaid, both university students and college friends, were originally amateur artists who performed in front of friends and social circles. After receiving wide exposure and appreciation of their musical talent, the duo decided to take their music to the next level and formed a professional band. Ismail and Junaid achieved first position in the All Pakistan Battle of the Bands contest at the Lahore University of Management Sciences (LUMS) in 2010. After forming their band, they debuted by soon releasing their first official song Qarar, a Pashto single. The song has been their most successful release till date and the duo achieved overnight fame following its release; the official music video of the song has acquired hundreds and thousands of views on YouTube and was ranked as the second best Pashto song of all times by the Pashto Cultural Society. It was able to achieve popularity even outside the country and in the non-Pashtun Pakistani mainstream music audiences. The track hit radio and T.V channels all over the country and Goher Mumtaz, the lead guitarist of the pop rock band Jal, personally approached the duo to express his liking of the song.\nIn 2011, they released yet another song, Ranra (meaning \"light\"), an alternative folk single which is also in Pashto and is breaking the records of Qarar as the fastest shared Pashto song on social websites.\n"
   ],
   "infobox": {
      "Origin": [
         "Peshawar, Khyber Pakhtunkhwa, Pakistan."
      ],
      "Genres": [
         "Pashto, alternative folk, Sufi"
      ],
      "Years active": [
         "2010-present"
      ],
      "Members": [
         "Ismail Khan",
         "Junaid Javed"
      ]
   },
   "albums": []
}