{
   "Name": "Cincinnati Caledonian Pipes and Drums",
   "rawData": [
      "Cincinnati Caledonian Pipes and Drums is a pipe band based in Cincinnati, Ohio. They have been honored to play for The Black Watch, share a stage with Rod Stewart, play the half time show for the Cincinnati Bengals, and perform at the Cincinnati Celtic Festival since it started in the early 1990s. The band has led the Cincinnati St. Patrick’s Day parade since at least 1969. Their big event each year is the annual Tartan Day Cèilidh held in conjunction with National Tartan Day in early April.\n",
      "The Cincinnati Caledonian Pipes and Drums was first formed around 1912, making it one of the oldest bands in the United States, by a Scottish immigrant, William Lorne Nimmo, whose family first moved to Canada then to Cincinnati. William Nimmo was a Lieutenant in the police force. After moving to Cincinnati, Nimmo set about putting together a pipe band, and as he states in his autobiography “I organized a pipe band, assisted by some good businessmen of the Caledonian Society.” When the band was first started, it had some 20 members. During World War I the band gained much notoriety by leading weekly parades supporting the war effort and Liberty Bond drives, visiting the training camps, hospitals, Red Cross and other affairs in the interest of building up morale. It was after World War I when a number of veterans from the Seaforth Highlanders regiment, now known as The Highlanders (Seaforth, Gordons and Camerons), joined the band that it adopted the Mackenzie tartan and the regimental hat badge (a stag's head with the motto Cuidich n'Righ – Support the King) both of which are still proudly worn today. In the 1930s, some of the members spent considerable time traveling the States in a converted Chevy school bus they referred to as \"the Wee Hoose\" complete with a grand set of great highland antlers attached to the front grill.\n",
      "In the 1950s, the band was given new life under the direction of pipe major Alvin Spivak, and once again support from the Caledonian Society of Cincinnati, which provided money for new uniforms and two sets of bagpipes. Included in the roster was piper Lomond Nimmo, son of the founder, William. In 1965, the band made 37 appearances including the Ohio State Fair. In 1968, the band led the St. Patrick's Day Parade. Since then, the band has continuously played various events including an annual Tartan Ball, held in the 1970s and 80s, the St. Andrew's Day Celebration held by the Caledonian Society of Cincinnati, and other annual and one time events. At that time, the band changed its name to the Caledonian Pipes, Drums and Dancers, as the band included a thriving dance section which was incorporated into all its performances and marched behind the drummers.  The 1980s saw the band begin attending competitions at Highland Games. In the mid-1990s, the band began re-building a competition unit. Very soon after, they fielded 3 units including a grade 5, grade 4, and grade 5 youth band. After leadership changes in 1999–2000, they fielded a grade 4 competition band under the direction of P/M Mike Rackers, finishing 4th at Glengarry Highland Games (the North American Championships) in Ontario.\n"
   ],
   "infobox": {
      "Established": [
         "c. 1912"
      ],
      "Location": [
         "Cincinnati, Ohio"
      ],
      "Grade": [
         "5"
      ],
      "Pipe major": [
         "Karen May"
      ],
      "Drum sergeant": [
         "Jeff Craig"
      ],
      "Tartan": [
         "muted MacKenzie"
      ],
      "Website": [
         "www.cincypipesanddrums.org"
      ]
   },
   "albums": []
}