{
   "Name": "Pink Military",
   "rawData": [
      "Pink Military (originally Pink Military Stand Alone) were a post-punk band from Liverpool. Led by former Big in Japan singer Jayne Casey, other band members included former Deaf School drummer Tim Whitaker, guitarist Martin Dempsey who also played in Yachts and It's Immaterial and drummers Chris Joyce (who also played in The Durutti Column and Simply Red) and Budgie (who went on to The Slits and Siouxsie and the Banshees).\n",
      "After Big In Japan split up in summer 1978, singer Jayne Casey formed Pink Military along with John Highway (guitar), Wayne Wadden (bass guitar), Paul Hornby (drums), and Nicky Cool (born Nicky Hillon, keyboards). The band mixed punk-influenced rock with elements of disco and reggae. Their first release was the \"Buddha Waking / Disney Sleeping\" single in February 1979. This was the only release from the original line-up, as in the months that followed Wadden, Hornby and Highway all left, with Peter Lloyd, Steve Torch, Tim Whitaker (ex-Deaf School), and Martin Dempsey (formerly of Yachts) making up the next settled line-up. The band were then picked up by the 'Eric's' label (associated with the club of the same name), with the Blood and Lipstick EP released in September that year. Further line-up changes followed, with Whitaker and Torch replaced by Mothmen drummer Chris Joyce, Charlie Gruff (Charlie Griffiths), and Neil Innes. John Peel gave the band his support and they recorded two sessions for his BBC Radio 1 show, the first in November 1979, featuring Budgie on drums, the second in May 1980. The band's only album, Do Animals Believe in God? was released in June 1980, with the band having signed a deal with Virgin Records who acted as distributors. A further single was released the next month, and proved to be the final release before the band split up in 1981. Casey went on to form Pink Industry, while Dempsey joined It's Immaterial and later the Mel-o-Tones. Joyce joined The Durutti Column and later played in Simply Red.\n"
   ],
   "infobox": {
      "Also known as": [
         "Pink Military Stands Alone"
      ],
      "Origin": [
         "Liverpool, England"
      ],
      "Genres": [
         "Post-punk"
      ],
      "Years active": [
         "1978–1981"
      ],
      "Labels": [
         "Eric's"
      ],
      "Associated acts": [
         "Big in Japan, Pink Industry"
      ],
      "Past members": [
         "Jayne Casey",
         "Nicky Cool",
         "John Highway",
         "Wayne Wadden",
         "Peter Lloyd",
         "Paul Hornby",
         "Steve Torch",
         "Tim Whitaker",
         "Roy White",
         "Martin Dempsey",
         "Chris Joyce",
         "Charlie Gruff",
         "Budgie",
         "Dave Baynton-Power"
      ]
   },
   "albums": [
      "Do Animals Believe in God?"
   ]
}