{
   "Name": "Jellyfish (band)",
   "rawData": [
      "Jellyfish was an American rock band formed in San Francisco in 1989. Led by songwriters Andy Sturmer (drums, vocals) and Roger Manning (keyboards, vocals), the group was known for their blend of 1970s classic rock and XTC-style power pop. They released two albums, Bellybutton (1990) and Spilt Milk (1993), that proved highly influential to artists in a similar vein.\n",
      "Sturmer and Manning met in high school and shared an admiration for jazz, post-punk, and British pop music. Following a stint as members of Beatnik Beatch, they quit the group to continue songwriting with one another and formed Jellyfish. They were initially supported by Jason Falkner (guitar) and Roger's brother Chris (bass). After the tour for Bellybutton, those musicians were replaced by Tim Smith (bass) and Eric Dover (guitar). The group viewed Spilt Milk as their \"masterpiece\" and the fulfillment of their original grandiose vision for the band, emphasizing bombasticity, vocal harmonies, orchestration, and studio experimentation.\n",
      "Jellyfish broke up in 1994 due to poor record sales, Sturmer's discomfort with his role as frontman, and artistic conflicts between the two songwriters. Manning subsequently formed Imperial Drag, with Dover, and pursued careers as a solo artist and session musician. Sturmer worked with the Japanese pop duo Puffy AmiYumi and has kept a low public profile. In 2017, Manning, Dover, and Smith reformed as the Lickerish Quartet.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, U.S."
      ],
      "Genres": [
         "Power pop[1]",
         "pop rock[1]",
         "psychedelic pop[2]",
         "indie rock[1]",
         "progressive pop[3]"
      ],
      "Years active": [
         "1989–1994"
      ],
      "Labels": [
         "Charisma"
      ],
      "Associated acts": [
         "Beatnik Beatch",
         "Imperial Drag",
         "The Lickerish Quartet",
         "TV Eyes"
      ],
      "Past members": [
         "Andy Sturmer",
         "Roger Manning",
         "Jason Falkner",
         "Chris Manning",
         "Tim Smith",
         "Eric Dover"
      ]
   },
   "albums": [
      "Brighter Day A Jellyfish Story"
   ]
}