{
   "Name": "Sōnan",
   "rawData": [
      "\"Sōnan\" (遭難, \"A Distress\"), is the second single by Japanese rock band Tokyo Jihen, led by musician Ringo Sheena. It was released on October 20, 2004, a month after their debut single \"Gunjō Biyori\", and a month before their debut album Kyōiku.\n",
      "Tokyo Jihen was first formed in 2003, after Ringo Sheena decided on members for her backing band for her Sugoroku Ecstasy tour. The band was officially announced as Sheena's main musical unit on May 31, 2004, and first performed at a series of summer music festivals: Meet the World Beat 2004 on July 25, 2004 at the Expo Commemoration Park in Osaka, July 30, 2004 at the Fuji Rock Festival in Niigata, and September 3, 2004 at the Fukuoka Sunset Live festival. The group released their debut single \"Gunjō Biyori\" in September 2004, to commercial success: it reached number two on Oricon's single chart, and was certified gold by the RIAJ.\n",
      "All 17 of the songs for the Kyōiku era were recorded over a period of four days. \"Sōnan\" was written entirely by Sheena. The song \"Dynamite\" was originally performed by American singer Brenda Lee in 1957. Much like the songs on Sheena's cover album Utaite Myōri: Sono Ichi, it was a song that Sheena's parents owned at their home. Her father had wondered why she had not recorded it for Utaite Myōri: Sono Ichi. The liner notes for \"Kokoro\" list a date, November 25, 2003. This is the date of Sheena's 25th birthday, and was the release date for her solo single \"Ringo no Uta\". The song's concept was record a song in a single day as a present for others on her birthday. The song was given the figurative translation \"Spiritual\" in English.\n"
   ],
   "infobox": {
      "B-side": [
         "\"Dynamite\"",
         "\"Kokoro\""
      ],
      "Released": [
         "October 20, 2004 (2004-10-20)"
      ],
      "Recorded": [
         "2004"
      ],
      "Genre": [
         "Alternative rock, pop-rock"
      ],
      "Length": [
         "3:23"
      ],
      "Label": [
         "Toshiba EMI"
      ],
      "Songwriter(s)": [
         "Ringo Sheena"
      ]
   },
   "albums": []
}