{
   "Name": "Senkō Shōjo",
   "rawData": [
      "\"Senkō Shōjo\" (閃光少女, \"Flash Girl\") (also known by its English title \"Put Your Camera Down\") is a song by the Japanese band Tokyo Jihen. It was released on November 16, 2007, as a promotional track from their vinyl extended play Variety Zōkangō and music video clips DVD Senkō Shōjo, and was later added to their 2010 album Sports.\n",
      "The song was released directly after Variety (2007), an album where the other band members other than Ringo Sheena served as the songwriters. The cover work is in the same style as Variety and its singles \"OSCA\" and \"Killer-tune.\" Previously, Seiji Kameda had worked on the songs \"Superstar\" and \"Tōmei Ningen\" from Adult (2006), and \"Shiseikatsu\" from Variety.\n",
      "The song featured lyrics written by Ringo Sheena, and music by Seiji Kameda. It was recorded during sessions for Variety, and was performed during their Spa & Treatment tour in October and November 2007. It was originally titled \"Hood\" (フード) during demo sessions. Kameda was inspired to write the song after seeing a pre-teen girl walking home late at night, with her jacket hood up. Kameda wondered what her future would be like, and created the melody for the song. The first version recorded was \"Put Your Camera Down,\" an English version with lyrics written by Robbie Clark That version was later featured on the Variety Zōkangō vinyl, as well as on the Senkō Shōjo DVD credits. It was eventually released to CD in 2013, on Tokyo Jihen's Hard Disk box set.\n"
   ],
   "infobox": {
      "Released": [
         "October 18, 2007 (2007-10-18)"
      ],
      "Recorded": [
         "2007"
      ],
      "Genre": [
         "Pop-rock, Rock"
      ],
      "Length": [
         "2:59"
      ],
      "Label": [
         "EMI Music Japan"
      ],
      "Songwriter(s)": [
         "Ringo Sheena, Seiji Kameda, Robbie Clark (English version)"
      ],
      "Producer(s)": [
         "Tokyo Jihen"
      ]
   },
   "albums": []
}