{
   "Name": "Eskorbuto",
   "rawData": [
      "Eskorbuto are a punk band from Santurtzi (Greater Bilbao, Basque Autonomous Community, Spain) that formed in 1980. They have been one of the most influential bands for Spanish and Latin American punk rock. They are known for their strong attitude and crude lyrics. They were one of the first bands to perform punk with lyrics in Spanish. Eskorbuto is a modified word taken from escorbuto (scurvy in Spanish).\nAlong with the band La Polla Records, Eskorbuto has been very influential in the Spanish rock and punk scene.\n",
      "By 2015, Pako Galán announced that the band come back to performing again. In May 2016, the new line-up is presented with Ali Kalaña (bass and lead vocals) and Naty Penadas (guitar and backing vocals) and Pako as the only continuous member.\n",
      "Born in Nervión, Santurtzi. Influence by the punk explosion of 1977 they started playing around 1980, the line up consisted of Iosu Expósito on guitar and vocals (declared fan of The Who, The Kinks, The Rolling Stones and the Sex Pistols) and Juanma Suarez on bass and vocals (who didn't really listen to music) later to be joined by Pako Galán on drums. They gave their first concert in a school near their rehearsal space with the audience being a group of 10-year-olds.\n"
   ],
   "infobox": {
      "Origin": [
         "Santurtzi, Vizcaya (Spain)"
      ],
      "Genres": [
         "Punk rock",
         "Hardcore punk",
         "Alternative rock"
      ],
      "Years active": [
         "1980–1999",
         "2015–present"
      ],
      "Labels": [
         "Spansuls",
         "Dro",
         "Discos Suicidas",
         "Butoeskor",
         "Oihuka"
      ],
      "Associated acts": [
         "Zarama, RIP, Speed"
      ],
      "Members": [
         "Principal (1982–92) ",
         "Iosu Expósito†  ",
         "Juanma Suárez† ",
         "Pako Galán ",
         "Other",
         "Urko Igartiburu ",
         "Miguel ",
         "Iñaki \"Gato\" ",
         "Garlopa ",
         "Sergio ",
         "Alik ",
         "Kañas ",
         " Layky"
      ]
   },
   "albums": [
      "Eskizofrenia",
      "Anti Todo",
      "Los demenciales chicos acelerados",
      "Las más macabras de las vidas",
      "Demasiados enemigos...",
      "Aki no keda ni dios",
      "Kalaña",
      "Dekadencia"
   ]
}