{
   "Name": "Stravaganzza",
   "rawData": [
      "Stravaganzza is a metal band from Madrid, Spain formed in 2004. The band has released four studio albums and one EP. They combine elements of extreme metal such as gothic metal, death metal, doom metal and black metal with heavily orchestrated symphonic metal and progressive/power metal.\n",
      "Stravaganzza became a consolidated band in 2003. The first precursor to Stravaganzza is without a doubt the band that Pepe Herrero (guitar) and Leo Jiménez (vocals) founded in 1993 and which later would be joined by Patricio Babasasa as a drummer: Krysálida, with an instrumental group just the same as in Stravaganzza (including violin and keyboards), but adding a second vocalist who sang the guttural parts. With that lineup they had already made a similar style to Stravaganzza, with obscure parts, orchestral passages but perhaps a bit more complex and anti-commercial; maybe this was the cause of it not being very understood and accepted, which would lead to it breaking up about four years later. \n",
      "After Krysálida, Leo formed with Patricio Babasasa (drums) and Edu Fernández (bass) Azabel, a band with a more aggressive style, close to death, and it was at this time when the idea of making a version of Mecano's song \"Hijo de la luna\" was brought up, a proposal that Stravaganzza would bring to life ten years later. Azabel dissolved after Leo's departure to well-known heavy metal band Saratoga, in which he would at last get recognition, fame and prestige, and where he would stay for eight years. On his side, Pepe Herrero, after abandoning Krysálida, wouldn't participate in any musical group until 2000, in which he founded Eklectika, a personal project in which, among others, he would compose some of the songs that later would appear on Stravaganzza's first album. \n"
   ],
   "infobox": {
      "Origin": [
         "Madrid, Spain"
      ],
      "Genres": [
         "Gothic metal, symphonic metal, progressive metal"
      ],
      "Years active": [
         "2004–2010",
         "2017–present"
      ],
      "Labels": [
         "Avispa"
      ],
      "Associated acts": [
         "Saratoga"
      ],
      "Website": [
         "Stravaganzza.com"
      ]
   },
   "albums": []
}