{
   "Name": "Sodagreen",
   "rawData": [
      "Sodagreen (Chinese: 蘇打綠; pinyin: Sūdǎ lǜ; stylized as sodagreen) is a Taiwanese indie band formed in 2001. Its members have been unchanged since 2003. Sodagreen emerged in the Taiwanese indie music scene after receiving the Grand Jury Award in the Hohaiyan Gongliau Rock Festival in 2004, after which it signed a contract with Willlin Music. The band is the first indie band to hold a concert in the Taipei Arena.\n",
      "Sodagreen was named by Shih, the band's leader at the time, and Wu, the lead vocalist. The band was originally named Soda (蘇打), but Shih preferred a name with three-syllable. Wu then affixed the word green (綠), his favourite colour, behind Soda, completing the portmanteau.\n",
      "In May 2001,  Sodagreen competed in the Golden Melody Cup held by the National Chengchi University and won the Best Popularity award with the composition \"Peeping\". With the support of Shiao-Ying, a judge at the competition, it recorded \"Peeping\" for the compilation Taiwan independent compilation 2001, released by TCM. In April the next year, after several changes to the line-up of the band (guitarists), Sodagreen participated in the Golden Melody Cup again, this time winning the awards for Best Band, Best Composition, Best Lyrics and Best Music.\n"
   ],
   "infobox": {
      "Also known as": [
         "Oaeen"
      ],
      "Origin": [
         "Taiwan"
      ],
      "Genres": [
         "Indie pop",
         "indie rock",
         "Mandopop"
      ],
      "Years active": [
         "2003 (2003)–present"
      ],
      "Labels": [
         "Willlin",
         "Universal"
      ],
      "Website": [
         "www.sodagreen.com"
      ],
      "Members": [
         "Wu Tsing-Fong",
         "Liou Jia-Kai",
         "Ho Jing-Yang",
         "Gong Yu-Chi",
         "Shie Shin-Yi",
         "Shih Jyun-Wei"
      ],
      "Traditional Chinese": [
         "魚丁糸"
      ],
      "Simplified Chinese": [
         "鱼丁糸"
      ]
   },
   "albums": [
      "Sodagreen",
      "Little Universe",
      "Incomparable Beauty",
      "Daylight of Spring",
      "Summer/Fever",
      "What is Troubling You",
      "Autumn: Stories",
      "Winter Endless"
   ]
}