{
   "Name": "The Phenomenauts",
   "rawData": [
      "The Phenomenauts are a musical band from Oakland, California that combine several styles of music with a futuristic science fiction theme. Their sound uses elements from rock and roll, punk, glam, garage rock and new wave styles of music. They call their style \"rocket roll\".\n",
      "The band is known for throwing sudden, unexpected shows at places where they are not invited. They often play in front of existing concerts where crowds have already gathered. They gained notoriety in 2003 for sneaking into the Warped Tour, following the tour in their own vehicle and performing at each stop for several weeks.\n",
      "The Phenomenauts perform under a space and science fiction persona. Each band member uses a stage name and dress in uniform. Most of the band's songs revolve around science, space, robots, and the future. The band has even decorated their vehicles to match their theme. Their live shows often feature special effects like clouds of smoke or lasers, and they are known to shoot toilet paper into the crowd and set their drum cymbals on fire.\n"
   ],
   "infobox": {
      "Origin": [
         "Oakland, California, United States"
      ],
      "Genres": [
         "Psychobilly, punk rock, new wave, surf rock"
      ],
      "Years active": [
         "2000–present"
      ],
      "Labels": [
         "Arlington Lab, Springman, Silver Sprocket"
      ],
      "Associated acts": [
         "Epoxies, Devo, Peelander-Z"
      ],
      "Website": [
         "phenomenauts.com"
      ],
      "Members": [
         "Leftenant AR-7",
         "Major Jimmy Boom",
         "Lunar Captain Ripley Clipse",
         "Chief Engineer Atom Bomb"
      ],
      "Past members": [
         "Corporal JoeBot",
         "Corporal JoeBot 2.0",
         "Fritz M. Static",
         "Captain Chreehos",
         "Deck Chief Nick Wayzar",
         "Professor Greg Arius",
         "Chaos Agent Ion O'Clast",
         "Angel Nova"
      ]
   },
   "albums": [
      "Rockets And Robots",
      "Mission Transmission",
      "Re-Entry",
      "Electric Sheep",
      "Pre-Entry",
      "Re-Entry",
      "Re-Entry",
      "Beyond Warped Live Music Series",
      "For All Mankind",
      "Electric Sheep",
      "Escape Velocity",
      "I'm with Neil"
   ]
}