{
   "Name": "Rancid (band)",
   "rawData": [
      "Rancid is an American punk rock band formed in Berkeley, California in 1991. Founded by former members of the band Operation Ivy, Rancid is often credited as being among the wave of bands that revived mainstream interest in punk rock in the United States during the mid-1990s. Over their 30-year career, Rancid remained signed to an independent record label and retained much of its original fan-base, most of which was connected to its underground musical roots.\n",
      "Rancid has had two lineup changes since its inception, with Tim Armstrong and Matt Freeman being the only continuous members. Their current lineup consists of Armstrong on guitar and vocals, Freeman on bass and vocals, Lars Frederiksen on guitar and vocals, and Branden Steineckert on drums. The band was formed by Armstrong, Freeman, and former drummer Brett Reed, who left the band in 2006 and was replaced by Steineckert. This lineup recorded their first album, with Frederiksen joining the band on their subsequent tour.\n",
      "To date, Rancid has released nine studio albums, one split album, one compilation, two extended plays, and a series of live online-only albums, and has been featured on a number of compilation albums. The band has independently sold over four million records worldwide, making it one of the most successful independent punk rock groups of all time. The band rose to fame in 1994 with its second studio album, Let's Go, featuring the single \"Salvation\". In the following year, Rancid released its highly successful album ...And Out Come the Wolves, which produced its best-known songs \"Roots Radicals\", \"Ruby Soho\", and \"Time Bomb\", and was certified gold and platinum by the RIAA, selling over one million copies in the United States alone. Its next five albums – Life Won't Wait (1998), Rancid (2000), Indestructible (2003), Let the Dominoes Fall (2009), and ...Honor Is All We Know (2014) – were also critically acclaimed, though not as successful as ...And Out Come the Wolves. Their most recent studio album, Trouble Maker, was released on June 9, 2017, and they are currently working on a follow-up album for a tentative 2021 or 2022 release.\n"
   ],
   "infobox": {
      "Origin": [
         "Berkeley, California, U.S."
      ],
      "Genres": [
         "Punk rock[1]",
         "ska punk[2]",
         "street punk[3][4]",
         "pop punk[5][6]"
      ],
      "Years active": [
         "1991 (1991)–present"
      ],
      "Labels": [
         "Hellcat",
         "Epitaph",
         "Lookout!",
         "Pirates Press",
         "Warner Bros."
      ],
      "Associated acts": [
         "Operation Ivy",
         "Green Day",
         "Downfall",
         "The Used",
         "Transplants",
         "Lars Frederiksen and the Bastards",
         "Tim Timebomb and Friends",
         "Devils Brigade",
         "Social Distortion",
         "The Old Firm Casuals",
         "Shaken 69",
         "U.K. Subs",
         "The Silencers",
         "Basic Radio",
         "Auntie Christ",
         "MDC",
         "The Interrupters"
      ],
      "Website": [
         "rancidrancid.com"
      ],
      "Members": [
         "Tim Armstrong",
         "Matt Freeman",
         "Lars Frederiksen",
         "Branden Steineckert"
      ],
      "Past members": [
         "Brett Reed"
      ]
   },
   "albums": [
      "Rancid",
      "Let's Go",
      "...And Out Come the Wolves",
      "Life Won't Wait",
      "Rancid",
      "Indestructible",
      "Let the Dominoes Fall",
      "...Honor Is All We Know",
      "Trouble Maker"
   ]
}