{
   "Name": "Mother Love Bone",
   "rawData": [
      "Mother Love Bone was an American rock band that formed in Seattle, Washington, in 1988. The band was active from 1988 to 1990. Frontman Andrew Wood's personality and lyrics helped to catapult the group to the top of the burgeoning late 1980s/early 1990s Seattle music scene. Wood died only days before the scheduled release of the band's debut album, Apple, thus ending the group's hopes of success. The album was finally released a few months later.\n",
      "As well as being influential to grunge, they are also considered early pioneers in the alternative metal genre.\n",
      "Mother Love Bone was established in 1987 by ex-Green River members Jeff Ament, Bruce Fairweather and Stone Gossard, ex-Malfunkshun frontman Andrew Wood and ex-Ten Minute Warning and Skin Yard drummer Greg Gilmore. Initially, the group was formed in 1987 out of the cover band Lords of the Wasteland which featured Wood, Gossard, Ament and Malfunkshun drummer Regan Hagar. By early 1988 the band had added Fairweather, replaced Hagar with drummer Greg Gilmore and changed its name to Mother Love Bone.\n"
   ],
   "infobox": {
      "Also known as": [
         "Lords Of The Wasteland"
      ],
      "Origin": [
         "Seattle, Washington, USA"
      ],
      "Genres": [
         "Grunge[1]",
         "alternative rock[2]",
         "hard rock[3]",
         "alternative metal[4]",
         "glam punk[5]"
      ],
      "Years active": [
         "1988–1990",
         "(partial reunions: 2010, 2018)"
      ],
      "Labels": [
         "Stardog, Mercury"
      ],
      "Associated acts": [
         "Malfunkshun",
         "10 Minute Warning",
         "Green River",
         "Skin Yard",
         "Love Battery",
         "Soundgarden",
         "Temple of the Dog",
         "Pearl Jam",
         "Brad",
         "Three Fish"
      ],
      "Past members": [
         "Jeff Ament",
         "Bruce Fairweather",
         "Greg Gilmore",
         "Stone Gossard",
         "Andrew Wood",
         "Regan Hagar"
      ]
   },
   "albums": []
}