{
   "Name": "The Faction",
   "rawData": [
      "The Faction was an American hardcore punk band from San Jose, California. Pioneers of the skate punk era during the early 1980s, their primary stint being from Halloween 1982 until Halloween 1985, The Faction were one of the first bands whose music and lifestyle tastes centered on punk rock and skateboarding. An early demo tape had these words inscribed on the label: \"Music By Skaters For Skaters.\" All original band members and their subsequent replacements are accomplished skateboarders, most notably bass and guitar player and legendary professional skateboarder Steve Caballero. In the early years of the band Caballero was instrumental in attracting a large following of skateboarders to the band. Lead singer Gavin O'Brien was also a notable skateboarder, popular at local Winchester Skatepark. Drummer Craig Bosch has a skateboard trick named after him, \"the Bosch\" aka invert to blunt. Pro skateboarder Jeff Kendall would also play with The Faction during a brief reunion in 1989.\n",
      "During 1982, The Faction's practice sessions began to take place in between ramp sessions at the Caballero home. There, local skaters gathered to skate \"Cab's\" backyard vert ramp and hang out. An early line up before the name \"The Faction\" was chosen included Steve Caballero, Gavin O'Brien, Craig Bosch, and Russ Wright. This lineup only lasted through a couple of practices when Craig Bosch left to join local punk band The Unaware. Bosch was replaced by Adam Segal who Steve and Gavin knew from Winchester Skate Park. Another local skater Craig Ramsey offered to manage the band under his production company Faction Productions. Discussions about a band name lead quickly to the adoption of Craig's production company name for the band itself. After recording a single demo of \"Spineless Majority\" with this line up, Adam switched to guitar and was replaced by drummer Keith Rendon. Russ Wright eventually left the band when his stepfather \"The Captain\" insisted Russ attend military school in Chico, California, leaving The Faction to carry on as a foursome. The band continued to perform during skate sessions at Cab's house and eventually landed their first gig opening for Social Distortion at San Jose City College, December 3, 1982. Early gigs were also played at San Francisco clubs Mabuhay Gardens and On Broadway. Practice sessions moved from Cab's house to Segal's home in south San Jose.  At this point the band's career began to take flight.\n",
      "The Faction's music is punk centered with strong emphasis on guitars. Prior to releasing anything official, the band recorded themselves to cassette tape and made copies to give to friends and fans at gigs. The earliest practice tapes are the only recordings of the first line up to bear The Faction band name, Steve, Gavin, Russ, Adam and Keith. Of those tapes, several tracks appeared on the compilation cassette-only release Growing Pains, which also featured Los Olvidados, Executioner, Ribzy, The Bruces, The Unaware, Grim Reality and Whipping Boy. After Russ left the band, another such tape, the Room 101 demo, was released in 1983. These songs were recorded by Adam on 4-track cassette at Steve's house with amps in separate bedrooms.\n"
   ],
   "infobox": {
      "Origin": [
         "San Jose, California, U.S."
      ],
      "Genres": [
         "Skate punk, hardcore punk, punk rock"
      ],
      "Years active": [
         "1982–1985, 1989, 2001–2005, 2014"
      ],
      "Labels": [
         "IM Records (band label)"
      ],
      "Members": [
         "Gavin O'Brien",
         "Steve \"Cab\" Caballero",
         "Adam \"Bomb\" Segal",
         "Keith Rendon",
         "Ray Stevens, II"
      ]
   },
   "albums": []
}