{
   "Name": "The Biscuit Burners",
   "rawData": [
      "The Biscuit Burners are an Original bluegrass /Americana band from Weaverville, North Carolina (United States); they are on hiatus as of 2009.\n",
      "The Biscuit Burners began around a kitchen table, with friends, dogs and musicians roaming in and out of their Asheville, North Carolina home. Early founding member Lizzie Hamilton had previously worked with Steep Canyon Rangers. As lore has it, a few biscuits did get burned during the making of this award winning band that stole the hearts of many during their time together.  Beginning as an all-female group, the band quickly morphed into the core four of Mary Lucey (bass and vocals), Shannon Whitworth (guitar, clawhammer and vocals), Billy Cardine (dobro and banjo) and Dan Bletz (acoustic guitar).\n",
      "The Biscuit Burners quickly established themselves.  Along with being showcased at the IBMA Conference and appearing at the Historic Ryman Auditorium with Vassar Clements and Rhonda Vincent, they had their debut album, 'Fiery Mountain Music', chosen in the Top 10 Bluegrass Albums of 2004 by the Chicago Tribune.  Critics also chose Shannon Whitworth's song \"Come On Darlin'\" as the IPOD Hotpick Bluegrass Song of 2004.  In September 2005, the band released their second album, A Mountain Apart, which was in the Top 20 of the Roots Music Report National Bluegrass Airplay chart for five months after its release.  \n"
   ],
   "infobox": {
      "Origin": [
         "Alexandria, Virginia, U.S.",
         "Fredericksburg, Virginia, U.S.",
         "Charlottesville, Virginia, U.S.",
         "Weaverville, North Carolina, U.S."
      ],
      "Genres": [
         "Folk",
         "Country",
         "Americana",
         "Bluegrass",
         "Old-time"
      ],
      "Years active": [
         "2002–present"
      ],
      "Labels": [
         "Indidog Records"
      ],
      "Website": [
         "Official Site"
      ],
      "Members": [
         "Mary Lucey (founding member)",
         "Billy Cardine",
         "Dan Bletz",
         "Odessa Jorgensen",
         "Shannon Whitworth (founding member)",
         "John Stickley (in studio)",
         "Wes Corbett (in studio)"
      ]
   },
   "albums": []
}