{
   "Name": "The Grascals",
   "rawData": [
      "The Grascals are a six-piece American bluegrass band from Nashville, Tennessee. Founded in February 2004, the band has gained a level of notoriety by playing on the Grand Ole Opry and bluegrass festivals around the country, as well as with Dolly Parton.\n",
      "Terry Smith was born June 15, 1960, in Reidsville, North Carolina. He moved to Nashville in his early teens, after starting out playing in a family band with his mother Hazel Smith, father Patrick Smith, and brother, Billy Smith. Terry has played with such legends as Jimmy Martin, Wilma Lee Cooper, and the Osborne Brothers. Terry and his brother, Billy, recorded an album for CBS Records, which evolved to a number one video on CMT with \"Blues Stay Away From Me.\"  After touring with Grand Ole Opry member Mike Snider, Terry joined the Grascals and remains as a founding member.\n",
      "Danny Roberts started playing guitar to back up Jimmy Mattingly when they were growing up in Leitchfield, Kentucky. He began to win contests for his guitar playing, and eventually, mandolin. In 1982, he co-founded the New Tradition, bluegrass/gospel group that toured the country for close to 20 years. The band recorded 10 CDs, made \"Seed of Love\" song, the first bluegrass video to feature the banjo, and even reached number one on the TNN channel. That band broke up in 2000, but Danny still continued to play with others including Marty Raybon, Larry Cordle, and Melonie Cannon. He also joined Ronnie Reno's band, the Reno Tradition. Danny joined the Grascals as a founding member, where he was reunited with Jimmy Mattingly.\n"
   ],
   "infobox": {
      "Origin": [
         "Nashville, Tennessee United States"
      ],
      "Genres": [
         "bluegrass, southern gospel"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Rounder Records, Cracker Barrel, Saguaro Road Records, Mountain Home"
      ],
      "Website": [
         "grascals.com"
      ],
      "Members": [
         "Terry Smith",
         "Danny Roberts",
         "Kristin Scott Benson",
         "Adam Haynes",
         "John Bryan",
         "Chris Davis"
      ],
      "Past members": [
         "Dave Talbot",
         "Jimmy Mattingly",
         "Aaron McDaris",
         "Jeremy Abshire",
         "Jamie Johnson",
         "Terry Eldredge"
      ]
   },
   "albums": []
}