{
   "Name": "The Infamous Stringdusters",
   "rawData": [
      "The Infamous Stringdusters are a progressive acoustic/bluegrass band. The band first emerged in 2006 with the limited release of a five-song extended play CD The Infamous Stringdusters, followed in 2007 by their first album Fork in the Road. Both of these were on Sugar Hill Records. The band consists of Andy Hall (Dobro), Andy Falco (guitar), Chris Pandolfi (banjo), Jeremy Garrett (fiddle), and Travis Book (double bass). The band has become known for a complex, distinctive, and groove-friendly sound along with a bluegrass theme.\n",
      "The Infamous Stringdusters won three awards at the International Bluegrass Music Association Awards Ceremony in October 2007: Emerging Artist of the Year, Album of the Year for Fork in the Road (in a tie with J.D. Crowe & the New South's album Lefty's Old Guitar), and Song of the Year for the album's title cut. The band was also nominated for 2011 Entertainer of the Year by the International Bluegrass Music Association.\n",
      "In 2011, \"Magic No. 9\" (from Things That Fly) was nominated for the Grammy Award for Best Country Instrumental Performance. In 2018, they won the Grammy Award for Best Bluegrass Album.\n"
   ],
   "infobox": {
      "Origin": [
         "Nashville, Tennessee, United States"
      ],
      "Genres": [
         "Progressive bluegrass, folk, country, jam band"
      ],
      "Years active": [
         "2006–present"
      ],
      "Labels": [
         "Sugar Hill, High Country, Compass, Lumenhouse, Tape Time"
      ],
      "Associated acts": [
         "Punch Brothers, Keller Williams, Ryan Adams, Phil Lesh and Friends, Nicki Bluhm, Greensky Bluegrass, The String Cheese Incident, Josh Shilling"
      ],
      "Website": [
         "thestringdusters.com"
      ],
      "Members": [
         "Andy Hall ",
         "Andy Falco ",
         "Chris Pandolfi",
         "Jeremy Garrett",
         "Travis Book"
      ],
      "Past members": [
         "Chris Eldridge",
         "Jesse Cobb"
      ]
   },
   "albums": [
      "Fork in the Road",
      "The Infamous Stringdusters",
      "Things That Fly",
      "We'll Do It Live",
      "Silver Sky",
      "Let It Go",
      "Ladies & Gentlemen",
      "Laws of Gravity",
      "Rise Sun",
      "Dust The Halls"
   ]
}