{
   "Name": "Hey Ocean!",
   "rawData": [
      "Hey Ocean! is a Canadian indie alternative rock and synthpop band formed in 2004 in Vancouver. David Beckingham and Ashleigh Ball had been friends since grade 6, joining with David Vertesi in the 2000s to form the band. The band consists of Ashleigh Ball (vocals/flute), David Beckingham (vocals/guitar), and David Vertesi (vocals/bass). Their music draws from many genres, including pop and acoustic, and the group tours Canada widely. They have performed locally alongside other Vancouver acts such as Shad K, Mother Mother and Said the Whale.\n",
      "The band ran their own label for many years, being represented by Nettwerk Management, and had overtures from Gene Simmons before signing with Universal Music Canada for distribution in 2011.\n",
      "Lead singer Ashleigh Ball's voice acting work has drawn international attention to the band from members of the My Little Pony: Friendship Is Magic fan community. Fans have created music videos featuring the band's songs and footage from the show, some of which were featured on the band's official website. At the end of June 2013, the band performed at Fiesta Equestria, a brony convention in Houston, Texas. The band also did a collaborative music video between the staff of the television show My Little Pony: Friendship Is Magic and bronies titled #TweetIt. The band was featured in Brent Hodge's critically acclaimed documentary A Brony Tale.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Indie pop, pop rock, synthpop, power pop, alternative rock"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Universal",
         "Nettwerk"
      ],
      "Website": [
         "heyocean.com"
      ],
      "Members": [
         "Ashleigh Ball",
         "David Beckingham",
         "David Vertesi"
      ]
   },
   "albums": [
      "Stop Looking Like Music",
      "It's Easier to Be Somebody Else",
      "IS",
      "The Hurt of Happiness",
      "It's Easier to Be Somebody Else (10th Anniversary Remaster)"
   ]
}