{
   "Name": "MK-Ultra (band)",
   "rawData": [
      "MK-ULTRA (also spelled Mk-Ultra, MK Ultra, or Mk Ultra) was a hardcore/thrash band from Chicago, Illinois formed in 1993. They were known for their fast music and outspokenness on political and social topics ranging from capitalism to Christianity. Due to \"legal troubles\", the band was forced to drop the name \"MK-ULTRA\" in 1999. They finally broke up in 2000, although the band continued donating songs to compilations for some years afterwards.  MK-ULTRA went on 3 tours, including \"roughly 26 states and Montreal\".\n",
      "Drummer Ebro Virumbrales also played in well-known hardcore bands Charles Bronson and Los Crudos at the same time as MK-ULTRA. Singer Frank Hanney went on to form Fourteen or Fight and The O.S.S. Jeff Jelen went on to form Punch in the Face with Ebro Virumbrales on vocals, VMW with Mark McCoy on vocals, and American Mosquito with former vocalist Jeff Bachner. Kirk Syrek plays bass currently in Sick/Tired and also in another band, Pillage, with Ebro Virumbrales. Original drummer Gary Cihak went on to form Government for Hire.\n",
      "A 56-track double LP with nearly all of their recorded songs was released by Mark McCoy's Youth Attack! Records on August 12, 2009. The band announced a one-time reunion show to be held on October 3, 2009 in Chicago.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, United States"
      ],
      "Genres": [
         "Thrashcore, hardcore punk, grindcore[1]"
      ],
      "Years active": [
         "1993-2000"
      ],
      "Labels": [
         "Lengua Armada Discos"
      ],
      "Associated acts": [
         "Charles Bronson, Los Crudos, Fourteen Or Fight, The O.S.S., Punch In The Face, VMW, American Mosquito, Sick/Tired, Pillage, Government For Hire"
      ],
      "Past members": [
         "Ebro Virumbrales",
         "Jeff Jelen",
         "Kirk Syrek",
         "Frank Hanney",
         "Gary Cihak",
         "Jeff Bachner"
      ]
   },
   "albums": [
      "Statues"
   ]
}