{
   "Name": "Holy Soldier",
   "rawData": [
      "Holy Soldier was a Christian hard rock band from Los Angeles, California.\n",
      "The band was originally formed in early 1985 by bassist Andy Robbins and guitarist Jamie Cramer. The band gained a strong local following before signing to A&M Records in 1989. Holy Soldier was initially noted for their strong evangelical focus, although they regularly played to mainstream audiences. For a time they held one of the largest attendance records at Gazzarri's, a notable nightclub in the Hollywood circuit. In 1989 they signed to Myrrh Records, an imprint of Word/A&M, as that label's first Hard Rock act. Their eponymous debut, produced by David Zaffiro, was released in 1990 to critical acclaim and moderate commercial success. The band garnered two Dove Awards in 1991, in the hard rock song and album of the year categories. After heavy touring the band lost two members – lead vocalist Steven Patrick, and guitarist Michael Cutting.\n",
      "The band replaced the members with Eric Wayne and Scott Soderstrom while continuing to tour. Wayne exited when Steven Patrick returned in 1991, but would again rejoin the group in 1995. Two years later, the band followed up their debut with Last Train.  While praised, it was not a commercial success. Although Last Train charted, peaking at the No. 10 slot on Billboard's CCM chart, the album did not meet the sales expectations of the label, and the band was dropped from their roster. A review in CCM magazine found that although the band's sound had progressed, their lyrics had shifted from evangelicalism to a more ambiguous tone. Additionally, the band was criticised by some in Christian music for attempting to be a \"crossover success\" into the general market.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California"
      ],
      "Genres": [
         "Glam metal, Christian metal"
      ],
      "Years active": [
         "1985–1997, 2005–2006 (reunions)"
      ],
      "Website": [
         "www.holysoldier.com"
      ]
   },
   "albums": [
      "Holy Soldier",
      "Last Train",
      "Promise Man"
   ]
}