{
   "Name": "Funkadelic",
   "rawData": [
      "Funkadelic was an American funk rock band formed in Plainfield, New Jersey in 1968 and active until 1982. The band and its sister act Parliament, both led by George Clinton, pioneered the funk music culture of the 1970s. Relative to its sister act, Funkadelic pursued a heavier, psychedelic rock-oriented sound. They released acclaimed albums such as Maggot Brain (1971) and One Nation Under a Groove (1978).\n",
      "The group that would become Funkadelic was formed by George Clinton in 1964, as the unnamed backing section for his doo wop group The Parliaments while on tour. The band originally consisted of musicians Frankie Boyce, Richard Boyce, and Langston Booth plus the five members of the Parliaments on vocals. Boyce, Boyce, and Booth enlisted in the Army in 1966, and Clinton recruited bassist Billy Bass Nelson and guitarist Eddie Hazel in 1967, then added guitarist Tawl Ross and drummer Tiki Fulwood. The name \"Funkadelic\" was coined by Nelson after the band relocated to Detroit. By 1968, because of a dispute with Revilot, the record company that owned \"The Parliaments\" name, the ensemble began playing under the name Funkadelic.\n",
      "As Funkadelic, the group signed to Westbound in 1968. Around this time, the group's music evolved from soul and doo wop into a harder guitar-driven mix of psychedelic rock, soul and funk, much influenced by the popular musical (and political) movements of the time. Jimi Hendrix and Sly Stone were major inspirations. This style later evolved into a tighter guitar and horns-based funk (circa 1971–75), which subsequently, during the height of Parliament-Funkadelic success (circa 1976–81), added elements of R&B and electronic music, with fewer psychedelic rock elements. The band made their first live television performance on Say Brother in October 7, 1969. They played a jam with songs \"Into My Own Thing\", \"What Is Soul?\", \"(I Wanna) Testify\", \"I Was Made to Love Her\" (Stevie Wonder cover), \"Friday Night, August 14th\" and \"Music for My Mother\".\n"
   ],
   "infobox": {
      "Origin": [
         "Plainfield, New Jersey"
      ],
      "Genres": [
         "Funk",
         "psychedelic funk[1]",
         "acid rock[2]",
         "funk rock[3]",
         "black rock[4]",
         "psychedelic rock[5]"
      ],
      "Years active": [
         "1968–1982, 2014"
      ],
      "Labels": [
         "Westbound, Warner Bros."
      ],
      "Associated acts": [
         "Parliament, Bootsy's Rubber Band"
      ],
      "Past members": [
         "George Clinton",
         "Grady Thomas",
         "Ray Davis",
         "Clarence \"Fuzzy\" Haskins",
         "Calvin Simon",
         "Terrence Fulton Aka Sweetpea",
         "Eddie Hazel",
         "Tawl Ross",
         "Tiki Fulwood",
         "Mickey Atkins",
         "Bernie Worrell",
         "Harold Beane",
         "Garry Shider",
         "Cordell \"Boogie\" Mosson",
         "William \"Bootsy\" Collins",
         "Phelps \"Catfish\" Collins",
         "Ron Bykowski",
         "Prakash John",
         "Tyrone Lampkin",
         "Leon Patillo",
         "Jimi Calhoun",
         "Michael Hampton",
         "Glen Goins",
         "Jerome \"Bigfoot\" Brailey",
         "Dawn Silva",
         "Walter \"Junie\" Morrison",
         "Rodney Curtis",
         "Mallia Franklin",
         "Larry Fratangelo",
         "DeWayne \"Blackbyrd\" McKnight",
         "David Spradley",
         " Ruth Copeland",
         "Dennis Chambers",
         "Frankie \"Kash\" Waddy"
      ]
   },
   "albums": [
      "Funkadelic",
      "Free Your Mind... and Your Ass Will Follow",
      "Maggot Brain",
      "America Eats Its Young",
      "Cosmic Slop",
      "Standing on the Verge of Getting It On",
      "Let's Take It to the Stage",
      "Tales of Kidd Funkadelic",
      "Hardcore Jollies",
      "One Nation Under a Groove",
      "Uncle Jam Wants You",
      "Connections & Disconnections",
      "The Electric Spanking of War Babies",
      "By Way of the Drum",
      "Toys",
      "First Ya Gotta Shake the Gate"
   ]
}