{
   "Name": "Redbone (band)",
   "rawData": [
      "Redbone is a Mexican-American/Native American funk rock band originating in the 1970s with brothers Pat and Lolly Vegas. They reached the Top 5 on the U.S. Billboard Hot 100 chart in 1974 with their single, \"Come and Get Your Love\". The single went certified Gold selling over a million copies. It also made Redbone the first Native American band to reach the top five on the Billboard Hot 100, with the song reaching number 5. Redbone achieved hits with their singles \"We Were All Wounded at Wounded Knee\", \"The Witch Queen of New Orleans\", \"Wovoka\", and \"Maggie\" in the United States, although these singles were more successful overseas. \n",
      "Pat has been the sole member of the band since Lolly's death in 2010.\n",
      "Born in Coalinga, California, near Fresno, brothers Patrick (bass and vocals) and Candido \"Lolly\" Vasquez-Vegas (guitar and vocals) moved to Los Angeles in 1959 and played for ten years in clubs under the name of Pat and Lolly Vegas. Pat won Coca-Cola's first singing competition in 1958 at age 17. He also won a recording contract, which he put off to move to Los Angeles with Lolly. They performed at local clubs on Hollywood and Sunset Boulevard (such as Gazzari's) while writing and playing on records by Tina Turner, Sonny & Cher, James Brown, Little Richard, and Elvis, among other legendary artists.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Funk rock, swamp rock, soul, R&B, traditional"
      ],
      "Years active": [
         "1969–present"
      ],
      "Labels": [
         "Epic Records/Novalene Music"
      ],
      "Associated acts": [
         "Pat and Lolly Vegas"
      ],
      "Website": [
         "redbone.be"
      ],
      "Members": [
         "Pat Vegas"
      ],
      "Past members": [
         "Lolly Vegas (deceased)",
         "Tony Bellamy (deceased)",
         "Peter DePoe",
         "Arturo Perez",
         "Butch Rillera"
      ]
   },
   "albums": [
      "Redbone",
      "Potlatch",
      "Message from a Drum",
      "Already Here",
      "Wovoka",
      "Beaded Dreams Through Turquoise Eyes",
      "Cycles",
      "Peace Pipe"
   ]
}