{
   "Name": "Dark Age (band)",
   "rawData": [
      "Dark Age is a German metal band from Hamburg, Germany formed in 1995 by Eike Freese (guitar, vocals), André Schumann (drums) and Oliver Fliegel (bass guitar).\n",
      "In 1994, Eike Freese, André Schumann and Oliver Fliegel formed a death metal band called Dyer's Eve. One year later the name was changed to Dark Age. The new name was inspired by a Vader songtitle, while their older one was inspired by a Metallica songtitle. In autumn 1995, they recorded their first demo Doubtful Existence. In December 1995, keyboarder Martin Reichert and in January 1996 guitarist Finn Dierks joined the band. Oliver Fliegel left the band in 1996. After Finn Dierks moved to the U.S. he was replaced by Jörn Schubert.\n",
      "In Summer 1998, Dark Age recorded their first album entitled, The Fall, which was released after a contract with Remedy Records. In 2000, the album Insurrection followed and they played at Wacken Open Air. In 2002, the album The Silent Republic was recorded in the Stage One-studio. In 2003, they founded their own studio and played again at Wacken Open Air.\n"
   ],
   "infobox": {
      "Origin": [
         "Hamburg, Germany"
      ],
      "Genres": [
         "Melodic death metal, power metal, gothic metal, black metal"
      ],
      "Years active": [
         "1995–2013 (Indefinite Hiatus)"
      ],
      "Labels": [
         "AFM Records (Germany)"
      ],
      "Website": [
         "www.dark-age.de"
      ],
      "Members": [
         "Eike Freese ",
         " André Schumann ",
         " Martin Reichert ",
         " Jörn Schubert ",
         " Alex Henke"
      ],
      "Past members": [
         "Torsten Eggert ",
         " Oliver Fliegel ",
         " Hendrik Brückner ",
         " Finn Dierks ",
         " Sonja"
      ]
   },
   "albums": [
      "Doubtful Existence",
      "Promotion Tape Winter '96/'97",
      "The Fall",
      "The Fall",
      "Insurrection",
      "The Silent Republic",
      "Remonstrations",
      "Dark Age",
      "Live, So Far...",
      "Minus Exitus",
      "Acedia",
      "A Matter of Trust"
   ]
}