{
   "Name": "Moonspell",
   "rawData": [
      "Moonspell is a Portuguese gothic metal band. Formed in 1992, the group released their first EP Under the Moonspell in 1994 and followed up with their debut album Wolfheart a year later. They quickly became the most recognizable metal band from Portugal and a key figure in gothic metal.\n",
      "Moonspell reached the Portuguese top first with their album Sin/Pecado. With Memorial, Moonspell also became the first Portuguese metal band to have a record certified gold status. They are also popular in Germany, where their albums consistently enter the Top 100 Chart.\n",
      "Although they had been playing since 1989 under the name of \"Morbid God\", the band became Moonspell in 1992, shortly after they released the promo track \"Serpent Angel\". At the time of the name change, the band's line-up was Fernando Ribeiro (Langsuyar) on vocals, João Pedro \"Ares\" Escoval (Tetragrammaton) on bass, Duarte Picoto (Mantus) and Luís Lamelas (Malah) on the guitars, and Miguel \"Mike\" Gaspar (Nisroth) on the drums. Ribeiro and Ares were the founders and masterminds of Morbid God / Moonspell, while the latter members joined Morbid God at different points in 1992. Of them, only Mike Gaspar joined after the recording of \"Serpent Angel\".\n"
   ],
   "infobox": {
      "Origin": [
         "Brandoa, Amadora, Portugal"
      ],
      "Genres": [
         "Gothic metal, black metal, doom metal, melodic death metal"
      ],
      "Years active": [
         "1992–present"
      ],
      "Labels": [
         "Adipocere (1994)Century Media (1995–2005)SPV GmbH (2005–2008)Napalm (2011–present)"
      ],
      "Associated acts": [
         "Morbid God, Dæmonarch, Orfeu Rebelde"
      ],
      "Website": [
         "moonspell.com"
      ],
      "Members": [
         "Fernando Ribeiro",
         "Pedro Paixão",
         "Ricardo Amorim",
         "Aires Pereira",
         "Hugo Ribeiro"
      ],
      "Past members": [
         "Miguel Gaspar",
         "João Pedro Escoval",
         "Duarte Picoto",
         "Luís Lamelas",
         "João Pereira",
         "Sérgio Crestana"
      ]
   },
   "albums": []
}