{
   "Name": "Terrorizer",
   "rawData": [
      "Terrorizer is an American grindcore band formed in 1986 in Los Angeles, California, United States. After disbanding, its members gained recognition by playing in influential extreme metal bands, such as Morbid Angel (David Vincent, Pete Sandoval), Napalm Death (Jesse Pintado) and Nausea (Oscar Garcia, Alfred \"Garvey\" Estrada). To date, Terrorizer has released four studio albums, and broken up twice (once in 1989 and another in 2006). The band reunited again in 2009, this time without Pintado, who had died three years earlier.\n",
      "The group released its debut album, World Downfall, in 1989. It is seen as one of the classics of early grindcore. An album containing two rehearsal sessions of the band from 1987 was released in 2003.\n",
      "The band split around 1990 when Vincent offered Sandoval a spot in Morbid Angel, while Pintado was being courted to join Napalm Death; Sandoval saw Terrorizer stagnating, while Morbid Angel and Napalm Death at the time were rapidly gaining popularity. As a result, only Garcia remained; Garcia claims not to have talked to Sandoval since.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Grindcore",
         "deathgrind[1]"
      ],
      "Years active": [
         "1986–1989",
         "2005–2006",
         "2009–present"
      ],
      "Labels": [
         "Earache",
         "Season of Mist",
         "Century Media",
         "Relativity"
      ],
      "Associated acts": [
         "Morbid Angel",
         "Napalm Death",
         "Nausea LA",
         "Monstrosity"
      ],
      "Website": [
         "http://www.terrorizergrindcore.net/"
      ],
      "Members": [
         "Pete Sandoval",
         "Sam Molina",
         "Lee Harrison"
      ],
      "Past members": [
         "Oscar Garcia",
         "Jesse Pintado",
         "Alfred \"Garvey\" Estrada",
         "Tony Norman",
         "Anthony Rezhawk",
         "Katina Culture",
         "David Vincent"
      ]
   },
   "albums": [
      "World Downfall",
      "Darker Days Ahead",
      "Hordes of Zombies",
      "Caustic Attack"
   ]
}