{
   "Name": "Faith No More",
   "rawData": [
      "Faith No More is an American rock band from San Francisco, California, formed in 1979. Before settling on the current name, the band performed under the names Sharp Young Men and later Faith No Man. Bassist Billy Gould, keyboardist/rhythm guitarist Roddy Bottum and drummer Mike Bordin are the longest-remaining members of the band, having been involved since its inception. The band underwent several early lineup changes, and some major changes later. The current lineup of Faith No More consists of Gould, Bordin, Bottum, lead guitarist Jon Hudson, and vocalist/lyricist Mike Patton.\n",
      "After releasing six studio albums, including best-selling records The Real Thing (1989) and Angel Dust (1992), Faith No More officially announced its breakup on April 20, 1998. The band has since reunited, conducting The Second Coming Tour between 2009 and 2010, and releasing its seventh studio album, Sol Invictus, in May 2015. Following the touring cycle of Sol Invictus, Faith No More went on hiatus once again. In November 2019, the band made the announcement that they would be reuniting to embark on a 2020 UK and European tour. However, due to the COVID-19 pandemic, the start of the tour was postponed until June 2021.\n",
      "The genesis of Faith No More was the group Sharp Young Men, formed in 1979 by vocalist Mike Morris and keyboardist Wade Worthington. Drummer Mike Bordin and bassist Billy Gould joined afterwards. Mike Morris described the name as \"a piss-take on all the ‘elegant’ groups at the time\". Later on, Morris proposed the name Faith In No Man, but, eventually, the band settled on Bordin's suggestion Faith No Man (stylized as Faith. No Man).\nThe band recorded \"Quiet in Heaven/Song of Liberty\", released in 1983. The songs were recorded in Matt Wallace's parents' garage, where Wallace had set up and been running a recording studio while the band was still recording under the name Sharp Young Men, with Mike Morris, Billy Gould, Mike Bordin and Wade Worthington. Worthington left shortly thereafter. They changed their name to Faith No Man for the release of the single, which featured two of the three songs recorded in Wallace's garage, and hired Roddy Bottum to replace Worthington. Bottum, Gould and Bordin quit the band shortly after and formed Faith No More. They chose the name to accentuate the fact that \"The Man\" (Mike Morris) was \"No More\". The band played with several vocalists and guitarists, including a brief stint with Courtney Love, until they settled on vocalist Chuck Mosley in 1983 and later, guitarist Jim Martin.\n"
   ],
   "infobox": {
      "Also known as": [
         "Faith No Man",
         "Sharp Young Men"
      ],
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Alternative metal",
         "experimental rock",
         "funk metal",
         "post-punk (early)"
      ],
      "Years active": [
         "1979–1998",
         "2009–present"
      ],
      "Labels": [
         "Slash",
         "Reprise",
         "Mordam",
         "Reclamation!",
         "Ipecac"
      ],
      "Associated acts": [
         "Mr. Bungle",
         "Pop-O-Pies"
      ],
      "Website": [
         "fnm.com"
      ],
      "Members": [
         "Mike Bordin",
         "Roddy Bottum",
         "Billy Gould",
         "Mike Patton",
         "Jon Hudson"
      ],
      "Past members": [
         "Mike Morris\n  ",
         "Wade Worthington\n  ",
         "Courtney Love\n",
         "Mark Bowen\n  ",
         "Chuck Mosley\n",
         "Jim Martin\n",
         "Trey Spruance\n",
         "Dean Menta\n",
         "Robin Guy\n  "
      ]
   },
   "albums": [
      "We Care a Lot",
      "Introduce Yourself",
      "The Real Thing",
      "Angel Dust",
      "King for a Day... Fool for a Lifetime",
      "Album of the Year",
      "Sol Invictus"
   ]
}