{
   "Name": "Joseph (band)",
   "rawData": [
      "Joseph is an American folk band from Portland, Oregon made up of three sisters: Natalie Closner Schepman, and twins Allison Closner and Meegan Closner. Their first album, Native Dreamer Kin, was self-released in early 2014. Their second album I'm Alone, No You're Not was produced by Mike Mogis and was released on August 26, 2016 by ATO Records. Their third album Stay Awake was released on September 15, 2017 by ATO Records.\n",
      "Joseph was formed when Natalie Closner Schepman, who had been pursuing a solo singer-songwriter career, recruited her younger twin sisters Meegan and Allison to join her on vocals for a new project. They chose their name as a tribute to the town of Joseph, Oregon and their grandfather Jo. Originally performing under a different name, a label representative said the name did not match the gravitas of their songwriting; they had just been camping in Joseph, a regular activity for them, and decided on the name. They self-released their debut album Native Dreamer Kin in 2014, and built a following playing intimate house shows as a trio accompanied by acoustic guitar and foot drum.\n",
      "Joseph were signed to ATO Records in 2015, releasing an acoustic two-song digital ATO Sessions EP and accompanying video series. In 2015, they recorded I'm Alone, No You're Not with producer Mike Mogis. The album was released on August 26, 2016. It debuted at #1 on Billboard's Heatseekers chart and remained at the top of the chart for two weeks. They released their first single, \"White Flag\", on May 24, 2016 with a premiere on NPR's Songs We Love. \"White Flag\" reached No. 1 on the Adult Alternative Songs chart in October 2016, and charted on Spotify's US Viral Top Ten days after its release. In Fall 2016, Joseph launched an a cappella covers contest, which included submissions from fans, amateur musicians, and college a cappella groups.\n"
   ],
   "infobox": {
      "Origin": [
         "Portland, Oregon, United States"
      ],
      "Genres": [
         "Pop",
         "folk"
      ],
      "Years active": [
         "2014-present"
      ],
      "Labels": [
         "ATO",
         "PIAS"
      ],
      "Website": [
         "thebandjoseph.com"
      ],
      "Members": [
         "Natalie Closner Schepman",
         "Allison Closner",
         "Meegan Closner"
      ]
   },
   "albums": []
}