{
   "Name": "Earth (American band)",
   "rawData": [
      "Earth is an American rock band based in Olympia, Washington, formed in 1989 and led by the guitarist Dylan Carlson. Earth's music is nearly all instrumental, and can be divided into two distinct stages. Their early work is characterized by distortion, droning, minimalism, and lengthy, repetitive song structures. Owing to their 1993 debut LP Earth 2, Earth is recognized as a pioneer of drone metal. The band resurfaced in the early 2000s, with their later output reducing the distortion and incorporating elements of country, jazz rock, and folk.\n",
      "Dylan Carlson founded the band in 1989 along with Slim Moon and Greg Babior, taking the title \"Earth\" from Black Sabbath's original name. Carlson has remained the core of the band's line-up throughout its changes. \n",
      "Carlson was a close friend of grunge icon Kurt Cobain, who sang lead vocals in the song \"Divine and Bright\", from a demo included on the re-release of the live album Sunn Amps and Smashed Guitars. Because police had twice confiscated guns from Cobain inside a single year, Cobain had Carlson purchase a shotgun for him on March 30, 1994. Cobain told Carlson the gun was for protection. Cobain would use the shotgun to kill himself six days later.\n"
   ],
   "infobox": {
      "Origin": [
         "Olympia, Washington, United States[1]"
      ],
      "Genres": [
         "Drone metal",
         "instrumental rock[2]",
         "psychedelic rock[3]",
         "post-rock[4]"
      ],
      "Years active": [
         "1989–1997, 2003–present"
      ],
      "Labels": [
         "Sub Pop",
         "No Quarter",
         "Or",
         "Southern Lord",
         "Blast First/Mute",
         "Sargent House"
      ],
      "Associated acts": [
         "Melvins",
         "Nirvana",
         "Sunn O)))",
         "Thrones",
         "Bill Frisell",
         "The Bug"
      ],
      "Website": [
         "thronesanddominions.com"
      ],
      "Members": [
         "Dylan Carlson",
         "Adrienne Davies",
         "Don McGreevy",
         "Bill Herzog",
         "Tristan Jemsek"
      ],
      "Past members": [
         "Slim Moon\n",
         "Greg Babior\n  ",
         "Kelly Canary\n  ",
         "Joe Preston\n",
         "Ian Dickson\n  ",
         "Dave Harwell\n  ",
         "Sean McElligot\n  ",
         "John Schuller\n  ",
         "Michael McDaniel\n  ",
         "Jonas Haskins\n",
         "Steve Moore\n  ",
         "Brett Netson\n  ",
         "Angelina Baldoz\n  ",
         "Karl Blau\n",
         "Lori Goldston\n"
      ]
   },
   "albums": [
      "Earth 2: Special Low-Frequency Version",
      "Phase 3: Thrones and Dominions",
      "Pentastar: In the Style of Demons",
      "Hex; Or Printing in the Infernal Method",
      "The Bees Made Honey in the Lion's Skull",
      "Angels of Darkness, Demons of Light I",
      "Angels of Darkness, Demons of Light II",
      "Primitive and Deadly",
      "Full upon Her Burning Lips"
   ]
}