{
   "Name": "Maserati (band)",
   "rawData": [
      "Maserati is a band formed in 2000 in Athens, Georgia. Originally conceived as exclusively instrumental, the band's sound later shifted towards psychedelic rock, synth rock, and even moments of techno. Their sound is often characterized by soaring guitar hooks and a driving rhythm section interlaced with synthesizers and electronic elements. They are currently signed to Temporary Residence Limited, based in Brooklyn, New York.\n",
      "Coley Dennis, Matt Cherry, Steve Scarborough and Phil Horan began making music together in January 2000 and in June played their first show at the now-defunct Above Bookstore in Athens, Georgia.  That October they recorded and self-released their debut album, 37:29:24. In 2001 the band signed with Kindercore Records and toured the US over the next several years. Their second album The Language of Cities was released in 2002 followed by Confines Of Heat (split with Gainesville, FL's The Mercury Program) in 2003 - both released by Kindercore.  Shortly thereafter Athens-based Hello Sir Records released the Towers Were Wires 7\" and a split CD with Cinemechanica and We Versus the Shark. Cherry left the group temporarily in 2003, replaced by Tristan Wraight.  Following a 2004 Japan tour with MONO, Horan left the group and the band went on hiatus for a year.  \n",
      "In 2005, the band reconvened with Jerry Fuchs (Turing Machine, The Juan MacLean, !!!) stepping in on drums and Cherry re-joining on guitar. Fuchs' influence pushed the band towards a heavier, more psychedelic and space rock-influenced sound. Maserati toured the US and Europe throughout 2006 and 2007, playing with bands such as !!!, Battles, and Black Moth Super Rainbow.  The band signed with Temporary Residence in 2007, releasing their third album Inventions for the New Season later that year followed by the Inventions Remixes 12\" featuring remixes by Tim Goldsworthy and Justin Van Der Volgen.  In 2008 Scarborough left the group and was replaced by bassist Chris McNeal (Some Soviet Station, Vincas). In early 2009 Temporary Residence released the Maserati/Zombi split LP, followed by the rarities collection Passages later that year.  Throughout 2008 and 2009 the band wrote and recorded material for a new full-length between various tours supporting both MONO and STS9.  \n"
   ],
   "infobox": {
      "Origin": [
         "Athens, Georgia, United States"
      ],
      "Genres": [
         "Post-rock, space rock, psychedelic rock"
      ],
      "Years active": [
         "2000–present"
      ],
      "Labels": [
         "Temporary Residence Limited"
      ],
      "Associated acts": [
         "!!!, Headlights, Turing Machine, Vincas"
      ],
      "Members": [
         "Coley Dennis",
         "Matt Cherry",
         "Chris McNeal",
         "Mike Albanese"
      ],
      "Past members": [
         "Jerry Fuchs",
         "A.E. Paterra ",
         "Phil Horan",
         "Josh McCauley",
         "Tristan Wraight ",
         "Steve Scarborough"
      ]
   },
   "albums": [
      "37:29:24",
      "The Language of Cities",
      "The Language of Cities + 2",
      "Confines Of Heat EP+DVD",
      "Confines of Heat LP",
      "Towers Were Wires/Asymmetrical Threats 7\"",
      "Split EP",
      "Inventions for the New Season",
      "Inventions Remixes",
      "Split",
      "Passages",
      "Pyramid of the Moon",
      "Pyramid of the Sun",
      "Maserati VII",
      "Rehumanizer",
      "Enter the Mirror"
   ]
}