{
   "Name": "This Will Destroy You",
   "rawData": [
      "This Will Destroy You (abbreviated as TWDY) is an American post-rock band from San Marcos, Texas, formed in 2004. They typically compose lengthy atmospheric instrumental pieces, featuring layers of effects-laden guitar and a heavy usage of dynamics. Their fourth album Another Language, released in 2014, entered the Billboard Heatseekers Album Chart at number 7.\n",
      "This Will Destroy You was formed by guitarists Jeremy Galindo and Chris King, bassist Raymond Brown and drummer Andrew Miller in San Marcos, Texas, in 2005. They had met through mutual friends, and played together in various different bands throughout high school before the lineup was finalized by around 2002.\n",
      "Early iterations of the band featured Galindo on vocals and \"sounded like Radiohead\", but after recording some tracks they decided the results were \"awful\" and didn't fit in with the rest of their music. After composing their next song \"The World Is Our___\", the band decided to write instrumental music instead. Chris King said in an interview with BBC Radio Foyle, \"we were ... writing different kinds of songs and we wrote one  song, and we were like, that works, let's go for it!\"\n"
   ],
   "infobox": {
      "Origin": [
         "San Marcos, Texas, United States"
      ],
      "Genres": [
         "Post-rock",
         "shoegazing",
         "ambient",
         "drone"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Dark Operative",
         "Suicide Squeeze",
         "Hobbledehoy Record Co",
         "Magic Bullet",
         "Monotreme"
      ],
      "Associated acts": [
         "Symbol, Amasa Gana"
      ],
      "Website": [
         "thiswilldestroyyou.net"
      ],
      "Members": [
         "Jeremy Galindo",
         "Robi Gonzalez ",
         "Jesse Kees"
      ],
      "Past members": [
         "Raymond Brown",
         "Andrew Miller",
         "Donovan Jones",
         "Alex Bhore",
         " Christopher Royal King"
      ]
   },
   "albums": [
      "Young Mountain",
      "This Will Destroy You",
      "Tunnel Blanket",
      "Another Language",
      "New Others Part One",
      "New Others Part Two",
      "Vespertine"
   ]
}