{
   "Name": "Dirty Dozen Brass Band",
   "rawData": [
      "The Dirty Dozen Brass Band is a New Orleans, Louisiana, brass band. The ensemble was established in 1977 by Benny Jones and members of the Tornado Brass Band. The Dirty Dozen revolutionized the New Orleans brass band style by incorporating funk and bebop into the traditional New Orleans jazz style, and since has been a major influence on local music.\n",
      "The Dirty Dozen Brass Band grew out of the youth music program established by Danny Barker at New Orleans' Fairview Baptist Church. In 1972, Barker started the Fairview Baptist Church Marching Band to provide young people with a positive outlet for their energies. The band achieved considerable local popularity and transformed itself into a professional outfit led by trumpeter Leroy Jones and known as the Hurricane Brass Band. By 1976, however, opportunities for brass bands were drying up; Jones left the group to play mainstream jazz and, after a brief period as the Tornado Brass Band, the group fell apart.\n",
      "A few of the musicians from the Tornado band—trumpeter Gregory Davis, sousaphonist Kirk Joseph, trombonist Charles Joseph, and saxophonist Kevin Harris–continued to rehearse together into 1977, and they were joined by Efrem Townes (trumpeter/lead singer) and Roger Lewis on saxophone and Benny Jones and Jenell Marshall on drums. By this point the popularity of brass band music in New Orleans was at a low ebb, and paying gigs were rare, a circumstance which influenced the early development of the band. As Davis describes it,\n"
   ],
   "infobox": {
      "Origin": [
         "New Orleans, Louisiana, U.S."
      ],
      "Genres": [
         "Jazz, New Orleans R&B, Jazz fusion, Second Line, Funk, Soul, Jam Band"
      ],
      "Years active": [
         "1977–present"
      ],
      "Labels": [
         "Concord Jazz, Rounder, Columbia, Mammoth, Ropeadope Records, Shout! Factory"
      ],
      "Associated acts": [
         "Modest Mouse, Widespread Panic"
      ],
      "Website": [
         "www.dirtydozenbrass.com"
      ],
      "Members": [
         "Gregory Davis - trumpet, vocals",
         "Roger Lewis - baritone, soprano sax, Vocals",
         "Kevin Harris - Tenor saxophone, vocals",
         "Kirk Joseph - Sousaphone",
         "TJ Norris - Trombone, vocals",
         "Julian Addison - Drums, Vocals",
         "Takeshi Shimmura - Guitar"
      ],
      "Past members": [
         "Charles Joseph - Trombone",
         "Benny Jones - Bass drum",
         "Lionel Batiste - Bass drum",
         "Jenell Marshall - Snare drum",
         "Keith Anderson - Trombone",
         "Richard Knox - Keyboard",
         "Big Sam - Trombone",
         "Jamie McLean - Guitar",
         "Julius McKee - Sousaphone",
         "Revert Andrews - Trombone",
         "Terence Higgins - Drums",
         "Jermal Watson - Drums",
         "Kyle Roussel - Keyboard",
         "Jake Eckert - Guitar",
         "Efrem Towns - Trumpet, flugelhorn"
      ]
   },
   "albums": [
      "My Feet Can't Fail Me Now",
      "Live: Mardi Gras in Montreaux",
      "Voodoo",
      "The New Orleans Album",
      "Open Up: Whatcha Gonna Do for the Rest of Your Life",
      "Jelly",
      "Ears to the Wall",
      "Buck Jump",
      "Medicated Magic",
      "We Got Robbed: Live in New Orleans",
      "Funeral for a Friend",
      "This Is the Dirty Dozen Brass Band",
      "What's Going On",
      "Twenty Dozen"
   ]
}