{
   "Name": "Furthur (band)",
   "rawData": [
      "Furthur was a rock band founded in 2009 by former Grateful Dead members Bob Weir and Phil Lesh. The original lineup also included John Kadlecik of the Dark Star Orchestra on lead guitar, RatDog's Jeff Chimenti on keyboards and Jay Lane on percussion, and Joe Russo of the Benevento/Russo Duo on drums. Named after the famous touring bus used by Ken Kesey and the Merry Pranksters in the 1960s, Furthur was an improvisational jam band that performed music primarily from the extensive Grateful Dead songbook, as well as their own original music and that of several other well-known artists. In addition to the original members (with the exception of Jay Lane, who left the band in March 2010 to rejoin his previous band, Primus), the band's lineup included backup vocalists Sunshine Becker of the a cappella ensemble SoVoSó and Jeff Pehrson of the folk rock bands Box Set and the Fall Risk.\n",
      "Four months after Jerry Garcia's death in August 1995, the Grateful Dead officially disbanded. However, band members continued to perform over the subsequent years in other bands such as RatDog, Phil Lesh and Friends, the Rhythm Devils, the Other Ones, and the Dead. After a four-year hiatus following their \"Wave That Flag\" summer tour in 2004, the Dead performed two 2008 shows supporting the Obama campaign, billed as \"Deadheads for Obama\" and \"Change Rocks\", as well at one of the Obama inaugural balls in 2009, ultimately giving rise to a 2009 spring tour. During this reunion, Weir and Lesh, who admitted having great fun playing together again, decided to form a new band. In August 2009, the musicians announced that they had formed a new band, Furthur, with Kadlecik, Chimenti, Lane, and Russo.\n",
      "The band was named after the 1939 International Harvester psychedelic multicolored bus used by novelist Ken Kesey and his Merry Pranksters to tour America in 1964 when they attended the New York World's Fair for the debut of Kesey's second novel, Sometimes A Great Notion. \"Furthur\" was the inscription on the destination placard of the bus and was also the name given to the multicolored bus. \"In many ways, the 'Furthur' destination of the bus—piloted by Neal Cassady, inspiration for the character Dean Moriarty in Jack Kerouac's On the Road—represented the mind-set of the transition from Beat Generation culture to the more heavily drug-infused hippie culture and the LSD-based psychedelic culture, with Ken Kesey, Neal Cassady, the Merry Pranksters, and the Grateful Dead—all alumni of the Acid Tests—as ambassadors and guides on that cognitive and conceptual journey\". The Grateful Dead performed as the house band for many of the Acid Tests, which ran from 1965 to 1966.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "2009–2014"
      ],
      "Associated acts": [
         "Grateful Dead, The Dead, RatDog, Phil Lesh and Friends, Dark Star Orchestra, Benevento/Russo Duo, Joe Russo's Almost Dead, The Fall Risk, Primus"
      ],
      "Past members": [
         "Bob Weir",
         "Phil Lesh",
         "John Kadlecik",
         "Jeff Chimenti",
         "Joe Russo",
         "Jay Lane",
         "Sunshine Becker",
         "Zoe Ellis",
         "Jeff Pehrson"
      ]
   },
   "albums": []
}