{
   "Name": "Max Creek",
   "rawData": [
      "Max Creek is an American rock band that was formed by Dave Reed, John Rider and Bob Gosselin in 1971. Max Creek has a loyal following, and put on an annual music festival at Indian Lookout Country Club in upstate New York, dubbed Camp Creek, and was one of the longest running festivals on the East Coast when it took a hiatus in 2008. Camp Creek was held in Maine in 2011, and returned to Indian Lookout Country Club in 2014. After another hiatus, Camp Creek was held in 2019 at Odetah Camping Resort in Bozrah, CT. \n",
      "Max Creek was formed in 1971 when Hartt College of Music students Dave Reed (acoustic guitar) and John Rider (electric bass) met and shared their original songs and love of American folk music.  They initially rehearsed in the basement of John's frat house in Hartford, CT, but later moved to a 'band house' in Feeding Hills, MA.  Dave eventually asked his high school friend, drummer Bob Gosselin to join, making them a trio. The band originally played folk, singer/songwriter and country rock music. In 1972, Dave Reed invited one of his music students, 15-year-old electric guitarist Scott Murawski, to attend a rehearsal at the 'band house'.  Scott's playing blew the guys away and he was asked to come on board the MC train.  Strangely, Scott's early original association with the band ended abruptly when he was banned from a Hartford, CT club that the band played at regularly for \"being under age\". In 1973 Dave Reed came down with appendicitis, so Mark Mercier was brought in on keyboards to fill in, and Scott was invited back to play lead guitar. Due to the influence of the Grateful Dead, the band decided to incorporate more improvisation into the music becoming more electrified. The music of the psychedelic era had a heavy influence on the band, leading to a  sound and style more like that of the Grateful Dead and the rest of the San Francisco Bay scene. Eventually, Dave left the band to pursue bluegrass, country rock and acoustic ragtime music as a solo act and with the short-lived Hatchett Hill String Band.  In the '80s, Dave went on to form Tamboura Productions where he has recorded several albums and fronted a number of bands including Tamboura (1992) and The Introverts (2016); he is an avid builder/player of cigar box guitars.\n",
      "Percussionist Rob Fried joined the band in 1979. Known for his elaborate stage setup, often with dozens drums and percussion pieces, Fried could always be easily identified in a club or hall thanks to his trademark Panama hat, Hawaiian shirt and dark glasses. Fried left the band in 2004 and died of cancer on September 6, 2006.\n"
   ],
   "infobox": {
      "Origin": [
         "Connecticut, USA"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1971–Present"
      ],
      "Labels": [
         "One Of Nineteen Records, Wranger Records, Relix Records, Telefunken"
      ],
      "Associated acts": [
         "BK3"
      ],
      "Website": [
         "www.maxcreek.com"
      ],
      "Members": [
         "John Rider (bass, vocals)",
         "Scott Murawski (guitar, vocals)",
         "Mark Mercier (keyboards, vocals)",
         "Bill Carbone (drums)",
         "Jamemurrell Stanley (percussion)"
      ],
      "Past members": [
         "Dave Reed (guitar, vocals)",
         "Bob Gosselin (drums)",
         "Amy Fazzano (vocals)",
         "Rob Fried (percussion, vocals) (deceased)",
         "Greg Deguglielmo (drums)",
         "Scott Allshouse (drums, vocals)",
         "Greg Vasso (drums)"
      ]
   },
   "albums": []
}