{
   "Name": "JJ Grey & Mofro",
   "rawData": [
      "JJ Grey & Mofro  (formerly Mofro) is an American Southern soul-rock band from Jacksonville, Florida.\n",
      "The early days of Mofro can be traced back to the mid-nineties when John Higginbotham aka \"JJ Grey\" and Daryl Hance signed with a United Kingdom label and played shows in Europe as Mofro Magic.  Grey and Hance met in their hometown of Jacksonville, Florida while working for an air conditioning company and developed a friendship through music. Their first band together was a rock band called Faith Nation followed by a funk band called Alma Zuma. The deal with the record label in London fell through, and Grey and Hance returned to their native Jacksonville and formed Mofro, then signed with Fog City Records in 2001.\n",
      "The name \"Mofro\" was coined by JJ Grey as an explanation of the sound that the band made. Grey says the word was originally a nickname that a co-worker gave him and Grey adopted it as the band name because it \"sounded southern.\" Grey later changed the band name to \"JJ Grey & Mofro\" when his grandmother asked him if he was ashamed to use his own name.\n"
   ],
   "infobox": {
      "Origin": [
         "Jacksonville, Florida, U.S."
      ],
      "Genres": [
         "Southern rock, Southern soul, blues rock, soul rock, swamp rock"
      ],
      "Years active": [
         "Late 1990s–present"
      ],
      "Labels": [
         "Fog City, Alligator, Provogue, Proper"
      ],
      "Associated acts": [
         "The Revivalists"
      ],
      "Website": [
         "www.jjgrey.com"
      ],
      "Members": [
         "JJ Grey",
         "Eric Brigmond",
         "Marcus Parsley",
         "Dennis Marion",
         "Craig Barnette",
         "Pete Winders",
         "Todd Smallie"
      ],
      "Past members": [
         "Zach Gilbert",
         "Anthony Farrell",
         "Andrew Trube",
         "Anthony \"AC\" Cole",
         "Jeff Dazey",
         "Art Edmaiston",
         "Fabrice Quentin",
         "George Sluppick",
         "Nathan Shepard",
         "Mike Shapiro",
         "Adam Scone",
         "Steve Cybulski",
         "Daryl Hance",
         "Bea \"B. B.Queen\" Gayle",
         "Tim Stombaugh"
      ]
   },
   "albums": []
}