{
   "Name": "7 Year Bitch",
   "rawData": [
      "7 Year Bitch was an American punk rock band from Seattle, Washington. The band was active between 1990 and 1997 and released three albums over that time.The band formed at the same time as the emergence of the Riot Grrrl sub-genre, which is a sub-genre of punk music from the early to mid-1990s that emphasized the role of women in rock music. The Riot Grrrl movement began as a feminist response to the violence and misogyny that became more prominent in punk music in the mid to late 1980s, and 7 Year Bitch, an all female punk band, emerged as part of that sub-genre.\n",
      "7 Year Bitch was formed in 1990 by vocalist Selene Vigil, guitarist Stefanie Sargent, bassist Elizabeth Davis and drummer Valerie Agnew.  Vigil, Sargent, and Agnew had been playing together in the Seattle band Barbie's Dream Car when their bassist left for Europe. They subsequently recruited Davis and renamed their band after the movie The Seven Year Itch, based on a suggestion by their friend, Ben London, of fellow Seattle band, Alcohol Funnycar.\n",
      "At their first concert, the band opened for The Gits, who would prove to have a significant influence on their music. In 1991 the band released their first single \"Lorna\" and signed with C/Z Records. Their first album, Sick 'Em, was released in 1992, but it was overshadowed by Sargent's death on June 27, through passing out on her back after returning home from a party where she had drunk alcohol and taken a small amount of heroin. Following a period grieving and uncertainty, the band decided to continue, recruiting guitarist Roisin Dunne as Sargent's replacement later that year.\n"
   ],
   "infobox": {
      "Origin": [
         "Seattle, Washington, USA"
      ],
      "Genres": [
         "Punk rock, riot grrrl, grunge"
      ],
      "Years active": [
         "1990–1997"
      ],
      "Labels": [
         "C/Z, Atlantic, Man's Ruin"
      ],
      "Associated acts": [
         "The Gits, Barbie's Dream Car, Alcohol Funnycar, Cistine, Von Iva, Clone"
      ],
      "Website": [
         "http://www.7yearbitchrocks.com"
      ],
      "Members": [
         "Selene Vigil",
         "Elizabeth Davis",
         "Valerie Agnew ",
         "Roisin Dunne"
      ],
      "Past members": [
         "Stefanie Sargent (Deceased)",
         "Lisa Faye Beatty (Deceased)"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Seattle, Washington. The band was active between [YEAR] and [YEAR] and released three albums over that time.The band formed at the same time as the emergence of the Riot Grrrl sub-genre, which is a sub-genre of punk music from the early to mid-[YEAR]s that emphasized the role of women in rock music. The Riot Grrrl movement began as a feminist response to the violence and misogyny that became more prominent in punk music in the mid to late [YEAR]s, and [BAND_NAME], an all female punk band, emerged as part of that sub-genre.\n",
      "[BAND_NAME] was formed in [YEAR] by vocalist Selene Vigil, guitarist [PERSON_NAME_FULL_0_FEMALE], bassist Elizabeth Davis and drummer [PERSON_NAME_FULL_1_FEMALE].  Vigil, [PERSON_NAME_LAST_0], and [PERSON_NAME_LAST_1] had been playing together in the Seattle band Barbie's Dream Car when their bassist left for Europe. They subsequently recruited Davis and renamed their band after the movie The Seven Year Itch, based on a suggestion by their friend, [PERSON_NAME_FULL_2_MALE], of fellow Seattle band, Alcohol Funnycar.\n",
      "At their first concert, the band opened for The Gits, who would prove to have a significant influence on their music. In [YEAR] the band released their first single \"Lorna\" and signed with C/Z Records. Their first album, Sick 'Em, was released in [YEAR], but it was overshadowed by Sargent's death on [MONTH] 27, through passing out on her back after returning home from a party where she had drunk alcohol and taken a small amount of heroin. Following a period grieving and uncertainty, the band decided to continue, recruiting guitarist [PERSON_NAME_FULL_0_FEMALE] as Sargent's replacement later that year.\n"
   ]
}