{
   "Discography": {},
   "External links": {},
   "History": {
      "Changes and later days": {
         "text": [
            "Their music shifted direction around 1997, with shorter, radio-friendly songs, instead of longer multiple sectioned songs. They started to get into basic country-style songwriting, but it didn't fit with drummer Mike Wofchuck's style, so they replaced him with John Hofer, formerly of The Freewheelers. In 1996, the band members moved out of the Chestnut Street house in Chico, to the San Francisco Bay Area, where they are currently based.\n",
            "They recorded the stripped-down Later Days album and self-released it in May 1998.  They continued playing frequently, focusing mostly on California cities, with occasional jaunts to Utah or the Pacific Northwest.  They self-recorded another album, the more pop-oriented Green Hills of Earth.  Indie label Future Farmer liked the album and released it, but, again, the album did not promote the band to their desired popularity.  Bassist Isaac Parsons left the band in March 2002, to spend more time with his son. He was replaced by Paul Hoaglin (co-producer of Back To The Grotto and Part Timer Goes Full).  In September 2002, Greg Loiacono, lead guitarist, decided he too needed a break, and the band went on indefinite hiatus after two shows at Slim's in San Francisco in February 2003.\n"
         ]
      },
      "Formation and debut": {
         "text": [
            "Tim Bluhm (vocals/guitar), Greg Loiacono (guitar/vocals), Isaac Parsons (bass) and Mike Wofchuck (drums) met in 1990 while attending California State University-Chico, living off campus in Bradley Hall.  They jammed and played some original songs at a few parties (once billed as Pippi Longstocking and the Trunk-of-Funk), but soon Isaac and Mike were lured away by the prospect of playing Led Zeppelin and Jane's Addiction covers at big parties as the rhythm section of the Keystones.  Meanwhile, Tim and Greg played acoustic guitars and sang harmonies to songstress Ali Weiss in the mellow trio Ali and the Cats.\n",
            "These bands played throughout 1990, but in early 1991, Tim, Greg, Isaac and Mike got back together and got serious about being a rock band. It didn't take long to step up from parties in Chico, CA to local bars and dance clubs like LaSalles and Juanita's. They began playing original songs rather than covers. The band released Back to the Grotto in February 1993. It was produced by the band with Bay Area-based musician/producer Paul Hoaglin (who would subsequently replace Parsons on bass upon his departure in 2002).\n"
         ]
      },
      "Hiatus": {
         "text": [
            "During the hiatus, Tim Bluhm was the most active musically.  He enlisted the Southern California band Five Foot Tuesday as backup, but played to smaller audiences. Greg also formed a band, the Sensations. Also in 2004 two documentaries about the Mother Hips were completed, Patrick Murphree's Stories We Could Tell, a detailing of the history of the Mother Hips, told by the Hips themselves, friends, and family, and Bill DeBlonk's This is the Sound, a compilation of footage from the band's entire career.  (A third movie followed in 2006, Dave Schwartz's chronicle of a 2003 Santa Cruz show, Beauty Rock.)\n"
         ]
      },
      "Hipnic": {
         "text": [
            "Hipnic is a psych-rock and folk concert series nestled in the redwoods of the Big Sur Valley, co-curated by The Mother Hips and Britt Govea of (((FolkYEAH))). The first annual Hipnic was held at Henry Miller Memorial Library over July 4 weekend in 2009. The location for 2010 and 2011 was Fernwood Resort, with onsite camping. In addition to The Mother Hips performing both days, the guest roster has included California artists such as: Al Jardine (The Beach Boys), Jackie Greene, Sean Hayes, Everest, Dawes, Red Cortez, Neal Casal, Nicki Bluhm and more.\n"
         ]
      },
      "Major label": {
         "text": [
            "The Hips were courted by major record labels and did sign a deal with MCA.  A&R Exec. Rob Kasino signed them to Rick Rubin's American Recordings even though they were still students at Chico. The Hips then became labelmates with Johnny Cash, Tom Petty, and the Black Crowes (whose Chris Robinson helped the band to sign with American.) The band visited The Black Crowes at Conway while they were recording Amorica on their way to SXSW. \n",
            "They did more recording and mixing on Back to the Grotto for its American re-release (March 1995) and set out to record a follow-up.  Released in August 1995, Part-Timer Goes Full included new songs as well as tunes from their back catalog.  American Recordings decided the song \"Shut the Door\"  would be released as the first single, but this decision did not go over well with some fans, who thought the song was not representative of their sound.  While the song didn't top any charts, the fanbase grew due to touring, including a concert at the Silver Dollar Fairgrounds with 2,400 tickets sold.  They were also headlining major venues like the Fillmore in San Francisco and appearing at festivals like Laguna Seca Daze and the HORDE tour.\n",
            "Their third album Shootout was recorded in early 1996 and released in October of that year. American Records failed to promote the album and eventually dropped the band from their roster.\n"
         ]
      },
      "Post-hiatus": {
         "text": [
            "Toward the end of 2004 the Mother Hips reunited and started playing shows again.  They recorded an EP, Red Tandy, followed by a full-length album, Kiss the Crystal Flake, released in April 2007.  The song \"Time We Had\" from the album was in November 2007 featured in the music video game Rock Band, and two songs, \"Red Tandy\" and \"Time Sick Son of a Grizzly Bear\" were made available as Downloadable Content for the game on the week of April 29, 2008.\n",
            "The band released their seventh album, Pacific Dust, in October 2009 to great acclaim, including highlights \"White Falcon Fuzz\" and \"Third Floor Story\".  The album was recorded at Mission Bells Studio in San Francisco with co-producer/engineer David Simon-Baker.\n",
            "Bassist Hoaglin, who had experienced long-term severe depression and anxiety, and who had become increasingly unenthusiastic, was fired from the band in late February 2011, and temporarily replaced by former Frank Zappa and Fear bassist Scott Thunes.  Hoaglin was asked to complete the remaining backing tracks for the group's next album, Behind Beyond, in August 2011, and contributed various additional overdubs from home.  Hoaglin has subsequently retired permanently from music, due to physical and mental illnesses.  In an interview in Relix magazine in September 2013, Bluhm incorrectly asserted that Hoaglin quit the band.\n",
            "The Mother Hips released an archival 4-CD set compilation celebrating 20 years of music together September 13, 2011 called Days of Sun and Grass.\n",
            "On May 14, 2013, the band announced that their new album, 'Behind Beyond' would be released on July 9, 2013.[1] A new song, 'Freed From a Prison' was made available for streaming on SoundCloud.[2] The album was produced by David Simon-Baker and recorded at the Mission Bells studio in San Francisco and will also include the songs, 'Isle Not of Man' and 'Jefferson Army'.[3]\n",
            "In 2017 the band signed with Blue Rose Music.[4]\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and debut",
      "1.2 Major label",
      "1.3 Changes and later days",
      "1.4 Hiatus",
      "1.5 Post-hiatus",
      "1.6 Hipnic",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "The Mother Hips is a rock band based in the San Francisco Bay Area.\n"
      ]
   },
   "Title": "The Mother Hips - Wikipedia"
}