{
   "Name": "The Mother Hips",
   "rawData": [
      "The Mother Hips is a rock band based in the San Francisco Bay Area.\n",
      "Tim Bluhm (vocals/guitar), Greg Loiacono (guitar/vocals), Isaac Parsons (bass) and Mike Wofchuck (drums) met in 1990 while attending California State University-Chico, living off campus in Bradley Hall.  They jammed and played some original songs at a few parties (once billed as Pippi Longstocking and the Trunk-of-Funk), but soon Isaac and Mike were lured away by the prospect of playing Led Zeppelin and Jane's Addiction covers at big parties as the rhythm section of the Keystones.  Meanwhile, Tim and Greg played acoustic guitars and sang harmonies to songstress Ali Weiss in the mellow trio Ali and the Cats.\n",
      "These bands played throughout 1990, but in early 1991, Tim, Greg, Isaac and Mike got back together and got serious about being a rock band. It didn't take long to step up from parties in Chico, CA to local bars and dance clubs like LaSalles and Juanita's. They began playing original songs rather than covers. The band released Back to the Grotto in February 1993. It was produced by the band with Bay Area-based musician/producer Paul Hoaglin (who would subsequently replace Parsons on bass upon his departure in 2002).\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco Bay Area, California, U.S."
      ],
      "Genres": [
         "Indie rock",
         "Alternative rock",
         "Folk rock"
      ],
      "Years active": [
         "1990-present"
      ],
      "Labels": [
         "American"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Tim Bluhm, Greg Loiacono, John Hofer"
      ],
      "Past members": [
         "Daniel Eisenberg, Isaac Parsons, Mike Wofchuck, Paul Hoaglin, Scott Thunes"
      ]
   },
   "albums": [
      "Back to the Grotto",
      "Part-Timer Goes Full",
      "Shootout",
      "Later Days",
      "Green Hills of Earth",
      "Kiss the Crystal Flake",
      "Pacific Dust",
      "Behind Beyond",
      "Chronicle Man",
      "Chorus",
      "Live at the Great American Music Hall"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band based in the San Francisco Bay Area.\n",
      "Tim Bluhm (vocals/guitar), [PERSON_NAME_FULL_1_MALE] (guitar/vocals), Isaac Parsons (bass) and [PERSON_NAME_FULL_0_MALE] (drums) met in [YEAR] while attending California State University-Chico, living off campus in Bradley Hall.  They jammed and played some original songs at a few parties (once billed as Pippi Longstocking and the Trunk-of-Funk), but soon Isaac and [PERSON_NAME_FIRST_0] were lured away by the prospect of playing Led Zeppelin and [MONTH]e's Addiction covers at big parties as the rhythm section of the Keystones.  Meanwhile, Tim and [PERSON_NAME_FIRST_1] played acoustic guitars and sang harmonies to songstress [PERSON_NAME_FULL_2_MALE] in the mellow trio [PERSON_NAME_FIRST_2] and the Cats.\n",
      "These bands played throughout [YEAR], but in early [YEAR], Tim, Greg, Isaac and Mike got back together and got serious about being a [GENRE] band. It didn't take long to step up from parties in Chico, CA to local bars and dance clubs like LaSalles and Juanita's. They began playing original songs rather than covers. The band released Back to the Grotto in [MONTH] [YEAR]. It was produced by the band with Bay Area-based musician/producer Paul Hoaglin (who would subsequently replace Parsons on bass upon his departure in [YEAR]).\n"
   ]
}