{
   "Name": "New Monsoon",
   "rawData": [
      "New Monsoon is a rock jam band that is based in the San Francisco, California area that was founded in 1998 by Penn State classmates Bo Carper and Jeff Miller.\n",
      "During the recording of the band's first album Hydrophonic, Carper and Miller tapped long-time east coast friend Phil \"The Pianimal\" Ferlino for keyboards. Blown away by the project, Ferlino immediately moved to San Francisco and joined the band on-stage at the 2001 High Sierra Music Festival.  They have toured with many other bands including in 2005 as part of Big Summer Classic, with The String Cheese Incident as well as Umphrey's McGee, Yonder Mountain String Band, and Keller Williams.   They have shared the stage with a range of bands including Hot Buttered Rum String Band, ALO, moe., and Tea Leaf Green, and are incredibly talented at mixing and blending with many musical styles. They have had many special guests at their shows over the years, including Martin Fierro (saxophonist), violinist Tim Carbone from Railroad Earth, various members of The String Cheese Incident, Mark Karan, Steve Kimock, Mike Stern, and many others. They have recently released their fourth studio album, entitled New Monsoon V, which is a showcase of their diverse talents and was engineered by John Cutler, best known for his work with the Grateful Dead. As of April 2009 the band also released a live 2 disc set entitled New Monsoon LIVE which was recorded over a three night run in Dallas, Austin and Houston Texas.\n",
      "The musical compositions that the band creates are influenced by everything from jazz, to Latin themes, to Indian music. Strong vocals and harmonies, electric and acoustic guitars, banjo, mandolin, bass and keyboards, unify the musical styles of New Monsoon's influences, which are as diverse as rock gods The Allman Brothers Band, Jimi Hendrix, Eric Clapton, Led Zeppelin, Pink Floyd, Neil Young, and Carlos Santana, bluesmen Mississippi John Hurt and Blind Willie McTell, American icons Tom Waits, J. J. Cale, and Jerry Garcia, jazz legends Elvin Jones, Thelonious Monk, and Horace Silver, and fusion pioneers Jeff Beck, Airto Moreira, and Weather Report. In their live shows, the band tries to provide a \"synthesis of genres, everything from bluegrass to reggae, funk, and rock 'n' roll.\" In 2004, Jambase.com presented the band with an award for Emerging Artist of the Year for 2003. The band has gone on to play at numerous festivals, including Bonnaroo, the Austin City Limits Festival, Telluride Bluegrass Festival, Old Settler's Music Festival, Wakarusa, Summerfest, High Sierra, Saturday in the Park, Langerado, 10000 Lakes Festival, and participated in the 2004, 2006, and 2008 Jamcruise trips.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, CA, United States"
      ],
      "Genres": [
         "Jam band"
      ],
      "Years active": [
         "2000–present"
      ],
      "Labels": [
         "SCI Fidelity"
      ],
      "Members": [
         "Bo Carper",
         "Jeff Miller",
         "Phil Ferlino",
         "Marshall Harrell",
         "Michael Pinkham"
      ],
      "Past members": [
         "Heath Carlisle, Ben Bernstein, Brian Carey, Rajiv Parikh, Marty Ylitalo, Ron Johnson, Sean Hutchinson"
      ]
   }
}