{
   "Name": "The Other Ones",
   "rawData": [
      "The Other Ones was an American rock band formed in 1998 by former Grateful Dead members Bob Weir, Phil Lesh, and Mickey Hart, along with part-time Grateful Dead collaborator Bruce Hornsby. In 2000, Bill Kreutzmann, another Grateful Dead alumnus, joined the group, while Phil Lesh dropped out.  In 2002, Lesh rejoined the band, and Hornsby left.  At different times the shifting lineup of The Other Ones also included Mark Karan, Steve Kimock, John Molo, Dave Ellis, Alphonso Johnson, Jimmy Herring, Rob Barraco, Jeff Chimenti, and Susan Tedeschi.  In 2003, The Other Ones changed their name to The Dead.\n",
      "The Other Ones continued the musical legacy of the Grateful Dead after Jerry Garcia died in 1995, playing many Grateful Dead songs and utilizing a similar jam band style that emphasized musical improvisation.  The name of the band was taken from the title of the Grateful Dead song \"That's It for the Other One\", from 1968's Anthem of the Sun.\n",
      "In 1999, The Other Ones released The Strange Remain, a two-disc CD recorded live during their 1998 Furthur Festival tour.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1998–2002"
      ],
      "Labels": [
         "Arista"
      ],
      "Associated acts": [
         "Grateful Dead",
         "The Dead"
      ],
      "Website": [
         "www.dead.net"
      ],
      "Past members": [
         "Bob Weir",
         "Mickey Hart",
         "Bruce Hornsby",
         "Mark Karan",
         "Steve Kimock",
         "Phil Lesh",
         "John Molo",
         "Dave Ellis",
         "Bill Kreutzmann",
         "Alphonso Johnson",
         "Jimmy Herring",
         "Rob Barraco",
         "Jeff Chimenti",
         "Susan Tedeschi"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band formed in [YEAR] by former Grateful Dead members Bob Weir, [PERSON_NAME_FULL_6_MALE], and Mickey Hart, along with part-time Grateful Dead collaborator [PERSON_NAME_FULL_1_MALE]. In [YEAR], Bill Kreutzmann, another Grateful Dead alumnus, joined the group, while [PERSON_NAME_FULL_6_MALE] dropped out.  In [YEAR], [PERSON_NAME_LAST_6] rejoined the band, and [PERSON_NAME_LAST_1] left.  At different times the shifting lineup of [BAND_NAME] also included [MONTH]k Karan, [PERSON_NAME_FULL_4_MALE], John Molo, [PERSON_NAME_FULL_3_MALE], Alphonso Johnson, [PERSON_NAME_FULL_5_MALE], Rob Barraco, [PERSON_NAME_FULL_0_MALE], and [PERSON_NAME_FULL_2_FEMALE].  In [YEAR], [BAND_NAME] changed their name to The Dead.\n",
      "[BAND_NAME] continued the musical legacy of the Grateful Dead after Jerry Garcia died in [YEAR], playing many Grateful Dead songs and utilizing a [GENRE] band style that emphasized musical improvisation.  The name of the band was taken from the title of the Grateful Dead song [SONG_NAME], from [YEAR]'s Anthem of the Sun.\n",
      "In [YEAR], [BAND_NAME] released The Strange Remain, a two-disc CD recorded live during their [YEAR] Furthur Festival tour.\n"
   ]
}