{
   "Name": "Phish",
   "rawData": [
      "Phish is an American rock band that formed in Burlington, Vermont, in 1983. The band is known for musical improvisation, extended jams, blending of genres, and a dedicated fan base. The band consists of guitarist Trey Anastasio, bassist Mike Gordon, drummer Jon Fishman, and keyboardist Page McConnell, all of whom perform vocals, with Anastasio being the primary lead vocalist.\n",
      "The band was formed by Anastasio, Gordon, Fishman and guitarist Jeff Holdsworth, who were joined by McConnell in 1985. Holdsworth departed the band in 1986, and the lineup has remained stable since. Phish began to perform outside of New England in the late 1980s and experienced a rise in popularity in the mid 1990s. In October 2000, the band began a two-year hiatus that ended in December 2002, but they disbanded again in August 2004. Phish reunited officially in October 2008 for subsequent reunion shows in March 2009 and since then have resumed performing regularly. All four members pursued solo careers or performed with side-projects and these projects have continued even after the band has reunited.\n",
      "Phish's music blends elements of a wide variety of genres, including funk, progressive rock, psychedelic rock, folk, country, jazz, blues, bluegrass, and pop. The band was part of a movement of improvisational rock groups, inspired by the Grateful Dead and colloquially known as \"jam bands\", that gained considerable popularity as touring concert acts in the 1990s. Phish has developed a large and dedicated following by word of mouth, the exchange of live recordings, and selling over 8 million albums and DVDs in the United States.\n"
   ],
   "infobox": {
      "Origin": [
         "Burlington, Vermont, U.S."
      ],
      "Genres": [
         "Rock",
         "progressive rock",
         "funk",
         "psychedelic rock[1]",
         "jam band[2]"
      ],
      "Years active": [
         "1983–2004",
         "2008–present"
      ],
      "Labels": [
         "Elektra",
         "Rhino/WMG",
         "JEMP",
         "MapleMusic"
      ],
      "Associated acts": [
         "The Dude of Life, Amfibian, 70 Volt Parade"
      ],
      "Website": [
         "phish.com"
      ],
      "Members": [
         "Trey Anastasio",
         "Jon Fishman",
         "Mike Gordon",
         "Page McConnell"
      ],
      "Past members": [
         "Jeff Holdsworth"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band that formed in Burlington, Vermont, in [YEAR]. The band is known for musical improvisation, extended jams, blending of genres, and a dedicated fan base. The band consists of guitarist Trey Anastasio, bassist [PERSON_NAME_FULL_0_MALE], drummer [PERSON_NAME_FULL_1_MALE], and keyboardist Page McConnell, all of whom perform vocals, with Anastasio being the primary lead vocalist.\n",
      "The band was formed by Anastasio, Gordon, Fishman and guitarist [PERSON_NAME_FULL_0_MALE], who were joined by McConnell in [YEAR]. [PERSON_NAME_LAST_0] departed the band in [YEAR], and the lineup has remained stable since. [BAND_NAME] began to perform outside of New England in the late [YEAR]s and experienced a rise in popularity in the mid [YEAR]s. In [MONTH] [YEAR], the band began a two-year hiatus that ended in [MONTH] [YEAR], but they disbanded again in [MONTH] [YEAR]. [BAND_NAME] reunited officially in [MONTH] [YEAR] for subsequent reunion shows in [MONTH] [YEAR] and since then have resumed performing regularly. All four members pursued solo careers or performed with side-projects and these projects have continued even after the band has reunited.\n",
      "[BAND_NAME]'s music blends elements of a [GENRE] band was part of a movement of improvisational rock groups, inspired by the Grateful Dead and colloquially known as \"jam bands\", that gained considerable popularity as touring concert acts in the [YEAR]s. [BAND_NAME] has developed a large and dedicated following by word of mouth, the exchange of live recordings, and selling over 8 million albums and DVDs in the United States.\n"
   ]
}