{
   "Name": "Particle (band)",
   "rawData": [
      "Particle is an American jam band formed in Los Angeles in 2000.\n",
      "The band formed in 2000 and the original members were Dave Simmons (guitar), Steve Molitz (keyboard), Eric Gould (bass), and Darren Pujalet (drums).  Simmons died shortly after the formation of the band due to a sudden illness.  Guitarist Charlie Hitchcock joined shortly thereafter. Along with The Disco Biscuits, Sound Tribe Sector 9, and Lotus the group was among the first to blend rock, jazz, funk, and electronica into the milieu of what has been dubbed livetronica (a subgenre of the jam band movement where live bands blend the structures of DJ-produced sequenced electronic music into a more traditional live band setting). Prior to 2006, the band's repertoire consisted entirely of instrumental material.\n",
      "The group made a name for itself and built an enthusiastic fan base, known as Particle People, by performing energetic late-night sets at festivals such as Bonnaroo, where they played a set of over five hours to 20,000 people. They played up to 140 shows a year, often to large audiences. Reliance on word of mouth from fans, rather than advertising, allowed this group to sell out venues such as the Bowery Ballroom in New York City before they finally released their much anticipated first album, Launchpad, in early 2004, on which they worked with producer Tom Rothrock. In April and May 2005 the group toured with former Grateful Dead drummer Mickey Hart as Hydra; the tour received mixed reviews from many Deadheads who were unaccustomed to Particle's electronic-based approach. Bassist Phil Lesh, also of the Grateful Dead, sat in with the band that summer.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Rock, progressive rock, jam band, electronica, funktronica,[1] livetronica[2]"
      ],
      "Years active": [
         "2000–present"
      ],
      "Associated acts": [
         "Phil Lesh and Friends, Mickey Hart, Headtronics, Quixotic, Brothers Past, Bio Diesel"
      ],
      "Website": [
         "www.particlepeople.com"
      ],
      "Members": [
         "Steve Molitz keys, synths, vocals",
         "Mike Daum guitar, vocals",
         "Clay Parnell bass",
         "Kito Bovenschulte drums"
      ],
      "Past members": [
         "Dave Simmons",
         "Ben Combe",
         "Eric Gould",
         "Darren Pujalet",
         "Charlie Hitchcock",
         "Brandon Draper",
         "Scott Metzger"
      ]
   }
}