{
   "Name": "Pat McGee Band",
   "rawData": [
      "The Pat McGee Band is a rock band from Richmond, Virginia.  Formed by frontman Pat McGee, who attended Longwood College in Farmville, VA. On the heels of his solo release From the Wood in 1995, the Pat McGee Band signed with Warner Bros. Records subsidiary Giant Records in 1999.   Shine, the band's major-label debut, was released in 2000 with the national singles \"Runaway\" and \"Rebecca\".  After two years of delays, the band released their second album with Warner, Save Me, in 2004.  The band was dropped from the label that year and picked up by Kirtland Records.  An enhanced Save Me is now being distributed through Kirtland with the radio single \"Must Have Been Love\".  \n",
      "Former guitarist and vocalist Al Walsh left the band in an amicable split at the end of 2001.  Keyboardist and vocalist Jonathan Bryan Williams left in 2003 but rejoined the band in late 2005.  Both were significant contributors to the band's sound, particularly in the form of backing vocals.  The band didn't see another background vocalist until the 2003 addition of keyboardist/guitarist Todd Wright.  \n",
      "Longtime bassist John Small left the band in 2004.  With Jonathan's return, Todd Wright has left the band. Todd is now finding success as the front man of his own band, Getaway Car, where he's backed by guitarist Matt Miceli and Crix Reardon - while still a part of Pat McGee Band - on bass.\n"
   ],
   "infobox": {
      "Origin": [
         "Richmond, Virginia, USA"
      ],
      "Genres": [
         "Rock, folk"
      ],
      "Years active": [
         "1996–present"
      ],
      "Labels": [
         "Giant",
         " Warner Bros.",
         " Kirtland"
      ],
      "Associated acts": [
         "Getaway Car"
      ],
      "Website": [
         "www.patmcgee.net"
      ],
      "Members": [
         "Brian Fechino",
         "Chardy McEwan",
         "Pat McGee",
         "Chris \"Crix\" Reardon",
         "Jonathan Bryan Williams",
         "Patrick \"Trick\" McAloon"
      ],
      "Past members": [
         "John Small",
         "Al Walsh",
         "Chris Williams",
         "Todd Wright"
      ]
   },
   "albums": [
      "From the Wood",
      "Revel",
      "General Admission",
      "Shine",
      "Save Me",
      "Drive-By Romance",
      "Save Me",
      "Save Me",
      "Vintage Stages Live",
      "These Days (The Virginia Sessions)",
      "These Days (The Virginia Sessions)",
      "Live From The Southland",
      "No Wrong Way to Make it Right",
      "Pat McGee",
      "Sugar Packet"
   ],
   "prunedData": [
      "The [BAND_NAME] is a [GENRE] band from Richmond, Virginia.  Formed by frontman Pat McGee, who attended Longwood College in Farmville, VA. On the heels of his solo release From the Wood in [YEAR], the [BAND_NAME] signed with Warner Bros. Records subsidiary Giant Records in [YEAR].   Shine, the band's major-label debut, was released in [YEAR] with the national singles [SONG_NAME].  \n",
      "Former guitarist and vocalist Al Walsh left the band in an amicable split at the end of [YEAR].  Keyboardist and vocalist [PERSON_NAME_FULL_0_MALE] left in [YEAR] but rejoined the band in late [YEAR].  Both were significant contributors to the band's sound, particularly in the form of backing vocals.  The band didn't see another background vocalist until the [YEAR] addition of keyboardist/guitarist Todd Wright.  \n",
      "Longtime bassist John Small left the band in [YEAR].  With Jonathan's return, [PERSON_NAME_FULL_1_MALE] has left the band. [PERSON_NAME_FIRST_1] is now finding success as the front man of his own band, Getaway Car, where he's backed by guitarist [PERSON_NAME_FULL_0_MALE] and Crix Reardon - while still a part of [BAND_NAME] - on bass.\n"
   ]
}