{
   "Name": "Sons of Champlin",
   "Sections": [
      "1 Early years",
      "2 History (1968-1977)",
      "3 Later years",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Live albums",
      "4.3 Compilation albums",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Sons of Champlin are an American rock band, from Marin County in the San Francisco-Bay area, formed in 1965.[1][2][3][4] They are fronted by vocalist/keyboardist/guitarist Bill Champlin, who later joined rock band Chicago, from 1981–2009, placing Sons of Champlin on hiatus from 1981–1996.  They brought to the late 60's music scene in the Bay Area a soulful sound built around a horn section, sophisticated arrangements, philosophical themes, Bill Champlin's songwriting and blue-eyed soul singing, and Terry Haggerty's jazz-based guitar. They are one of the 1960s San Francisco bands, along with Jefferson Airplane, the Grateful Dead and Moby Grape.[5]\n"
      ]
   },
   "Early years": {
      "text": [
         "Champlin started his musical career in high school (Tamalpais in Mill Valley) as a member of a local band, The Opposite Six.  One of his teachers encouraged Champlin to drop out of school and pursue music full-time.  In 1965 the draft claimed the drummer and bass player of the Opposite Six, and Champlin joined forces with guitarist Terry Haggerty,[6] sax player Tim Cain, bassist John Prosser and drummer Jim Meyers in the band that became the Sons of Champlin.  By late 1967 the lineup had changed to include keyboardist/saxman Geoff Palmer, trumpeter Jim Beem, bassist Al Strong, and drummer Bill Bowen, creating a Hammond B3-and-horns sound that was distinctive from the rest of the Bay Area's psychedelic guitar bands.\n",
         "The Sons recorded their first album, Fat City in 1967 for Trident Records, owned by Kingston Trio manager Frank Werber.  They released a single, \"Sing Me a Rainbow,\" (B-side \"Fat City\") which got airplay in the Bay Area but did not crack the national charts.[7]  The plan was to follow this release with another song from the album, a Barry Mann/Cynthia Weil composition called \"Shades of Grey\", but the Monkees released their version before this could happen. The album was not released and the Sons left Trident Records. In February 1999, this collection was released on a British CD under the title Fat City.\n",
         "During the late 1960s, The Sons of Champlin performed regularly at the San Francisco venues, the Avalon Ballroom and the Fillmore West and the (former) Chateau Liberté venue in the mountains above San Jose.[8] They shared billing with, among many others, the Grateful Dead, Jefferson Airplane, Quicksilver Messenger Service, Country Joe and the Fish, and The Youngbloods. They were also the opening act at The Band's first concert at which they used the name \"The Band,\" along with The Ace of Cups.[9]\n"
      ]
   },
   "History (1968-1977)": {
      "text": [
         "In 1968, the Sons of Champlin signed with Capitol Records, releasing their double-album debut Loosen Up Naturally in April 1969. The group followed up with The Sons released that fall. To promote this album The Sons set out on a two-month national tour, culminating with an engagement at the Fillmore East. However, this tour strained relations between the members and in February 1970, The Sons broke up. Bill Champlin moved to Santa Cruz, where he joined Moby Grape guitarist Jerry Miller in a short-lived project called The Rhythm Dukes.[10]\n",
         "The Sons reformed in late 1970 as a five-piece band without Cain to record Follow Your Heart, their final Capitol LP. However, The Sons broke up once more following the album's release in April, 1971. When the group reformed again in the summer it featured a new rhythm section, with drummer Bill Vitt and bassist David Schallock (from Big Brother and the Holding Company) replacing Bowen and Strong, respectively.[11]  Briefly, the group went by the name Yogi Phlegm,[12] as which they played one of the last concerts at Bill Graham’s Fillmore West on July 3, 1971.  In 1972, James Preston replaced Bill Vitt on drums, and the band once again went by the name Sons of Champlin.\n",
         "After recording their 1973 Columbia album, Welcome to the Dance, as a five piece, The Sons once again added a horn section, which included Mark Isham, now a film scorer and composer, on trumpet and synthesizer.\n",
         "In 1975, The Sons recorded The Sons of Champlin in their own studio, and released it on their own label, Goldmine Records.  This was purchased and re-released by Ariola America.  The next two albums, Circle Filled With Love and Loving is Why, were also released on Ariola.\n",
         "On August 6, 1977, the Sons of Champlin played what many assumed to be their last gig at the Kirkwood Meadows ski resort opening for Elvin Bishop and Dave Mason. After this performance, Champlin left the group to pursue work as a session vocalist in Los Angeles.\n",
         "The Sons released seven albums between 1969 and 1977, including Loosen Up Naturally, Welcome to the Dance, and Circle Filled With Love.  The albums were generally well-reviewed, but were low sellers.  In 1977, Champlin went solo, recording Single (1978) and Runaway (1981), before joining Chicago in 1981.\n"
      ]
   },
   "Later years": {
      "text": [
         "After Bill Champlin departed, The Sons did continue briefly, through 1978, with former Pablo Cruise singer Bud Cockrell in place of Champlin.\n",
         "On November 25, 1985, the Sons reunited for the first time in a surprise appearance at the Fillmore in San Francisco on a bill with Huey Lewis and the News, KBC Band and a reunited Country Joe and the Fish. The reunion comprised Champlin, Terry Haggerty, Geoffrey Palmer, Tim Cain, David Schallock and James Preston with Huey Lewis and the News drummer Bill Gibson sitting in as well as the Freaky Executives Horn Section, who provided the brass.\n",
         "The 1985 show proved to be a one-off as Champlin returned to his regular gig with Chicago. But in 1997, the Sons got together again for a series of reunion gigs, then recorded and released their first live CD in 1998.  Beginning in 2002, The Sons put out several CDs, Hip L'il Dreams and Secret (both produced by Gary Platt,[13] Bill Champlin [14] & Tom Saviano [15]), among them, and have also remastered much of their back catalog.\n",
         "The Sons of Champlin appeared with original members Champlin, Palmer, Schallock, Preston and Cain. Haggerty was replaced by Tal Morris then Carmen Grillo.[16] Tom Saviano [17] and Marc Russo of the Doobie Brothers were saxophone players during Cain's absence from the band. Tower of Power alumnus Mic Gillette handled trumpet, trombone, and tuba parts until his death in January 2016.[18] After James Preston's death in 2014 [19] Alan Hertz joined the band as its drummer with Jeff Lewis on trumpet. Bobby Vega was part of the band on bass upon the departure of Schallock, followed by Richard Mithun. Tamara Champlin was added as a vocalist[20] and Douglas Rowan as the saxophone player. Solo artist, finalist on the Voice (TV series), Will Champlin,[21] has guested with the Sons as a player and vocalist.\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Live albums": {},
      "Compilation albums": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Sons of Champlin are an American rock band, from Marin County in the San Francisco-Bay area, formed in 1965.[1][2][3][4] They are fronted by vocalist/keyboardist/guitarist Bill Champlin, who later joined rock band Chicago, from 1981–2009, placing Sons of Champlin on hiatus from 1981–1996.  They brought to the late 60's music scene in the Bay Area a soulful sound built around a horn section, sophisticated arrangements, philosophical themes, Bill Champlin's songwriting and blue-eyed soul singing, and Terry Haggerty's jazz-based guitar. They are one of the 1960s San Francisco bands, along with Jefferson Airplane, the Grateful Dead and Moby Grape.[5]\n",
      "Champlin started his musical career in high school (Tamalpais in Mill Valley) as a member of a local band, The Opposite Six.  One of his teachers encouraged Champlin to drop out of school and pursue music full-time.  In 1965 the draft claimed the drummer and bass player of the Opposite Six, and Champlin joined forces with guitarist Terry Haggerty,[6] sax player Tim Cain, bassist John Prosser and drummer Jim Meyers in the band that became the Sons of Champlin.  By late 1967 the lineup had changed to include keyboardist/saxman Geoff Palmer, trumpeter Jim Beem, bassist Al Strong, and drummer Bill Bowen, creating a Hammond B3-and-horns sound that was distinctive from the rest of the Bay Area's psychedelic guitar bands.\n",
      "The Sons recorded their first album, Fat City in 1967 for Trident Records, owned by Kingston Trio manager Frank Werber.  They released a single, \"Sing Me a Rainbow,\" (B-side \"Fat City\") which got airplay in the Bay Area but did not crack the national charts.[7]  The plan was to follow this release with another song from the album, a Barry Mann/Cynthia Weil composition called \"Shades of Grey\", but the Monkees released their version before this could happen. The album was not released and the Sons left Trident Records. In February 1999, this collection was released on a British CD under the title Fat City.\n",
      "During the late 1960s, The Sons of Champlin performed regularly at the San Francisco venues, the Avalon Ballroom and the Fillmore West and the (former) Chateau Liberté venue in the mountains above San Jose.[8] They shared billing with, among many others, the Grateful Dead, Jefferson Airplane, Quicksilver Messenger Service, Country Joe and the Fish, and The Youngbloods. They were also the opening act at The Band's first concert at which they used the name \"The Band,\" along with The Ace of Cups.[9]\n"
   ],
   "infobox": {
      "Also known as": [
         "The Sons, The Opposite Six, Yogi Phlegm, The Nu Boogaloo Express, The Masterbeats"
      ],
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "R&B, psychedelic rock, funk"
      ],
      "Years active": [
         "1965–1970, 1971–1977, 1985, 1997–present"
      ],
      "Labels": [
         "Capitol, Columbia, Ariola, Arista, Goldmine Records, Trident Records, Sons of Champlin, Dig Music, Big Beat"
      ],
      "Associated acts": [
         "Tower of Power, Cold Blood, Chicago, The Rhythm Dukes"
      ],
      "Website": [
         "SonsofChamplin.com"
      ],
      "Members": [
         "Bill Champlin",
         "Geoffrey Palmer",
         "Tim Cain",
         "Tamara Champlin",
         "Carmen Grillo",
         "Jeff Lewis",
         "Alan Hertz",
         "Richard Mithun",
         "Douglas Rowan"
      ],
      "Past members": [
         "Terry Haggerty",
         "James Preston",
         "John Prosser",
         "Jim Meyers",
         "Jim Beem",
         "Al Strong",
         "Bill Bowen",
         "Bill Vitt",
         "Mark Isham",
         "Mic Gillette",
         "Tal Morris",
         "David Schallock ",
         "Tom Saviano",
         "Rob Moitoza"
      ]
   }
}