{
   "Name": "Perpetual Groove",
   "rawData": [
      "Perpetual Groove (or PGroove) is an American jam band that originated in 1997 in Savannah, Georgia. PGroove incorporated a mix of traditional Southern rock, funk, jazzy improvisation, indie rock and synth loops. The members continue to work on solo and side projects.\n",
      "The band's founding members include Brock Butler on guitar and lead vocals, Adam Perry on bass, Joe Stickney on drums and Brett Hinton on keyboards.  The four met at Savannah College of Art and Design during their first year. After graduation, Stickney and Hinton both left the band.  In 2001, drummer Albert Suttle and keyboardist Matt McDonald, both then active-duty members of the US Army, met Butler and Perry at a Savannah open-mic night and soon joined Perpetual Groove. After moving out of Savannah, they settled in the musically dominated college-town of Athens, GA - home of R.E.M., Widespread Panic, B52's and many more musical acts over the years.\n",
      "The band first attracted attention at Jake's Roadhouse in Atlanta and JJ Cagney's on Savannah's Bay Street, which eventually relocated to River Street and later became The Live Wire Music Hall. They played a very notable show at J. J. Cagney's, which was a private party for the cast and crew of Midnight in the Garden of Good and Evil with several other local bands, including The Eric Culberson Trio and a group called \"Ciaxa\" led by Joe and Eric Layden, who would later form the international jam/funk revue band \"The Looters\". Actors Paul Hipp and Jack Thompson also performed with the bands.\n"
   ],
   "infobox": {
      "Origin": [
         "Savannah, Georgia, United States"
      ],
      "Genres": [
         "Rock, Jam Band"
      ],
      "Years active": [
         "1997–2013, 2015-"
      ],
      "Labels": [
         "Tree Leaf Records"
      ],
      "Members": [
         "Brock Butler, Adam Perry, Matt McDonald, Albert Suttle"
      ],
      "Past members": [
         "Joe Stickney, Brett Hinton, John Hruby"
      ]
   }
}