{
   "Name": "Perpetual Groove",
   "Sections": [
      "1 History",
      "2 Hiatus",
      "3 Amberland",
      "4 Lighting",
      "5 Discography",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Perpetual Groove (or PGroove) is an American jam band that originated in 1997 in Savannah, Georgia. PGroove incorporated a mix of traditional Southern rock, funk, jazzy improvisation, indie rock and synth loops. The members continue to work on solo and side projects.\n"
      ]
   },
   "History": {
      "text": [
         "The band's founding members include Brock Butler on guitar and lead vocals, Adam Perry on bass, Joe Stickney on drums and Brett Hinton on keyboards.  The four met at Savannah College of Art and Design during their first year. After graduation, Stickney and Hinton both left the band. [1] In 2001, drummer Albert Suttle and keyboardist Matt McDonald, both then active-duty members of the US Army, met Butler and Perry at a Savannah open-mic night and soon joined Perpetual Groove. After moving out of Savannah, they settled in the musically dominated college-town of Athens, GA - home of R.E.M., Widespread Panic, B52's and many more musical acts over the years.\n",
         "The band first attracted attention at Jake's Roadhouse in Atlanta and JJ Cagney's on Savannah's Bay Street, which eventually relocated to River Street and later became The Live Wire Music Hall. They played a very notable show at J. J. Cagney's, which was a private party for the cast and crew of Midnight in the Garden of Good and Evil with several other local bands, including The Eric Culberson Trio and a group called \"Ciaxa\" led by Joe and Eric Layden, who would later form the international jam/funk revue band \"The Looters\". Actors Paul Hipp and Jack Thompson also performed with the bands.\n",
         "As crowds grew, they played larger venues such as Loco's, the [Lucas Theater] (New Year's Eve 2003), SCAD's [Trustees Theater], the Armstrong Center at Armstrong Atlantic State University and [The Roundhouse Railroad Museum]. In 2006, PGroove started playing hometown benefit concerts for the Jolly Foundation, in honor of Butler's childhood friend Mary Ellen McKee. Also in 2006, PGroove relocated from Savannah to Athens, Georgia. The Georgia Theatre in Athens had become one of the band's main venues prior to the move, prompting the idea for a new homebase.\n",
         "PGroove's first wider US tour was in 2003. They toured the country extensively, gaining a new legion of die-hard fans in New England and the Northeast, and a strong following on the West Coast, along with an ever-growing fan-base in the South. They also played in Japan, Amsterdam and aboard cruise ships at the Jam Cruise and Xingolati music festivals. Early on, PGroove began earning a reputation for their touring and hard work.\n",
         "John Hruby replaced McDonald on keyboards in June 2008, making the line-up of Butler, Perry, Suttle and Hruby from 5/25/08 until 01/01/2012. McDonald played his final official show with the band their Amberland festival on May 25, 2008. He left on amicable terms to focus on his family. McDonald continued to compose and produce music independently under the name which bore his initials M.S.M. and stood for \"My Subversive Media\" and still occasionally played with Brock Butler and Perpetual Groove.  McDonald also joined the indie-rock act SeepeopleS for a brief time and was featured on SeepeopleS' fourth album, \"Apocalypse Cow Vol. 2.\" On June 16, 2008 the band announced that John Hruby, formerly of Ohio jam band \"Guest\", was their new keyboard player. He is a long-time friend of the band and was part of an earlier side project, \"The Ruins\" with Butler, Perry, and drummer Travis Cline of Atlanta's Captain Soularcat. Hruby had previously worked as a producer at Atlanta's Zone Studios where worked on albums for hip-hop acts such as Ciara, Ludacris, David Banner and The Ying Yang Twins.\n",
         "In November 2011, Perpetual Groove announced that John Hruby would be leaving the band, and Matt McDonald would be returning to playing full-time. The new, yet familiar lineup of Perpetual Groove was immediately dubbed as PG 2.012 by fans, referring to the reunion year and cementing the \"definitive lineup\" of the band.[2]\n"
      ]
   },
   "Hiatus": {
      "text": [
         "On January 13, 2013 pgroove.com released a message from the band saying they would be taking a hiatus at the end of the tour.[3] Albert, Matt and Adam will continue touring and recording under the new name Ghost Owl.[4] Brock apologized to fans saying he needs time off to break bad habits and create new good ones.[5] Brock stated that a reunion is not out of the question at some point but he cannot promise or give any time frame. The band performed its final show in front of a sold out audience at the Georgia Theatre in Athens, GA on April 5, 2013.\n",
         "On February 10, 2015, the band announced on Facebook that it was reuniting for a show at the Georgia Theatre on May 29, 2015 and played at Pisgah Brewing Co. in Black Mountain, NC on August 29, 2015.  The band was also announced as the surprise headliner for the Resonance Music & Arts Festival in Ohio in September.\n",
         "On September 5, 2017, the band launched a Kickstarter campaign [6] to make a new album.  The new album, self-titled Perpetual Groove, was released to backers as a digital download on May 2, 2019.\n"
      ]
   },
   "Amberland": {
      "text": [
         "\nThe band hosted their own gathering every Memorial Day weekend known as \"Amberland\". It began as a party for friends and family on the property of Mark Day in Jefferson, GA, but had outgrown its Jackson County roots and relocated each year. From 2007 to 2012, Amberland was held at Cherokee Farms, just outside LaFayette in northwest Georgia. The band played long sets over the weekend and Brock Butler traditionally played an acoustic set, known as BrockFest on Sunday mornings during the weekend. Amberland X (May 2011) was the first of the festivals to feature opening acts, with bands like Moon Taxi, Zoogma, Mantras, Under The Porch, Former Champions, and Noise[Org] who all opened for P-Groove during their regular touring seasons."
      ]
   },
   "Lighting": {
      "text": [
         "P-Groove had a long relationship with lighting designer Jason Huffer, whose work with intelligent lights and experimental stage set-ups has garnered much attention throughout the fan community as well as the music industry. Huffer is now working full-time with the band moe. [This is no longer true as of 2015]. Josey Hunt shortly worked as the lighting designer, and now works at the Georgia Theatre in Athens, GA.  Matt Mercier and Owen Pike of Liquid Lux Light Design toured with the band from late summer 2011 until April 2013, bringing innovative programming, creative rigs and ever expanding equipment to the P-Groove lighting experience.\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Perpetual Groove (or PGroove) is an American jam band that originated in 1997 in Savannah, Georgia. PGroove incorporated a mix of traditional Southern rock, funk, jazzy improvisation, indie rock and synth loops. The members continue to work on solo and side projects.\n",
      "The band's founding members include Brock Butler on guitar and lead vocals, Adam Perry on bass, Joe Stickney on drums and Brett Hinton on keyboards.  The four met at Savannah College of Art and Design during their first year. After graduation, Stickney and Hinton both left the band. [1] In 2001, drummer Albert Suttle and keyboardist Matt McDonald, both then active-duty members of the US Army, met Butler and Perry at a Savannah open-mic night and soon joined Perpetual Groove. After moving out of Savannah, they settled in the musically dominated college-town of Athens, GA - home of R.E.M., Widespread Panic, B52's and many more musical acts over the years.\n",
      "The band first attracted attention at Jake's Roadhouse in Atlanta and JJ Cagney's on Savannah's Bay Street, which eventually relocated to River Street and later became The Live Wire Music Hall. They played a very notable show at J. J. Cagney's, which was a private party for the cast and crew of Midnight in the Garden of Good and Evil with several other local bands, including The Eric Culberson Trio and a group called \"Ciaxa\" led by Joe and Eric Layden, who would later form the international jam/funk revue band \"The Looters\". Actors Paul Hipp and Jack Thompson also performed with the bands.\n",
      "As crowds grew, they played larger venues such as Loco's, the [Lucas Theater] (New Year's Eve 2003), SCAD's [Trustees Theater], the Armstrong Center at Armstrong Atlantic State University and [The Roundhouse Railroad Museum]. In 2006, PGroove started playing hometown benefit concerts for the Jolly Foundation, in honor of Butler's childhood friend Mary Ellen McKee. Also in 2006, PGroove relocated from Savannah to Athens, Georgia. The Georgia Theatre in Athens had become one of the band's main venues prior to the move, prompting the idea for a new homebase.\n"
   ],
   "infobox": {
      "Origin": [
         "Savannah, Georgia, United States"
      ],
      "Genres": [
         "Rock, Jam Band"
      ],
      "Years active": [
         "1997–2013, 2015-"
      ],
      "Labels": [
         "Tree Leaf Records"
      ],
      "Members": [
         "Brock Butler, Adam Perry, Matt McDonald, Albert Suttle"
      ],
      "Past members": [
         "Joe Stickney, Brett Hinton, John Hruby"
      ]
   }
}