{
   "Name": "The Radiators (American band)",
   "Sections": [
      "1 Music style",
      "2 History",
      "2.1 The early years",
      "2.2 The Epic years",
      "2.3 The 1990s and Rattlesby",
      "2.4 The new century",
      "2.5 Breakup",
      "2.6 Reunions",
      "3 Fish iconography",
      "4 Fan krewes and balls",
      "5 Members",
      "6 Discography",
      "6.1 Albums",
      "6.2 Compilations",
      "6.3 DVDs",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "The Radiators, also known as The New Orleans Radiators, are a rock band from New Orleans, Louisiana, who combined the traditional musical styles of their native city with more mainstream rock and R&B influences to form a bouncy, funky variety of swamp-rock they called fish-head music.  Described by OffBeat magazine as \"New Orleans' longest-running and most successful rock band\",[1]  The Radiators' had only limited commercial success, with only a handful of chart appearances, but, as a party band from a party town, their enthusiastic live performances, danceable beats and relentless touring earned the band a dedicated following and the admiration of many of their peers.  \n",
         "In a feat of continuity rarely seen in the rock music world, the five-man line up in the year of their breakup (2011) is the same one as when the band formed in 1978.  They performed at every New Orleans Jazz & Heritage Festival from their inception until their retirement (1979 - 2011). [2]\n",
         "The Radiators had a repertoire which included over three hundred original songs—many never released on album—and over one thousand covers (or partial covers used as part of a medley).  With the band's approval, over 500 concert recordings have been made available for free (for non-commercial use) on the Internet Archive.\n",
         "On June 10, 2011, at Tipitina's in New Orleans, LA, during the second of their final three concerts, The Radiators were inducted into The Louisiana Music Hall of Fame.\n",
         "\n"
      ]
   },
   "Music style": {
      "text": [
         "The Radiators wore their influences on their sleeve, or, at least, proudly displayed them in concert.  While their albums mainly featured songs written by chief songwriter/keyboardist/vocalist Ed \"Zeke\" Volker and other band members, their concerts typically included a wide variety of music written by other artists.  From the local New Orleans scene, The Radiators often featured works by, among others, The Meters, Dr. John, Allen Toussaint, Fats Domino, Earl King, Jelly Roll Morton, and, of course, Professor Longhair, several of whom played with The Radiators at one time or another.  The Radiators also covered songs traditionally associated with New Orleans or Mardi Gras, such as Iko Iko and St. James Infirmary Blues.\n",
         "From the world of the blues, The Radiators performed standards by Robert Johnson, Muddy Waters, Jimmy Reed, Lightnin' Hopkins, Howlin' Wolf and more.  They also covered early rock and roll and R&B artists such as Elvis Presley, Ray Charles, Chuck Berry and Mose Allison.\n",
         "Other obvious influences were from outside of the music of New Orleans, coming from the popular music of the sixties and seventies. Fellow swamp-rockers Creedence Clearwater Revival and J. J. Cale were well represented in The Radiators' repertoire, as are more mainstream acts such as The Beatles, The Rolling Stones, Bob Dylan, Van Morrison, Jimi Hendrix, The Grateful Dead, Eric Clapton, Taj Mahal, The Doors, The Allman Brothers, Marvin Gaye, Smokey Robinson, Sam Cooke, Stevie Wonder, Jesse Winchester, Little Feat (to whom the band are often compared[3][4]) and Parliament-Funkadelic.  Songs by eighties-era artists such as Talking Heads and Elvis Costello showed up in The Radiators' performances as well.\n"
      ]
   },
   "History": {
      "The early years": {
         "text": [
            "As already-established musicians in New Orleans, the newly formed band was quickly able to find work in the city's bars and clubs, including a weekly Wednesday night show at Luigi's Pizza Parlor on Elysian Fields, which was canceled after Bua brought in a real chainsaw during a performance of their song \"Texas Chainsaw Massacre\".[1]  Their high-energy style of rock-and-roll quickly earned them fans among the locals, especially among the students at Tulane University.  Within a couple of years, the band released their first album, Work Done on Premises on their own Croaker label.  Fittingly, for a live act like The Radiators, this was a live double album, taped on May 9, 1980 at Tipitina's club in New Orleans, a favorite venue the Radiators would return to many times in the future.  Most of the songs on Work Done on Premises were written by Ed Volker, with one, \"Hard Core\", credited to the entire band, and another, \"Red Dress\", a collaboration between Volker and guitarist Dave Malone.\n",
            "The following year, the band released their first studio album, Heat Generation, again on the Croaker label.  Like all of the Radiators' studio albums to come, this primarily featured tried-and-tested material from their live shows, rather than new compositions created for the album.  All the songs were penned by Volker except the very short title track, which was credited to the whole band.  Neither album attracted much national attention, but both helped cement the band's reputation in the city of New Orleans.\n",
            "After this brief venture into album-making, the band turned their focus back to what they did best: performing live.  They played massive, marathon-length concerts with an emphasis on funky dance beats mixed with fiery rock licks, and their popularity continued to grow.  As students from Tulane graduated and moved on to other cities, they spread the word about The Radiators,[8] and the band began to establish a fan base beyond New Orleans and Louisiana.\n",
            "It was during this era that The Radiators started playing at the M.O.M.'s Ball, a notorious, private masquerade and concert held in New Orleans each year before Mardi Gras.  Ed Volker's previous band, the Rhapsodizers, had earlier been the featured act at this party, so it was natural for The Radiators to take over.  The M.O.M.'s Ball, put on by the renegade Krewe of Mystic Orphans and Misfits, would become an inspiration for other private parties hosted by groups of Radiators fans in other cities.\n"
         ]
      },
      "The Epic years": {
         "text": [
            "The band's increasing popularity, coupled with winning a battle of the bands sponsored by Epic, attracted the attention of the major labels, and in 1987 the Radiators signed with Epic Records and entered a recording studio for the first time in over half a decade.  The result was Law of the Fish, their first actual hit record, which made it up to #139 on the Billboard charts—almost, but not quite, in the top 100.  The album was compared favorably to acts such as Little Feat and The Allman Brothers Band.[9]\n",
            "Their next album on Epic, 1989's Zig-Zaggin' Through Ghostland, was their biggest release ever, making it all the way up to #122 on Billboard, but it also failed to crack the top 100, and when Total Evaporation, their third album with Epic, failed to make the charts at all, the band and the label parted ways.\n",
            "Later, the label would release Party On, a compilation of songs from The Radiators' three Epic albums, and The Best of the Radiators: Songs from the Ancient Furnace, another compilation with songs from the same three albums, plus some previously unreleased material.  One critic wrote of this last, \"this wasn't the Radiators' best era\".[10]  Even those who agree, however, would have to admit that it was the era of their greatest mainstream success.\n"
         ]
      },
      "The 1990s and Rattlesby": {
         "text": [
            "While traditional rock and roll success had so-far eluded the Radiators, they had, at least, managed to establish a broad enough fan base that they could make regular national tours, and so they did.  In 1992, they released Snafu 10-31-'91, on their old Croaker label.  This was a live album—their first in over a decade—recorded in New Orleans, at a private Halloween party hosted by the Krewe of SNAFU, on October 31, 1991.  This self-published album was not distributed widely, and copies are rare.\n",
            "The Radiators then released another live album, 1994's Bucket of Fish, also on the Croaker Records label, and a studio album, 1995's New Dark Ages on WAR? records out of Colorado.  Then, once more, the band returned to the road and what they did best, touring.\n",
            "More and more cities began hosting special masquerade shows with the Radiators, inspired by the M.O.M.'s Ball, and the band earned the coveted closing spot on one of the main stages at the New Orleans Jazz & Heritage Festival, which is held to this day, and where they often played before crowds of up to thirty thousand people.  In 1998, they released another live album, Live at the Great American Music Hall, recorded at a club in San Francisco.  This album was distributed by another small label, Popmafia, then The Radiators signed with Rattlesby Records, a small label from Georgia, in 2001 to release another studio album titled, simply, The Radiators.  Bucket of Fish and New Dark Ages were also re-released under the Rattlesby label, and continue to be distributed.\n"
         ]
      },
      "The new century": {
         "text": [
            "In January 2004, in honor of their twenty-fifth anniversary, The Radiators decided to hold and film a series of celebratory concerts at Tipitina's, the site where they'd recorded their very first album.  With the help of Image Entertainment, the band created their first concert DVD, Earth vs. The Radiators: the First 25.  Despite the name, this was not a retrospective or a \"greatest hits\" compilation, but simply a record of the band, as they were after twenty-five years together.  The DVD contained the complete concert of January 31, 2004, as well as excerpts from concerts on January 2, January 29 and January 30, and featured numerous guests, including Gregg Allman, Maceo Parker, George Porter, Jr. of The Meters, and members of Bonerama.  A CD of the same name, but featuring an almost completely different set of songs from the same shows, was released at the same time.\n",
            "After floods in the wake of Hurricane Katrina destroyed much of New Orleans in 2005, The Radiators appeared in a hurricane-relief benefit concert broadcast simultaneously on MTV, VH1 and CMT on September 10.  After taping their segment for the benefit in Los Angeles, the band flew to San Francisco for a previous-scheduled concert that same night.  The set list for that concert featured songs that reflected the band's concerns for the events in their home city, including Bob Dylan's \"Crash on the Levee (Down in the Flood)\" and Volker's own \"Hold Back the Flood\".  The first set featured a guest appearance by Grateful Dead guitarist Bob Weir, and the second set finished with a cover of Blind Willie Johnson's \"Everybody Ought to Treat a Stranger Right\", an obvious plea to remember the plight of New Orleans refugees.  A fan recording of this concert quickly became the most downloaded show in the Internet Archive's Radiators collection.\n",
            "In early 2006, in a city still devastated, The Radiators returned to the studio for the first time in five years, to produce Dreaming out Loud, which was released at the New Orleans Jazz Festival in spring of 2006.  The album was initially only available through the band's website, and through local Louisiana distributors, but in fall of 2006, it was picked up by the SCI Fidelity label and given a new cover and national distribution.\n",
            "In November 2006, Bob Zmuda's American version of the Comic Relief charity organization hosted a charity benefit for Katrina victims, and The Radiators were chosen to be the house band for the New Orleans-based segments of the nationally broadcast event.[11]\n"
         ]
      },
      "Breakup": {
         "text": [
            "On November 8, 2010, the following was posted on the band's official website, theradiators.org:\n",
            "FOLD UP THE BIG TOP\n",
            "After 33 years..over 4500 live shows..and a dozen albums..legendary New Orleans rockers The Radiators are finally calling it quits. The band has officially decided to break up in mid-June following their final tour which will include one last New Year's Eve run, a MOMs Ball and also headlining their final appearance at The New Orleans Jazz & Heritage Festival. The band will honor all dates already on their schedule and are planning to add as many shows as possible before ending their storied 33 year career. The guys want to whole-heartedly thank their long time fans for making this ride as amazing as it has been. They truly feel that their fans are the best and most dedicated in the world and have kept their traveling circus alive. Individual band members will announce their plans in the near future.\n",
            "The band's breakup was the result of Ed Volker's decision to retire.[12] The Radiators played a series of final concerts around the country, ending with a final weekend at Tipitina's on June 9–11, 2011.[13]\n"
         ]
      },
      "Reunions": {
         "text": [
            "Despite ceasing to perform regularly as an active band, the Radiators still reunite at least once a year in January for a three-day run at Tipitina's in New Orleans, LA. They have also appeared at the New Orleans Jazz & Heritage Festival in 2014, 2015, 2018 and 2019.  [14] The band played a run of three livestreamed reunion virtual shows at Tipitina's in New Orleans, LA on January 15, 16, 17, of 2021 during the Covid pandemic. [15]\n"
         ]
      },
      "text": [
         "The Radiators were formed in January 1978 after a jam session in keyboardist Ed Volker's garage.  At the time, Volker, Camile Baudoin and Frank Bua, Jr. were in a band called The Rhapsodizers, while Dave Malone and Reggie Scanlan were in a band called Road Apple.[5]  Scanlan had also, not long before, been a member of Professor Longhair's touring band.[6] The five musicians felt an immediate rapport.  Scanlan later said, \"we jammed for five hours straight, then all quit our old bands the next day.[7] On April 6, 2019, Reggie Scanlan recalled how the band came to be \"The Radiators.\"  After joining up and playing many shows together, without a formal band name, it was determined that a name was necessary.  So, back to Volker's garage, after several suggestions, Scanlan suggested the name.  They were in a garage after all. Scanlan said that though the rest of the band liked it, he began to have second thoughts about the name.  So it was to be The Radiators, at least for then.  They may still change it, there's still time.\n"
      ]
   },
   "Fish iconography": {
      "text": [
         "From the earliest days, The Radiators used fish and fish-related themes in their iconography.  They refer to their music as \"Fish Head Music\" and their fans call themselves \"Fishheads\" (similar to the term \"Deadheads\" used for fans of the Grateful Dead, not to be confused with \"Phish Heads\", fans of the American jam band Phish ).  Their first self-owned label was \"Croaker\", named for the common variety of fish.  Their album covers, album and song names, and lyrics were also full of fishy references.\n"
      ]
   },
   "Fan krewes and balls": {
      "text": [
         "The Radiators association with masquerade balls started with their appearances at the annual private party, the M.O.M.s Ball, in New Orleans, hosted by the Krewe of Mystic Orphans and Misfits.  The M.O.M.'s Ball started in 1972, predating the creation of The Radiators, but by the early eighties, The Radiators had become the designated musical entertainment for the ball.  Each year, the ball was given its own special title. For example, the 1984 M.O.M.'s Ball was titled Void Where Not Prohibited, and in 2002, the title was Forever Tongue.\n",
         "As the band's popularity spread beyond New Orleans, groups of fans began organizing themselves into regional clubs, called krewes in imitation of the traditional New Orleans Carnival krewes, rather than forming one central fan club.  These clubs adopted fanciful names, such as the Krewe of DADs[16] in Minneapolis – Saint Paul (one of the first such groups), the Krewe of Degenrate, the Monkeykrewe[17] in Florida, the Krewe de Playa[18] in Los Angeles and the Krewe of SNAFU[19] in the band's home town of New Orleans.  These krewes began holding special private parties featuring The Radiators, usually masquerade balls like the M.O.M.s Ball.  Also like the M.O.M.'s Ball, these parties are usually given both collective and individual names.  For example, the Krewe of DADs hosts the annual DAD's Ball (an obvious homage to the M.O.M.'s Ball), and the 2003 DAD's Ball was titled Grin and Bare It.\n",
         "The Radiators frequently composed special songs for these parties, inspired by the party's subtitle.  Usually, these songs are throw-aways—simple modifications of existing, well-known songs.  But sometimes a whole new song would enter the band's repertoire this way, for example, \"Fuckem If They Can't Take a Joke\" from the 2003 M.O.M.'s Ball or \"S.N.A.F.U\" from the 2008 M.O.M's Ball.  These songs were never released on any album, but they were performed in concert many times from 2003-2011.\n"
      ]
   },
   "Members": {
      "text": [
         "In the early '80s, the band added percussionist and singer Glenn Sears, but he left the band in the '90s.  The final lineup was the same as it was in 1978, when the band was formed.\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Compilations": {},
      "DVDs": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Radiators, also known as The New Orleans Radiators, are a rock band from New Orleans, Louisiana, who combined the traditional musical styles of their native city with more mainstream rock and R&B influences to form a bouncy, funky variety of swamp-rock they called fish-head music.  Described by OffBeat magazine as \"New Orleans' longest-running and most successful rock band\",[1]  The Radiators' had only limited commercial success, with only a handful of chart appearances, but, as a party band from a party town, their enthusiastic live performances, danceable beats and relentless touring earned the band a dedicated following and the admiration of many of their peers.  \n",
      "In a feat of continuity rarely seen in the rock music world, the five-man line up in the year of their breakup (2011) is the same one as when the band formed in 1978.  They performed at every New Orleans Jazz & Heritage Festival from their inception until their retirement (1979 - 2011). [2]\n",
      "The Radiators had a repertoire which included over three hundred original songs—many never released on album—and over one thousand covers (or partial covers used as part of a medley).  With the band's approval, over 500 concert recordings have been made available for free (for non-commercial use) on the Internet Archive.\n",
      "On June 10, 2011, at Tipitina's in New Orleans, LA, during the second of their final three concerts, The Radiators were inducted into The Louisiana Music Hall of Fame.\n"
   ],
   "infobox": {
      "Origin": [
         "New Orleans, Louisiana, United States"
      ],
      "Genres": [
         "Swamp rock, roots rock, Southern rock, jam rock"
      ],
      "Years active": [
         "1978–2011, sporadically from 2011-present"
      ],
      "Labels": [
         "Croaker, Epic, Rattlesby, SCI Fi"
      ],
      "Website": [
         "www.theradiators.org"
      ],
      "Members": [
         "Ed Volker ",
         " Dave Malone ",
         " Camile Baudoin ",
         " Reggie Scanlan ",
         " Frank Bua, Jr."
      ],
      "Past members": [
         "Glenn Sears"
      ]
   }
}