{
   "Name": "Railroad Earth",
   "rawData": [
      "Railroad Earth is a bluegrass-influenced American band formed in Stillwater, New Jersey in 2001. The band's music combines elements of progressive bluegrass, folk, rock, country, jazz, Celtic and other Americana influences. Recognized as \"carrying on the tradition of improvisational, genre-spanning music laid forth by the Grateful Dead,\" Railroad Earth is known for lyrical songwriting and extensive live improvisation. The band takes its name from the Jack Kerouac prose poem \"October in the Railroad Earth\". The band also has a song of the same name.\n",
      "The band was originally formed in 2001, and was composed of vocalist/guitarist/songwriter Todd Sheaffer, violinist/vocalist Tim Carbone, mandolinist John Skehan, multi-instrumentalist Andy Goessling, drummer/vocalist Carey Harmon, and bassist Dave Von Dollen. Though each member was aware of one another, it was only Todd, Tim, and Andy who had played together. Tim, had joined Todd's band From Good Homes on stage, in addition Tim and Andy having a 20-year friendship through their former bands, The Blue Sparks From Hell, and New Jersey rock outfit Kings in Disguise. When rehearsal's of original music, mostly written by Sheaffer, began occurring, the band soon realized that something musically unique was happening. After three weeks of rehearsing, they went into a local recording studio to track a five-song demo. Recorded live with no overdubs except backing vocals, this untitled demo set Railroad Earth's career in motion.  Within a week, they landed a slot at Telluride Bluegrass Festival, an appearance that was only the new band's tenth as Railroad Earth. The previous nine gigs had been little more than warm-ups at small North Jersey bars and Elks lodges and a couple of support slots for regional bands. Realizing immediately how strong the initial five-song demo was, the band decided to return to the same studio to cut another five tracks to complete an album for release in time to debut at the Telluride Bluegrass Festival. In early April 2001, the band tracked another five songs, and The Black Bear Sessions was completed. It was released to the public in June 2001, just one week before their appearance at Telluride. That album contains what are still some of the most popular songs in Railroad Earth's repertoire, including \"Seven Story Mountain,\" \"Head\" and, of course, \"Railroad Earth.\"\n",
      "The band was approached by Sugar Hill Records after seeing their performance at Telluride. Right after their show, Railroad Earth was offered a record deal on the spot.\n"
   ],
   "infobox": {
      "Origin": [
         "Stillwater, New Jersey, United States"
      ],
      "Genres": [
         "Folk rock, Progressive Bluegrass, Bluegrass, Americana, Jam band"
      ],
      "Years active": [
         "2001–present"
      ],
      "Labels": [
         "SCI Fidelity, Black Bear Records, One Haven Music"
      ],
      "Website": [
         "railroad.earth"
      ],
      "Members": [
         "Todd Sheaffer",
         "Tim Carbone",
         "John Skehan",
         "Carey Harmon",
         "Andrew Altman",
         "Mike Robinson",
         "Matt Slocum"
      ],
      "Past members": [
         "Dave Von Dollen",
         "Johnny Grubb",
         "Andy Goessling (deceased)"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band formed in Stillwater, New Jersey in [YEAR]. The band's music combines elements of progressive bluegrass, folk, rock, country, jazz, Celtic and other Americana influences. Recognized as [SONG_NAME]. The band also has a song of the same name.\n",
      "The band was originally formed in [YEAR], and was composed of vocalist/guitarist/songwriter Todd Sheaffer, violinist/vocalist [PERSON_NAME_FULL_1_MALE], mandolinist John Skehan, multi-instrumentalist [PERSON_NAME_FULL_0_MALE], drummer/vocalist [PERSON_NAME_FULL_3_FEMALE], and bassist [PERSON_NAME_FULL_2_MALE]. Though each member was aware of one another, it was only Todd, [PERSON_NAME_FIRST_1], and [PERSON_NAME_FIRST_0] who had played together. [PERSON_NAME_FIRST_1], had joined Todd's band From Good Homes on stage, in addition [PERSON_NAME_FIRST_1] and [PERSON_NAME_FIRST_0] having a [GENRE] bands, The Blue Sparks From Hell, and New Jersey rock outfit Kings in Disguise. When rehearsal's of original music, mostly written by Sheaffer, began occurring, the band soon realized that something musically unique was happening. After three weeks of rehearsing, they went into a local recording studio to track a five-song demo. Recorded live with no overdubs except backing vocals, this untitled demo set [BAND_NAME]'s career in motion.  Within a week, they landed a slot at Telluride Bluegrass Festival, an appearance that was only the new band's tenth as [BAND_NAME]. The previous nine gigs had been little more than warm-ups at small North Jersey bars and Elks lodges and a couple of support slots for regional bands. Realizing immediately how strong the initial five-song demo was, the band decided to return to the same studio to cut another five tracks to complete an album for release in time to debut at the Telluride Bluegrass Festival. In early [MONTH] [YEAR], the band tracked another five songs, and The Black Bear Sessions was completed. It was released to the public in [MONTH] [YEAR], just one week before their appearance at Telluride. That album contains what are still some of the most popular songs in [BAND_NAME]'s repertoire, including [SONG_NAME]\n",
      "The band was approached by Sugar Hill Records after seeing their performance at Telluride. Right after their show, [BAND_NAME] was offered a [GENRE]"
   ]
}