{
   "Band members": {
      "Current members": {
         "text": [
            "\n"
         ]
      },
      "Former members": {
         "text": [
            "\n"
         ]
      },
      "Lineups": {},
      "Timeline": {}
   },
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "During the late 1980s, Bob Weir teamed up with bassist Rob Wasserman and the duo toured for seven years under names such as Weir/Wasserman and Scaring the Children. In 1994, Weir and Wasserman participated in the Woodstock '94 festival. Jay Lane was added on drums and Matthew Kelly on guitar and harmonica in 1995. They played their first show as a full band on April 22, 1995, billed as Friends of Montezuma and then as RatDog Revue. They played their first show as RatDog on August 8, 1995. Jerry Garcia died the next day.\n",
         "RatDog went through a series of personnel changes from 1995 and 2000. Former Grateful Dead keyboardist Vince Welnick performed with the group in late 1995. Former Chuck Berry collaborator Johnnie Johnson performed with the group from February 1996 to May 1997 and was then replaced by Jeff Chimenti who has been with the band ever since. Keyboardist Mookie Siegel also played with the band between 1996 and 1997. Saxophonist Dave Ellis was a member of the group from 1996 until 1999 when he was replaced by Kenny Brooks in 2000 until his departure in 2012. Mark Karan joined on guitar in 1998 until his departure in 2012. Original stand up bassist Rob Wasserman was replaced by bass guitarist Robin Sylvester in 2003. Wasserman rejoined the band in January 2012 and played alongside Sylvester until the former's death in June 2016. The lineup of Bob Weir (rhythm guitar, lead vocals), Jay Lane (drums, vocals), Jeff Chimenti (keyboards, vocals), Kenny Brooks (saxophone, vocals), Mark Karan (lead guitar, vocals) and Robin Sylvester (bass guitar, vocals) was the longest serving lineup of the band. They performed together for nine years from 2003 until 2012, with the exception of 2007 when Karan was replaced briefly by Steve Kimock to battle a health problem.\n",
         "RatDog released their first and, to date, only studio album, Evening Moods in 2000. They released their only official live album Live at Roseland in 2001, although most of the soundboards from their concerts since the mid-2000s were made available for purchase after concerts and online.\n",
         "Throughout 2009 and 2010, original RatDog members Bob Weir, Rob Wasserman and Jay Lane periodically performed under the moniker Scaring the Children.[3]\n",
         "From 2010 through 2013, the number of RatDog's performances were limited while Weir toured with Furthur. Ratdog played 2 shows in both January 2012 and August 2013. In September 2013 it was revealed by Primus bassist Les Claypool that RatDog would be \"getting back together this next year\", as Lane had chosen to leave Primus in order to rejoin RatDog.[4]\n",
         "In February and March 2014, RatDog resumed more extensive touring, with Steve Kimock on lead guitar, Jeff Chimenti on keyboards, Jay Lane on drums, and two bass players, Robin Sylvester and Rob Wasserman.[5] On August 10, 2014, Bob Weir and RatDog cancelled their summer and fall tour dates without explanation.[6] Since early 2014 RatDog has been on hiatus while Bob Weir performs with Dead & Company.\n",
         "Original, and then-current, bassist Rob Wasserman died on June 29, 2016.[7] On August 31st, 2016, Weir reunited Ratdog for a special tribute to Wasserman, at the Sweetwater Music Hall in Mill Valley, CA. Weir welcomed a number of guests to his show, including Steve Kimock, Mark Karan, Dave Ellis, Robin Sylvester, Jeff Chimenti and Jay Lane – all of whom were former and/or present members of RatDog.[8] The band also welcomed Lukas Nelson and DJ Logic, who each sat in with the RatDog ensemble. [8]The event marked the first time that guitarist Mark Karan and saxophonist Dave Ellis had played together in years. Both Karan and Ellis joined RatDog in the late '90s, with Ellis leaving in 1999 and Karan staying on until 2012.[9]\n"
      ]
   },
   "Notable guests": {
      "text": [
         "Since its formation, many guest musicians have performed with RatDog, including Grateful Dead members Mickey Hart, Bill Kreutzmann, Donna Jean Godchaux and Bruce Hornsby. Other well known guests include Joan Baez, Warren Haynes, Jimmy Herring, Derek Trucks, Al Schnier,  Ekoostik Hookah, Trey Anastasio, Les Claypool, Pete Sears, DJ Logic, John Popper, Dickey Betts, Sammy Hagar,  Mike Gordon and Keller Williams.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Notable guests",
      "3 Discography",
      "4 Band members",
      "4.1 Current members",
      "4.2 Former members",
      "4.3 Timeline",
      "4.4 Lineups",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "RatDog is an American rock band. The group began in 1995 as a side project for Grateful Dead guitarist and singer Bob Weir. After the Dead disbanded later that year, RatDog became Weir's primary band.[1] They performed some Grateful Dead songs, a mixture of covers (including Bob Dylan and Chuck Berry tunes), and some originals.[2] RatDog's repertoire consisted of more than 150 songs.  They released two albums – Evening Moods (2000) and Live at Roseland (2001).  RatDog has not toured since July 2014.\n",
         "The lineup of RatDog evolved over time.  Musicians who were members of the band at different times include Rob Wasserman and Robin Sylvester on bass, Jay Lane on drums, Matthew Kelly, Mark Karan, and Steve Kimock on guitar, and Vince Welnick, Johnny Johnson and Jeff Chimenti on keyboards.\n"
      ]
   },
   "Title": "RatDog - Wikipedia"
}