{
   "Name": "RatDog",
   "rawData": [
      "RatDog is an American rock band. The group began in 1995 as a side project for Grateful Dead guitarist and singer Bob Weir. After the Dead disbanded later that year, RatDog became Weir's primary band. They performed some Grateful Dead songs, a mixture of covers (including Bob Dylan and Chuck Berry tunes), and some originals. RatDog's repertoire consisted of more than 150 songs.  They released two albums – Evening Moods (2000) and Live at Roseland (2001).  RatDog has not toured since July 2014.\n",
      "The lineup of RatDog evolved over time.  Musicians who were members of the band at different times include Rob Wasserman and Robin Sylvester on bass, Jay Lane on drums, Matthew Kelly, Mark Karan, and Steve Kimock on guitar, and Vince Welnick, Johnny Johnson and Jeff Chimenti on keyboards.\n",
      "During the late 1980s, Bob Weir teamed up with bassist Rob Wasserman and the duo toured for seven years under names such as Weir/Wasserman and Scaring the Children. In 1994, Weir and Wasserman participated in the Woodstock '94 festival. Jay Lane was added on drums and Matthew Kelly on guitar and harmonica in 1995. They played their first show as a full band on April 22, 1995, billed as Friends of Montezuma and then as RatDog Revue. They played their first show as RatDog on August 8, 1995. Jerry Garcia died the next day.\n"
   ],
   "infobox": {
      "Also known as": [
         "Bob Weir and RatDog, The Ratdog Revue"
      ],
      "Origin": [
         "San Francisco, CA, USA"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1995–present (hiatus since 2014)"
      ],
      "Labels": [
         "Grateful Dead"
      ],
      "Associated acts": [
         "Grateful Dead, The Other Ones, The Dead, Furthur, Dead & Company, Jemimah Puddleduck"
      ],
      "Website": [
         "ratdog.org"
      ],
      "Members": [
         "Bob Weir",
         "Jay Lane",
         "Jeff Chimenti",
         "Robin Sylvester",
         "Steve Kimock"
      ],
      "Past members": [
         "Rob Wasserman",
         "Matthew Kelly",
         "Vince Welnick",
         "Johnnie Johnson",
         "Dave Ellis",
         "Mookie Siegel",
         "Dave McNabb",
         "Mark Karan",
         "Kenny Brooks"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band. The group began in [YEAR] as a side project for Grateful Dead guitarist and singer [PERSON_NAME_FULL_0_MALE]. After the Dead disbanded later that year, [BAND_NAME] became [PERSON_NAME_LAST_0]'s primary band. They performed some Grateful Dead songs, a mixture of covers (including [PERSON_NAME_FIRST_0] Dylan and [PERSON_NAME_FULL_1_MALE] tunes), and some originals. [BAND_NAME]'s repertoire consisted of more than 150 songs.  They released two albums – Evening Moods ([YEAR]) and Live at Roseland ([YEAR]).  [BAND_NAME] has not toured since [MONTH] [YEAR].\n",
      "The lineup of [BAND_NAME] evolved over time.  Musicians who were members of the band at different times include Rob Wasserman and [PERSON_NAME_FULL_1_MALE] on bass, Jay Lane on drums, [PERSON_NAME_FULL_4_MALE], [MONTH]k Karan, and [PERSON_NAME_FULL_2_MALE] on guitar, and [PERSON_NAME_FULL_0_MALE], Johnny Johnson and [PERSON_NAME_FULL_3_MALE] on keyboards.\n",
      "During the late [YEAR]s, Bob Weir teamed up with bassist [PERSON_NAME_FULL_0_MALE] and the duo toured for seven years under names such as Weir/[PERSON_NAME_LAST_0] and Scaring the Children. In [YEAR], Weir and [PERSON_NAME_LAST_0] participated in the Woodstock '94 festival. Jay Lane was added on drums and [PERSON_NAME_FULL_1_MALE] on guitar and harmonica in [YEAR]. They played their first show as a [GENRE] band on [MONTH] 22, [YEAR], billed as Friends of Montezuma and then as [BAND_NAME] Revue. They played their first show as [BAND_NAME] on [MONTH] 8, [YEAR]. Jerry Garcia died the next day.\n"
   ]
}