{
   "Name": "The Sorentinos",
   "Sections": [
      "1 History",
      "2 Musical style and influences",
      "3 Legacy",
      "4 Members",
      "4.1 Current members",
      "4.2 Semi-regular members",
      "4.3 U.K. auxiliary member",
      "4.4 Former members",
      "4.5 Session musicians",
      "5 Discography",
      "5.1 Albums and EPs",
      "5.1.1 as The Sorentinos",
      "5.1.2 as Danny Sorentino",
      "5.1.3 as Lucky Buck And The Winners",
      "5.1.4 as Danny Sorentino And The Sinners",
      "5.1.5 as Popular Beat Combo",
      "5.2 Singles and individual songs",
      "6 Live Performances, Tours and Venues",
      "7 Openers: The Sorentinos as an opening act",
      "8 Musical Gear",
      "9 Album Cover Artwork",
      "10 Photographs and Videos",
      "11 References",
      "11.1 List of references and articles",
      "11.2 External links"
   ],
   "Summary": {
      "text": [
         "The Sorentinos are an American rock music band based in Sonoma County, California, formed in 1985.[1] The main members are Danny Sorentino (lead vocals, guitar, harmonica), Rob Ruiz (bass guitar, backing vocals), Rory Judge (drums), Steve Barbieri (lead guitar, backing vocals), Russ Kerger (keyboards), and Steve Lee (lead guitar, backing vocals).[2]\n",
         "Danny Sorentino, by his own estimation, has written about 1,000 songs.[3] The Sorentinos, including solo albums and side projects by Danny Sorentino,[3] have recorded 26 albums.[4][5][6][7] They have performed thousands of gigs,[8] mostly in the greater San Francisco Bay and North Bay Areas, but also throughout California and the United States, and have toured in the United Kingdom as well.[9][10][11][12][13] They have performed as an opening act for dozens of well-known artists.[14]\n"
      ]
   },
   "History": {
      "text": [
         "Danny Sorentino was born in 1955 in San Francisco, and grew up in the Excelsior District.[15] He moved to Petaluma (Sonoma County) in 1970.[16] He graduated from Rancho Cotate High School in Rohnert Park (Sonoma County), and studied at Santa Rosa Junior College (Santa Rosa, California). He started playing the guitar at age 17, and wrote his first song in 1975.[16] Danny has worked as a longshoreman in the San Francisco Bay Area since 2004, and is a member of the ILWU.[3][17] He and his wife have three grown children and four grandchildren.[3][8] Danny was the founder and lead singer of the rock band The Chills, a precursor band to The Sorentinos.[16]\n",
         "Prior to forming The Chills, Danny Sorentino was a member of the Billy C. Farlow Band from 1979 to the end of 1980.[18] Billy C. Farlow is the former lead singer of Commander Cody and His Lost Planet Airmen.\n",
         "Danny Sorentino formed The Chills in 1981. The initial line-up included Danny Sorentino (lead vocals, guitar, harmonica), Steve Barbieri (lead guitar, backing vocals), Rick Escalante (bass guitar), and Ed Bale (drums). Ellery King took over the bass chair for about nine months, and then Julia Farey (later of the band Big Trouble) took over bass duties for about six months before Rob Ruiz joined as the permanent bass player.\n",
         "Rob Ruiz was born in Oakland, California, and grew up in Concord, California.[19] Rob has worked as a park ranger with Marin County Parks for over 30 years.[19][20] Rob played with the Eureka, Humboldt County-based power trio Rolls Rock.[19][20][21]  Rolls Rock toured nationally in the late 1970s and early 1980s, and opened shows for many well-known acts.[19][20][21] After Rolls Rock disbanded, Rob played with the rock band The Bats.[20] Rob is an avid collector of rock memorabilia.[19][20]\n",
         "Danny Sorentino and Rob Ruiz met at the Mabuhay Gardens nightclub in San Francisco in 1985 when they were with separate bands, The Chills and The Bats, respectively, that shared the same bill one night.[20] (The Chills and The Bats were San Francisco Bay Area-based bands, and unrelated to the New Zealand-based Dunedin sound bands of the same names.)[22][circular reference][23][circular reference] Rob joined forces with The Chills in 1985, and has been a Sorentino ever since.[20]\n",
         "The next line-up included Danny Sorentino (lead vocals, guitar, harmonica), Steve Barbieri (lead guitar, backing vocals), Rob Ruiz (bass guitar, backing vocals), Dave Carlson (lead guitar, backing vocals), and Dean Johnson (drums). Dave Carlson is also a long-time member of the Marin County-based band Tazmanian Devils.[24]\n",
         "Shortly after Rob Ruiz joined The Chills in 1985,[20] the band recorded its first single, \"Heart Of America\" b/w \"I Surrender\". At this point The Chills morphed into Danny Sorentino And The Sinners, and Steve Barbieri and Dave Carlson left the band, and Gary Reynolds took over the lead guitar spot, which made the line-up Danny Sorentino (lead vocals, guitar, harmonica), Rob Ruiz (bass guitar, backing vocals), Gary Reynolds (lead guitar, backing vocals), and Dean Johnson (drums).\n",
         "This line-up lasted for about three years, and was in many ways the \"classic\" line-up. During this time the band did most of their auditions for music industry A&R executives in Los Angeles, and it was during this time that the band was named one of the best unsigned bands in the country by the New Music Seminar (music conference and festival), and they performed at the New Music Seminar in New York City in 1987.\n",
         "In 1988 the band signed with Centerfield Management, and in 1989 they recorded their first studio album Danny Sorentino And The Sinners, at which point Chris Paulsen replaced Dean Johnson on drums.\n",
         "Howard Vatcher (lead guitar) is from Eureka, California, and played with the rock bands Mister Science and Stereotactics prior to joining The Sorentinos.[25] During that time, Howard met Rob Ruiz when Rob was playing for Rolls Rock. Sometime later when Howard relocated to the San Francisco area, Rob asked Howard to join The Sorentinos.[25] Howard and his twin brother Don have also released several albums of their own music, as members of the San Francisco Bay Area-based electronic rock duo The Vatcher Brothers.[25][26] Howard left The Sorentinos in 2014.\n",
         "Rory Judge (drums) moved to the west coast from Boston.[27] He is a veteran of the San Francisco music scene of the late 1970s and early 1980s, and has played with a wide variety of bands from punk to polka, and has played with the jazz band On The Air and the roots rock trio The GoldDiggers, and with many local and national jazz musicians, including Howard Alden.[28] Rory Judge is also the owner and executive director of Adventure Camps.[27]\n",
         "Steve Lee (lead guitar) is from San Mateo, California, and joined The Sorentinos in 1994.[29] After being with The Sorentinos for many years in the San Francisco area, Steve relocated to London, England.[29] Though far away, he continues to occasionally record and perform with The Sorentinos.[29] Prior to joining The Sorentinos, Steve played with the rock bands Paradox and Moscow (San Francisco area-based bands).[29] One of his career highlights was opening for Peter Green at the Fillmore West.[29][30] Steve is also the co-producer of The Sorentinos 2005 U.K. Jumping Bat Tour documentary.[10][31]\n",
         "Steve Barbieri (lead guitar) is from Healdsburg, California. He has played on several of The Sorentinos albums, and has been in the current live line-up since Howard Vatcher left the band in 2014.[32] Steve is also a member of Sonoma County-based band Soul Fuse.[33] He has been a part of the Sonoma County music scene for over 30 years, and has been involved in numerous bands and recording projects.[33]\n",
         "Russ Kerger (keyboards) is from Colma, California. He has played on most of The Sorentinos albums since the first Danny Sorentino solo album So Low,[32] and he has been in the current live line-up since 2014. Russ is also a member of western Sonoma County-based band The THUGZ (tribal hippie underground zone).[34]\n",
         "The Sorentinos had a few songs in the 1996 TV movie Co-ed Call Girl,[35][36] and in the 1995 movie Lover's Knot,[37] and in the TV series Beverly Hills, 90210 and Melrose Place in various episodes in the 1990s,[36] and also in the 2011 documentary Worst In Show.[38][39] They have appeared in music videos on cable TV channel MTV in the 1980s,[40] and have had radio airplay on northern California radio stations such as KRCB, KRSH, and KSRO.[3][36]\n",
         "Danny Sorentino has recorded four solo albums (supported by members of The Sorentinos and guest musicians), and two country-flavored albums as Lucky Buck And The Winners, and a new wave-vibe one-off album as Popular Beat Combo.[32]\n",
         "Rob Ruiz is also a member of the San Francisco Bay Area-based power trio The Beer Scouts.[41] This trio includes Rob Ruiz (bass guitar, vocals), Howard Vatcher (guitar, vocals), and Kenny Susan (drums, vocals).[41]\n"
      ]
   },
   "Musical style and influences": {
      "text": [
         "The Sorentinos play a wide variety of styles within the rock music genre, including rock and roll, Americana, blues rock, country rock, folk rock, roots rock, rockabilly, with influences from blues, British blues, R&B, country, folk, jazz, Latin rock, psychedelic rock, and many others.[2][42] Their musical influences include The Beatles, The Rolling Stones, the San Francisco Sound (including the Grateful Dead, Big Brother and the Holding Company, Jefferson Airplane, Hot Tuna, Quicksilver Messenger Service, New Riders of the Purple Sage, Moby Grape, Santana), The Kinks, The Who, The Yardbirds, Cream, Traffic, Led Zeppelin, The Byrds, The Doors, The Allman Brothers Band, Little Feat, Muddy Waters, B.B. King, Chuck Berry, Johnny Cash, Bob Dylan, Neil Young, Van Morrison, Peter Green, John Prine, Tom Petty, and many others.[2][3] Many of these musical artists have been reverently name-checked in the lyrics of many of The Sorentinos songs.\n"
      ]
   },
   "Legacy": {
      "text": [
         "Marin Independent Journal music critic Paul Liberatore wrote: \"[The Sorentinos] should get some kind of an award for maintaining their energy and enthusiasm for as long as they have, churning out albums with first-rate original songs like clockwork, becoming one of the North Bay’s most respected, creative and enduring groups.\"[43][44]\n"
      ]
   },
   "Members": {
      "Current members": {},
      "Semi-regular members": {},
      "U.K. auxiliary member": {},
      "Former members": {},
      "Session musicians": {
         "text": [
            "The following is a list of session musicians who have appeared on one or more of the Sorentinos albums (includes albums recorded as The Sorentinos, as Danny Sorentino, as Lucky Buck And The Winners, as Danny Sorentino And The Sinners, and as Popular Beat Combo), and/or who have performed with one or more of the Sorentinos live line-ups.[32] Further details can be found on the liner notes of the albums.\n"
         ]
      }
   },
   "Discography": {
      "Albums and EPs": {
         "as The Sorentinos": {
            "text": [
               "\n"
            ]
         },
         "as Danny Sorentino": {},
         "as Lucky Buck And The Winners": {},
         "as Danny Sorentino And The Sinners": {},
         "as Popular Beat Combo": {
            "text": [
               "\n"
            ]
         }
      },
      "Singles and individual songs": {
         "text": [
            "The following is a list of singles, previously unreleased tracks on compilations, and individual songs on various artist compilations (VAC):\n"
         ]
      },
      "text": [
         "The Sorentinos, including solo albums and side projects by Danny Sorentino, have recorded 26 albums.[32][4][5][6][7] All albums and tracks are on The Major Label and published by Golden Guinea Music, administered by Bug Music (BMI) (unless otherwise indicated). All songs were written by Danny Sorentino (unless otherwise indicated). All album cover artwork since the album What We Dream (1995) was done by Joe Groma.[46] Many of these albums have been reviewed in various articles and on various websites.[47][48][49][9][43][50] Track listings for these albums can be viewed on The Sorentinos website,[4][5][6] and on AllMusic, Amazon, CD Baby, and YouTube.\n"
      ]
   },
   "Live Performances, Tours and Venues": {
      "text": [
         "The Sorentinos have played thousands of gigs,[8] mostly in bars, cafes, pubs and nightclubs, but also in many larger venues, as well as music festivals and street fairs.[11][12][13] They have toured in the United Kingdom several times, including a well-documented tour of England and Scotland in 2005. A 27-minute documentary of this tour was directed, filmed and edited by Dan Ruttley, and produced by Steve Lee and Dan Ruttley.[10][31][56] The following is a partial list of some of the notable concerts, festivals and venues in which The Sorentinos have performed.\n"
      ]
   },
   "Openers: The Sorentinos as an opening act": {
      "text": [
         "The following is a partial list of some of the artists for whom The Sorentinos have performed as an opening act.[14]\n"
      ]
   },
   "Musical Gear": {
      "text": [
         "A detailed list of the musical gear (musical instruments and audio equipment) used by The Sorentinos can be viewed on the band's website.[58]\n"
      ]
   },
   "Album Cover Artwork": {
      "text": [
         "Joe Groma has done all the album cover artwork on all Sorentinos albums since the album What We Dream (1995).[46] Images of these album covers can be viewed on The Sorentinos website,[4][5][6] and on AllMusic, Amazon, CD Baby, and YouTube.\n"
      ]
   },
   "Photographs and Videos": {
      "text": [
         "Photographs of The Sorentinos can be viewed at the following web pages on the band's website:[59] \"Recent Highlights\", \"Vintage Sorentinos\", \"Hall of Fame\".[60][61][62] Videos of The Sorentinos can be viewed on the band's website,[11][12][13] and on YouTube.\n"
      ]
   },
   "References": {
      "List of references and articles": {},
      "External links": {}
   },
   "coreData": [
      "The Sorentinos are an American rock music band based in Sonoma County, California, formed in 1985.[1] The main members are Danny Sorentino (lead vocals, guitar, harmonica), Rob Ruiz (bass guitar, backing vocals), Rory Judge (drums), Steve Barbieri (lead guitar, backing vocals), Russ Kerger (keyboards), and Steve Lee (lead guitar, backing vocals).[2]\n",
      "Danny Sorentino, by his own estimation, has written about 1,000 songs.[3] The Sorentinos, including solo albums and side projects by Danny Sorentino,[3] have recorded 26 albums.[4][5][6][7] They have performed thousands of gigs,[8] mostly in the greater San Francisco Bay and North Bay Areas, but also throughout California and the United States, and have toured in the United Kingdom as well.[9][10][11][12][13] They have performed as an opening act for dozens of well-known artists.[14]\n",
      "Danny Sorentino was born in 1955 in San Francisco, and grew up in the Excelsior District.[15] He moved to Petaluma (Sonoma County) in 1970.[16] He graduated from Rancho Cotate High School in Rohnert Park (Sonoma County), and studied at Santa Rosa Junior College (Santa Rosa, California). He started playing the guitar at age 17, and wrote his first song in 1975.[16] Danny has worked as a longshoreman in the San Francisco Bay Area since 2004, and is a member of the ILWU.[3][17] He and his wife have three grown children and four grandchildren.[3][8] Danny was the founder and lead singer of the rock band The Chills, a precursor band to The Sorentinos.[16]\n",
      "Prior to forming The Chills, Danny Sorentino was a member of the Billy C. Farlow Band from 1979 to the end of 1980.[18] Billy C. Farlow is the former lead singer of Commander Cody and His Lost Planet Airmen.\n"
   ],
   "infobox": {
      "Origin": [
         "Sonoma County, California"
      ],
      "Genres": [
         "Rock music"
      ],
      "Years active": [
         "1985–present"
      ],
      "Labels": [
         "The Major Label"
      ],
      "Associated acts": [
         "Danny Sorentino",
         "The Chills",
         "Danny Sorentino And The Sinners",
         "Lucky Buck And The Winners",
         "Popular Beat Combo"
      ],
      "Website": [
         "www.thesorentinos.com"
      ],
      "Members": [
         "Danny Sorentino",
         "Rob Ruiz",
         "Rory Judge",
         "Steve Barbieri",
         "Russ Kerger",
         "Steve Lee"
      ],
      "Past members": [
         "Howard Vatcher",
         "Dave Carlson",
         "Dean Johnson",
         "Gary Reynolds",
         "Chris Paulsen",
         "Vinnie Malone",
         "Kenny Susan",
         "others listed below"
      ]
   }
}