{
   "Name": "Rhythm Devils",
   "rawData": [
      "The Rhythm Devils are a band led by founding Grateful Dead drummer Bill Kreutzmann and drummer Mickey Hart who was a Grateful Dead member for most of the band's existence.\n",
      "The Rhythm Devils had their origins as an informal but frequent fixture in the Grateful Dead concert repertoire starting in the mid-to-late 1970s, and continuing until the Grateful Dead's last concert in 1995. Most Grateful Dead concerts featured an extended segment during the 2nd set of improvisational drumming and percussion by Hart and Kreutzmann who took over the stage as a duo (with occasional guests).  This segment was variously known to fans as \"Rhythm Devils\", \"Drums\", or conversationally as \"the drums\", and was usually followed in post-1979 concerts by another extended improvisation by the rest of the band, usually without the drummers, which was known as \"Space\".  The \"Rhythm Devils\" segment of a Grateful Dead concert almost always segued out of a full-band song, and the \"Space\" segment almost invariably would segue into the beginnings of another full-band song as the drummers resumed their seats with the rest of the band.  The Grateful Dead album Dead Set has a characteristic example of a 1980 \"Rhythm Devils\" segment which is titled as such, and which is followed by a \"Space\" segment.\n",
      "The Rhythm Devils duo were formally recruited by director Francis Ford Coppola to record the soundtrack to the film Apocalypse Now. During 1979 and 1980, Hart and Kreutzmann, along with other musicians (mostly percussionists), Airto Moreira, Mike Hinton, Jim Loveless, Greg Errico, Jordan Amarantha, Phil Lesh and Flora Purim, recorded sessions at the Grateful Dead's Marin County studios and \"The Barn\", Hart's studio in Novato. The process included improvising jungle sounds as they watched the film. The sounds were later edited into the movie. An LP record titled The Apocalypse Now Sessions: The Rhythm Devils Play River Music was issued from those sessions, (Passport Records PB 9844).  In October 1990, Rykodisc re-released the original 1980 LP.\n"
   ],
   "infobox": {
      "Genres": [
         "Rock, world music"
      ],
      "Years active": [
         "1979-1981, 2006, 2010–2011"
      ],
      "Associated acts": [
         "Grateful Dead, Phish, Mike Gordon, SerialPod, Deep Banana Blackout, BK3, 7 Walkers, Gov't Mule, Davy Knowles, Back Door Slam, Go Ahead"
      ],
      "Website": [
         "rhythmdevils.net"
      ],
      "Past members": [
         "Bill Kreutzmann",
         "Mickey Hart",
         "Steve Kimock",
         "Keller Williams",
         "Reed Mathis",
         "Sikiru Adepoju",
         "Mike Gordon",
         "Jen Durkin",
         "Andy Hess",
         "Davy Knowles",
         "Tim Bluhm"
      ]
   },
   "prunedData": [
      "The [BAND_NAME] are a band led by founding Grateful Dead drummer [PERSON_NAME_FULL_0_MALE] and drummer Mickey Hart who was a Grateful Dead member for most of the band's existence.\n",
      "The [BAND_NAME] had their origins as an informal but frequent fixture in the Grateful Dead concert repertoire starting in the mid-to-late [YEAR]s, and continuing until the Grateful Dead's last concert in [YEAR]. Most Grateful Dead concerts featured an extended segment during the 2nd set of improvisational drumming and percussion by Hart and Kreutzmann who took over the stage as a duo (with occasional guests).  This segment was variously known to fans as \"[BAND_NAME]\", \"Drums\", or conversationally as \"the drums\", and was usually followed in post-[YEAR] concerts by another extended improvisation by the rest of the band, usually without the drummers, which was known as \"Space\".  The \"[BAND_NAME]\" segment of a Grateful Dead concert almost always segued out of a full-band song, and the \"Space\" segment almost invariably would segue into the beginnings of another full-band song as the drummers resumed their seats with the rest of the band.  The Grateful Dead album Dead Set has a characteristic example of a [YEAR] \"[BAND_NAME]\" segment which is titled as such, and which is followed by a \"Space\" segment.\n",
      "The [BAND_NAME] duo were formally recruited by director Francis Ford Coppola to record the soundtrack to the film Apocalypse Now. During [YEAR] and [YEAR], Hart and Kreutzmann, along with other musicians (mostly percussionists), Airto Moreira, Mike Hinton, [PERSON_NAME_FULL_0_MALE], [PERSON_NAME_FULL_2_MALE], Jordan Amarantha, [PERSON_NAME_FULL_1_MALE] and Flora Purim, recorded sessions at the Grateful Dead's [MONTH]in County studios and \"The Barn\", Hart's studio in [MONTH]ato. The process included improvising jungle sounds as they watched the film. The sounds were later edited into the movie. An LP record titled The Apocalypse Now Sessions: The [BAND_NAME] Play River Music was issued from those sessions, (Passport Records PB [YEAR]).  In [MONTH] [YEAR], Rykodisc re-released the original [YEAR] LP.\n"
   ]
}