{
   "Band members": {},
   "Discography": {
      "Albums": {},
      "Compilations": {},
      "DVD": {}
   },
   "External links": {},
   "History": {
      "Brazilian Tour (2012)": {
         "text": [
            "On May 30, 2012, Rx Bandits announced that they would be performing a series of dates in Brazil during the summer, effectively ending their year-long hiatus.[7]\n"
         ]
      },
      "Drive-Thru years (1999-2006)": {
         "text": [
            "In 1998, the band released Halfway Between Here and There. On this album, the band began to branch out beyond the third wave ska sound.\n",
            "The album's success allowed them to tour with well-known acts such as The Bloodhound Gang, Goldfinger, and Reel Big Fish, and later to headline shows with up-and-comers such as New Found Glory and Freakdaddy frequently opening for them.\n",
            "In 1999, the album was re-released with a new track list, 2 remastered songs, and new artwork. The '99 release was released under the band's new name—Rx Bandits.\n",
            "In the time between Halfway Between Here and There and their next release, Progress, bassist Franz Worth and saxophonist Noah Gaffney left the band. Worth was replaced by James Salomone, formerly of My Superhero. Gaffney's position was left open. In June 2000, the band toured the US with Edna's Goldfish and the Gadjits.[2]\n",
            "With 2001's Progress, the band continued to expand their sound. The album contained the song \"Analog Boy,\" which was made into one of their three music videos. At this point, the band consisted of Embree, Tsagakis, Balling, and Salomone. The album included a number of guest performers, including former member Noah Gaffney.\n",
            "Shortly after the release of the album, Chris Sheets joined the band on trombone as well as Steve Choi on guitar and keyboards. Choi had played keyboards on the demos for Progress, but when it came time to record, they decided instead to have Rich Zahniser of The Hippos, who was touring with the band, play on the album. Chris Colonnier also played with the band at times, filling the same role as Zahniser. Soon after they gained the new members, James Salomone and Rich Balling left the band. They had many temporary replacements for Salomone, most notably Johnny Tsagakis, Chris' younger brother, but eventually Joe Troy, a longtime friend of Embree, who helped to write the song \"What If?\" on Halfway Between Here and There, joined the band as their bass player. Balling was replaced by saxophonist Steve Borth, who had played formerly in the popular East Bay ska punk band Link 80. Their line-up of Embree, Tsagakis, Sheets, Choi, Troy and Borth would go on to create the next two albums, The Resignation and  ...And the Battle Begun.\n",
            "2003 saw the release of The Resignation, a CD/DVD combination.  Guitars, bass, drums, and some keyboards were all recorded live in studio, and vocals, horns, percussion and additional keyboard parts were then overdubbed. The band allowed themselves a limited number of takes for each part, and once a take was recorded it was left as it was - no punch-ins were allowed. Embree shared songwriting duties with Steve Choi, whereas Embree had previously been responsible for all of the band's material. The Resignation became the first album to debut the Billboard 200. It was charted No. 5 on the Top Heatseekers chart.\n",
            "Musically,  the album continued to branch out beyond Progress into new musical territory, including experimentation with unconventional time signatures. The Resignation featured overtly political lyrics as the band evolved even further from their ska-punk days as the Pharmaceutical Bandits, a subject that drummer Chris Tsagakis commented on in an interview conducted by former member Rich Balling for Skratch Magazine:\n",
            "A closed-minded person will definitely see a band with horns and think ska or ska-punk. I don't really stress on it, because I know what we are doing transcends genres. We make music, and we are a band that has horns. I would never classify this band under any label. We make music, and we have horns and keys and everything else.[3]",
            "The album cover of The Resignation is an original composition called \"Predictable\" by Aaron Nagel, a Bay Area artist and member of both Link 80 and DESA.\n",
            "In 2004, the band released a DVD of live performances that were filmed during their many live shows. It was one of the first released on Embree's Mash Down Babylon Record label (aka MDB Records). It contains two Easter Eggs: a performance of the song \"Up to No Good,\" the only song recorded during the sessions for The Resignation that was not included on the album as well as studio footage of the band working on the album.  During the DVD's slide show, the background music is performed by Apotheke, a side project run by several members of the band.\n"
         ]
      },
      "Early years (1995-1999)": {
         "text": [
            "Originally known as The Pharmaceutical Bandits, the band began their career by participating in the third wave ska revival of the 1990s. In 1997, they released Those Damn Bandits, which featured guest appearances by Jimmy the Robot of the Aquabats and Chris Colonnier of Jeffries Fan Club and The Forces of Evil. Noting the Bandits' potential, a Los Angeles Times review of the album said \"Now comes a young, talented ska band, the Pharmaceutical Bandits. It would be OK with me if the Grinch spared them but swiped their ska records and left a shelf of Who, Clash, Bob Marley, Elvis Costello and Neil Young.\"[1] Matt Embree attended Los Alamitos High School, which was an incubator for other third wave ska bands such as Reel Big Fish, Save Ferris, and The Scholars.\n"
         ]
      },
      "Gemini, Her Majesty (2014)": {
         "text": [
            "During their special acoustic performance in their hometown of Long Beach, California on December 14, 2013, Embree stated that a new album is halfway written and Rx Bandits will be together again.\n",
            "The new album is being released through PledgeMusic[8]\n",
            "The band released a demo recording on January 26, 2014 through PledgeMusic.[9] The track is tentatively titled, \"Ready Eddie\" . The official cut of the track has since been released, and is called \"Stargazer\", the first track recorded for the new album.\n",
            "On June 6, 2014, the band announced via Twitter that their new album will be called Gemini, Her Majesty, and it was released on July 22, 2014.[10]\n",
            "In December 2014 the band played two nights at The Glasshouse in Pomona, CA. The first night was dedicated to playing through Gemini, Her Majesty in its entirety, followed by a six-song encore set with horn players. The second night was a fan-made setlist featuring the horn section again, including many older fan favorites from The Resignation.\n",
            "In 2015, the band toured with Circa Survive for their \"Juturna\" 10-year anniversary tour. Drummer Chris Tsagakis was unable to tour during this time, and his role was filled by Javier Torres. The band played as a four piece on this tour, and no horn players were present.\n",
            "In 2016, the band embarked on a 10-year anniversary tour of \"And the Battle Begun\", which featured Matt Embree and Steve Choi, but with Javier  Torres on drums and Matt Fazzi on bass. Long-time bassist Joe Troy was absent from the tour. Chris Tsagakis stated that he was no longer touring with the band to focus on being a father. Andrew Bornstein also played trombone on this tour, as well as Dennis Passley on saxophone. Since this tour, the band has remained inactive and there seem to be no future plans to tour. Since then, Matt Embree has filled in on tours for numerous bands, and is currently touring with the band Dispatch. He also recorded/engineered the latest Dan P and the Bricks' album.\n",
            "In 2019, the band announced they would be performing at the House of Blues in Anaheim, California on January 24, 2020 with support from Anthony Green and VIS.[11]\n"
         ]
      },
      "Last Summer Tour (2011)": {
         "text": [
            "On April 12, 2011, the band announced that their forthcoming summer U.S. tour would be their last.[5]  A brief statement was given by the band:\n",
            "We would like to express our love and appreciation for all that you've done for us and how much a part of our growth you have been. We have all mutually decided that this summer will be our last tour. We love each other and love you all and hope to see you at the shows.",
            "The tour was composed of 36 shows spanning from May 4, 2011 to August 7, 2011.\n",
            "Fans first believed the announcement to mean that the band were breaking up when, in fact, they are simply stopping their summer tours. Steve Choi has confirmed this in a Playmaker interview:[6]\n",
            "To clarify, we’re not breaking up. We’re just doing our last tour. What we’re gonna do in the future, we’re not quite sure. That’s a big question because it involves what we’re going to do collectively and what we’re going to do individually. Despite popular belief, we don’t live together, sleep together or eat together. Those days have passed. We all have our own lives to tend to. When we’re not full time touring or playing shows, we gotta handle business…"
         ]
      },
      "MDB/Sargent House": {
         "text": [
            "...And the Battle Begun was initially released online on June 24, 2006 and was made available for purchase during the band's 2006 US Tour. The album's title refers to the poetry of Lord Byron, in which the phrase appears repeatedly.\n",
            "The album was originally slated to be released in 2005 through Drive-Thru Records (with one album left on their contract), but for unspecified reasons, the band and label chose to part ways, causing lengthy delays in the release date.  Finally free of any legal setbacks, the CD was made available via online order from MDB Records and on specified tour dates.  Officially it debuted in retail stores in October 2006, after which the band performed a Northeastern CD release tour to promote the album.\n",
            "On June 28, 2006, the band announced via their MySpace page that saxophone player and backup vocalist Steve Borth had left the Rx Bandits to pursue his own band, Satori. This announcement came in the midst of their 2006 US Summer Tour to the surprise of many fans.  Borth played his final show with the Rx Bandits on Tuesday, June 27, 2006 at the Bowery Ballroom in New York City.\n",
            "In conjunction with Refused TV, the Bandits recorded a music video for the title track off ...And the Battle Begun. It is only their second music video since the making of a video for \"Analog Boy\" in 2001, and their first independently produced video for the song \"I Will Live\" on the Those Damn Bandits album.  The \"I Will Live\" video was never officially released, although some bootleg copies still exist.\n",
            "They released their live set from the Bonnaroo Music and Arts Festival 2007 exclusively on the iTunes Store. Live from Bonnaroo 2007 is currently only available for download from the U.S. iTunes Store.\n",
            "During the summer of 2008 the band did a headlining tour with support from Portugal. The Man, Maps & Atlases, Kay Kay and His Weathered Underground and Facing New York.\n",
            "Cathy Pellow of Sargent House announced via the Rx Bandits fan site plans for a live DVD featuring their live performance at the Glasshouse in Pomona, CA on August 22, 2008 as well as interviews and footage from the writing and recording for the next album. That writing and rehearsing process saw the departure of Chris Sheets, leaving the band a four-piece and without horns for the first time in its history.\n"
         ]
      },
      "Mandala (2009-2011)": {
         "text": [
            "Mandala was released as a digital download on July 14, 2009 and the CD was released on July 21, 2009 on Sargent House.[4] They then headed out on a co-headlining tour with Dredg with revolving support from Good Old War, Zechs Marquise and As Tall As Lions. This album peaked No. 117 on the Billboard 200.\n",
            "On January 4, 2010 the band announced some U.S. tour dates starting in March with support from Zechs Marquise and The Builders And The Butchers. This tour featured a 3-night stand at The Gramercy Theatre in New York City, where they performed (in their entirety) The Resignation, ...And The Battle Begun, and Mandala on each respective night (an album per show). They recruited some close friends to play horns for these shows. In September 2010, they had a similar run of shows at The Troubador in Los Angeles. The full album shows from The Troubador were recorded live and the audio was released by the band via flashdrive.\n"
         ]
      },
      "The Resignation Tenth Anniversary Tour and New EP (2013)": {
         "text": [
            "Rx Bandits toured the United States during the summer of 2013 to mark the tenth anniversary of the release of The Resignation. The band released an EP featuring covers of The Police, Blonde Redhead, Weezer, Fugazi, and King Crimson.\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Early years (1995-1999)",
      "1.2 Drive-Thru years (1999-2006)",
      "1.3 MDB/Sargent House",
      "1.4 Mandala (2009-2011)",
      "1.5 Last Summer Tour (2011)",
      "1.6 Brazilian Tour (2012)",
      "1.7 The Resignation Tenth Anniversary Tour and New EP (2013)",
      "1.8 Gemini, Her Majesty (2014)",
      "2 Side projects",
      "3 Band members",
      "4 Discography",
      "4.1 Albums",
      "4.2 Compilations",
      "4.3 DVD",
      "5 References",
      "6 External links"
   ],
   "Side projects": {
      "text": [
         "Over the years, several members found time for side projects.\n",
         "Embree and Chris Tsagakis can also be found in The Sound of Animals Fighting as “Walrus” and “Lynx,” respectively. The group was founded by former Rx Bandits trombonist Rich Balling. Joe Troy, Chris Sheets, and Steve Choi have performed live with the band, which also includes Anthony Green (Saosin, Circa Survive) and Craig Owens (Chiodos vocalist) as well as members of Finch and Days Away.\n",
         "Steve Borth played with the Northern California skacore band, Link 80, signed to Asian Man Records. He later started the reggae/rocksteady band Satori which has also featured Embree on bass, members of The Exit, and Chris Murray.\n",
         "Steve Choi collaborated with Asian Man Records founder Mike Park in both The Chinkees and The Bruce Lee Band.  The Rx Bandits were featured as Park's Bruce Lee Band during the recording of the Beautiful World EP. Choi is also a member of the band Machines, in which he plays the drums.\n",
         "September 9, 2008 saw the release of Matt Embree's acoustic side project, entitled Love You Moon.  The album consists solely of Matt on the acoustic guitar with the exception of 3 tracks where Chris Tsagakis assists on drums.  This album was presold at the Rx Bandits' concurrent tour. He also released an EP of covers entitled \"Maracay\" during the last Rx tour. The album was recorded during a trip to Venezuela and all proceeds went to Doctors Without Borders.\n",
         "Embree and Tsagakis have also played guitar and drums, respectively, with Lauren Coleman in her project, Pebaluna.  The three met when she was recording in the Elizabethan in late 2005.\n",
         "Matt Embree can also be heard on other projects such as those of the hip-hop group Seekret Socyetee, 2 Drunk'n Poets, and V.I.T.A.L. Emcee's solo album, \"The Secret of the Invisible Man,\" all of which have been released on Embree's MDB Records.\n",
         "Tsagakis is recording and performing solo material under the name C-Gak. He also released an album under the moniker of Technology.\n",
         "Embree also started a new group with Lisa Papineau named ME & LP. They released their first EP Chez Raymond on August 9, 2011 and toured the West Coast.\n",
         "Choi is currently producing bands, recently working with Silver Snakes, Gardening Not Architecture and The Velvet Teen.\n",
         "Embree and Tsagakis released an album as Biceratops in November 2012.\n"
      ]
   },
   "Summary": {
      "text": [
         "Rx Bandits are an American four-piece band based in Seal Beach, California, United States. The band formed in 1995 in Orange County, California. They have appeared on the Vans Warped Tour, at the Bonnaroo Music and Arts Festival, Coachella Valley Music and Arts Festival and at The Bamboozle.\n"
      ]
   },
   "Title": "Rx Bandits - Wikipedia"
}