{
   "Name": "Rx Bandits",
   "rawData": [
      "Rx Bandits are an American four-piece band based in Seal Beach, California, United States. The band formed in 1995 in Orange County, California. They have appeared on the Vans Warped Tour, at the Bonnaroo Music and Arts Festival, Coachella Valley Music and Arts Festival and at The Bamboozle.\n",
      "Originally known as The Pharmaceutical Bandits, the band began their career by participating in the third wave ska revival of the 1990s. In 1997, they released Those Damn Bandits, which featured guest appearances by Jimmy the Robot of the Aquabats and Chris Colonnier of Jeffries Fan Club and The Forces of Evil. Noting the Bandits' potential, a Los Angeles Times review of the album said \"Now comes a young, talented ska band, the Pharmaceutical Bandits. It would be OK with me if the Grinch spared them but swiped their ska records and left a shelf of Who, Clash, Bob Marley, Elvis Costello and Neil Young.\" Matt Embree attended Los Alamitos High School, which was an incubator for other third wave ska bands such as Reel Big Fish, Save Ferris, and The Scholars.\n",
      "In 1998, the band released Halfway Between Here and There. On this album, the band began to branch out beyond the third wave ska sound.\n"
   ],
   "infobox": {
      "Also known as": [
         "The Pharmaceutical Bandits"
      ],
      "Origin": [
         "Seal Beach, California, United States"
      ],
      "Genres": [
         "Punk rock",
         "pop punk",
         "melodic hardcore",
         "ska punk",
         "alternative rock",
         "progressive rock"
      ],
      "Years active": [
         "1995-present"
      ],
      "Labels": [
         "Antedote, Drive Thru, Mash Down Babylon, Sargent House"
      ],
      "Associated acts": [
         "The Sound of Animals Fighting, Love You Moon, ME & LP, Apotheke, Technology, Coke Vs. Bills, Biceratops, C-Gak, Peace'd Out, Machines, Pebaluna, Chiodos, The Mars Volta, Circa Survive"
      ],
      "Website": [
         "www.rxbanditsofficial.com"
      ],
      "Members": [
         "Matt Embree",
         "Steve Choi",
         "Joseph Troy",
         "Christopher Tsagakis"
      ],
      "Past members": [
         "Steve Borth",
         "Chris Sheets",
         "Johnny Tsagakis",
         "James Salomone",
         "Rich Zahniser",
         "Franz J. Worth",
         "Noah Gaffney",
         "Neil Burdick",
         "Rich Balling"
      ]
   }
}