{
   "Discography": {
      "Compilations/EPs/others": {},
      "Live albums": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Singer/songwriter Sean Kelly and guitarist Charles Hambleton met in 1985 in Burlington, Vermont at an open mic called The Sheik, leading to the formation of the band Secret City in 1986.[3]  After playing together in Burlington for a year, the pair moved to Boulder, CO and met up with Andy Sheldon, a friend and member of a prior band with Kelly. Jeep MacNichol joined the band as drummer after responding to an ad. After playing around the area, Al Laughlin saw the group perform at a frat party and asked if the group needed a keyboardist, an offer the band accepted.[4] The band played their first show in Colorado on April 19, 1987 at Tulagi's, a Boulder venue. Later that year, the band recorded a demo album on cassette that was never officially released. The recording of \"Moonlit Treese\" made it onto the Underwater People EP, while several other tracks can be found online.[5]\n",
         "The Samples embarked on their first national tour in the summer of 1988 and gradually gained attention. The band played mostly to college audiences and allowed their music to be spread through bootlegging and taping. Fans in college towns formed street teams to distribute the band's music and help them get shows by popular demand. Their debut self-titled album The Samples was independently recorded with producer Walt Beery and was released independently in early 1989. The album combined reggae, pop-rock, and bluegrass with a tight and polished sound that was often compared to The Police. Following the release, they signed with Arista Records and re-released the same album in May. However, the band found itself at odds with Arista's personnel, who neglected to market their debut album and wanted to change their sound. After an unproductive studio session with an outside producer hired by the label, band terminated their contract with Arista in the fall of 1991 and continued to tour unsigned. Also that year, Hambleton departed the band. He would later appear in Pirates of the Caribbean and was associate producer of the film The Cove.[6]\n",
         "The Samples continued to tour and released their own self-published EP, Underwater People, composed of both studio-recorded and live tracks. The band soon joined the newly formed independent label, W.A.R.? - What Are Records? and released No Room in 1992. The album was produced by Jim Scott and showed the band's continuing growth as songwriters and musicians. Many of the songs on No Room became their most well-known, including \"When it's Raining\", \"Did Ya Ever Look So Nice\", and \"Taking Us Home\". The album's sound combined pop sensibility with a mix of folk, reggae, jazz, and rock that would become their signature. Sean Kelly, as the main songwriter, wrote songs about nature and the environment giving the band an \"eco-friendly\" reputation. Sheldon's thumping bass, MacNichol's Stewart Copeland-inspired beats and Laughlin's off-beat reggae chords supported Kelly's inspired songwriting and Sting-like vocals. They became a success throughout the early 1990s, selling over one million copies of their catalogue based on a genuine grassroots campaign. Their live shows helped them on the college circuit selling out venues in college towns across the country.\n",
         "In 1993, The Samples released The Last Drag, produced by Marc DeSisto. At the time of its release, the band considered it to be a reinvention of itself. This album marked a shift in their sound to a more guitar-driven, pop-oriented approach. Though many tracks still had elements of reggae and world music, songs such as \"Streets in the Rain\" and \"Everytime\" featured more streamlined productions and opened the band to wider audiences. It featured more of Andy Sheldon's songs than on previous albums and included singing/songwriting contributions from Jeep MacNichol and Al Laughlin for the first time on a studio album. Sean Kelly has referred to their increasing contributions as \"solo projects within the band\".[7] Around this time, the band headlined some of the H.O.R.D.E. tour shows in 1993 and 1996 and they shared the bill with big names such as The Allman Brothers Band, Blues Traveler, and Phish. On their own tours, many up and coming bands opened up for them including Dave Matthews Band, Hootie & the Blowfish, and Lisa Loeb. The success included television performances on The Tonight Show and House of Blues. The band took the summer of 1994 off while Sean Kelly recorded his first and only solo album, Lighthouse Rocket. In the fall, The Samples returned with Autopilot, produced by Walt Beery who also became their manager around this time. They chose the album's name because the band had gone straight into the studio after a long tour and was able to perform on \"autopilot\" without much preparation, according to MacNichol.[8] Autopilot was more concise than previous albums and focused on capturing the band's live sound.\n",
         "In 1995, The Samples' contract with W.A.R. had expired, so they decided to approach major labels with their catalog to move forward. The band signed with MCA Records and released Outpost, their fifth studio album, in 1996. It featured a heavier, more stripped-down sound and included re-recordings of early songs \"Did You Ever Look So Nice\" and \"Birth of Words\". Although it was their most expensive album to record, costing over $300,000, the band was disappointed with the result due to inconsistent guidance from label personnel and high creative tensions within the band. Because of a buyout, MCA was experiencing financial difficulties and significant corporate reshuffling. As a result, many small or recently signed bands were dropped from the label around the same time. The personnel who had signed The Samples were no longer there, and MCA terminated The Samples' contract in 1997 after a short-lived tour with Jars of Clay and a few dates opening for Sting. Laughlin was absent for much of the Outpost sessions and tour while he was recovering from a heroin addiction, and decided to leave the band for good that year. MacNichol also departed, due to disagreement over direction during the Outpost sessions and the desire to start a solo career. He would later release three grunge-influenced albums under the name \"Jeep\", as well as his current reggae/dub project \"Mr. Anonymous\". The original lineup did a short farewell tour and played its last show on May 14, 1997 at the Bluebird Theater, with Charles Hambleton joining them as a special guest.\n",
         "The Samples' future was in limbo with Sean Kelly and Andy Sheldon facing the decision of whether or not to continue under the same name. However, they promptly reformed with new members Kenny James, Alex Matson, and Rob Somers, and rejoined What Are Records? to release Transmissions from the Sea of Tranquility in late 1997, a live album with some tracks recorded on tour and others recorded at an empty venue. The new lineup led to the band developing a mellower sound echoing Kelly's folk-rock influences from the 1970s. Here and Somewhere Else followed in 1998. Only two months later, the band released the semi-concept album The Tan Mule, an Internet-only collection of tracks described by Kelly as \"kind of western\" and a \"cultish, fan thing\"[9][10] The project had been started prior to Here and Somewhere Else in order to fulfill a contract obligation to their management company. The band intended the album to be bad enough in order to get themselves released from their ill-conceived management contract, but still good enough to not be a total loss. Nevertheless, they were released from their contract, and The Tan Mule was well received by fans. The band began to release albums independently, beginning with 2001's \"Return to Earth\", which featured new drummer Sam Young. Return to Earth was, in some ways, a return to form for the band; it mostly relied on eclectic uptempo songs and received perhaps the warmest reception from fans since Autopilot. In 2003, Andy Sheldon left the band. Since then, there have been numerous member changes with the exception of Sean Kelly as frontman and only remaining original member. Sean Kelly and long-time Samples acoustic guitarist Tom Askin released the acoustic \"Seventeen\" Album/DVD in 2003.  The Samples returned in 2004 with the mostly fan-funded \"Black and White\", and in 2005 with \"Rehearsing for Life\".  \"America\" was released in 2014, and in 2019 The Samples released \"Indian Summer\".\n",
         "In 2008, an announcement appeared on The Samples's website indicating that the band was unlikely to continue. However, Kelly resumed playing shows under The Samples name with new members in 2009. The Colorado Rapids Soccer Club's Game Entertainment Dept. reunited the original five-piece lineup for an in-stadium concert on July 4, 2009 as part of the state's largest Independence Day celebration that year, at Dick's Sporting Goods Park. This was followed by the reunited band again playing at the same stadium for the Mile High Music Festival in 2010. The newest lineup played the Denver Day of Rock in 2011 and have continued to tour with many more dates planned for the future.\n",
         "A biopic documentary about the band titled The Best Band You've Never Heard was produced in 2012 by Besame films.[11] It is currently only available on YouTube.[7]\n",
         "The song \"Could It Be Another Change\" from the band's debut album was used in the 2012 film The Perks of Being a Wallflower.[12]\n",
         "In June 2013, The Samples returned to the studio to begin working on a new album.[13] Their eleventh studio album, America, was released New Year's Day, 2014. The album features contributions from Richie Furay and SHEL.[14]\n",
         "On December 12, 2014, the original lineup of The Samples reunited for the second time at the Fillmore Auditorium in Denver, CO. The band played their self-titled debut album in its entirety, along with a second set of fan favorites.[15]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Live albums",
      "2.3 Compilations/EPs/others",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "The Samples is an American rock band formed in Boulder, Colorado in 1987. The band's name came from the members' early sustenance of food samples from the local King Soopers grocery store.[1]  The music has been described as \"reggae influenced rock/pop\" and a cross between The Police and the Grateful Dead.[2]  The founding members were Sean Kelly (Guitar/Vocals), Charles Hambleton (Guitar), Andy Sheldon (Bass/Vocals), Jeep MacNichol (Drums/Vocals), and Al Laughlin (Keyboards/Vocals).\n"
      ]
   },
   "Title": "The Samples - Wikipedia"
}