{
   "Name": "The Samples",
   "rawData": [
      "The Samples is an American rock band formed in Boulder, Colorado in 1987. The band's name came from the members' early sustenance of food samples from the local King Soopers grocery store.  The music has been described as \"reggae influenced rock/pop\" and a cross between The Police and the Grateful Dead.  The founding members were Sean Kelly (Guitar/Vocals), Charles Hambleton (Guitar), Andy Sheldon (Bass/Vocals), Jeep MacNichol (Drums/Vocals), and Al Laughlin (Keyboards/Vocals).\n",
      "Singer/songwriter Sean Kelly and guitarist Charles Hambleton met in 1985 in Burlington, Vermont at an open mic called The Sheik, leading to the formation of the band Secret City in 1986.  After playing together in Burlington for a year, the pair moved to Boulder, CO and met up with Andy Sheldon, a friend and member of a prior band with Kelly. Jeep MacNichol joined the band as drummer after responding to an ad. After playing around the area, Al Laughlin saw the group perform at a frat party and asked if the group needed a keyboardist, an offer the band accepted. The band played their first show in Colorado on April 19, 1987 at Tulagi's, a Boulder venue. Later that year, the band recorded a demo album on cassette that was never officially released. The recording of \"Moonlit Treese\" made it onto the Underwater People EP, while several other tracks can be found online.\n",
      "The Samples embarked on their first national tour in the summer of 1988 and gradually gained attention. The band played mostly to college audiences and allowed their music to be spread through bootlegging and taping. Fans in college towns formed street teams to distribute the band's music and help them get shows by popular demand. Their debut self-titled album The Samples was independently recorded with producer Walt Beery and was released independently in early 1989. The album combined reggae, pop-rock, and bluegrass with a tight and polished sound that was often compared to The Police. Following the release, they signed with Arista Records and re-released the same album in May. However, the band found itself at odds with Arista's personnel, who neglected to market their debut album and wanted to change their sound. After an unproductive studio session with an outside producer hired by the label, band terminated their contract with Arista in the fall of 1991 and continued to tour unsigned. Also that year, Hambleton departed the band. He would later appear in Pirates of the Caribbean and was associate producer of the film The Cove.\n"
   ],
   "infobox": {
      "Origin": [
         "Boulder, Colorado, United States"
      ],
      "Genres": [
         "Alternative rock, rock, reggae, folk"
      ],
      "Years active": [
         "1987–present"
      ],
      "Labels": [
         "Arista, What Are?, MCA, Apache"
      ],
      "Website": [
         "www.thesamples.com"
      ],
      "Members": [
         "Sean Kelly",
         "Tom Askin",
         "Billy Mutchler",
         "Jared Johnson",
         "Joe Biglin",
         "Karl Dietel"
      ]
   },
   "albums": [
      "The Samples",
      "No Room",
      "The Last Drag",
      "Autopilot",
      "Outpost",
      "Here and Somewhere Else",
      "The Tan Mule",
      "Return to Earth",
      "Black & White",
      "Rehearsing for Life",
      "America",
      "Indian Summer"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in Boulder, Colorado in [YEAR]. The band's name came from the members' early sustenance of food samples from the local King Soopers grocery store.  The music has been described as [SONG_NAME] and a cross between The Police and the Grateful Dead.  The founding members were Sean Kelly (Guitar/Vocals), [PERSON_NAME_FULL_0_MALE] (Guitar), [PERSON_NAME_FULL_2_MALE] (Bass/Vocals), Jeep MacNichol (Drums/Vocals), and [PERSON_NAME_FULL_1_MALE] (Keyboards/Vocals).\n",
      "Singer/songwriter Sean Kelly and guitarist Charles Hambleton met in [YEAR] in Burlington, Vermont at an [GENRE] band Secret City in [YEAR].  After playing together in Burlington for a year, the pair moved to Boulder, CO and met up with [PERSON_NAME_FULL_1_MALE], a friend and member of a prior band with Kelly. Jeep MacNichol joined the band as drummer after responding to an ad. After playing around the area, [PERSON_NAME_FULL_0_MALE] saw the group perform at a frat party and asked if the group needed a keyboardist, an offer the band accepted. The band played their first show in Colorado on [MONTH] 19, [YEAR] at Tulagi's, a Boulder venue. Later that year, the band recorded a demo album on cassette that was never officially released. The recording of [SONG_NAME] made it onto the Underwater People EP, while several other tracks can be found online.\n",
      "[BAND_NAME] embarked on their first national tour in the summer of [YEAR] and gradually gained attention. The band played mostly to college audiences and allowed their music to be spread through bootlegging and taping. Fans in college towns formed street teams to distribute the band's music and help them get shows by popular demand. Their debut self-titled album [BAND_NAME] was independently recorded with producer Walt Beery and was released independently in early [YEAR]. The album combined reggae, pop-rock, and bluegrass with a tight and polished sound that was often compared to The Police. Following the release, they signed with Arista Records and re-released the same album in [MONTH]. However, the band found itself at odds with Arista's personnel, who neglected to market their debut album and wanted to change their sound. After an unproductive studio session with an outside producer hired by the label, band terminated their contract with Arista in the fall of [YEAR] and continued to tour unsigned. Also that year, Hambleton departed the band. He would later appear in Pirates of the Caribbean and was associate producer of the film The Cove.\n"
   ]
}