{
   "Name": "The Soul Rebels",
   "rawData": [
      "The Soul Rebels (also Soul Rebels Brass Band, Soul Rebels or The Rebels) are an eight-piece New Orleans based brass ensemble that incorporate elements of soul, jazz, funk, hip-hop, rock and pop music within a contemporary brass band framework.\n",
      "Starting out as a local New Orleans favorite, The Soul Rebels have evolved into collaborating live with major artists in all worlds of music including Katy Perry, Nas, Metallica, Green Day, Macklemore & Ryan Lewis, Rakim, Marilyn Manson, Slick Rick, Joey Badass, Trombone Shorty, Talib Kweli, Pharoahe Monch, Robert Glasper, GZA, Raekwon, Black Thought of The Roots, Prodigy (rapper), Currensy, Mobb Deep, Big Freedia, The String Cheese Incident, Melle Mel, Styles P of The Lox, Umphrey's McGee, Pete Rock, Maceo Parker, Galactic, Suzanne Vega, David A. Stewart of the Eurythmics, Eric Krasno, Lettuce (band), Gov't Mule, Branford Marsalis, Smif-n-Wessun, Buckshot (rapper), Roy Hargrove, John Medeski and many others,  as well as being billed on concerts with Lauryn Hill, Kanye West, Bruno Mars, Snoop Dogg, Alabama Shakes, Estelle, Cee Lo Green, The Allman Brothers Band, Arcade Fire,  Disclosure, Ice Cube, George Clinton, John Mayer,  Jack White and others.\n",
      "The band has built its career around an eclectic live show that harnesses the power of horns and percussion in a funky party-like atmosphere. The Soul Rebels have performed on CBS, Travel Channel, Discovery Channel, HBO, TBS, NBC, NPR, ESPN, BBC Two, The CW and in major movies, and on national and international stages.  The band routinely plays over 250 shows a year. They have been described by the Village Voice as \"the missing link between Public Enemy and Louis Armstrong. \"\n"
   ],
   "infobox": {},
   "albums": [],
   "prunedData": [
      "[BAND_NAME] (also Soul Rebels Brass Band, Soul Rebels or The Rebels) are an [GENRE] a contemporary brass band framework.\n",
      "Starting out as a local New Orleans favorite, [BAND_NAME] have evolved into collaborating live with major artists in all worlds of music including Katy Perry, Nas, Metallica, Green Day, Macklemore & [PERSON_NAME_FULL_4_MALE], Rakim, [MONTH]ilyn Manson, Slick Rick, [PERSON_NAME_FULL_2_MALE], Trombone Shorty, [PERSON_NAME_FULL_5_MALE], Pharoahe Monch, Robert Glasper, GZA, Raekwon, Black Thought of The Roots, Prodigy (rapper), Currensy, Mobb Deep, Big Freedia, The String Cheese Incident, [PERSON_NAME_FULL_3_MALE], Styles P of The Lox, Umphrey's McGee, [PERSON_NAME_FULL_7_MALE], Maceo Parker, Galactic, [PERSON_NAME_FULL_6_FEMALE], David A. Stewart of the Eurythmics, [PERSON_NAME_FULL_9_MALE], Lettuce (band), Gov't Mule, Branford [MONTH]salis, Smif-n-Wessun, Buckshot (rapper), [PERSON_NAME_FULL_1_MALE], John Medeski and many others,  as well as being billed on concerts with [PERSON_NAME_FULL_0_FEMALE], Kanye West, Bruno [MONTH]s, Snoop Dogg, Alabama Shakes, Estelle, Cee Lo Green, The Allman Brothers Band, Arcade Fire,  Disclosure, Ice Cube, [PERSON_NAME_FULL_8_MALE], John [MONTH]er,  Jack White and others.\n",
      "The band has built its career around an [GENRE] a funky party-like atmosphere. [BAND_NAME] have performed on CBS, Travel Channel, Discovery Channel, HBO, TBS, NBC, NPR, ESPN, BBC Two, The CW and in major movies, and on national and international stages.  The band routinely plays over 250 shows a year. They have been described by the Village Voice as [SONG_NAME]\n"
   ]
}