{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "STS9 was formed in Snellville, Georgia (just outside Atlanta), in 1998.\n",
         "The band has headlined stages at festivals such as Summer Camp, Wakarusa, Moogfest, Bonnaroo, Outside Lands Festival, Regeneration, Lollapalooza, Camp Bisco and Electric Forest Festival. The group has raised significant amounts of money towards activism efforts, including $150,000 to the Make it Right Foundation, paving the way to rebuild a house in the Lower 9th Ward of New Orleans.\n",
         "In the band's last studio album The Universe Inside, which is the twelfth in their full discography, STS9 continues to grow by incorporating dance and disco styles into their music.\nSTS9's self-owned record label, 1320 Records, currently boasts over 300,000 unique downloads and over 1,000 releases by over 100 artists including Bassnectar, Pretty Lights, Big Gigantic, ESKMO, and the Glitch Mob.\n",
         "On January 14, 2014, it was announced that founding member and bassist David Murphy was leaving the band. Alana Rocklin was recruited as his replacement.[6] Rocklin performed a whole set with the band for the first time on March 28, 2014 at McDowell Mountain Music Festival in Phoenix, Arizona, having previously made a guest appearance performing \"Gobnugget\" on December 29, 2013 at the Tabernacle in Atlanta. Rocklin was a fan of the group before joining them and has previously played as part of Jim James' band. [7]\n"
      ]
   },
   "Members": {
      "Former members": {}
   },
   "Notable concert performances": {
      "Festival appearances": {
         "text": [
            "STS9 has a steady presence in the music festival circuit, headlining several festivals across the country each season.\n",
            "In 2007, the band announced they would return to Deerfields for a new festival titled Re:Generation.  The two-day festival included additional performances from the Join and Telefon Tel Aviv. According to the band's website, this event promised to be \"a unique celebration of music, nature, family, mind, body, and spirit.\" In 2011, STS9 re-created the Re:Generation festival in its second incarnation held at Horning's Hideout in North Plains, Oregon, with a lineup that included Bassnectar, Glitch Mob, Beats Antique, and Tycho.[15]\n",
            "In May 2008, the band performed at the Summer Camp Music Festival in Chillicothe, Illinois.\n",
            "On Saturday June 7, 2008, the band headlined the Sun Down Stage at the Wakarusa Music Festival at Clinton State Park, Lawrence, Kansas.\n",
            "At Rothbury 2008, the band performed a three and a half hour show, which packed a capacity crowd.\n",
            "In June 2011, the band performed at Bonnaroo in Manchester, Tennessee. Their show began at 2:30am and played until sunrise.\n",
            "In 2012, the band performed at the Hangout Music Festival, Electric Forest, High Sierra Music Festival, and North Coast Festival.\n",
            "From 2013, STS9 has performed at festivals including High Sierra Music Festival, Moonrise Festival, Suwannee Hulaween, Pemberton Music Festival, All Good Music Festival, Bonnaroo, Wakarusa, Summer Camp Music and Camping Festival, BUKU, The Voodoo Music + Arts Experience, Hangout Music Festival, Beale Street Music Festival, Counterpoint, Summer Set Music Festival and McDowell Mountain Festival.\n",
            "In 2018, STS9 organized and headlined the first annual Wave Spell Festival in Belden Town, CA.[16] During this festival they played 9 sets of music, 3 of which were entirely improvised. A variety of musical performers joined STS9 at Wave Spell, including: Sunsquabi, eDIT and Ooah of the Glitch Mob, Manic Focus, Michael Menert, Charlesthefirst, Antennae, Yak Attack and others. In addition to these guests, David Phipps and Zach Velmer of STS9 performed solo sets. The band has announced the second year of Wave Spell, which will occur in August 2019.[17]\n",
            "Sound Tribe Sector 9 has performed live at the following events:\n"
         ]
      },
      "text": [
         "STS9 has gained acclaim, as well as a distinctly loyal fan base over the past decade. Their 2005 album Artifact reached #12 on Billboard's Top Electronic Albums.[10]  They have moved from playing and opening in small clubs and bars to headlining major music venues and festivals.  In 2003, the band reached new heights by opening for The String Cheese Incident in their first amphitheater performance, at majestic Red Rocks Amphitheatre in Morrison, Colorado. A concert scheduled for the previous night at the Fox Theater in Boulder, Colorado sold out in less than fifteen minutes. The band has now sold out numerous headlining Red Rocks shows, along with many other venues across the country.\n",
         "In the San Francisco Bay Area, the band has built a following with frequent performances at The Fillmore, Warfield Theatre, and the historic Regency Center.  They have performed at the Fillmore on ten occasions, including three two-night stands, a three-night stand for Halloween in 2004, and a four-night stand in early 2009.  They have performed at the Warfield Theatre on five occasions, including a two-night stand. The band performed at the Regency Center on five occasions, including two consecutive New Year's Eve shows in 2002 and 2003.  The band has also put on performances at the Independent, Great American Music Hall, Golden Gate Park, and the Stern Grove Festival.  The band also performed at the Boulder Theater in Boulder, Colorado, for a five-night stand in March 2007.\n",
         "Santa Cruz, California has been home to various members of the band since moving to California. The band has performed at the Catalyst on nine occasions since 2002, including two two-night stands.  The band frequently played a club called Palookaville, until it closed in 2002.  In 2003, the band headlined the Santa Cruz Civic Center.\n",
         "In their home state of Georgia, the band continues to ride their popularity.  On October 3, 2006, the band marked the ninth anniversary of their first ever show with a celebration at the historic Georgia Theatre in Athens.  The band has performed many multiple-night stands at the Georgia Theatre since 2002.  For many years they have performed at the Tabernacle in Atlanta on New Year's Eve as part of multiple-night stands.\n",
         "The band has also built their own fan base in Chicago, Illinois, after performing multiple times at North Coast Festival and Lollapalooza with late night performances at the House of Blues Chicago. Also making frequent trips to the Aragon Ballroom and the Congress, STS9 has made Chicago a go-to city for performances.\n",
         "The band chose Denver as the host for their three 2009 New Year's Eve concerts. December 29 marked the band's first acoustic show ever, called \"Axe the Cables.\" The band performed two sets at the University of Denver's Gates Hall. The remaining two nights were standard \"electric\" shows played at the Wells Fargo Theater. STS9 returned to Denver for New Year's Eve 2010, playing three shows at the Fillmore Auditorium. The December 29, 2010 show opened and closed with a cover of the Grateful Dead's \"Shakedown Street\".\n",
         "For New Year's 2011, STS9 returned to the Tabernacle in Atlanta. They performed a five-night run starting on December 27. STS9 has continued to perform in Atlanta and Denver for New Year's since 2011.\n",
         "In August 2012, STS9 played another \"Axe the Cables\" acoustic show at the Mountain Winery in Saratoga, CA.[11]\n",
         "In the summer of 2013, the band co-headlined a 14-city tour with Umphrey's McGee, alternating the closing slot each night.[12]\n",
         "To end the year of 2013, STS9 played a five-night run at the Tabernacle in Atlanta that culminated on New Year's Eve. December 31, 2013 was the last show the original 5 founding members played together as the. Band would announce the departure of bassist, David Murphy, in the early weeks of 2014.\n",
         "On March 28, 2014 the band returned for their first concert following their split with David Murphy. This show was held in Phoenix, Arizona during the McDowell Mountain Music Festival, and was the first time the band played with new bassist Alana Rocklin.\n",
         "In September 2014, STS9 returned to Red Rocks Amphitheatre in Colorado to play two nights to a sold-out crowd. This run included two Axe The Cables sets with new bassist Alana Rocklin.\n",
         "STS9 ended 2014 with a four-night stand at the Fillmore Auditorium in Denver. The band turned New Year's Day into a benefit for Conscious Alliance, inviting 600 fans to a sit-down dinner and a full improv set.[13] This performance was later released through BitTorrent with the full 2014 catalog.[14]\n",
         "Returning to Red Rocks Amphitheatre in Colorado in September 2015, the group once again sold out both nights.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Social work",
      "3 Notable concert performances",
      "3.1 Festival appearances",
      "4 Discography",
      "5 Video and DVD",
      "5.1 DVD",
      "6 Side projects",
      "6.1 Tzolkin",
      "6.2 Landscape and Breath",
      "6.3 Santa Cruz Hemp All-Stars",
      "6.4 L.I.F.E.",
      "6.5 Root Science",
      "7 Members",
      "7.1 Former members",
      "8 References",
      "9 External links"
   ],
   "Side projects": {
      "L.I.F.E.": {
         "text": [
            "L.I.F.E. (Love In Full Effect) was a short-lived side project that included STS9 member Zach Velmer (drums) plus Max Malone (drums, bass) from The Free Energy Project.  According to the band, \"The intention of L.I.F.E. is to perform music as an uplifting experience of transformation to a higher vibration of love. Through selected tones and rhythms, the music is performed as a cycle of life recognizing our journey from birth to death, spring to winter, as circle, vibrating higher after each revolution to experience Love In its Fullest Effect.\"[21]\n",
            "L.I.F.E. performed live on:\n"
         ]
      },
      "Landscape and Breath": {
         "text": [
            "Landscape and Breath consists of STS9 members David Phipps (keyboards/laptop) and Hunter Brown (guitar/keyboards/programming).  The group's sound is very similar to that of STS9.  Steeped in ambience and without drums and bass, the sound is softer and lighter.  This side project has been known to work through raw material and ideas that eventually become STS9 compositions.\n",
            "Landscape and Breath is credited with producing four songs on the STS9 2005 release Artifact. The duo also contributed four different songs to the Low Pro Lounge 2004 release, The Most Hi-Fi.  Other Landscape and Breath compositions can be found on the STS9 2004 release Live At Home, although the songs are credited individually to Phipps and Hunter.\n",
            "Landscape and Breath performed live on:\n"
         ]
      },
      "Root Science": {
         "text": [
            "Root Science was a short-lived side project that included STS9 members Zach Velmer (drums) and David Murphy (bass).  The band also included DJ James Christopher, lyricists Lost and XQR, and female vocalist Syrene.  A promotional flyer put out by the band advertising the event read: \"Root Science is a classic drum and bass tracks interpreted live in an improvisational atmosphere.  As a group, the performers will recreate and simultaneously reinvent the sounds at the roots of the modern jungle.\"\n",
            "Root Science performed live on:\n"
         ]
      },
      "Santa Cruz Hemp All-Stars": {
         "text": [
            "Santa Cruz Hemp All-Stars (S.C.H.A.S.) is a side project that includes the STS9 rhythm section of Jeffree Lerner (percussion/effects) and Zach Velmer (drums).  STS9 member David Murphy (bass) has also appeared with the band on four occasions.\n",
            "S.C.H.A.S. performed live on:\n"
         ]
      },
      "Tzolkin": {
         "text": [
            "On several occasions, STS9 has billed themselves under the name \"Tzolkin\".  A promotional flyer put out by the band advertising the 2001 performance reads: \"A New Sound Expression from Tzolkin\".  Tzolkin consists of all five members of STS9.  These very experimental concerts have been used to debut brand new material in a live setting without having the audience expectation of hearing existing STS9 material.  \"Tzolkin\" means \"sequence of days\" and refers to a 260-day harmonic module calendar cycle.\n",
            "Tzolkin performed live on:\n"
         ]
      }
   },
   "Social work": {
      "text": [
         "STS9 has partnered with a variety of non-profit organizations throughout their career. Over the last decade, they have partnered with Conscious Alliance to bring food drives to various concerts and festivals on their tour. In exchange for fan participation in these events, STS9 and Conscious Alliance thank patrons with limited edition artwork posters, often created by the same artists who accompany the band on stage.  In 2005, STS9 put on a benefit concert where they raised over $20,000 for Hurricane Katrina victims.[8]\n",
         "Beginning in the fall of 2006, as part of their Live as Time Changes tour, STS9 traveled across the country in a carbon neutral tour bus and powered their live concerts using renewable energy. The band hoped to offset 100%, or about 138,000 pounds, of their carbon dioxide emissions from their tour by donations of Renewable Energy Credits from their partnership with environment-friendly companies.[9]\n",
         "STS9's remix album, Peaceblaster : The New Orleans Make It Right Remixes, features 30 remixes of material from their 2008 album, Peaceblaster. All proceeds from this album went to the Make it Right Foundation, in an effort to build a home in New Orleans, which has since been completed and taken up by a family displaced by Hurricane Katrina. The home has many eco-friendly features, including solar panels, high efficiency HVAC system, wire-free lighting panels, tankless water heater, dual flush toilets, low emissivity windows and doors, a rainwater collection system, and water-absorbing native landscaping. For protection against future storms, the home has walls that can withstand 130 mph winds, Kevlar hurricane shields for the windows, and a roof hatch in case an escape is necessary.\n"
      ]
   },
   "Summary": {
      "text": [
         "Sound Tribe Sector 9 (STS9) is an instrumental band whose sound is based heavily on instrumental rock and electronic music, funk, jazz, drum and bass, psychedelia, and hip hop, originating in Georgia, United States. Self-described as \"post-rock dance music,\"[3]  the band mixes standard live rock instrumentation with electronics, favoring group rhythm over individual solos.[4]\n",
         "STS9 has released 11 albums, two remixed albums (Artifact: Perspectives and Peaceblaster: Make it Right Remixes), and multiple live DVDs (Live as Time Changes, Axe The Cables, and various live performances) on their own label, 1320 Records.[5] STS9 has toured the US nationally and internationally, ranking among Pollstar Magazine's list of top-grossing touring acts,[citation needed] with a heavy presence in the music festival circuit.\n",
         "Some of their recent past accomplishments include headlining stages at some of the country's major music festivals (including Bonnaroo, Wakarusa, Electric Forest, and Suwanee Hulaween)[citation needed], playing for sold-out concert venues around the country (playing as both an acoustic set-up in opera houses and as an electronic act in amphitheaters)[citation needed], performing with the likes of Jay-Z in Denver of 2010[citation needed], running an independent record label[citation needed], and using their voice as a platform for change[citation needed], along with raising significant amounts of money towards activism efforts[citation needed]. STS9 is also known for pushing musical boundaries, mixing different music influences and sounds by using both acoustic and electronic means[citation needed].\n"
      ]
   },
   "Title": "Sound Tribe Sector 9 - Wikipedia",
   "Video and DVD": {
      "DVD": {}
   }
}