{
   "Name": "Sound Tribe Sector 9",
   "rawData": [
      "Sound Tribe Sector 9 (STS9) is an instrumental band whose sound is based heavily on instrumental rock and electronic music, funk, jazz, drum and bass, psychedelia, and hip hop, originating in Georgia, United States. Self-described as \"post-rock dance music,\"  the band mixes standard live rock instrumentation with electronics, favoring group rhythm over individual solos.\n",
      "STS9 has released 11 albums, two remixed albums (Artifact: Perspectives and Peaceblaster: Make it Right Remixes), and multiple live DVDs (Live as Time Changes, Axe The Cables, and various live performances) on their own label, 1320 Records. STS9 has toured the US nationally and internationally, ranking among Pollstar Magazine's list of top-grossing touring acts, with a heavy presence in the music festival circuit.\n",
      "Some of their recent past accomplishments include headlining stages at some of the country's major music festivals (including Bonnaroo, Wakarusa, Electric Forest, and Suwanee Hulaween), playing for sold-out concert venues around the country (playing as both an acoustic set-up in opera houses and as an electronic act in amphitheaters), performing with the likes of Jay-Z in Denver of 2010, running an independent record label, and using their voice as a platform for change, along with raising significant amounts of money towards activism efforts. STS9 is also known for pushing musical boundaries, mixing different music influences and sounds by using both acoustic and electronic means.\n"
   ],
   "infobox": {
      "Origin": [
         "Santa Cruz, California",
         "Atlanta/Athens, Georgia"
      ],
      "Genres": [
         "Livetronica[1][2]"
      ],
      "Years active": [
         "1998–present"
      ],
      "Labels": [
         "1320 Records"
      ],
      "Website": [
         "www.sts9.com"
      ],
      "Members": [
         "Hunter Brown ",
         "Alana Rocklin",
         "Jeffree Lerner",
         "David Phipps",
         "Zach Velmer"
      ],
      "Past members": [
         "David Murphy"
      ]
   },
   "albums": [
      "Interplanetary Escape Vehicle"
   ]
}