{
   "Name": "Spafford (band)",
   "Sections": [
      "1 Style",
      "2 History",
      "3 Members",
      "4 Performances",
      "5 Tours",
      "6 Festivals",
      "7 Recordings",
      "8 Discography",
      "8.1 Studio Albums",
      "8.2 Live Albums",
      "9 References",
      "10 External links"
   ],
   "Summary": {
      "text": [
         "Spafford is an American jam band that blends genres of rock, funk, jazz, reggae, ska, and electro-pop. Members Brian Moss (guitar/vocals) and Jordan Fairless (bass/vocals) formed Spafford in Prescott, Arizona on New Year's Eve in 2009. Andrew “Red” Johnson (keys/vocals) joined Moss and Fairless after meeting the duo at an open mic night in Prescott. Cameron Laforest (drums/percussion/vocals) was the last addition of this current formation until Spafford and Cam went their separate ways April 2019. Spafford’s previous drummer, Nick Tkachyk, returned to the band at this point. The group self-releases their music, many of which are soundboard recordings of their live shows.\n"
      ]
   },
   "Style": {
      "text": [
         "Spafford's sound is the product of the different songwriters and singers in the band.[1] The band uses an improvisational style to transition between the songs in their sets of live music,[2] selecting diverse covers.[3] Spafford tours across the U.S., and each of their shows features a different setlist and approach to each song they play.[4] Through their tours, archives, and live video recordings, the band has a fan base of \"Spaffnerds\" who travel to see the band and maintain an online community surrounding its shows.[5] The band provide live streams and access to recordings of their shows on their website.[6]\n"
      ]
   },
   "History": {
      "text": [
         "Brian Moss and Jordan Fairless are the founding members of Spafford. They both played open mic nights at Coyote Joe's in Prescott, Arizona, in 2008. At the time, Moss played guitar and Fairless was the percussionist. In 2010, Mike Kreidel (2010-2011) became Spafford's drummer, and Fairless took on bass guitar. The first keyboard player was Jonathan Hust (2010-2011).[7] In 2011, Red Johnson joined Spafford, and Cameron Laforest  became Spafford's drummer, replacing Nick Tkachyk (2011-2017), in 2017,[8] firming up the band's current membership. Nick returned to the band in the spring of 2019.[9]\n"
      ]
   },
   "Members": {
      "text": [
         "Brian Moss was born on February 22, 1985, in River Vale, New Jersey. He started writing music when he was 12 years old.[10] Brian moved to Arizona in his twenties and played in several bands in Phoenix and in Prescott before he met Jordan Fairless in 2008 and went on to develop Spafford shortly thereafter.   \n",
         "Jordan Christopher Fairless was born on September 1, 1985. Raised in a musical family in Nashville, Tennessee, Jordan is a multi-instrumentalist. He was more a drummer than a bassist when he and Brian first met, and he focused on the bass guitar thereafter. Jordan served as a sound engineer at Prescott's Green Room during Spafford's early years. \n",
         "Andrew \"Red\" Johnson was born on December 2, 1980. He hails from Belvidere, Illinois, and moved to Phoenix in 2001. Red was a pianist, vocalist, and keyboard player in the Phoenix music scene before he joined Spafford for his first show at the Hard Rock in Las Vegas in 2011.   \n",
         "Nick Tkachyk was born February 24, 1989 in Tucson, Arizona. Nick has been a drummer since birth and would arrange pots and pans to drum on before receiving his first drum kit. His first musical endeavor was a ska outfit in high school. In addition to playing drums, Nick also creates electronic music. Nick took a hiatus from Spafford from 2017 - 2019 before rejoining the group for Jazz Festival in New Orleans, LA.  \n",
         "Chuck \"Spafford\" Johnson was born on June 23, 1985. He is originally from Denver, Colorado. Chuck was Spafford's original lighting designer, co-lyricist, and namesake. Chuck's lighting design set the stage for Spafford's performances. Chuck helps guide both the band's aesthetic and its musical direction.\nAs Johnson decided not to tour with the band, Ben Factor stepped in as lighting director for the latter part of 2017. He graduated from University of Michigan with a BS in Sound Engineering. The band met Ben while touring with Mungion, who Ben worked with prior.\n"
      ]
   },
   "Performances": {
      "text": [
         "Spafford has made over 100 recordings of their live shows available on the Live Music Archive (archive.org).[11] Their music is also featured on Sirius XM's JamOn,[12] as well as on nugs.net,[13] Spotify,[14] and Apple Music.[15] The band interviewed with Sirius XM Jam On host Ari Fink in April 2018 to promote For Amusement Only, and the interview aired tracks from the album, as well as a 57-minute live jam that was recorded in Steamboat Springs, Colorado, during the winter 2018 tour.\n",
         "Spafford has hosted after-party shows for Furthur and Widespread Panic.[16] Spafford has also been the featured act at the Las Vegas venues Hard Rock Hotel and Casino and The Palms.[17] Spafford has opened for Umphrey's McGee and shared the stage with, Particle, the Motet, and EOTO.[18]\n",
         "IAmAVL.com broadcast and archived the band's shows at the Asheville Music Hall on October 21 and 22, 2017.  They also sat for an Echo Session, which was broadcast live.[19]\n",
         "On April 6, 2018, Spafford played for a Knicks halftime show at Madison Square Garden.[20]\n",
         "On May 27, 2018, Spafford made their first appearance at Red Rocks Amphitheater, in Morrison, Colorado, with Organ Freeman, opening for the Disco Biscuits at 2018's Bisco Inferno.[21]\n"
      ]
   },
   "Tours": {
      "text": [
         "In summer 2014, Spafford toured the Southwest.[22]\n",
         "In 2016, Spafford traveled East of Colorado for their \"Breakout Tour\".[23] On that tour, they sold out Chicago's Tonic Room for a two-night show in less than two hours.[24]\n",
         "In winter 2017, Spafford toured with Umphrey's McGee for over a dozen shows.[25][26] They also headlined their own tour simultaneously.[27] Spafford joined Umphrey's McGee again to play five shows for the second leg of their summer 2018 tour.[28]\n",
         "In winter 2018, Spafford kicked off the For Amusement Only tour with 17 shows across the Northeast, Midwest, and Southeast United States.[29]  Spafford also toured from September to November 2017 and returned to their home base in Phoenix, Arizona to play a three-night, sold-out New Year's Eve run at the Crescent Ballroom.[30] The fall tour included more than 30 dates in over 20 states across the U.S.[31]\n",
         "On the 2018 schedule for Spafford was a continuation of the For Amusement Only tour[5] to promote their third studio album, which follows Abaculus: An Improvisational Experience (2017)[32] and Spafford (2012). They released the first single, \"Leave the Light On,\" from For Amusement Only on April 4, 2018.[33] The band has also released live albums from songs played on tour, the most recent of which was A Taste of Fall.[34]\n",
         "To open 2019, Spafford announced a 40 show winter tour, spanning across two months from January until March. The tour set the band to cover ground starting in Minnesota, to New York, Florida, and Colorado, out to Washington, and ending in California. The locations are many venues they had played in the prior year; however, across the states the band announced many debuts in venues much larger than those than in 2018. In Asheville, playing the 1,050 person Orange Peel after the 360 person Asheville Music Hall the prior year. Similarly, graduating from the 625 Person Terminal West in Atlanta to the 1,000 person Variety Playhouse.\n"
      ]
   },
   "Festivals": {
      "text": [
         "Earlier festivals Spafford appeared at include Gem and Jam (Tucson, AZ), Euphoria (Austin, TX),[35] and the McDowell Mountain Music Festival (Phoenix, AZ).[36]\n",
         "In mid-2017, Spafford played Head for the Hills (New Braunfels, TX), Mad Tea Party Jam (Artemas, PA), Electric Forest (Rothbury, MI),[37] Some Kind of Jam (Schuylkill Haven, PA),[38] Summer Camp (Chillicothe, IL),[39] Wind Rider (Alto, NM),[40] and the Resonance Music Festival (Thornville, OH).[41] At these festivals, Spafford played alongside artists like Rusted Root, Gov’t Mule, My Morning Jacket, The String Cheese Incident,[37] Moe.,  Bassnectar, Trey Anastasio Band,  Lettuce, Mike Gordon,  Primus, the Disco Biscuits, and Lotus.\n",
         "In summer 2018, Spafford played the following festivals:\n",
         "At the Sweetwater 420 Fest at Centennial Olympic Park in Atlanta, Georgia, Spafford performed alongside a lineup that included the String Cheese Incident, Tedeschi Trucks Band, Joe Russo's Almost Dead, and Greensky Bluegrass.[42] Spafford also returned to the Summer Camp Music Festival in Chillicothe, Illinois[39] alongside moe., Phil Lesh & the Terrapin Family Band, and Cypress Hill. Spafford's first Bonnaroo appearance is billed with artists including Eminem, Muse and the Killers.[43] Additionally, the band made its debut appearance at Firefly with Kendrick Lamar and Arctic Monkeys,[44] The Peach Music Festival (featuring Phil Lesh, Gov't Mule and Joe Russo's Almost Dead),[45] and Lockn' (featuring Umphrey's McGee, Widespread Panic, and Dead & Co.).[46]\n"
      ]
   },
   "Recordings": {
      "text": [
         "The first Spafford studio album was self-titled, released in 2012, and the band termed it \"traditional.\"[47]\n",
         "In 2017, Spafford released the hour-long, single track Abaculus: An Improvisational Experience, culled from a continuous jam the band recorded at their rehearsal space called \"The Pound.\"[48]\n",
         "Among the live recordings that Spafford has made available, the band has released three studio albums, the most recent of which was For Amusement Only, which was released in May 2018[49]\n"
      ]
   },
   "Discography": {
      "Studio Albums": {},
      "Live Albums": {},
      "text": [
         "[citation needed]\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Spafford is an American jam band that blends genres of rock, funk, jazz, reggae, ska, and electro-pop. Members Brian Moss (guitar/vocals) and Jordan Fairless (bass/vocals) formed Spafford in Prescott, Arizona on New Year's Eve in 2009. Andrew “Red” Johnson (keys/vocals) joined Moss and Fairless after meeting the duo at an open mic night in Prescott. Cameron Laforest (drums/percussion/vocals) was the last addition of this current formation until Spafford and Cam went their separate ways April 2019. Spafford’s previous drummer, Nick Tkachyk, returned to the band at this point. The group self-releases their music, many of which are soundboard recordings of their live shows.\n",
      "Spafford's sound is the product of the different songwriters and singers in the band.[1] The band uses an improvisational style to transition between the songs in their sets of live music,[2] selecting diverse covers.[3] Spafford tours across the U.S., and each of their shows features a different setlist and approach to each song they play.[4] Through their tours, archives, and live video recordings, the band has a fan base of \"Spaffnerds\" who travel to see the band and maintain an online community surrounding its shows.[5] The band provide live streams and access to recordings of their shows on their website.[6]\n",
      "Brian Moss and Jordan Fairless are the founding members of Spafford. They both played open mic nights at Coyote Joe's in Prescott, Arizona, in 2008. At the time, Moss played guitar and Fairless was the percussionist. In 2010, Mike Kreidel (2010-2011) became Spafford's drummer, and Fairless took on bass guitar. The first keyboard player was Jonathan Hust (2010-2011).[7] In 2011, Red Johnson joined Spafford, and Cameron Laforest  became Spafford's drummer, replacing Nick Tkachyk (2011-2017), in 2017,[8] firming up the band's current membership. Nick returned to the band in the spring of 2019.[9]\n",
      "Brian Moss was born on February 22, 1985, in River Vale, New Jersey. He started writing music when he was 12 years old.[10] Brian moved to Arizona in his twenties and played in several bands in Phoenix and in Prescott before he met Jordan Fairless in 2008 and went on to develop Spafford shortly thereafter.   \n"
   ]
}