{
   "Name": "Spyro Gyra",
   "rawData": [
      "Spyro Gyra /ˌspaɪroʊˈdʒaɪrə/ is an American jazz fusion band that was formed in Buffalo, New York, in 1974. The band's music combines jazz, R&B, funk, and pop music. The band's name comes from Spirogyra, a genus of green algae which founder Jay Beckenstein had learned about in college.\n",
      "Saxophonist Jay Beckenstein and keyboardist Jeremy Wall formed a band with jazz and rock musicians who were playing in the Buffalo bar and club circuit. In 1974, when a bar owner asked for the band's name, Beckenstein said, \"spirogyra\", a type of algae he had learned about in school. The bar owner wrote the name incorrectly, \"Spyro Gyra\", but it stuck. The founding members of the band were Beckenstein, Wall, bassist Jim Kurzdorfer, drummer Tom Walsh, and keyboardist Tom Schuman.  In 1977, they released Spyro Gyra independently before making a deal with Amherst Records, which re-released the album with a different cover. It included \"Shaker Song,\" which reached No. 90 on Billboard's Hot 100, No. 99 on the pop chart in Canada, and No. 26 on the Canadian AC chart.\n",
      "Morning Dance reached No. 11 in the UK Albums Chart, No. 27 on the Billboard Top 200 albums chart, and No. 47 in Canada. The song \"Morning Dance\" reached No. 17 in the UK Singles Chart, No. 1 on the US Adult Contemporary singles chart, No. 45 on the Canadian pop charts, and No. 6 on the Canadian AC charts.  The album was certified gold in 1979, then platinum in 1987 by the RIAA.\n"
   ],
   "infobox": {
      "Origin": [
         "Buffalo, New York, U.S."
      ],
      "Genres": [
         "Jazz, jazz fusion, smooth jazz"
      ],
      "Years active": [
         "1974–present"
      ],
      "Labels": [
         "Amherst, MCA, GRP, Windham Hill, Heads Up"
      ],
      "Website": [
         "www.spyrogyra.com"
      ],
      "Members": [
         "Jay Beckenstein",
         "Tom Schuman",
         "Scott Ambush",
         "Julio Fernández",
         "Lionel Cordew"
      ],
      "Past members": [
         "Jeremy Wall",
         "Dave Samuels",
         "Gerardo Velez",
         "Bonny Bonaparte",
         "Joel Rosenblatt",
         "Chet Catallo",
         "Dave Wofford",
         "Eli Konikoff",
         "Richard Calandra",
         "Richie Morales",
         "Kim Stone",
         "Tom Walsh",
         "Jim Kurzdorfer",
         "Ted Reinhardt",
         "Marc Quiñones",
         "Manolo Badrena"
      ]
   },
   "albums": [
      "Catching the Sun",
      "Incognito",
      "City Kids",
      "Access All Areas",
      "Alternating Currents",
      "Wrapped in a Dream",
      "Good to Go-Go",
      "A Night Before Christmas",
      "Down the Wire"
   ]
}