{
   "Name": "Strangefolk",
   "rawData": [
      "Strangefolk is a rock-oriented jam band originally from Burlington, VT. Since forming in 1991, the band has released five studio albums, four live albums and one live concert DVD. The band consists of Jon Trafton (lead guitar, vocals), Erik Glockler (bass, vocals), Reid Genauer (rhythm guitar, vocals), and Luke Smith (drums).\n",
      "Originally formed at the University of Vermont as an acoustic duo \"Strange Folk\" in 1991 by Jon Trafton and Reid Genauer, Strangefolk (now one word) added bass and drums within in 1993 and took to playing the bars in and around the vibrant musical community of Burlington, Vermont.  After only a couple years of developing their signature sound in and around the Vermont music scene, the band began touring the club and college circuit around the Northeast, quickly gaining momentum and popularity with each tour.  Regional tours paved the way for national tours, with the band logging over 100 shows per year.  In 1998, Strangefolk signed with Mammoth Records, only to have the record deal collapse when Disney purchased Mammoth in 1999.  \"A Great Long While\", which was to be the band's major-label debut and was produced by Nile Rodgers, was released independently in 2000.\n",
      "In September 2000, following the band's annual Garden of Eden Festival in New Haven, Vermont, founding member and primary songwriter Genauer left the band to pursue a graduate degree at Cornell University, as well as other personal reasons.  He had grown weary of Strangefolk's hectic touring schedule and was discontent with the end of the band's record deal and the direction of the band. In 2002, Genauer formed Assembly of Dust, which continues to tour today.\n"
   ],
   "infobox": {
      "Origin": [
         "Burlington, Vermont, USA"
      ],
      "Genres": [
         "Jam, rock, jazz, folk, progressive rock"
      ],
      "Years active": [
         "1991 − Present"
      ],
      "Associated acts": [
         "Percy Hill ",
         " Assembly of Dust"
      ],
      "Website": [
         "http://www.strangefolk.com/"
      ],
      "Members": [
         "Jon Trafton (1991 − present)",
         "Erik Glockler (1992 − present)",
         "Reid Genauer (1991−2000, 2012- present)",
         "Luke Smith (1992−2004, 2012)"
      ],
      "Past members": [
         "Luke \"Patchen\" Montgomery (2000−2011)",
         "Don Scott (2001−2011)",
         "Russ Lawton (2004−2011)"
      ]
   },
   "albums": [
      "Strangefolk",
      "Lore",
      "Weightless in Water",
      "Live (EP)",
      "A Great Long While",
      "Open Road",
      "Coast 2 Coast",
      "Coast 2 Coast: Volume 2",
      "Live at the Capitol Theatre Port Chester, NY 12/27/98",
      "Live Live At The Palladium 11/27/99 (2018)"
   ]
}