{
   "Name": "Tea Leaf Green",
   "Sections": [
      "1 History",
      "1.1 Formation and beginning",
      "1.2 Festivals and studio albums",
      "1.3 Documentary film",
      "1.4 Lineup changes",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Live albums",
      "2.3 DVDs",
      "2.4 Compilations",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Tea Leaf Green is an American four-piece jam band from the San Francisco Bay Area, composed of Josh Clark (guitar and vocals), Trevor Garrod (keyboards, vocals, guitar, and harmonica), Scott Rager (drums), and Eric DiBerardino (bass).\n"
      ]
   },
   "History": {
      "Formation and beginning": {
         "text": [
            "Tea Leaf Green began in the fall of 1996, when Scott Rager met Ben Chambers on the campus of San Francisco State University. Chambers was the group's original bass player but left in 2007; he is featured on the band's first four albums. Rager and Chambers began playing together, practicing in Chambers's bedroom in a back house off Church Street in the Castro District. In early 1997, Clark, a childhood friend of Rager, moved from Los Angeles to San Francisco and became the third member of the band. Garrod, also a SFSU student, joined soon after.[1]\n",
            "In the late-1990s, Tea Leaf Green began performing throughout San Francisco, becoming the de facto house band at the Elbo Room for a period in 1999. The band's first album, eponymously titled, was produced by Jimmy Foot and engineered by Jimmy and Susie Foot. It was released on Bongo Boy Records and featured twelve original compositions, including songs such as \"Professor's Blues\", \"Asphalt Funk\", and \"California\", all of which remained part of the band's live repertoire for years.[2]\n",
            "In the early part of the 2000s, Tea Leaf Green was an integral member of a burgeoning rock music revitalization in San Francisco that also featured bands such as Animal Liberation Orchestra and New Monsoon.\n",
            "In 2001, Tea Leaf Green released their second album, Midnight on the Reservoir, following up with a live release from the Great American Music Hall, unofficially referred to as the \"Green Album\" because of its all-green cover. Midnight on the Reservoir highlighted the group’s rapid evolution from its previous release, offering a heightened element of psychedelia, bombastic rock numbers, and a cohesive, thematic lyrical approach. Garrod unearthed childhood memories for the mysterious opening track \"Midnight on the Reservoir\" and the ebullient sing-along \"Papa's in the Backroom\", while the band ripped through instrumental jams such as \"Panspermic De-evolution\" and \"Hot Dog\". Clark referred to this effort as the band's \"party album\".\n"
         ]
      },
      "Festivals and studio albums": {
         "text": [
            "In 2002, the band embarked on its first national tour, using the High Sierra Music Festival as a springboard to a more substantial audience, and was featured in the December, 2002 issue of Relix magazine. Soon, Tea Leaf Green utilized the festival circuit as a platform of introduction, playing to larger and larger audiences as it built a reputation for galvanizing live performances. Appropriately, the band's third studio album, Living in Between, was bookended by two live releases recorded in San Francisco, Slim's (2003) and Live at the Independent (2004). Living in Between again featured Clark's cover art.\n",
            "While continuing to tour extensively through the United States, Tea Leaf Green headed to Navarro Ridge Range in Mendocino, California, forsaking the confines of the city, to record Taught to Be Proud (2005), the band's fourth album. With a focus on songs, as opposed to jams, the four members simplified the recording process, utilizing live takes on many of the tracks. The title track earned Tea Leaf Green a Jammy Award for Song of the Year in 2006.\n",
            "In 2007, Tea Leaf Green began the year playing Jam Cruise 5 and toured the country, playing more than 130 shows, including numerous summer festivals such as Wakarusa, Bonnaroo, and High Sierra. Late in the year, original bassist Chambers decided to leave the band, citing exhaustion and a desire to be with family, and retired from active participation in the music profession. At approximately the same time, the band signed its first significant recording contract, with Surfdog Records. The company subsequently released a three CD boxset, entitled Seeds, that conflated the band's first three releases into a single volume. The timing was appropriate and seemed to seal Chambers' departure with a stamp of finality. The retrospective was the precursor to the band's first new album with Surfdog.\n"
         ]
      },
      "Documentary film": {
         "text": [
            "In 2006, filmmaker Justin Kreutzmann, son of Grateful Dead drummer Bill Kreutzmann, directed a documentary of the band, entitled \"Rock 'n' Roll Band\", that interlaced live footage from a May, 2006 concert at the Fox Theatre in Boulder, Colorado, with individual and group interviews with each member of the band. The film emphasized the struggle facing a young band, capturing footage of the members at home and in the streets of San Francisco as they discuss hardship and sacrifice inherent in the pursuit of a dream. Kreutzmann utilized the Fox Theatre performance to showcase the band's distinctive musical spirit: organic but ambitious, confident but never cocky, boisterous but thoughtful, soulful and exploratory. The DVD was released in tandem with a live CD also entitled \"Rock 'n' Roll Band.\"\n"
         ]
      },
      "Lineup changes": {
         "text": [
            "In late 2007, less than two months after Chambers's exit, Tea Leaf Green introduced Reed Mathis, of Jacob Fred Jazz Odyssey (JFJO), as its new bass player. Mathis had previously performed with the Jacob Fred Jazz Odyssey, which he helped form in 1994. Mathis played his first show with Tea Leaf Green on December 7, 2007, in Santa Cruz, California. In January 2008, Tea Leaf Green entered a Richmond, Virginia recording studio with producer David Lowery, taking one week to cut a fifth album, Raise Up the Tent which was released in summer, 2008. The album opens with a Chambers-inspired funk bass on \"Let Us Go\", features two Clark compositions (\"Borrowed Time\" and \"Stick to the Shallows\").\n",
            "In 2008, the band played its first show overseas as part of the Jam in the 'Dam Music Fest in Amsterdam. Garrod, Clark, and Rager also pursued side projects around San Francisco. Because of prior obligations to Jacob Fred Jazz Odyssey, Mathis missed a handful of gigs with in 2008. Steve Adams of Animal Liberation Orchestra substituted on bass for those shows in which Mathis was otherwise obliged. Near the end of the year, Mathis announced publicly that he was departing Jacob Fred Jazz Odyssey to commit more time to Tea Leaf Green. The group reprised its role on Jam Cruise in 2009, playing on the seventh edition of the event.\n",
            "In the winter of 2011, Cochrane McMillan was added as a permanent member of the group.\n",
            "In an interview with The Waster, Trevor Garrod announced the fifth addition to the band, percussionist Cochrane McMillan, and a spring 2011 release of the studio album, Radio Tragedy. They released another studio album, In The Wake, in 2013.[3][4]\n",
            "On August 16, 2016, it was announced that bassist Reed Mathis would be leaving Tea Leaf Green to focus on his other projects. He was replaced by Eric DiBerardino. DiBerardino had previously filled in for Mathis at select performances.[5]\n"
         ]
      }
   },
   "Discography": {
      "Studio albums": {},
      "Live albums": {},
      "DVDs": {},
      "Compilations": {
         "text": [
            "\n"
         ]
      }
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Tea Leaf Green is an American four-piece jam band from the San Francisco Bay Area, composed of Josh Clark (guitar and vocals), Trevor Garrod (keyboards, vocals, guitar, and harmonica), Scott Rager (drums), and Eric DiBerardino (bass).\n",
      "Tea Leaf Green began in the fall of 1996, when Scott Rager met Ben Chambers on the campus of San Francisco State University. Chambers was the group's original bass player but left in 2007; he is featured on the band's first four albums. Rager and Chambers began playing together, practicing in Chambers's bedroom in a back house off Church Street in the Castro District. In early 1997, Clark, a childhood friend of Rager, moved from Los Angeles to San Francisco and became the third member of the band. Garrod, also a SFSU student, joined soon after.[1]\n",
      "In the late-1990s, Tea Leaf Green began performing throughout San Francisco, becoming the de facto house band at the Elbo Room for a period in 1999. The band's first album, eponymously titled, was produced by Jimmy Foot and engineered by Jimmy and Susie Foot. It was released on Bongo Boy Records and featured twelve original compositions, including songs such as \"Professor's Blues\", \"Asphalt Funk\", and \"California\", all of which remained part of the band's live repertoire for years.[2]\n",
      "In the early part of the 2000s, Tea Leaf Green was an integral member of a burgeoning rock music revitalization in San Francisco that also featured bands such as Animal Liberation Orchestra and New Monsoon.\n"
   ]
}