{
   "Name": "The Bright Light Social Hour",
   "Sections": [
      "1 History",
      "1.1 Formation and early work (2004-2010)",
      "1.2 The Bright Light Social Hour (2010–2014)",
      "1.3 Space Is Still the Place (2015–2018)",
      "1.4 Jude Vol. I & Jude Vol. II (2019–present)",
      "2 Production",
      "3 Discography",
      "3.1 Albums",
      "3.2 Live Albums",
      "3.3 EPs",
      "3.4 Singles",
      "3.5 Compilations",
      "3.6 Music Videos",
      "4 Band members",
      "5 See also",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "The Bright Light Social Hour is an American psychedelic rock band from Austin, Texas. The band is composed of Jackie O'Brien on bass and vocals, Curtis Roush on guitar and vocals, Edward \"Shreddward\" Braillif on synthesizers and guitar, and Zac Catanzaro on drums.\n"
      ]
   },
   "History": {
      "Formation and early work (2004-2010)": {
         "text": [
            "In September 2004, Southwestern University students Curtis Roush (guitar), Thomas Choate (drums) and Jack O’Brien (vocals/keyboards), along with Ryan “Badcock” O’Donoghue (bass) began playing together as a post-hardcore art rock collective. They were often billed with area hardcore bands such as 25 Dollar Massacre, Thumbscrew and At All Cost and quickly grew a reputation for their visceral live shows. The band took a year hiatus while Roush studied audio engineering and O’Brien studied linguistics and Flamenco guitar in Madrid, during which time Choate moved away to study eco building.[1]\n",
            "In October 2006, upon O’Brien's return, the band brought in Joseph Mirasole, a drummer from a local high school drum line, via Craigslist.[2] During this period the band recorded their first studio EP, Touches.  Soon after, the band relocated to Austin where O’Brien and Roush enrolled in Master's programs at the University of Texas. They parted ways amicably with Badcock, with Jack taking over bass duties and Roush helping with vocals.[3]\n",
            "In 2008 they released the EP Love Like Montopolis, which showcased a more delicate, downtempo post-rock sound, and brought on local singer-songwriter A.J. Vincent on keys and vocals.[4]\n"
         ]
      },
      "The Bright Light Social Hour (2010–2014)": {
         "text": [
            "The band continued to grow their reputation with consistent high energy shows in southern states, their sound evolving to include elements of soul, southern rock and psychedelia.[5] The band released their debut full-length album in late 2010, entitled The Bright Light Social Hour. The album was recorded in Austin during summer 2010 with producer Danny Reisch.\n",
            "Momentum built for the band under the leadership of new manager Alex O'Brien, and in March 2011 they swept the 29th Annual Austin Music Awards during SXSW,[6]  with an unprecedented 6 awards, including Band of the Year, Album of the Year and Song of the Year (for their song \"Detroit\").[7] Subsequently, The Bright Light Social Hour began a relentless touring schedule, playing over 400 shows across the United States, Canada and Mexico.[8] In July 2012 they opened for Aerosmith in Quebec City, and in 2013-2014 played such festivals as Lollapalooza, Austin City Limits Music Festival, Hangout Music Festival, Sasquatch! Music Festival, Wakarusa Music Festival and Ottawa Bluesfest.[9]\n",
            "In January 2013, citing growing personal and creative differences, Vincent was replaced by keyboardist/guitarist Edward \"Shreddward\" Braillif, whom Mirasole had known DJing in Austin.[10][11]\n",
            "On June 25, 2013 Mirasole, Roush and O'Brien were in attendance at Senator Wendy Davis' famous filibuster of Texas Senate Bill 5. Inspired by the ferocity of the crowd gathered in the Capitol, they rushed to their studio and by the morning had released the song \"Wendy Davis,\" with an accompanying video made in part with protest footage taken on the band's phones. The video was featured in MSNBC's national coverage of the event.[12][13]\n",
            "In May 2013 the band announced they'd begun work on their second full-length album, to be performed, produced and engineered by Roush, O'Brien and Mirasole.[14]\n"
         ]
      },
      "Space Is Still the Place (2015–2018)": {
         "text": [
            "On January 19, 2015, after a severe and protracted battle with bipolar I disorder, Alex O'Brien, the band's long-time manager and Jack's brother, committed suicide. Jack discovered him outside the band's home studio where he resided soon after suffering a self-inflicted gunshot wound. He had resigned his position as manager months earlier, but continued to advise the band until his death.[15]\n",
            "On January 20, the band announced via The Huffington Post[16] that their newest album, Space Is Still the Place would be released March 10, 2015 on Frenchkiss Records.\n",
            "On February 17, 2015, Jay Z's Life+Times premiered the music video for their first single, \"Infinite Cities\", directed by bassist/singer Jack O'Brien.[17]\n",
            "Space Is Still the Place was released on March 10 to positive reviews, described by AllMusic's Mark Deming as \"an ambitious and wildly entertaining journey into the minds of the men who created it.\" [18] The band celebrated the release with a sold-out performance at Stubb's Austin including a tribute to Alex featuring prominent Austin musicians Ray Wylie Hubbard, Walker Lukens, Megafauna, Migrant Kids, and members of Black Joe Lewis & the Honeybears.[19]\n",
            "Songs from Space Is Still the Place have been featured in HBO's Vice Principals, MTV's Teen Wolf, Fox's Brooklyn Nine-Nine, The CW's Riverdale, NBC's Midnight, Texas, Audience's Kingdom, USA's Shooter, Hulu's Shut Eye, Terrence Malick's 2017 film Song to Song and Ubisoft's Far Cry 5.[20][21][22][23]\n",
            "Following the release of Space Is Still the Place, TBLSH embarked on a year-long tour of the United States, Canada and Mexico, including runs supporting Dr. Dog, Edward Sharpe and the Magnetic Zeros and Galactic.[24]\n",
            "On November 13, 2015, shortly before taking the stage at Lincoln Hall (Chicago), the band heard news of the November 2015 Paris attacks and scrambled to have their performance recorded. Soon after, the digital album, Live at Lincoln Hall, was available for download from the band's Bandcamp page in exchange for any donation to the French Red Cross.[25]\n",
            "In March 2016, TBLSH released a cover of The Beach Boys' \"All I Wanna Do\", which was featured on the ALL ATX All Along the Moontower compilation.[26]\n",
            "On November 4, 2016, TBLSH and Israel Nash released the three-song collaborative EP Neighbors. The EP was recorded between the two bands' studios near Austin, and was released digitally and as a limited edition 7\" vinyl record.[27]\n",
            "In January 2017, Amazon Video released the series Sneaky Pete, for which TBLSH wrote the theme song \"Harder Out Here.\"[28]\n",
            "On January 20, Donald Trump's Inauguration Day, TBLSH released the Jim Eno-produced single, \"Tear Down That Wall,\" described by the Austin-American Statesman as \"a searing ode to unity.\" The accompanying video features Austin musicians as well as Cuban youth smiling and waving middle fingers.[29]\n",
            "On September 28, 2018 TBLSH released Missing Something, a five-song EP produced by the band and mixed by Spoon's Jim Eno, via Modern Outsider.[30] The Austin Chronicle premiered an O'Brien-directed music video for the song \"Trip With Lola.\"[31] Another O'Brien-directed video featuring frogs leaping from breasts in slow motion followed for \"Missing Something\", winning Best Music Video at the Top Indie Film Awards and earning official selection at the Austin Music Video Festival, Berlin Music Video Awards and Erotic & Bizarre Art Film Festival in Alicante, Spain.\n"
         ]
      },
      "Jude Vol. I & Jude Vol. II (2019–present)": {
         "text": [
            "On January 3, 2019 Relix announced the February 1 release of a new album, entitled Jude Vol. I and premiered the single \"Lie To Me (Große Lüge)\". The album was produced by Chris Coady and recorded at Sunset Sound Recorders.[32]\n",
            "Following an extensive North American spring tour, the band took some time off, returning to the stage in November with new drummer Zac Catanzaro of Walker Lukens.\n",
            "The band returned with Jude Vol. II on August 28, 2020. Released on Roll Call Records, six of the album's eight tracks were recorded by Chris Coady in the same session as Jude Vol. I. Lead single \"Enough\" was recorded in late 2019 by Curtis and Jackie at Escondido Sound. Medium premiered the song and video, writing, \"Brimming with buttery psychedelic aromas amid tints of polished dream-pop, “Enough” reveals not only the talent, but the brilliant innovation of The Bright Light Social Hour.\" The video was nominated for 4 awards at the Austin Music Video Festival, winning an honorary \"best psychedelic astral orgy\" award. [33]\n"
         ]
      }
   },
   "Production": {
      "text": [
         "The Bright Light Social Hour operate as an audio production and engineering unit, recording and mixing themselves and artists such as Megafauna, Ray Wylie Hubbard, Walker Lukens, Migrant Kids and Bombay the Rapper out of their Austin studio, Escondido Sound.[34]\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Live Albums": {},
      "EPs": {},
      "Singles": {},
      "Compilations": {},
      "Music Videos": {}
   },
   "Band members": {},
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Bright Light Social Hour is an American psychedelic rock band from Austin, Texas. The band is composed of Jackie O'Brien on bass and vocals, Curtis Roush on guitar and vocals, Edward \"Shreddward\" Braillif on synthesizers and guitar, and Zac Catanzaro on drums.\n",
      "In September 2004, Southwestern University students Curtis Roush (guitar), Thomas Choate (drums) and Jack O’Brien (vocals/keyboards), along with Ryan “Badcock” O’Donoghue (bass) began playing together as a post-hardcore art rock collective. They were often billed with area hardcore bands such as 25 Dollar Massacre, Thumbscrew and At All Cost and quickly grew a reputation for their visceral live shows. The band took a year hiatus while Roush studied audio engineering and O’Brien studied linguistics and Flamenco guitar in Madrid, during which time Choate moved away to study eco building.[1]\n",
      "In October 2006, upon O’Brien's return, the band brought in Joseph Mirasole, a drummer from a local high school drum line, via Craigslist.[2] During this period the band recorded their first studio EP, Touches.  Soon after, the band relocated to Austin where O’Brien and Roush enrolled in Master's programs at the University of Texas. They parted ways amicably with Badcock, with Jack taking over bass duties and Roush helping with vocals.[3]\n",
      "In 2008 they released the EP Love Like Montopolis, which showcased a more delicate, downtempo post-rock sound, and brought on local singer-songwriter A.J. Vincent on keys and vocals.[4]\n"
   ],
   "infobox": {
      "Origin": [
         "Austin, Texas, United States"
      ],
      "Genres": [
         "psychedelic rock",
         "dance-rock",
         "neo-psychedelia",
         "post-punk",
         "funk",
         "space-rock",
         "psychedelic pop"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Roll Call Records, Modern Outsider, Frenchkiss Records"
      ],
      "Associated acts": [
         "Israel Nash"
      ],
      "Website": [
         "thebrightlightsocialhour.com"
      ],
      "Members": [
         "Jackie O'Brien",
         "Curtis Roush",
         "Edward Braillif",
         "Zac Catanzaro"
      ],
      "Past members": [
         "Ryan O'Donoghue",
         "Thomas Choate",
         "A.J. Vincent",
         "Joseph Mirasole"
      ]
   }
}