{
   "Name": "The Bright Light Social Hour",
   "rawData": [
      "The Bright Light Social Hour is an American psychedelic rock band from Austin, Texas. The band is composed of Jackie O'Brien on bass and vocals, Curtis Roush on guitar and vocals, Edward \"Shreddward\" Braillif on synthesizers and guitar, and Zac Catanzaro on drums.\n",
      "In September 2004, Southwestern University students Curtis Roush (guitar), Thomas Choate (drums) and Jack O’Brien (vocals/keyboards), along with Ryan “Badcock” O’Donoghue (bass) began playing together as a post-hardcore art rock collective. They were often billed with area hardcore bands such as 25 Dollar Massacre, Thumbscrew and At All Cost and quickly grew a reputation for their visceral live shows. The band took a year hiatus while Roush studied audio engineering and O’Brien studied linguistics and Flamenco guitar in Madrid, during which time Choate moved away to study eco building.\n",
      "In October 2006, upon O’Brien's return, the band brought in Joseph Mirasole, a drummer from a local high school drum line, via Craigslist. During this period the band recorded their first studio EP, Touches.  Soon after, the band relocated to Austin where O’Brien and Roush enrolled in Master's programs at the University of Texas. They parted ways amicably with Badcock, with Jack taking over bass duties and Roush helping with vocals.\n"
   ],
   "infobox": {
      "Origin": [
         "Austin, Texas, United States"
      ],
      "Genres": [
         "psychedelic rock",
         "dance-rock",
         "neo-psychedelia",
         "post-punk",
         "funk",
         "space-rock",
         "psychedelic pop"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Roll Call Records, Modern Outsider, Frenchkiss Records"
      ],
      "Associated acts": [
         "Israel Nash"
      ],
      "Website": [
         "thebrightlightsocialhour.com"
      ],
      "Members": [
         "Jackie O'Brien",
         "Curtis Roush",
         "Edward Braillif",
         "Zac Catanzaro"
      ],
      "Past members": [
         "Ryan O'Donoghue",
         "Thomas Choate",
         "A.J. Vincent",
         "Joseph Mirasole"
      ]
   },
   "albums": [
      "The Bright Light Social Hour",
      "Space Is Still the Place",
      "Jude Vol. I",
      "Jude Vol. II"
   ]
}