{
   "Name": "Umphrey's McGee",
   "rawData": [
      "Umphrey's McGee is an American jam band originally from South Bend, Indiana. The band experiments with many musical styles, including rock, metal, funk, jazz, blues, reggae, electronic, bluegrass, and folk. They have toured regularly and released several albums.\n",
      "Formed by students at the University of Notre Dame in December 1997, members were guitarist/vocalist Brendan Bayliss, bassist Ryan Stasik, keyboardist Joel Cummins, and drummer Mike Mirro. Umphrey's McGee combined members of Tashi Station and Stomper Bob, two Notre Dame rock bands. Early concerts consisted of both originals and cover songs, including Guns N' Roses' \"Patience\" and Vince Guaraldi's Peanuts theme \"Linus and Lucy,\" as well as songs by Phish, moe., and Grateful Dead.\n",
      "According to Cummins, \"The origins  are of an actual person. Brendan Bayliss, our other lead singer and guitar player has a cousin ... and his name is actually Humphrey Magee but it's not possessive with the apostrophe s ...\"\n"
   ],
   "infobox": {
      "Origin": [
         "South Bend, Indiana / Chicago, Illinois, United States"
      ],
      "Genres": [
         "Rock, jam band, jazz fusion, funk rock, progressive rock, progressive metal"
      ],
      "Years active": [
         "1997–present"
      ],
      "Associated acts": [
         "String Cheese Incident, OHMphrey, Ali Baba's Tahini"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Brendan Bayliss",
         "Joel Cummins",
         "Ryan Stasik",
         "Andy Farag",
         "Jake Cinninger",
         "Kris Myers"
      ],
      "Past members": [
         "Mike Mirro"
      ]
   },
   "albums": [
      "Greatest Hits Vol. III",
      "Local Band Does OK",
      "Anchor Drops",
      "Safety In Numbers",
      "The Bottom Half",
      "Mantis",
      "Death By Stereo",
      "Similar Skin",
      "The London Session",
      "Zonkey",
      "It's Not Us",
      "It's You"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band originally from South Bend, Indiana. The band experiments with many musical styles, including rock, metal, funk, jazz, blues, reggae, electronic, bluegrass, and folk. They have toured regularly and released several albums.\n",
      "Formed by students at the University of Notre Dame in [MONTH] [YEAR], members were guitarist/vocalist [PERSON_NAME_FULL_0_MALE], bassist [PERSON_NAME_FULL_1_MALE], keyboardist Joel Cummins, and drummer [PERSON_NAME_FULL_3_MALE]. [BAND_NAME] combined members of Tashi Station and Stomper Bob, two Notre Dame rock bands. Early concerts consisted of both originals and cover songs, including Guns N' Roses' [SONG_NAME] as well as songs by Phish, moe., and Grateful Dead.\n",
      "According to Cummins, [SONG_NAME]\n"
   ]
}