{
   "Name": "Umphrey's McGee",
   "Sections": [
      "1 History",
      "1.1 Early years (1997-2000)",
      "1.2 Full line-up with Mike Mirro (2001-2002)",
      "1.3 Anchor Drops (2003-2005)",
      "1.4 Safety in Numbers (2006-08)",
      "1.5 Mantis (2009-10)",
      "1.6 Death by Stereo (2011-14)",
      "1.7 Hall of Fame Albums (2011-2018)",
      "1.8 Recent work",
      "2 Influences",
      "3 Members",
      "3.1 Timeline",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Live releases",
      "4.3 DVD releases",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Umphrey's McGee is an American jam band originally from South Bend, Indiana. The band experiments with many musical styles, including rock, metal, funk, jazz, blues, reggae, electronic, bluegrass, and folk. They have toured regularly and released several albums.\n"
      ]
   },
   "History": {
      "Early years (1997-2000)": {
         "text": [
            "Formed by students at the University of Notre Dame in December 1997, members were guitarist/vocalist Brendan Bayliss, bassist Ryan Stasik, keyboardist Joel Cummins, and drummer Mike Mirro. Umphrey's McGee combined members of Tashi Station and Stomper Bob, two Notre Dame rock bands.[1] Early concerts consisted of both originals and cover songs, including Guns N' Roses' \"Patience\" and Vince Guaraldi's Peanuts theme \"Linus and Lucy,\" as well as songs by Phish, moe., and Grateful Dead.\n",
            "According to Cummins, \"The origins [of the name] are of an actual person. Brendan Bayliss, our other lead singer and guitar player has a cousin ... and his name is actually Humphrey Magee but it's not possessive with the apostrophe s ...\"[2]\n",
            "In mid-1998, after 8 months together, the band released their debut album, Greatest Hits Vol. III.  Having a released studio disc allowed them to more readily book live performances.  Though long out of print, the album contains songs that remain staples of Umphrey's live sets, such as \"Divisions\", \"Phil's Farm\", \"FF\", and \"All in Time\".\n",
            "Shortly after the release of the album, the band added a fifth member, percussionist Andy Farag. Farag's father became the band's agent. A second pressing of Greatest Hits Vol. III featured Farag in the album's inner sleeve and credits. By the end of the year, Umphrey's McGee, along with peers Ali Baba's Tahini, were one of the most popular bands in the South Bend/Notre Dame area.[citation needed] They began performing outside the area at colleges and house parties, allowing listeners to tape and trade their music freely. In 1998, the band released their first live album, Songs for Older Women.\n",
            "Guitarist Jake Cinninger was added to the band in September 2000. Cinninger deepened the Umphrey's sound, and also contributed a large repertoire of original music, much of which comprised the bulk of the catalog from his previous band, Ali Baba's Tahini. The band also adopted several songs written by Karl Engelmann, Ali Baba's Tahini frontman. (He now fronts Asheville, North Carolina-based rock band Mother Vinegar). Shortly after Cinninger's arrival, the band released another live album, One Fat Sucka, which contained live performances recorded in the summer and fall of 2000.\n"
         ]
      },
      "Full line-up with Mike Mirro (2001-2002)": {
         "text": [
            "In 2001, the band began practicing intense improvisational exercises. One of their first productive sessions took place in the \"Jimmy Stewart Ballroom\" of a hotel, prompting the band to call their onstage improvisational excursions \"Jimmy Stewarts\". This form of improvisation differs in approach from the methods used by many of their jam band peers.[3]\n",
            "Jake Cinninger and Joel Cummins released solo albums in 2001 and 2002, respectively.  At least two songs from each of those albums are part of Umphrey's concert repertoire.[citation needed]\n",
            "In June 2002 the band released its first proper recording, Local Band Does OK. That summer, they played at the first annual Bonnaroo Music Festival in rural Manchester, Tennessee, among over 30 bands performing in front of nearly 100,000 people. Other artists included Widespread Panic, Trey Anastasio, and Norah Jones.\"Bonnaroo 2002\".\n",
            "The band almost broke up in late 2002 when drummer Mike Mirro announced he was leaving the band to attend medical school.[citation needed]  After hundreds of audition tapes were reviewed by the percussionist Andy Farag, the band settled on the first one they had received, which was from Kick the Cat drummer Kris Myers.[citation needed]\n"
         ]
      },
      "Anchor Drops (2003-2005)": {
         "text": [
            "2003 was a year of change for UM. New drummer Kris Myers had to learn their extensive repertoire of originals and covers. The band continued their grueling tour schedule, logging over 150 shows for the year. The band began experimenting with a new \"Lego\" style of songwriting, which involved piecing together original sections and lifted pieces of \"Jimmy Stewart\" improvisations to create new songs, such as \"Ocean Billy\", \"#5\", and \"Wife Soup\". That summer, UM entered the recording studio in Chicago for their first studio album with Myers. In the Fall, the UM Live program was started by \"Sound Caresser\" Kevin Browning. Each night's show would be offered on CD, for sale directly after the show. This soon translated into a partnership with Disc Logic for online distribution, and a few years later all of the band's shows would be moved to UMLive.net. In November, the band released their first DVD, Live from the Lake Coast, and later that month their first official release featuring Kris Myers, Local Band Does Oklahoma (Recorded on April 23 in Oklahoma City).[citation needed]\n",
            "In 2004, the band released Anchor Drops, recorded in several different studios throughout the Chicago area. Shortly before the release of the album, the band scored a distribution deal for both Anchor Drops and Local Band Does OK, and for the first time, Umphrey's McGee music was available in stores all over the country.  The album was said to be the \"sound of a band reaching maturity\".[4][specify] Once again, Umphrey's headed to Bonnaroo, playing a coveted late-night spot. The band performed to over 20,000 people, many of whom had never heard the band before. In July, the band was declared by Rolling Stone to \"have become odds-on favorites in the next-Phish sweepstakes.\"[5]\n",
            "Starting in 2005, the band began producing Umphrey's McGee Podcasts, an effort to provide fans with highlights of recent shows.  Each podcast is around 75 minutes in length and is released about twice a month, and it has 20,000 listeners. \"In the Kitchen\" won the Jammy Award for Song of the Year. That evening, the band performed with Huey Lewis for the first time (they were also joined by Mavis Staples, Sinead O'Connor, and Jeff Coffin). That summer, the band participated in the Big Summer Classic tour, which was the first time UM played Red Rocks.[citation needed]\n"
         ]
      },
      "Safety in Numbers (2006-08)": {
         "text": [
            "On April 4, 2006, Umphrey's released their fourth studio effort, Safety In Numbers. They appeared on Jimmy Kimmel Live! alongside Huey Lewis in support of the new album on May 18, 2006.  The band was featured at many of the major U.S. festivals throughout the summer, playing 129 shows before a three-night stand in Chicago for New Year's Eve. The Bottom Half, a 2-disc album compiled from the Safety in Numbers sessions, was released a year later on April 3, 2007.  Near the end of 2006, Umphrey's began a program to provide complimentary tickets to audience tapers in exchange for their  distributing the recordings digitally online.\n",
            "A live double-album titled Live at the Murat was released on October 16, 2007.  The album was recorded over 2 nights at the Egyptian Room in the Murat Centre in Indianapolis, Indiana on April 6–7, 2007.  It received a 4-star review from Rolling Stone. The album also won a Jammy for best live album.[6]\n",
            "The band's 2008 Halloween show was the first to feature a mash-up theme. Riffing on the idea of mash-ups popularized by DJs, they arrange new composition from 2-3 songs (a mix of covers and originals). This tradition has continued on Halloween every year since.\n"
         ]
      },
      "Mantis (2009-10)": {
         "text": [
            "The album Mantis was released on January 20, 2009. The release concentrated more on the progressive style that was associated with Anchor Drops. Unlike previous albums, most of the songs went unplayed until the album was released. Later in the year, Jefferson Waful took over duties as lighting director.\n",
            "In 2010, the band debuted UMBowl, an interactive concert in 4 sets (or quarters), each with a different theme. Ticket purchasers are sent ballots to vote for the selections for two quarters, while the other two quarters are based upon interactive text submissions/votes. October 3 saw the debut of the Stew Art (S2) events. Each S2 event, limited to 50 fans, was an hour-long event that had the band improvising based upon text submissions from the audience. The S2 has since become a regular feature for UMBowl.[citation needed]\n"
         ]
      },
      "Death by Stereo (2011-14)": {
         "text": [
            "The band's seventh studio album Death By Stereo, was released September 13, 2011.  The album features a mix of new songs as well as old songs that the band has used in their live rotation for years, such as \"Hajimemashite\" and \"The Floor\". With the album's pre-order came a set of packages for super fans, including fishing trips and bar crawls with the band. The Bill Graham For A Day option for a private show became a reality, and has since inspired several follow-up events.[citation needed]\n",
            "In 2013, the band debuted \"Headphones and Snowcones\", a program available at their concerts which provides a soundboard feed delivered to a set of headphones via wireless receiver.\n",
            "Original drummer Mike Mirro died on January 30, 2014, at age 36.[7]\n",
            "Cummins said about his contributions, \n",
            "Musically, I think he was the backbone of us playing mixed meter and polyrhythm. We had a lot of fun writing sections of music together and trying to do things a little different from what was being produced then. ... When I met him, he was an incredibly accomplished drummer, but when we worked together, we talked a lot about musical theory and composition.[1]"
         ]
      },
      "Hall of Fame Albums (2011-2018)": {
         "text": [
            "Starting in 2011, Umphrey's Mcgee yearly releases an album entitled Hall of Fame, which includes the fan-voted best songs from live shows of the previous year.\n"
         ]
      },
      "Recent work": {
         "text": [
            "On June 10, 2014, UM released their eighth studio album, Similar Skin, their first album released on their new music label Nothing Too Fancy Music.\n",
            "On April 7, 2015, UM released their ninth studio album, The London Session, an album recorded in one day at Abbey Road Studios.[8] He LP includes some rerecorded versions of previously released Umphrey's McGee songs as well as other selections. [9]\n",
            "On November 11, 2016, UM released their tenth studio album ZONKEY, an experimental album consisting entirely of mashups from artists such as Beastie Boys, Beck, ZZ Top, Radiohead, AC/DC, Gorillaz, Nirvana, MGMT, and Ted Nugent, among others. Some of the mashups have been performed live by the band for years while some are entirely new compositions for this record.\n",
            "On December 29–31, 2016, UM returned to Chicago for a 3-show New Year's Eve run, their first such run in Chicago for the holiday since performing in the city for New Year's Eve each year from 2000-2010. The shows took place at the Riviera Theatre and Aragon Ballroom.\n",
            "On January 12, 2018, UM released their eleventh studio album, It's Not Us.[10]\n",
            "On May 18, 2018, UM released their twelfth studio album, It's You.\n"
         ]
      }
   },
   "Influences": {
      "text": [
         "The band identifies The Police, The Beatles, and Led Zeppelin as primary influences.[11]\n"
      ]
   },
   "Members": {
      "Timeline": {},
      "text": [
         "\n",
         "\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Live releases": {},
      "DVD releases": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Umphrey's McGee is an American jam band originally from South Bend, Indiana. The band experiments with many musical styles, including rock, metal, funk, jazz, blues, reggae, electronic, bluegrass, and folk. They have toured regularly and released several albums.\n",
      "Formed by students at the University of Notre Dame in December 1997, members were guitarist/vocalist Brendan Bayliss, bassist Ryan Stasik, keyboardist Joel Cummins, and drummer Mike Mirro. Umphrey's McGee combined members of Tashi Station and Stomper Bob, two Notre Dame rock bands.[1] Early concerts consisted of both originals and cover songs, including Guns N' Roses' \"Patience\" and Vince Guaraldi's Peanuts theme \"Linus and Lucy,\" as well as songs by Phish, moe., and Grateful Dead.\n",
      "According to Cummins, \"The origins [of the name] are of an actual person. Brendan Bayliss, our other lead singer and guitar player has a cousin ... and his name is actually Humphrey Magee but it's not possessive with the apostrophe s ...\"[2]\n",
      "In mid-1998, after 8 months together, the band released their debut album, Greatest Hits Vol. III.  Having a released studio disc allowed them to more readily book live performances.  Though long out of print, the album contains songs that remain staples of Umphrey's live sets, such as \"Divisions\", \"Phil's Farm\", \"FF\", and \"All in Time\".\n"
   ],
   "infobox": {
      "Origin": [
         "South Bend, Indiana / Chicago, Illinois, United States"
      ],
      "Genres": [
         "Rock, jam band, jazz fusion, funk rock, progressive rock, progressive metal"
      ],
      "Years active": [
         "1997–present"
      ],
      "Associated acts": [
         "String Cheese Incident, OHMphrey, Ali Baba's Tahini"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Brendan Bayliss",
         "Joel Cummins",
         "Ryan Stasik",
         "Andy Farag",
         "Jake Cinninger",
         "Kris Myers"
      ],
      "Past members": [
         "Mike Mirro"
      ]
   }
}