{
   "Name": "Vampire Weekend",
   "rawData": [
      "Vampire Weekend is an American rock band from New York City, formed in 2006 and currently signed to Columbia Records. The band was formed by lead vocalist and guitarist Ezra Koenig, multi-instrumentalist Rostam Batmanglij, drummer Chris Tomson, and bassist Chris Baio. The band's eponymous first album Vampire Weekend (2008)—which included the singles \"Mansard Roof\", \"A-Punk\", \"Oxford Comma\", \"Cape Cod Kwassa Kwassa\", and \"The Kids Don't Stand a Chance\"—was acclaimed by critics for its world music influences. Their following album, Contra (2010), was similarly acclaimed and garnered strong commercial success. Their third studio album, Modern Vampires of the City (2013), won the group the Grammy Award for Best Alternative Music Album. Batmanglij departed the group in early 2016. The band's fourth album, Father of the Bride, was released in 2019, and earned them a second Grammy win for Best Alternative Music Album. The album was also nominated for the Grammy Award for Album of the Year.\n",
      "The band members met while enrolled at Columbia University, beginning with a rap collaboration between Koenig and Tomson named \"L'Homme Run\". They bonded over a shared love of punk rock and African music. Koenig toured with The Dirty Projectors during a period of experimentation with African music, inspiring the band to incorporate world sounds into their earliest work. The band chose the name \"Vampire Weekend\" from the title of a short film project Koenig worked on during the summer between freshman and sophomore years in college. While home for the summer, Koenig watched the 1987 vampire film The Lost Boys and was inspired to make a Northeastern version of the film in which a man named Walcott travels to Cape Cod to warn the mayor that vampires are attacking the United States. Koenig abandoned the project after two days. The band began playing shows around Columbia University, starting with a battle of the bands at Lerner Hall in 2006. After graduating from college, the band self-produced their debut album while simultaneously working full-time jobs, Tomson as a music archivist and Koenig as a middle school English teacher.\n",
      "In 2007, Vampire Weekend's song \"Cape Cod Kwassa Kwassa\" was ranked 67th on Rolling Stone's list of the \"100 Best Songs of the Year\". In November 2007, they toured the UK with The Shins.\nThe then-nascent influence of blog hype and internet buzz played a role in their success and led to a large prerelease following sufficient to support them performing on three tours before their debut album was released. They were declared \"The Year's Best New Band\" by Spin magazine in the March 2008 issue, and were the first band to be shot for the cover of the magazine before releasing their debut album. The band made a television appearance on The Late Show with David Letterman on February 1, 2008, and on March 8, 2008, performed on Saturday Night Live. Four songs from the band's first album also made the Triple J Hottest 100, 2008. The internet hype had its backlash, however, as critics reacted against a perceived image of Vampire Weekend as privileged, upper-class Ivy League graduates stealing from foreign musicians. One critic went so far as to call Vampire Weekend the \"whitest band in the world,\" to which they took exception, given their Ukrainian, Persian, Italian, and Hungarian heritages. Koenig responded in a November 2009 interview by saying, \"Nobody in our band is a WASP.\" Furthermore, the backlash involving their social backgrounds was largely unfounded, as Koenig explained in the interview that the band members got into Columbia on scholarship and used student loans; he himself was still paying off student loans in 2009.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, U.S."
      ],
      "Genres": [
         "Indie rock[1]",
         "indie pop[2]",
         "art pop[3]",
         "baroque pop[4]",
         "worldbeat[5]",
         "alternative rock[6]"
      ],
      "Years active": [
         "2006–present"
      ],
      "Labels": [
         "XL",
         "Columbia"
      ],
      "Associated acts": [
         "Dirty Projectors",
         "Discovery",
         "Haim",
         "Steve Lacy",
         "Richard Pictures",
         "Rostam",
         "Baio",
         "Dams of the West",
         "L'Homme Run",
         "Brian Robert Jones"
      ],
      "Website": [
         "vampireweekend.com"
      ],
      "Members": [
         "Ezra Koenig",
         "Chris Baio",
         "Chris Tomson"
      ],
      "Past members": [
         "Rostam Batmanglij"
      ]
   }
}