{
   "Name": "War (American band)",
   "rawData": [
      "War (originally called Eric Burdon and War) is an American funk and soul band from Long Beach, California, known for several hit songs (including \"Spill the Wine\", \"The World Is a Ghetto\", \"The Cisco Kid\", \"Why Can't We Be Friends?\", \"Low Rider\", and \"Summer\").\nFormed in 1969, War is a musical crossover band that fuses elements of rock, funk, jazz, Latin, rhythm and blues, and reggae. According to music writer Colin Larkin, their \"potent fusion of funk, R&B, rock and Latin styles produced a progressive soul sound\", while Martin C. Strong calls them \"one of the fiercest progressive soul combos of the '70s\". Their album The World Is a Ghetto was Billboard's best-selling album of 1973.  The band transcended racial and cultural barriers with a multi-ethnic line-up.  War was subject to many line-up changes over the course of its existence, leaving member Leroy \"Lonnie\" Jordan as the only original member in the current line-up; four other members created a new group called the Lowrider Band.\n",
      "In 1962, Howard E. Scott and Harold Brown formed a group called The Creators in Long Beach, California. Within a few years, they had added Charles Miller, Morris \"B. B.\" Dickerson and Lonnie Jordan to the lineup. Lee Oskar and Papa Dee Allen later joined as well. They all shared a love of diverse styles of music, which they had absorbed living in the racially mixed Los Angeles ghettos. The Creators recorded several singles on Dore Records while working with Tjay Contrelli, a saxophonist from the band Love. In 1968, the Creators became Nightshift (named because Brown worked nights at a steel yard) and started performing with Deacon Jones, a football player and singer.\n",
      "The original War was conceived by record producer Jerry Goldstein (\"My Boyfriend's Back\", \"Hang on Sloopy\", \"I Want Candy\") and singer Eric Burdon (ex-lead singer of the British band the Animals). In 1969, Goldstein saw musicians who would eventually become War playing at the Rag Doll in North Hollywood, backing Deacon Jones, and he was attracted to the band's sound. Jordan claimed that the band's goal was to spread a message of brotherhood and harmony, using instruments and voices to speak out against racism, hunger, gangs, crimes, and turf wars, and promote hope and the spirit of brotherhood. Eric Burdon and War began playing live shows to audiences throughout Southern California before entering into the studio to record their debut album Eric Burdon Declares \"War\". The album's best known track, \"Spill the Wine\", was a hit and launched the band's career.\n"
   ],
   "infobox": {
      "Also known as": [
         "Eric Burdon and War (1969–1970, 1976)"
      ],
      "Origin": [
         "Long Beach, California, U.S."
      ],
      "Genres": [
         "Funk[1]",
         "soul[2]",
         "progressive soul[3]",
         "black rock[4]",
         "jazz-rock[5]"
      ],
      "Years active": [
         "1969–present"
      ],
      "Labels": [
         "MGM",
         "United Artists",
         "MCA",
         "Avenue"
      ],
      "Associated acts": [
         "Eric Burdon",
         "War Band",
         "The Animals",
         "Señor Soul",
         "Lowrider Band"
      ],
      "Members": [
         "Leroy \"Lonnie\" Jordan",
         "Stuart Ziff",
         "Scott Martin",
         "Stanley Behrens",
         "Sal Rodriguez",
         "David \"Pug\" Rodriguez",
         "Marcos Reyes",
         "Trevor Huxley"
      ],
      "Past members": [
         "Eric Burdon\n",
         "Harold Ray Brown\n",
         "Howard E. Scott\n",
         "Lee Oskar\n",
         "B.B. Dickerson\n  ",
         "Thomas \"Papa Dee\" Allen\n  ",
         "Charles Miller\n",
         "Ron Hammon\n  ",
         "Pat Rizzo\n",
         "Luther Rabb\n",
         "Alice Tweed Smith\n  ",
         "Ricky Green\n  ",
         "Tetsuya \"Tex\" Nakamura\n  ",
         "Rae Valentine\n",
         "Kerry Campbell\n  ",
         "Charles Green\n  ",
         "J.B. Eckl\n",
         "Lance Ellis\n  ",
         "Smoky Greenwell\n  ",
         "Sandro Alberto\n  ",
         "Richard Marquez\n  ",
         "Kenny Hudson\n  ",
         "Fernando Harkless\n  ",
         "James Zota Baker\n  ",
         "Pancho Tomaselli\n  ",
         "Mitch Kashmar\n  ",
         "David Urquidi\n  "
      ]
   },
   "albums": []
}