{
   "Name": "The Waybacks",
   "rawData": [
      "The Waybacks are an American four-piece band based in the San Francisco Bay area of California. Their style has been alternately described as Americana, Progressive bluegrass, rock-n-roll, folk, and acoustic mayhem.  They described themselves as a \"power trio with a fiddler\" in an interview with NPR.\n",
      "The group's most notable performances to date have included sets at large festivals such as MerleFest in Wilkesboro, North Carolina, the Riverbend Festival in Chattanooga, Tennessee,  and Hardly Strictly Bluegrass Festival in San Francisco's Golden Gate Park. They have also headlined the Great American Music Hall and Yoshi's in their home city of San Francisco. They have a tradition of covering entire classic rock albums such as Led Zeppelin's II, the Rolling Stones' Sticky Fingers, and the Beatles' Abbey Road at the Hillside Album Hour at Merlefest. They have performed with a wide array of artists, including Bob Weir, Emmylou Harris, Elvis Costello, Joan Osborne, Susan Tedeschi, Sam Bush, John Cowan, Gillian Welch, and David Rawlings.\n",
      "The band's second album, Burger After Church, was described by David Royko of the Chicago Tribune as the \"near-ideal balance of irreverence, chops, discipline, and originality\".  The band began recording for Compass Records in 2006, releasing \"From The Pasture To The Future,\" produced by Lloyd Maines.  Their 2008 Compass release Loaded, produced by Byron House, made it to number 4 on Billboard's Top Bluegrass Albums list, and featured a guest appearance by Sam Bush on mandolin.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco Bay Area"
      ],
      "Genres": [
         "Progressive bluegrass,  rock"
      ],
      "Years active": [
         "1998-present"
      ],
      "Labels": [
         "Compass Records, Fiddling Cricket"
      ],
      "Website": [
         "www.waybacks.com"
      ],
      "Members": [
         "James Nash",
         "Warren Hood",
         "Joe Kyle Jr.",
         "Chuck Hamilton"
      ],
      "Past members": [
         "Wayne \"Chojo\" Jacques",
         "Stevie Coyle",
         "Glenn Houston",
         "Chris Kee",
         "Peter Tucker"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band based in the San Francisco Bay area of California. Their style has been alternately described as Americana, Progressive bluegrass, rock-n-roll, folk, and acoustic mayhem.  They described themselves as a \"power trio with a fiddler\" in an interview with NPR.\n",
      "The group's most notable performances to date have included sets at large festivals such as MerleFest in Wilkesboro, North Carolina, the Riverbend Festival in Chattanooga, Tennessee,  and Hardly Strictly Bluegrass Festival in San Francisco's Golden Gate Park. They have also headlined the Great American Music Hall and Yoshi's in their home city of San Francisco. They have a tradition of covering entire classic rock albums such as Led Zeppelin's II, the Rolling Stones' Sticky Fingers, and the Beatles' [PERSON_NAME_FULL_2_FEMALE] at the Hillside Album Hour at Merlefest. They have performed with a wide array of artists, including Bob Weir, Emmylou Harris, Elvis Costello, [PERSON_NAME_FULL_0_FEMALE], [PERSON_NAME_FULL_1_FEMALE], Sam Bush, [PERSON_NAME_FULL_4_MALE], Gillian Welch, and [PERSON_NAME_FULL_3_MALE].\n",
      "The band's second album, Burger After Church, was described by David Royko of the Chicago Tribune as the \"near-ideal balance of irreverence, chops, discipline, and originality\".  The band began recording for Compass Records in [YEAR], releasing \"From The Pasture To The Future,\" produced by [PERSON_NAME_FULL_0_MALE].  Their [YEAR] Compass release Loaded, produced by Byron House, made it to number 4 on Billboard's Top Bluegrass Albums list, and featured a guest appearance by [PERSON_NAME_FULL_1_MALE] on mandolin.\n"
   ]
}