{
   "Discography": {
      "B-sides": {},
      "EP albums": {},
      "Full-length albums": {
         "text": [
            "\n"
         ]
      },
      "Singles": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Two founding members of ZOX met while students at Brown University, soon after rapidly growing their fanbase through traditional grassroots methods and energetic live shows. Their debut album, Take Me Home, was released in 2003, launching the band on a 300-show-a-year tour schedule, split between the U.S. and Europe.  According to the band's tour page, they have opened for or toured with bands such including The Black Eyed Peas,[1] O.A.R.[2] and Rusted Root.[3]\n",
         "In 2005, ZOX released a second album titled The Wait, which was listed on the Billboard Magazine Internet Album Charts in 7th position between The Black Eyed Peas and Coldplay.  The Wait, in addition to selling 2,700 albums nationwide in its debut week, was also the top selling album in Rhode Island.  The single \"Can't Look Down\" was featured on the 2006 Bionicle Free the Band website, along with songs from the Undertones, Damone, Over It, and others; it also appeared on MTV's The Real World: Key West, \"Road Rules\", and in the ski films Snow Gods and Michael Moore's \"Slacker Uprising\".[4]  \"The Wait\" charted at No. 38 on CMJ charts with 153 Stations adding the disc (Spring 2008).\n",
         "In 2006, ZOX were featured at the South by Southwest festival in Austin.  The band signed with SideOneDummy Records (The Mighty Mighty Bosstones, Gogol Bordello, Flogging Molly) in 2006, Foundations Artist Management (Dr. Dog, Dispatch), and CAA Booking Agency (AC/DC, John Mayer, etc.) and ZOX re-released The Wait with their new label on June 6 in Canada and the United States.  During the summer of 2006, ZOX toured on the Warped Tour and with Rusted Root, followed by an extensive European tour, which included playing at the Reading and Leeds Festivals.  Other festivals performed at include Germany's Rock am Ring and Rock im Park Festivals, Italy's Rock the Week, NovaRock Austria, and Switzerland's Greenfield Festival.\n",
         "ZOX's third album, Line in the Sand was released in January 2008, receiving favorable reviews from many underground rating sites.[5][6][7]  The single \"Goodnight\" continues to receive national radio play.  \"Line in the Sand\" was produced by John Goodmanson, whose credits include Death Cab for Cutie, Sleater Kinney, Blood Brothers and Harvey Danger.\n",
         "On August 13, 2011, ZOX headlined a 10-year reunion concert at Lupo's Heartbreak Hotel in their hometown of Providence, Rhode Island.  Another reunion concert took place on October 11, 2014, also at Lupo's.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Full-length albums",
      "2.2 EP albums",
      "2.3 Singles",
      "2.4 B-sides",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "ZOX is a rock band from Providence, Rhode Island. The band consists of four members: namesake John Zox (drums), Eli Miller (guitar, vocals), Spencer Swain (violin, vocals), and Dan Edinberg (bass, vocals).\n"
      ]
   },
   "Title": "ZOX - Wikipedia"
}