{
   "Name": "Diaspora Yeshiva Band",
   "Sections": [
      "1 Background",
      "2 History",
      "2.1 Reunions",
      "2.2 Avraham Rosenblum & Diaspora",
      "3 Music style",
      "4 Influence",
      "5 Personnel",
      "6 Discography",
      "6.1 Diaspora Yeshiva Band",
      "6.2 Avraham Rosenblum & Diaspora",
      "7 References",
      "7.1 Notes",
      "7.2 Sources",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Diaspora Yeshiva Band (Hebrew: להקת ישיבת התפוצות‎) was an Israeli Orthodox Jewish rock band founded at the Diaspora Yeshiva on Mount Zion, Jerusalem, by baal teshuva students from the United States. In existence from 1975 to 1983, the band infused rock and bluegrass music with Jewish lyrics, creating a style of music it called \"Hasidic rock\"[1] or \"Country and Eastern\".[2][3] The band was very popular on college campuses in the early to mid-1980s, and was well known in Jerusalem for its Saturday-night concerts at David's Tomb. It had a considerable influence on contemporary Jewish religious music, inspiring later bands such as Blue Fringe, 8th Day, Reva L'Sheva, Soulfarm, the Moshav Band, and Shlock Rock. Fifteen years after it disbanded, band leader Avraham Rosenblum revived the band under the name Avraham Rosenblum & Diaspora and produced several more albums.\n"
      ]
   },
   "Background": {
      "text": [
         "The Diaspora Yeshiva (ישיבת התפוצות) was founded in 1967 by Rabbi Mordechai Goldstein,[4] an alumnus of the Chofetz Chaim Yeshiva in Queens, New York, and a colleague of Rabbi Shlomo Carlebach.[5]  It is the only Jewish institution located on Mount Zion. The yeshiva offers programs ranging from basic Judaism to advanced Talmud – employing a methodology based on Ramchal – and emphasizes mussar (character development). It was originally named \"Toras Yisrael\", and its formal yeshiva program continues under that name.\nMachon Roni,[6] a women's Torah seminary, operates in parallel.\n",
         "Diaspora Yeshiva was the first outreach yeshiva for baalei teshuva.[5][7] Unlike traditional rabbinic academies, the yeshiva reached out to young Jewish men who had never been exposed to traditional Torah or Talmud study. It offered introductory and intermediate courses together with acclimation to an Orthodox Jewish lifestyle.[5] To appeal to students who identified with the hippie subculture prevalent on American college campuses in those years, the yeshiva adopted a neo-Hasidic approach. Students were encouraged to keep their long hair and their musical instruments.[8]\n",
         "Numerous students were professional or semi-professional musicians, and several musical collaborations were spawned in the yeshiva dorms.[9] In 1975 student Avraham Rosenblum, a rock guitarist who had started his own band in New York in 1970, founded the Diaspora Yeshiva Band.[9][10] The band became an outreach tool for other hippie students and, later, post-hippie seekers, using Jewish music to draw them into the milieu of Torah study.[8][9]\n"
      ]
   },
   "History": {
      "Reunions": {
         "text": [
            "In December 1992 the band reconvened for a month-long[22] reunion tour beginning with a performance at Carnegie Hall.[13][23] It reunited again in 1996 with a show at The Town Hall in New York City.[19]\n",
            "In 2014, Rosenblum, Simcha Abramson, Gedaliah Goldstein, Ruby Harris, and Menachem Herman performed at the HASC 27 concert at Lincoln Center.[9][24] That same year, the group held another reunion concert at Congregation Shomrei Emunah in Baltimore, where Rosenblum is a member.[14]\n"
         ]
      },
      "Avraham Rosenblum & Diaspora": {},
      "text": [
         "The Diaspora Yeshiva Band staged its first concert at the Beit Ha'Am hall in the Nachlaot neighborhood of Jerusalem during Hanukkah 1975.[9] After that, the band became well known for its weekly Saturday-night concerts held in a room adjacent to David's Tomb (located in the same courtyard as the yeshiva) on Mount Zion.[9][11][12] These concerts attracted secular American, British, and French youth; yeshiva and seminary students; and Israeli soldiers.[9] Band members continued to perform with the group even after they had married and begun studying in kollel.[9]\n",
         "The band released its first album in 1976.[10][13] In 1977 it was invited to compete in the Hasidic Song Festival, an Israeli competition that ran from 1969 to 1984 and that was broadcast on national television.[9] Diaspora was the first yeshiva band to perform at the largely secular music event, and won first prize for its song \"Hu Yiftach Libeinu\" (He will open our hearts).[9] Interviews in the general media followed, increasing name recognition and visitors to the Saturday-night concerts.[9] The band was invited back for the 1978 Hasidic Song Festival, and won first prize for its song \"Malchutcha\" (Your sovereignty).[9]\n",
         "The band embarked on its first North American concert tour in 1979, visiting 26 cities.[9] It went on to tour the U.S., Canada, Europe, and South Africa on five additional tours.[13][14] The band was highly popular on college campuses in the early to mid-1980s.[10][15]\n",
         "In the 1980s, Lynyrd Skynyrd drummer Artimus Pyle came to study in the Diaspora Yeshiva for several years.[16] He played with the band and bequeathed his drum set to the yeshiva.[16][17] In 1987 the Diaspora Yeshiva Band performed and was interviewed on MTV's Musical Passport series, Rock Israel, as part of the coverage of the visit of Tom Petty and the Heartbreakers to Israel and Egypt.[18][19] Band leader Avraham Rosenblum was filmed accompanying Tom Petty, Benmont Tench, and Roger McGuinn at the Western Wall.[20]\n",
         "The Diaspora Yeshiva Band released a total of six albums.[9][21] It disbanded in 1983[2][21] as its members began pursuing both solo careers and careers in Torah learning and outreach.[9]\n"
      ]
   },
   "Music style": {
      "text": [
         "Shelley Lang, promoter[21]\n",
         "The band members viewed their music as a means of expressing their newfound connection to God, the Jewish people, and the Land of Israel in a medium that they were familiar with.[2][28] Their arrangements reflected the musical trends of secular American culture in the late 1960s and early 1970s.[9] The band's repertoire included rock, soft rock, acid rock, country, bluegrass, blues, folk, jazz, klezmer, and Yiddish ballads.[13][15][29][30][31] Strom describes their music as blending \"a San Francisco rock 'n' roll sound with Israeli, Middle Eastern, and Hasidic music\".[10]\n",
         "Instrumentation included electric guitar, rhythm guitar, bass guitar, saxophone, fiddle, banjo, and drums.[9][21] The band was noted for its guitar harmonies[14] and \"virtuoso\" instrument playing.[14][32]\n",
         "The lyrics, in contrast, expressed Jewish values. Lyrics were both original and drawn from the Torah and Book of Psalms.[13][21] The band sang in Hebrew, Yiddish, and English.[1] Their on-stage presence also belied the traditional rock band image: they sported full beards, payot, and tzitzit,[31] and dressed in the dark-colored attire typical of yeshiva students.[2][9]\n"
      ]
   },
   "Influence": {
      "text": [
         "The Diaspora Yeshiva Band was considered an influential group in the history of contemporary Jewish religious music.[32] Bands that name them as an inspiration include Blue Fringe,[33] 8th Day,[34] and Shlock Rock.[35][36] Besides Rosenblum, other original band members who pursued solo careers include Ruby Harris, founder of the Ruby Harris Electric Violin Blues Band in Chicago,[37] Adam Wexler, co-founder of Reva L'Sheva,[38] and Rabbi Moshe Shur, founder of the Moshe Shur Band and Moshe Shur and Sons.[39] Sons of original band member Ben Zion Solomon include Noah Solomon of Soulfarm, Yehuda Solomon of Moshav Band, and Nachman Solomon of Hamakor.[3][40][41]\n"
      ]
   },
   "Personnel": {
      "text": [
         "The six founding members of the Diaspora Yeshiva Band were:[9][17]\n",
         "Student-musicians who played with the band at different times between 1973 and 1986 include: Beryl and Ted Glaser, Shimon Green, Isser Blum, Amram Hakohen, Menachem Herman, Yochanan Lederman, Tzvi Miller, Yosil Rosenzweig, Chaim-Dovid Saracik, and Rabbi Moshe Shur.[17]\n"
      ]
   },
   "Discography": {
      "Diaspora Yeshiva Band": {},
      "Avraham Rosenblum & Diaspora": {
         "text": [
            "In 1998 band leader Avraham Rosenblum and his son, drummer Moe Rosenblum, revived the band under the name Avraham Rosenblum & Diaspora and produced the album Jerusalem is Calling.[23][25][26] The pair went on to produce The Diaspora Collection (2000), a digitally-remastered double-CD of Diaspora Yeshiva Band hits, and Kedem (2003), an album featuring solo material by Avraham Rosenblum.[23][25][27]\n"
         ]
      }
   },
   "References": {
      "Notes": {},
      "Sources": {}
   },
   "External links": {},
   "coreData": [
      "Diaspora Yeshiva Band (Hebrew: להקת ישיבת התפוצות‎) was an Israeli Orthodox Jewish rock band founded at the Diaspora Yeshiva on Mount Zion, Jerusalem, by baal teshuva students from the United States. In existence from 1975 to 1983, the band infused rock and bluegrass music with Jewish lyrics, creating a style of music it called \"Hasidic rock\"[1] or \"Country and Eastern\".[2][3] The band was very popular on college campuses in the early to mid-1980s, and was well known in Jerusalem for its Saturday-night concerts at David's Tomb. It had a considerable influence on contemporary Jewish religious music, inspiring later bands such as Blue Fringe, 8th Day, Reva L'Sheva, Soulfarm, the Moshav Band, and Shlock Rock. Fifteen years after it disbanded, band leader Avraham Rosenblum revived the band under the name Avraham Rosenblum & Diaspora and produced several more albums.\n",
      "The Diaspora Yeshiva (ישיבת התפוצות) was founded in 1967 by Rabbi Mordechai Goldstein,[4] an alumnus of the Chofetz Chaim Yeshiva in Queens, New York, and a colleague of Rabbi Shlomo Carlebach.[5]  It is the only Jewish institution located on Mount Zion. The yeshiva offers programs ranging from basic Judaism to advanced Talmud – employing a methodology based on Ramchal – and emphasizes mussar (character development). It was originally named \"Toras Yisrael\", and its formal yeshiva program continues under that name.\nMachon Roni,[6] a women's Torah seminary, operates in parallel.\n",
      "Diaspora Yeshiva was the first outreach yeshiva for baalei teshuva.[5][7] Unlike traditional rabbinic academies, the yeshiva reached out to young Jewish men who had never been exposed to traditional Torah or Talmud study. It offered introductory and intermediate courses together with acclimation to an Orthodox Jewish lifestyle.[5] To appeal to students who identified with the hippie subculture prevalent on American college campuses in those years, the yeshiva adopted a neo-Hasidic approach. Students were encouraged to keep their long hair and their musical instruments.[8]\n",
      "Numerous students were professional or semi-professional musicians, and several musical collaborations were spawned in the yeshiva dorms.[9] In 1975 student Avraham Rosenblum, a rock guitarist who had started his own band in New York in 1970, founded the Diaspora Yeshiva Band.[9][10] The band became an outreach tool for other hippie students and, later, post-hippie seekers, using Jewish music to draw them into the milieu of Torah study.[8][9]\n"
   ]
}