{
   "Name": "Safam",
   "rawData": [
      "Safam is an American Jewish rock band from Boston, Massachusetts. Singer-songwriters Dan Funk, Joel Sussman, Robbie Solomon, and Alan Nelson formed the band in 1974.\n",
      "They have recorded over fifteen albums. These include eleven studio albums, two greatest hits albums, and a double album of Hannukkah and Passover songs.\n",
      "Safam was formed in 1974 in Boston, Massachusetts. Dan Funk, Joel Sussman, and Alan Nelson were members of the Zamir Chorale of Boston, but wanted to try performing outside a choral setting. They met Robbie Solomon when he moved to Boston from Baltimore to attend the Berklee College of Music. They named the group Safam, Hebrew for \"moustache\", in reference to the facial hair they all had at the time.\n"
   ],
   "infobox": {
      "Origin": [
         "Boston, Massachusetts"
      ],
      "Genres": [
         "Jewish rock, folk rock"
      ],
      "Years active": [
         "1974 (1974)–present"
      ],
      "Associated acts": [
         "Zamir Chorale of Boston"
      ],
      "Website": [
         "safam.com"
      ],
      "Members": [
         "Dan Funk",
         "Joel Sussman",
         "Robbie Solomon",
         "Alan Nelson"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Boston, Massachusetts. Singer-songwriters Dan Funk, [PERSON_NAME_FULL_1_MALE], Robbie Solomon, and [PERSON_NAME_FULL_0_MALE] formed the band in [YEAR].\n",
      "They have recorded over fifteen albums. These include eleven studio albums, two greatest hits albums, and a [GENRE]",
      "[BAND_NAME] was formed in [YEAR] in Boston, Massachusetts. Dan Funk, [PERSON_NAME_FULL_1_MALE], and Alan Nelson were members of the Zamir Chorale of Boston, but wanted to try performing outside a choral setting. They met [PERSON_NAME_FULL_0_MALE] when he moved to Boston from Baltimore to attend the Berklee College of Music. They named the group [BAND_NAME], Hebrew for \"moustache\", in reference to the facial hair they all had at the time.\n"
   ]
}