{
   "Summary": {
      "text": [
         "Thunderegg is an American rock and roll band and recording project currently based in San Francisco, California, led by songwriter Will Georgantas (guitar, vocals) and including Reese Douglas (guitar) and Alex Jimenez (bass, vocals). Its earliest incarnation was the Yale University band Larry,[1] formed in 1992 and featuring founding Thunderegg players Jake Fournier (bass) and Keith Woodfin (drums).\n",
         "Between 1995 and 2004, Georgantas recorded the first eight Thunderegg albums by himself to four-track cassette in various apartments in Brooklyn, New York, and his parents' house in Princeton, New Jersey. These albums, from 1995's Universal Nut through 2004's Sweetest One, display increasingly elaborate lo-fi (or \"bedroom music\"[2]) arrangements, and reviewers have remarked on their high lyrical quality.[3] In January 2006, all of these recordings were collected for the anthology Open Book: The Collected Thunderegg, 1995–2004. The independently produced Open Book featured 231 mp3s on a single data CD along with a 108-page illustrated lyric book. It enjoyed a positive reception[4] both for its large scale[5] and its music,[6] which was likened to rock in the vein of Guided by Voices,[7] The Velvet Teen,[8] and The Mountain Goats.[9]\n",
         "Thunderegg began playing and recording as a full band in 2000 after Fournier moved back east to Hartford, Connecticut, from Portland, Oregon. (The band was named after the thunderegg, the state rock of Oregon.) In 2002 a new full-band version of Georgantas's song \"If I Went on a Diet\" was selected for inclusion on a compilation CD produced by Jane magazine;[10] in 2005 that song and nine others would comprise Thunderegg's first full-band album, A Very Fine Sample of What's Available at the Mine. Thunderegg's second full-band album, Line Line, would be produced and mixed by Alan Weatherhead (Sparklehorse, Cracker) at Sound of Music Studios in Richmond, Virginia, and released independently in September 2011.[11] A follow-up with Weatherhead, C'mon Thunder, featuring Darren Jessee of Hotel Lights, was released on May 13, 2014,[12] to positive critical reception.[13][14][15][16]\n",
         "Throughout, Georgantas continued to record at home on a 424 Portastudio:[17] In 2005 he posted a new song every week[18] to Thunderegg's website, the best of which were collected for the CD This Week, which was self-released in early 2007. Several other albums followed, including Not What I Meant, Thunderegg's first San Francisco album,[19] which was recommended for fans of \"The Eels, Ween, The Flaming Lips, and Pulp.\"[20] That album's closing track, \"The Guest Star of the Rest Stop,\" was initially commissioned by author T Cooper for a CD accompanying his 2012 book Real Man Adventures.[21]\n",
         "Thunderegg toured Germany in the summer of 2013 with a lineup that included Georgantas, Fournier, Moon, and Ken Matsuda (violin),[22] and Georgantas toured the United States (with KC Turner) in the summers of 2014 and 2016.[23] In April 2015 the band released the seven-inch single \"Ten Sleeves\"/\"Big Cigarette,\" again recorded with Weatherhead, this time with the California lineup at Tiny Telephone in San Francisco.[24]\n",
         "With new drummer André Custodio, the band gelled in the Bay Area as a regularly gigging and touring four-piece band, complementing Georgantas's narrative lyrics with a sound described as \"space bar rock\" (\"space rock, bar rock, space bar rock\").[25] In January 2017, they returned to the studio with Weatherhead, this time at Acoustic Noise in Oakland, to record their new LP, Cosmos. It was completed at Space Bomb Studios in Richmond, Virginia, and released on both black and deluxe color vinyl by Bleeding Gold Records on May 11, 2018, accompanied by a second tour up and down California.[26] Issue 82 of the Big Takeover, in naming it a Top 40 selection, called the album \"otherworldly\" and \"smart and full of melodic charm,\" comparing it to \"Teenage Fanclub, Eyelids, Bats, and Chills.\"[27]\n"
      ]
   }
}