{
   "Name": "Thunderegg (band)",
   "rawData": [
      "Thunderegg is an American rock and roll band and recording project currently based in San Francisco, California, led by songwriter Will Georgantas (guitar, vocals) and including Reese Douglas (guitar) and Alex Jimenez (bass, vocals). Its earliest incarnation was the Yale University band Larry, formed in 1992 and featuring founding Thunderegg players Jake Fournier (bass) and Keith Woodfin (drums).\n",
      "Between 1995 and 2004, Georgantas recorded the first eight Thunderegg albums by himself to four-track cassette in various apartments in Brooklyn, New York, and his parents' house in Princeton, New Jersey. These albums, from 1995's Universal Nut through 2004's Sweetest One, display increasingly elaborate lo-fi (or \"bedroom music\") arrangements, and reviewers have remarked on their high lyrical quality. In January 2006, all of these recordings were collected for the anthology Open Book: The Collected Thunderegg, 1995–2004. The independently produced Open Book featured 231 mp3s on a single data CD along with a 108-page illustrated lyric book. It enjoyed a positive reception both for its large scale and its music, which was likened to rock in the vein of Guided by Voices, The Velvet Teen, and The Mountain Goats.\n",
      "Thunderegg began playing and recording as a full band in 2000 after Fournier moved back east to Hartford, Connecticut, from Portland, Oregon. (The band was named after the thunderegg, the state rock of Oregon.) In 2002 a new full-band version of Georgantas's song \"If I Went on a Diet\" was selected for inclusion on a compilation CD produced by Jane magazine; in 2005 that song and nine others would comprise Thunderegg's first full-band album, A Very Fine Sample of What's Available at the Mine. Thunderegg's second full-band album, Line Line, would be produced and mixed by Alan Weatherhead (Sparklehorse, Cracker) at Sound of Music Studios in Richmond, Virginia, and released independently in September 2011. A follow-up with Weatherhead, C'mon Thunder, featuring Darren Jessee of Hotel Lights, was released on May 13, 2014, to positive critical reception.\n"
   ],
   "infobox": {
      "Origin": [
         "New Haven, Connecticut"
      ],
      "Genres": [
         "lo-fi",
         "indie rock"
      ],
      "Years active": [
         "1992–present"
      ],
      "Labels": [
         "Command-Q (1994–2005)",
         "Orange Entropy (2000-2002)",
         "HUEV (Hartford Unified Egg Vendors) (2005–2017)",
         "Bleeding Gold Records (2017-present)"
      ],
      "Members": [
         "Will Georgantas",
         "Alex Jimenez",
         "Reese Douglas"
      ],
      "Past members": [
         "Jake Fournier",
         "Keith Woodfin",
         "Bob Porri",
         "Tim Kane",
         "Jonathan Chatfield",
         "Nathan Gohla",
         "Ken Moon",
         "Greg \"Action\" Zinman",
         "Aileen Brophy",
         "Russell Lord",
         "Ken Matsuda",
         "James Sundquist",
         "André Custodio"
      ]
   }
}