{
   "Name": "Blue Fringe",
   "Sections": [
      "1 History",
      "2 Musical style",
      "2.1 Lyrics",
      "3 Members",
      "4 Discography",
      "5 References"
   ],
   "Summary": {
      "text": [
         "Blue Fringe was an American Jewish rock band from New York City. Formed in 2001 by lead singer Dov Rosenblatt, the band's debut album, My Awakening (2003), sold more than 14,000 copies, an uncommon feat in the limited Jewish market, and became a runaway hit.[1] Since then, the band has released two more albums, 70 Faces (2005) and The Whole World Lit Up (2007), and has performed throughout the United States, Canada, Australia, the United Kingdom, Africa, and Israel.[2]  They were credited, along with Moshav and Soulfarm, with advancing Jewish rock in the early 2000s.[3]\n"
      ]
   },
   "History": {
      "text": [
         "Blue Fringe was formed in late 2001, after Yeshiva University music and psychology student Dov Rosenblatt, having been invited to perform at a Jewish event at the University of Pennsylvania, assembled three of his classmates as a backup band. Subsequently becoming a full-time band, the group spent the following years touring, performing at venues as diverse as Stern College, B. B. King's Blues Club in Times Square, and the Great Synagogue in Jerusalem.[1][3] In June 2003, the band released its debut album My Awakening. The album was commercially successful in the Jewish music market and introduced what would become the band's most famous song, \"Flippin' Out\".[1]\n",
         "A second album, 70 Faces, was released on June 5, 2005, followed by a third album, The Whole World Lit Up in February 2007.[2] They performed at Camp Moshava in Indian Orchard, Pennsylvania, an event later recalled by The Current editor emeritus David Fine.[4] In May 2009, the band gave a concert at Columbus Torah Academy during their Lag BaOmer event as a fundraiser for the 2010 March of the Living.[5]\n",
         "The band has been inactive since 2012. Dov Rosenblatt currently performs with the indie folk group Distant Cousins alongside Duvid Swirsky of Moshav.\n"
      ]
   },
   "Musical style": {
      "Lyrics": {
         "text": [
            "Blue Fringe's songs often reflected the band members' Orthodox Jewish faith, even directly quoting traditional Jewish liturgy amongst the primarily English lyrics.[1] Themes tend to vary from song to song, ranging from humorous satires of modern Jewish culture (\"Flippin' Out\", \"The Shidduch Song\") to darker and more serious songs (\"Lo Irah\", \"Hineni\"). With regard to the religious aspect of their lyrics, guitarist Avi Hoffman stated, \"We were never a kiruv project. We’re thinking personally and trying to write on a universal level. The music is going to convey a mood, color the way you hear the lyrics. Even if you don’t understand Hebrew, the lyrics will color your mood.\"[1]\n"
         ]
      },
      "text": [
         "Blue Fringe's music incorporated elements of pop, rock, funk, R&B, and blue-eyed soul.[6][7] The band's influences included Jewish artists like Diaspora Yeshiva Band, Moshav Band, Soulfarm, and Reva L'Sheva, as well as secular artists like The Beatles, Coldplay, John Mayer, Counting Crows, Victor Wooten, Elliott Smith, and Oasis.[5][7][8] At the time of My Awakening's release, lead singer Dov Rosenblatt identified Blue Fringe's sound as \"pop rock with a lot of funk influences\".[3]\n",
         "Blue Fringe was initially known for its heavy youth appeal, with The Forward's Alexander Gelfand noting that \"were it not for the Jewish themes and religious imagery that pervade the group’s English and Hebrew lyrics, you could imagine the band popping up on the soundtrack to a teen drama on The CW, or making the rounds of the ringtone-download scene.\"[7] Rosenblatt similarly stated, \"The lyrics are Jewish, but the music could be stuff you hear on the radio.\"[3] This aspect became less prominent over time; Liel Leibovitz of The Jewish Week said that 70 Faces contained less of the previous album's \"spirited pop sensibilities\" and was instead \"heavy with bluesy jams and roaming compositions\",[1] while former PopMatters contributor Mike Mineo called The Whole World Lit Up \"the band's most mature effort yet.\"[2]\n"
      ]
   },
   "Members": {},
   "Discography": {},
   "References": {},
   "coreData": [
      "Blue Fringe was an American Jewish rock band from New York City. Formed in 2001 by lead singer Dov Rosenblatt, the band's debut album, My Awakening (2003), sold more than 14,000 copies, an uncommon feat in the limited Jewish market, and became a runaway hit.[1] Since then, the band has released two more albums, 70 Faces (2005) and The Whole World Lit Up (2007), and has performed throughout the United States, Canada, Australia, the United Kingdom, Africa, and Israel.[2]  They were credited, along with Moshav and Soulfarm, with advancing Jewish rock in the early 2000s.[3]\n",
      "Blue Fringe was formed in late 2001, after Yeshiva University music and psychology student Dov Rosenblatt, having been invited to perform at a Jewish event at the University of Pennsylvania, assembled three of his classmates as a backup band. Subsequently becoming a full-time band, the group spent the following years touring, performing at venues as diverse as Stern College, B. B. King's Blues Club in Times Square, and the Great Synagogue in Jerusalem.[1][3] In June 2003, the band released its debut album My Awakening. The album was commercially successful in the Jewish music market and introduced what would become the band's most famous song, \"Flippin' Out\".[1]\n",
      "A second album, 70 Faces, was released on June 5, 2005, followed by a third album, The Whole World Lit Up in February 2007.[2] They performed at Camp Moshava in Indian Orchard, Pennsylvania, an event later recalled by The Current editor emeritus David Fine.[4] In May 2009, the band gave a concert at Columbus Torah Academy during their Lag BaOmer event as a fundraiser for the 2010 March of the Living.[5]\n",
      "The band has been inactive since 2012. Dov Rosenblatt currently performs with the indie folk group Distant Cousins alongside Duvid Swirsky of Moshav.\n"
   ]
}