{
   "Biography": {
      "text": [
         "Annette Ezekiel Kogan formed Golem in 2000. Before even putting the band together she contacted David Krakauer, who was then curating the weekly \"Klezmer Brunch\" at the downtown venue Tonic, and asked him for a gig. Krakauer agreed, and Ezekiel Kogan put together the first lineup for Golem’s debut.\n",
         "Golem recorded its first EP Golem in 2001, followed by the self-produced full-length albums Libeshmertzn (Love Hurts) (2002) and Homesick Songs (2004).\n",
         "In June, 2005, Golem recreated a \"mock wedding\", based on an old Catskills’ tradition, at the Knitting Factory in New York. An entire Jewish wedding ceremony took place before 200 \"guests\", complete with rabbi, chuppah, wedding party, and bride and groom in drag. The event was featured on the front page of the NY Times Arts section.[3]\n",
         "Golem’s music continued to evolve, moving from reinterpretations of traditional songs to more and more original material.\n",
         "In 2005, Golem signed with the NY indie label, Jdub Records (which launched the career of Matisyahu) and remained with Jdub until the label closed in 2011. Golem released two albums on Jdub : Fresh Off Boat (2006) and Citizen Boris (2009), both produced by Emery Dobyns (Patti Smith, Antony and the Johnsons).\n",
         "Numerous guest artists participated in Golem’s recordings, including Amanda Palmer, Lenny Kaye, Mike Gordon and Brandon Seabrook.\n",
         "In June, 2014, Golem released the album Tanz, produced by Tony Maimone (Pere Ubu) on the Mexican world music label, Discos Corasón (Buena Vista Social Club).\n",
         "Golem performed live on an episode of Season 4 of Louis CK’s acclaimed television comedy, Louie, in June, 2014.\n",
         "Golem performs in rock clubs, festivals, theaters, as well as at private events.\n"
      ]
   },
   "Discography": {
      "Compilations and soundtracks": {},
      "Music videos": {},
      "Studio Albums": {}
   },
   "External links": {},
   "Influences and genres": {
      "text": [
         "Golem combines elements of rock, punk, and klezmer. Lyrics are mainly in English, Yiddish and Russian.  Golem’s music is an undefinable hybrid characterized by a relentless beat and intense, theatrical energy.\n"
      ]
   },
   "Meaning of the name \"Golem\"": {
      "text": [
         "The band's name refers to the golem, a legendary Jewish monster figure from the Talmud and Jewish folklore, a being created out of clay by mystical rabbis in order to protect the endangered Jewish community, but who, when out of control, was turned back into clay. The band Golem describes itself as a collective monster that treats traditional Jewish Eastern European music with the utmost respect but without timidity or resistance to change.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Biography",
      "2 Influences and genres",
      "3 Meaning of the name \"Golem\"",
      "4 Discography",
      "4.1 Studio Albums",
      "4.2 Music videos",
      "4.3 Compilations and soundtracks",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Golem is a rock-klezmer band from New York City. They mix traditional Eastern European Jewish music with original material sung in Yiddish, English, Russian, as well as Ukrainian, French, Serbian-Croatian, Romany.[1]\n",
         "Golem was created in November, 2000 by Annette Ezekiel Kogan, bandleader, vocalist and accordionist. The group describes itself as \"Eastern European Jewish folk-rock\". The group performs internationally: throughout the United States, Canada, Mexico, as well as France, Germany, Ukraine, the U.K, Poland and Sweden.[2]\n"
      ]
   },
   "Title": "Golem (klezmer band) - Wikipedia"
}