{
   "Aharit Hayamim festival": {
      "text": [
         "Every summer since 2004, the band hosts the Aharit Hayamim festival in the old Masu'ot Yitzhak kibbutz near Bat Ayin in Gush Etzion.[14] Yehuda Leuchter's grandparents lived there in the 1940s. The festival began as a memorial for Leuchter's father, Emil Leuchter, a bass player who performed in the 1970s with Rabbi Shlomo Carlebach, the Diaspora Yeshiva Band, and other local groups. Since then, it has become a stop for Israeli pop stars such as Shotei HaNevuah, Y-Love, Shlomo Bar, Ehud Banai, Kobi Oz and others.\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "Members": {},
   "References": {},
   "Sections": [
      "1 Members",
      "2 Discography",
      "3 Aharit Hayamim festival",
      "4 See also",
      "5 References",
      "6 External links"
   ],
   "See also": {
      "text": [
         "Music of Israel\n"
      ]
   },
   "Summary": {
      "text": [
         "Aharit Hayamim (\"End of Days\") is an Israeli reggae fusion band formed in Jerusalem in 2002.[1][2][3][4]\n",
         "The music of Aharit Hayamim is described as a \"mix of reggae, Carlebach, rock, and various ethnic musical styles.\"[5]  Redemption and unity are central themes in their lyrics.[6][7]  The band is influenced by the Hasidic rabbi Nachman of Breslov and recorded some of its 2004 demo in the Ukrainian city of Uman, a popular Breslov pilgrimage site.[5] Two of Aharit Hayamim's members grew up in the Gush Etzion settlement bloc, but are now based in Jerusalem.[1]  Aharit Hayamim also organizes a yearly festival of the same name, held near the Judea and Samaria village of Bat Ayin, which attracts a mixed religious and secular audience of more than 1,000 people.[6][8][9]\n",
         "The band released a demo in 2004 and a self-released, self-titled debut album in 2006.[3][5][10]  In 2008, they collaborated with the Dar Fur Stars, a band made up of Darfuri refugees living in Israel.[11] They toured the US in 2009 and 2010, spurring criticism of their politics by blogger Daniel Sieradski and the Jewish student magazine New Voices, which the blog Jewlicious then responded to.[12][13]\n"
      ]
   },
   "Title": "Aharit Hayamim - Wikipedia"
}