{
   "Name": "Hamakor (band)",
   "Sections": [
      "1 History",
      "1.1 Origins (2006-2007)",
      "1.2 The Source (2006-2010)",
      "1.3 World On Its Side and break-up (2010-2015)",
      "2 Musical style",
      "3 Members",
      "3.1 Final line-up",
      "3.2 Past members",
      "4 Discography",
      "5 References"
   ],
   "Summary": {
      "text": [
         "Hamakor (Hebrew: המקור‎, \"the source\"; often typeset as haMakor and häMAKOR) was an Israeli Jewish rock band from Mevo Modi'im. They were formed in 2006 by lead singer Nachman Solomon and released two albums, The Source (2007) and World On Its Side (2010).\n"
      ]
   },
   "History": {
      "Origins (2006-2007)": {
         "text": [
            "Lead singer and founder Nachman Solomon grew up in Mevo Modi'im, a communal village founded by the late Rabbi Shlomo Carlebach. He is the son of Diaspora Yeshiva Band violinist and founding member Ben Zion Solomon, while his brothers Noah, Yehuda, Meir, and Yosef formed the influential Jewish rock bands Moshav Band and Soulfarm. Nachman performed with his family regularly from a young age.[1]\n",
            "Hamakor was formed at Mevo Modi'im in January 2006 by Solomon and lead guitarist Lazer Grunwald, although the latter was replaced with Yakir Hyman after he moved to the United States a few months later.[2][3][4] During the band's first year together, they opened for Moshav Band and Aharit Hayamim and became monthly fixtures at the local Mike's Place.[3]\n"
         ]
      },
      "The Source (2006-2010)": {
         "text": [
            "After a brief US tour, and after about a year of frequent gigging around Jerusalem, HaMakor began recording their debut album, The Source, in the winter of 2006-07. At this point, the band consisted of Yakir Hyman on guitar, Jono Landon on drums, Zechariah Reich on bass, and Ben Frimmer on keys. Shortly after completing the recording, Hyman and Reich were drafted into the Israel Defense Forces. Reich was replaced by bassist Jonathan Fialka.[2] The album was released on May 11, 2007. Near the end of the year, the band was recruited for a 10-city tour of Poland by the country's Chief Rabbi Michael Schudrich.[1]\n"
         ]
      },
      "World On Its Side and break-up (2010-2015)": {
         "text": [
            "The band released their second album, World On Its Side, on July 20, 2010. By this time, the band had acquired guitarist Bruce Burger, a solo artist under the name RebbeSoul, as well as keyboardist Gavriel Saks, bassist Yosef Solomon, and drummer Eliezer Grundman. The album spawned two singles, \"Illusion\" and \"Memories\".\n",
            "After a period of inactivity, the band resurfaced in 2014 with the Solomon brothers accompanied by guitarist Ben Katz, keyboardist Mendy Portnoy, and drummer Chemy Soibelman, formerly of The Groggers. The band released a single, \"Lift Me Up\", and announced plans for a third album of the same name.[5] However, in a 2016 interview, Nachman Solomon confirmed that, following several member departures, the band had \"kind of died out\" a few years prior.[6] He, Yosef, and brother Sruli Solomon currently perform as The Solomon Brothers.\n"
         ]
      }
   },
   "Musical style": {
      "text": [
         "Hamakor played a mix of grunge, trance fusion, folk, and classic rock music with Hebrew and English lyrics.[1] Band members have cited influences from Pearl Jam, Phish, and Disco Biscuits.[7] Lead singer Nachman Solomon's songwriting was influenced by funk, reggae, jam band, and blues music,[3][5] and the group's concerts often featured covers of The Who and The Grateful Dead, as well as Jewish artists like Shlomo Carlebach.[1] Although many of Hamakor's lyrics were religious-themed, Solomon has argued that non-Jews can also enjoy their music, saying, \"The words are meaningful and spiritual, but we don't play mostly songs based on biblical verses\".[3]\n"
      ]
   },
   "Members": {
      "Final line-up": {},
      "Past members": {}
   },
   "Discography": {},
   "References": {},
   "coreData": [
      "Hamakor (Hebrew: המקור‎, \"the source\"; often typeset as haMakor and häMAKOR) was an Israeli Jewish rock band from Mevo Modi'im. They were formed in 2006 by lead singer Nachman Solomon and released two albums, The Source (2007) and World On Its Side (2010).\n",
      "Lead singer and founder Nachman Solomon grew up in Mevo Modi'im, a communal village founded by the late Rabbi Shlomo Carlebach. He is the son of Diaspora Yeshiva Band violinist and founding member Ben Zion Solomon, while his brothers Noah, Yehuda, Meir, and Yosef formed the influential Jewish rock bands Moshav Band and Soulfarm. Nachman performed with his family regularly from a young age.[1]\n",
      "Hamakor was formed at Mevo Modi'im in January 2006 by Solomon and lead guitarist Lazer Grunwald, although the latter was replaced with Yakir Hyman after he moved to the United States a few months later.[2][3][4] During the band's first year together, they opened for Moshav Band and Aharit Hayamim and became monthly fixtures at the local Mike's Place.[3]\n",
      "After a brief US tour, and after about a year of frequent gigging around Jerusalem, HaMakor began recording their debut album, The Source, in the winter of 2006-07. At this point, the band consisted of Yakir Hyman on guitar, Jono Landon on drums, Zechariah Reich on bass, and Ben Frimmer on keys. Shortly after completing the recording, Hyman and Reich were drafted into the Israel Defense Forces. Reich was replaced by bassist Jonathan Fialka.[2] The album was released on May 11, 2007. Near the end of the year, the band was recruited for a 10-city tour of Poland by the country's Chief Rabbi Michael Schudrich.[1]\n"
   ]
}