{
   "Name": "Hamakor (band)",
   "rawData": [
      "Hamakor (Hebrew: המקור‎, \"the source\"; often typeset as haMakor and häMAKOR) was an Israeli Jewish rock band from Mevo Modi'im. They were formed in 2006 by lead singer Nachman Solomon and released two albums, The Source (2007) and World On Its Side (2010).\n",
      "Lead singer and founder Nachman Solomon grew up in Mevo Modi'im, a communal village founded by the late Rabbi Shlomo Carlebach. He is the son of Diaspora Yeshiva Band violinist and founding member Ben Zion Solomon, while his brothers Noah, Yehuda, Meir, and Yosef formed the influential Jewish rock bands Moshav Band and Soulfarm. Nachman performed with his family regularly from a young age.\n",
      "Hamakor was formed at Mevo Modi'im in January 2006 by Solomon and lead guitarist Lazer Grunwald, although the latter was replaced with Yakir Hyman after he moved to the United States a few months later. During the band's first year together, they opened for Moshav Band and Aharit Hayamim and became monthly fixtures at the local Mike's Place.\n"
   ],
   "infobox": {
      "Origin": [
         "Mevo Modi'im, Israel"
      ],
      "Genres": [
         "Jewish rock, alternative rock, grunge, trance fusion, livetronica"
      ],
      "Years active": [
         "2006–2015"
      ],
      "Associated acts": [
         "Diaspora Yeshiva Band, Moshav, Soulfarm, Solomon Brothers Band, G-Nome Project"
      ],
      "Past members": [
         "Nachman Solomon",
         "Ben Katz",
         "Yosef Solomon",
         "Chemy Soibelman",
         "Mendy Portnoy",
         "Ben Frimmer",
         "Jonathan Fialko",
         "Lazer Grunwald",
         "Bruce Burger",
         "Jason Reich",
         "Gavriel Saks",
         "Eliezer Grundman",
         "Jono Landon",
         "Yakir Hyman",
         "Zechariah Reich"
      ]
   },
   "albums": [
      "The Source",
      "World On Its Side"
   ],
   "prunedData": [
      "[BAND_NAME] (Hebrew: המקור‎, [SONG_NAME]; often typeset as haMakor and häMAKOR) was an [GENRE] band from Mevo Modi'im. They were formed in [YEAR] by lead singer Nachman Solomon and released two albums, The Source ([YEAR]) and World On Its Side ([YEAR]).\n",
      "Lead singer and founder Nachman Solomon grew up in Mevo Modi'im, a communal village founded by the late Rabbi Shlomo Carlebach. He is the son of Diaspora Yeshiva Band violinist and founding member [PERSON_NAME_FULL_0_MALE], while his brothers Noah, Yehuda, Meir, and Yosef formed the influential Jewish rock bands Moshav Band and Soulfarm. Nachman performed with his family regularly from a young age.\n",
      "[BAND_NAME] was formed at Mevo Modi'im in [MONTH] [YEAR] by Solomon and lead guitarist Lazer Grunwald, although the latter was replaced with [PERSON_NAME_FULL_0_MALE] after he moved to the United States a [GENRE] band's first year together, they opened for Moshav Band and Aharit Hayamim and became monthly fixtures at the local Mike's Place.\n"
   ]
}