{
   "Name": "Yood",
   "rawData": [
      "Yood is an Israeli Jewish rock band from Jerusalem. They formed in 2005 with singer/guitarist Lazer Lloyd (formerly of Reva L'Sheva), bassist Yaakov Lefcoe, and drummer Akiva Girsh (later replaced by Moshe Yankovsky). They released two albums, Passin'over (2007) and Real People (2008). Self-described as a \"power rock trio\", Yood performs blues rock in the vein of ZZ Top, Cream, Led Zeppelin, and Jimi Hendrix, albeit with religious lyrics.\n",
      "The original members of Yood - singer/guitarist Lazer Lloyd, bassist Yaakov Lefcoe, and drummer Akiva Girsh -  met and began playing together in Beit Shemesh in 2000, but ultimately separated due to Lloyd's commitment to Reva L'Sheva, the outbreak of the Second Intifada, and their collective uncertainty about the group's profitability. However, they later regrouped in the fall of 2005, motivated by the controversial dismantling of Gaza settlements by the Israeli government, with Lloyd later saying, \"We just knew that we needed to do something to counteract what was going on in the country. Music has a way of bringing people together.\"\n",
      "Girsh left in 2006 to pursue other projects and was replaced by Russian-American drummer Moshe Yankovsky. That same year, the band made their debut at an open mic night at Mike's Place in Tel Aviv.\n"
   ],
   "infobox": {
      "Origin": [
         "Jerusalem, Israel"
      ],
      "Genres": [
         "Jewish rock, blues rock, hard rock"
      ],
      "Years active": [
         "2005 (2005)–present"
      ],
      "Associated acts": [
         "Reva L'Sheva"
      ],
      "Members": [
         "Lazer Lloyd",
         "Yaakov Lefcoe",
         "Moshe Yankovsky"
      ],
      "Past members": [
         "Akiva Girsh"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Jerusalem. They formed in [YEAR] with singer/guitarist Lazer Lloyd (formerly of Reva L'Sheva), bassist [PERSON_NAME_FULL_1_MALE], and drummer [PERSON_NAME_FULL_2_MALE] (later replaced by [PERSON_NAME_FULL_3_MALE]). They released two albums, Passin'over ([YEAR]) and Real People ([YEAR]). Self-described as a \"power rock trio\", [BAND_NAME] performs blues rock in the vein of ZZ Top, Cream, Led Zeppelin, and [PERSON_NAME_FULL_0_MALE], albeit with religious lyrics.\n",
      "The original members of [BAND_NAME] - singer/guitarist Lazer Lloyd, bassist [PERSON_NAME_FULL_0_MALE], and drummer [PERSON_NAME_FULL_1_MALE] -  met and began playing together in Beit Shemesh in [YEAR], but ultimately separated due to Lloyd's commitment to [PERSON_NAME_FULL_2_FEMALE], the outbreak of the Second Intifada, and their collective uncertainty about the group's profitability. However, they later regrouped in the fall of [YEAR], motivated by the controversial dismantling of Gaza settlements by the Israeli government, with Lloyd later saying, \"We just knew that we needed to do something to counteract what was going on in the country. Music has a [GENRE]",
      "Girsh left in [YEAR] to pursue other projects and was replaced by Russian-American drummer Moshe Yankovsky. That same year, the band made their debut at an [GENRE]"
   ]
}