{
   "Activism": {
      "text": [
         "On May 16, 2010, the band was recruited to play at the bat mitzvah of Alix Klein at Temple Beth Shmuel in Miami Beach. Per Klein's request, the concert benefited ALYN Hospital in Jerusalem.[6]\n",
         "In 2013, Kunstler and Polansky, along with The Maccabeats' Immanuel Shalev and recording artist Simcha Leiner, were judges at V'Ata Banim Shiru, an annual a cappella competition at Torah Academy of Bergen County that benefits the Koby Mandell Foundation.[7]\n"
      ]
   },
   "Band history": {
      "text": [
         "Yaakov Chesed formed in the summer of 2006 with lead singer Jake Polansky, guitarist Michael Shapiro, bassist Dovi Salamon, and drummer Michael Moskowitz. They would often meet at Polansky's house for rehearsals on Motza'ei Shabbat.[1] After Salamon left to attend Yeshivat Sha'alvim in Israel, Aryeh Kunstler was chosen to replace him as bassist.\n",
         "In March 2007, the band co-headlined a Purim concert at the Knitting Factory with the band Heedoosh.[2] That same year, they won Lander College and Yeshiva University's Battle of the Bands contests[3] and gave an NCSY-sponsored Sukkot concert in Savannah, Georgia.[4] Their debut album, Rise Above, was produced by Jake Antelis and released on December 11, 2007 by Sameach Music. The band performed at the 2008 Celebrate Israel Parade's Summer Stage in Central Park alongside the Piamenta Band, among others.[5] Their second album, The Passage, co-produced by Kunstler and Antelis, was released by Sameach on November 30, 2009.\n",
         "In early 2019, Polansky revealed via Facebook and Instagram that he was reviving Yaakov Chesed as a solo project and was working on material for a new album. Later in the year he released two singles, \"Crush Me\" and \"Ani L'dodi\", the former of which received a music video filmed at 770 Eastern Parkway in Crown Heights, Brooklyn. In 2020 he released another single, \"Nothing But You (Ein Od)\", a collaboration with his cousin Tani Polansky, who performs as Tefeelah.\n"
      ]
   },
   "Band members": {
      "Current": {},
      "Former": {},
      "Touring": {}
   },
   "Discography": {
      "Albums": {},
      "Singles": {}
   },
   "External links": {},
   "Other member projects": {
      "text": [
         "Bassist Aryeh Kunstler has released two albums as a solo artist and has contributed guitar, vocals, songwriting, and production to several artists. Another former bassist, Ben Wallick, has played for the Ruach Hakodesh wedding band and is the founder of Sonic Itch Productions.\n",
         "Lead singer Jake Polansky debuted a folk rock solo project called ohr in late 2016. The project's debut EP, Side by Side, was mixed by Kunstler and mastered by Antelis and was released in 2017.[8]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Band history",
      "2 Activism",
      "3 Other member projects",
      "4 Band members",
      "4.1 Current",
      "4.2 Former",
      "4.3 Touring",
      "5 Discography",
      "5.1 Albums",
      "5.2 Singles",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Yaakov Chesed is an American Jewish rock band from Long Island, New York. Formed in 2006, the group won Battle of the Bands competitions at Yeshiva University and Lander College before recording two studio albums, Rise Above (2007) and The Passage (2009). Their name is a quote from the Uva Letzion prayer in Shacharis.\n"
      ]
   },
   "Title": "Yaakov Chesed - Wikipedia"
}