{
   "Name": "Yaakov Chesed",
   "rawData": [
      "Yaakov Chesed is an American Jewish rock band from Long Island, New York. Formed in 2006, the group won Battle of the Bands competitions at Yeshiva University and Lander College before recording two studio albums, Rise Above (2007) and The Passage (2009). Their name is a quote from the Uva Letzion prayer in Shacharis.\n",
      "Yaakov Chesed formed in the summer of 2006 with lead singer Jake Polansky, guitarist Michael Shapiro, bassist Dovi Salamon, and drummer Michael Moskowitz. They would often meet at Polansky's house for rehearsals on Motza'ei Shabbat. After Salamon left to attend Yeshivat Sha'alvim in Israel, Aryeh Kunstler was chosen to replace him as bassist.\n",
      "In March 2007, the band co-headlined a Purim concert at the Knitting Factory with the band Heedoosh. That same year, they won Lander College and Yeshiva University's Battle of the Bands contests and gave an NCSY-sponsored Sukkot concert in Savannah, Georgia. Their debut album, Rise Above, was produced by Jake Antelis and released on December 11, 2007 by Sameach Music. The band performed at the 2008 Celebrate Israel Parade's Summer Stage in Central Park alongside the Piamenta Band, among others. Their second album, The Passage, co-produced by Kunstler and Antelis, was released by Sameach on November 30, 2009.\n"
   ],
   "infobox": {
      "Origin": [
         "Long Island, New York"
      ],
      "Genres": [
         "Jewish rock, alternative rock"
      ],
      "Years active": [
         "2006 (2006)–2014, 2019–present"
      ],
      "Labels": [
         "Sameach, CD Baby"
      ],
      "Associated acts": [
         "Ohr"
      ],
      "Website": [
         "yaakovchesed.com"
      ],
      "Members": [
         "Jake Polansky"
      ],
      "Past members": [
         "Michael Shapiro",
         "Aryeh Kunstler",
         "Michael Moskowitz",
         "Dovi Salamon",
         "Ben Wallick"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Long Island, New York. Formed in [YEAR], the group won Battle of the Bands competitions at Yeshiva University and Lander College before recording two studio albums, Rise Above ([YEAR]) and The Passage ([YEAR]). Their name is a quote from the Uva Letzion prayer in Shacharis.\n",
      "[BAND_NAME] formed in the summer of [YEAR] with lead singer [PERSON_NAME_FULL_1_MALE], guitarist Michael Shapiro, bassist Dovi Salamon, and drummer Michael Moskowitz. They would often meet at [PERSON_NAME_LAST_1]'s house for rehearsals on Motza'ei Shabbat. After Salamon left to attend Yeshivat Sha'alvim in Israel, [PERSON_NAME_FULL_0_MALE] was chosen to replace him as bassist.\n",
      "In [MONTH] [YEAR], the band co-headlined a [GENRE] band Heedoosh. That same year, they won Lander College and Yeshiva University's Battle of the Bands contests and gave an NCSY-sponsored Sukkot concert in Savannah, Georgia. Their debut album, Rise Above, was produced by [PERSON_NAME_FULL_0_MALE] and released on [MONTH] 11, [YEAR] by Sameach Music. The band performed at the [YEAR] Celebrate Israel Parade's Summer Stage in Central Park alongside the Piamenta Band, among others. Their second album, The Passage, co-produced by Kunstler and [PERSON_NAME_LAST_0], was released by Sameach on [MONTH] 30, [YEAR].\n"
   ]
}