{
   "Name": "The Shondes",
   "Sections": [
      "1 Releases and Tours",
      "1.1 The Red Sea (2008-2010)",
      "1.2 My Dear One and Searchlights (2010-2012)",
      "1.3 The Garden and Brighton (2012-present)",
      "2 Jewish cultural influence",
      "3 Critical response",
      "4 Discography",
      "5 Notes and references",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Shondes are a rock band from Brooklyn, NY, best known for their combination of feminist punk, rock, pop, and Jewish influences, and ties to political activism. The Shondes formed in 2006 and have released two demos and five full-length studio albums.[1] The band was started by violinist Elijah Oberman and bassist Louisa Rachel Solomon after their former band, The Syndicate, broke up. They recruited guitarist Ian Brannigan, a friend they had made through student activism at The New School in Greenwich Village, and drummer Temim Fruchter, whom the three got to know through protesting the Republican National Convention in 2004.\n"
      ]
   },
   "Releases and Tours": {
      "The Red Sea (2008-2010)": {
         "text": [
            "After national tours in summer 2006, spring 2007, and late 2007, The Shondes self-released their debut LP, The Red Sea, on January 8, 2008, and held a record release party at Brooklyn's Luna Lounge. The album was recorded at Studio G in Brooklyn, NY and produced by Tony Maimone of Pere Ubu and They Might Be Giants,[2] and features Brian Dewan on keyboards.[3] Critics reviewing the album often noted the improbability of combining the band's influences and political intentions, and generally praised their success.[4] In the Chicago Tribune Jessica Hopper said: \"The Red Sea', is a visceral work...their moody songs are redolent of a time in the early '80s when punk fractured into something more tuneful and complex...a political band whose music is as strong as its message is a rare treat.' Venus Zine said: \"On paper, this band sounds like a train wreck, but in real life they are completely arresting....Old-world romance elegantly intertwined with riot grrrl piss and vinegar onstage...A lot of valid arguments have been made against overtly mixing politics and music — it takes the focus off important things like rhythm or, worse, excuses a band’s lack of talent or imagination. But those arguments don’t apply to bands whose politics become inseparable from the emotive quality of their sound.\"[5] They toured again in Fall 2008 in support of The Red Sea.\n"
         ]
      },
      "My Dear One and Searchlights (2010-2012)": {
         "text": [
            "Following that tour, guitarist Ian Brannigan (who was also Solomon's boyfriend at the time) left the band and was replaced by Fureigh. The new lineup made its debut at JDub Records' annual \"Jewltide\" Christmas Eve party at Southpaw in Brooklyn, NY (a venue the band spoke of as their home base until its closure in 2011). In May 2010, the Shondes released their second album My Dear One on Fanatic Records, which has been referred to as their \"break-up album,\" in the aftermath of Brannigan's departure.They toured nationally to support it that year, beginning at South By Southwest in March throughout the Spring, receiving favorable critical response along the way, again particularly for the emotive quality of their live performance.\n",
            "Culture Snob says: \"... this break-up record sounds like no other. For one thing, there’s the artful but direct anger of many of the lyrics, delivered by bassist Louisa Solomon with a lethal woundedness. 'Lines & Hooks' offers a command that also reads as a warning: 'And if you ever want me again, I suggest you run.' My favorite song of the year so far, 'Miami' is a bitter and bruised document of abandonment, almost certainly a kiss-off to guitarist Ian Brannigan, who left the band mid-tour in 2008.\"[6]\n",
            "Stomp and Stammer says: \"The members of The Shondes (Shonde is Yiddish for a disgrace) are refreshingly uncoy about the fact that these tearful and fiercely accusatory songs are about Brannigan's abrupt departure.\"[7]\n",
            "Three Imaginary Girls says: \"My favorite song is 'You Ought To Be Ashamed,' a stomping number full of incredibly precise little details about a user-loser, who ruins simple things like 'a pre-show shot of Jameson,' and whose behavior strikes the narrator as a dull parody of stories by 'Bukowski, Updike, Kerouac.' The subject frantically, boldly cut down in this psychodrama, it makes John Cale's song 'Chicken Shit' about his tour-stopping guitarist who quit the band sound like a gnarled belch. For vindictiveness, its impossibly catchy melody and shuddering, multi-vocal climax can't be beat, even by fathers of the form.\"[8]\n",
            "In Fall 2010, The Shondes announced that their violinist, Elijah Oberman, had been diagnosed with cancer and was undergoing treatment. This resulted in the cancellation of a 7-week European tour. In early 2011, the band announced plans to move forward with performances at SXSW 2011, record a new album, and more touring, following the release. In August 2011, The Shondes announced that they had parted ways with Fanatic Records and would be releasing Searchlights on Exotic Fever Records on September 20, 2011 with Producer Tony Maimone stepping in to mix the record. One review said: \"One instantly notable improvement from the previous two albums is production value. Whereas...My Dear One was muted and muffled, Searchlights feels bright and raw, a sound much more befitting bouncy, energetic rock music.\"[9] They toured nationally throughout the fall of that year, ending with a CMJ showcase, then again in 2012, beginning with a week of shows at SXSW in March through the end of May.\n"
         ]
      },
      "The Garden and Brighton (2012-present)": {
         "text": [
            "They toured Europe throughout the Fall of 2012, sponsored by Missy magazine, trying out material for a new album. In April 2013 they announced the departure of founding drummer, Temim Fruchter, and the entrance of Allison Miller for the band's fourth record, The Garden, which was released September 17, 2013 on Exotic Fever Records, and again produced by Tony Maimone at Brooklyn, NY's Studio G. The Garden release tour was Fureigh's last with the band, and Fen Ikner stepped in on drums. In December 2013, the band announced they would be joining Against Me! for their record release tour in January 2014, joined by Zach Toporek on guitar and Jim Heffernan on drums.\n",
            "Their fourth studio album The Garden was released in 2013 on Exotic Fever Records, and produced by Tony Maimone at Brooklyn, NY's Studio G. The band toured with Against Me! in January 2014,[10] and went on a headlining national tour in Winter/Spring 2015.[11]\n",
            "Following the tour, the band settled into a more permanent lineup consisting of the founding duo (Solomon and Oberman), new guitarist Courtney Robbins, and drummer Alex Smith. This new lineup went into the studio to record The Shondes fifth studio album from January–March 2016.\n",
            "In June 2016 the band announced the new record, Brighton, would be released on September 17, 2016 on Exotic Fever Records.\n"
         ]
      }
   },
   "Jewish cultural influence": {
      "text": [
         "The band has organized and performed at benefit events for progressive organizations like Birthright Unplugged, Jews Against the Occupation, ASWAT, Jewish Voice for Peace, and The Sylvia Rivera Law Project.\n",
         "The Red Sea features the song \"I Watched the Temple Fall,\" one of their most well-known and explicitly political songs. The band has said they wrote it collaboratively very early on, and that it arose from conversations about the meaning of the Jewish holiday Tisha B'Av.[2] Members of the band worked with the New York City group Jews Against the Occupation,[12] an organization \"advocating peace through justice for Palestine and Israel.\" [13]\n",
         "Since its inception,[14] the band has stirred controversy for the members' outspoken radical politics, particularly those centered around the Israeli-Palestinian conflict.[2] In response to the band's statements, and Solomon's support for the Palestinian Boycott, Divestment and Sanctions campaign, in March 2014 it was announced that the Washington DC Jewish Community Centre had cancelled the band's invitation to perform at the 2014 Washington Jewish Music Festival.[15] Solomon said of the cancellation\n",
         "Given how candid I have always been about my political views, and that I’ve been engaged in Palestine solidarity activism for over a decade, I was thrilled when we were asked to perform, thinking it signaled a move toward inclusivity. It’s a real disappointment and disrespect to have the invitation withdrawn now.",
         "Of My Dear One, The Jewish Daily Forward said: \"They are a Jewish band, and they’re playing klezmer modalities and time signatures, but you could not know any of that and still think the song you’re listening to is the best song you’ve heard in years.\"[16] Heeb Magazine said that The Shondes' mix of confrontational political punk and Jewish music created \"a powerful new sound\" and included Fruchter as one of \"the Heeb 100\" in 2007,[17] while the magazine's blog asserted that in the contemporary Jewish music scene \"it is quite possible that the  Shondes are making the only music that truly matters\" and called The Red Sea \"the most anticipated Jewish record of the year.\" [18] In June 2010, The Shondes were included in The Big Jewcy.[19]\n"
      ]
   },
   "Critical response": {
      "text": [
         "Peter Ames Carlin said The Garden features \"better-stand-back vocals from Louisa Solomon, who has one of the biggest voices in pop music.\" She has also been called \"a front-woman to fear and fall in love with.\"[20] and A reviewer at The Shondes' Atlanta stop on their 2008 Fall tour commented that Solomon \"charged at the mic as if to push the song forward with her body.\"[5] Depth of Field magazine said \"Lead singer Louisa Solomon’s voice is nothing short of breathtaking, caressing the notes while sending them forth with a power and force that forms immediate bonds with an audience; her tone and intonation giving the impression that she’s speaking directly to each and every individual listener.\"\n",
         "The Shondes make bold, brassy lonely-heart rock with the snarl and swoon of classic '90s Northwestern indie—all riot grrl bluster, K Records sentimentality, and a keening, wailing violin that's more Nirvana Unplugged than Raincoats unhinged....Separating themselves from Sleater-come-latelys, the Shondes have a little bit of steampunky clatter underneath their crunching riffs and a keen ear towards the Jewish music that raised each of its four members.\n-The Village Voice[21]\n",
         "“Miami,” which starts off with Solomon angrily demanding, “Did you leave me on Venice Beach?” over rumbling drums, is about a very specific breakup, but — like all great songs — it could be about anyone being abandoned, anywhere. They are a Jewish band, and they’re playing klezmer modalities and time signatures, but you could not know any of that and still think the song you’re listening to is the best song you’ve heard in years.\n-The Forward [16]\n",
         "Venus Zine said that Elijah Oberman \"played...violin with such physicality that he sometimes crumpled almost to the ground around his instrument.\" [22] Another reviewer commented that \"Elijah Oberman has that rare mastery of post-punk violin playing that only seems to come along once in a generation.\" [23]\n"
      ]
   },
   "Discography": {},
   "Notes and references": {},
   "External links": {},
   "coreData": [
      "The Shondes are a rock band from Brooklyn, NY, best known for their combination of feminist punk, rock, pop, and Jewish influences, and ties to political activism. The Shondes formed in 2006 and have released two demos and five full-length studio albums.[1] The band was started by violinist Elijah Oberman and bassist Louisa Rachel Solomon after their former band, The Syndicate, broke up. They recruited guitarist Ian Brannigan, a friend they had made through student activism at The New School in Greenwich Village, and drummer Temim Fruchter, whom the three got to know through protesting the Republican National Convention in 2004.\n",
      "After national tours in summer 2006, spring 2007, and late 2007, The Shondes self-released their debut LP, The Red Sea, on January 8, 2008, and held a record release party at Brooklyn's Luna Lounge. The album was recorded at Studio G in Brooklyn, NY and produced by Tony Maimone of Pere Ubu and They Might Be Giants,[2] and features Brian Dewan on keyboards.[3] Critics reviewing the album often noted the improbability of combining the band's influences and political intentions, and generally praised their success.[4] In the Chicago Tribune Jessica Hopper said: \"The Red Sea', is a visceral work...their moody songs are redolent of a time in the early '80s when punk fractured into something more tuneful and complex...a political band whose music is as strong as its message is a rare treat.' Venus Zine said: \"On paper, this band sounds like a train wreck, but in real life they are completely arresting....Old-world romance elegantly intertwined with riot grrrl piss and vinegar onstage...A lot of valid arguments have been made against overtly mixing politics and music — it takes the focus off important things like rhythm or, worse, excuses a band’s lack of talent or imagination. But those arguments don’t apply to bands whose politics become inseparable from the emotive quality of their sound.\"[5] They toured again in Fall 2008 in support of The Red Sea.\n",
      "Following that tour, guitarist Ian Brannigan (who was also Solomon's boyfriend at the time) left the band and was replaced by Fureigh. The new lineup made its debut at JDub Records' annual \"Jewltide\" Christmas Eve party at Southpaw in Brooklyn, NY (a venue the band spoke of as their home base until its closure in 2011). In May 2010, the Shondes released their second album My Dear One on Fanatic Records, which has been referred to as their \"break-up album,\" in the aftermath of Brannigan's departure.They toured nationally to support it that year, beginning at South By Southwest in March throughout the Spring, receiving favorable critical response along the way, again particularly for the emotive quality of their live performance.\n",
      "Culture Snob says: \"... this break-up record sounds like no other. For one thing, there’s the artful but direct anger of many of the lyrics, delivered by bassist Louisa Solomon with a lethal woundedness. 'Lines & Hooks' offers a command that also reads as a warning: 'And if you ever want me again, I suggest you run.' My favorite song of the year so far, 'Miami' is a bitter and bruised document of abandonment, almost certainly a kiss-off to guitarist Ian Brannigan, who left the band mid-tour in 2008.\"[6]\n"
   ]
}