{
   "Name": "Moshiach Oi!",
   "rawData": [
      "Moshiach Oi! is an American Hasidic hardcore punk band from Long Beach, New York. Formed in 2008 by lead singer Yishai Romanoff and guitarist Mike Wagner, they released their debut album, Better Get Ready (2009), on Shemspeed Records, followed in 2011 by This World is Nothing. They were prominently featured in the 2012 documentary Punk Jews.\n",
      "Moshiach Oi! was started in 2008 by singer/guitarist Yishai Romanoff, who had sought to reconcile his then-recently renewed Jewish faith with the punk rock music he had loved as a teenager. Initially a solo act, Romanoff eventually brought in his friend Mike Wagner, as well as bassist Mitchell \"Mordechai\" Harrison and drummer Paul \"Pesach\" Alpert, to complete the band. The band's name is derived from a combination Moshiach, the Jewish name for the Messiah; oy vey, a Yiddish expression conveying exasperation and dismay; and Oi!, a British working-class genre of punk music.\n",
      "The group's debut album, Better Get Ready, produced by Wagner and mastered by veteran punk producer Don Fury, was released by Shemspeed Records and the band's own Shabasa Records label on August 25, 2009. A second album, This World is Nothing, was released two years later just on Shabasa, accompanied by the single and music video \"Got Nothing On Me\". The band was prominently featured in the 2012 documentary Punk Jews.\n"
   ],
   "infobox": {
      "Origin": [
         "Long Beach, New York, USA"
      ],
      "Genres": [
         "Jewish rock",
         "Hardcore punk"
      ],
      "Years active": [
         "2008 (2008)–present"
      ],
      "Labels": [
         "Shemspeed, Shabasa"
      ],
      "Associated acts": [
         "Moshe Hecht Band, Blanket Statementstein, White Shabbos, Rockazion, Shin Shin Mem"
      ],
      "Website": [
         "moshiachoi.com"
      ],
      "Members": [
         "Yishai Romanoff",
         "Mike Wagner",
         "Mitchell \"Mordechai\" Harrison",
         "Paul \"Pesach\" Alpert"
      ]
   },
   "albums": [
      "Better Get Ready",
      "This World Is Nothing",
      "Rock Rabeinu"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Long Beach, New York. Formed in [YEAR] by lead singer Yishai Romanoff and guitarist [PERSON_NAME_FULL_0_MALE], they released their debut album, Better Get Ready ([YEAR]), on Shemspeed Records, followed in [YEAR] by This World is Nothing. They were prominently featured in the [YEAR] documentary Punk Jews.\n",
      "[BAND_NAME] was started in [YEAR] by singer/guitarist Yishai Romanoff, who had sought to reconcile his then-recently renewed Jewish faith with the punk rock music he had loved as a [GENRE] a solo act, Romanoff eventually brought in his friend [PERSON_NAME_FULL_0_MALE], as well as bassist Mitchell [SONG_NAME] Alpert, to complete the band. The band's name is derived from a combination Moshiach, the Jewish name for the Messiah; oy vey, a Yiddish expression conveying exasperation and dismay; and Oi!, a British working-class genre of punk music.\n",
      "The group's debut album, Better Get Ready, produced by Wagner and mastered by veteran punk producer [PERSON_NAME_FULL_0_MALE], was released by Shemspeed Records and the band's own Shabasa Records label on [MONTH] 25, [YEAR]. A second album, This World is Nothing, was released two years later just on Shabasa, accompanied by the single and music video [SONG_NAME]. The band was prominently featured in the [YEAR] documentary Punk Jews.\n"
   ]
}