{
   "Band history": {
      "Down to the Top EP (2012-2015)": {
         "text": [
            "The band independently released their first official recording, Down to the Top EP, on April 1, 2012.[4]\n",
            "A documentary about the band, The Bulletproof Stockings, was screened at the 2013 DOC NYC film festival.[5] On August 7, 2014, the band performed at Arlene's Grocery in the Lower East Side. The show was filmed by the Oxygen Network for the reality show Living Different.[5][6][7]\n"
         ]
      },
      "National tour, Homeland Call Stomp, and separation (2015-2016)": {
         "text": [
            "In the spring of 2015, the band launched a Kickstarter campaign to fund their debut full-length album, announcing that they had begun recording at Strange Weather Studios with producers Marc Alan Goodman and Howie Feibusch and would soon release the album's first single, \"Mind Clear\".[8][9] The campaign was successful, with the album set for release in late January 2016.[10]\n",
            "In December 2015, the band embarked on their first national tour, the Homeland Winter tour, beginning with a Hanukkah concert at Webster Hall.[11][12] The tour included stops in New York, Philadelphia, Washington, D.C., Orlando, Fort Lauderdale, San Francisco, Los Angeles, and Portland.[10]\n",
            "On April 8, 2016, the band announced via Facebook that they had disbanded, and that members would be \"[moving] on to new chapters.\"[13] Members of the group subsequently formed the projects PERL and the New Moon All Stars Party Band.\n"
         ]
      },
      "Origins (2011-2012)": {
         "text": [
            "In 2011, singer-songwriter Perl Wolfe moved from Chicago to Brooklyn's Crown Heights neighborhood.[2] There, she was introduced by a mutual friend to ex-Hopewell drummer Dalia Shusterman, and the two formed Bulletproof Stockings in December 2011.[2][3]\n"
         ]
      }
   },
   "Band members": {},
   "Discography": {},
   "External links": {},
   "Musical style and performances": {
      "text": [
         "Bulletproof Stockings was an alternative/indie rock band[2][14] with influences from punk, pop, jazz, blues, and funk.[12][15] They also incorporated their Hasidic faith and tradition, even using the melodic structures from traditional Chabad nigunnim.[16]\n",
         "Their sound was compared to that of Adele, Nina Simone, Fiona Apple, and Florence and the Machine, while the band themselves cited influences including Radiohead, The White Stripes, Red Hot Chili Peppers, and Jane's Addiction.[2] Lead singer Perl Wolfe was quoted saying that her lyrics, while not always explicitly religious, were nevertheless inspired by \"Torah and by Lubavitch’s version of Hasidic faith\".[16]\n",
         "In concert, the band was known for adhering to the rabbinic prohibition of kol isha by only admitting women to their live shows. \"The band can't legally prevent men from attending\", says Shusterman, \"but people are amazed by the fact that we put the word out and it's pretty much respected.\" Wolfe argued that this was beneficial to their audience: \"Women will party and rock out in a completely different way when there’s nobody there but women.\"[17]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Band history",
      "1.1 Origins (2011-2012)",
      "1.2 Down to the Top EP (2012-2015)",
      "1.3 National tour, Homeland Call Stomp, and separation (2015-2016)",
      "2 Musical style and performances",
      "3 Band members",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Bulletproof Stockings was an American Hasidic alternative rock band based in Crown Heights, New York. Formed in 2011 by lead singer Perl Wolfe and ex-Hopewell drummer Dalia Shusterman, the group independently released its debut EP, Down to the Top the following year. They were noted for their unique sound among Jewish music, as well as their adherence to the prohibition of kol isha by performing for female-only audiences.\n"
      ]
   },
   "Title": "Bulletproof Stockings - Wikipedia"
}