{
   "Name": "Bulletproof Stockings",
   "rawData": [
      "Bulletproof Stockings was an American Hasidic alternative rock band based in Crown Heights, New York. Formed in 2011 by lead singer Perl Wolfe and ex-Hopewell drummer Dalia Shusterman, the group independently released its debut EP, Down to the Top the following year. They were noted for their unique sound among Jewish music, as well as their adherence to the prohibition of kol isha by performing for female-only audiences.\n",
      "In 2011, singer-songwriter Perl Wolfe moved from Chicago to Brooklyn's Crown Heights neighborhood. There, she was introduced by a mutual friend to ex-Hopewell drummer Dalia Shusterman, and the two formed Bulletproof Stockings in December 2011.\n",
      "The band independently released their first official recording, Down to the Top EP, on April 1, 2012.\n"
   ],
   "infobox": {
      "Also known as": [
         "BPS"
      ],
      "Origin": [
         "Crown Heights, New York, USA"
      ],
      "Genres": [
         "Jewish rock, alternative rock, post-punk[1]"
      ],
      "Years active": [
         "2011 (2011)– 2016"
      ],
      "Associated acts": [
         "PERL, New Moon All-Stars Party Band, Nehedar"
      ],
      "Website": [
         "bulletproofstockings.com"
      ],
      "Past members": [
         "Perl Wolfe",
         "Dalia Shusterman",
         "Dana Pestun",
         "Elisheva Maister"
      ]
   },
   "albums": [
      "Homeland Call Stomp"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band based in Crown Heights, New York. Formed in [YEAR] by lead singer Perl Wolfe and ex-Hopewell drummer [PERSON_NAME_FULL_0_FEMALE], the group independently released its debut EP, Down to the Top the following year. They were noted for their unique sound among Jewish music, as well as their adherence to the prohibition of kol isha by performing for female-only audiences.\n",
      "In [YEAR], singer-songwriter Perl Wolfe moved from Chicago to Brooklyn's Crown Heights neighborhood. There, she was introduced by a mutual friend to ex-Hopewell drummer [PERSON_NAME_FULL_0_FEMALE], and the two formed [BAND_NAME] in [MONTH] [YEAR].\n",
      "The band independently released their first official recording, Down to the Top EP, on [MONTH] 1, [YEAR].\n"
   ]
}