{
   "Name": "Distant Cousins (U.S. band)",
   "rawData": [
      "Distant Cousins is an American indie pop band from Los Angeles, California. Formed in 2013, the band is composed of Dov Rosenblatt, Duvid Swirsky, and Ami Kozak. Rosenblatt and Swirsky are members of the influential Jewish rock bands Blue Fringe and Moshav. They released their debut self-titled EP on September 16, 2014, followed by a second self-titled EP in 2015. Several of their songs have been featured in film, television, and commercials.\n",
      "Prior to forming Distant Cousins, Dov Rosenblatt was the lead singer of the Jewish rock band Blue Fringe, while Duvid Swirsky was a founding member of the band Moshav. Swirsky, Rosenblatt, and Kozak met in Los Angeles in 2012 while their respective bands were playing a show together. Upon hearing a song Swirsky and Rosenblatt had written, \"When We Love\", Kozak offered to produce it, and the three subsequently began playing together. The name Distant Cousins, a reference to the members' longtime familiarity with each other, was first used when writing a song for the 2013 film Coffee Town.\n",
      "Their debut EP, the self-titled Distant Cousins EP, was released on September 16, 2014.\n"
   ],
   "infobox": {
      "Also known as": [
         "DC"
      ],
      "Origin": [
         "Los Angeles, California, USA"
      ],
      "Genres": [
         "Indie pop"
      ],
      "Years active": [
         "2012 (2012)–present"
      ],
      "Labels": [
         "Family First"
      ],
      "Associated acts": [
         "Blue Fringe, Moshav"
      ],
      "Website": [
         "distantcousinsofficial.com"
      ],
      "Members": [
         "Dov Rosenblatt",
         "Duvid Swirsky",
         "Ami Kozak"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Los Angeles, California. Formed in [YEAR], the band is composed of [PERSON_NAME_FULL_1_MALE], Duvid Swirsky, and [PERSON_NAME_FULL_0_FEMALE]. [PERSON_NAME_LAST_1] and Swirsky are members of the influential Jewish rock bands Blue Fringe and Moshav. They released their debut self-titled EP on [MONTH] 16, [YEAR], followed by a second self-titled EP in [YEAR]. Several of their songs have been featured in film, television, and commercials.\n",
      "Prior to forming [BAND_NAME], [PERSON_NAME_FULL_0_MALE] was the lead singer of the Jewish rock band Blue Fringe, while Duvid Swirsky was a [GENRE] band Moshav. Swirsky, [PERSON_NAME_LAST_0], and Kozak met in Los Angeles in [YEAR] while their respective bands were playing a show together. Upon hearing a song Swirsky and [PERSON_NAME_LAST_0] had written, \"When We Love\", Kozak offered to produce it, and the three subsequently began playing together. The name [BAND_NAME], a reference to the members' longtime familiarity with each other, was first used when writing a song for the [YEAR] film Coffee Town.\n",
      "Their debut EP, the self-titled [BAND_NAME] EP, was released on [MONTH] 16, [YEAR].\n"
   ]
}