{
   "Name": "Blue Fringe",
   "rawData": [
      "Blue Fringe was an American Jewish rock band from New York City. Formed in 2001 by lead singer Dov Rosenblatt, the band's debut album, My Awakening (2003), sold more than 14,000 copies, an uncommon feat in the limited Jewish market, and became a runaway hit. Since then, the band has released two more albums, 70 Faces (2005) and The Whole World Lit Up (2007), and has performed throughout the United States, Canada, Australia, the United Kingdom, Africa, and Israel.  They were credited, along with Moshav and Soulfarm, with advancing Jewish rock in the early 2000s.\n",
      "Blue Fringe was formed in late 2001, after Yeshiva University music and psychology student Dov Rosenblatt, having been invited to perform at a Jewish event at the University of Pennsylvania, assembled three of his classmates as a backup band. Subsequently becoming a full-time band, the group spent the following years touring, performing at venues as diverse as Stern College, B. B. King's Blues Club in Times Square, and the Great Synagogue in Jerusalem. In June 2003, the band released its debut album My Awakening. The album was commercially successful in the Jewish music market and introduced what would become the band's most famous song, \"Flippin' Out\".\n",
      "A second album, 70 Faces, was released on June 5, 2005, followed by a third album, The Whole World Lit Up in February 2007. They performed at Camp Moshava in Indian Orchard, Pennsylvania, an event later recalled by The Current editor emeritus David Fine. In May 2009, the band gave a concert at Columbus Torah Academy during their Lag BaOmer event as a fundraiser for the 2010 March of the Living.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, United States"
      ],
      "Genres": [
         "Jewish rock, pop rock"
      ],
      "Years active": [
         "2001–2012"
      ],
      "Labels": [
         "Sameach, Craig 'N' Co, Rendezvous"
      ],
      "Members": [
         "Dov Rosenblatt",
         "Avi Hoffman",
         "Danny Zwillenberg",
         "Hayyim Danzig"
      ]
   }
}