{
   "Name": "Zusha (band)",
   "rawData": [
      "Zusha is an American Hasidic folk/soul band from Manhattan, New York. They formed in 2013 with lead singer Shlomo Gaisin and guitarist Zachariah Goldschmiedt. The band, named after Zusha of Hanipol, combines traditional Hasidic niggunim with secular styles like jazz, folk, and reggae. Their self-titled debut EP, released on October 28, 2014, reached No. 9 on Billboard's World Albums chart, while their debut full-length album, Kavana (2016), reached No. 2.\n",
      "Zusha was formed in 2013 by Shlomo Gaisin, Zachariah Goldschmiedt, and Elisha Mlotek. All three had prior music backgrounds: Gaisin was the lead singer of the Jewish rock band JudaBlue, Goldschmiedt was the lead singer and producer for the electro-funk band Ch!nch!lla, and Mlotek is the son of Folksbiene director Zalmen Mlotek and grandson of Yiddish musicologist Eleanor Mlotek.\n",
      "Gaisin and Mlotek met at a Chabad house in Bowery, and both were later introduced to Goldschmiedt through a mutual friend. They began rehearsing in friends' apartments, recording their sessions via iPhone, until Dani Bronstein, their current manager and Rabbi Avram Mlotek, Elisha Mlotek's brother, encouraged them to share their music more publicly.\n"
   ],
   "infobox": {
      "Origin": [
         "Manhattan, New York"
      ],
      "Genres": [
         "Jewish rock, folk rock, soul, nigunim"
      ],
      "Years active": [
         "2013–present"
      ],
      "Associated acts": [
         "JudaBlue"
      ],
      "Website": [
         "zusha.com"
      ],
      "Members": [
         "Shlomo Gaisin",
         "Zachariah Goldschmeit"
      ],
      "Past members": [
         "Elisha Mlotek"
      ]
   },
   "albums": [
      "Kavana",
      "A Colorful World",
      "When the Sea Split",
      "Cave of Healing"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Manhattan, New York. They formed in [YEAR] with lead singer [PERSON_NAME_FULL_1_MALE] and guitarist [PERSON_NAME_FULL_0_MALE]. The band, named after [BAND_NAME] of Hanipol, combines traditional Hasidic niggunim with secular styles like jazz, folk, and reggae. Their self-titled debut EP, released on [MONTH] 28, [YEAR], reached No. 9 on Billboard's World Albums chart, while their debut full-length album, Kavana ([YEAR]), reached No. 2.\n",
      "[BAND_NAME] was formed in [YEAR] by [PERSON_NAME_FULL_3_MALE], [PERSON_NAME_FULL_1_MALE], and [PERSON_NAME_FIRST_2] [PERSON_NAME_LAST_0]. All three had prior music backgrounds: [PERSON_NAME_LAST_3] was the lead singer of the Jewish rock band JudaBlue, [PERSON_NAME_LAST_1] was the lead singer and producer for the electro-funk band Ch!nch!lla, and [PERSON_NAME_LAST_0] is the son of Folksbiene director Zalmen [PERSON_NAME_LAST_0] and grandson of Yiddish musicologist [PERSON_NAME_FULL_0_FEMALE].\n",
      "Gaisin and [PERSON_NAME_LAST_1] met at a [GENRE] a mutual friend. They began rehearsing in friends' apartments, recording their sessions via iPhone, until [PERSON_NAME_FULL_0_MALE], their current manager and Rabbi Avram [PERSON_NAME_LAST_1], [PERSON_NAME_FULL_1_MALE]'s brother, encouraged them to share their music more publicly.\n"
   ]
}