{
   "Discography": {},
   "External links": {},
   "History": {
      "Forty Days, hiatus, and recent activity (2010-2014)": {
         "text": [
            "Preceding a year-long hiatus to allow Gaisin and Hoffman to study in Israel, the band recorded their debut EP, Forty Days, in Bethesda, Maryland with producer Taylor Larson of From First to Last. The EP was released on January 1, 2010, and spawned two singles, \"Im Lo Aleh\" and the title track. A release party was held at Café Café in Jerusalem's Mamilla Mall.[2]\n",
            "After Gaisin and Hoffman returned to the U.S. in 2011, the band reunited and released a music video for the single \"Falling\", based on the Biblical story of David and Goliath.[3] The following year, they released another music video called \"Change\".\n",
            "A week after the video's release, Hoffman returned to Israel to serve in the IDF's Givati Brigade.[4] Meanwhile, Gaisin stayed in New York and formed the Hasidic soul band Zusha in 2013. Despite this, they released the song \"Oneness\" in March and performed at Yeshiva University's annual Hanukkah concert alongside Alex Clare.[5]\n",
            "In 2014, with Hoffman back in New York, he and Gaisin announced on Facebook that they had begun writing new songs together.[6] Later in the year, they released two acoustic songs, \"All You Got\" and \"Give Love\".\n",
            "As of 2020, Gaisin is performing full-time with Zusha while Hoffman started a solo career under the name Jeryko.[7]\n"
         ]
      },
      "Origins (2004-2010)": {
         "text": [
            "Founding members Shlomo Gaisin and Yaniv Hoffman met while they were in seventh grade at Melvin J. Berman Hebrew Academy and began playing together in 2004. They added additional members in 2006 and began \"playing seriously\" in 2007, according to Hoffman.[1]\n",
            "They were the winning group at the 2009 Five Towns Battle of the Bands. That same year, they opened for Moshav Band at \"Mexicali Live\" in Teaneck, New Jersey and performed at Congregation Ramath Orah's \"Roc House\" event.[2]\n"
         ]
      }
   },
   "Members": {},
   "Musical style": {
      "text": [
         "JudaBlue's music combined elements of rock, jazz, funk, and soul, while the lyrics often incorporated traditional Hebrew prayers with thematically-related English verses.[1]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Origins (2004-2010)",
      "1.2 Forty Days, hiatus, and recent activity (2010-2014)",
      "2 Musical style",
      "3 Members",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "JudaBlue was an American Jewish rock band from Silver Spring, Maryland. Formed in 2004 by lead singer Shlomo Gaisin and guitarist Yaniv Hoffman, the band released an EP, Forty Days, in 2010.\n"
      ]
   },
   "Title": "JudaBlue - Wikipedia"
}