{
   "Name": "Beyond the Pale (band)",
   "rawData": [
      "Beyond the Pale is a Toronto-based Canadian world/roots fusion band. Their style is rooted in klezmer,  Balkan and Romanian music but heavily accented with contemporary and North American styles including bluegrass, jazz, reggae, funk and classical chamber music. They are known for unique songcraft, virtuosic musicianship, meticulous dynamics, and exuberant live performances. They are widely regarded as one of Canada's most accomplished and innovative acoustic ensembles. Some have described their sound as being in the same spirit as \"New Acoustic Music\" and David Grisman's \"Dawg\" music, but tinged more heavily with an east European accent. The name of the band is a reference to the Eastern-European Jewish Pale of Settlement, from where their music is partially inspired.\n",
      "Beyond the Pale was formed in 1998. Original members included mandolinist Eric Stein, bassist Bret Higgins and guitarist Joshua Engel. They were joined by violinist Anne Lindsay the following year. Dutch Clarinetist Martin van de Ven joined the group in 2000 while Engel left the same year. Serbian-born violinist Bogdan Djukic gradually replaced Lindsay over 2000-2001.\n",
      "The band released its first CD, Routes, in 2001 through Borealis Records; the recording was nominated for a Canadian Independent Music Award.\n"
   ],
   "infobox": {
      "Origin": [
         "Toronto, Ontario, Canada"
      ],
      "Genres": [
         "Klezmer, Balkan, Romanian, bluegrass, jazz, reggae, funk"
      ],
      "Years active": [
         "1998 (1998)–present"
      ],
      "Labels": [
         "Borealis"
      ],
      "Website": [
         "www.beyondthepale.net"
      ],
      "Members": [
         "Eric Stein",
         "Martin van de Ven",
         "Milos Popovic",
         "Bogdan Djukic",
         "Aleksandar Gajic",
         "Bret Higgins"
      ],
      "Past members": [
         "Anne Lindsay",
         "Sasha Luminsky",
         "Joshua Engel"
      ]
   }
}