{
   "Name": "Beyond the Pale (band)",
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Beyond the Pale is a Toronto-based Canadian world/roots fusion band. Their style is rooted in klezmer,[1]  Balkan and Romanian music but heavily accented with contemporary and North American styles including bluegrass, jazz, reggae, funk and classical chamber music. They are known for unique songcraft, virtuosic musicianship, meticulous dynamics, and exuberant live performances. They are widely regarded as one of Canada's most accomplished and innovative acoustic ensembles. Some have described their sound as being in the same spirit as \"New Acoustic Music\" and David Grisman's \"Dawg\" music, but tinged more heavily with an east European accent.[2][3] The name of the band is a reference to the Eastern-European Jewish Pale of Settlement, from where their music is partially inspired.[4]\n"
      ]
   },
   "History": {
      "text": [
         "Beyond the Pale was formed in 1998. Original members included mandolinist Eric Stein, bassist Bret Higgins and guitarist Joshua Engel. They were joined by violinist Anne Lindsay the following year.[5] Dutch Clarinetist Martin van de Ven joined the group in 2000 while Engel left the same year. Serbian-born violinist Bogdan Djukic gradually replaced Lindsay over 2000-2001.[6]\n",
         "The band released its first CD, Routes, in 2001 through Borealis Records;[7][8] the recording was nominated for a Canadian Independent Music Award.\n",
         "In 2002, Serbian-born accordionist Milos Popovic joined the group, replacing Sasha Luminsky, who had played with the group the previous two years. A second album, Consensus, was recorded live at the Al Green Theatre in Toronto in 2003 and released the following year.[9][3] This album received great acclaim and captured a Canadian Folk Music Award for \"Instrumental Group of the Year.\"[10]  \"Consensus\" was also nominated for a Toronto Independent Music Award, and Eric Stein's composition \"Reunion\" from that album won the Ontario Council of Folk Festivals Songwriting Competition for Instrumental composition. In fall 2004, the group was joined by Serbian-born violinist Aleksandar Gajic.\n",
         "Between 2001-2010, Beyond the Pale toured across North America and Europe, including performances at Carnegie Hall, the Jewish Culture Festival in Kraków Poland, and the Governor General's Performing Arts Awards at the National Arts Centre in Ottawa.[11] During this period the band was involved in many unique and challenging collaborative projects, including: a series of concerts with legendary singer/actor Theodore Bikel; numerous collaborations with Josh \"Socalled\" Dolgin; two separate stints as guest accompanists with the Toronto Jewish Folk Choir on world premieres of ambitious choral works; guest soloist turns with the Toronto Children's Chorus on a world premiere composition by clarinetist van de Ven; featured soloist performances alongside CBC radio personality Barbara Budd with the National Arts Centre Orchestra, Toronto Philharmonia and Kitchener-Waterloo Symphony; self-initiated collaborations with other esteemed world music ensembles, such as Creaking Tree String Quartet and L'Orchestra di Piazza Vittorio. The group was also featured in a number of national radio broadcasts for CBC's \"Canada Live,\" including as part of a world premiere CBC commission honouring the 250th birthday of W.A. Mozart, in which the group developed exciting new reinterpretations of the great composer's work.\n",
         "In 2009, the group released its third album \"Postcards\", also through Borealis Records, continuing their tradition of fusing genres and incorporating a variety of influences. The album featured guest vocal appearances by Israeli Yiddish singer Vira Lozinsky[2][12] \"Postcards\" received four nominations from the 2010 Canadian Folk Music Awards and won for \"Instrumental Ensemble of the Year\" and \"Pushing the Boundaries\". In 2011, the group toured in Australia, and in Brazil in 2012.[13][11]\n",
         "Past collaborations have included the singers, Josh \"Socalled\" Dolgin, Vira Lozinsky, Yeva Medevedyuk and Dave Wall on recordings as well as performances with Theodore Bikel at Carnegie Hall in New York and the Kraków Jewish Culture Festival in Poland.\n",
         "In 2017 Beyond the Pale released a new album, \"Ruckus\", on Borealis Records, and received two nominations from the Canadian Folk Music Awards for Instrumental Ensemble of the Year and World Music Group of the Year.[10]\n"
      ]
   },
   "Members": {},
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Beyond the Pale is a Toronto-based Canadian world/roots fusion band. Their style is rooted in klezmer,[1]  Balkan and Romanian music but heavily accented with contemporary and North American styles including bluegrass, jazz, reggae, funk and classical chamber music. They are known for unique songcraft, virtuosic musicianship, meticulous dynamics, and exuberant live performances. They are widely regarded as one of Canada's most accomplished and innovative acoustic ensembles. Some have described their sound as being in the same spirit as \"New Acoustic Music\" and David Grisman's \"Dawg\" music, but tinged more heavily with an east European accent.[2][3] The name of the band is a reference to the Eastern-European Jewish Pale of Settlement, from where their music is partially inspired.[4]\n",
      "Beyond the Pale was formed in 1998. Original members included mandolinist Eric Stein, bassist Bret Higgins and guitarist Joshua Engel. They were joined by violinist Anne Lindsay the following year.[5] Dutch Clarinetist Martin van de Ven joined the group in 2000 while Engel left the same year. Serbian-born violinist Bogdan Djukic gradually replaced Lindsay over 2000-2001.[6]\n",
      "The band released its first CD, Routes, in 2001 through Borealis Records;[7][8] the recording was nominated for a Canadian Independent Music Award.\n",
      "In 2002, Serbian-born accordionist Milos Popovic joined the group, replacing Sasha Luminsky, who had played with the group the previous two years. A second album, Consensus, was recorded live at the Al Green Theatre in Toronto in 2003 and released the following year.[9][3] This album received great acclaim and captured a Canadian Folk Music Award for \"Instrumental Group of the Year.\"[10]  \"Consensus\" was also nominated for a Toronto Independent Music Award, and Eric Stein's composition \"Reunion\" from that album won the Ontario Council of Folk Festivals Songwriting Competition for Instrumental composition. In fall 2004, the group was joined by Serbian-born violinist Aleksandar Gajic.\n"
   ]
}