{
   "Name": "Kabalas",
   "rawData": [
      "The Kabalas were a four-piece band out of the Quad Cities area of the American Mid-West whose musical foundations were based firmly in a traditional Eastern European Klezmer style that mixed in Jewish folksongs, Israeli popular songs, Polka and popular music.  The members of the band were Scott Morschhauser (vocals, accordion, guitar, percussion); Barry \"The Wolfman\" Wolf (accordion); \"Nervous\" Neal Smith (saxophones, backup vocals, flute, clarinet); and the late \"Mr.\" Joel Dick (drums, percussion). On stage, their performance was a blend of vaudeville antics and great musicianship.  Their traditional closing song was \"Hey Lordy Mambo\" where the drummer would play with four sticks and set them on fire.\n",
      "Oil Magazine named them the best alternative band in 1995 and they came to national attention when they played the prestigious South By Southwest Music Conference in Austin, Texas in 1996. That same year they were signed to California-based Dionysus Records which re-released their first recording \"Martinis and Bagels\" from 1994. The Kabalas went on to release two more CDs on Dionysus, The Eye of Zohar in 1997 and Time Tunnel in 1999. The Kabalas also appeared on several compilation CDs.  They toured nationally from 1994 through 1999 and performed for the last time December 31, 1999.\n"
   ],
   "infobox": {},
   "prunedData": [
      "The [BAND_NAME] were a [GENRE] band out of the Quad Cities area of the American Mid-West whose musical foundations were based firmly in a traditional Eastern European Klezmer style that mixed in Jewish folksongs, Israeli popular songs, Polka and popular music.  The members of the band were Scott Morschhauser (vocals, accordion, guitar, percussion); Barry \"The Wolfman\" Wolf (accordion); \"Nervous\" [PERSON_NAME_FULL_0_MALE] (saxophones, backup vocals, flute, clarinet); and the late \"Mr.\" Joel Dick (drums, percussion). On stage, their performance was a blend of vaudeville antics and great musicianship.  Their traditional closing song was \"Hey Lordy Mambo\" where the drummer would play with four sticks and set them on fire.\n",
      "Oil Magazine named them the best alternative band in [YEAR] and they came to national attention when they played the prestigious South By Southwest Music Conference in Austin, Texas in [YEAR]. That same year they were signed to California-based Dionysus Records which re-released their first recording \"[MONTH]tinis and Bagels\" from [YEAR]. The [BAND_NAME] went on to release two more CDs on Dionysus, The Eye of Zohar in [YEAR] and Time Tunnel in [YEAR]. The [BAND_NAME] also appeared on several compilation CDs.  They toured nationally from [YEAR] through [YEAR] and performed for the last time [MONTH] 31, [YEAR].\n"
   ]
}