{
   "Name": "Kharkov Klezmer Band",
   "rawData": [
      "The Kharkov Klezmer Band (Харьков Клезмер Бенд), also known as the Kharkiv Klezmer Band (Харків Клезмер Бенд), is a klezmer band  from Kharkiv, Ukraine.\n",
      "The band was founded in 1999 (in a country in which, as part of the Soviet Union, the performance of traditional Jewish music seemed effectively forbidden from the 1930s under Joseph Stalin until the early 1990s), under the leadership of Stanislav Raiko (Станіслав Райко), and comprises a group of conservatory-educated musicians.\n",
      "According to the \"Cradle of Klezmer\" website, dedicated exclusively to Klezmer music, it is one of the most successful klezmer bands not only in Ukraine, but also throughout the countries comprising the former Soviet Union. The ensemble won the Best Klezmer Music Band award at the First Regional Jewish Cultural Festival in Kharkiv in June 2000, and was named the Best Klezmer Band at the Jewish Cultural Festival in Kiev, also in June of the same year. They were awarded the Best Klezmer Band award at the 4th All-Ukrainian Jewish Arts Festival \"Shalom Ukraïna\" in November 2000.\n"
   ],
   "infobox": {},
   "prunedData": [
      "The [BAND_NAME] (Харьков Клезмер Бенд), also known as the Kharkiv Klezmer Band (Харків Клезмер Бенд), is a [GENRE] band  from Kharkiv, Ukraine.\n",
      "The band was founded in [YEAR] (in a country in which, as part of the Soviet Union, the performance of traditional Jewish music seemed effectively forbidden from the [YEAR]s under Joseph Stalin until the early [YEAR]s), under the leadership of [PERSON_NAME_FULL_0_MALE] (Станіслав Райко), and comprises a group of conservatory-educated musicians.\n",
      "According to the \"Cradle of Klezmer\" website, dedicated exclusively to Klezmer music, it is one of the most successful klezmer bands not only in Ukraine, but also throughout the countries comprising the former Soviet Union. The ensemble won the Best Klezmer Music Band award at the First Regional Jewish Cultural Festival in Kharkiv in [MONTH] [YEAR], and was named the Best Klezmer Band at the Jewish Cultural Festival in Kiev, also in [MONTH] of the same year. They were awarded the Best Klezmer Band award at the 4th All-Ukrainian Jewish Arts Festival \"[PERSON_NAME_FULL_0_MALE]\" in [MONTH] [YEAR].\n"
   ]
}