{
   "Name": "Kolsimcha – The World Quintet",
   "rawData": [
      "Kolsimcha – The World Quintet is a Swiss klezmer band.\n",
      "The band was founded in 1986 under the name Kol Simcha in Switzerland as a duo with Josef Bollag and David Klein. Their main interest being focused on the musical genre Klezmer, they played at weddings until their success grew and they started giving concerts. The name Kol Simcha (Kol: voice, Simcha: feast, joy) is taken from a blessing spoken at Jewish weddings and means literally \"the voice of joy\". This English translation is also the name of their own production company and record label (VOJ).\n",
      "Over the years the band grew to its current line up of five musicians - Michael Heitzler (clarinet), Olivier Truan (piano), Ariel Zuckermann (flute, previously Roman Glaser and Niki Reiser), Daniel Fricker (double bass), and Christoph Staudenmann (drums, previously Fabian Kuratli (deceased) and David Klein).\nThe band has toured extensively literally all over the world, playing countless concerts, recording several CDs and doing live appearances on radio stations such as BBC.\n"
   ],
   "infobox": {},
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band.\n",
      "The band was founded in [YEAR] under the name Kol Simcha in Switzerland as a duo with [PERSON_NAME_FULL_0_MALE] and David Klein. Their main interest being focused on the musical genre Klezmer, they played at weddings until their success grew and they started giving concerts. The name Kol Simcha (Kol: voice, Simcha: feast, joy) is taken from a blessing spoken at Jewish weddings and means literally [SONG_NAME]. This English translation is also the name of their own production company and record label (VOJ).\n",
      "Over the years the band grew to its current line up of five musicians - Michael Heitzler (clarinet), [PERSON_NAME_FULL_4_MALE] (piano), [PERSON_NAME_FULL_3_MALE] (flute, previously Roman Glaser and [PERSON_NAME_FULL_1_FEMALE]), Daniel Fricker (double bass), and [PERSON_NAME_FULL_0_MALE] (drums, previously Fabian Kuratli (deceased) and [PERSON_NAME_FULL_2_MALE]).\nThe band has toured extensively literally all over the world, playing countless concerts, recording several CDs and doing live appearances on radio stations such as BBC.\n"
   ]
}