{
   "Name": "Mames Babegenush",
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Mames Babegenush is a Danish Klezmer band formed in 2004 in Copenhagen.  Mames Babegenush is the East meeting the North. Strong Scandinavian roots merging with the vibrant dance music of Eastern Europe. From the great ambience of Nordic pine trees to lively weddings in Romania the music of Mames Babegenush gives a sense of both melancholy and ecstatic joy. In the beginning doing quite traditional klezmer music—with inspiration from artists such as Naftule Brandwein, Abe Schwartz and Dave Tarras—but has increasingly developed their own sound.\n",
         "The name means \"Mom's aubergine salad\" (baba ghanoush) in Yiddish.\n"
      ]
   },
   "History": {
      "text": [
         "Mames Babegenush was founded in 2004 by a group of friends with an ambition to reform the world music and klezmer scene in Denmark.[1] In the beginning they mainly played at Jewish weddings, bar mitzvahs and other celebrations in Copenhagen. They soon introduced a concept they called klezmer attack, spontaneous, unannounced concerts for unknowing audiences in public spaces, like cafés, parks, bars, or private celebrations. The band increasingly contributed to the world music scene in Denmark, enjoying great underground success within the first two years of the group's existence. The group has since performed all over Denmark, Europe, the US and Argentina, in Copenhagen ex VEGA, Global Cph, Copenhagen Jazzhouse, Stengade 30, Pumpehuset, the Royal Danish Theatre, both Old Stage and the Opera's main stage and TIVOLI, and abroad ex. Carnegie Hall (NYC), Paradiso (Amsterdam), Wiener Metropol (Vienna) and the Teatro Independencia (Mendoza), and festivals like NYC Gypsy Festival, Lotus Festival (Bloomington), Chicago World Music Festival, Roskilde Festival, Bergen International Festival and Festival Classique (Haag).\nIn 2007 the band began to get noticed more widely in Denmark, starting to perform at more established venues and smaller festivals. \n",
         "2008 the group was invited to participate in a workshop in New York City conducted by David Krakauer. As part of the workshop they played at the David Krakauer Young Artists Concert in Carnegie Hall.\nThe band returned to the city later that year, after they were invited to perform at the New York Gypsy Festival,[2] during which stay they also featured as resident band at the legendary Mehanata Bulgarian Bar,[3] performing a total of 15 concerts on the 16 day tour.\n",
         "2009 saw Mames Babegenush release their first album, Klezmer Killed The Radiostar. They also performed a concert in the auditorium of the Ny Carlsberg Glyptotek,[4] a venue otherwise mainly used for classical concerts. They also performed at the biggest Danish showcase festival, SPOT in Aarhus, supported American band Gogol Bordello at VEGA, played the closing concert of Copenhagen Jazzfestival (at Cph Jazzhouse) and had several international tours, both back to New York City and 3 weeks around Argentina.\n",
         "In 2010 Mames Babegenush played a long range of concerts in the DK and around Europe: Bucharest (yiddersher velt[5]), Berlin (POPKOMM[6]), Vienna (KlezMore[7]) and Amsterdam (IJMF[8]). The IJMF, an international music competition with 24 bands, ended up as a big success, as Mames ended up as the band with the most awards: Bookers Prize, Special Jury Prize (award for the biggest contribution to musical and cultural bridge building) and The Audience Prize, audience favorite band.\n",
         "2011 saw the band's second album, My Heart Aches When Angels Dance. Live performances included a showcase for the world music fair WOMEX as well as Germanys biggest Klezmer Festival in Fürth, punk venue TreibsAND in Lübeck, Bonnefooi in Brussels, both the prestigious Concertgebouw and legendary Paradiso in Amsterdam and the Wiener Metropol in Vienna for the '11 edition of the KlezMore Festival.\n2012 includes concerts at The Danish Royal Theatre's Old Stage and several shows for the Copenhagen Opera Festival, where Nicolai Kornerup from the band re-arranged passages of operas of ex Wagner, Puccini and Strauss for the band, performing them with a long line of opera singers, including Gitta-Maria Sjöberg and Idil Alpsoy.  \nIn November 2012, Mames Babegenush released their 3rd album, Full Moons and Pay Days [Remixes And Originals], and album where the band collaborated with a long line of electronic producers, djs and singers. Remixes by ex. Reggae/dancehall producer Pharfar, Serbian DJ-duo Shazalakazoo, British DJ Max Pashm and Danish HessIsMore. \nConcerts worth mentioning from 2013 includes a headliner show at legendary Amsterdam venue Paradiso as well as starting an annual tradition going forward with a summer concert at Christianshavn Bådudlejning, performing in the middle of one of Copenhagen's old canals.\n",
         "Highlights of 2014 includes the release of the album no. 4, entitled simply Mames Babegenush, a studio album featurering guests like harpist Tine Rehling, Nordic string quartet LiveStrings, led by Norwegian cellist Live Johansson, percussionist Lasse Herbst and The Children’s Choir of Goldschmidt’s Academy, a choir of Jewish, Muslim and Christian children. A special remix was released prior to the full album, a remix by Trentemöller. Cover art was a painting by artist Tal R. The album received positive international reviews from ex AllAboutJazz.com (4,5 out of 5), Songlines (5 out of 6) and fRoots (text, no star rating system).\n",
         "The band's most recent album, Mames Babegenush With Strings from 2017, was warmly received with 5-6 stars reviews in such magazines as Songlines and fRoots [9] as well as winning 'Folk Album of the year' awarded by the Danish Publishers. The full-length album features the talented string quartet LiveStrings, led by Norwegian cellist Live Johansson, recorded in Copenhagen in front of a live studio audience. The album invites the listener into a universe of authentic eastern European folk music interpreted through Nordic soundscapes. Mames Babegenush with Strings was released on vinyl by German label Galileo Music.\n",
         "Quotes\n",
         "“Mames Babegenush forges an organic sound with the momentum of life. The band pushes the perimeter of klezmer to incorporate many cultures, all fragrant with fecund growth and potential. This is joyous music even when it is not”\n– C. Michael Bailey, AllAboutJazz.com (4.5 of 5)\n",
         "\"The roaring sextet Mames Babegenush has defined a very organized creative space, in which “Nordic atmospheres” are layered with passion for Eastern European melodies. When listening to the rich and articulated album you hear six musician’s passion, but also their unity and solid competences… The band can build anything on its elements, without hesitating on traditional parts and projecting a flow in new non-dogmatic directions.\"\n",
         "- Daniele Cestellini, Blogfoolk\n",
         "\"This truly is high-end klezmer, which accurately locates the beating heart of the tradition while simultaneously transcending it with inflections from other genres. While the band have one foot firmly in the past, the other is thrust fervently into the future \"\n– Tom Nevell, Songlines (5 of 6)\n",
         "Honed across many years of recordings and blistering live shows, the resultant assurance and confidence – in playing and composition – is in full flower... this is the sound of a new Nordic authenticity and milieu. Severe and painstaking beauty. \n– John Pheby, fROOTS (no star rating system)\n",
         "\"Mames Babegenush has hit upon a winning combination of artistry and originality while simultaneously being faithful to the tradition and pushing the genre forward\"\n– Keith Wolzinger, KlezmerPodcast.com (no star rating system)\n"
      ]
   },
   "Members": {
      "text": [
         "\nPast members: \n"
      ]
   },
   "Discography": {
      "text": [
         "Calibrated Music / 2009\n",
         "Gateway Music / 2011\n",
         "Gateway Music / 2012\n",
         "Math Records / 2014\n",
         "Galileo Records / 2017\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Mames Babegenush is a Danish Klezmer band formed in 2004 in Copenhagen.  Mames Babegenush is the East meeting the North. Strong Scandinavian roots merging with the vibrant dance music of Eastern Europe. From the great ambience of Nordic pine trees to lively weddings in Romania the music of Mames Babegenush gives a sense of both melancholy and ecstatic joy. In the beginning doing quite traditional klezmer music—with inspiration from artists such as Naftule Brandwein, Abe Schwartz and Dave Tarras—but has increasingly developed their own sound.\n",
      "The name means \"Mom's aubergine salad\" (baba ghanoush) in Yiddish.\n",
      "Mames Babegenush was founded in 2004 by a group of friends with an ambition to reform the world music and klezmer scene in Denmark.[1] In the beginning they mainly played at Jewish weddings, bar mitzvahs and other celebrations in Copenhagen. They soon introduced a concept they called klezmer attack, spontaneous, unannounced concerts for unknowing audiences in public spaces, like cafés, parks, bars, or private celebrations. The band increasingly contributed to the world music scene in Denmark, enjoying great underground success within the first two years of the group's existence. The group has since performed all over Denmark, Europe, the US and Argentina, in Copenhagen ex VEGA, Global Cph, Copenhagen Jazzhouse, Stengade 30, Pumpehuset, the Royal Danish Theatre, both Old Stage and the Opera's main stage and TIVOLI, and abroad ex. Carnegie Hall (NYC), Paradiso (Amsterdam), Wiener Metropol (Vienna) and the Teatro Independencia (Mendoza), and festivals like NYC Gypsy Festival, Lotus Festival (Bloomington), Chicago World Music Festival, Roskilde Festival, Bergen International Festival and Festival Classique (Haag).\nIn 2007 the band began to get noticed more widely in Denmark, starting to perform at more established venues and smaller festivals. \n",
      "2008 the group was invited to participate in a workshop in New York City conducted by David Krakauer. As part of the workshop they played at the David Krakauer Young Artists Concert in Carnegie Hall.\nThe band returned to the city later that year, after they were invited to perform at the New York Gypsy Festival,[2] during which stay they also featured as resident band at the legendary Mehanata Bulgarian Bar,[3] performing a total of 15 concerts on the 16 day tour.\n"
   ]
}