{
   "Name": "Metropolitan Klezmer",
   "Sections": [
      "Summary"
   ],
   "Summary": {
      "text": [
         "Metropolitan Klezmer is a New York band that was established in 1994.[1][2]\nWhile clearly a Klezmer band, Metropolitan Klezmer takes an eclectic approach to Yiddish musical genres from around the globe.\n",
         "Songlines magazine calls them \"One of the finest American klezmer bands\".[3]\n",
         "The band was formed by drummer (and Yiddish film scholar) Eve Sicular with Ismail Butera (accordion), Michael Hess (violin, ney flutes, kanun zither), Dave Hofstra (bass and tuba), and klezmer legend Howie Leess (1920-2003) (clarinet & tenor sax).\nThe group expanded to include vocalist Deborah Karpel and a dynamic horn section: Debra Kreisberg (clarinet/alto sax), Pam Fleming (trumpet/fluegelhorn), and Rick Faulkner (trombone).\n",
         "Individually, Metropolitan Klezmer players have worked with such diverse artists as Bonnie Raitt, The Toasters, Bill Frisell, Toshi Reagon, Juan Carlos Formell, Indigo Girls, Burning Spear, Amy Sedaris, Max Roach, Rufus Wainwright, Nora York, and the Microscopic Septet, as well as Jewish music performers from the Klezmatics and Andy Statman to David Krakauer, Sephardic stars Alhambra and SF's Charming Hostess.\n",
         "The band's CDs have enjoyed positive reviews, awards, and worldwide airplay.[citation needed] Their array of songs includes wedding dances, folk tunes, modal slapstick, odd meter Hanuka fare, postwar Yiddish poetry, Turkish- and Arabic-tinged klezmer traditionals, Hungarian Jewish prayer melody, labor protest hymn, Second Avenue swing classics, vintage Yiddish film soundtrack tangos, love ballads, and originals.  They mix modern and traditional instruments and arrangements.\n"
      ]
   },
   "coreData": [
      "Metropolitan Klezmer is a New York band that was established in 1994.[1][2]\nWhile clearly a Klezmer band, Metropolitan Klezmer takes an eclectic approach to Yiddish musical genres from around the globe.\n",
      "Songlines magazine calls them \"One of the finest American klezmer bands\".[3]\n",
      "The band was formed by drummer (and Yiddish film scholar) Eve Sicular with Ismail Butera (accordion), Michael Hess (violin, ney flutes, kanun zither), Dave Hofstra (bass and tuba), and klezmer legend Howie Leess (1920-2003) (clarinet & tenor sax).\nThe group expanded to include vocalist Deborah Karpel and a dynamic horn section: Debra Kreisberg (clarinet/alto sax), Pam Fleming (trumpet/fluegelhorn), and Rick Faulkner (trombone).\n",
      "Individually, Metropolitan Klezmer players have worked with such diverse artists as Bonnie Raitt, The Toasters, Bill Frisell, Toshi Reagon, Juan Carlos Formell, Indigo Girls, Burning Spear, Amy Sedaris, Max Roach, Rufus Wainwright, Nora York, and the Microscopic Septet, as well as Jewish music performers from the Klezmatics and Andy Statman to David Krakauer, Sephardic stars Alhambra and SF's Charming Hostess.\n"
   ]
}