{
   "Name": "The Fluid",
   "rawData": [
      "The Fluid was an American rock band from Denver which formed in 1985, disbanded in 1993, but reconvened in 2008. The group cited the Rolling Stones and MC5 as inspirations for their sound, and was the first group based outside the Pacific Northwest to sign with influential Seattle label Sub Pop.\n",
      "The Fluid was originally called Madhouse. After early 1980s Denver punk band Frantix broke up, bassist Matt Bischoff, drummer Garrett Shavlik and guitarist James Clower began playing as Madhouse. On July 5, 1985, with new band members Rick Kulwicki (guitar) and John Robinson (vocals), they played their first gig at the German House (Denver Turnverein) as \"The Fluid\". That was the only name all five members could agree upon.\n",
      "In 1986 the Fluid released their first album, Punch N Judy on Rayon Records. The album was also licensed to and released by the German label Glitterhouse. They toured for the next two years in support of the album. \n"
   ],
   "infobox": {
      "Also known as": [
         "Madhouse"
      ],
      "Origin": [
         "Denver, Colorado, U.S."
      ],
      "Genres": [
         "Garage rock, punk rock"
      ],
      "Years active": [
         "1985–1993, 2008"
      ],
      "Labels": [
         "Rayon",
         "Sub Pop",
         "Glitterhouse",
         "Hollywood"
      ],
      "Associated acts": [
         "Nirvana",
         "Frantix",
         "Spell",
         "'57 Lesbian"
      ],
      "Website": [
         "Sub Pop: The Fluid"
      ],
      "Past members": [
         "John Robinson",
         "Matt Bischoff",
         "James Clower",
         "Rick Kulwicki",
         "Garrett Shavlik"
      ]
   },
   "albums": [
      "Punch N Judy",
      "Clear Black Paper",
      "Roadmouth",
      "Purplemetalflakemusic"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Denver which formed in [YEAR], disbanded in [YEAR], but reconvened in [YEAR]. The group cited the Rolling Stones and MC5 as inspirations for their sound, and was the first group based outside the Pacific Northwest to sign with influential Seattle label Sub Pop.\n",
      "[BAND_NAME] was originally called Madhouse. After early [YEAR]s [PERSON_NAME_FIRST_0] punk band Frantix broke up, bassist Matt Bischoff, drummer [PERSON_NAME_FULL_1_MALE] and guitarist James Clower began playing as Madhouse. On [MONTH] 5, [YEAR], with new band members [PERSON_NAME_FULL_2_MALE] (guitar) and John Robinson (vocals), they played their first gig at the German House ([PERSON_NAME_FULL_0_MALE]) as [SONG_NAME]. That was the only name all five members could agree upon.\n",
      "In [YEAR] the Fluid released their first album, Punch N Judy on Rayon Records. The album was also licensed to and released by the German label Glitterhouse. They toured for the next two years in support of the album. \n"
   ]
}