{
   "Name": "The Fluid",
   "Sections": [
      "1 History",
      "2 After The Fluid",
      "3 Reunion",
      "4 Members",
      "5 Discography",
      "5.1 Albums",
      "5.2 EPs",
      "5.3 Singles",
      "5.4 Compilations",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "The Fluid was an American rock band from Denver which formed in 1985, disbanded in 1993, but reconvened in 2008. The group cited the Rolling Stones and MC5 as inspirations for their sound, and was the first group based outside the Pacific Northwest to sign with influential Seattle label Sub Pop.[1]\n"
      ]
   },
   "History": {
      "text": [
         "The Fluid was originally called Madhouse. After early 1980s Denver punk band Frantix broke up, bassist Matt Bischoff, drummer Garrett Shavlik and guitarist James Clower began playing as Madhouse. On July 5, 1985, with new band members Rick Kulwicki (guitar) and John Robinson (vocals), they played their first gig at the German House (Denver Turnverein) as \"The Fluid\".[2] That was the only name all five members could agree upon.[citation needed]\n",
         "In 1986 the Fluid released their first album, Punch N Judy on Rayon Records. The album was also licensed to and released by the German label Glitterhouse. They toured for the next two years in support of the album. \n",
         "In 1988, they released the album Clear Black Paper on Sub Pop. They were the first non-Seattle band to sign to the record label. According to Mark Arm, Glitterhouse and Sub Pop had formed an agreement. Glitterhouse wanted to release a Green River record in Germany, and the labels did a swap: Green River for the Fluid. In the same oral history, Greg Prato's Grunge Is Dead, musician Rod Moody said that the Fluid sounded like no other band on the Sub Pop roster.[3]\n",
         "The Fluid's second Sub Pop release was Roadmouth (1989), produced by Jack Endino. Writing for Trouser Press, critic Ira Robbins described it as \"geometrically more intense.\"[4]\n",
         "The band followed up in 1990 with the six-song EP Glue, produced by Butch Vig. Robbins called it \"a buzzing punky blitz.\"[4]\n",
         "The Fluid then signed to Hollywood Records, putting out Purplemetalflakemusic in 1992. As a 2008 article from Denver's Westword put it, however, the band and label clashed frequently, the contract \"turned out to be far less than advertised, [and] the band imploded in late 1993.\"[1]\n"
      ]
   },
   "After The Fluid": {
      "text": [
         "After the Fluid broke up, drummer Garrett Shavlik started the band Spell (not Boyd Rice's band of the same name), which was signed for a time to Island Records.[5]\n",
         "Bassist Matt Bischoff started the band '57 Lesbian.[6]\n",
         "John Robinson talked with Kurt Cobain of Nirvana about doing an album along with Mark Lanegan of Screaming Trees. Unfortunately, Cobain's death ended that possibility. Robinson joined Jim Wallerstein (a.k.a. Jim Walters) of Das Damen in New United Monster Show, which lasted until 1999.[1]\n"
      ]
   },
   "Reunion": {
      "text": [
         "The Fluid reunited to perform at Sub-Pop Records 20th Anniversary at Redmond's Marymoor Park in Seattle in July 2008. This was preceded by a June 20 show at the Bluebird Theater in Denver. A series of dates in Hoboken, Brooklyn, and Seattle followed in 2009, but after that the Fluid disbanded again.[7]\n",
         "Their guitarist, Rick Kulwicki, died on February 15, 2011, at the age of 49. In March 2011 and again in January 2012, the Fluid took part in fundraiser shows for Kulwicki's twin sons. The headline act in 2012 was Mudhoney.[7][8]\n"
      ]
   },
   "Members": {},
   "Discography": {
      "Albums": {},
      "EPs": {},
      "Singles": {},
      "Compilations": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Fluid was an American rock band from Denver which formed in 1985, disbanded in 1993, but reconvened in 2008. The group cited the Rolling Stones and MC5 as inspirations for their sound, and was the first group based outside the Pacific Northwest to sign with influential Seattle label Sub Pop.[1]\n",
      "The Fluid was originally called Madhouse. After early 1980s Denver punk band Frantix broke up, bassist Matt Bischoff, drummer Garrett Shavlik and guitarist James Clower began playing as Madhouse. On July 5, 1985, with new band members Rick Kulwicki (guitar) and John Robinson (vocals), they played their first gig at the German House (Denver Turnverein) as \"The Fluid\".[2] That was the only name all five members could agree upon.[citation needed]\n",
      "In 1986 the Fluid released their first album, Punch N Judy on Rayon Records. The album was also licensed to and released by the German label Glitterhouse. They toured for the next two years in support of the album. \n",
      "In 1988, they released the album Clear Black Paper on Sub Pop. They were the first non-Seattle band to sign to the record label. According to Mark Arm, Glitterhouse and Sub Pop had formed an agreement. Glitterhouse wanted to release a Green River record in Germany, and the labels did a swap: Green River for the Fluid. In the same oral history, Greg Prato's Grunge Is Dead, musician Rod Moody said that the Fluid sounded like no other band on the Sub Pop roster.[3]\n"
   ],
   "infobox": {
      "Also known as": [
         "Madhouse"
      ],
      "Origin": [
         "Denver, Colorado, U.S."
      ],
      "Genres": [
         "Garage rock, punk rock"
      ],
      "Years active": [
         "1985–1993, 2008"
      ],
      "Labels": [
         "Rayon",
         "Sub Pop",
         "Glitterhouse",
         "Hollywood"
      ],
      "Associated acts": [
         "Nirvana",
         "Frantix",
         "Spell",
         "'57 Lesbian"
      ],
      "Website": [
         "Sub Pop: The Fluid"
      ],
      "Past members": [
         "John Robinson",
         "Matt Bischoff",
         "James Clower",
         "Rick Kulwicki",
         "Garrett Shavlik"
      ]
   }
}