{
   "Name": "Translator (band)",
   "rawData": [
      "Translator is an American, San Francisco rock band, that had success during the 1980s, and that continues into the present day.  The group created a sound that spanned updated British Merseybeat and stripped-down punk-like rock to psychedelia.  Inspired by the Beatles, Cream and 1960s California folk rock bands such as The Byrds, their guitar-based music had wide exposure during the early 1980s on non-commercial campus radio and new wave music stations. The group's stripped-down music and sometimes ironic and disturbing existentialist lyrics may have been a precursor to alternative rock.\n",
      "The four-piece band was formed in Los Angeles in 1979 when singer/songwriter/guitarist Steve Barton linked up with Larry Dekker on bass and Dave Scheff on drums.  A second singer/songwriter/guitarist, Robert Darlington, joined soon after and completed the lineup.  The combination of 2 talented songwriters and a powerful energetic rhythm section became the key to their success.\n",
      "Translator then relocated to San Francisco where they were signed to Howie Klein's independent label, 415 Records, on the strength of the demo tape they sent to college radio station KUSF: the loose and rambling yet laconic \"Everywhere That I'm Not\" has remained the band's signature tune. The song was featured on Translator's debut album Heartbeats And Triggers, which was recorded with the widely respected producer David Kahne.  As a result of 415 Records' national distribution arrangement with Columbia Records the debut album received strong promotion and became an underground and College radio hit in 1982. “I remember being on our first tour when we were playing at the Ritz (in New York) and thinking no one was gonna come,” recalled Barton. “And I remember coming around the corner and seeing this line going out the door and down the block and it was like ‘Oh my God...we sold the place out!’.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles/San Francisco, California, United States"
      ],
      "Genres": [
         "New wave,[1] Alternative rock"
      ],
      "Years active": [
         "1979–1986, 2012-present"
      ],
      "Labels": [
         "415/Columbia, Omnivore, Red Eye"
      ],
      "Associated acts": [
         "Pearl Harbor and the Explosions",
         "Romeo Void",
         "Wire Train"
      ],
      "Members": [
         "Steve Barton",
         "Bob Darlington",
         "Larry Dekker",
         "Dave Scheff"
      ]
   }
}