{
   "Name": "Translator (band)",
   "Sections": [
      "1 History",
      "2 Solo careers and other projects",
      "3 Personnel",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Singles",
      "4.3 EPs",
      "4.4 Compilations",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Translator is an American, San Francisco rock band, that had success during the 1980s, and that continues into the present day.  The group created a sound that spanned updated British Merseybeat and stripped-down punk-like rock to psychedelia.  Inspired by the Beatles, Cream and 1960s California folk rock bands such as The Byrds, their guitar-based music had wide exposure during the early 1980s on non-commercial campus radio and new wave music stations. The group's stripped-down music and sometimes ironic and disturbing existentialist lyrics may have been a precursor to alternative rock.\n"
      ]
   },
   "History": {
      "text": [
         "The four-piece band was formed in Los Angeles in 1979 when singer/songwriter/guitarist Steve Barton linked up with Larry Dekker on bass and Dave Scheff on drums.  A second singer/songwriter/guitarist, Robert Darlington, joined soon after and completed the lineup.  The combination of 2 talented songwriters and a powerful energetic rhythm section became the key to their success.\n",
         "Translator then relocated to San Francisco where they were signed to Howie Klein's independent label, 415 Records, on the strength of the demo tape they sent to college radio station KUSF: the loose and rambling yet laconic \"Everywhere That I'm Not\" has remained the band's signature tune. The song was featured on Translator's debut album Heartbeats And Triggers, which was recorded with the widely respected producer David Kahne.  As a result of 415 Records' national distribution arrangement with Columbia Records the debut album received strong promotion and became an underground and College radio hit in 1982. “I remember being on our first tour when we were playing at the Ritz (in New York) and thinking no one was gonna come,” recalled Barton. “And I remember coming around the corner and seeing this line going out the door and down the block and it was like ‘Oh my God...we sold the place out!’.[2]\n",
         "Between 1983 and 1986, the band completed three more albums for the same label.  They received significant airplay for \"Un-Alone\", from the second album No Time Like Now (1983), once again produced by Kahne.  For the third and fourth albums Translator worked with the Ramones' producer Ed Stasium. The self-titled third album Translator (1985) contained fan-favorites \"Gravity\", \"O Lazarus\" and \"Fall Forever\". The video for the LP's single, \"Come With Me\", was filmed on location in India. Their fourth album, Evening of The Harvest (1986), featured \"Standing In Line\" and \"Stony Gates of Time.\"  \n",
         "Translator's music was featured on at least 3 different compilation albums during the 1980s and 1990s. In 2007 all four original albums were re-issued on CD by Wounded Bird Records with previously released bonus tracks. This series put their entire 1980s work on CD for the first time.\n",
         "Translator released a new album, Big Green Lawn, on April 17, 2012 through Redeye Distribution. The album is the band's first since 1986.\n",
         "In 1996, ten years after their official breakup, the band was paid its \"highest compliment\" when Beatles fans mistook their take of the instrumental \"Cry for a Shadow\" for a new recording by the Fab Four from the Anthology sessions; in fact it was a Translator B-side from 1983.[2][3]\n",
         "In March 2015, Omnivore Recordings released a 22-song compilation of Translator's studio demos, spanning 1979–1985, titled Sometimes People Forget. The well-received album sparked a tour by the band, which included San Francisco, Los Angeles, Long Beach, Portland, and Seattle.\n",
         "Previous Translator reunion shows include the South By Southwest festival in Austin in 2006, and shows in Los Angeles and a sold out date at Slim's in San Francisco in September 2009. 2016 was a busy year for the band. They released four new recordings (three brand new songs, and a live cover of John Lennon's \"Remember\" from a 1982 show). These were all mastered at Abbey Road Studios by Sean Magee.\n"
      ]
   },
   "Solo careers and other projects": {
      "text": [
         "Steve Barton works as a solo recording artist. He has released 7 solo albums since 1999 - they are The Boy Who Rode His Bike Around The World, Charm Offensive, Flicker Of Time, Projector, \"New Blue World\", the triple album \"Tall Tales & Alibis\" and 2021's \"Love & Destruction\".  He co-wrote one of the songs on the 2015 \"Psychedelic Country Soul\" album by The Long Ryders with Sid Griffin. He has also written songs with John Wesley Harding (singer) and with Marvin Etzioni from Lone Justice. \n",
         "Dave Scheff has continued drumming, most recently with the orchestra at Teatro ZinZanni, on a 2008 summer UK tour with Dead Kennedys, and (together with Larry Dekker, guitarist Peter Wiley and keyboardist and singer Cynthia Haagens) in Bang Bang Men, and SF soul-pop group Half True. Robert Darlington released his first solo album, Prism, in 2012. He is also a published author, beginning with a collection of his poetry titled Ether. Larry Dekker continues to provide his powerful and melodic bass playing for various bands.\n"
      ]
   },
   "Personnel": {},
   "Discography": {
      "Studio albums": {},
      "Singles": {},
      "EPs": {},
      "Compilations": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Translator is an American, San Francisco rock band, that had success during the 1980s, and that continues into the present day.  The group created a sound that spanned updated British Merseybeat and stripped-down punk-like rock to psychedelia.  Inspired by the Beatles, Cream and 1960s California folk rock bands such as The Byrds, their guitar-based music had wide exposure during the early 1980s on non-commercial campus radio and new wave music stations. The group's stripped-down music and sometimes ironic and disturbing existentialist lyrics may have been a precursor to alternative rock.\n",
      "The four-piece band was formed in Los Angeles in 1979 when singer/songwriter/guitarist Steve Barton linked up with Larry Dekker on bass and Dave Scheff on drums.  A second singer/songwriter/guitarist, Robert Darlington, joined soon after and completed the lineup.  The combination of 2 talented songwriters and a powerful energetic rhythm section became the key to their success.\n",
      "Translator then relocated to San Francisco where they were signed to Howie Klein's independent label, 415 Records, on the strength of the demo tape they sent to college radio station KUSF: the loose and rambling yet laconic \"Everywhere That I'm Not\" has remained the band's signature tune. The song was featured on Translator's debut album Heartbeats And Triggers, which was recorded with the widely respected producer David Kahne.  As a result of 415 Records' national distribution arrangement with Columbia Records the debut album received strong promotion and became an underground and College radio hit in 1982. “I remember being on our first tour when we were playing at the Ritz (in New York) and thinking no one was gonna come,” recalled Barton. “And I remember coming around the corner and seeing this line going out the door and down the block and it was like ‘Oh my God...we sold the place out!’.[2]\n",
      "Between 1983 and 1986, the band completed three more albums for the same label.  They received significant airplay for \"Un-Alone\", from the second album No Time Like Now (1983), once again produced by Kahne.  For the third and fourth albums Translator worked with the Ramones' producer Ed Stasium. The self-titled third album Translator (1985) contained fan-favorites \"Gravity\", \"O Lazarus\" and \"Fall Forever\". The video for the LP's single, \"Come With Me\", was filmed on location in India. Their fourth album, Evening of The Harvest (1986), featured \"Standing In Line\" and \"Stony Gates of Time.\"  \n"
   ]
}