{
   "Name": "The Klezmorim",
   "rawData": [
      "The Klezmorim, founded in Berkeley, California, in 1975, was the world's first klezmer revival band, widely credited with spearheading the global renaissance of klezmer (Eastern European Yiddish instrumental music) in the 1970s and '80s. Initially featuring flute and strings—notably the exotic fiddling of co-founder David Skuse—the ensemble reorganized into a \"loose, roaring, funky\" brass/reed/percussion band fronted by co-founder Lev Liberman's saxophones and founding member David Julian Gray's clarinets. As a professional performing and recording ensemble focused on recreating the lost sounds of early 20th century klezmer bands, The Klezmorim achieved crossover success, garnering a Grammy nomination in 1982 for their album Metropolis and selling out major concert venues across North America and Europe, including Carnegie Hall (twice in 1983) and L'Olympia in Paris. The band performed steadily until 1993, regrouping in 2004 for a European tour.\n",
      "The Berkeley, California street-busking duo of violinist David Skuse and flutist Lev Liberman grew in 1975 (with the addition of David Julian Gray, Laurie Chastain, and Gregory Carageorge) into a Balkan/Yiddish party and wedding quintet known briefly as the Sarajevo Folk Ensemble. Making their public debut as The Klezmorim in two concerts at the Berkeley Public Library in April 1976, the musicians soon landed a monthly gig at the Freight & Salvage Coffeehouse. There they were discovered by folklorist and record producer Chris Strachwitz (himself a former refugee from Central Europe), who signed the band to Arhoolie Records and began recording them in the studio.\n",
      "Liberman spent months cataloguing the treasure trove of Yiddish records salvaged by Seymour Fromer, firebrand director of the Judah Magnes Museum in Berkeley CA and studying the music. But failing to connect with the organized Jewish community—which at the time regarded The Klezmorim's unique repertoire of long-forgotten Yiddish instrumental tunes as disturbingly alien—the band made its initial reputation performing at mainstream public venues such as folk clubs and dance halls.\n"
   ],
   "infobox": {
      "Origin": [
         "Berkeley, California, United States"
      ],
      "Genres": [
         "Klezmer, jazz"
      ],
      "Years active": [
         "1975 (1975)–1993, 2004"
      ],
      "Labels": [
         "Arhoolie, Flying Fish, Le Chant du Monde, MW"
      ],
      "Associated acts": [
         "The Flying Karamazov Brothers, Klez-X, New Klezmer Trio, Di Naye Kapelye, Avner the Eccentric"
      ],
      "Website": [
         "klezmo.com"
      ]
   },
   "prunedData": [
      "[BAND_NAME], founded in Berkeley, California, in [YEAR], was the world's first klezmer revival band, widely credited with spearheading the global renaissance of klezmer (Eastern European Yiddish instrumental music) in the [YEAR]s and '80s. Initially featuring flute and strings—notably the exotic fiddling of co-founder David Skuse—the ensemble reorganized into a [GENRE] band fronted by co-founder Lev Liberman's saxophones and founding member David [MONTH]ian Gray's clarinets. As a professional performing and recording ensemble focused on recreating the lost sounds of early 20th century klezmer bands, [BAND_NAME] achieved crossover success, garnering a Grammy nomination in [YEAR] for their album Metropolis and selling out major concert venues across North America and Europe, including Carnegie Hall (twice in [YEAR]) and L'Olympia in Paris. The band performed steadily until [YEAR], regrouping in [YEAR] for a European tour.\n",
      "The Berkeley, California street-busking duo of violinist David Skuse and flutist Lev Liberman grew in [YEAR] (with the addition of David [MONTH]ian Gray, [PERSON_NAME_FULL_1_FEMALE], and Gregory Carageorge) into a Balkan/Yiddish party and wedding quintet known briefly as the Sarajevo Folk Ensemble. Making their public debut as [BAND_NAME] in two concerts at the Berkeley Public Library in [MONTH] [YEAR], the musicians soon landed a monthly gig at the Freight & Salvage Coffeehouse. There they were discovered by folklorist and record producer [PERSON_NAME_FULL_0_MALE] (himself a former refugee from Central Europe), who signed the band to Arhoolie Records and began recording them in the studio.\n",
      "Liberman spent months cataloguing the treasure trove of Yiddish records salvaged by Seymour Fromer, firebrand director of the Judah Magnes Museum in Berkeley CA and studying the music. But failing to connect with the organized Jewish community—which at the time regarded [BAND_NAME]'s unique repertoire of long-forgotten Yiddish instrumental tunes as disturbingly alien—the band made its initial reputation performing at mainstream public venues such as folk clubs and dance halls.\n"
   ]
}