{
   "Discography": {
      "Albums": {},
      "Compilations": {},
      "Music videos": {},
      "Singles and EPs": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Something of an anomaly in Midwestern America, For Against—especially early in its career—has looked to a distinctly British aesthetic for inspiration, most obviously the post-punk scene exemplified by the early rosters of the Factory and 4AD record labels.\n",
         "Featuring members of underground Lincoln bands Cartoon Pupils and Hymn to Joy, the band first called itself Glue, and then D.B.L., finally settling on Four Against One,[1] a name that reflected its status as a quintet at the time. Bassist Liz Panarelli's early departure gave way to keyboardist Jeffrey Runnings' shift to bass, as well as the band's truncation of its name to For Against. By 1985, singer Jon Fynbu had departed as well, leaving the core trio of guitarist Harry Dingman III, drummer Gregory Hill and bassist Jeffrey Runnings. The latter would become (with very few exceptions) the band's sole vocalist and lyricist.[1]\n",
         "In 1985, For Against debuted on vinyl with the \"Autocrat\"/\"It's a Lie\" single, released in a limited run on the band's own Republic Issue label. This single has become highly collectible among the group's fanbase. Additional early material was later released as the In the Marshes 10\" EP (recorded 1985, released 1990) and Black Soap EP (recorded 1984, released 2011).\n",
         "In 1987, the band signed to Independent Project Records, issuing its first full-length album, Echelons. That year the band undertook its only full tour to date, promoting Echelons at clubs across the U.S. including CBGB, Maxwell's and Chicago's Cabaret Metro.  Echelons received a Grammy nomination for its jacket design by IPR head Bruce Licher; each LP in the initial pressing of 1000 came with an actual shaft of wheat integrated into the cover illustration. Promotional videos were made for two of the album's songs, \"Autocrat\" and the title track; both were included as bonus material in the reissue of their second album, December.[2]\n",
         "Having received favorable press for the melodic post-punk of Echelons, For Against released follow-up December the next year, to equally rave reception. The band lost considerable momentum, however, when Hill left, followed shortly thereafter by Dingman after a brief attempt at a retooled, four-piece lineup. Hill and Dingman would soon form the Millions, a melodic alt-rock outfit with more mainstream leanings than For Against.\n",
         "Runnings, who had by this time switched from bass to guitar, continued on with bassist Jeff Gaskins and drummer Steve Schultz, playing under the name Stahlversion for a time before returning to the For Against handle. The band next added second guitarist Stephen \"Mave\" Hinrichs to the lineup; Hinrichs' band the Gladstones (formerly Playground), a steady name on the Lincoln scene, had just broken up. By the end of 1990, Schultz had been replaced with former Holiday drummer Paul Engelhard. This lineup of For Against released two singles in 1991 and 1993; all five songs from those singles found their way onto the band's 1993 album Aperture. This album also featured six unheard tracks from 1990-91 recording sessions, characterized by a more relaxed, repetitive songwriting style than on earlier For Against records, making full use of the layering capabilities of the new two-guitar lineup.\n",
         "By the time of Aperture's release (delayed due to IPR's distribution woes), Gaskins had left the group; the album credits thank him for his bass playing but do not list him as a band member. Runnings returned to bass, and For Against has remained a trio ever since.\n",
         "For Against recorded two more albums, Mason's California Lunchroom (1995) and Shelf Life (1997), before reemerging on a new label in 2002 with the album Coalesced. Hinrichs soon left the band and moved to Virginia, leaving the group's existence in doubt.\n",
         "In 2004, original guitarist Dingman rejoined Runnings and Engelhard. In 2006, Words on Music reissued Echelons and December on CD, followed by In the Marshes in 2007.\n",
         "In March 2007, the band traveled to Europe for the first time, and played two shows in Athens, Greece. In August 2007, Engelhard was replaced by Nick Buller, who became the new permanent drummer. They traveled to Europe again, playing Spain in 2007 and touring Italy in March 2008. Two new albums were issued by Words on Music, Shade Side Sunny Side in 2008 (which Engelhard played on) and Never Been in 2009 (with Buller on drums).\n",
         "In 2013, Captured Tracks released a For Against box set containing Echelons, December and In the Marshes.[3]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Albums",
      "2.2 Singles and EPs",
      "2.3 Compilations",
      "2.4 Music videos",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "For Against is an American post-punk/dream pop band from Lincoln, Nebraska, United States. Despite numerous lineup shuffles and some periods of dormancy, the band has produced material steadily since 1984.\n"
      ]
   },
   "Title": "For Against - Wikipedia"
}