{
   "EPs": {
      "The End of the Night (2018)": {
         "text": [
            "Released on January 26, 2018 on Silver Street Records.[17] The three song EP is a solo side project from Josh Hoyer, and the result of a writing collaboration between Hoyer, veteran Nashville songwriter Jay Knowles (Harry Connick Jr, Blake Shelton), and Jon Coleman, Trace Adkins' band leader and producer. The record was recorded and mixed in Nashville, Tennessee by Engineer Teddy Morgan, and mastered by Richard Dodd.[18]\n"
         ]
      }
   },
   "External links": {},
   "History": {
      "text": [
         "Hoyer formed Josh Hoyer & Soul Colossal in 2012 Lincoln, Nebraska.  Hoyer, DeForest, Kushner, Keeling, and ElDorado are all native Nebraskans. Before Josh Hoyer & Soul Colossal, Hoyer had fronted the band Son of 76 & The Watchmen, and Electric Soul Method. Josh Hoyer & Soul Colossal were named 2018 Artist of the Year by the Omaha Entertainment and Arts awards.[3]\n"
      ]
   },
   "Live Albums": {
      "Cooked Raw (2015)": {
         "text": [
            "Released on November 6, 2015 on Silver Street Records.[11] Cooked Raw was recorded live, direct to disc at Welcome To 1979 in Nashville, Tennessee. The recording engineer was Chris Mara and the mastering engineer was Cameron Henry.[12] Welcome to 1979 is one of the few studios in the world that can record a performance directly to a vinyl master.[13] Released exclusively on 180g vinyl, the album contains select cuts from the band's first two studio releases. Each side of the record contains 3 songs, which were played straight through, without stopping.[14] Glide Magazine gave the record 9/10 stars.[15]\n"
         ]
      },
      "Live! Ancienne Belgique (2017)": {
         "text": [
            "Released on June 2, 2017 on Silver Street Records.[16] Live! Ancienne Belgique is a live record from the final night of the band's 2017 European tour at Ancienne Belgique in Brussels, Belgium.  Live! Ancienne Belgique features 7 songs from the band's previous three studio releases. It was recorded by Stef Van Alsenoy, mixed by James Fleege, and mastered by Doug Van Sloun.\n"
         ]
      }
   },
   "NBC's The Voice": {
      "text": [
         "Josh Hoyer was a contestant on Season 12 of NBC's The Voice. Josh earned a spot on Team Blake Shelton by singing a version of The Chi-Lites hit \"Oh Girl\" for his blind audition which aired on March 6, 2017.[19] Hoyer sang \"In The Midnight Hour\" by Wilson Pickett during the battle rounds against fellow soul singer TSoul and was eliminated from the show on March 27, 2017 when Shelton declared TSoul the winner and neither of the remaining coaches with steals, Adam Levine and Gwen Stefani, opted to steal Hoyer.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Studio albums",
      "2.1 Self-Titled Debut (2014)",
      "2.2 Living by the Minute (2015)",
      "2.3 Running from Love (2016)",
      "2.4 Do It Now (2018)",
      "3 Live Albums",
      "3.1 Cooked Raw (2015)",
      "3.2 Live! Ancienne Belgique (2017)",
      "4 EPs",
      "4.1 The End of the Night (2018)",
      "5 NBC's The Voice",
      "6 External links",
      "7 References"
   ],
   "Studio albums": {
      "Do It Now (2018)": {
         "text": [
            "The album was globally released on January 18, 2019, following a European release on August 16, 2018. The record was produced by Josh Hoyer and recorded at Silver Street Studio in Ashland, NE and Make Believe Studios in Omaha, NE. The record was mixed by James Fleege and mastered by Eric Conn in Nashville, TN. It is available on vinyl, CD, and digital formats.[10]\n"
         ]
      },
      "Living by the Minute (2015)": {
         "text": [
            "Released on January 13, 2015 on Silver Street Records. The record was produced by Josh Hoyer, engineered by Ben Brodin, mastered by Doug Van Sloun at Focus Mastering and recorded at ARC Studios in Omaha, Nebraska.[5][6] The song \"The First One\" was featured in the TV One movie \"For The Love of Ruth.\"[7]\n"
         ]
      },
      "Running from Love (2016)": {
         "text": [
            "Released on April 8, 2016 on Silver Street Records. The record was produced by Ken Coomer (Wilco/Uncle Tupelo) and recorded at Sound Emporium in Nashville, Tennessee. Glide magazine premiered the music video for the record's first single, \"Parts of A Man\", on February 8, 2016.[8] The Vinyl District premiered a music video for \"Natural\" on June 9, 2016. The video features a remixed version of the studio cut, and was produced by James Fleege.[9]\n"
         ]
      },
      "Self-Titled Debut (2014)": {
         "text": [
            "Released on January 17, 2014.[4] Tracks 1-3 produced by BZZZ at Studio F and Tracks 4-8 produced by Charlie Johnson at Fuse Studio in Lincoln, NE.\n"
         ]
      }
   },
   "Summary": {
      "text": [
         "Josh Hoyer & Soul Colossal is a five-piece American Soul/Funk/R&B band based out of Lincoln, Nebraska. The band is led by Josh Hoyer on keyboards/vocals, with Benjamin Kushner on guitar, Blake DeForest on Trumpet, Harrison ElDorado on drums, and Mike Keeling on bass. The band has played 150+ shows a year in the United States from 2015-2018, along with two headlining European tours in 2017 and 2018.[1][2]\n"
      ]
   },
   "Title": "Josh Hoyer & Soul Colossal - Wikipedia"
}