{
   "Name": "16 (band)",
   "rawData": [
      "16 is an American sludge metal band from Los Angeles, California. The band is currently signed to Relapse Records. -(16)- has been cited, along with fellow pioneering acts such as Eyehategod, Crowbar and Acid Bath, as one of the subgenre's seminal outfits. In June 2020, the band released their eighth full-length album, Dream Squasher.\n",
      "16 was formed in Santa Ana, California by Bobby Ferry (guitar), Cris Jerue (vocals), and Jason Corley (drums) in 1992.According to Ferry, he and Jerue bonded as part of the Southern California skate scene. Ferry has stated band was originally called 15, but changed their name when they were made aware of a previously existing group called Fifteen, who had been signed to Lookout Records. Ferry also named some of the band's early influences, including 7 Seconds, Bad Brains, and Metallica, as well as the \"wave of  bands, Helmet, Jesus Lizard, Unsane and Tar.\" The band's first full-length album, Curves That Kick, was released in 1993 on Bacteria Sour, an independent label owned by renowned artist, Pushead. Following the album's release, -(16)- toured Japan in 1994.\n",
      "The band's next record, Drop Out, was released by Pessimiser/Theologian records in 1996 (after being shelved for nearly two years).  In spite of Drop Out's critical acclaim, -(16)- did not tour heavily, opting instead to focus on performing locally. Jason Corley was ejected from the band at the end of 1994, and replaced by Andy Hassler.  Phil Vera was also added as a 2nd guitarist.  The band released Blaze of Incompetence in 1997 (again on Pessimiser/Theologian), and did a US tour with Grief in 1998.  Andy Hassler was fired shortly after the tour.  R.D. Davies replaced Andy, and then he was replaced by Mark Sanger 6 months later.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Alternative metal, sludge metal"
      ],
      "Years active": [
         "1992–2004, 2007–present"
      ],
      "Labels": [
         "Relapse, At A Loss, Bastardizer Recordings, Bacteria Sour, Pessimiser/Theologian, Pushead Fanclub, Last Hurrah Records, Standard, MP3.com"
      ],
      "Website": [
         "-(16)- on Facebook"
      ],
      "Members": [
         "Bobby Ferry, Cris Jerue, Alex Shuster, Dion Thurman, and Barney Firks  [1]"
      ]
   },
   "albums": [
      "Curves That Kick",
      "Drop Out",
      "Blaze of Incompetence",
      "Zoloft Smile",
      "Bridges to Burn",
      "Deep Cuts From Dark Clouds",
      "Lifespan of a Moth",
      "Dream Squasher"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Los Angeles, California. The band is currently signed to Relapse Records. -([BAND_NAME])- has been cited, along with fellow pioneering acts such as Eyehategod, Crowbar and Acid Bath, as one of the subgenre's seminal outfits. In [MONTH] [YEAR], the band released their eighth full-length album, Dream Squasher.\n",
      "[BAND_NAME] was formed in Santa Ana, California by Bobby Ferry (guitar), [PERSON_NAME_FULL_1_MALE] (vocals), and Jason Corley (drums) in [YEAR].According to Ferry, he and [PERSON_NAME_LAST_1] bonded as part of the Southern California skate scene. Ferry has stated band was originally called 15, but changed their name when they were made aware of a [GENRE] band's early influences, including 7 Seconds, Bad Brains, and Metallica, as well as the [SONG_NAME] The band's first full-length album, Curves That Kick, was released in [YEAR] on Bacteria Sour, an independent label owned by renowned artist, Pushead. Following the album's release, -([BAND_NAME])- toured Japan in [YEAR].\n",
      "The band's next record, Drop Out, was released by Pessimiser/Theologian records in [YEAR] (after being shelved for nearly two years).  In spite of Drop Out's critical acclaim, -([BAND_NAME])- did not tour heavily, opting instead to focus on performing locally. [PERSON_NAME_FULL_2_MALE] was ejected from the band at the end of [YEAR], and replaced by [PERSON_NAME_FULL_1_MALE].  [PERSON_NAME_FULL_0_MALE] was also added as a [GENRE] band released Blaze of Incompetence in [YEAR] (again on Pessimiser/Theologian), and did a US tour with Grief in [YEAR].  [PERSON_NAME_FULL_1_MALE] was fired shortly after the tour.  R.D. Davies replaced [PERSON_NAME_FIRST_1], and then he was replaced by [MONTH]k Sanger 6 months later.\n"
   ]
}