{
   "Name": "Tsunami Bomb",
   "rawData": [
      "Tsunami Bomb is an American punk rock band from Petaluma, California.  They were formed in 1998 by bassist Dominic Davi, with keyboardist/vocalist Oobliette Sparks and later joined by drummer Gabe Lindeman. With vocalist Emily Whitehurst aka \"Agent M\" they would become a staple of Warped Tour  and toured extensively throughout the United States, Europe, and Japan, going through a number of lineup changes until they disbanded in 2005 after releasing two full length albums and a number of EP's. In 2015 the band reformed with new vocalist Kate Jacobi and later guitarist Andy Pohl and has remained active since, touring and appearing on a variety of festivals.\n",
      "The band was started by bassist Dominic Davi, who enlisted Oobliette Sparks on keyboard who would also contribute vocals and Kristin McRory as Tsunami Bomb's original main vocalist after they left the band, Headboard in February 1998. Davi met McRory in late 1997, when she joined Headboard on vocals and had known Sparks from hanging out together at The Phoenix Theater in Petaluma. Sparks had recently left the local Petaluma band, Spacebaby that she had been in with drummer Gabe Lindeman. Calling in favors and using fill-in musicians to round out the line up, Tsunami Bomb played its first show on June 26, 1998 at the Fatty Mocha in Merced, CA with the band Luckie Strike, playing the Phoenix Theater together the next day. Gabriel Lindeman played drums for the band's first few shows, but he did not join the band full-time until 1999. Kristin McRory left Tsunami Bomb in late 1998, and Davi recruited Emily Whitehurst shortly thereafter (Emily's brother, Logan Whitehurst was Davi's roommate at the time). To add mystique and give her a more iconic presence, Davi created the moniker \"Agent M\" for her to use in the band. Whitehurst was credited as Agent M almost exclusively until the breakup of the band.\n",
      "Tsunami Bomb maintained a grueling tour schedule for most of its existence. In 1999 they released two limited edition 7\" singles: B-Movie Queens was a split with Emily Whitehurst and Brian Plink's former band Plinky; Mayhem On The High Seas was released on Checkmate Records which was owned by Hunter Burgan, bassist for AFI. In 2000 they signed to Tomato Head Records and released their first CD EP The Invasion from Within! and guitarist Brian Plink would leave the group with his last show being the album release show at the Phoenix Theater. Keyboardist Oobliette Sparks would leave the group the following year in 2001, and not being able to replace her, the band would continue without keyboards.\n"
   ],
   "infobox": {
      "Origin": [
         "Petaluma, California"
      ],
      "Genres": [
         "Punk rock",
         "pop punk",
         "melodic hardcore"
      ],
      "Years active": [
         "1998–2005",
         "2009",
         "2015–present"
      ],
      "Labels": [
         "Checkmate Records",
         "Tomato Head",
         "Kung-Fu",
         "Alternative Tentacles"
      ],
      "Website": [
         "tsunamibomb.net"
      ],
      "Members": [
         "Dominic Davi",
         "Oobliette Sparks",
         "Andy Pohl",
         "Gabriel Lindeman",
         "Kate Jacobi"
      ],
      "Past members": [
         "Brian Plink",
         "Kristin McRory",
         "Tim Chaddick",
         "Rob Reed",
         "Emily Whitehurst",
         "Jay Northington",
         "Matt Mckenzie",
         "Mike Griffen"
      ]
   }
}