{
   "Discography": {
      "Albums": {},
      "Compilations": {},
      "EPs": {},
      "Singles": {},
      "Videos": {}
   },
   "External links": {},
   "History": {
      "Formation and early years (1998-2001)": {
         "text": [
            "The band was started by bassist Dominic Davi, who enlisted Oobliette Sparks on keyboard who would also contribute vocals and Kristin McRory as Tsunami Bomb's original main vocalist after they left the band, Headboard in February 1998. Davi met McRory in late 1997, when she joined Headboard on vocals and had known Sparks from hanging out together at The Phoenix Theater in Petaluma. Sparks had recently left the local Petaluma band, Spacebaby that she had been in with drummer Gabe Lindeman. Calling in favors and using fill-in musicians to round out the line up, Tsunami Bomb played its first show on June 26, 1998 at the Fatty Mocha in Merced, CA with the band Luckie Strike, playing the Phoenix Theater together the next day.[1] Gabriel Lindeman played drums for the band's first few shows, but he did not join the band full-time until 1999. Kristin McRory left Tsunami Bomb in late 1998, and Davi recruited Emily Whitehurst shortly thereafter (Emily's brother, Logan Whitehurst was Davi's roommate at the time). To add mystique and give her a more iconic presence, Davi created the moniker \"Agent M\" for her to use in the band. Whitehurst was credited as Agent M almost exclusively until the breakup of the band.[2]\n",
            "Tsunami Bomb maintained a grueling tour schedule for most of its existence. In 1999 they released two limited edition 7\" singles: B-Movie Queens was a split with Emily Whitehurst and Brian Plink's former band Plinky; Mayhem On The High Seas was released on Checkmate Records which was owned by Hunter Burgan, bassist for AFI. In 2000 they signed to Tomato Head Records and released their first CD EP The Invasion from Within! and guitarist Brian Plink would leave the group with his last show being the album release show at the Phoenix Theater. Keyboardist Oobliette Sparks would leave the group the following year in 2001, and not being able to replace her, the band would continue without keyboards.\n"
         ]
      },
      "Reunion (2015–2017)": {
         "text": [
            "In 2015, original members Oobliette, Davi, Brian Plink and Gabriel Lindeman reunited Tsunami Bomb along with Kate Jacobi, who would replace Emily Whitehurst on vocals. Whitehurst declined to rejoin Tsunami Bomb, choosing to focus on her own project, Survival Guide. The band performed their first show under their newly formed line-up on December 19, 2015. They released their rarities collection LP called Trust No One on January 29, 2016.\n",
            "That following summer Brian Plink would step away from the band citing \"health issues\" and Chris LaForge, guitarist for 30 Foot Fall who was promoting some of the band's Texas performances stepped in to fill in on guitar last minute. LaForge would continue to fill in on guitar the rest of that year and performed with the band on a number of tours and festivals including the Northwest dates of the Vans Warped Tour on August 12 and 13, 2016, until the band found a more permanent guitarist at the end of 2016. Chris LaForge passed away unexpectedly on May 29, 2017 and the band was deeply effected by his loss, with members posting tributes to his memory on their website and social media pages.\n",
            "On July 13, 2017 the band began a short Northeast US trip with 3 shows in Philadelphia PA, Long Branch NJ, and Brooklyn NY. At Kung Fu Necktie, in Philly, the band debuted new guitarist Andy Pohl, as well as two never-heard-before songs \"Tidal Wave Explosive Device\" and \"Lullaby for the End of the World\" that were intended for a new album.[4]\n",
            "On November 15, 2017, Rolling Stone named \"The Ultimate Escape\" #31 on their Top 50 Pop-Punk Albums of all time.[5]\n"
         ]
      },
      "The Definitive Act and break-up (2004–2005)": {
         "text": [
            "In 2004, Tsunami Bomb released the album The Definitive Act and a live concert DVD entitled Live at the Glasshouse from the live music DVD series The Show Must Go Off! in 2005. Both were released on Kung Fu Records. In late 2005, after years of touring and numerous line-up changes Tsunami Bomb officially broke up, citing their problems with the \"business end of the music industry\".\n",
            "On January 17, 2009, Tsunami Bomb performed a reunion show in their hometown of Petaluma at the Phoenix Theater as a benefit for their friend Liz Beidelman the drummer for the band Luckie Strike who was fighting brain cancer.\n"
         ]
      },
      "The Spine That Binds (2018–2020)": {
         "text": [
            "Tsunami Bomb released two new tracks to members of their street team, the Tsunami Bomb Squad on September 7, 2018. The two tracks \"Lullaby For The End Of The World\" and \"Naysayers\" were released to the public as a digital single on October 5, 2018 and were samples from their upcoming album.[6] On March 12, 2019 it was announced the new full length would be released on Alternative Tentacles Records after Jello Biafra insisted he be sent the demos, and despite the band believing he wouldn't like their music, he did and licensed the record immediately.[7]\n",
            "Tsunami Bomb would continue headlining concerts around the United States rebuilding their following, performing short runs of shows rather than the grueling tour schedule they were once known for. Kung Fu Records and Cleopatra Records would partner to reissue all of the previous discography on vinyl. On August 24, 2018 The Ultimate Escape was released on limited red vinyl, with The Definitive Act being released on limited white vinyl on March 12, 2019. Reissues sold out quickly since The Definitive Act never previously being released on vinyl and The Ultimate Escape only having a limited picture disc vinyl at the time of the original release. Both albums have been kept in circulation with continued repressing since.\n",
            "The band returned to the Vans Warped Tour one last time on July 21, 2019 to celebrate the Vans 25th Anniversary Celebration at Mountain View, CA at the Shoreline Amphitheater. Band members stated onstage how much Warped Tour had meant to them and what it had done for the band's career.\n",
            "On September 18, 2019 Brooklyn Vegan streamed the track \"The Hathors\" off of the upcoming new album The Spine That Binds, as well as announcing they would be headlining day 1 of Alternative Tentacles Records' first ever 'Tentacle Fest: Celebrating 40 Years Of Alternative Tentacles' in Berkeley, CA on November 22.[8]\n",
            "Tsunami Bomb released a cover of \"Dead Man's Party\" by Oingo Boingo for Cleopatra Records Halloween themed compilation Punk Rock Halloween 2: Louder, Faster, & Scarier on October 11, 2019.[9]\n",
            "On October 16, 2019 Kerrang! Magazine's website streamed the track \"Petaluma\" from The Spine That Binds.[10] Alternative Press (Magazine) debuted the band's first new music video in years, \"Naysayers\" from \"The Spine That Binds\".[11]\n",
            "On November 1, 2019 Tsunami Bomb released a minor key cover of \"Santa Claus Is Coming To Town\" for Cleopatra Records special Christmas themed compilation Punk Rock Christmas 2.[12]\n",
            "\"The Spine That Binds\" was released on Friday, November 8, 2019 on Alternative Tentacles Records. ThePopBreak.com stated \"The Spine That Binds is the perfect follow up to The Definitive Act. It’s an album that doesn’t sound like 15 years have passed yet paradoxically is an album that the band couldn’t have put out 15 years ago.\"[13] The band was able to play a handful of shows in support of the album, such as The Fest 18 and Alternative Tentacles Records Tentacle Fest, as well as a south west tour with Death By Stereo in January 2020,[14] before all touring was canceled due to the pandemic shut down.\n",
            "On November 8, 2020 Cleopatra Records released a two song digital single featuring a cover of Hall & Oates track \"Out Of Touch\" for an upcoming Yacht Rock compilation. The second song was the cover of \"Dead Man's Party\" by Oingo Boingo that originally appeared on the Punk Rock Halloween 2: Louder, Faster, & Scarier in 2019.[15]\n",
            "Alternative Tentacles Records announced on September 18, 2020 that Tsunami Bomb would release a 4 song 7\" called Still Standing. Featuring new recordings of \"Irish Boys\", that was previously only available as a 4-track recording, and \"El Diablo\", featuring the original keyboard parts by Oobliette Sparks it was written with on Side A, with bootleg live recordings of \"Take The Reins\" and \"Lemonade\" from a show in New York in 2019 on Side B. The 7\" was originally an exclusive release on pink and blue splatter vinyl for the bands street team, \"The Bomb Squad\" which could only be bought from a password protected store, but after Jello Biafra heard the songs, he demanded they release a version for Alternative Tentacles Records.[16] The Alternative Tentacles version of the 7\" was released on January 22, 2021. \n"
         ]
      },
      "The Ultimate Escape (2002–2003)": {
         "text": [
            "In 2002 they signed with Kung Fu Records, and released their first full-length album The Ultimate Escape.[3] Tsunami Bomb would appear on the Warped Tour several times between 2001 and 2005. They have also toured Europe and Japan.  Originally being booked by Dan Garcia at Royal Flush Booking, Tsunami Bomb had several tours including main support for the Vandals.\n",
            "The title song from their first CD release, The Invasion from Within!, was used in Atlus USA's translation of the Nippon Ichi Software strategy RPG Disgaea: Hour of Darkness. Atlus also used the song Russian Roulette from the band's first full-length album The Ultimate Escape in their collaboration with Spumco animation studios, a cartoon skateboarding game called Go! Go! Hypergrind.\n",
            "In 2003, a decision led to Tsunami Bomb's Dominic Davi being pushed out of the group. The remaining band members cited \"personality and creative conflicts.\" He would go on to form the musical group Love Equals Death on Fat Wreck Chords. He was replaced by Matt McKenzie. Controversy surrounded the split with founding member Davi, long cited as being one of the main songwriters for the band. Also in 2003, the album The Rocky Horror Punk Rock Show was released and featured the band's cover of the popular Rocky Horror Picture Show song \"Planet, Schmanet, Janet\" that had been recorded years earlier.  Later that same year, after a split with Royal Flush Booking, the band signed with the William Morris Agency with Ron Opeleski. The band then launched a full US headlining tour which sold out venues such as the Metro in Chicago, two nights at Slim's in San Francisco, and three nights at the Troubadour in L.A. They also played main support for the Bouncing Souls on a world tour.\n"
         ]
      }
   },
   "Members": {
      "Current members": {},
      "Former members": {},
      "Live members": {}
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and early years (1998-2001)",
      "1.2 The Ultimate Escape (2002–2003)",
      "1.3 The Definitive Act and break-up (2004–2005)",
      "1.4 Reunion (2015–2017)",
      "1.5 The Spine That Binds (2018–2020)",
      "2 Members",
      "2.1 Current members",
      "2.2 Former members",
      "2.3 Live members",
      "3 Discography",
      "3.1 EPs",
      "3.2 Albums",
      "3.3 Singles",
      "3.4 Videos",
      "3.5 Compilations",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Tsunami Bomb is an American punk rock band from Petaluma, California.  They were formed in 1998 by bassist Dominic Davi, with keyboardist/vocalist Oobliette Sparks and later joined by drummer Gabe Lindeman. With vocalist Emily Whitehurst aka \"Agent M\" they would become a staple of Warped Tour  and toured extensively throughout the United States, Europe, and Japan, going through a number of lineup changes until they disbanded in 2005 after releasing two full length albums and a number of EP's. In 2015 the band reformed with new vocalist Kate Jacobi and later guitarist Andy Pohl and has remained active since, touring and appearing on a variety of festivals.\n"
      ]
   },
   "Title": "Tsunami Bomb - Wikipedia"
}