{
   "Name": "Abe Vigoda (band)",
   "rawData": [
      "Abe Vigoda was an American punk rock band based in Los Angeles, California, United States, originally from Chino, California; a city in the Inland Empire. They frequently performed at the Smell.\n",
      "The band formed right after the members finished high school. The name is a reference to Abe Vigoda. Skeleton, Abe Vigoda's third album, was released on July 8, 2008. In 2009, the EP Reviver followed. They finished recording their fourth album titled Crush on February 24, 2010 and it was released on September 20, 2010 and was ranked 40th on Pitchfork Media's list The Top 50 Albums of 2010. Their album, Crush was a full transition for the band from their earlier sounds.\n",
      "Some critics compared their music to another band, Vampire Weekend\n"
   ],
   "infobox": {
      "Origin": [
         "Chino, California, U.S."
      ],
      "Genres": [
         "Earlier: tropical punk rock, tropicalismo",
         "Later: Dark Wave, Post-punk, Shoegaze"
      ],
      "Years active": [
         "2004–2014"
      ],
      "Labels": [
         "Olfactory Records[2]",
         "Silencio Records",
         "Post Present Medium",
         "Not Not Fun",
         "Bella Union",
         "oms-b"
      ],
      "Associated acts": [
         "Emergency Ensemble",
         "Colorwheel"
      ],
      "Members": [
         "Juan Velazquez",
         "Michael Vidal",
         "David Reichardt",
         "Dane Chadwick"
      ],
      "Past members": [
         "Gerardo \"Reggie\" Guerrero",
         "Zach Downing"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band based in Los Angeles, California, United States, originally from Chino, California; a city in the Inland Empire. They frequently performed at the Smell.\n",
      "The band formed right after the members finished high school. The name is a reference to [BAND_NAME]. Skeleton, [BAND_NAME]'s third album, was released on [MONTH] 8, [YEAR]. In [YEAR], the EP Reviver followed. They finished recording their fourth album titled Crush on [MONTH] 24, [YEAR] and it was released on [MONTH] 20, [YEAR] and was ranked 40th on Pitchfork Media's list The Top 50 Albums of [YEAR]. Their album, Crush was a full transition for the band from their earlier sounds.\n",
      "Some critics compared their music to another band, Vampire Weekend\n"
   ]
}