{
   "Name": "Agent Steel",
   "rawData": [
      "Agent Steel is an American speed metal band from Los Angeles, California, United States, formed in 1984 by vocalist John Cyriis with drummer Chuck Profus. The band released two full-length albums, and one EP before disbanding in 1988. They were most notable for Cyriis' high-pitched vocals, catchy songs, melodic riffs, and fast tempos mixed in with interest in UFOs. Agent Steel reformed in 1998 (without Cyriis, although he would return to the band in 2010, only to leave again in 2011) and released three more full-length albums before going on hiatus in 2011. The band reformed again in 2018, this time with Cyriis returning as the vocalist and without the previous members, and they will release their first studio album in 14 year (and their first in 34 years to feature original vocalist and founder), No Other Godz Before Me, in 2021.\n",
      "\n",
      "Agent Steel was formed by John Cyriis shortly after his firing from Megadeth in 1984, as guitarist and now lead vocalist Dave Mustaine was against the idea of playing the “Aliens Card.” In all actuality, however, Agent Steel does not exclusively touch upon subjective matter relating to the possibility of life existing on other galaxies — but instead the philosophical format of the band was presented in a form of a polemic.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Speed metal",
         "heavy metal",
         "power metal",
         "thrash metal"
      ],
      "Years active": [
         "1984–1988",
         "1998–2011",
         "2018–present"
      ],
      "Labels": [
         "Dissonance Productions",
         "Combat",
         "Music for Nations",
         "Metal Hammer",
         "Candlelight",
         "Scarlet",
         "Mascot"
      ],
      "Associated acts": [
         "Abattoir",
         "Grinchfist",
         "Sybil",
         "Redemption",
         "Evildead",
         "Fates Warning",
         "Terror",
         "Engine",
         "Body Count",
         "Death",
         "Obituary",
         "Testament",
         "S.E.T.I.",
         "Masters of Metal"
      ],
      "Website": [
         "https://www.agentsteel.net/"
      ],
      "Members": [
         "Johnny Cyriis",
         "Nikolay Atanasov",
         "Vinicius Carvalho",
         "Shuichi Oni",
         "Rasmus Kjær"
      ],
      "Past members": [
         "Mark Marshal",
         "John Gott",
         "Kurt Colfelt",
         "Chuck Profus",
         "George Robb",
         "Juan Garcia",
         "Bernie Versailles",
         "Michael Zaputil",
         "Silvio Golfetti",
         "Brian “Beast” East",
         "Bruce Hall",
         "Karlos Medina",
         "Rigo Amezcua",
         "Robert Cardenas"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Los Angeles, California, United States, formed in [YEAR] by vocalist John Cyriis with drummer [PERSON_NAME_FULL_0_MALE]. The band released two full-length albums, and one EP before disbanding in [YEAR]. They were most notable for Cyriis' high-pitched vocals, catchy songs, melodic riffs, and fast tempos mixed in with interest in UFOs. [BAND_NAME] reformed in [YEAR] (without Cyriis, although he would return to the band in [YEAR], only to leave again in [YEAR]) and released three more full-length albums before going on hiatus in [YEAR]. The band reformed again in [YEAR], this time with Cyriis returning as the vocalist and without the previous members, and they will release their first studio album in 14 year (and their first in 34 years to feature original vocalist and founder), No Other Godz Before Me, in [YEAR].\n",
      "\n",
      "[BAND_NAME] was formed by John Cyriis shortly after his firing from Megadeth in [YEAR], as guitarist and now lead vocalist [PERSON_NAME_FULL_0_MALE] was against the idea of playing the “Aliens Card.” In all actuality, however, [BAND_NAME] does not exclusively touch upon subjective matter relating to the possibility of life existing on other galaxies — but instead the philosophical format of the band was presented in a [GENRE] a polemic.\n"
   ]
}