{
   "Name": "Agent Steel",
   "Sections": [
      "1 Biography",
      "1.1 Early years and split (1984–1988)",
      "1.2 First reformation (1998–2009)",
      "1.3 Reunion with John Cyriis and second hiatus (2010–2011)",
      "1.4 Second reformation (2018–present)",
      "2 Discography",
      "3 Members",
      "3.1 Current Members",
      "3.2 Former Members",
      "4 References"
   ],
   "Summary": {
      "text": [
         "Agent Steel is an American speed metal band from Los Angeles, California, United States, formed in 1984 by vocalist John Cyriis with drummer Chuck Profus. The band released two full-length albums, and one EP before disbanding in 1988. They were most notable for Cyriis' high-pitched vocals, catchy songs, melodic riffs, and fast tempos mixed in with interest in UFOs. Agent Steel reformed in 1998 (without Cyriis, although he would return to the band in 2010, only to leave again in 2011) and released three more full-length albums before going on hiatus in 2011. The band reformed again in 2018, this time with Cyriis returning as the vocalist and without the previous members, and they will release their first studio album in 14 years, No Other Godz Before Me, in 2021.[1]\n"
      ]
   },
   "Biography": {
      "Early years and split (1984–1988)": {
         "text": [
            "Agent Steel was formed by John Cyriis shortly after his firing from Megadeth in 1984, as guitarist and now lead vocalist Dave Mustaine was against the idea of playing the “Aliens Card.”[3] In all actuality, however, Agent Steel does not exclusively touch upon subjective matter relating to the possibility of life existing on other galaxies — but instead the philosophical format of the band was presented in a form of a polemic.\n",
            "The first legal registration of the name Agent Steel was registered by Cyriis on July 23, 1984 as a DBA at the Los Angeles County Clerk's Office. Beforehand, however, Agent Steel was initially named Sanctuary.\n",
            "Agent Steel's first incarnation recorded a demo in the studio, titled “144,000 Gone” in the summer of ’84. “144,000 Gone” was written by Cyriis when he was a guitarist in his previous band Sceptre, an underground metal band formed in Los Angeles in 1983 with his best friends, Tony and Phil Sardo. The lineup — whom Cyriis personally invited — consisted of drummer Chuck Profus, guitarists Bill Simmons and Mark Marshal, and bassist George Robb, respectively. They accepted the offer gratefully, but in the end only two out of the four who were invited stayed in the lineup until the group disbanded — this for reasons unknown. Another member named John Gott joined, but left shortly afterwards. New guitarists Juan Garcia and Kurt Colfelt joined the band. From December 1984 to February 1985, they recorded their debut album Skeptics Apocalypse, which was released in June 1985 by Combat Records. Until this day, \"Skeptics Apocalypse\" is a world-renowned Speed Metal classic; its most popular song, \"Agents of Steel\", has over half a million listens on YouTube as of 2020.\nShortly after the band's debut album was released, a falling out with John Cyriis led to the departure of Colfelt. Colfelt was then replaced with new guitarist Bernie Versailles.\n",
            "In October 1985, the band recorded an EP titled Mad Locust Rising, which was released in January 1986. Bassist George Robb was fired after the recordings and was replaced by Letchen Grey bassist Michael Zaputil shortly after.\n",
            "In March 1986, Agent Steel entered the studio once again to record their second album Unstoppable Force. The recordings came to a halt when the band went to perform at the Aardschok Dag Festival in Eindhoven in April 1986. In May 1986, they toured Europe with Anthrax and Overkill before returning to the studio to finish the recordings in June 1986. The album's release was then delayed due to complications with the cover artwork. An early 1987 release was then planned. In November 1986, Capitol Records expressed interest in signing the band, who had recently signed Megadeth. The band's management demanded more money, in which the label agreed to, with a stipulation that the band would have to wait until the new year to release the album, and with the acquisition of new department budgets. John Cyriis and Chuck Profus moved to Florida for various reasons, while the rest of the members remained in California.\n",
            "In January 1987, Capitol Records withdrew from the offer due to suspicions within the band's line-up changes. Unstoppable Force was released in March 1987 by Combat Records instead. Cyriis and Profus were then joined by guitarists James Murphy and Jay Weslord, and bassist Richard Bateman. The new line-up performed shows in Europe with Nuclear Assault in June 1987, one of them being at the Hammersmith Apollo, in which their final performance can be seen on the 1989 home video Mad Locust Rising.\n",
            "In 1988 the band disbanded, as their record label, Combat Records, put them on suspension. This suspension lasted for as long as the band's contract with the label lasted — about three years or so.\n",
            "In an interview, Cyriis stated his version as to why Agent Steel was disbanded in 1988:\n“....Agent Steel was buried alive by Combat Records, who put the band on suspension for no legitimate, justifiable reason. Why they did so, remains a mystery to this very day. There are many conspiracy theories’ that dabble with the answer as to why Combat Records buried the Agent Steel band in 1987; however, there are many theories as to why this happened - including a few of my own - but all the same, no substantial proof as of this writing have been brought out supported by facts, to support the more popular theories which are in truth actual cover ups to the real factual based truth!”[4]\n"
         ]
      },
      "First reformation (1998–2009)": {
         "text": [
            "In 1998, guitarists Juan Garcia and Bernie Versailles reformed Agent Steel without Cyriis' consent, featuring returning members Chuck Profus and Michael Zaputil, and new vocalist Bruce Hall. Zaputil left the band shortly after and new bassist Karlos Medina would replace him. The third album Omega Conspiracy was released on October 25, 1999. In 2001, the band changed their name to Order of the Illuminati due to legal pressure from Cyriis. Profus left the band in 2002 and was replaced with new drummer Rigo Amezcua. They would return to the Agent Steel name and would record their fourth album Order of the Illuminati, the same name they performed as at the time. It was released on June 10, 2003.[5][6][7][8] In 2004, the band performed at the Dynamo Open Air festival,[9] which is featured as a DVD, released on March 21, 2005, and also touring Europe with the band After All in the spring of 2005.[10] On August 31, 2007, the fifth album Alienigma was released.[11][12]\n"
         ]
      },
      "Reunion with John Cyriis and second hiatus (2010–2011)": {
         "text": [
            "On April 24, 2010, vocalist Bruce Hall announced his departure. He explained why, \"I complain a lot and I've pretty much lost my stamina for bothering with anything new as far as Agent Steel goes. Sadly, the continual walk in John's shoes has entirely drained my passion for doing anything other than treating Agent Steel as a cover band. Y'know, go out, play the first two albums for a free trip to wherever and call it a swell hobby? Well, that wasn't going to work for anyone in the band but me. They still have the fire and desire to continue making new music with Agent Steel and I wish them the very best of luck with whomever they get to fill John's shoes\".[13] On May 3, 2010, Agent Steel announced that they would reunite with John Cyriis.[14] They performed at the Thrash Domination event on September 18 & 19 in Kawasaki, and was also rehearsing their classic material as well as working on new songs for a future album release, in which one of the tracks that Cyriis would write lyrics to had a working title of \"Behold...The Great Race\".[15]\n",
            "On January 24, 2011, Agent Steel announced that Cyriis would not perform with the band on the 70000 Tons of Metal cruise due to \"unfortunate events\". Helstar vocalist James Rivera and Steel Prophet vocalist Rick Mythiasin would fill in for him, in which they would perform as Masters of Metal.[16] On February 24, 2011, the band would cancel their appearance at the Keep It True festival in April. The organizers of the event explained that they were \"facing totally new demands from one part of the band, that we, as a still small and dedicated festival, could not meet and really also do not want to meet. This, plus the troubles within the band itself, led to the final cancellation of Agent Steel with John Cyriis.\" Guitarist Juan Garcia denied any rumors that Rick Mythiasin was the band's new vocalist, but was only a temporary fill-in for Cyriis. Due to the circumstances surrounding the band, the organizers invited Agent Steel to still perform, but under a different name, and that Mythiasin would be invited to perform onstage with them.[17] Cyriis later returned to the band and performed at the Sweden Rock Festival, which was claimed to be his final performance with the band, but was refuted by Cyriis during the event.[18] Despite his apparent return, he would perform with his band S.E.T.I. at the Headbangers Open Air festival in July.[19]\n",
            "Meanwhile, the remaining members of Agent Steel have continued to perform as Masters of Metal, releasing their debut album From Worlds Beyond on September 18, 2015.[20]\n"
         ]
      },
      "Second reformation (2018–present)": {
         "text": [
            "In November 2018, John Cyriis returned once more to reform Agent Steel, fronting a line-up of new members. He announced that the band would perform at the Keep It True festival in April 2019, and release their first studio album in twelve years, originally titled 8 Lights Protocol, with a tentative September 2019 release.[21] At the time of the event, the band performed for only 30 minutes instead of the originally scheduled one hour set. German-based magazine Underground Empire explained in an Instagram post that the band started later \"because of a traffic jam\", which then caused complaints from fans. The band posted a photo of the show the next day with the caption, \"Germany truly was a phenomenon, but only the very beginning...\"[22] On June 20, 2019, the new members were revealed as guitarist Nikolay Atanasov, original guitarist Bill Simmons, bassist Joe McGuigan and drummer Dennis Kruse Strømberg. They signed to Dissonance Productions and had changed the title of their sixth studio album to No Mercy from the Godz, which was originally due for release on October 18, 2019, with a tour to follow in late 2019 and throughout 2020.[23] In July 2019, the band announced that they changed the title of the album again to No Others Godz Before Me.[24] In December 2019, Agent Steel released two visualizer videos for demo versions of two new songs titled \"Separation of Church and Fate\" and \"Way of the Mechanism\".[25] After a two-year delay, No Other Godz Before Me will be released on March 19, 2021.[1]\n"
         ]
      },
      "text": [
         "[2]\n"
      ]
   },
   "Discography": {
      "text": [
         "\n",
         "\n"
      ]
   },
   "Members": {
      "Current Members": {},
      "Former Members": {
         "text": [
            "\n",
            "\n",
            "Timeline\n"
         ]
      }
   },
   "References": {},
   "coreData": [
      "Agent Steel is an American speed metal band from Los Angeles, California, United States, formed in 1984 by vocalist John Cyriis with drummer Chuck Profus. The band released two full-length albums, and one EP before disbanding in 1988. They were most notable for Cyriis' high-pitched vocals, catchy songs, melodic riffs, and fast tempos mixed in with interest in UFOs. Agent Steel reformed in 1998 (without Cyriis, although he would return to the band in 2010, only to leave again in 2011) and released three more full-length albums before going on hiatus in 2011. The band reformed again in 2018, this time with Cyriis returning as the vocalist and without the previous members, and they will release their first studio album in 14 years, No Other Godz Before Me, in 2021.[1]\n",
      "[2]\n",
      "Agent Steel was formed by John Cyriis shortly after his firing from Megadeth in 1984, as guitarist and now lead vocalist Dave Mustaine was against the idea of playing the “Aliens Card.”[3] In all actuality, however, Agent Steel does not exclusively touch upon subjective matter relating to the possibility of life existing on other galaxies — but instead the philosophical format of the band was presented in a form of a polemic.\n",
      "The first legal registration of the name Agent Steel was registered by Cyriis on July 23, 1984 as a DBA at the Los Angeles County Clerk's Office. Beforehand, however, Agent Steel was initially named Sanctuary.\n"
   ]
}