{
   "Name": "The Aggrolites",
   "Sections": [
      "1 Overview",
      "2 Band members",
      "3 Past members",
      "4 Films",
      "5 Albums",
      "5.1 Compilations",
      "5.2 DVDs",
      "5.3 Music videos",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "The Aggrolites are an American reggae band from Los Angeles, California, United States, which formed in 2002.\n"
      ]
   },
   "Overview": {
      "text": [
         "The Aggrolites are an amalgamation of two previous Los Angeles reggae and ska bands, the Vessels and the Rhythm Doctors. They formed in 2002 as a live backing band for reggae icon Derrick Morgan, and were asked to record music for a new Morgan album. The project was never released, but the recording sessions inspired the Aggrolites to become a permanent band. They have served as the backing band for Phyllis Dillon, Scotty, Joseph Hill of Culture, Prince Buster, and Tim Armstrong.\n",
         "Regarding their musical style, Aggrolites organist Roger Rivas has stated that a combination of the sounds of 1960s soul music, funk, and skinhead reggae (also known simply as  early reggae) constitutes what the band has dubbed \"Dirty Reggae.\" [1]\n",
         "In 2003, the Aggrolites released their debut album, Dirty Reggae, on local reggae label Axe Records. The album was recorded at Signet Studios in Los Angeles in one day, with each song recorded in one take, and with many lyrics improvised on the spot. In November 2004, the Aggrolites were featured on Hellcat Records compilation Give 'Em the Boot IV, and were officially signed to Hellcat in October 2005. The Aggrolites' self-titled Hellcat debut was released on May 9, 2006. In December 2006 they toured the UK as the support band for Madness. The Aggrolites finished a collaboration with Rancid frontman Tim Armstrong for his new solo album, A Poet's Life. They are providing the instrumentals with Tim as lead singer.\n",
         "They released a new album on June 5, 2007 called Reggae Hit L.A., which won an IGN award for Best Reggae Album of 2007.\n",
         "The Aggrolites made an appearance on the Nick Jr. show Yo Gabba Gabba!, created by Christian Jacobs, lead singer of The Aquabats.\n",
         "In mid-2007, original bassist J Bonner quit the band and played his last show on August 12, 2007 in Washington DC. He was replaced by Hepcat bassist David Fuentes. Fuentes died on September 23, 2007.[2]\n",
         "The band entered the studio in early 2009 to record their fourth album. It was released June 9, 2009 and titled IV.[3]\n",
         "The band is kicking off a US tour in October 2009 before joining Slightly Stoopid for a run of dates in November 2009.\n",
         "The band released their fifth studio album, Rugged Road, on February 22, 2011. It is their first album for Young Cub Records.\n",
         "In 2015 the band released three new songs on Bandcamp. Later that songs were re-recorded for their sixth studio album, REGGAE NOW!, released on May 24, 2019. It is their first album for Pirates Press Records.\n"
      ]
   },
   "Band members": {},
   "Past members": {},
   "Films": {
      "text": [
         "The band's song \"Free Time\" from the album Reggae Hit L.A. was featured in the film Bandslam.\nThe band's song \"Work To Do\" was featured in the film 50/50\n"
      ]
   },
   "Albums": {
      "Compilations": {},
      "DVDs": {},
      "Music videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Aggrolites are an American reggae band from Los Angeles, California, United States, which formed in 2002.\n",
      "The Aggrolites are an amalgamation of two previous Los Angeles reggae and ska bands, the Vessels and the Rhythm Doctors. They formed in 2002 as a live backing band for reggae icon Derrick Morgan, and were asked to record music for a new Morgan album. The project was never released, but the recording sessions inspired the Aggrolites to become a permanent band. They have served as the backing band for Phyllis Dillon, Scotty, Joseph Hill of Culture, Prince Buster, and Tim Armstrong.\n",
      "Regarding their musical style, Aggrolites organist Roger Rivas has stated that a combination of the sounds of 1960s soul music, funk, and skinhead reggae (also known simply as  early reggae) constitutes what the band has dubbed \"Dirty Reggae.\" [1]\n",
      "In 2003, the Aggrolites released their debut album, Dirty Reggae, on local reggae label Axe Records. The album was recorded at Signet Studios in Los Angeles in one day, with each song recorded in one take, and with many lyrics improvised on the spot. In November 2004, the Aggrolites were featured on Hellcat Records compilation Give 'Em the Boot IV, and were officially signed to Hellcat in October 2005. The Aggrolites' self-titled Hellcat debut was released on May 9, 2006. In December 2006 they toured the UK as the support band for Madness. The Aggrolites finished a collaboration with Rancid frontman Tim Armstrong for his new solo album, A Poet's Life. They are providing the instrumentals with Tim as lead singer.\n"
   ]
}