{
   "Name": "The Airborne Toxic Event",
   "rawData": [
      "The Airborne Toxic Event is an American rock band from Los Angeles, California, formed in 2006. It consists of Mikel Jollett (vocals, guitar, keyboards), Steven Chen (guitar, keyboards), Adrian Rodriguez (electric bass, backing vocals), Daren Taylor (drums), and Miriam \"Mimi\" Peschet (backing vocals, violin). Anna Bulbrook (vocals, violin) was formerly a member of the band.\n",
      "Named after a section in Don DeLillo's novel White Noise, the group is known for its blend of rock music and orchestral arrangements, having performed frequently with the Calder Quartet, a string quartet based in Los Angeles. The group has also played concerts with the Louisville Orchestra and the Colorado Symphony Orchestra.\n",
      "\nInitially a writer and essayist, Jollett began seriously writing songs with an acoustic guitar following a week in March 2006, during which he underwent a break-up, learned his mother had been diagnosed with cancer, and was himself diagnosed with a genetic autoimmune disease that led to the development of two cosmetic conditions: Alopecia areata and Vitiligo. This quick succession of traumatic events spurred a period of intense songwriting, and it was around this time that he first met Taylor through a mutual friend in Silver Lake, Los Angeles. "
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Indie rock",
         "alternative rock",
         "post-punk revival"
      ],
      "Years active": [
         "2006–present"
      ],
      "Labels": [
         "Rounder",
         "Majordomo",
         "Island",
         "Epic[1]"
      ],
      "Website": [
         "www.theairbornetoxicevent.com"
      ],
      "Members": [
         "Mikel Jollett",
         "Steven Chen",
         "Daren Taylor",
         "Adrian Rodriguez"
      ],
      "Past members": [
         "Noah Harmon",
         "Anna Bulbrook"
      ]
   },
   "albums": [
      "The Airborne Toxic Event",
      "All at Once",
      "Such Hot Blood",
      "Dope Machines",
      "Songs of God and Whiskey",
      "Hollywood Park"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Los Angeles, California, formed in [YEAR]. It consists of [PERSON_NAME_FULL_2_MALE] (vocals, guitar, keyboards), Steven Chen (guitar, keyboards), [PERSON_NAME_FULL_1_MALE] (electric bass, backing vocals), Daren Taylor (drums), and Miriam [SONG_NAME] Peschet (backing vocals, violin). [PERSON_NAME_FULL_0_FEMALE] (vocals, violin) was formerly a member of the band.\n",
      "Named after a [GENRE] a string quartet based in Los Angeles. The group has also played concerts with the Louisville Orchestra and the Colorado Symphony Orchestra.\n",
      "\nInitially a [GENRE] an acoustic guitar following a week in [MONTH] [YEAR], during which he underwent a break-up, learned his mother had been diagnosed with cancer, and was himself diagnosed with a genetic autoimmune disease that led to the development of two cosmetic conditions: Alopecia areata and Vitiligo. This quick succession of traumatic events spurred a period of intense songwriting, and it was around this time that he first met Taylor through a mutual friend in Silver Lake, Los Angeles. "
   ]
}