{
   "Band members": {
      "Current members": {},
      "Past members": {},
      "Touring members": {}
   },
   "Discography": {},
   "External links": {},
   "History": {
      "\"Neda\", All I Ever Wanted: Live from Walt Disney Concert Hall (2010)": {
         "text": [
            "\nOn June 7, 2010, the Airborne Toxic Event released a song and video titled \"Neda,\" in recognition of the one-year anniversary of the Death of Neda Agha-Soltan, the young Iranian woman who was killed during the protests of the disputed 2009 presidential election of Mahmoud Ahmadinejad in Iran. In conjunction with Amnesty International, the band also launched a website, nedaspeaks.org, to raise awareness about Agha-Soltan's death and the human rights struggle in Iran. The music video features a series of animated stills depicting the events surrounding Agha-Soltan's death, interspersed with text.[17] ",
            "As part of its website, the band encouraged visitors to submit a photo of themselves holding a sign reading \"I am Neda.\" Celebrities who participated in the project include Alyssa Milano, Paul Haggis, and Ne-Yo, among others. All proceeds from the sale of the single on iTunes were donated to Amnesty International. In addition, the band held a benefit concert at the Echo in Los Angeles on May 25, 2010. One of the attendees at the show was Jimmy Delshad, mayor of Beverly Hills and the highest-ranking Iranian American elected official in the United States.\n",
            "On July 14, 2010, the band announced the release of the documentary DVD and CD All I Ever Wanted: Live From Walt Disney Concert Hall, on September 7, 2010 in North America and October 4, 2010 in Europe. The North American release date was later moved to September 29, 2010. The film premiered at the Vista Theatre in the Los Feliz, Los Angeles on September 2, 2010, at the Sunshine Theater in New York on September 9, and at the Raindance Film Festival in London on September 30.\n",
            "The film, directed by Danovic, features the Airborne Toxic Event's December 4, 2009 Walt Disney Concert Hall performance in its entirety, interspersed with a behind-the-scenes narrative chronicling the band's extensive preparations for the show. The non-concert footage includes extensive rehearsals with the Calder Quartet, the Belmont High School marching band, and the Lalo Guerrero children's choir. Stylistically, the film splices rehearsal footage with concert footage for most of the songs performed, in addition to switching between black-and-white and color video. The performance features non-album tracks, including the title track \"All I Ever Wanted,\" \"A Letter to Georgia,\" \"Duet,\" and \"This Losing.\" It also includes cover versions of \"Goodbye Horses,\" by Q Lazzarus, \"The Book of Love\" by The Magnetic Fields, and \"Do You Remember Rock 'n' Roll Radio?\" by the Ramones. The DVD release also includes an additional CD containing an audio recording of the entire concert.\n",
            "In support of the DVD release, the group spent September and October 2010 on a sold-out, three-week North American and U.K. acoustic tour, with the Calder Quartet joining them for the North American leg of the tour. They performed at a series of non-traditional venues, including the Sixth & I Synagogue in Washington D.C., Town Hall in New York, Trinity Church in Toronto, the John Anson Ford Amphitheatre in Los Angeles, and the Union Chapel  in London.  In John Earls News of the World review of the Union Chapel show, he  wrote \"Debuting seven terrific new songs to make the heart soar, Toxic's stirring tunes certainly get in the bloodstream.\"\n"
         ]
      },
      "All at Once (2011–2012)": {
         "text": [
            "The Airborne Toxic Event's second album, All at Once, was released on April 25, 2011 in Europe, and April 26 in North America. Written during the latter half of 2009 and most of 2010, the record was produced in Los Angeles by Dave Sardy, who also produced albums by Oasis, Band of Horses, LCD Soundsystem, Wolfmother, and Autolux. An acoustic version of one of the songs from the album, \"Half of Something Else,\" appeared on the soundtrack for the film Going the Distance, directed by Nanette Burstein and starring Drew Barrymore and Justin Long.\n",
            "\nOn January 22, 2011, the band played a concert with the Colorado Symphony Orchestra at Boettcher Concert Hall in Denver, debuting orchestral arrangements of songs from All at Once, in addition to those from the first record.[18] Previously, it performed with the Louisville Orchestra at The Kentucky Center for the Performing Arts’ Whitney Hall on January 30, 2010, as part of the orchestra's \"BB&T Strings Attached\" series.[19] ",
            "On February 1, 2011, the Airborne Toxic Event released two separate first singles from the album in North America and Europe, respectively. In North America, the single was \"Changing\", while in Europe, it was \"Numb\". In its October 9, 2010 issue, Music Week wrote, \"The LA group's new material is the sound of a band defining their identity. Produced by Dave Sardy, this is confident, ambitious and radio-friendly.\" [20]\n",
            "Also on February 1, 2011, the band embarked on a one-month tour of continental Europe, composed partly of three simultaneous musical residencies in Amsterdam (Mondays), Berlin (Tuesdays), and Paris (Fridays). Other cities visited on the tour, on Wednesdays and Thursdays, were Antwerp, Münster, Hamburg, Munich, Cologne, Frankfurt, and Zurich. In addition, the band played HMV Group's Next Big Thing music festival at Heaven in London on February 10.[21]\n",
            "As a follow-up to the series of one-take acoustic videos released in the lead-up to its first album, the group announced the \"Bombastic\" on February 15, 2011—a series of similar one-take acoustic videos of all the songs from All at Once, directed by Danovic. As with the first series, the band indicated that it would release one video each week. The first video released was a performance of All at Once’s title track, featuring the Calder Quartet, the Lalo Guerrero School of Music children's choir, and music students from the Plaza de la Raza Community Center in East Los Angeles.[22] On February 22, the Airborne Toxic Event released its second \"Bombastic\" video, a performance of the song \"All for a Woman\" inside the First Baptist Church in Koreatown, Los Angeles.[23]  The March 2nd release featured a slightly different arrangement of \"All I Ever Wanted,\" performed with the Calder Quartet at the Colburn School Conservatory of Music.[24] On March 9, 16, 22, and 30 and April 7, 13, 20, and 27 the band released acoustic versions of \"It Doesn't Mean a Thing\", \"Welcome to Your Wedding Day\", \"The Kids Are Ready to Die\", \"Strange Girl\", \"Changing\", \"Numb\", \"Half of Something Else\", and \"The Graveyard Near the House\", respectively.\n",
            "On March 4, 2011, the Airborne Toxic Event released two music videos for its singles \"Changing\" and \"Numb,\" both from All at Once. Both were directed by Danovic. The video for \"Changing\" features members of the Strikers All-Stars, a Los Angeles-based dance crew known for its community outreach, as well as collaborations with artists such as Rihanna and Lil Wayne. The video for \"Numb\" premiered on MTV UK.\n",
            "Following a showcase in March at Stubb's BBQ for 2011's South by Southwest music conference, the band embarked on a North American and European tour in support of All at Once, which began on April 4 in Nottingham, UK. Of these, 15 shows constituted what the band dubbed the \"Origins Tour,\" consisting of five shows each in London, Los Angeles, and New York. Beginning with the smallest venues in each city, these 15 dates  encompassed a range of differently sized venues in which the group has played since its inception.[25] For the North American leg that followed, the tour's opening slot was filled by Voxhaul Broadcast, from Los Angeles, and then later by Mona from Nashville. The tour concluded on June 16 in Sacramento, CA.\n",
            "The band appeared in the season finale of Gossip Girl, “The Wrong Goodbye”, which aired on May 16, playing \"All for a Woman\" and \"Changing\". Reaching No. 4 on the Alternative Song charts, \"Changing\" was also featured, throughout June and July, on a television trailer for Crazy, Stupid, Love, starring Steve Carell and Ryan Gosling.\n",
            "On July 26, 2011 the group announced its Fall World Tour, with dates in North America and Europe, beginning on October 9 in Denver and concluding on December 6 in Tempe, AZ. Mona and The Drowning Men, both of whom toured with the band previously, are set to open most of the North American dates. One of the shows for the tour is a headlining slot for LA Weekly's annual \"LA 101\" festival, scheduled for October 23, 2011 at the Gibson Amphitheatre.[26]\n",
            "On September 30, 2011 the band performed its second single, \"All I Ever Wanted,\" with the Calder Quartet on The Tonight Show with Jay Leno.\n",
            "On October 21, 2011, the Airborne Toxic Event released the official video for \"All I Ever Wanted,\" stating that both the song and the video are loosely based on the short story \"The Hitchhiking Game\" by Milan Kundera.\n",
            "On February 1, 2012 the band performed \"All I Ever Wanted\" with the Calder Quartet on the 30th Anniversary episode of \"The Late Show with David Letterman\".\n"
         ]
      },
      "Dope Machines and Songs of God and Whiskey (2014–2017)": {
         "text": [
            "On January 22, 2014, it was announced in a fan email that Ashley Dzerigian would be replacing Noah Harmon on bass for a series of shows in 2014, as Noah takes a paternity leave of absence. It was subsequently announced on the band's website on February 5, 2014, that Ashley Dzerigian had unforeseen circumstances that would prevent her from joining the tour. The new replacement for Noah Harmon is Adrian Rodriguez. As of August 5, 2014 Noah has confirmed via his personal Instagram that he has been fired from The Airborne Toxic Event with a message in which he simply stated \"I got fired. 7 years, 0 regrets. Good luck\".[28]\n",
            "On October 3, 2014, the band premiered \"Wrong\", the lead single off their fourth studio album, on Philadelphia radio station Radio 104.5.[29] \nIt was later confirmed on the site of San Diego radio station 91X that the upcoming album would be titled Dope Machines.[30] On February 23, 2015, a day before the release of Dope Machines, the band announced via their Facebook page that they'd be releasing a second album the next day, in addition to Dope Machines, titled Songs of God and Whiskey.\n[31]\nThe second album would be acoustic and focus more on rock and roll than the electronic synth pop in Dope Machines. The album would be composed of songs written throughout the ten years before the album's release.\n",
            "In October 2016, the band released a new single titled \"America\" in preparation for their 2017 tour.\n"
         ]
      },
      "Formation and early years (2006–2007)": {
         "text": [
            "\nInitially a writer and essayist, Jollett began seriously writing songs with an acoustic guitar following a week in March 2006, during which he underwent a break-up, learned his mother had been diagnosed with cancer, and was himself diagnosed with a genetic autoimmune disease that led to the development of two cosmetic conditions: Alopecia areata and Vitiligo. This quick succession of traumatic events spurred a period of intense songwriting, and it was around this time that he first met Taylor through a mutual friend in Silver Lake, Los Angeles.[2] ",
            "Throughout the summer of 2006, Jollett and Taylor rehearsed several of Jollett's songs, including early incarnations of \"Wishing Well,\" \"Missy,\" and \"Innocence,\" which would eventually appear on the band's debut album. After a few months of rehearsals, Jollett ran into Anna Bulbrook one night at El Gran Burrito, a popular outdoor Mexican restaurant in Silver Lake. Trained in orchestral and chamber music, she had just moved to Los Angeles from New York City. Though they were just acquaintances at the time, he remembered that she played the violin and asked her to attend one of his and Taylor's rehearsals. Afraid to bring her more expensive violin to a rock rehearsal, she agreed to bring her viola instead. Jollett then asked Harmon, a Tucson native and graduate of the Herb Alpert School of Music at the California Institute of the Arts, to join his fledgling band, having seen him perform in Los Angeles with other acts and been impressed with his background in rock and jazz, as well as his skill with the upright bass. At the time, Harmon was performing with multiple rock and jazz bands while teaching guitar to children both in East Los Angeles as part of CalArts' Community Arts Partnership, and at Arroyo Seco Park (Highland Park, CA) as part of its \"Art in the Park\" program. He refused at first, and it wasn't until months later—after several shows—that Harmon agreed to join the group full-time. Chen and Jollett, meanwhile, had already known each other for five years. They first met through a mutual friend while both were living in San Francisco and working as writers. After a few years of living in New York, Chen made a return to his hometown of Los Angeles, upon which Jollett contacted him and asked if he'd be interested in playing the keyboard in the band. Chen replied that he, in fact, played guitar and eventually filled the role as lead guitarist.\n",
            "Prior to the formation of the band, and to supplement his fiction writing, Jollett supported himself as a freelance writer, contributing to NPR, Los Angeles Times, Filter and Men's Health, among other organizations. Soon after the formation of the band, he concentrated only on fiction. In the summer of 2008, McSweeney's issue 27 published one of Jollett's short stories, The Crack, which appeared between short stories by Liz Mandrell and Stephen King.[3] In keeping with his literary background, Jollett named the band after a section of the postmodern novel White Noise by Don DeLillo,[4] which won the National Book Award in 1985. In the book, a chemical spill from a railcar releases a poisonous cloud, dubbed by the military and media as an \"airborne toxic event.\" The reason for choosing this as the name of the band, he has stated, is that the event described in the novel triggers a fear of death and a sense of mortality that fundamentally alters the protagonist's outlook on himself, his family, and his life. The band was born of a similar life-altering sequence of events, and thus, the themes of mortality and media consumption that arise from the novel's toxic cloud serve as a major impetus for the band's creative drive.\n",
            "The Airborne Toxic Event played its first show at the Echo, a venue in Echo Park, in October 2006—less than a month after it was fully formed. The show was well attended, and the following month, the band played the CMJ Music Marathon. In December 2006, Rolling Stone named the group one of the \"Top 25 Bands on MySpace.\"[5] The band went on to receive positive feedback and reviews from music blogs and press, most notably the L.A. Weekly[6] and the Los Angeles Times,[7] the latter of which named the group one of the top three L.A. bands to watch in 2008. Previous bands to receive this distinction include Cold War Kids and Silversun Pickups.\n",
            "In the summer of 2007, the U.K. indie label Square Records released a 7-inch single of the Airborne Toxic Event song \"Does This Mean You Are Moving On?\" [8] To support the release, the band embarked on a ten-day tour of the U.K., playing shows in London and Brighton. Upon returning, the band recorded 14 tracks with producer Pete Min at his home studio in the Atwater Village, Los Angeles, while continuing to perform around Los Angeles. Ten of the tracks recorded at Min's home would later comprise the band's debut album.\n",
            "In December 2007, the band premiered the song \"Sometime Around Midnight\" with a live performance of the song on  Indie 103.1's local music show Check One Two. In January 2008, the band played a five-show weekly residency presented by  Indie 103.1 at the popular Silver Lake venue Spaceland, chronicled in a short YouTube video titled \"Thursdays in January\".[9] During the second-to-last week of the residency, Los Angeles commercial radio stations KROQ-FM and Indie 103.1 (KDLD) officially added the as-yet-unsigned band's song \"Sometime Around Midnight\" to regular rotation. Providence's WBRU,  Seattle's KEXP-FM, San Francisco's Live 105 (KITS), San Diego's 91X (XETRA-FM), Boston's WFNX, and Sacramento's KWOD 106.5 soon followed suit, showing significant support for the group.\n",
            "In April 2008, after an extensive courtship from major labels, the Airborne Toxic Event signed with the indie label Majordomo Records, based in Los Angeles. Soon after that, on April 24, the band made its national television debut as the musical guest on the late-night NBC talk show Last Call with Carson Daly.\n"
         ]
      },
      "Hollywood Park (2018–present)": {
         "text": [
            "In September 2019, it was announced that Anna Bulbrook would be leaving the band, and that the band had been working on a new project.[32] On November 12, 2019, frontman Mikel Jollett announced via Twitter that the band would be releasing their sixth studio album, Hollywood Park, on May 8, 2020,[33] through Rounder Records. The album acts as a companion piece to Jollett's memoir of the same name, which will be released three days prior on May 5 through Celadon Books.[34] On December 20, 2019, Hollywood Park was named one of the 30 most anticipated books of 2020 by O, The Oprah Magazine.[35]\n"
         ]
      },
      "Such Hot Blood (2012–2013)": {
         "text": [
            "On July 2, 2012, The Airborne Toxic Event announced that they were in the process of recording their third studio album with Jacquire King. They also announced that the band is playing Red Rocks with the Colorado Symphony on September 20, 2012, with Colorado band DeVotchKa, and that this will be the first show of the upcoming record run.[27]\n",
            "On January 14, 2013, the band announced the name of their third album as Such Hot Blood, with the first single, \"Timeless\", released on January 22. On April 22, the band announced via their Facebook page that AOL's Spinner will be streaming the full album. \"Such Hot Blood\" was released on April 30 in North America.\nOn July 16, 2013, it was announced via their website that the band would be touring Europe and the UK in fall 2013. Starting on October 1, the band played in several venues in the UK, Germany, the Netherlands and Belgium.\n"
         ]
      },
      "The Airborne Toxic Event (2008–2009)": {
         "text": [
            "On August 5, 2008, the band released its first full-length album, The Airborne Toxic Event, featuring ten of the 14 songs recorded at Min's home studio at the end of 2007 and beginning of 2008. On August 1, coinciding with the release, the group performed \"Sometime Around Midnight\" on Late Night with Conan O'Brien.\n",
            "The record was received with mostly favorable reviews from such outlets as the Los Angeles Times, Newsweek, Q, Entertainment Weekly, and Drowned in Sound, among others. Notably, the Boston Herald named the band's album \"The Debut Album of the Year.\"[10] In addition, on December 6, 2008, iTunes named \"Sometime Around Midnight\" the No. 1 Alternative Song of the Year on their Best of 2008 list.[11] One exception was the review on the music website Pitchfork Media, by Ian Cohen, who gave the record 1.6 out of 10 stars and accused the band of imitating the worst aspects of bands such as Arcade Fire, The Strokes, and Interpol.[12] In response, the band released a statement saying that it does not take reviews too seriously and criticized Pitchfork for basing their critiques on \"a band's ability to match a certain indie rock aesthetic\" rather than a band's other merits, and claiming that much of the review \"reads less like a record review and more like a diatribe against a set of ill-considered and borderline offensive preconceptions about Los Angeles\".[13]\n",
            "To promote the album, the band released a series of one-take acoustic videos for each song on the record, filmed in different locations around Los Angeles. Each video was released in the order of the track listing on the album each week, with the final video (\"Innocence\") released in the first week of August to coincide with the album release. Some of the locations included the Los Angeles River, Griffith Park, and the Colburn School Conservatory of Music. Two of the acoustic videos featured the band performing in moving vehicles; \"Does This Mean You’re Moving On?\" was performed in a car on Sunset Boulevard, while \"Something New\" was performed on a boat at Marina Del Rey with Taylor both steering the boat and tapping a snare drum with his free hand.\n",
            "Beginning in July 2008, the band embarked on a series of tours in support of the album, which continued for approximately a year and a half. After touring various summer festivals, the band embarked on a North American tour opening for The Fratellis in the fall of 2008.\n",
            "Following that, the group played its \"30 Shows in 30 Days\" tour of the United Kingdom in November, during which it performed 30 nights in a row entirely in England and Scotland.[14] The tour incorporated a month-long residency at the Dublin Castle, located in London's Camden Town. The band has largely attributed its subsequent success in the U.K. to this tour, which also included shows in Derby, York,  Birmingham, Northampton, Leicester, Aldershot, Yeovil, Hayle, Southampton, Liverpool, Carlisle, Middlesbrough, Manchester, Hull, Leeds, Oxford, Brighton, Nottingham, Barrow-in-Furness, Stoke-on-Trent, Cardiff, Bristol, Sheffield, Preston, Dundee, Glasgow, and Fife.\n",
            "In January 2009, the Airborne Toxic Event embarked on its first headlining tour, beginning in the U.K., followed by two months in the United States and Canada. Meanwhile, bolstered by an unexpected addition to the playlist at the U.K.’s BBC Radio 1—an unusual occurrence for an unsigned American band—the group released its debut through an independent distributor in the UK on February 9, 2009. Also during this time, the group began performing on television with the Calder Quartet, a Los Angeles-based string quartet featuring Bulbrook’s brother on second violin. The quartet had previously played with the band for its record-release show at the El Rey Theatre in Los Angeles in August 2008, as well as appearing in two of its one-take acoustic videos, for \"Sometime Around Midnight\" and \"Innocence\". They joined the band for three television performances during the first half of 2009, including the Late Show with David Letterman on January 16, 2009, The Tonight Show with Jay Leno on April 14, 2009, and Jimmy Kimmel Live! on May 14, 2009. Soon after the Letterman performance, which garnered worldwide attention, the band's single “Sometime Around Midnight\" entered the top 10 on the US Alternative Radio Chart.\n",
            "The band toured almost constantly for the remainder of the year, throughout North America, the U.K., and continental Europe, performing during the summer at several festivals, including Coachella, Lollapalooza, T in the Park, Fuji Rock, the Reading and Leeds Festivals, Oxegen, Latitude Festival, FM4 Frequency Festival, Pukkelpop, A Campingflight to Lowlands Paradise, and the Sasquatch! Music Festival. The group's final tour for its debut album began on September 17, 2009 in Pomona, California and concluded in Oxford, U.K. on November 14. By the end of 2009, \"Sometime Around Midnight\" was the No. 10 Most Played Song at Alternative Radio for the year. It peaked at No. 4 and sold over 400,000 copies in the US. The band's debut album spent 8 weeks at No. 1 on Billboard's Heatseekers Chart (53 weeks in total on the chart) and has sold over 200,000 copies domestically and 300,000 worldwide.\n",
            "Due to this constant touring Jollett admitted that his writing career had to be put on hold. While he was writing an original novel in the early years of the formation of the band, the stresses and time constraint of touring made it nearly impossible to continue his current works.\n",
            "The group made five music videos for the album: \"Does This Mean You’re Moving On?\", directed by Jason Wishnow; \"Happiness is Overrated\", directed by Jon Danovic; \"Gasoline\", directed by Billy Johnson; and \"Sometime Around Midnight\", for which there were two separate videos, directed by Wishnow and D. J. Caruso.\n",
            "In early March 2009, the Airborne Toxic Event signed with Island Records.\n",
            "On March 10, 2009, during a live radio broadcast with U2 at the Metro Chicago, host Shirley Manson of Garbage asked the band to name some of its favorite songs. Bassist Adam Clayton chose \"Sometime Around Midnight\" as one of his selections, commenting that he felt he would be listening to their album the rest of the year.[15]  During its U2 360° Tour, U2 made a habit of playing a recording of the song in stadiums before taking the stage.\n",
            "On May 20, 2009, an entire episode of Last Call with Carson Daly was devoted to the Airborne Toxic Event, featuring interviews and excerpts from a show at the Glass House in Pomona, California.[16]\n",
            "On December 4, 2009, the Airborne Toxic Event played its final show in support of its debut album, giving a sold-out performance at the Frank Gehry-designed Walt Disney Concert Hall in Downtown Los Angeles. The show was presented by the Los Angeles Philharmonic and was the last of 354 shows performed by the band on its debut album cycle. The group was accompanied by the Calder Quartet, the Lalo Guerrero Children's choir, The Belmont High School marching band, Mexican Baile Folklorico dancers, and a number of guest musicians, including horn players and an accordionist.\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and early years (2006–2007)",
      "1.2 The Airborne Toxic Event (2008–2009)",
      "1.3 \"Neda\", All I Ever Wanted: Live from Walt Disney Concert Hall (2010)",
      "1.4 All at Once (2011–2012)",
      "1.5 Such Hot Blood (2012–2013)",
      "1.6 Dope Machines and Songs of God and Whiskey (2014–2017)",
      "1.7 Hollywood Park (2018–present)",
      "2 Discography",
      "3 Band members",
      "3.1 Current members",
      "3.2 Touring members",
      "3.3 Past members",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Airborne Toxic Event is an American rock band from Los Angeles, California, formed in 2006. It consists of Mikel Jollett (vocals, guitar, keyboards), Steven Chen (guitar, keyboards), Adrian Rodriguez (electric bass, backing vocals), Daren Taylor (drums), and Miriam \"Mimi\" Peschet (backing vocals, violin). Anna Bulbrook (vocals, violin) was formerly a member of the band.\n",
         "Named after a section in Don DeLillo's novel White Noise, the group is known for its blend of rock music and orchestral arrangements, having performed frequently with the Calder Quartet, a string quartet based in Los Angeles. The group has also played concerts with the Louisville Orchestra and the Colorado Symphony Orchestra.\n"
      ]
   },
   "Title": "The Airborne Toxic Event - Wikipedia"
}