{
   "Name": "Alcatrazz",
   "rawData": [
      "Alcatrazz is an English–American heavy metal band formed in 1983 by Graham Bonnet, Jimmy Waldo and Gary Shea. They are best known for their songs \"Island in the Sun\" and \"God Blessed Video\", and have gone through a number of line-up changes, leaving Bonnet as only member to be in every incarnation of Alcatrazz until his split with the band in 2020. They are also notable for featuring a previously-unknown Yngwie Malmsteen, who was the guitarist of Alcatrazz during 1983–1984, and was subsequently replaced by Steve Vai, Danny Johnson, and currently by Joe Stump.\n",
      "After breaking up in 1987, and reuniting for occasional live performances between 2006 and 2017, Alcatrazz reformed once more in 2019 under Bonnet and Waldo, and Shea would rejoin the band shortly. To date, the band has released four studio albums: No Parole from Rock 'n' Roll (1983), Disturbing the Peace (1985), Dangerous Games (1986) and Born Innocent (2020). Several months after the release of Born Innocent, Alcatrazz announced that they had parted ways with Bonnet, who was replaced by Doogie White; however, Bonnet later announced that he is intending to move forward with his own version of Alcatrazz, with a new lineup to be announced in the spring of 2021 and a new album in the works.\n",
      "The band's initial line-up consisted of former Rainbow singer frontman Graham Bonnet, young Swedish guitarist Yngwie Malmsteen, who had recently left the American band Steeler, Gary Shea and Jimmy Waldo from New England and Clive Burr of Iron Maiden fame. Burr was reportedly only in the band for a week, and left upon discovering the band was going to be based in the United States, as opposed to his native England. Burr was soon replaced by former Iron Butterfly drummer Jan Uvena, who had just left Alice Cooper's backing band. Shea dubbed the group \"Alcatrazz\". For the first album, the bulk of the material was written by Bonnet and Malmsteen, with Waldo contributing to several tracks.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Heavy metal"
      ],
      "Years active": [
         "1983–1987",
         "2006–2014",
         "2017",
         "2019–present"
      ],
      "Labels": [
         "Rocshire/MCA",
         "Capitol"
      ],
      "Associated acts": [
         "Rainbow",
         "New England",
         "Steeler",
         "Blackthorne",
         "Savage Paradise",
         "Vinnie Vincent Invasion",
         "Impellitteri",
         "Graham Bonnet Band"
      ],
      "Members": [
         "Doogie White",
         "Jimmy Waldo",
         "Joe Stump",
         "Mark Benquechea",
         "Gary Shea"
      ],
      "Past members": [
         "Graham Bonnet",
         "Clive Burr",
         "Yngwie Malmsteen",
         "Jan Uvena",
         "Steve Vai",
         "Danny Johnson"
      ]
   },
   "albums": [
      "No Parole from Rock 'n' Roll Tour - Live in Japan 1984.1.28",
      "Disturbing the Peace Tour - Live in Japan 1984.10.10"
   ]
}