{
   "Name": "Alcatrazz",
   "Sections": [
      "1 History",
      "2 Personnel",
      "2.1 Current members",
      "2.2 Former members",
      "2.3 Timeline",
      "2.4 Line-ups",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Live albums",
      "3.3 Compilations",
      "3.4 Singles",
      "3.5 Videos",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Alcatrazz is an English–American heavy metal band formed in 1983 by Graham Bonnet, Jimmy Waldo and Gary Shea.[1] They are best known for their songs \"Island in the Sun\" and \"God Blessed Video\", and have gone through a number of line-up changes, leaving Bonnet as only member to be in every incarnation of Alcatrazz until his split with the band in 2020. They are also notable for featuring a previously-unknown Yngwie Malmsteen, who was the guitarist of Alcatrazz during 1983–1984, and was subsequently replaced by Steve Vai, Danny Johnson, and currently by Joe Stump.\n",
         "After breaking up in 1987, and reuniting for occasional live performances between 2006 and 2017, Alcatrazz reformed once more in 2019 under Bonnet and Waldo, and Shea would rejoin the band shortly. To date, the band has released four studio albums: No Parole from Rock 'n' Roll (1983), Disturbing the Peace (1985), Dangerous Games (1986) and Born Innocent (2020). Several months after the release of Born Innocent, Alcatrazz announced that they had parted ways with Bonnet, who was replaced by Doogie White;[2] however, Bonnet later announced that he is intending to move forward with his own version of Alcatrazz, with a new lineup to be announced in the spring of 2021 and a new album in the works.[3]\n"
      ]
   },
   "History": {
      "text": [
         "The band's initial line-up consisted of former Rainbow singer frontman Graham Bonnet, young Swedish guitarist Yngwie Malmsteen, who had recently left the American band Steeler, Gary Shea and Jimmy Waldo from New England and Clive Burr of Iron Maiden fame. Burr was reportedly only in the band for a week, and left upon discovering the band was going to be based in the United States, as opposed to his native England. Burr was soon replaced by former Iron Butterfly drummer Jan Uvena, who had just left Alice Cooper's backing band. Shea dubbed the group \"Alcatrazz\". For the first album, the bulk of the material was written by Bonnet and Malmsteen, with Waldo contributing to several tracks.\n",
         "The band's debut album, No Parole from Rock 'n' Roll was released in late 1983 on Rocshire Records.[1] Decent support was given by MTV to the lead single, \"Island in the Sun\", which showed a heavy Rainbow influence. Despite the commercial nature of the song, it received little radio play. The album nonetheless spent 18 weeks on the Billboard charts and peaked at No. 128. A second video released in 1984 for \"Hiroshima Mon Amour\" became popular in Japan.\n",
         "Rochsire then released Live Sentence (1984), a concert recording with songs from both concerts of the recent tour of Japan at the Nakano Sun Plaza in Tokyo on January 28, 1984.  Being discontent with the sonic qualities of the recording, Malmsteen tried to prevent the release of the album but failed. Some Rainbow covers were included, including \"Since You Been Gone\". The album peaked at No. 133 in the US. A live video concert was also produced. During this period, internal turmoil began surfacing within the band, between Malmsteen and Bonnet. According to Malmsteen, Bonnet had become fed up with the attention drawn to his guitar playing from fans over Bonnet's vocals.[4] According to Malmsteen, their professional relationship ended with the two having an altercation on stage after Bonnet allegedly tampered with Malmsteen's amplifiers during a guitar solo and \"Since You've Been Gone\" at a show in Oklahoma. This resulted in Malmsteen yelling at and arguing with Bonnet, Bonnet poking Malmsteen in the stomach with his microphone stand, and finally with Malmsteen punching Bonnet, all taking place on stage.[5] Following this, Malmsteen left Alcatrazz and created his own band called Rising Force, who signed with Polydor Records and released a successful self-titled debut album.\n",
         "Waldo replaced Malmsteen with former Frank Zappa guitarist Steve Vai,[1] despite resistance from Bonnet, and the band signed with Capitol Records after Rocshire was shut down following the owners being arrested for the embezzlement of millions of dollars.[6] With Steve Vai, the group worked on new material and then headlined another tour of Japan, which introduced Vai to the fans and allowed them to play new material from the upcoming album. A concert video was filmed from these dates.\n",
         "The band released Disturbing the Peace in the spring of 1985.[1] The album was produced by Eddie Kramer who had worked with Led Zeppelin, Jimi Hendrix, and Triumph, among others. \"God Blessed Video\" was the first single and video, yet MTV barely played it. The album peaked at No. 145 and charted for 16 weeks. Alcatrazz, however, could never break out of their small following, and had to cut a tour short due to financial problems.\n",
         "Steve Vai left to join David Lee Roth's solo band in 1986.[1] The split was on good terms, as it was an offer Vai could not refuse. He was replaced by guitarist Danny Johnson, who recorded what became Alcatrazz's final studio album, Dangerous Games, released in the fall of 1986.[1] The album had covers of the Animals'  song  \"It's My Life\" (one of the only rock-oriented tunes) and Marbles' song \"Only One Woman\". Bonnet had been a member of Marbles in the late 1960s when they had this hit in the UK. The Dangerous Games album failed to chart and shortly afterward, Johnson also quit to join the band Private Life. Disheartened by an ever-revolving door of guitarists, and dwindling album sales, they split up in 1987.[1]\n",
         "In 1998, the Renaissance Records label issued The Best of Alcatrazz, a look back at the band's brief career. God Blessed Video appeared in the 2002 videogame soundtrack Grand Theft Auto: Vice City, playing on fictional rock station V-Rock.\n",
         "Bonnet reformed his version of the band as Alcatrazz featuring Graham Bonnet with guitarist Howie Simon (Jeff Scott Soto Band, Talisman), drummer Glen Sobel (Impellitteri, Beautiful Creatures, Tony MacAlpine), and bassist Tim Luce and toured Japan in May and June 2007—sharing the headline with another ex-Rainbow vocalist, Joe Lynn Turner. Howie Simon revealed in a recent interview that it was his suggestion to bring back the Alcatrazz name.[7] They also headlined the BerkRock festival in Berkovitsa, Bulgaria in July 2008 and have played various West Coast US dates including support slots for Y&T. Alcatrazz continued to perform live occasionally until 2014.\n",
         "In March 2017, three-fifths of the original lineup (Bonnet, Waldo and Shea) reunited for three shows in Japan, which also included Conrado Pesinato and Mark Benquechea on guitar and drums respectively. The performances were recorded for the live album/DVD Parole Denied - Tokyo 2017, which was released on December 7, 2018.[8] In February 2019, Bonnet confirmed that he had once again resurrected Alcatrazz, with a new lineup featuring himself, Waldo and Benquechea, as well as guitarist Joe Stump and bassist Beth-Ami Heavenstone.[9][10] She briefly became the band's first female member, having been in Bonnet's namesake band. This lineup had planned to record a new album together, which was also said to be including contributions from Chris Impellitteri, Bob Kulick, Dario Mollo and former Alcatrazz guitarist Steve Vai.[11][12] Heavenstone was replaced on bass in January 2020 by a returning Gary Shea. Alcatrazz's first studio album in 34 years, Born Innocent, was released on July 31, 2020.[13]\n",
         "On December 4, 2020, it was announced Alcatrazz had parted ways with vocalist Graham Bonnet and had recruited vocalist Doogie White following conflicts regarding the band's management.[2] Within a few hours after this announcement, Bonnet announced that he would \"still be recording and performing with Alcatrazz\", with a new lineup to be announced in the spring of 2021, and a new album in the works.[3] Bonnet later clarified that one of the reasons behind the split was the remaining members of the Born Innocent lineup wanted to \"only tour\" with his former manager Giles Lavery, and added that it \"meant that they had quit.\" He also stated that he was \"not bothered\" by the existence of two bands named Alcatrazz, had \"no plans to relinquish\" the band name, and referred to his replacement Doogie White as a \"good friend and a damn fine performer.\"[14]\n"
      ]
   },
   "Personnel": {
      "Current members": {},
      "Former members": {},
      "Timeline": {},
      "Line-ups": {
         "text": [
            "with\n"
         ]
      }
   },
   "Discography": {
      "Studio albums": {},
      "Live albums": {},
      "Compilations": {},
      "Singles": {},
      "Videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Alcatrazz is an English–American heavy metal band formed in 1983 by Graham Bonnet, Jimmy Waldo and Gary Shea.[1] They are best known for their songs \"Island in the Sun\" and \"God Blessed Video\", and have gone through a number of line-up changes, leaving Bonnet as only member to be in every incarnation of Alcatrazz until his split with the band in 2020. They are also notable for featuring a previously-unknown Yngwie Malmsteen, who was the guitarist of Alcatrazz during 1983–1984, and was subsequently replaced by Steve Vai, Danny Johnson, and currently by Joe Stump.\n",
      "After breaking up in 1987, and reuniting for occasional live performances between 2006 and 2017, Alcatrazz reformed once more in 2019 under Bonnet and Waldo, and Shea would rejoin the band shortly. To date, the band has released four studio albums: No Parole from Rock 'n' Roll (1983), Disturbing the Peace (1985), Dangerous Games (1986) and Born Innocent (2020). Several months after the release of Born Innocent, Alcatrazz announced that they had parted ways with Bonnet, who was replaced by Doogie White;[2] however, Bonnet later announced that he is intending to move forward with his own version of Alcatrazz, with a new lineup to be announced in the spring of 2021 and a new album in the works.[3]\n",
      "The band's initial line-up consisted of former Rainbow singer frontman Graham Bonnet, young Swedish guitarist Yngwie Malmsteen, who had recently left the American band Steeler, Gary Shea and Jimmy Waldo from New England and Clive Burr of Iron Maiden fame. Burr was reportedly only in the band for a week, and left upon discovering the band was going to be based in the United States, as opposed to his native England. Burr was soon replaced by former Iron Butterfly drummer Jan Uvena, who had just left Alice Cooper's backing band. Shea dubbed the group \"Alcatrazz\". For the first album, the bulk of the material was written by Bonnet and Malmsteen, with Waldo contributing to several tracks.\n",
      "The band's debut album, No Parole from Rock 'n' Roll was released in late 1983 on Rocshire Records.[1] Decent support was given by MTV to the lead single, \"Island in the Sun\", which showed a heavy Rainbow influence. Despite the commercial nature of the song, it received little radio play. The album nonetheless spent 18 weeks on the Billboard charts and peaked at No. 128. A second video released in 1984 for \"Hiroshima Mon Amour\" became popular in Japan.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Heavy metal"
      ],
      "Years active": [
         "1983–1987",
         "2006–2014",
         "2017",
         "2019–present"
      ],
      "Labels": [
         "Rocshire/MCA",
         "Capitol"
      ],
      "Associated acts": [
         "Rainbow",
         "New England",
         "Steeler",
         "Blackthorne",
         "Savage Paradise",
         "Vinnie Vincent Invasion",
         "Impellitteri",
         "Graham Bonnet Band"
      ],
      "Members": [
         "Doogie White",
         "Jimmy Waldo",
         "Joe Stump",
         "Mark Benquechea",
         "Gary Shea"
      ],
      "Past members": [
         "Graham Bonnet",
         "Clive Burr",
         "Yngwie Malmsteen",
         "Jan Uvena",
         "Steve Vai",
         "Danny Johnson"
      ]
   }
}