{
   "Name": "Amen (American band)",
   "rawData": [
      "Amen is an American hardcore punk band formed in Los Angeles, California in 1994. The band was founded by front man and singer Casey Chaos and combines elements of punk rock, hardcore, and heavy metal. Amen has released four studio albums, one live album, and the songs \"Coma America\", \"The Price of Reality\", and \"California's Bleeding\". The band saw continuous changes in membership, with Casey Chaos remaining the sole original member. In 2007, Amen went on hiatus and returned in 2014 with an appearance at that year's Knotfest.\n",
      "Amen was formed in 1994 in Los Angeles, California, after the disbanding of its frontman and singer Casey Chaos's previous band, Disorderly Conduct. The name \"Amen\" is a reference to the title of Disorderly Conduct's 1986 album of the same name.\n",
      "The band's first album, Slave, was written and performed almost entirely by Chaos himself, with Greg Barrybauer performing guitars and keyboards on a few tracks. Slave was recorded at Sandbox & Marquee West and mixed at Convent Studio in Los Angeles, California, and was limited to a run of only 2000 copies.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Nu metal, hardcore punk, alternative metal"
      ],
      "Years active": [
         "1994–present (hiatus 2009–2014)"
      ],
      "Labels": [
         "Drag U La, Roadrunner, Virgin, Refuse, EatUrMusic, Columbia"
      ],
      "Associated acts": [
         "Scum, Scars on Broadway, Christian Death, Stone Sour, The Damned, Godsmack, Sevendust, Snot, Slayer"
      ],
      "Website": [
         "officialcaseychaos.com"
      ],
      "Members": [
         "Casey Chaos",
         "Duke Decter",
         "John King",
         "John Fahnestock (a.k.a. Tumor)",
         "Dave Lombardo (session)",
         "Roy Mayorga (touring)"
      ],
      "Past members": [
         "Paul Fig\n  ",
         "Rich Jones\n",
         "Scott Sorry\n",
         "Acey Slade\n  ",
         "Jinxx\n",
         "Shannon Larkin\n",
         "Nate Manor\n  ",
         "Sonny Mayo\n",
         "Zach Hill\n",
         "Chris Alaniz\n  ",
         "Blake Plonsky\n  ",
         "Piggy D.\n",
         "Luke Johnson\n",
         "Joe Letz\n  "
      ]
   },
   "albums": [
      "Slave",
      "Amen",
      "We Have Come for Your Parents",
      "Death Before Musick"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in Los Angeles, California in [YEAR]. The band was founded by front man and singer Casey Chaos and combines elements of punk rock, hardcore, and heavy metal. [BAND_NAME] has released four studio albums, one live album, and the songs [SONG_NAME]. The band saw continuous changes in membership, with Casey Chaos remaining the sole original member. In [YEAR], [BAND_NAME] went on hiatus and returned in [YEAR] with an appearance at that year's Knotfest.\n",
      "[BAND_NAME] was formed in [YEAR] in Los Angeles, California, after the disbanding of its frontman and singer Casey Chaos's previous band, Disorderly Conduct. The name [SONG_NAME] is a reference to the title of Disorderly Conduct's [YEAR] album of the same name.\n",
      "The band's first album, Slave, was written and performed almost entirely by Chaos himself, with [PERSON_NAME_FULL_0_MALE] performing guitars and keyboards on a few tracks. Slave was recorded at Sandbox & [MONTH]quee West and mixed at Convent Studio in Los Angeles, California, and was limited to a run of only [YEAR] copies.\n"
   ]
}