{
   "Band members": {
      "Current members": {},
      "Former members": {},
      "Live members": {},
      "Session members": {
         "text": [
            "\nTimeline\n"
         ]
      }
   },
   "Discography": {
      "Albums": {},
      "Compilations": {},
      "DVDs": {},
      "Live albums": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "Amen and major label debut (1994–1999)": {
         "text": [
            "After being signed to Roadrunner Records and working with producer Ross Robinson, Chaos went on to write the songs for Amen's major-label debut, the self-titled album Amen. For the album, the band expanded to include one-time Ugly Kid Joe drummer Shannon Larkin, bassist John Fahnestock, a.k.a. Tumor, and guitarists Paul Fig and Sonny Mayo. On September 21, 1999, Amen was the band's major label debut. However, the band parted ways at the end of that same year due to lack of support; this resulted in their tour schedule being shortened, including the cancellation of a whole tour of Europe.\n",
            "The EP Coma America was released in the United Kingdom the same year. In December 1999, Kerrang! magazine named it its Single of the Week, and called it \"without a doubt the Album of the Decade.\"\n"
         ]
      },
      "Death Before Musick and Gun of a Preacher Man (2003–2007)": {
         "text": [
            "In 2003, Chaos worked with Daron Malakian of System of a Down on a demo tape for his project Scars on Broadway. When Malakian started his own record label EatUrMusic, an imprint of Columbia Records, Amen became the first band he signed; he also went on to produce their next album. The band added bassist Scott Sorry, guitarist Matt Montgomery (Piggy D.) and drummer Luke Johnson, who would in turn record the band's next album, their fourth release, Death Before Musick, which was released on April 13, 2004.\n",
            "The lead single, \"California's Bleeding\", would become Amen's highest-ranking track, reaching Number 52 on the UK charts and staying there for two weeks in April 2004.[11] A promotional video was made featuring the band slowly getting more and more bloodied, with a second version of the video showing less blood.\n",
            "During this time, Rich Jones left the band, and Acey Slade joined. \n",
            "The February 1, 2003, show, recorded at Manchester Academy, was released by Amen in 2004, for their first live video, Caught in the Act, on DVD. On August 2, 2005, the same show was released on CD by Snapper Records under the title Gun of a Preacher Man.\n",
            "In 2005, Casey Chaos released Pisstory: A Catalogue of Accidents, a Lifetime of Mistakes through his label, Refuse Music, which included a number of previously unreleased Amen songs. Also in this year, the band toured the UK, with a line-up including Jinxx, Joe Letz, John King and Nate Manor. \n",
            "In 2007, Amen appeared on Season 2, Episode 14 of The Henry Rollins Show, where they performed their first single, \"Coma America\" (renamed \"Coma Amerikkka\" for this performance) in front of an Iraqi flag. The line-up at this point welcomed back John Fahnestock, Duke Decter and new member Chris Alaniz, while still including John King. Soon after the performance, the band toured the UK. This became their most recent tour. \n",
            "That same year, Chaos was voted Number 53 among the \"All-Time Top 100 Underground Stars\" in a 2007 issue of Hit Parader.[12]\n"
         ]
      },
      "Formation and debut (1994)": {
         "text": [
            "Amen was formed in 1994 in Los Angeles, California, after the disbanding of its frontman and singer Casey Chaos's previous band, Disorderly Conduct. The name \"Amen\" is a reference to the title of Disorderly Conduct's 1986 album of the same name.[1]\n",
            "The band's first album, Slave, was written and performed almost entirely by Chaos himself, with Greg Barrybauer performing guitars and keyboards on a few tracks. Slave was recorded at Sandbox & Marquee West and mixed at Convent Studio in Los Angeles, California, and was limited to a run of only 2000 copies.\n",
            "This led to lead singer Chaos being introduced to producer Ross Robinson, and the two collaborated and soon secured a deal with Roadrunner Records.\n"
         ]
      },
      "Return and upcoming fifth studio album (2014–present)": {
         "text": [
            "After being inactive for several years, Amen announced on February 26, 2014, that they would be playing the UK event Alt-Fest on August 16, 2014.[13] The festival was canceled, but the band reunited on October 25, 2014 at Knotfest. There, they were accompanied by Stone Sour drummer Roy Mayorga and debuted a new song.[14] This was one of several new songs recorded by Ross Robinson with Amen and Slayer drummer Dave Lombardo for an upcoming fourth Amen album release.[15][16]\n",
            "In an August 2014 interview with the UK's Rock-A-Rolla magazine, Lombardo stated that he didn’t join Amen as a full-time member: \"Actually, that is not all true, I simply helped the singer of Amen with his new album. He's a good friend.\" [17]\n",
            "As of May 2015, Amen was currently nearing completion of their next studio album, which was due in late 2015, but was not released.  The new release date is presently not known.  This will be the longest ever gap between studio releases by the band, with their next album being their first in over 16 years since 2004's Death Before Musick.\n"
         ]
      },
      "We Have Come for Your Parents and departure from Virgin (2000–2003)": {
         "text": [
            "By 2000, Amen was signed to Virgin Records to record their third album. Retaining the same line-up as the previous album, in May 2000 the band recorded their follow-up album at Sound City in Los Angeles, California. We Have Come for Your Parents was released on October 31, 2000. The name was a reference to The Dead Boys album We Have Come for Your Children.\n",
            "The album became a quick success in the UK, landing them at Number 77 on the UK charts in November 2000.[2] Two singles became hits for Amen in the UK; \"Too Hard to Be Free\" went to Number 72, and \"The Waiting 18\" reached Number 61.[3]\n",
            "The song \"The Price of Reality\" was released as a single before the album's release. A promotional video was created for the song that featured the same iconic styling and art direction as the album cover and artwork used by Amen during this time. In 2002, it was included on the Streetwise DVDs at FYE and was named Metal Hammer magazine's Video of the Year.\n",
            "The success of the album would spawn years of touring in support of the album, including a 2002 re-release of the album in Australia for Big Day Out, before which Paul Fig left the band and Rich Jones joined on guitar.[4]\n",
            "By 2002, We Have Come for your Parents was voted the second best album of the year by Rock Sound magazine and fourth best album of the year by Kerrang!.[5] The band had also spent several months towards the end of 2001 recording their fourth album, again with producer Ross Robinson. However, disputes with Virgin Records led to the album being ultimately shelved.[6] In spite of fans campaigning for the release of the album, it remained unreleased.[7] Chaos stated that the band were left with financial struggles during this time, which almost resulted in the end of the band.[8][9][10]\n",
            "In 2003, the band was no longer on Virgin Records. During this time, Amen released Join, or Die, a collection of b-sides and rare songs recorded by the band. The album was released through Chaos's new label, Refuse Music, and was initially limited to only 2000 copies, the first 1000 signed in Chaos's own blood. The album was sold by Amen during their 2003 tour in the United Kingdom. During this time, guitarist Sonny Mayo and bassist John Fahnestock left the band.\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and debut (1994)",
      "1.2 Amen and major label debut (1994–1999)",
      "1.3 We Have Come for Your Parents and departure from Virgin (2000–2003)",
      "1.4 Death Before Musick and Gun of a Preacher Man (2003–2007)",
      "1.5 Return and upcoming fifth studio album (2014–present)",
      "2 Band members",
      "2.1 Current members",
      "2.2 Former members",
      "2.3 Live members",
      "2.4 Session members",
      "3 Discography",
      "3.1 Albums",
      "3.2 Singles",
      "3.3 Compilations",
      "3.4 Live albums",
      "3.5 DVDs",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Amen is an American hardcore punk band formed in Los Angeles, California in 1994. The band was founded by front man and singer Casey Chaos and combines elements of punk rock, hardcore, and heavy metal. Amen has released four studio albums, one live album, and the songs \"Coma America\", \"The Price of Reality\", and \"California's Bleeding\". The band saw continuous changes in membership, with Casey Chaos remaining the sole original member. In 2007, Amen went on hiatus and returned in 2014 with an appearance at that year's Knotfest.\n"
      ]
   },
   "Title": "Amen (American band) - Wikipedia"
}