{
   "Name": "American Pearl",
   "rawData": [
      "American Pearl was a hard rock band from Los Angeles, California. They released one studio album through Wind-up Records in 2000 and toured internationally before disbanding two years later.\n",
      "Formed in 1997, American Pearl started with guitarist Kevin Quinn, who owns a famed Sunset Boulevard tattoo shop, and Quinn's frequent customer, singer and guitarist Kevin Roentgen of the band SOUL. They broke from individual music projects to begin a new band together and were soon joined by Noah Shain (drums) of The Imposters and Rodney Rocha (bass). American Pearl played in various L.A. clubs before being signed to Wind-up Records in 1999. This allowed them the opportunity to open concerts for Buckcherry and The Cult, as well as play at Woodstock '99. The band released its self-titled debut album, produced by Steve Jones of the Sex Pistols and Mudrock, in August 2000. This featured the singles \"Free Your Mind\" and \"If We Were Kings.\" American Pearl toured extensively through North America and Japan, as a headliner and as support act for KISS, Creed, 3 Doors Down, and Days of the New before disbanding in 2002.\n",
      "Kevin Roentgen went on to record and perform under the moniker Praying Hands. In 2005, Roentgen joined Los Angeles band Orson as guitarist. Drummer Noah Shain is a record producer in Los Angeles. His production credits include Orson, Run Run Run, Praying Hands, and All Day Sucker. In 2017 Kevin joined the band Buckcherry as guitar player and backing vocalist upon the departure of original guitarist and one of the founding members of Buckcherry, Keith Nelson. \n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Hard rock"
      ],
      "Years active": [
         "1997–2002"
      ],
      "Labels": [
         "Wind-up Records"
      ],
      "Associated acts": [
         "Orson, Praying Hands, SOUL, The Imposters"
      ],
      "Members": [
         "Kevin Roentgen (vocals, guitar)",
         "Kevin Quinn (guitar)",
         "Noah Shain (drums)",
         "Rodney Rocha (bass)"
      ]
   }
}