{
   "Name": "Angeles (band)",
   "rawData": [
      "Angeles is an American rock band from Los Angeles, United States, formed in 1977 by Dale Lytle. They were signed to Mystic Records, who released their debut album in 1984.  As of 2020, Angeles has released thirteen albums.\n",
      "The roots of Angeles can be traced to 1975 when Dale Lytle and Dave Raudman started the band “Avante-Gard”, the band's name was changed to “English” in 1976, before finally settling with “Angeles” in mid-1977.  The initial line-up of Angeles was a five-piece: Dale Lytle on guitar, Dave Raudman on vocals, Terrell Hill on drums, Frank Galante on Bass, and Jen Nicia Alcivar on keyboard. On October 4th, 1980 Angeles headlined the Fall Rock Festival at Devonshire Downs; Ron Bushy, the original drummer of Iron Butterfly, joined the band onstage.   On August 1, 1981, Angeles and Mötley Crüe co-headlined two concerts at The Troubadour.\n",
      "After signing to Mystic Records in 1984, they released their debut album We're no Angels; Hit Parader described the album as \"a tight powerful collection of metal anthems\" that \"manages to elicit plenty of excitement on tracks such as 'Nasty Girls' and 'No Sugar Tonight'.\" In 1984, Angeles opened up for Bon Jovi at the Reseda Country Club.  Their second album Give It Up was released on the infamous Azra Records in 1986.  In 1989, their third album Give It Up was released on Ace Records.  The band broke up in 1991, after releasing three albums.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, United States"
      ],
      "Genres": [
         "Glam rock, hard rock"
      ],
      "Years active": [
         "1977–1991 1995-present"
      ],
      "Labels": [
         "Mystic (1983-1986)",
         "Azra Records (1986-1989)",
         "Bongo Boy Records",
         "Dark Star Records (2019)"
      ],
      "Website": [
         "angelesband.com"
      ],
      "Members": [
         "Dale Lytle",
         "Danny Basulto",
         "Cal Shelton",
         "Louis Collins"
      ],
      "Past members": [
         "Dave Raudman",
         "Tom Leslie",
         "John Merritt",
         "John Azar",
         "Brian LeBoeuf",
         "Clare Diane",
         "Daphney Winters",
         "Vince Thrill"
      ]
   },
   "albums": [
      "We're no Angeles",
      "Give it up",
      "Delivering the Goods",
      "No Limits",
      "Miracles",
      "Seriously Fun",
      "Wild Ride",
      "Crazy",
      "Killers of the Game",
      "Test of Time",
      "Time of Truth",
      "Fire It Up",
      "May 31st, 1978",
      "Hell On High Heels"
   ]
}