{
   "Name": "Angry Samoans",
   "Sections": [
      "1 Background",
      "2 History",
      "3 \"Get Off the Air\" controversy",
      "4 Recent activity",
      "5 Discography",
      "5.1 Studio albums",
      "5.2 EPs",
      "5.3 Other releases",
      "6 Band members",
      "6.1 Vocalists",
      "6.2 Guitarists",
      "6.3 Bass Guitarists",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "The Angry Samoans are an American punk rock band from the first wave of American punk, formed in August 1978 in Los Angeles, California, by early 1970s rock writer \"Metal\" Mike Saunders, his sibling lead guitarist Bonze Blayk[1] and Gregg Turner (another rock writer, for Creem from the late 1970s through the mid-1980s), along with original recruits Todd Homer (bass) and Bill Vockeroth (drums).[2]\n"
      ]
   },
   "Background": {
      "text": [
         "In 1969 the Saunders brothers cut a 14-song high school garage-rock album I'm a Roadrunner Motherfucka in their hometown of Little Rock, under a twice-used local band name, The Rockin' Blewz. The album went unissued until the late 1990s.[3][4]\n",
         "Mike Saunders briefly played in an embryonic backing lineup for 1950s rockabilly cult artist Ray Campi during 1975, before moving back to Arkansas for two years (pursuant to a second college degree).[5][3]\n",
         "Bassist Homer had played in 1977 Masque-era band Jesus Prick, and drummer Vockeroth was a veteran of the Pasadena \"backyard kegger party\" cover band circuit (which also spawned Van Halen).[3]\n",
         "During 1978, both Turner and Mike Saunders played with rock critic Richard Meltzer in the Los Angeles punk band VOM, which issued a posthumous five-song EP Live at Surf City on White Noise Records in early summer 1978.[3]\n",
         "Patrick “P.J.” Galligan was formerly a member of heavy metal band Cirith Ungol. [6] Galligan died from throat cancer in 2014.[7]\n"
      ]
   },
   "History": {
      "text": [
         "The first Angry Samoans gig was on October 30, 1978, opening for Roky Erickson and the Aliens in Richmond, California. Erickson was sick and did not make the show (Aliens band members covered for his lead vocals) but remained a lifelong friend and inspiration to Turner.[8] The next night, the Samoans played an \"all-LA bill\" at the Mabuhay Gardens in San Francisco, opening for Shock and the Zeros.\n",
         "The Samoans' first release, Inside My Brain, featuring P.J. Galligan on lead guitar as a replacement for Bonze Blayk, was one of the earliest hardcore punk albums to come out of the 1980s LA punk rock scene. Between this recording and second album Back from Samoa, the band released a four-song EP as \"The Queer Pills\", allegedly using the pseudonym for the EP to get airtime on Bingenheimer's KROQ radio program. Their 14-song, 17-minute hardcore album Back from Samoa, released in 1982, featured lyrics with such themes as the trendiness of poking your eyes out (\"Lights Out\"), anthropomorphizing Adolf Hitler's penis (\"They Saved Hitler's Cock\"), and dissing your father (\"My Old Man's A Fatso\"), sung over hyper-distorted guitars and early LA/OC hardcore drum beats.\n",
         "In the mid-1980s, the Angry Samoans added guitarist Steve Drojensky, and returned to their roots in mid-1960s American garage rock (they had long cited bands such as The Velvet Underground, the 13th Floor Elevators and Shadows of Knight as among their musical influences). The next two releases recorded during 1986–87, the Yesterday Started Tomorrow EP and STP Not LSD, were largely in this neo-1960s garage/psych style.[9]\n",
         "Homer left at the end of 1988 and formed The Mooseheart Faith Stellar Groove Band with Larry Robinson, formerly of 1970s teen pop-soul band Apollo. In 2005, Homer formed free-jazz band The Hollywood Squaretet with comedian/drummer Larry \"Copcar\" Scarano, formerly of Comedy's Dirtiest Dozen (HBO) and the 1960s New York rock band, The Bougalieu.[10]\n",
         "Turner left in early 1992, releasing an album, Santa Fe in 1993 with The Mistaken, which featured guitarist Sean O'Brien (formerly of Come), bassist Heath Siefert (formerly of Backbiter) and drummers Elizabyth Burtis and Kelly Callan (formerly of Wednesday Week). Turner's next band, The Blood Drained Cows, issued two albums, and occasionally features autoharp player Billy Angel (née Miller) from the Aliens.[11][12]\n",
         "During the mid- to late 1980s, Mike Saunders moonlighted in several electric/acoustic two-guitar duos (no rhythm section) such as The Clash Brothers (with Bob Fagan), The Sons of Mellencamp (with Turner), and The Gizmo Brothers (with Kenne Highland), performing at various small clubs during that period in San Francisco, LA/OC, and even Boston (with Krazee Ken Highland from The Gizmos and Hopelessly Obscure).[13]\n"
      ]
   },
   "\"Get Off the Air\" controversy": {
      "text": [
         "In late January 1979, Mike Saunders, Turner and Homer wrote an infamous song about longtime LA/Hollywood scenemaker and KROQ-FM DJ Rodney Bingenheimer, titled \"Get Off the Air\".[14] When the song was included on the band's first record Inside My Brain, the Samoans were blacklisted at the Starwood, the Whisky a Go Go, and other clubs in the Hollywood/LA area from mid-1980 through late 1982, seemingly due to Bingenheimer's strong influence with the LA/Hollywood club scene.[15]\n"
      ]
   },
   "Recent activity": {
      "text": [
         "The Angry Samoans have continued from the late 1980s onward with Mike Saunders, original drummer Vockeroth and a wide variety of other individuals. They have performed mainly along the West Coast, aside from occasional out-of-state weekend trips and three short, successful tours of mainland Europe in 2003, 2007 and 2008. In 2010, they performed on the Legends Stage on four dates of the Vans Warped Tour.[16]\n",
         "Gregg Turner has toured in October 2019 with The Oblivians as a solo act, in anticipation of a re-release of the Angry Samoans discography.\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "EPs": {},
      "Other releases": {}
   },
   "Band members": {
      "Vocalists": {},
      "Guitarists": {},
      "Bass Guitarists": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Angry Samoans are an American punk rock band from the first wave of American punk, formed in August 1978 in Los Angeles, California, by early 1970s rock writer \"Metal\" Mike Saunders, his sibling lead guitarist Bonze Blayk[1] and Gregg Turner (another rock writer, for Creem from the late 1970s through the mid-1980s), along with original recruits Todd Homer (bass) and Bill Vockeroth (drums).[2]\n",
      "In 1969 the Saunders brothers cut a 14-song high school garage-rock album I'm a Roadrunner Motherfucka in their hometown of Little Rock, under a twice-used local band name, The Rockin' Blewz. The album went unissued until the late 1990s.[3][4]\n",
      "Mike Saunders briefly played in an embryonic backing lineup for 1950s rockabilly cult artist Ray Campi during 1975, before moving back to Arkansas for two years (pursuant to a second college degree).[5][3]\n",
      "Bassist Homer had played in 1977 Masque-era band Jesus Prick, and drummer Vockeroth was a veteran of the Pasadena \"backyard kegger party\" cover band circuit (which also spawned Van Halen).[3]\n"
   ]
}