{
   "Name": "Armored Saint",
   "Sections": [
      "1 History",
      "1.1 Early career (1982–1989)",
      "1.2 Death of Dave Prichard, Symbol of Salvation and split (1989–1998)",
      "1.3 Reunion (1999–present)",
      "1.4 Miscellaneous",
      "2 Band members",
      "2.1 Timeline",
      "3 Discography",
      "3.1 Albums",
      "3.2 Other appearances",
      "3.3 Videos/DVDs",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Armored Saint is an American heavy metal band, formed in 1982 in Los Angeles, California. Since 1990, the band has consisted of John Bush on lead vocals, Joey Vera on bass, Jeff Duncan on rhythm guitar and the Sandoval brothers, Gonzo and Phil, on drums and lead guitar, respectively. Of the current lineup, Bush and Vera are the two constant members. To date, they have released eight studio albums, one EP, two live albums and one compilation album.\n",
         "As one of the leaders of the Los Angeles heavy metal scene, Armored Saint achieved moderate success during the 1980s with their 1983 self-titled EP and first three studio albums: March of the Saint (1984), Delirious Nomad (1985) and Raising Fear (1987).[1] Prior to the release of their fourth studio album Symbol of Salvation (1991), the band was plagued by extended inactivity, due to record company issues and the death of their original guitarist Dave Prichard, who died of leukemia in 1990. Armored Saint eventually broke up when Bush joined Anthrax in 1992 to replace Joey Belladonna, but reunited in 1999, and has continued to tour and record since then.\n"
      ]
   },
   "History": {
      "Early career (1982–1989)": {
         "text": [
            "Armored Saint was formed in 1982 by brothers Felipe \"Phil\" Sandoval (lead guitar) and Gonzalo \"Gonzo\" Sandoval (drums), from Woodrow Wilson High School (Los Angeles), along with lead guitarist Dave Prichard (from nearby South Pasadena High School), singer John Bush, and bassist Joey Vera, also Woodrow Wilson High School alumni. (Phil, Gonzo, John and Joey had originally played together during high school in a short lived rock band called \"Royal Decree\"); Gonzo Sandoval claims to have conceived the band name \"Armored Saint\", after watching the movie Excalibur (film), at a local movie theater parking lot in Monterey Park, California. Armored Saint recorded a five-song demo that landed the song \"Lesson Well Learned\" on the compilation album Metal Massacre II.[2] Three of these demo songs were then used for the band's self-titled EP on Metal Blade Records in 1983. The group then signed with Chrysalis Records in 1984.[2]\n",
            "Armored Saint released their debut album March of the Saint in 1984 followed by 1985's Delirious Nomad.[2] The debut album yielded a minor MTV hit with \"Can U Deliver?\". During the recording of Delirious Nomad, lead guitarist Phil Sandoval left the group.[2] Their third album, Raising Fear, was recorded by the remaining four members.[2] Throughout the 1980s, Armored Saint toured, or played selected shows, with many acts such as Judas Priest, Metallica, Aerosmith, Whitesnake, Ted Nugent, Alice Cooper, Saxon, Ratt, Testament, Exodus, W.A.S.P., Dio, Accept, Fates Warning, Y&T, Grim Reaper, Malice, King Diamond, Great White, Stryper, Leatherwolf, Lizzy Borden, Savatage, Helloween and Danzig.[3][4] By the end of the decade, however, the band was unhappy with their lack of success on the Chrysalis label, and returned to Metal Blade.[2] Soon after the release of their first live album Saints Will Conquer and a short-lived lineup that included Alan Barlam (then-guitarist for Hellion), Armored Saint added Jeff Duncan, formerly of the L.A. club band Odin, as rhythm guitarist, while Gonzo Sandoval briefly left the band and was replaced by Eddie Livingston.[2]\n"
         ]
      },
      "Death of Dave Prichard, Symbol of Salvation and split (1989–1998)": {
         "text": [
            "In 1989, while writing and recording rough four-track demos for their next studio album, guitarist Dave Prichard was diagnosed with leukemia.[5] Prichard succumbed to the disease on February 27, 1990, shortly before the recording sessions of Symbol of Salvation began.[2] After a brief hiatus, the Sandoval brothers returned to the band and Phil switched from rhythm to lead guitar to replace Prichard. Symbol of Salvation was released in 1991 to widespread critical success. It featured two hits \"Reign of Fire\" and \"Last Train Home\". The album was dedicated to the spirit and memory of Dave Prichard, whose solo on the demo recording of the song \"Tainted Past\" was painstakingly and carefully transferred and used on the album. The tour for Symbol of Salvation was successful; they opened for Suicidal Tendencies on their Lights...Camera...Revolution! tour and Savatage on their Streets tour. They also toured with the Scorpions, Wrathchild America, Sepultura and Overkill.[3][4][5][6]\n",
            "In 1992, the band contributed the song \"Hanging Judge\" to the Hellraiser III: Hell on Earth soundtrack, as well as made a brief appearance in the film. Several months later, John Bush was offered the position of lead vocalist in the thrash band Anthrax.[2] Unsure of Armored Saint's future, Bush accepted the job. The Sandoval brothers attempted to audition new members to create a new chapter, yet after many failed attempts, Armored Saint was officially disbanded.[2]\n",
            "After Armored Saint disbanded, Joey Vera kept busy playing with such bands as Fates Warning, Lizzy Borden and Chroma Key. He released a solo album in 1994 and started a successful second career as a producer and engineer. The Sandoval brothers formed Life After Death. Life after Death released a self entitled record on the now defunct John Sutherland record label Indivision, and released the record on the now defunct European label Rising Sun, and Jeff Duncan formed DC4 with brothers Shawn and Matt, and former Dio guitarist Rowan Robertson.\n"
         ]
      },
      "Reunion (1999–present)": {
         "text": [
            "In 1999, with Anthrax on temporary hiatus, John Bush and Joey Vera decided to reform Armored Saint.  The entire Symbol of Salvation lineup returned to the studio, and in 2000 the album Revelation was released. It included the band's first song with Spanish lyrics, Written by Gonzo Sandoval & John Bush  \"No Me Digas\". A small club tour opening for Dio and Lynch Mob followed.\n",
            "The following year, the band released Nod to the Old School, a collection of rarities, demos and outtakes (many from the Prichard years), plus a few new tracks. Soon after, John Bush returned to the studio with Anthrax, and Armored Saint was once again placed on indefinite hiatus.\n",
            "In 2004, Vera rejoined Bush in Anthrax on a temporary basis, filling in for bassist Frank Bello. Early in 2005, Anthrax's Scott Ian announced that their classic Among the Living-era lineup was reforming, leaving the membership of Bush and Vera in question. Bush stated his involvement with Anthrax was over.\n",
            "This move gave hope to many that Armored Saint would once again record. A one-off show with the Revelation lineup took place in 2005, and in 2006 the band embarked on a new tour.\n",
            "As part of their 20th anniversary, Metal Blade released a three-CD special edition of Symbol of Salvation in 2003. This contains the original CD, a second CD of demos of the songs plus the first part of an interview of the band members by Metal Blade founder Brian Slagel. The third CD contains the second half of that interview. Also reissued was the band's long out of print live video A Trip Thru Red Times.\n",
            "The band released their sixth album titled La Raza on March 16, 2010.\n",
            "On December 7, 2011, the band was invited to play one of four shows at the 30th anniversary of Metallica. The show took place in San Francisco, California.\n",
            "On February 11, 2013, Vera officially announced via Facebook and Twitter that the band had begun working on their seventh studio album. The album, titled Win Hands Down, was released on June 2, 2015.[7] Win Hands Down debuted at #183 on the Billboard Top 200 chart.[1] The album sold double what their previous effort, La Raza, sold upon its release in 2010. The album also reached #33 on the German Top 100 albums charts.[8]\n",
            "On February 24, 2017, Armored Saint released their first live album in 29 years, Carpe Noctum.[9][10]\n",
            "When asked in March 2017 about the follow-up to Win Hands Down, Bush stated, \"We haven't really collectively started working on anything. Sure, all the guys are accumulating some stuff in their minds. I have a lot of lyrical ideas written down, but we haven't started writing any songs yet. Armored Saint, sometimes, we don't move at the quickest pace. I think it would be a good idea if we wanted to make a new record to move on it a little quicker. I've said numerous times I'd rather have the quality of the material than feeling pressured to put out something in a certain amount of time be the primary motivation for it. That being said, we're no spring chickens, I ain't going to lie. Trying to wait ten years, five years for a new record, it's probably a little bit too long. If we do make a new record and if we can try to make the material be as high quality as Win Hands Down, then it would be cool to be able to get something out sooner than later. That being said, we haven't worked on anything yet.\"[11]\n",
            "On May 23, 2019, Armored Saint announced on their Instagram page that they had begun writing and demoing songs for their eighth studio album.[12] The band began recording the album that December and completed mixing it in April of the following year for a late 2020 release.[13][14][15][16] The resulting album, titled Punching the Sky, was released on October 23, 2020.[17]\n"
         ]
      },
      "Miscellaneous": {
         "text": [
            "John Bush was invited by drummer Lars Ulrich to audition as singer for Metallica in 1983, following the release of their debut album, Kill 'Em All, as frontman James Hetfield was not confident in his own singing abilities and wanted to focus on playing guitar. However, Bush turned down the offer as Armored Saint was still gaining popularity at the time. In 1986, during the Raising Fear recording sessions, Metallica contacted Joey Vera to replace bassist Cliff Burton after his untimely death. Vera turned down this offer as he wanted to stay in Armored Saint, and Burton was eventually replaced by Jason Newsted of Flotsam and Jetsam.\n",
            "It was revealed in an outtake from the documentary film Metallica: Some Kind of Monster that Phil Sandoval was involved in an altercation with Ulrich while attending a 1982 party. At that time, every time they heard \"Ace of Spades\" by Motörhead, they would begin dog piling each other. During one of these outbursts, Dave Mustaine misread the scenario and thought Sandoval pushed Ulrich to the ground; he got involved and purposely ended up breaking Sandoval's ankle. Mustaine recounts that to this day he feels bad about the incident,[citation needed] but that he was simply defending his bandmate. Mustaine later made amends by apologizing to Sandoval and giving him one of his own ESP guitars, as closure.\n",
            "In 1992, Armored Saint appeared in the film Hellraiser III: Hell on Earth, performing the song \"Hanging Judge\" in the club that Terry Farrell's character visits.\n",
            "In 2020, Armored Saint released a teaser trailer to their documentary \"Armored Saint: The Movie\"[18] which includes appearances from such as James Hetfield from Metallica and Scott Ian from Anthrax.\n"
         ]
      }
   },
   "Band members": {
      "Timeline": {}
   },
   "Discography": {
      "Albums": {
         "text": [
            "All studio albums listed, unless otherwise noted.\n"
         ]
      },
      "Other appearances": {},
      "Videos/DVDs": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Armored Saint is an American heavy metal band, formed in 1982 in Los Angeles, California. Since 1990, the band has consisted of John Bush on lead vocals, Joey Vera on bass, Jeff Duncan on rhythm guitar and the Sandoval brothers, Gonzo and Phil, on drums and lead guitar, respectively. Of the current lineup, Bush and Vera are the two constant members. To date, they have released eight studio albums, one EP, two live albums and one compilation album.\n",
      "As one of the leaders of the Los Angeles heavy metal scene, Armored Saint achieved moderate success during the 1980s with their 1983 self-titled EP and first three studio albums: March of the Saint (1984), Delirious Nomad (1985) and Raising Fear (1987).[1] Prior to the release of their fourth studio album Symbol of Salvation (1991), the band was plagued by extended inactivity, due to record company issues and the death of their original guitarist Dave Prichard, who died of leukemia in 1990. Armored Saint eventually broke up when Bush joined Anthrax in 1992 to replace Joey Belladonna, but reunited in 1999, and has continued to tour and record since then.\n",
      "Armored Saint was formed in 1982 by brothers Felipe \"Phil\" Sandoval (lead guitar) and Gonzalo \"Gonzo\" Sandoval (drums), from Woodrow Wilson High School (Los Angeles), along with lead guitarist Dave Prichard (from nearby South Pasadena High School), singer John Bush, and bassist Joey Vera, also Woodrow Wilson High School alumni. (Phil, Gonzo, John and Joey had originally played together during high school in a short lived rock band called \"Royal Decree\"); Gonzo Sandoval claims to have conceived the band name \"Armored Saint\", after watching the movie Excalibur (film), at a local movie theater parking lot in Monterey Park, California. Armored Saint recorded a five-song demo that landed the song \"Lesson Well Learned\" on the compilation album Metal Massacre II.[2] Three of these demo songs were then used for the band's self-titled EP on Metal Blade Records in 1983. The group then signed with Chrysalis Records in 1984.[2]\n",
      "Armored Saint released their debut album March of the Saint in 1984 followed by 1985's Delirious Nomad.[2] The debut album yielded a minor MTV hit with \"Can U Deliver?\". During the recording of Delirious Nomad, lead guitarist Phil Sandoval left the group.[2] Their third album, Raising Fear, was recorded by the remaining four members.[2] Throughout the 1980s, Armored Saint toured, or played selected shows, with many acts such as Judas Priest, Metallica, Aerosmith, Whitesnake, Ted Nugent, Alice Cooper, Saxon, Ratt, Testament, Exodus, W.A.S.P., Dio, Accept, Fates Warning, Y&T, Grim Reaper, Malice, King Diamond, Great White, Stryper, Leatherwolf, Lizzy Borden, Savatage, Helloween and Danzig.[3][4] By the end of the decade, however, the band was unhappy with their lack of success on the Chrysalis label, and returned to Metal Blade.[2] Soon after the release of their first live album Saints Will Conquer and a short-lived lineup that included Alan Barlam (then-guitarist for Hellion), Armored Saint added Jeff Duncan, formerly of the L.A. club band Odin, as rhythm guitarist, while Gonzo Sandoval briefly left the band and was replaced by Eddie Livingston.[2]\n"
   ]
}