{
   "Name": "Armored Saint",
   "rawData": [
      "Armored Saint is an American heavy metal band, formed in 1982 in Los Angeles, California. Since 1990, the band has consisted of John Bush on lead vocals, Joey Vera on bass, Jeff Duncan on rhythm guitar and the Sandoval brothers, Gonzo and Phil, on drums and lead guitar, respectively. Of the current lineup, Bush and Vera are the two constant members. To date, they have released eight studio albums, one EP, two live albums and one compilation album.\n",
      "As one of the leaders of the Los Angeles heavy metal scene, Armored Saint achieved moderate success during the 1980s with their 1983 self-titled EP and first three studio albums: March of the Saint (1984), Delirious Nomad (1985) and Raising Fear (1987). Prior to the release of their fourth studio album Symbol of Salvation (1991), the band was plagued by extended inactivity, due to record company issues and the death of their original guitarist Dave Prichard, who died of leukemia in 1990. Armored Saint eventually broke up when Bush joined Anthrax in 1992 to replace Joey Belladonna, but reunited in 1999, and has continued to tour and record since then.\n",
      "Armored Saint was formed in 1982 by brothers Felipe \"Phil\" Sandoval (lead guitar) and Gonzalo \"Gonzo\" Sandoval (drums), from Woodrow Wilson High School (Los Angeles), along with lead guitarist Dave Prichard (from nearby South Pasadena High School), singer John Bush, and bassist Joey Vera, also Woodrow Wilson High School alumni. (Phil, Gonzo, John and Joey had originally played together during high school in a short lived rock band called \"Royal Decree\"); Gonzo Sandoval claims to have conceived the band name \"Armored Saint\", after watching the movie Excalibur (film), at a local movie theater parking lot in Monterey Park, California. Armored Saint recorded a five-song demo that landed the song \"Lesson Well Learned\" on the compilation album Metal Massacre II. Three of these demo songs were then used for the band's self-titled EP on Metal Blade Records in 1983. The group then signed with Chrysalis Records in 1984.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Heavy metal"
      ],
      "Years active": [
         "1982–1992, 1999–present"
      ],
      "Labels": [
         "Metal Blade",
         "Chrysalis"
      ],
      "Associated acts": [
         "Anthrax",
         "Fates Warning",
         "Black Raven Band",
         "LifeAfterDeath",
         "Metallica"
      ],
      "Website": [
         "www.armoredsaint.com"
      ],
      "Members": [
         "John Bush",
         "Joey Vera",
         "Jeff Duncan",
         "Gonzo Sandoval",
         "Phil Sandoval"
      ]
   }
}