{
   "Name": "As Blood Runs Black",
   "Sections": [
      "1 History",
      "1.1 Formation, lineup changes, and Allegiance (2003–2007)",
      "1.2 Departure of Chris Blair Allegiance vocalists & Sal Roldan (2009)",
      "1.3 Lineup instability and Instinct (2010–2012)",
      "1.4 Ground Zero and inactivity (2013–2017)",
      "1.5 New material (2018–present)",
      "2 Members",
      "2.1 Current",
      "2.2 Former",
      "2.3 Timeline",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Demo albums",
      "3.3 Music videos",
      "4 References"
   ],
   "Summary": {
      "text": [
         "As Blood Runs Black is an American deathcore band from Los Angeles, California.[3] They have released three albums. Their first album, Allegiance, was released on June 6, 2006.[4] Their second album, Instinct, was released on March 15, 2011.[5] Instinct reached number 1 on the Billboard Heatseakers Albums chart and number 111 on the Billboard 200 for the week of April 2, 2011.[6] On June 30, 2013, As Blood Runs Black announced that they will be self-releasing their newest album, Ground Zero, with the help of crowdfunding via IndieGoGo; this was successful and the album was released on October 27, 2014.\n"
      ]
   },
   "History": {
      "Formation, lineup changes, and Allegiance (2003–2007)": {
         "text": [
            "As Blood Runs Black was created in 2003 in Los Angeles from an existing band known as Broken Stems by co-vocalists Louie Ruvalcaba and Enrique \"Ricky\" Martin, bassist Richard Reyes, and guitarists Bijon Roybal and Kyle Hasenstab. Brian \"Animal\" Matute, the drummer of Broken Stems, left and was replaced by Hector \"Lech\" De Santiago. After some practices and writing, the band decided to name itself As Blood Runs Black and played its first show at Toberman in San Pedro, Los Angeles, performing 3 original songs and 3 cover songs. Vocalists Louie Ruvalcaba and Ricky Martin wrote lyrics for their first track, \"Before the Break of Dawn\", while bassist Richard Reyes wrote the lyrics to \"Hester Prynne\" and \"In Dying Days\", both of which would be featured on their debut album. Two demos were released in 2004 and 2005, both containing \"Hester Prynne\" and \"In Dying Days\".\n",
            "In 2005, the band was preparing to enter the studio to record their debut album. However, Ruvalcaba, Martin, Reyes, Roybal and Hasenstaab all departed from the band, leaving De Santiago as the only member. De Santiago recruited Nick Stewart as the new bassist, Ernie Flores as the new guitarist, and, in place of the two former vocalists, the band brought in Chris Blair as the sole vocalist. As Blood Runs Black got back to the studio and recorded their debut album, Allegiance, which was released on June 6, 2006. Shortly after the release of the album, Sal Mendez was recruited as the band's second guitarist. For the next two years, As Blood Runs Black toured in support of Allegiance, including as part of the 2007 Summer Slaughter tour.\n"
         ]
      },
      "Departure of Chris Blair Allegiance vocalists & Sal Roldan (2009)": {
         "text": [
            "In late 2008, Christopher Blair and Sal Roldan left the band before the Australian tour in 2008. Sean Murphy from hardcore band Endwell filled in on vocals for the rest of the tour and the remainder of the year.\n",
            "In 2009, As Blood Runs Black brought in Danny Leal as a temporary vocalist, as Leal was vocalist for the up-and-coming deathcore band Upon a Burning Body. Leal would tour with As Blood Runs Black for the first half of the year before leaving to return to Upon A Burning Body. Jonny McBee, vocalist of deathcore act The Browning, was brought in as a temporary vocalist, and would tour for the remainder of the year before quitting due to conflicting personalities.[7]\n",
            "During 2009 Chris Blair recorded what's known as \"Instinct\" in UnderCity Recording Inc.\n"
         ]
      },
      "Lineup instability and Instinct (2010–2012)": {
         "text": [
            "At the beginning of 2010, As Blood Runs Black revealed Ken Maxwell as their permanent new vocalist. Maxwell was previously the vocalist for deathcore act Behead the Tyrant. Soon after guitarist Flores departed from the band, Greg Kirkpatrick and Dan Sugarman were recruited as the new guitarists. The band soon after revealed a new song entitled \"Resist\". This is the first song recorded with Maxwell. During a tour in Anaheim, Sonik Garcia, vocalist from deathcore act Fallen Figure, joined As Blood Runs Black on the stage to perform \"In Dying Days\" with Maxwell. It was unsure if Garcia was joining As Blood Runs Black as a co-vocalist, but it was revealed to just be a friendly guest appearance.\n",
            "However, several months later, Maxwell departed due to a fight with one of the other members of the band, and As Blood Runs Black soon turned to Sonik Garcia to be the new vocalist. The song \"Resist\" was re-recorded with Garcia on vocals. The band then entered the studio to record their second album, Instinct, which was released on March 15, 2011. As Blood Runs Black toured heavily for the next two years in support of the album.\n",
            "Near the end of 2012, on a tour date in San Diego, former vocalist Chris Blair made a guest appearance for the original song \"In Dying Days\". This would be the last tour for vocalist Sonik Garcia, as he would leave the band due to a family emergency. After his departure, Garcia recommended As Blood Runs Black to recruit Christopher Bartholomew, which would eventually be the sixth vocalist in the band's existence.\n"
         ]
      },
      "Ground Zero and inactivity (2013–2017)": {
         "text": [
            "As Blood Runs Black spent most of 2013 touring, but also began recording their third album, Ground Zero. This would be their first album without Mediaskare \nRecords, as they recently left the label due to a conflict. They announced they would be releasing Ground Zero with support of crowd funding by IndieGoGo. In early 2014, a song entitled \"Vision\" was released, the first recording with Bartholomew on vocals. Later on the year, rumors began to surface that the band was breaking up.\n",
            "On August 12, 2014, drummer Hector \"Lech\" De Santiago released a statement which alluded to the band breaking up, saying:\n",
            "After YEARS of uphill battles, dealing with legalities, politics, getting robbed blind by our ex label, left for dead and getting shelved by the industry... I'm here to say all things come to an end. As Blood Runs Black was born in my parents basement and has been the biggest part of my life since 2003. She was my daughter. We had a dream and we ran as far as we could with it. Forever in debt and grateful for the band of brothers (past and present) who risked their lives, contributed, and truly risked it all for the love and passion of music. We literally gave and lost everything in this storm. THANKS to all who supported and gave us a chance to share our music with you guys. We were all broken kids and you guys (and gals) gave us a chance to live. THANK YOU!!",
            "Despite the announcement, the band released a single from the upcoming album, titled \"Insomniac\", on August 18, 2014,[9] and announced a final North America farewell tour to support the album beginning in fall 2014.[10] The band intends to part ways upon conclusion of the tour. The album itself was released on October 27, 2014.\n"
         ]
      },
      "New material (2018–present)": {
         "text": [
            "On November 28, 2018, the band released a teaser of a new song.[11]\n"
         ]
      }
   },
   "Members": {
      "Current": {},
      "Former": {},
      "Timeline": {}
   },
   "Discography": {
      "Studio albums": {},
      "Demo albums": {},
      "Music videos": {}
   },
   "References": {},
   "coreData": [
      "As Blood Runs Black is an American deathcore band from Los Angeles, California.[3] They have released three albums. Their first album, Allegiance, was released on June 6, 2006.[4] Their second album, Instinct, was released on March 15, 2011.[5] Instinct reached number 1 on the Billboard Heatseakers Albums chart and number 111 on the Billboard 200 for the week of April 2, 2011.[6] On June 30, 2013, As Blood Runs Black announced that they will be self-releasing their newest album, Ground Zero, with the help of crowdfunding via IndieGoGo; this was successful and the album was released on October 27, 2014.\n",
      "As Blood Runs Black was created in 2003 in Los Angeles from an existing band known as Broken Stems by co-vocalists Louie Ruvalcaba and Enrique \"Ricky\" Martin, bassist Richard Reyes, and guitarists Bijon Roybal and Kyle Hasenstab. Brian \"Animal\" Matute, the drummer of Broken Stems, left and was replaced by Hector \"Lech\" De Santiago. After some practices and writing, the band decided to name itself As Blood Runs Black and played its first show at Toberman in San Pedro, Los Angeles, performing 3 original songs and 3 cover songs. Vocalists Louie Ruvalcaba and Ricky Martin wrote lyrics for their first track, \"Before the Break of Dawn\", while bassist Richard Reyes wrote the lyrics to \"Hester Prynne\" and \"In Dying Days\", both of which would be featured on their debut album. Two demos were released in 2004 and 2005, both containing \"Hester Prynne\" and \"In Dying Days\".\n",
      "In 2005, the band was preparing to enter the studio to record their debut album. However, Ruvalcaba, Martin, Reyes, Roybal and Hasenstaab all departed from the band, leaving De Santiago as the only member. De Santiago recruited Nick Stewart as the new bassist, Ernie Flores as the new guitarist, and, in place of the two former vocalists, the band brought in Chris Blair as the sole vocalist. As Blood Runs Black got back to the studio and recorded their debut album, Allegiance, which was released on June 6, 2006. Shortly after the release of the album, Sal Mendez was recruited as the band's second guitarist. For the next two years, As Blood Runs Black toured in support of Allegiance, including as part of the 2007 Summer Slaughter tour.\n",
      "In late 2008, Christopher Blair and Sal Roldan left the band before the Australian tour in 2008. Sean Murphy from hardcore band Endwell filled in on vocals for the rest of the tour and the remainder of the year.\n"
   ]
}