{
   "Discography": {
      "Albums": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "Formation and classic years (1983–1988)": {
         "text": [
            "Autograph originally began in late 1983 as a solo project for singer, songwriter and guitarist Steve Plunkett, who had recently left the band Silver Condor. Plunkett was playing and recording his own material with a group of his musician friends, most of whom had previously played with him in other bands:\n",
            "On lead guitar was Steve Lynch, who had played with Plunkett in the band Looker.\n",
            "On Bass was Randy Rand who knew Plunkett from their days in Pasadena, California's club band Wolfgang, that has been described as a local legend of which Kevin Dubrow (lead singer of Quiet Riot) once said, \"They smoked us all... they got a better response than us and Van Halen\".[2]\n",
            "On keyboards, Steven Isham (born Steven E. Isham on November 30, 1952 in Pocatello, Idaho),[3] who had also played with mutual acquaintance Holly Penfield, was brought in to give the band a more modern sound.\n",
            "On drums was earlier bandmate, Keni Richards, who Plunkett knew from John Doe, rounding out the band's lineup, with Richards' friendship of Van Halen lead singer, David Lee Roth being instrumental in leading to Autograph's big break the following year.\n",
            "The group of musicians began playing and recording together, soon taking the form of an actual band.  Plunkett chose the name \"Autograph\" for the band, having been inspired by hearing Def Leppard's similarly titled song, \"Photograph\", on the radio. They recorded their first rough demos in late 1983, but played them only for a few close friends. One of them was Andy Johns, a famous record producer who Steve Plunkett had met while helping singer Joe Cerisano produce Silver Condor's second album Trouble At Home. Johns invited the band to re-record and upgrade the demos at the world-famous Record Plant Studios for free under his guidance. Keni Richards then played the demo for Roth, who subsequently invited the band to open for Van Halen on their 1984 tour. The band rose to prominence opening for Van Halen, ultimately playing 48 shows, an act of distinction for an unsigned band. Due to their rising popularity, Autograph soon signed a contract with RCA Records following a performance at Madison Square Garden in New York City in late 1984.\n",
            "Autograph's debut album, Sign In Please, was completed and released in October, but did not make an appearance on any record charts until January 1985. The album contains the band's only major hit, and now signature song, \"Turn Up the Radio.\" The song itself was one of the last ones recorded for the album, and the band members were initially very lukewarm toward it. However, the tune would become a top-30 hit, pushing album sales past the gold album mark (500,000 copies sold). The song was featured in an episode of \"Miami Vice\" (entitled \"Little Prince\") and was also leased out to numerous other films, even further elevating the song's popularity. Lynch's guitar work in \"Turn Up The Radio\", featuring a distinctive two-handed, fretboard-tapping technique, won him the \"Guitar Solo of the Year\" award from Guitar Player magazine in 1985.\n",
            "\"Send Her to Me\" was released as a follow-up single, though its success paled in comparison to the massive first hit.  Other songs from the Sign in Please album, \"My Girlfriend's Boyfriend Isn't Me\" and \"Deep End,\" along with \"Take No Prisoners,\" which would soon appear on the band's follow-up album, and were featured in the 1985 film Secret Admirer, starring C. Thomas Howell, Kelly Preston, Corey Haim, Lori Loughlin and Casey Siemaszko. The 1985 film Fright Night also included a song the band recorded titled \"You Can't Hide From the Beast Inside\".\n",
            "A second album, That's the Stuff, was quickly recorded and released in the fall of 1985, and the group went on tour in support of several other bands, including Mötley Crüe and Heart.[citation needed] Although record sales were disappointing in comparison to their first album, it still achieved near gold status. Supported by the single, \"Blondes in Black Cars\" and the title track, a minor-hit, it eventually peaked at No. 92 on the Billboard album charts.[4]  The band then recorded a song titled \"Winning Is Everything\" for the film Youngblood.\n",
            "Autograph recorded a third album, which took longer to record than the other two combined and Loud and Clear was released in the spring of 1987. The title song's music video featured Ozzy Osbourne and Vince Neil of Mötley Crüe as extras. The band also made three appearances on Headbangers Ball in support of the album. In October, the band made a cameo in the film Like Father, Like Son, starring Dudley Moore and Kirk Cameron. The first song featured was \"Dance all Night,\" which played briefly, and then they performed the song \"She Never Looked That Good for Me\" for the film, appearing in a brief cameo as themselves. Despite all three of these songs being released as singles, the album was not a big success, mostly due to lackluster support from the label.\n"
         ]
      },
      "Leaving RCA and break up (1988–1989)": {
         "text": [
            "The band left RCA Records in early 1988. Isham left the band to pursue other options but was not replaced, as the band felt they no longer needed keyboards and wanted to take a newer and heavier direction. The remaining members began recording a new album in 1988 which they hoped to release sometime the following year, but those plans never occurred due to lack of any type of label support.\n",
            "Richards also left the band around this time. However, in early 1989 the band toured with new drummer Eddie Cross and continued to sporadically record. The band would eventually be offered a new deal with Epic in 1989, which they declined.\n",
            "In their short time they recorded three albums and toured with several famous bands, including KISS, Mötley Crüe, Heart, Aerosmith, Ronnie James Dio, Van Halen, Bryan Adams, and Whitesnake,[5] but in the end could not sustain their own career.\n",
            "Disappointed, the remaining members disbanded in December 1989.\n"
         ]
      },
      "Post break-up (1989–2013)": {
         "text": [
            "Though the group had disbanded, a few of their music videos (most commonly \"Turn Up the Radio\") continued to be played on music video channels and programs such as MTV's Headbangers Ball for several years after their initial debut. \n",
            "Steve Plunkett – When the original group disbanded in 1989, Plunkett became a staff writer and producer for All Nations Music, where he had over 170 of his songs released, including over 40 in movies like Rock Star, \"Brave New Girl\" (Britney Spears penned movie for ABC Family) and Gods and Monsters. Many artists have recorded his songs including Vixen, The Go-Go's, and Marc Anthony and Edgar Winter.  He has also produced artists such as Cyndi Lauper, Loretta Lynn, Graham Nash and En Vogue.  He wrote and performed the theme song for the WB television series 7th Heaven, as well as several other theme songs for shows such as Summerland, Kojak, and Queen of Swords which featured \"Behind the Mask\" performed by Jose Feliciano. Plunkett has had his original songs in hundreds of TV shows such as Beverly Hills 90210, Melrose Place, Sex and the City and The Simpsons.\n",
            "Steve Lynch – The original lead guitarist has been a guitar teacher for several years, schooling students in his virtuosic signature 8-finger \"hammer-on\" guitar technique. He has also published several books on his guitar styles as well as an instructional video that has been a top seller worldwide. He has conducted 325 'guitar clinics' in 18 countries. He eventually formed another band named Network 23 and the album by the same name was released in 2004. He currently owns a music school in the Seattle area and completed a new teaching website called lynchlicks.com that went online in 2009.\n",
            "Randy Rand – The former bassist began a career in leather-making, establishing an international importing/exporting shop that sells his own hand-crafted leather products,  and even working with Harley Davidson for a time.[6] According to Autograph's now-defunct \"Turn Up the Web!\" website, he has a daughter named Sterling Knight who has become a relatively well-known model in Italy.\n",
            "Keni Richards – The drummer went on to work with the band Dirty White Boy, but later left the music business due to a chronic back problem he has had for several years. Nevertheless, he continued his passion for music and art, publicly saying he has no regrets. He also involved himself in songwriting and producing duties even after the band broke up and continued it even after band's reformation, wherein he participated for a short period of time. Richards died on April 8, 2017, reportedly in a drug-related homicide.[7]\n",
            "Steven Isham – The keyboardist remained active in the music business through the following years until his death from liver cancer at the age of 56 on December 9, 2008. Some of Isham's well-known duties include forming a band named The Pack with Gary Moon (who later replaced Jack Blades in the band Night Ranger) and being Vince Neil's drummer during the latter's solo tour in 1993. \n",
            "Eddie Cross – The drummer of the Los Angeles band, Hot Wheelz, joined Autograph and played on its 1989 tour and the new tracks on the Missing Pieces CD.  He was later a member several other L.A. bands, including Bad Boys (with former members of Quiet Riot), Vigilante Man (with Guns N' Roses co-writer West Arkeen) and Gilby Clarke (who later joined Guns N' Roses).  In 1991, Cross went to law school in Orange County, California, and has been President of Law Offices of Edward H. Cross & Associates, PC since 1995.  The firm opened in Santa Ana, California, relocated to Kailua-Kona, Hawai'i in 2004 and finally landed in Palm Desert, California, in 2005, where he practices construction and real estate law.  He has a daughter and a son and is a world traveler and an avid photographer.\n"
         ]
      },
      "Reunion (2013–present)": {
         "text": [
            "In late 2013, original members Steve Lynch, Randy Rand, and Keni Richards got back together for a reunion. Due to Plunkett not being interested in doing the reunion, they have replaced him with Jailhouse, Agent X, Flood, 1RKO, solo artist singer/songwriter/guitarist Simon Daniels. The band has an interview in Guitar World Magazine, a review in Classic Rock and Fireworks magazines.\n",
            "Since 2014, by which time Richards had been replaced by Mark Wieland on drums, the band has played the Monsters of Rock Cruise, M3 Rock Festival, The Moondance Jam, The Halfway Jam, Firefest UK, Rockin the Rivers, The Iowa State Fair along with other festivals, theaters and worldwide touring.\n",
            "On January 15, 2015, they released their first single, \"You Are Us, We Are You,\" on iTunes. On April 21, they released their 2nd single, \"I Lost My Mind in America,\" which made the Top 10 download of the charts. In July, the band was featured in USA Today NEWS after playing the famous Halfway Jam Rock Festival. On September 23, the band released their 3rd single \"Every Generation\" and is featured as track of the week on Classic Rock Magazine.\n",
            "On January 7, 2016, the new 5 song EP Louder, with 4 original new singles and a live version of \"Turn up the Radio\", was released and is available on the official website.\n",
            "On January 10, 2017, the band completed the recordings for the new full album which will be announced and released this year In March, the band had already toured the Midwest and Northeast US again, with shows in the UK and Germany and is booked solid for the rest of the year.\n",
            "On April 8, 2017, Keni Richards died at the age of 60. The cause of his death appears to be a drug-related homicide.[7]\n",
            "On July 29, 2017, the band signed with EMP Label Group owned by David Ellefson of Megadeth and have announced a new album titled Get Off Your Ass, which was released on October 6, with a limited-edition vinyl LP. The Album hit # 21 on the Billboard Classic Rock Sales Chart with 2 singles on the Top 10 on the Hard Rock Media base Radio Chart. Extensive Touring followed the release. The Album got amazing reviews Worldwide. [8]\n",
            "On July 24, 2019, Steve Lynch decided to move on to other projects so the band added a new guitarist on August 27, 2019. Jimi Bell previously played in the House of Lords and Maxx Explosion. Bell appeared in the 1986 film, Light Of Day, where he was both a performer in the movie and played on the soundtrack album. He is an official endorsee of GHS Strings, Marshall Amps (Europe), Ovation Guitars, Roberts Guitars, Viper Guitars, Charvel Guitars and PVX Guitars.[9]\n"
         ]
      }
   },
   "Members": {
      "Lineups": {},
      "Timeline": {},
      "text": [
         "\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and classic years (1983–1988)",
      "1.2 Leaving RCA and break up (1988–1989)",
      "1.3 Post break-up (1989–2013)",
      "1.4 Reunion (2013–present)",
      "2 Members",
      "2.1 Lineups",
      "2.2 Timeline",
      "3 Discography",
      "3.1 Albums",
      "3.2 Singles",
      "4 See also",
      "5 References",
      "6 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "Autograph is an American rock band from Pasadena, California, United States. They released several albums throughout the 1980s and are best known for their hit single, 1984's \"Turn Up the Radio.\"\n"
      ]
   },
   "Title": "Autograph (American band) - Wikipedia"
}