{
   "Name": "The Union Trade",
   "rawData": [
      "The Union Trade is an American Indie rock band formed in San Francisco, California, in 2006. An early and leading member of the Bay Area post-rock scene, The Union Trade is also the founding band of San Francisco independent music label, Tricycle Records. Since its inception, the band's line-up has included Nate Munger (lead vocals, bass), Don Joslin (guitar), and Eric Salk (vocals, guitar, keys). The founding drummer was Dan Rodkewich. The band's current drummer, Eitan Anzenberg, has been with the band since 2012.\n",
      "The Union Trade's first live performance was an unpublicized show on August 19, 2006, played before a small group of friends and family in the upstairs back room of Edinburgh Castle, a San Francisco pub and music venue. Prior to The Union Trade, Don Joslin and Nate Munger were in an instrumental band together called The Andrea Doria. In an interview with the San Francisco Chronicle, Joslin described the first six months of the Union Trade as \"exciting for all of us ... The vision came first, then the band set out to develop the sound ... In the end, we have all reached a place musically that none of us would have reached alone.\"  The first official live performance of the band was at another SF venue, Hotel Utah, on September 26, 2006. The band has since shared the stage with notable national and international acts like The Appleseed Cast, The Morning Benders, Neon Trees, Film School, Vetiver, Pela, Figurines, The Pack A.D., Starlight Mints, Dappled Cities, Polysics, Loquat, and LoveLikeFire.\n",
      "The Union Trade made their recording debut in February 2007 with the release of their first EP, Now the Swell, on Tricycle Records. This EP was also the first release on the label which guitarist Don Joslin co-founded with San Francisco music photographer, Julie Schucard.  The follow up full-length album, Everyday Including, also released on Tricycle, came out in August 2008.  Smother Magazine called it \"a transcendental album awash in guitar fuzzy logic and hugely catchy triumphs. Simply amazing and simply essential\" and the UK music blog The Beat Surrender ranked it No. 32 of its Top 50 albums for 2008. The Union Trade's EP Why We Need Night, was released on February 8, 2011, and received recognition as a notable release from music publications such as the KEXP blog, Indie Rock Cafe, Largehearted Boy, and Faronheit. The San Francisco music blog Kata Rokkar calls Why We Need Night \"A moody but gorgeous EP infused with youthful sincerity, it is cinematic in scope with soothing soundscapes of atmospheric, ambient, and shimmering chimes interspersed with crashing interludes...This isn't average post rock that drags and bores the listener, this is tight and well thought out songs that burst with color and expand with repeated listens.\" Their most recent release is a remix EP called Translations.\n"
   ],
   "infobox": {
      "Origin": [
         " San Francisco, California, United States"
      ],
      "Genres": [
         "Indie rock, post-rock"
      ],
      "Years active": [
         "2006-present"
      ],
      "Labels": [
         "Tricycle Records[1]"
      ],
      "Website": [
         "http://theuniontrade.com [1]"
      ],
      "Members": [
         "Don Joslin (guitar)",
         "Nate Munger (bass, vocals)",
         "Eric Salk (guitar, keyboards)",
         "Eitan Anzenberg"
      ],
      "Past members": [
         "David Elrod (drums)",
         " Dan Rodkewich (drums)[2]"
      ]
   }
}