{
   "Name": "Badlands (American band)",
   "Sections": [
      "1 History",
      "1.1 Formation",
      "1.2 Badlands",
      "1.3 Voodoo Highway",
      "1.4 Kerrang! articles",
      "1.5 On-stage confrontation",
      "1.6 Loss of recording contract and Gillen's death",
      "2 Discography",
      "2.1 Singles",
      "3 See also",
      "4 References"
   ],
   "Summary": {
      "text": [
         "Badlands was a blues rock band founded by former Ozzy Osbourne guitarist Jake E. Lee, former Black Sabbath members Ray Gillen (vocals), Eric Singer (drums), as well as former Surgical Steel bass player Greg Chaisson.[3] After the first Badlands album, Eric Singer was replaced by Jeff Martin. The group lasted from 1988 to 1993 and released three albums. Badlands (1989) and Voodoo Highway (1991) were released before Gillen left and was replaced by singer John West from New York. Gillen's death in 1993 effectively ended any hopes of re-uniting the project.  The album Dusk (a demo recorded in 1992-93) was released in 1998 with the then deceased Gillen on vocals.\n"
      ]
   },
   "History": {
      "Formation": {
         "text": [
            "After touring with Ozzy Osbourne in support of the Ultimate Sin album, Jake E. Lee was fired by Sharon Osbourne. Lee first learned of his dismissal from the band through his roommate and guitar tech. Ultimately, Lee's firing was confirmed when he called Sharon Osbourne and asked her about it directly.[4] Lee set about looking for a charismatic front man with whom to launch a new band. He met Ray Gillen, a vocalist who had recently worked briefly with Black Sabbath. Within weeks, the duo had enlisted bassist Greg Chaisson, whom Lee had met during an Ozzy audition. Gillen recruited his former Black Sabbath bandmate Eric Singer to be the band's drummer.  With melodic sensibilities and solid instrumental skill, the new band worked together to present energetic live shows.\n"
         ]
      },
      "Badlands": {
         "text": [
            "The band released Badlands in June 1989 to good reviews.[5]  The band released videos for the songs \"Dreams in the Dark\" and the Zeppelin-like \"Winter’s Call,\" both of which received airplay on MTV. This boosted the album to its peak of no. 57 on Billboard's album charts.[6]\n"
         ]
      },
      "Voodoo Highway": {
         "text": [
            "Eric Singer was soon fired from Badlands; he later joined Paul Stanley's solo club band and played with KISS following the death of drummer Eric Carr. Badlands picked up Jeff Martin, former vocalist for Racer X and Chaisson's bandmate in Phoenix-based bands Surgical Steel and St. Michael, to take over on drums. Disagreements arose between the band and Atlantic Records about musical direction, and also between Gillen and his bandmates about the inclusion on the planned album of songs he had written. Lee has recalled that, shortly after the first album's tour in 1990, Gillen was first diagnosed with AIDS, and was starting to get \"really thin and didn't look quite as healthy.\"[7] After the band released Voodoo Highway in 1991, Gillen left the band as friction increased during the UK tour in 1992. Lee at the time announced he had hired Los Angeles native Debby Holiday, from the band Stiletto, to replace Gillen on their UK tour; however, before this occurred, the band quickly drafted Gillen back to complete the tour before he officially left the band.[8]\n"
         ]
      },
      "Kerrang! articles": {
         "text": [
            "After Gillen left the band and announced Holiday as his replacement, Lee was interviewed about her by Kerrang! magazine. A black woman, Holiday was the daughter of songwriter Jimmy Holiday (best known for penning the Dolly Parton hit \"Put a Little Love in Your Heart\"). She was raised in Beverly Hills, and had performed in many of the Sunset Strip's major clubs.  Few of Badlands' fans were familiar with her prior musical activities.  The interview with Lee was published in issue No. 399; he talked only briefly about Gillen's replacement and described his erratic behavior.\n"
         ]
      },
      "On-stage confrontation": {
         "text": [
            "On July 2, the band played at the London Astoria. Just a few songs in, Gillen pulled out a copy of the Kerrang! magazine that had been released with Lee's story in it and shouted to the crowd \"there's two sides to every story\" while Lee mouthed \"It's all true.\" Still, the band played the rest of its set. In Kerrang! issue No. 400, Neil Jeffries reviewed the gig and claimed that he had never seen a band with so much tension play so superbly. He praised Lee's guitar work and claimed the band were absolutely superb despite their obvious feuds.[8][9]\n"
         ]
      },
      "Loss of recording contract and Gillen's death": {
         "text": [
            "After the UK tour was complete, Gillen was officially fired from the band. Lee insisted to the press that the band would continue with singer John West. The band wrote and recorded some new songs; however, the combination of band discord and the general decline in the popularity of heavy metal music ultimately led Atlantic Records to drop the band from its label. Gillen then appeared with George Lynch’s solo band on the album Sacred Groove. Following that, he formed Sun Red Sun with guitarist Al Romano, former Alice in Chains bassist Mike Starr, and drummer Bobby Rondinelli. However, just as the new group was established, Gillen was diagnosed with HIV. On December 1, 1993, about three years after his initial diagnosis, he died at his New Jersey home as a result of AIDS-related complications, caused by previous drug use.[7] John West, Gillen's onetime Badlands replacement, was brought in to finish the Sun Red Sun recordings, and in 1998 toured with George Lynch.  Five years later, the unreleased Badlands album Dusk (1998) was released in Japan.\n"
         ]
      }
   },
   "Discography": {
      "Singles": {}
   },
   "See also": {},
   "References": {},
   "coreData": [
      "Badlands was a blues rock band founded by former Ozzy Osbourne guitarist Jake E. Lee, former Black Sabbath members Ray Gillen (vocals), Eric Singer (drums), as well as former Surgical Steel bass player Greg Chaisson.[3] After the first Badlands album, Eric Singer was replaced by Jeff Martin. The group lasted from 1988 to 1993 and released three albums. Badlands (1989) and Voodoo Highway (1991) were released before Gillen left and was replaced by singer John West from New York. Gillen's death in 1993 effectively ended any hopes of re-uniting the project.  The album Dusk (a demo recorded in 1992-93) was released in 1998 with the then deceased Gillen on vocals.\n",
      "After touring with Ozzy Osbourne in support of the Ultimate Sin album, Jake E. Lee was fired by Sharon Osbourne. Lee first learned of his dismissal from the band through his roommate and guitar tech. Ultimately, Lee's firing was confirmed when he called Sharon Osbourne and asked her about it directly.[4] Lee set about looking for a charismatic front man with whom to launch a new band. He met Ray Gillen, a vocalist who had recently worked briefly with Black Sabbath. Within weeks, the duo had enlisted bassist Greg Chaisson, whom Lee had met during an Ozzy audition. Gillen recruited his former Black Sabbath bandmate Eric Singer to be the band's drummer.  With melodic sensibilities and solid instrumental skill, the new band worked together to present energetic live shows.\n",
      "The band released Badlands in June 1989 to good reviews.[5]  The band released videos for the songs \"Dreams in the Dark\" and the Zeppelin-like \"Winter’s Call,\" both of which received airplay on MTV. This boosted the album to its peak of no. 57 on Billboard's album charts.[6]\n",
      "Eric Singer was soon fired from Badlands; he later joined Paul Stanley's solo club band and played with KISS following the death of drummer Eric Carr. Badlands picked up Jeff Martin, former vocalist for Racer X and Chaisson's bandmate in Phoenix-based bands Surgical Steel and St. Michael, to take over on drums. Disagreements arose between the band and Atlantic Records about musical direction, and also between Gillen and his bandmates about the inclusion on the planned album of songs he had written. Lee has recalled that, shortly after the first album's tour in 1990, Gillen was first diagnosed with AIDS, and was starting to get \"really thin and didn't look quite as healthy.\"[7] After the band released Voodoo Highway in 1991, Gillen left the band as friction increased during the UK tour in 1992. Lee at the time announced he had hired Los Angeles native Debby Holiday, from the band Stiletto, to replace Gillen on their UK tour; however, before this occurred, the band quickly drafted Gillen back to complete the tour before he officially left the band.[8]\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Hard rock, Blues rock, Glam metal[1][2]"
      ],
      "Years active": [
         "1988–1993"
      ],
      "Labels": [
         "Atlantic"
      ],
      "Past members": [
         "Jake E. Lee",
         "Greg Chaisson",
         "Ray Gillen",
         "Eric Singer",
         "Jeff Martin",
         "John West"
      ]
   }
}