{
   "Biography": {
      "text": [
         "The Bags were formed by Alicia Armendariz and Patricia Morrison, who had met while waiting in line to see Elton John guest on Cher.[1] The two became fast friends and eventually decided to form a band called Femme Fatale.[2]\n",
         "Kim Fowley heard about their band and asked the members to audition for Venus and the Razorblades, Fowley's next attempt at creating a band after the Runaways had left him.[3]\n",
         "Femme Fatale eventually morphed into a new band, which became Bags. They took the band's name and their stage names \"Alice Bag\" and \"Pat Bag\" from a gimmick that the band used during early performances where they performed with grocery bags over their heads (the practice did not last, in part due to an incident where Darby Crash of the Germs got on stage and ripped the bag off Alice's head). Alice Bag was the vocalist and Pat Bag played bass, and the rest of the band comprised guitar players Craig Lee and Rob Ritter, and Terry Graham on drums.\n",
         "The Bags played their first concert at The Masque on September 10, 1977.[4] Their concerts were often accompanied by disorderly scenes, including altercations with celebrities, such as one between singer Tom Waits and drummer Nicky Beat at The Troubadour.[5]\n",
         "In 1978, they released their only record, a single called \"Survive\", backed with \"Babylonian Gorgon\", released by independent record label Dangerhouse Records. \"We Don't Need The English\" was included on the Yes L.A. punk compilation album released by the same label.\n",
         "After this, Pat Bag left the band and Ritter switched to bass. In 1980 the group, was filmed by Penelope Spheeris for the documentary film The Decline of Western Civilization, which also featured the Germs, Black Flag, Catholic Discipline, X and other Los Angeles punk bands. At the release of the film in 1981 the producers billed the group as \"Alice Bag Band\" to avoid any conflict with Morrison, but the band had already broken up by then.\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "Post break-up": {
      "text": [
         "Craig Lee also played with Catholic Discipline, and he and co-member Phranc performed together occasionally when she embarked on her subsequent solo career. However, Lee is best known as a writer and critic for publications such as Flipside fanzine, among others, and as co-author of the book Hardcore California: A History Of Punk and New Wave. He died as a result of AIDS in 1991.[6]\n",
         "Terry Graham went on to play drums for The Gun Club. Pat, now known as Patricia Morrison, also joined The Gun Club soon after. Once she left The Gun Club she joined The Sisters of Mercy and then The Damned, as bassist. She married Dave Vanian, the Damned's lead singer.\n",
         "Rob Ritter also joined The Gun Club, and appeared on their first LP Fire Of Love, but then left, changing his name to Rob Graves and forming the death rock band 45 Grave,[7] with Dinah Cancer, Don Bolles, previously of the Germs and Nervous Gender, Paul Roessler of The Screamers and Nervous Gender and Paul Cutler. 45 Grave was influential in the creation of goth rock. Graves died in 1990 of a heroin overdose.[8]\n",
         "Alice Bag joined the death rock band Castration Squad, which included Phranc and Dinah Cancer among its many members. In the 1990s, she formed Cholita! with punk rock drag queen Vaginal Davis and the band released several videos. After this, she performed with Las Tres and then formed Stay at Home Bomb, her most recent musical project. According to her official website, since the deaths of Lee and Ritter and her estrangement from Morrison, she considers the Bags to be permanently disbanded, and has refused to perform Bags songs in public.\n",
         "A collection of recordings from the group has been released on Artifix Records[9] as well as a reissue of the original Dangerhouse single.\n",
         "At the 2008 exhibit \"Vexing: Female Voices From East L.A. Punk\" at the Claremont Museum of Art, Armandariz performed punk versions of mariachi music (and some Bags songs too).[10]\n",
         "In 2011 Alice Bag published her memoir, Violence Girl: East L.A. Rage to Hollywood Stage, A Chicana Punk Story[11] and embarked on a reading and performance tour across the United States.[12]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Biography",
      "2 Post break-up",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Bags (also known as the Bags or Alice Bag Band) were an American punk rock band formed in 1977, one of the first generation of punk rock bands to emerge from Los Angeles, California.\n"
      ]
   },
   "Title": "Bags (Los Angeles band) - Wikipedia"
}