{
   "Name": "Bang Tango",
   "rawData": [
      "Bang Tango is an American hard rock band. The band was formed in 1988 in Los Angeles, California and was signed to MCA Records the same year.\n",
      "Initially the band was founded by guitarist Mark Knight and bassist Kyle Kyle in 1988. Knight wanted a second guitarist and recruited Kyle Stevens. At the suggestion of Rough Cutt's Amir Derakh, vocalist Joe Leste' joined the band as its frontman which led to Leste's childhood friend, Tigg Ketler, completing the 5 piece line up as Bang Tango's drummer.\n",
      "The band then began to play shows and would gain a following on the sunset strip scene in Hollywood, packing all the popular clubs and venues at the time, which led to a bidding war with many major labels. Bang Tango were then signed to MCA Records.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Hard rock, funk rock"
      ],
      "Years active": [
         "1988–1995, 1996–1999, 2003–present"
      ],
      "Labels": [
         "World of Hurt (1989)",
         "MCA (1989–1993)",
         "Music for Nations (1993–1995)",
         "Shrapnel (2003–2005)",
         "Perris (2005–2010)"
      ],
      "Associated acts": [
         "Beautiful Creatures",
         "Mark Knight & the Unsung Heroes",
         "Mona Lisa Overdrive"
      ],
      "Members": [
         "Joe Lesté",
         "Mark Knight",
         "Kyle Kyle",
         "Kyle Stevens",
         "Tigg Ketler"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band. The band was formed in [YEAR] in Los Angeles, California and was signed to MCA Records the same year.\n",
      "Initially the band was founded by guitarist [MONTH]k Knight and bassist [PERSON_NAME_FULL_0_FEMALE] in [YEAR]. Knight wanted a second guitarist and recruited [PERSON_NAME_FIRST_0] Stevens. At the suggestion of Rough Cutt's Amir Derakh, vocalist [PERSON_NAME_FULL_1_MALE]' joined the band as its frontman which led to [PERSON_NAME_LAST_1]'s childhood friend, Tigg Ketler, completing the 5 piece line up as [BAND_NAME]'s drummer.\n",
      "The band then began to play shows and would gain a [GENRE] a bidding war with many major labels. [BAND_NAME] were then signed to MCA Records.\n"
   ]
}