{
   "Name": "Bang Tango",
   "Sections": [
      "1 History",
      "1.1 Formation (1988)",
      "1.2 Psycho Café (1989-1990)",
      "1.3 Dancin' On Coals (1991-1992)",
      "1.4 Love After Death (1993-1995)",
      "1.5 Break up (1996-2002)",
      "1.6 Reformation (2003-2018)",
      "1.7 Reunion with original lineup (2019-present)",
      "1.8 Other projects",
      "2 Attack of Life: The Bang Tango Movie",
      "3 Accolades and legacy",
      "4 Members",
      "4.1 Current members",
      "4.2 Former members",
      "4.2.1 Drums",
      "4.2.2 Guitar",
      "4.2.3 Bass guitar",
      "5 Discography",
      "5.1 Studio albums",
      "5.2 Live and compilation albums",
      "5.3 Singles",
      "6 See also",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Bang Tango is an American hard rock band. The band was formed in 1988 in Los Angeles, California and was signed to MCA Records the same year.\n"
      ]
   },
   "History": {
      "Formation (1988)": {
         "text": [
            "Initially the band was founded by guitarist Mark Knight and bassist Kyle Kyle in 1988. Knight wanted a second guitarist and recruited Kyle Stevens. At the suggestion of Rough Cutt's Amir Derakh, vocalist Joe Leste' joined the band as its frontman which led to Leste's childhood friend, Tigg Ketler, completing the 5 piece line up as Bang Tango's drummer.\n",
            "The band then began to play shows and would gain a following on the sunset strip scene in Hollywood, packing all the popular clubs and venues at the time, which led to a bidding war with many major labels. Bang Tango were then signed to MCA Records.\n"
         ]
      },
      "Psycho Café (1989-1990)": {
         "text": [
            "Their first release — the Live Injection EP — came out in early 1989, in advance of their Howard Benson-produced debut album, Psycho Café, which reached number 58 on the Billboard top 200 chart. The music video for the single \"Someone Like You\" was a popular staple on early 1990s MTV programming such as Dial MTV and Headbangers Ball.[citation needed] A video was also made for the single \"Breaking Up a Heart of Stone\". The band toured extensively during this period with the likes of Cheap Trick, LA Guns, Ratt, and Bulletboys.\n"
         ]
      },
      "Dancin' On Coals (1991-1992)": {
         "text": [
            "Their second album, the John Jansen-produced Dancin' on Coals (1991), failed to match the success of their debut. A music video was shot for the single \"Untied and True\" and the album peaked on the Billboard Top 200 at number 113. The band then released a second live EP, Ain't No Jive...Live! in 1992.\n"
         ]
      },
      "Love After Death (1993-1995)": {
         "text": [
            "In 1993, after Dancin' On Coals proved to be not the success MCA had hoped for, the band's label still honored Bang Tango's record contract with a third LP. Hoping to recapture the success of their first album, the band decided to re-team with Psycho Cafe' producer Howard Benson for Love After Death. The album ended up being shelved by MCA due to the label feeling a return would not be possible with how much was already invested monetarily for the recording. After recording was complete, guitarist Kyle Stevens made the decision to leave the band. The album would see a release in the UK and Japan through the Music For Nations label. Though to this day the band still perform songs from this album during their live set, Love After Death has yet to see a release in the U.S.[1][2][3]\n"
         ]
      },
      "Break up (1996-2002)": {
         "text": [
            "The break up of the original line up of Bang Tango occurred in 1995 after returning from a European tour in support of Love After Death.\n",
            "Frontman Joe Leste' and bassist Kyle Kyle would then reform the band in 1996 with a revolving door of musicians.\n",
            "In 1997, Leste' and Kyle Kyle formed the alternative rock band Eating Crow as a side project. Though no recordings were ever officially released and only a handful of shows were played, the song So Abused was featured in the Wes Craven film Wishmaster but not released on its soundtrack. With the band being a side project of then current members of Bang Tango, So Abused was featured heavily in Bang Tango's live set list in the late 1990s.[4]\n",
            "In 1998 the band released the live album, simply titled Live.\n",
            "In 1999 the band released Greatest Tricks, which was a compilation of the band's most well known songs re-recorded with Bang Tango's current line up at the time.\n",
            "The Joe Leste' and Kyle Kyle version of the band continued to tour under the Bang Tango name until dissipating 1999.[2]\n",
            "Frontman Joe Leste' would go on to sign a record deal with Warner Bros. and form the hard rock band Beautiful Creatures in 2001.\n"
         ]
      },
      "Reformation (2003-2018)": {
         "text": [
            "In 2003 Joe Leste' would once again reform the band, this time as its sole original member, and released the Ready to Go album.\n",
            "One reunion show with all original members of Bang Tango occurred in 2006. The whole show can be viewed on YouTube but is mislabeled as being from 2015.[5]\n",
            "2006 saw the release of the From The Hip album and 2011 saw the release of Pistol Whipped in the Bible Belt.[2]\n",
            "In 2010 the original lineup minus frontman Joe Leste' would reform with a different vocalist and perform 2 shows as Bang Tango Redux.[6]\n",
            "In 2014 Bang Tango recruited former Dio guitarist Rowan Robertson.[7]\n",
            "Shortly after completing and screening Attack of Life: The Bang Tango Movie, director Drew Fortier would go on to join Bang Tango as their second guitarist in 2015.[8]\n",
            "Bang Tango has reportedly been working on a new album.[9]\n"
         ]
      },
      "Reunion with original lineup (2019-present)": {
         "text": [
            "In November 2019 it was announced that the original Bang Tango line up consisting of Joe Leste, Mark Knight, Kyle Kyle, Kyle Stevens, and Tigg Ketler would be reuniting to tour in 2020.[10]\n"
         ]
      },
      "Other projects": {
         "text": [
            "Original Bang Tango guitarist Mark Knight went on to form Mark Knight & the Unsung Heroes which features appearances from former Bang Tango bandmates Tigg Ketler and Kyle Stevens.[11]\n",
            "Original Bang Tango bassist Kyle Kyle went on to form Mona Lisa Overdrive.[12]\n"
         ]
      }
   },
   "Attack of Life: The Bang Tango Movie": {
      "text": [
         "In June 2011, the band had met Drew Fortier, for whom they offered to shoot a studio documentary while they recorded their then new record Pistol Whipped in the Bible Belt. This project would then become expanded upon once Fortier had been put in contact with previous members of the band as well as its founding members. Over the course of 4 years Fortier would turn the project into a feature-length documentary titled Attack of Life: The Bang Tango Movie. The film features interviews with all original members of the band as well as most of the players who have performed in the band since its inception.[13]\n",
         "The film had very positive reviews from various music websites and publications with the general feeling being that despite its low budget, the film still manages to get its point across in an unbiased, artistic, and engaging manner while being able to appeal to not only fans of the band or genre, but to anyone not familiar with Bang Tango.[14]\n",
         "The film has never been given an official release, aside from Fortier himself releasing it on YouTube for free, which he stated was because of song clearing issues regarding Bang Tango's music back catalogue with UMG.\n"
      ]
   },
   "Accolades and legacy": {
      "text": [
         "Bang Tango's Psycho Cafe' landed at #37 for Rolling Stone's 50 Greatest Hair Metal Albums of All Time list.[15]\n",
         "Bang Tango landed at #36 for VH1's The Hair Metal 100, a list ranking the top 100 hair metal bands of the 1980s.[16]\n",
         "Someone Like You was featured at number 9 in LA Weekly's The 10 Greatest One-Hit Wonders of the Hair Metal Era list.[17]\n",
         "Slipknot and Stone Sour frontman Corey Taylor listed Bang Tango's Someone Like You as a part of his Ultimate 80s Rock Mixtape list featured on Teamrock.[18]\n",
         "LA Weekly named the former line up of Bang Tango as number 4 on their 10 Best Hair Metal Shows of 2017 list for their performance at Backyard Bash at the Rainbow which also featured Enuff Z'Nuff, Dokken, and Bow Wow Wow.[19]\n"
      ]
   },
   "Members": {
      "Current members": {},
      "Former members": {
         "Drums": {},
         "Guitar": {},
         "Bass guitar": {},
         "text": [
            "(This is a partial list. It does not include all of the members who have toured with the band.)\n"
         ]
      }
   },
   "Discography": {
      "Studio albums": {},
      "Live and compilation albums": {},
      "Singles": {}
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Bang Tango is an American hard rock band. The band was formed in 1988 in Los Angeles, California and was signed to MCA Records the same year.\n",
      "Initially the band was founded by guitarist Mark Knight and bassist Kyle Kyle in 1988. Knight wanted a second guitarist and recruited Kyle Stevens. At the suggestion of Rough Cutt's Amir Derakh, vocalist Joe Leste' joined the band as its frontman which led to Leste's childhood friend, Tigg Ketler, completing the 5 piece line up as Bang Tango's drummer.\n",
      "The band then began to play shows and would gain a following on the sunset strip scene in Hollywood, packing all the popular clubs and venues at the time, which led to a bidding war with many major labels. Bang Tango were then signed to MCA Records.\n",
      "Their first release — the Live Injection EP — came out in early 1989, in advance of their Howard Benson-produced debut album, Psycho Café, which reached number 58 on the Billboard top 200 chart. The music video for the single \"Someone Like You\" was a popular staple on early 1990s MTV programming such as Dial MTV and Headbangers Ball.[citation needed] A video was also made for the single \"Breaking Up a Heart of Stone\". The band toured extensively during this period with the likes of Cheap Trick, LA Guns, Ratt, and Bulletboys.\n"
   ]
}