{
   "Name": "Beowülf",
   "rawData": [
      "Beowülf is an American crossover thrash metal band formed in Venice Beach, California, in 1981 by Michael Alvarado, Dale Henderson, Mike Jensen and Paul Yamada. The group never gained a large mainstream success, but is considered one of the first bands that defined the \"Venice Scene\" in the 1980s, along with Suicidal Tendencies, Los Cycos, Neighborhood Watch, No Mercy, Excel and Uncle Slam, who all played a mix of skate punk, hardcore, heavy metal and thrash.\n",
      "As of 2011, Beowülf has released six studio albums. They split up in 1995, but reformed in 2000. The band has had numerous line-up changes and Henderson has been the only constant member. Their classic line-up is Henderson (vocals), Mike Jensen (guitar), Paul Yamada (bass) and Michael Alvarado (drums).\n",
      "The band started in 1981 as Black Sheep with Dale Henderson on vocals and guitar, former Neighborhood Watch guitar player Mike Jensen on guitar, Paul Tsutomu Yamada on bass and Mike Jensen's cousin, Roger DeGiacomi, on drums. The band played many parties, bars and clubs in Venice in 1981–1982 before DeGiacomi became the band manager and was replaced by Michael Alvarado on drums in 1983, changing the name of the band to Beowülf or BWF (The F being inverted) as they wrote it in Venice \"graffiti slang\".\n"
   ],
   "infobox": {
      "Origin": [
         "Venice, California, U.S."
      ],
      "Genres": [
         "Hardcore punk",
         "heavy metal",
         "thrash metal",
         "crossover thrash"
      ],
      "Years active": [
         "1981–1995, 2000–present"
      ],
      "Labels": [
         "Suicidal",
         "Caroline",
         "Restless",
         "I Scream",
         "Corruption"
      ],
      "Associated acts": [
         "Black Sheep",
         "Neighborhood Watch",
         "Suicidal Tendencies",
         "Los Cycos",
         "No Mercy",
         "Excel",
         "Fear Factory",
         "Strain 999"
      ],
      "Website": [
         "beowulfbwf.com"
      ],
      "Members": [
         "Dale Henderson",
         "Mark Conway",
         "Christian Olde Wolbers",
         "Rich Rowan"
      ],
      "Past members": [
         "Mike Jensen",
         "Clint Schuyler",
         "Buckit",
         "Gimmi",
         "Paul Yamada",
         "Kevin Sullivan",
         "Dug Mug Swanson",
         "Sean Otero",
         "Louiche Mayorga",
         "Roger DeGiacomi",
         "Michael Alvarado",
         "Denish Chaudhuri",
         "Stefan Mark Anthony"
      ]
   }
}