{
   "Name": "Bigelf",
   "Sections": [
      "1 Biography",
      "2 Discography",
      "2.1 Albums",
      "2.2 EPs",
      "3 Members",
      "3.1 Timeline",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Bigelf is an American progressive rock/progressive metal band formed in Los Angeles, California, United States, in 1991. They have since released four studio albums.[1]\n"
      ]
   },
   "Biography": {
      "text": [
         "Bigelf were formed as a psychedelic/glam-tinged hard rock outfit in 1991 in Los Angeles, California by Damon Fox and Richard Anton. They initially gained a large underground following. Bigelf's original line-up included Damon Fox (vocals/keyboards/guitar), Richard Anton (vocals/bass), A.H.M. Butler-Jones (vocals/guitar) and Thom Sullivan (drums).\n",
         "The quartet recorded 6-track EP Closer To Doom in spring 1995 co-produced by Sylvia Massy. Closer To Doom was released in 1996 and established them as 'fathers' of the psychedelic doom movement that spawned the L.A. stoner-rock scene.\nThe first line-up change came when Steve Frothingham replaced Sullivan in late 1995; soon afterward founding member Richard Anton would exit the band.\n",
         "Continuing on as a three-piece, they recorded Money Machine in summer 1997, which Swedish prog & heavy metal label Record Heaven would eventually release in 2000. This led the band to tour Scandinavia where they would become a quartet again with the addition of Finnish bass player Duffy Snowhill, he debuted on their 6-track EP Goatbridge Palace. Recorded in Stockholm in December 2000 it featured the singles, (Another)Nervous Breakdown and Side Effects plus four live tracks, one being a cover of the Black Sabbath classic, Sweet Leaf. Serjical Strike Records also released a limited pressing of Money Machine in the United States after System Of A Down frontman Serj Tankian took an interest in the band. In summer 2001, Butler-Jones fell into a diabetic coma while on tour in Sweden (he would remain in this unconscious state until his death on December 31, 2009). Ace Mark (also from Helsinki, Finland) took his place on guitar, leaving Fox as the sole singer and songwriter.\n",
         "Regaining focus with a new, solid foundation, Bigelf signed with Warner Music Sweden in 2002 and released Hex the following year. The band attained cult status overseas, most notably in Northern Europe.\n",
         "In 2007, Bigelf covered John Lennon's song \"Mother\" with american pop singer Christina Aguilera for the compilation album \"Instant Karma: The Amnesty International Campaign to Save Darfur\" to benefit Amnesty International's campaign to alleviate the crisis in Darfur. The song received positive reviews.[2]\n",
         "August 2008 saw Bigelf release Cheat The Gallows, the band's debut release for Linda Perry's Custard Records. It includes the lead single \"Money, It's Pure Evil\".[3]\n",
         "In 2009, Bigelf toured with Dream Theater on their Progressive Nation 2009 tour. They were originally billed alongside Opeth and Unexpect on the European leg of the tour from September to November, but after Pain of Salvation and Beardfish were forced to drop out because of the bankruptcy of SPV, their record label's (InsideOut) distributor, Bigelf were also added to the North American tour as an opening act alongside Zappa Plays Zappa between July and August.[4] The band once again supported Dream Theater as their opening act for the Mexican, Canadian, and South American tour in March 2010. In April 2010, Bigelf supported Porcupine Tree on their US Tour.\n",
         "After being dropped from Custard Records the band went on indefinite hiatus after playing several festival shows in Japan in August 2010.\n",
         "In September 2012, Fox announced via the band's Facebook and website that a new Bigelf album was in the making.\n",
         "On April 3, 2013, Inside Out Music announced Bigelf had signed with the label and would release a new album later that year.[5] Fox recruited former Dream Theater drummer Mike Portnoy to play on the new record Into the Maelstrom, according both to the Inside Out announcement and to Portnoy's own Twitter feed.[6][7] Guitarist Luis Maldonado was also invited to \"take some solos and add some color\" to the album and also to perform with the band on the Progressive Nation at Sea cruise ship festival on February 18–22, 2014 as well as festivals that summer.[7]\n",
         "In October 2014, guitarist John Wesley of Porcupine Tree and Mike Portnoy joined Bigelf as guest performers during their winter 2014 \"Into The Maelstrom\" European tour.\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "EPs": {}
   },
   "Members": {
      "Timeline": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Bigelf is an American progressive rock/progressive metal band formed in Los Angeles, California, United States, in 1991. They have since released four studio albums.[1]\n",
      "Bigelf were formed as a psychedelic/glam-tinged hard rock outfit in 1991 in Los Angeles, California by Damon Fox and Richard Anton. They initially gained a large underground following. Bigelf's original line-up included Damon Fox (vocals/keyboards/guitar), Richard Anton (vocals/bass), A.H.M. Butler-Jones (vocals/guitar) and Thom Sullivan (drums).\n",
      "The quartet recorded 6-track EP Closer To Doom in spring 1995 co-produced by Sylvia Massy. Closer To Doom was released in 1996 and established them as 'fathers' of the psychedelic doom movement that spawned the L.A. stoner-rock scene.\nThe first line-up change came when Steve Frothingham replaced Sullivan in late 1995; soon afterward founding member Richard Anton would exit the band.\n",
      "Continuing on as a three-piece, they recorded Money Machine in summer 1997, which Swedish prog & heavy metal label Record Heaven would eventually release in 2000. This led the band to tour Scandinavia where they would become a quartet again with the addition of Finnish bass player Duffy Snowhill, he debuted on their 6-track EP Goatbridge Palace. Recorded in Stockholm in December 2000 it featured the singles, (Another)Nervous Breakdown and Side Effects plus four live tracks, one being a cover of the Black Sabbath classic, Sweet Leaf. Serjical Strike Records also released a limited pressing of Money Machine in the United States after System Of A Down frontman Serj Tankian took an interest in the band. In summer 2001, Butler-Jones fell into a diabetic coma while on tour in Sweden (he would remain in this unconscious state until his death on December 31, 2009). Ace Mark (also from Helsinki, Finland) took his place on guitar, leaving Fox as the sole singer and songwriter.\n"
   ]
}