{
   "Name": "Bitch (band)",
   "rawData": [
      "Bitch is an American heavy metal band, formed in Los Angeles in December 1980. They gained notoriety as a result of their theatrical live performances inspired by Alice Cooper, which featured sadomasochistic themes. Bitch was the first artist ever signed to Metal Blade Records.\n",
      "Bitch was formed in December 1980, and played their first show in May 1981 alongside Dante Fox (later to become Great White). Shortly after the band was formed, guitarist David Carruth met Brian Slagel, future CEO of Metal Blade Records, and the two became friends. Slagel was working on a compilation album to tie into a heavy metal fanzine he had started called The New Heavy Metal Revue, and offered to place Bitch on the compilation if they would submit a demo to him. This project would become the landmark compilation Metal Massacre (1982), which would become famous for launching the career of Metallica and for being the first album ever released by Metal Blade Records. Bitch's contribution to Metal Massacre was a demo version of \"Live for the Whip\", which would be rerecorded for their debut EP Damnation Alley.\n",
      "Bitch signed for the label and released a self-financed EP titled Damnation Alley (1982). The following year, the group released their first full-length album, Be My Slave. During the tour of the album, Bitch developed their controversial and elaborate stage shows.  These included sadomasochistic elements such as bondage clothing and paraphernalia, and the humiliation of a male \"slave\" on stage.  The band then became a target in the Parents Music Resource Center controversy. The Be My Slave LP  was featured on talk shows and in a televised congressional hearing that took place before the United States Senate’s Committee On Commerce, Science, and Transportation on September 19, 1985.  Throughout this time, Bitch played regularly in Sunset Strip clubs like The Whiskey-a-Go-Go, Gazzarri's, The Roxy, and many others, sharing the bill with other metal groups such as W.A.S.P., Slayer and Armored Saint.\n"
   ],
   "infobox": {
      "Also known as": [
         "Betsy"
      ],
      "Origin": [
         "Los Angeles"
      ],
      "Genres": [
         "Heavy metal, glam metal,[1][2] hard rock[1]"
      ],
      "Years active": [
         "1980–present"
      ],
      "Labels": [
         "Metal Blade, Noise"
      ],
      "Associated acts": [
         "Anger As Art, Abattoir, Bloodlust, the Electric Prunes, Lizzy Borden, Killen, the Boxboys"
      ],
      "Website": [
         "Betsybitch.com (unofficial information site)"
      ],
      "Members": [
         "Betsy Bitch",
         "Angelo Espino",
         "Chris Cardenas",
         "Scandall West"
      ],
      "Past members": [
         "David Carruth, Robby Settles, Mark Anthony Webb, Ron Cordy, Ed McCrary, Robert Farr, Johnny Zell, Kevyn Redwine, Richard Zusman, Jett Black, Billy King, Jay Dean, Steve Kara, Steve Gaines, Dan Oliverio, Rob Alaniz"
      ]
   },
   "albums": [
      "Damnation Alley",
      "A Rose by Any Other Name"
   ]
}