{
   "Name": "Black 'n Blue",
   "Sections": [
      "1 History",
      "1.1 Early success",
      "1.2 Later years and solo careers",
      "1.3 Reunions/compilations",
      "1.4 Hiatus",
      "1.5 Later reunions",
      "2 Band members",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Live albums",
      "3.3 Compilation albums",
      "3.4 Music Videos",
      "3.5 Singles",
      "3.6 Box sets",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Black 'N Blue is an American heavy metal[1] band from Portland, Oregon, United States. The current members are lead vocalist Jaime St. James, bassist Patrick Young, drummer Pete Holmes, and guitarists Brandon Cook and Bobby Capka. The band is best known for their song \"Hold On to 18\" from their eponymous debut studio album, Black 'n Blue, released in August 1984.\n"
      ]
   },
   "History": {
      "Early success": {
         "text": [
            "Black 'N Blue moved to Los Angeles in 1982 making an immediate name for themselves in the Hollywood club scene. Within six months the band signed a worldwide recording contract with Geffen Records, releasing their self-titled debut album, Black 'N Blue, in August 1984. The Dieter Dierks-produced album included \"Hold On to 18,\" which was released to radio and MTV and became a moderate success, boosting album sales.[5] A follow-up album, entitled Without Love, was released the following year.  This album saw the band modify their original rougher, hard-edge sound in favor of a more polished metal approach.  \"Miss Mystery\" was a radio success and the band toured with KISS that year.  A second track from this album, \"Nature of the Beach\" appeared in the film Vision Quest  and also appeared as the B-side to the Madonna single \"Gambler\" from the same movie, although it was not included on the soundtrack LP.\n"
         ]
      },
      "Later years and solo careers": {
         "text": [
            "In 1986, Black 'N Blue gained the attention of Kiss bassist Gene Simmons, who would later take over as the band's producer for their next two albums. The band would go on to release two more albums under the Geffen label, Nasty Nasty in 1986 and In Heat in 1988, both of which saw them making a conscious effort to return to the original raw power that characterized the music on their debut.  Songs such as \"Nasty Nasty\" and \"Rock On\" were minor hits for the band, but neither of the albums could recapture the Black 'N Blue sound of old, and the band broke up in 1989.\n",
            "After the band's breakup, many of the former band members took on different projects. Jaime St. James formed his own solo band, called Freight Train Jane, composed of Tommy Bolan (formerly from Warlock), Scotty Werner, and Davy Jones. Freight Train Jane released only one album of the same name, which had little success. Guitarist Jeff \"Woop\" Warner would team up with former Rough Cutt guitarist Chris Hagar in the short-lived Woop & the Count and played for a short time with Kneel Cohn in an early line-up of the band The Dead Stars On Hollywood, which is now based in New York City. Warner later took guitar duties in a new band, NYC. Guitarist Tommy Thayer joined Harlow for their sole album in 1990, played guitar on Doro's eponymous 1990's album, before joining Shake The Faith with whom he released America The Violent in 1994. Thayer and fellow Black 'n Blue member Jamie St. James also starred in the L.A. all-star Kiss tribute band Cold Gin alongside Cold Sweat members Anthony White and Chris McLernon. Deciding to retire as an active musician, Thayer began working as Gene Simmons' assistant and eventually became the tour manager for Kiss. In 2002 he became the new lead guitarist for Kiss, replacing Ace Frehley (after Frehley's second departure from Kiss). Thayer's first album with Kiss, entitled Sonic Boom, was released in 2009 and was very successful. His next album with Kiss, entitled Monster, was released on October 9, 2012.  Pete Holmes took roles in the bands Malice, The Black Symphony and Mandy Lion's WWIII. He also played alongside Michael Schenker, Uli Jon Roth, Peter Gabriel, and Ted Nugent.\n"
         ]
      },
      "Reunions/compilations": {
         "text": [
            "In 1997, all five original members of Black 'N Blue reunited to perform a one-night live performance on Halloween night. This gig ended up being a sold-out show, and it was recorded and released as a live album, entitled One Night Only: Live on Thayer's brother John's record label Eon Records. The show was a one-time affair, and no further touring followed. In 2001, following the release of a Greatest Hits compilation (The Ultimate Collection), the band released the album The Demos Remastered: Anthology 1 under the label Crazy Planet. This album contained demos of some of Black 'N Blue's most popular hits, including 5 unreleased tracks and a live version of the song \"Autoblast.\"\n",
            "The band reunited again in 2003 (this time, without Thayer, who was performing lead guitar duties for Kiss at the time) to tour and record a new album, entitled Hell Yeah!.  Shawn Sonnenschein was the new lead guitarist to be featured on the album in Thayer's place. The album was initially scheduled to be released in September 2003, but the release date was pushed back on several occasions.\n"
         ]
      },
      "Hiatus": {
         "text": [
            "Meanwhile, in the ensuing interim period, the band released Rarities, an album which included remakes of a few of their hits, but mostly consisted of many unreleased demos, including some that were not included on the Demos Remastered: Anthology 1 release.\n",
            "In 2004, Jaime St. James became the new front man and lead singer for Warrant, replacing Jani Lane. In 2005, Jaime St. James went into the studio with Warrant to begin recording a new album under Cleopatra Records. Recording for the new album lasted until 2006, and later that year, the band released their new album, Born Again, which received mostly positive reviews. A music video was recorded for each of the songs on the album, and was later released on the DVD \"Born Again: Delvis Video Diaries,\" which also included behind-the-scenes footage, on tour clips, and comments from the band members regarding the making of the album. After the release of Born Again, Jaime St. James performed with Warrant at the 2007 hard rock festival Rocklahoma. Jaime St. James later left Warrant in 2008, after Jani Lane returned to the band.\n"
         ]
      },
      "Later reunions": {
         "text": [
            "Black 'N Blue, including Tommy Thayer, made a reunion appearance in their home town of Portland, Oregon on December 8, 2007 at Berbati's Pan & Restaurant. The concert benefited the band's long-time friend Kenny Nordone in his struggle with cancer. In the summer of 2008, Black 'N Blue formally reunited to play at Rocklahoma, with Shawn Sonnenschein once again as guitarist.[6]\n",
            "In 2008, a report on SleazeRoxx.com gave a new projected release date for the Hell Yeah! album as sometime that year.[7][8] However, it would remain unreleased for another three years. On October 9, 2010, Black 'N Blue was inducted into the Oregon Music Hall of Fame. The classic line up including Tommy Thayer performed a reunion concert that night at Portland's Roseland Theater.[9] In 2011, Jaime St. James' website posted new release dates for Hell Yeah! under Frontiers Records. The set release dates for the album included a premiere release date in Japan on April 20, 2011; a European release date on May 13, 2011; and a United States release date of May 17, 2011. The album received a generally positive reviews. The band remains active and continues to tour and play live shows.\n",
            "The band performed five shows in 2013; March 8 at the Hawthorne Theater in their hometown of Portland, October 19 at \"SkullFest\" in Nebraska, November 15 at the Whisky a Go Go in West Hollywood, November 16 at Vamp'd in Las Vegas, and December 27 at the District in Sioux Falls, South Dakota. These 2013 shows marked the debut of new guitarist Brandon Cook, who replaced Jeff \"Woop\" Warner. 2017 saw the departure of Shawn Sonnenschein and the debut of former Vicious Rumors guitarist Bobby Capka.\n",
            "The current lineup of Black 'N Blue performs regularly at annual U.S. Rock festivals Monsters of Rock Cruise and M3 Rock Festival.\n",
            "In a January 2020 video interview on The Hard, Heavy & Hair Show with Pariah Burke radio show, lead guitarist Brandon Cook confirmed that Black 'N Blue currently has no plans to create new music.[10]\n"
         ]
      },
      "text": [
         "Black 'N Blue was formed in November 1981 by high school friends Jamie St. James and Tommy Thayer in Portland, Oregon.  Originally calling themselves Movie Star, the band later chose the name Black 'N Blue based on their 'in-your-face' sound and denim and leather look. The band got their first break in 1982 when heavy metal fanzine editor Brian Slagel heard their song demo of \"Chains Around Heaven\" and subsequently added the track to his first edition of Metal Massacre — an independent compilation album that also introduced newcomers Metallica, Ratt, and Malice.[4]\n"
      ]
   },
   "Band members": {
      "text": [
         "\n",
         "\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Live albums": {},
      "Compilation albums": {},
      "Music Videos": {},
      "Singles": {},
      "Box sets": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Black 'N Blue is an American heavy metal[1] band from Portland, Oregon, United States. The current members are lead vocalist Jaime St. James, bassist Patrick Young, drummer Pete Holmes, and guitarists Brandon Cook and Bobby Capka. The band is best known for their song \"Hold On to 18\" from their eponymous debut studio album, Black 'n Blue, released in August 1984.\n",
      "Black 'N Blue was formed in November 1981 by high school friends Jamie St. James and Tommy Thayer in Portland, Oregon.  Originally calling themselves Movie Star, the band later chose the name Black 'N Blue based on their 'in-your-face' sound and denim and leather look. The band got their first break in 1982 when heavy metal fanzine editor Brian Slagel heard their song demo of \"Chains Around Heaven\" and subsequently added the track to his first edition of Metal Massacre — an independent compilation album that also introduced newcomers Metallica, Ratt, and Malice.[4]\n",
      "Black 'N Blue moved to Los Angeles in 1982 making an immediate name for themselves in the Hollywood club scene. Within six months the band signed a worldwide recording contract with Geffen Records, releasing their self-titled debut album, Black 'N Blue, in August 1984. The Dieter Dierks-produced album included \"Hold On to 18,\" which was released to radio and MTV and became a moderate success, boosting album sales.[5] A follow-up album, entitled Without Love, was released the following year.  This album saw the band modify their original rougher, hard-edge sound in favor of a more polished metal approach.  \"Miss Mystery\" was a radio success and the band toured with KISS that year.  A second track from this album, \"Nature of the Beach\" appeared in the film Vision Quest  and also appeared as the B-side to the Madonna single \"Gambler\" from the same movie, although it was not included on the soundtrack LP.\n",
      "In 1986, Black 'N Blue gained the attention of Kiss bassist Gene Simmons, who would later take over as the band's producer for their next two albums. The band would go on to release two more albums under the Geffen label, Nasty Nasty in 1986 and In Heat in 1988, both of which saw them making a conscious effort to return to the original raw power that characterized the music on their debut.  Songs such as \"Nasty Nasty\" and \"Rock On\" were minor hits for the band, but neither of the albums could recapture the Black 'N Blue sound of old, and the band broke up in 1989.\n"
   ]
}