{
   "Name": "The Units",
   "rawData": [
      "The Units were an American synthpunk band, founded in San Francisco in 1978 and active until 1984. They were one of America's earliest electronic new wave bands, and have been cited (along with The Screamers and Suicide) as pioneers of synthpunk, also retrospectively known as \"electropunk\". The Units were notable for their use of synthesizers in place of guitars, and multimedia performances featuring multiple projections of satirical, instructional films critical of conformity and consumerism.\n",
      "The Units was one of the most popular bands of the San Francisco punk and performance art scene during the late 1970s and early 1980s, headlining at the Mabuhay Gardens (aka The Fab Mab), The Savoy Tivoli, The Berkeley Square, The Deaf Club, Valencia Tool & Die, Geary Theater and other punk clubs. The Units also opened for such bands as  Soft Cell, Gary Numan, Ultravox, XTC, Bow Wow Wow, the Psychedelic Furs, the Police, Iggy Pop, Dead Kennedys, Sparks and toured the United States with Orchestral Manoeuvres in the Dark.\n",
      "Notable performance art appearances included \"Punk Under Glass\", where the Units performed in the windows of the JC Penney building in downtown San Francisco, as part of a  two-day art installation, and the Labat / Chapman Fight at Kezar Pavilion, a performance art boxing match between two artists  where the Units played the national anthem.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "New wave, electropunk"
      ],
      "Years active": [
         "1978–1984"
      ],
      "Website": [
         "synthpunk.org/units/"
      ],
      "Past members": [
         "Scott Ryser",
         "Rachel Webber",
         "Brad Saunders",
         "Tim Ennis",
         "Ron Lantz",
         "Richard Driskell",
         "Lx Rudis",
         "Seth Miller",
         "Jon Parker",
         "David Allen Jr.",
         "Jabari Allen",
         "Marc Henry",
         "D.C. Carter",
         "Rick Prelinger"
      ]
   },
   "albums": [
      "Digital Stimulation",
      "New Way to Move",
      "Animals They Dream About"
   ]
}