{
   "Name": "The Units",
   "Sections": [
      "1 History",
      "2 Visual and multimedia components",
      "3 Critical response",
      "4 Later releases",
      "5 Influence and cultural significance",
      "6 Members",
      "7 Discography",
      "8 Videography",
      "9 Filmography",
      "10 References",
      "11 External links"
   ],
   "Summary": {
      "text": [
         "The Units were an American synthpunk[1] band, founded in San Francisco in 1978 and active until 1984.[2] They were one of America's earliest electronic new wave bands, and have been cited (along with The Screamers and Suicide) as pioneers of synthpunk,[3] also retrospectively known as \"electropunk\". The Units were notable for their use of synthesizers in place of guitars, and multimedia performances featuring multiple projections of satirical, instructional films critical of conformity and consumerism.\n"
      ]
   },
   "History": {
      "text": [
         "The Units was one of the most popular bands of the San Francisco punk and performance art scene during the late 1970s and early 1980s, headlining at the Mabuhay Gardens (aka The Fab Mab), The Savoy Tivoli, The Berkeley Square, The Deaf Club, Valencia Tool & Die, Geary Theater and other punk clubs. The Units also opened for such bands as  Soft Cell, Gary Numan, Ultravox, XTC, Bow Wow Wow, the Psychedelic Furs, the Police, Iggy Pop, Dead Kennedys, Sparks and toured the United States with Orchestral Manoeuvres in the Dark.\n",
         "Notable performance art appearances included \"Punk Under Glass\",[4] where the Units performed in the windows of the JC Penney building in downtown San Francisco, as part of a  two-day art installation, and the Labat / Chapman Fight at Kezar Pavilion,[5] a performance art boxing match between two artists  where the Units played the national anthem.\n",
         "The Units' DIY, self stamped, 7” EP entitled “Units” was released in 1979. It was followed by another record in early 1980, \"Warm Moving Bodies\"/\"iNight\". The Units' first album, Digital Stimulation, was released in 1980,[3] and was the first album released by 415 Records.\n",
         "In 1982, the Units released a single on UpRoar Records entitled \"The Right Man\".[2] The song was recorded at the Different Fur recording studio, founded by the electronic music composer Patrick Gleeson.[6] The recording was produced by Michael Cotten, the synthesizer player of The Tubes. The song went to No. 18 on Billboard's Dance Chart and stayed on the chart for 13 weeks. Joel Webber, radio promotions man and the Units manager at the time, was also one of the founders of the New Music Seminar.  Subsequent productions by UpRoar included spoken word recordings by performance artists including Karen Finley, Eric Bogosian, and Ann Magnuson.\n",
         "After the success of \"The Right Man\", the Units signed with Epic/CBS Records and produced a music video for \"A Girl Like You\" that went into medium rotation on early MTV.[2] They released an EP titled New Way to Move on Epic Records, but typical of a hard-luck recording career, the Units' second album — produced by Bill Nelson for Epic/CBS - remained unissued, until a posthumous release in 2016.[7]\n",
         "In 1984, after recording the sound and music for the artist Tony Oursler’s film EVOL, Ryser and Webber moved to New York, putting an effective end to the Units.\n"
      ]
   },
   "Visual and multimedia components": {
      "text": [
         "The film Unit Training Film#1, produced by Scott Ryser and Rachel Webber, compiled from films the band projected during performances, was shown sans band in movie theaters around the San Francisco Bay Area, including the Roxie Cinema, San Francisco Cinematheque, The Intersection, and the Mill Valley Film Festival.[8]\n"
      ]
   },
   "Critical response": {
      "text": [
         "Alternative press publisher V. Vale called the Units \"the first San Francisco band to perform using no guitars\",[9]  The Units were referred to as \"Punks playing keyboards\" in an article in \"The San Francisco Examiner\" in 1979,[10] and the Los Angeles music critic  Kickboy Face of the fanzine Slash wrote of a Units performance, \"That night, watching the Units pound their machines into submission, I knew that another clichéd concept of mine was biting the dust once and for all.  I also knew that there probably was a future to rock n roll after all, and that future did not necessarily include anything resembling guitars.\"[11]\n"
      ]
   },
   "Later releases": {
      "text": [
         "In 2005, Ryser signed a licensing contract with EMI.  Once again, the recordings were not released. In 2007, the record label Golden Goose  released a 12\" remix of \"High Pressure Days\" by DJ Garth.[12] In the same year, the Italian record label, Mediane, released Daniele Baldelli – Cosmic - The Original, a double album that included the original and remixed versions of The Units \"The Right Man\".[13]\n",
         "In 2009, the Community Library label released a 21-song compilation album by the Units entitled The History of The Units that included a booklet \"The Unit Training Manual\".[14] In June that year, a 12\" single of \"High Pressure Days\" was released on the German label Relish with remixes alongside the original version.[15]\n",
         "In February 2010, a 12\" EP was released on the UK label Hungry Beat Recordings including Rory Phillips remix of \"High Pressure Days\".[16] The same month, \"High Pressure Days\" was included on a compilation, Mylo – The Return Of Mylo on the Mixmag label.  The CD was also on the cover of Mixmag magazine.[17] Similarly, Rough Trade Records included \"High Pressure Days\" on their Counter Culture 09 double album.[18]\n",
         "In April 2011, The Dark Entries music label from San Francisco released Bart - Bay Area Retrograde (Vol. 1), a 12\" compilation that included  \"Mission\".[19] An EP was released on the French label Robsoul Recordings, which included two remixes of \"High Pressure Days\" by Phil Weeks.[20]\n",
         "In 2011 The Opilec Music label from Italy released The Units - Connections, a triple boxed set of 25 songs written by The Units, that were remixed by over 40 international DJs, producers and bands from 13 different countries, including Electro Italo Disco pioneers Daniele Baldelli, Klein + M.B.O., N.O.I.A. and Alexander Robotnick.[21] It included a download card of extra tracks for a total of 52 remixed songs of The Units.[22]\n",
         "In 2012, The Opilec Music label from Italy released an EP. with three songs written by The Units and remixed by Todd Terje from Norway and I-Robots from Italy.[23] The same year, The Opilec Music label from Italy released two songs by The Units on the We Are Opilec compilation.[24] Also  the Tsugi Sampler label from France released the Ivan Smagghe – A Walk In The Woods With Ivan Smagghe that included a remix of \"High Pressure Days\" by Todd Terje.[25]\n",
         "In 2013, The Units are included (two songs performed live) in a film The Seven Deadly Synths, along with six other synthesizer bands including Suicide, Sun Ra, and Our Daughter's Wedding.[26]\n",
         "In 2015, Futurismo Records from London, re-released the UNITS original album from 1980, \"Digital Stimulation\" on vinyl and CD, including a live set at Mabuhay Gardens.[27]\n",
         "In 2016, Futurismo released Animals They Dream About, the band's previously unreleased second album originally recorded in 1982, including a live set from the Kabuki theater in San Francisco in which The Units opened for Bow Wow Wow.[28]\n",
         "In 2016, FDH records from Philadelphia, PA re-released The Units original debut EP from 1979, the hand stamped 7\" four song e.p. entitled \"UNITS\", including a download of a 1979 live set at the Deaf Club.\n[29]\n",
         "In 2019, founding band member Scott Ryser self-released a 12-track album of new and re-worked original material entitled \"Flying Away\", which included a new version of \"Cannibals\", a song from the band's 1980 debut LP, as well as new recordings of songs the band performed live in the 1980s, but had never made studio recordings of.[30]\n"
      ]
   },
   "Influence and cultural significance": {
      "text": [
         "Outsider musician Jandek's first album, Ready for the House, though a solo work, was originally credited to a 'The Units'. Jandek was forced to change the name by The Units, who possessed a trademark on the name,[31] after Scott Ryser from The Units wrote Smith a letter[32] with documentation. All reissues of the album and all subsequent releases have been credited to 'Jandek'.\n",
         "In September 2013, Los Angeles noise rock band HEALTH covered \"High Pressure Days\", titled \"High Pressure Dave\", which was included in the game Grand Theft Auto V and The Music of Grand Theft Auto V album, volume 1 on CD and vinyl.[33]\n",
         "Songs written by The Units have been covered or remixed by over 50 international DJs, producers and bands from 13 different countries.[21]\n",
         "Scott Ryser and Rachel Webber's son, Sam, plays or has played in several contemporary punk bands, including Dawn of Humans. Their daughter Nina also plays in several bands, including Palberta.\n"
      ]
   },
   "Members": {
      "text": [
         "Primary members were Scott Ryser and Rachel Webber. Other various members that played live shows and toured with The Units included Brad Saunders, Tim Ennis, Ron Lantz, Richard Driskell, Lx Rudis, Seth Miller, Jon Parker, David Allen Jr., Jabari Allen, Marc Henry, James Reynolds, Raymond Froehlich, D.C. Carter and their projectionist, Rick Prelinger.\n"
      ]
   },
   "Discography": {},
   "Videography": {},
   "Filmography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Units were an American synthpunk[1] band, founded in San Francisco in 1978 and active until 1984.[2] They were one of America's earliest electronic new wave bands, and have been cited (along with The Screamers and Suicide) as pioneers of synthpunk,[3] also retrospectively known as \"electropunk\". The Units were notable for their use of synthesizers in place of guitars, and multimedia performances featuring multiple projections of satirical, instructional films critical of conformity and consumerism.\n",
      "The Units was one of the most popular bands of the San Francisco punk and performance art scene during the late 1970s and early 1980s, headlining at the Mabuhay Gardens (aka The Fab Mab), The Savoy Tivoli, The Berkeley Square, The Deaf Club, Valencia Tool & Die, Geary Theater and other punk clubs. The Units also opened for such bands as  Soft Cell, Gary Numan, Ultravox, XTC, Bow Wow Wow, the Psychedelic Furs, the Police, Iggy Pop, Dead Kennedys, Sparks and toured the United States with Orchestral Manoeuvres in the Dark.\n",
      "Notable performance art appearances included \"Punk Under Glass\",[4] where the Units performed in the windows of the JC Penney building in downtown San Francisco, as part of a  two-day art installation, and the Labat / Chapman Fight at Kezar Pavilion,[5] a performance art boxing match between two artists  where the Units played the national anthem.\n",
      "The Units' DIY, self stamped, 7” EP entitled “Units” was released in 1979. It was followed by another record in early 1980, \"Warm Moving Bodies\"/\"iNight\". The Units' first album, Digital Stimulation, was released in 1980,[3] and was the first album released by 415 Records.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "New wave, electropunk"
      ],
      "Years active": [
         "1978–1984"
      ],
      "Website": [
         "synthpunk.org/units/"
      ],
      "Past members": [
         "Scott Ryser",
         "Rachel Webber",
         "Brad Saunders",
         "Tim Ennis",
         "Ron Lantz",
         "Richard Driskell",
         "Lx Rudis",
         "Seth Miller",
         "Jon Parker",
         "David Allen Jr.",
         "Jabari Allen",
         "Marc Henry",
         "D.C. Carter",
         "Rick Prelinger"
      ]
   }
}