{
   "Name": "The Blasters",
   "Sections": [
      "1 Band history",
      "1.1 Origins and heyday (1979–1985)",
      "1.2 Breakup and subsequent lineups (1986–2019)",
      "2 Reception",
      "3 Music used in popular culture",
      "4 Albums",
      "4.1 Studio albums",
      "4.2 Live recordings",
      "4.3 Compilations",
      "5 Covers by other artists",
      "6 References",
      "7 Bibliography",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "The Blasters are a rock and roll band formed in 1979 in Downey, California, by brothers Phil Alvin (vocals and guitar) and Dave Alvin (guitar), with bass guitarist John Bazz and drummer Bill Bateman. Their self-described \"American Music\" is a blend of rockabilly, early rock and roll, punk rock, mountain music, and rhythm and blues and country.\n"
      ]
   },
   "Band history": {
      "Origins and heyday (1979–1985)": {
         "text": [
            "The Alvin brothers grew up in a household filled with music and parents who exposed their sons to different kinds of American music.[1] They made friends with Bazz and Bateman, and together the boys were brave enough to go into Los Angeles blues clubs to watch their musical idols. They learned firsthand from the likes of Joe Turner and T-Bone Walker.[1] Phil Alvin recalled how his mother would drive the boys anywhere, and around 1965 or 1966, she took Phil to  see Sonny Terry and Brownie McGhee. At Phil's request, Big Joe Williams introduced him to Terry, and Phil wound up taking a number of harmonica lessons from Terry.[2] Another mentor was tenor saxophonist Lee Allen, who later joined The Blasters.[3]\n",
            "Phil Alvin explained the origin of the band's name: \" I thought Joe Turner's backup band on his Atlantic records–I had these 78s–I thought they were the Blues Blasters. That ends up it was Jimmy McCracklin. I just took the 'Blues' off and Joe finally told me, that's Jimmy McCracklin's name, but you tell ‘im I gave you permission to steal it [laughs]\"[4]\n",
            "Gene Taylor joined after the release of American Music (1980), performing boogie woogie-style piano (he remained with the band through late 1985). Later on, Steve Berlin joined on baritone sax, forming a horn tandem with Lee Allen.\n",
            "The Blasters' energetic live performances gained a local following, and they became fixtures of the early 1980s Los Angeles punk rock scene. They performed alongside X, Black Flag, The Gun Club, the Screamers and others. The L.A. scene of the time also featured the cowpunk genre, and a notable example was how The Blasters helped country artist Dwight Yoakam get established. They toured together in 1985.[5]\n",
            "Another local band that formed a strong musical bond with The Blasters was Los Lobos. The Mexican-American group first became friends with the Downey group in 1976. About five years later, The Blasters invited Los Lobos to open for them and also helped get the young men from East L.A. their first record deal. Steve Berlin made a transition to Los Lobos, with The Blasters' blessing.[6]\n",
            "The Blasters toured almost continuously for much of their heyday. The notes for The Blasters Collection observed that in one particular month, they toured with a wide range of acts:  the all-girl band The Go-Go's, psychobilly pioneers the Cramps, with western swing revivalists Asleep at the Wheel and on a leg of Queen's west coast tour.\n"
         ]
      },
      "Breakup and subsequent lineups (1986–2019)": {
         "text": [
            "Dave Alvin, the group's primary songwriter, left The Blasters in 1986. Like many other pairs of rock 'n' roll siblings, the Alvins got into fights with each other.[7] In 2015, Dave also recalled that the internal tension in the band extended beyond his tumultuous relationship with Phil. Ultimately, though, he wanted to sing his own songs.[8] Dave joined X for a brief stint before launching his critically acclaimed solo career. However, Hollywood Fats (birth name: Michael L. Mann) soon came aboard, appearing with The Blasters at Farm Aid II.\n",
            "Phil Alvin has led various incarnations of The Blasters intermittently since then (he devoted much of his attention to graduate studies in mathematics). Hollywood Fats died in December 1986. In an odd twist, he was initially replaced on guitar by Billy Zoom, who had previously left X.[9] Zoom's stay in The Blasters was very brief. Succeeding guitarists were Smokey Hormel (1988–92),[10] James Intveld (1993–95), and Keith Wyatt (1996-present). Dave Carroll succeeded Bill Bateman on drums in 1993 but was subsequently replaced by Jerry Angel in 1994.[11]\n",
            "There have also been a few reunion tours and live albums of the original lineup - including Dave Alvin, who has occasionally performed with the band under other circumstances as well. Examples include the need that arose from the death of Hollywood Fats, as well as Phil's knee ailment in December 2011.[12]\n",
            "In 2005, the band released its first studio CD in 20 years, 4-11-44.\n",
            "On July 3, 2012, the Blasters put out their most recent studio album to date, Fun On Saturday Night.  The album includes a duet with Exene Cervenka of X and the Knitters, track number 2 called \"Jackson\". In advance of the album's release, the band was touring Spain, and Phil Alvin had a near-death experience owing to an infection from an abscessed tooth. Though he had an emergency tracheotomy and flatlined twice, he recovered with his voice intact, and The Blasters have since continued to tour.[12]\n",
            "Personnel as of 2019: Phil Alvin, John Bazz, Keith Wyatt, and Bill Bateman.[1] Bateman rejoined the band in 2008, replacing Jerry Angel.[13]\n"
         ]
      }
   },
   "Reception": {
      "text": [
         "The Blasters have a devoted fan base and have received largely positive critical reviews, but have earned only limited mainstream success. Critic Mark Deming wrote of them, \"the Blasters displayed a wide-ranging musical style [and] were a supremely tight and tactful band with enough fire, smarts, and passion for two or three groups.\"[14]\n",
         "Trouser Press cited their strengths: \"tight ensemble work, swingin' original tunes in the classic mold and Phil Alvin's ageless, confident vocals.\"[15] The Rough Guide to Rock noted the ever-increasing numbers of originals written by Dave Alvin—songs about cars, girls, the working man and road dreams—and how he matured into a great songwriter.[16]\n",
         "In his memoir Get in the Van (1995), Henry Rollins (of Black Flag and Rollins Band) wrote of the Blasters, \"In my mind, they were a great band that not enough people found out about. Bill Bateman is one of the best drummers there is, and then of course, there are the Alvin brothers. A lot of talent for one band.\"[17]\n"
      ]
   },
   "Music used in popular culture": {
      "text": [
         "The Blasters gained exposure appearing as themselves in the Walter Hill film Streets of Fire (1984). They performed two songs, \"One Bad Stud\" and \"Blue Shadows\".\n",
         "Their song \"Dark Night\" was featured in a 1985 episode of Miami Vice (Season 2 Episode 2, \"Whatever Works \"). Later, it was also used over the opening sequence of the Quentin Tarantino-Robert Rodriguez collaboration movie From Dusk till Dawn.\n",
         "In 1987 \"Marie, Marie\" was featured in the Ridley Scott film Someone to Watch Over Me, starring Tom Berenger.\n",
         "In 1988 \"So Long Baby, Goodbye\" was featured in the film Bull Durham starring Kevin Costner.  In 2001, this song was also featured on the second episode of the HBO series Six Feet Under as the song chosen by the widow of the founder of a pyramid scheme for her late husband's viewing. \"So Long Baby, Goodbye\" is also featured in the 2004 PlayStation 2 video game Gran Turismo 4. It also plays over the opening sequence of Episode 12, Season 2, of the Showtime hit \"Billions\"\n",
         "Their cover of the Little Willie John song \"I'm Shakin'\" plays over a scene in the film Jackass 3D.\n",
         "Their song \"Little Honey\" is featured in  Maron Season 2 Episode 11.\n",
         "Their rendition of Otis Blackwell's \"Daddy Rolling Stone\" was used as incidental music in episode one of the 2018 TV drama Mayans M.C.\n"
      ]
   },
   "Albums": {
      "Studio albums": {},
      "Live recordings": {},
      "Compilations": {}
   },
   "Covers by other artists": {
      "text": [
         "In 1980, singer Shakin' Stevens scored a minor UK hit with his version of The Blasters' song \"Marie, Marie\". The original was on American Music. Stevens's version appeared on his album This Ole House.\n",
         "In 1985, for Stevens' album Lipstick Powder and Paint, he also covered \"So Long Baby, Goodbye\".\n",
         "Matchbox also recorded \"Marie, Marie\" for their 1980 album Midnite Dynamos.\n",
         "Dwight Yoakam's version of \"Long White Cadillac\" led off his 1989 album Just Lookin' for a Hit. It did in fact become a modest hit.\n",
         "In 2004 Lars Frederiksen and the Bastards covered The Blasters' \"Marie, Marie\" on their album Viking.\n"
      ]
   },
   "References": {},
   "Bibliography": {},
   "External links": {},
   "coreData": [
      "The Blasters are a rock and roll band formed in 1979 in Downey, California, by brothers Phil Alvin (vocals and guitar) and Dave Alvin (guitar), with bass guitarist John Bazz and drummer Bill Bateman. Their self-described \"American Music\" is a blend of rockabilly, early rock and roll, punk rock, mountain music, and rhythm and blues and country.\n",
      "The Alvin brothers grew up in a household filled with music and parents who exposed their sons to different kinds of American music.[1] They made friends with Bazz and Bateman, and together the boys were brave enough to go into Los Angeles blues clubs to watch their musical idols. They learned firsthand from the likes of Joe Turner and T-Bone Walker.[1] Phil Alvin recalled how his mother would drive the boys anywhere, and around 1965 or 1966, she took Phil to  see Sonny Terry and Brownie McGhee. At Phil's request, Big Joe Williams introduced him to Terry, and Phil wound up taking a number of harmonica lessons from Terry.[2] Another mentor was tenor saxophonist Lee Allen, who later joined The Blasters.[3]\n",
      "Phil Alvin explained the origin of the band's name: \" I thought Joe Turner's backup band on his Atlantic records–I had these 78s–I thought they were the Blues Blasters. That ends up it was Jimmy McCracklin. I just took the 'Blues' off and Joe finally told me, that's Jimmy McCracklin's name, but you tell ‘im I gave you permission to steal it [laughs]\"[4]\n",
      "Gene Taylor joined after the release of American Music (1980), performing boogie woogie-style piano (he remained with the band through late 1985). Later on, Steve Berlin joined on baritone sax, forming a horn tandem with Lee Allen.\n"
   ]
}