{
   "Name": "Body Count (band)",
   "Sections": [
      "1 History",
      "1.1 Pre-formation (1990–1991)",
      "1.2 Touring and debut album (1991–1992)",
      "1.3 Controversy over the song Cop Killer (1992)",
      "1.4 Continued albums: Born Dead, Violent Demise and Murder 4 Hire (1993–2008)",
      "1.5 Hiatus, Gears of War 3 soundtrack (2009–2012)",
      "1.6 Resurgence: Manslaughter, Bloodlust and Carnivore (2013–present)",
      "2 Style",
      "2.1 Lyrics",
      "2.2 Music",
      "3 Members",
      "3.1 Timeline",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Singles",
      "5 Videos",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Body Count is an American heavy metal band formed in Los Angeles, California, in 1990. The group is fronted by Ice-T, who first established himself as a rapper but co-founded the group with lead guitarist Ernie C out of their interest in heavy metal music. Ice-T took on the role of vocalist and writing the lyrics for most of Body Count's songs, while Ernie C has been responsible for writing the group's music.\n",
         "Body Count's self-titled debut album was released on Sire Records in 1992, and garnered much attention due to a controversy around the song \"Cop Killer\". Their label, Sire Records, and their parent company, Warner Bros. Records, defended the song; however Ice-T chose to remove it from the album because he felt that the controversy had eclipsed the music itself. The group left Sire the following year, and they have since released six more albums.\n",
         "Three out of the band's original six members are deceased: D-Roc died from lymphoma, Beatmaster V from leukemia and Mooseman in a drive-by shooting. Body Count's current lineup includes vocalist Ice-T, guitarists Ernie C and Juan of the Dead, bassist Vincent Price, drummer Will \"Ill Will\" Dorsey, Jr., and backing vocalists Sean E Sean and Little Ice, the latter of whom is Ice-T's son.\n"
      ]
   },
   "History": {
      "Pre-formation (1990–1991)": {
         "text": [
            "Ice-T's interest in heavy metal stemmed from sharing a room with his cousin Earl, who was a fan of rock music and only listened to the local rock stations. Ice-T particularly enjoyed heavy metal, citing Edgar Winter, Led Zeppelin and Black Sabbath as his favorite bands.[1] Ice-T attended Crenshaw High School, where a few classmates shared his interest in the genre, including musicians Ernie C, D-Roc the Executioner, Beatmaster V, and Mooseman. Ice-T began a solo career as a rapper, and later decided to form Body Count with these friends.[1][2]\n",
            "Ice-T co-wrote the band's music and lyrics with lead guitarist Ernie C, and took on the duties of lead vocalist, even though he felt that he did not have a great singing voice.[3] The original line-up consisted of Mooseman on bass, Beatmaster V on drums and D-Roc on rhythm guitar.\n"
         ]
      },
      "Touring and debut album (1991–1992)": {
         "text": [
            "Ice-T introduced the band at Lollapalooza in 1991, devoting half of his set to his hip hop songs, and half to Body Count songs, increasing his appeal with both alternative music fans and middle-class teenagers.[4] Some considered the Body Count performances to be the highlight of the tour.[5] The group made its first album appearance on Ice-T's 1991 solo album O.G. Original Gangster. The song, \"Body Count\", was preceded by a spoken introduction in which Ice-T responds to allegations that he had \"sold out\" by incorporating rock elements into his rap albums by pointing out that rock music originated with African-American artists such as Chuck Berry, Bo Diddley and Little Richard, in addition to stating that \"as far as I'm concerned, music is music. I don't look at it as rock, R&B, or all that kind of stuff. I just look at it as music. [...] I do what I like and I happen to like rock 'n' roll, and I feel sorry for anybody who only listens to one form of music.\"[6]\n",
            "Body Count's self-titled debut album was released on Sire/Warner Bros. Records on March 31, 1992. On the strength of the album, Body Count toured internationally, developing a strong following.[1] When the group performed in Milan, Italy, some of the punks in the crowd began spitting at Ernie C.[1] Ice-T attempted to calm the situation by telling the crowd not to spit, but the spitting continued.[1] As the band prepared to play \"Cop Killer\", Ice-T identified an audience member who spit in his direction; Ice-T responded by rushing into the crowd and punching the spitter.[1] As the band began to play, some of the audience began fighting with Ice-T. Body Count escaped the crowd mid-song, and the promoter immediately shut the concert down.[1]\n",
            "Outside the venue, angry audience members trashed the band's tour bus. The band hailed a taxicab, but its driver abandoned the cab when the mob surrounded the taxi and shot at it, leading the promoter, representing Body Count, to steal the taxi in order to escape, abandoning it and their tour coats a mile away from the venue. [1] The promoters representant was Rolf Stahlhofen, who later became the singer of the german multiplatinum selling Band Söhne Mannheims. They hailed another cab, and the driver attempted to take them back to the venue until the band screamed at the driver to take them to the hotel.[1] The incident was the subject of much controversy and coverage on Italian television. The band appeared on a Milan radio station, where the disc jockey told his audience, \"Some clowns tried to ruin his concert. We should be angry at them. Ice-T is a guest in our country, we invited him to do all these sold-out shows, and we love him!\"[1] Several Italian fans apologized for the behavior of the Milan audience.[1]\n"
         ]
      },
      "Controversy over the song Cop Killer (1992)": {
         "text": [
            "The song \"Cop Killer\", intended to criticize corrupt police officers, encountered controversy, as it was seen as an attack against the entire police force.[3][7] According to Ice-T, \"I thought I was safe. I thought within the world of rock'n'roll, you could be free to write what you want. Hell, I was listening to Talking Heads singin' 'Psycho Killer.' Fuck it, I'll make 'Cop Killer'! But, that was the cross of metal with something that was real. Now we’re not just killing your family, we’re killing somebody so real that everybody just went, 'oh shit.'\"[8]\n",
            "The Dallas Police Association and the Combined Law Enforcement Association of Texas launched a campaign to force Warner Bros. Records to withdraw the album.[9] Within a week, they were joined by police organizations across the United States.[9] Some critics argued that the song could cause crime and violence.[9] Many defended the song on the basis of the group's right to freedom of speech. In The Ice Opinion: Who Gives a Fuck, Ice-T wrote that \"The people who did have a platform were way off backing me on the First Amendment. That's not where all the anger should have been directed. The anger should have been generated back at the police. [...] Because people jumped on the wrong issue they were able to drive this thing totally through Warner Brothers.\"[3]\n",
            "Over the next month, controversy against the band grew. Vice President Dan Quayle branded \"Cop Killer\" as being \"obscene,\" and President George H.W. Bush publicly denounced any record company that would release such a product.[9] At a Time-Warner shareholders' meeting, actor Charlton Heston stood and read lyrics from the song \"KKK Bitch\" to an astonished audience and demanded that the company take action.[9] The criticism escalated to the point where death threats were sent to Time-Warner executives, and shareholders threatened to pull out of the company. Finally, Ice-T decided to remove \"Cop Killer\" from the album of his own volition.[3][7][10] In an interview, Ice-T stated that \"I didn't want my band to get pigeon-holed as that's the only reason that record sold. It just got outta hand and I was just tired of hearing it. I said, 'fuck it,' I mean they're saying we did it for money, and we didn't. I'd gave the record away, ya know, let's move on, let's get back to real issues, not a record but the cops that are out there killing people.\"[10]\n",
            "\"Cop Killer\" was replaced by a new version of \"Freedom of Speech,\" a song from Ice-T's 1989 solo album The Iceberg/Freedom of Speech...Just Watch What You Say. The song was re-edited and remixed to give it a more rock-oriented sound. Ice-T left Warner Bros. Records the following year because of disputes over the Ice-T solo album Home Invasion,[3] taking Body Count with him. Despite the controversy, the album received some praise, including A- reviews from Entertainment Weekly and The Village Voice, who later ranked the album among their list of The 40 Best Albums of 1992.[11] Variety reported that the album had sold 480,000 copies by January 29, 1993.[12]\n"
         ]
      },
      "Continued albums: Born Dead, Violent Demise and Murder 4 Hire (1993–2008)": {
         "text": [
            "In 1993, Body Count recorded a cover of \"Hey Joe\" for the Jimi Hendrix tribute album Stone Free: A Tribute to Jimi Hendrix.[13] The band released their second album, Born Dead in 1994 on Virgin Records. Prior to the recording of Body Count's third album Violent Demise: The Last Days (1997), bassist Mooseman left the group and was replaced by Griz. Drummer Beatmaster V died of leukemia soon after the album was completed,[14] and a new drummer named O.T. filled in the position. Bassist Griz left the band later on, and in the meanwhile, former bassist Mooseman was shot in a drive-by shooting in February 2001 after recording an album and preparing for another tour with Iggy Pop in his band the Trolls.[14] In late 2004, rhythm guitarist D-Roc died due to complications from lymphoma, leaving only Ice-T and Ernie C from the original line-up.[14]\n",
            "Ice-T has stated that \"For me, honestly, after something like that, you can either come to a dead stop or you can go on. [...] It was so emotional. We were in the middle of making a new record together and he goes and dies? It was like, 'damn!' Soon enough, though, everybody was like, 'c'mon c'mon you gotta do it.' It was make-or-break. The key essence of Body Count is it's a band made up of friends. It's not about going out and hiring the best drummer or the best guitarist. If we don't know you, you can’t be in the band.\"[8]\n",
            "In July 2006, Body Count released their fourth album, Murder 4 Hire on the indie record label Escapi Music.[8] Its album cover, featuring Uncle Sam holding a cardboard sign reading \"Will Kill for Money,\" compares the United States military to contract killers.[15] The then-line-up included drummer O.T., bassist Vincent Price and rhythm guitarist Bendrix. The band then took an extended hiatus for a couple of years; in regards to the future of Body Count, Ernie C stated, \"We will carry on the band. I don't know if it will be Body Count, but in some form, Ice and I will always play together.\"[14]\n"
         ]
      },
      "Hiatus, Gears of War 3 soundtrack (2009–2012)": {
         "text": [
            "The band's presence between after 2009 was sporadic: On September 6, 2009, Body Count made an appearance at the Vans Warped Tour 15th-anniversary party at Club Nokia in downtown Los Angeles. The group played a 20-minute set, covered Slayer, and closed with their controversial classic \"Cop Killer\".[16] Also on the bill were NOFX, Katy Perry, Pennywise, Bad Religion and Rise Against. Mike Sullivan of ExploreMusic caught up with Ernie C at the 2010 edition of the Vans Warped Tour. While briefly chatting, Ernie C divulged that the band was recording its fifth studio album.[17] Body Count wrote an exclusive song, \"The Gears of War\", for the video game Gears of War 3, and performed it at a party promoting the game.[18]\n"
         ]
      },
      "Resurgence: Manslaughter, Bloodlust and Carnivore (2013–present)": {
         "text": [
            "On December 9, 2012, Ice-T announced on Twitter that Body Count would begin production on a fifth studio album in January 2013.[19] The following day, Ice-T revealed that Body Count has signed with Sumerian Records.[20] Ice-T suggested that the album was going to be titled Rise![20] or Manslaughter.[21][22] On May 10, 2013, Ice-T announced that work on the fifth studio album had begun and that it would be titled Manslaughter. The album was released on June 10, 2014.[23] On May 13, 2014, Ice-T played the song \"Talk Shit, Get Shot\" as a teaser for the new album.\n",
            "Their sixth album, titled Bloodlust, was released in March 2017 via Century Media Records.[24] On December 28, 2016, Ice-T posted a preview of the first single \"No Lives Matter\" to Twitter. Guest musicians confirmed to appear on the album are Max Cavalera, Randy Blythe and Dave Mustaine. Upon the release of Bloodlust, it was confirmed that Ice T's son Tracy Marrow Jr, aka Little Ice, is now a part of the band, performing backing vocals.\n",
            "In May 2018, Ice-T revealed to Loudwire that Body Count would enter the studio around September to start recording tracks for their seventh studio album Carnivore. On the meaning of the album title, the rapper said, \"It's basically: 'Fuck vegans.' We figure, anything carnivorous pretty much kicks ass. We're carnivorous! I'm not [really] saying 'Fuck vegans.' Everyone's so pussy right now, [so] we're carnivores.\"[25] The recording sessions began in April 2019.[26] The title track was released as the first single on December 13.[27] The album was released on March 6, 2020.[28]\n"
         ]
      }
   },
   "Style": {
      "Lyrics": {
         "text": [
            "Ice-T's lyrics focus on reality-based themes, including gang life, because he felt it would be scarier than the fantasy-based horror themes of most heavy metal bands.[1] The band's third album, Violent Demise: The Last Days, featured album cover art depicting the hand signs of these gangs.[1] According to Ice-T, \"We named the group Body Count because every Sunday night in L.A., I'd watch the news, and the newscasters would tally up the youths killed in gang homicides that week and then just segue to sports. 'Is that all I am,' I thought, 'a body count?'\"[3]\n",
            "When the band's debut album was released, Ice-T defined it as being \"a rock album with a rap mentality.\"[29] Like Ice-T's hip hop albums, the group's material focused on various social and political issues, with songs focusing on topics ranging from police brutality to drug abuse. Ernie C has stated that \"We were just a band that played the songs that we knew how to write. Everybody writes about whatever they learned growing up, and we were no exception. Like the Beach Boys sing about the beach, we sing about the way we grew up.\"[30]\n",
            "While a good portion of Body Count's lyrics are current issues, Ice-T notes that he also considers Body Count \"grindhouse\", and that some of the songs are humorous exaggerations of violence;[31] he also expects fans to be able to tell the difference.[32]\n"
         ]
      },
      "Music": {
         "text": [
            "Body Count's musical style derives from the dark, ominous tones of traditional heavy metal bands such as Black Sabbath and thrash metal bands such as Slayer,[1] as well as hardcore punk's aggressiveness. According to Ernie C, \"We wanted to be a big punk band [...] Our first record is almost a punk record.\"[30] The presence of a rapper in a heavy metal band has been credited for paving the way for the rise of rap metal and nu metal,[33][34][35][36] even though Ice-T does not rap in most Body Count songs and considers it to solely be a rock band.[1] According to Ernie C, \"A lot of rappers want to be in a rock band, but it has to be done sincerely. You can’t just get anybody on guitar and expect it to work. [...] Ice and I, on the other hand, really loved the music we were doing, and it showed.\"[30]\n"
         ]
      }
   },
   "Members": {
      "Timeline": {},
      "text": [
         "Singer Ice-T\n",
         "Guitarist Ernie C\n",
         "Bassist Vincent Price\n",
         "Drummer Ill Will\n",
         "Guitarist Juan of the Dead\n",
         "\n",
         "\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Singles": {}
   },
   "Videos": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Body Count is an American heavy metal band formed in Los Angeles, California, in 1990. The group is fronted by Ice-T, who first established himself as a rapper but co-founded the group with lead guitarist Ernie C out of their interest in heavy metal music. Ice-T took on the role of vocalist and writing the lyrics for most of Body Count's songs, while Ernie C has been responsible for writing the group's music.\n",
      "Body Count's self-titled debut album was released on Sire Records in 1992, and garnered much attention due to a controversy around the song \"Cop Killer\". Their label, Sire Records, and their parent company, Warner Bros. Records, defended the song; however Ice-T chose to remove it from the album because he felt that the controversy had eclipsed the music itself. The group left Sire the following year, and they have since released six more albums.\n",
      "Three out of the band's original six members are deceased: D-Roc died from lymphoma, Beatmaster V from leukemia and Mooseman in a drive-by shooting. Body Count's current lineup includes vocalist Ice-T, guitarists Ernie C and Juan of the Dead, bassist Vincent Price, drummer Will \"Ill Will\" Dorsey, Jr., and backing vocalists Sean E Sean and Little Ice, the latter of whom is Ice-T's son.\n",
      "Ice-T's interest in heavy metal stemmed from sharing a room with his cousin Earl, who was a fan of rock music and only listened to the local rock stations. Ice-T particularly enjoyed heavy metal, citing Edgar Winter, Led Zeppelin and Black Sabbath as his favorite bands.[1] Ice-T attended Crenshaw High School, where a few classmates shared his interest in the genre, including musicians Ernie C, D-Roc the Executioner, Beatmaster V, and Mooseman. Ice-T began a solo career as a rapper, and later decided to form Body Count with these friends.[1][2]\n"
   ]
}