{
   "Name": "Bread (band)",
   "rawData": [
      "Bread was an American soft rock band from Los Angeles, California. They had 13 songs chart on the Billboard Hot 100 between 1970 and 1977.\n",
      "The band was fronted by David Gates (vocals, bass guitar, guitar, keyboards, violin, viola, percussion), with Jimmy Griffin (vocals, guitar, keyboards, percussion) and Robb Royer (bass guitar, guitar, flute, keyboards, percussion, recorder, backing vocals). On their first album session musicians Ron Edgar played drums and Jim Gordon played drums, percussion, and piano. Mike Botts became their permanent drummer when he joined in the summer of 1969, and Larry Knechtel replaced Royer in 1971, playing keyboards, bass guitar, guitar, and harmonica.\n",
      "David Gates was from Tulsa, Oklahoma. He released a song in the late 1950s entitled  \"Jo-Baby\"/\"Lovin' at Night\". Gates knew Leon Russell and both played in bar bands around the Tulsa area.  Both Gates and Russell headed for California to check out the music scene there. Before forming Bread, Gates had worked with Royer's previous band, the Pleasure Fair, who recorded one album for the UNI Records label with Gates producing and arranging. Royer then introduced Gates to his songwriting partner, Griffin, and the trio joined together in 1968 and signed with Elektra Records in January 1969. The group's first single, \"Dismal Day\", was released in June 1969 but did not chart. Their debut album, Bread, was released in September 1969 and peaked at No. 127 on the Billboard 200. Songwriting on the album was split evenly between Gates and the team of Griffin-Royer. Session musicians Jim Gordon and Ron Edgar accompanied the band on drums for the album.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Soft rock[1]"
      ],
      "Years active": [
         "1968 (1968)–1973 (1973)",
         "1976 (1976)–1978 (1978)",
         "1996 (1996)–1997 (1997)"
      ],
      "Labels": [
         "Elektra"
      ],
      "Associated acts": [
         "The Remingtons",
         "The Pleasure Fair",
         "Toast/Radio Dixie"
      ],
      "Past members": [
         "David Gates",
         "Jimmy Griffin",
         "Robb Royer",
         "Mike Botts",
         "Larry Knechtel"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Los Angeles, California. They had 13 songs chart on the Billboard Hot 100 between [YEAR] and [YEAR].\n",
      "The band was fronted by David Gates (vocals, bass guitar, guitar, keyboards, violin, viola, percussion), with [PERSON_NAME_FULL_2_MALE] (vocals, guitar, keyboards, percussion) and [PERSON_NAME_FULL_1_MALE] (bass guitar, guitar, flute, keyboards, percussion, recorder, backing vocals). On their first album session musicians Ron Edgar played drums and [PERSON_NAME_FULL_3_MALE] played drums, percussion, and piano. Mike Botts became their permanent drummer when he joined in the summer of [YEAR], and [PERSON_NAME_FULL_0_MALE] replaced [PERSON_NAME_LAST_1] in [YEAR], playing keyboards, bass guitar, guitar, and harmonica.\n",
      "David Gates was from Tulsa, Oklahoma. He released a song in the late [YEAR]s entitled  \"Jo-Baby\"/\"Lovin' at Night\". Gates knew Leon Russell and both played in bar bands around the Tulsa area.  Both Gates and Russell headed for California to check out the music scene there. Before forming [BAND_NAME], Gates had worked with Royer's previous band, the Pleasure Fair, who recorded one album for the UNI Records label with Gates producing and arranging. Royer then introduced Gates to his songwriting partner, Griffin, and the trio joined together in [YEAR] and signed with Elektra Records in [MONTH] [YEAR]. The group's first single, \"Dismal Day\", was released in [MONTH] [YEAR] but did not chart. Their debut album, [BAND_NAME], was released in [MONTH] [YEAR] and peaked at No. 127 on the Billboard 200. Songwriting on the album was split evenly between Gates and the team of Griffin-Royer. Session musicians [PERSON_NAME_FULL_0_MALE] and Ron Edgar accompanied the band on drums for the album.\n"
   ]
}