{
   "Name": "Butcher Babies",
   "rawData": [
      "Butcher Babies is an American heavy metal band from Los Angeles, California, consisting of frontwomen Heidi Shepherd and Carla Harvey, guitarist Henry Flury (Amen), bassist Ricky Bonazza, and drummer Chase Brickenden. Their debut album, Goliath, was released on July 9, 2013 via Century Media Records. It sold 3,300 copies in the US during its first week of release and charted at No. 3 on the Billboard Heatseeker chart and No. 112 on the Billboard 200.\n",
      "The Butcher Babies formed by vocalists Heidi Shepherd and Carla Harvey in 2010. The band self-released their first EP in 2011. In July 2011, they released a comic book at the Comic-Con in San Diego on July 23 and 24. The comic book was written by Harvey and illustrated by Anthony Winn. Rock journalist Keith Valcourt stated in his review of one of the band's shows: \"The Butcher Babies deliver a loud crashing blend of heavy metal, punk and thrash that recalls Pantera, adding their stage show embodies the horror antics of Alice Cooper and Rob Zombie. Carla and Heidi don't merely sing: they assault the crowd with a blinding flash of aggression and abuse. And the crowd loves them for it.\" They gained a lot of attention from their YouTube video of them performing \"Fucking Hostile\" by Pantera.\n",
      "On January 6, 2012, the Butcher Babies premiered a new song, \"Mr. Slowdeath\". On May 24, they released their first music video for \"Mr. Slowdeath\", which was produced by Mudrock (Avenged Sevenfold, Godsmack), which is from the band's self-released EP.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Groove metal, thrash metal, metalcore, nu metal, alternative metal"
      ],
      "Years active": [
         "2009–present"
      ],
      "Labels": [
         "Century Media, independent"
      ],
      "Associated acts": [
         "Amen, Azdachao, Scars of Tomorrow, Thrown into Exile"
      ],
      "Website": [
         "butcherbabiesofficial.com"
      ],
      "Members": [
         "Heidi Shepherd",
         "Carla Harvey",
         "Henry Flury",
         "Chase Brickenden",
         "Ricky Bonazza"
      ],
      "Past members": [
         "Chris Warner",
         "Jason Klein"
      ]
   }
}