{
   "Name": "Candygram for Mongo",
   "Sections": [
      "1 Biography",
      "2 Career",
      "3 In popular culture",
      "4 Live performance",
      "5 Releases",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Candygram For Mongo (sometimes known as C4M) is a rock and roll band based in Los Angeles, California.  The band name refers to a quote from the Mel Brooks movie Blazing Saddles.\n"
      ]
   },
   "Biography": {
      "text": [
         "Candygram for Mongo was founded in 2005 by drummer Gary Sharp and vocalist and guitarist Tony Shea. The two had been friends for five years when they discovered a mutual interest in music. Sharp and Shea began rehearsing and writing together with the idea of creating a studio project. They enlisted the help of Johnny Dwinell (also known as \"Johnny D\"), a producer and musician from Los Angeles by way of Nashville who was impressed with the unique sound of the band and officially joined Candygram For Mongo as the guitarist. The band also recruited Dan Cohen, a top notch studio musician who has played and recorded with many musicians, including members of the Gigolo Aunts, Happy Stars, The Posies, The Rembrandts, and Dogs Eye View, to become the band's permanent bassist despite his background primarily as a guitarist. The band added bassist James Baker in 2008, allowing Cohen to become the group's primary guitarist. Johnny Dwinell left the group shortly after Baker joined.\n"
      ]
   },
   "Career": {
      "text": [
         "The band's first public show was on September 3, 2006 at the Viper Room in Los Angeles.\n",
         "Candygram For Mongo's first record release was entitled “The Red Pill”. Though the term “The Red Pill” is often associated with the films in the Matrix series, the band stated that the album title is a coincidence based upon an inside joke and has nothing to do with the popular film series.\n"
      ]
   },
   "In popular culture": {
      "text": [
         "The band's music has been used on Battlestar Galactica, which aired on the NBC-owned Sci-Fi Channel. Their music was also used on Unhitched, the 2008 comedy television show produced by the Farrelly Brothers. The band members appeared as extras on Unhitched in March 2008.\n"
      ]
   },
   "Live performance": {
      "text": [
         "The band has performed at world-famous venues including the Viper Room, House of Blues, The Key Club, The Derby, Cat Club and the Mint. Beyond the band's growing reputation as a live act and the national exposure from television placements, they have won a variety of numerous online competitions. The band's song “Happy” was on the Garageband.com charts for more than six months. As a result, “Happy”, was accepted into Clear Channel’s Discover New Music Program and consequently featured on 400 Clear Channel FM Radio Station Websites.\n"
      ]
   },
   "Releases": {
      "text": [
         "\"Red Pill\" (2007)\"Candygram for Mongo\" (2008)\n",
         "\"Bang\" (2013)\n"
      ]
   },
   "External links": {},
   "coreData": [
      "Candygram For Mongo (sometimes known as C4M) is a rock and roll band based in Los Angeles, California.  The band name refers to a quote from the Mel Brooks movie Blazing Saddles.\n",
      "Candygram for Mongo was founded in 2005 by drummer Gary Sharp and vocalist and guitarist Tony Shea. The two had been friends for five years when they discovered a mutual interest in music. Sharp and Shea began rehearsing and writing together with the idea of creating a studio project. They enlisted the help of Johnny Dwinell (also known as \"Johnny D\"), a producer and musician from Los Angeles by way of Nashville who was impressed with the unique sound of the band and officially joined Candygram For Mongo as the guitarist. The band also recruited Dan Cohen, a top notch studio musician who has played and recorded with many musicians, including members of the Gigolo Aunts, Happy Stars, The Posies, The Rembrandts, and Dogs Eye View, to become the band's permanent bassist despite his background primarily as a guitarist. The band added bassist James Baker in 2008, allowing Cohen to become the group's primary guitarist. Johnny Dwinell left the group shortly after Baker joined.\n",
      "The band's first public show was on September 3, 2006 at the Viper Room in Los Angeles.\n",
      "Candygram For Mongo's first record release was entitled “The Red Pill”. Though the term “The Red Pill” is often associated with the films in the Matrix series, the band stated that the album title is a coincidence based upon an inside joke and has nothing to do with the popular film series.\n"
   ]
}