{
   "Name": "Canned Heat",
   "rawData": [
      "Canned Heat is an American rock band that was formed in Los Angeles in 1965. The group has been noted for its interpretations of blues material and for its efforts to promote interest in this type of music and its original artists. It was launched by two blues enthusiasts Alan Wilson and Bob Hite, who took the name from Tommy Johnson's 1928 \"Canned Heat Blues\", a song about an alcoholic who had desperately turned to drinking Sterno, generically called \"canned heat\", from the original 1914 product name Sterno Canned Heat, After appearances at the Monterey and Woodstock festivals at the end of the 1960s, the band acquired worldwide fame with a lineup consisting of Hite (vocals), Wilson (guitar, harmonica and vocals), Henry Vestine and later Harvey Mandel (lead guitar), Larry Taylor (bass), and Adolfo de la Parra (drums).\n",
      "The music and attitude of Canned Heat attracted a large following and established the band as one of the popular acts of the hippie era. Canned Heat appeared at most major musical events at the end of the 1960s, performing blues standards along with their own material and occasionally indulging in lengthy 'psychedelic' solos. Two of their songs — \"Going Up the Country\" and \"On the Road Again\" — became international hits. \"Going Up the Country\" was a remake of the Henry Thomas song \"Bull Doze Blues\", recorded in Louisville, Kentucky, in 1927. \"On the Road Again\" was a remake of the 1953 Floyd Jones song of the same name, which is reportedly based on the Tommy Johnson song \"Big Road Blues\", recorded in 1928.\n",
      "Since the early 1970s, numerous personnel changes have occurred. For much of the 1990s and 2000s and following Larry Taylor's death in 2019, de la Parra has been the only member from the band's 1960s lineup. He wrote a book about the band's career, titled Living the Blues. Mandel, Walter Trout and Junior Watson are among the guitarists who gained fame for playing in later editions of the band.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Blues rock",
         "boogie rock"
      ],
      "Years active": [
         "1965–present"
      ],
      "Labels": [
         "Liberty",
         "Ruf",
         "United Artists",
         "Rhino"
      ],
      "Associated acts": [
         "John Mayall & the Bluesbreakers",
         "John Lee Hooker"
      ],
      "Website": [
         "cannedheatmusic.com"
      ],
      "Members": [
         "Adolfo \"Fito\" de la Parra",
         "Dale Spalding",
         "John Paulus",
         "Rick Reed"
      ],
      "Past members": [
         "See List of Canned Heat band members"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band that was formed in Los Angeles in [YEAR]. The group has been noted for its interpretations of blues material and for its efforts to promote interest in this type of music and its original artists. It was launched by two blues enthusiasts Alan Wilson and [PERSON_NAME_FULL_0_MALE], who took the name from Tommy Johnson's [YEAR] \"[BAND_NAME] Blues\", a song about an alcoholic who had desperately turned to drinking Sterno, generically called \"canned heat\", from the original [YEAR] product name Sterno [BAND_NAME], After appearances at the Monterey and Woodstock festivals at the end of the [YEAR]s, the band acquired worldwide fame with a lineup consisting of [PERSON_NAME_LAST_0] (vocals), Wilson (guitar, harmonica and vocals), [PERSON_NAME_FULL_1_MALE] and later Harvey Mandel (lead guitar), [PERSON_NAME_FULL_2_MALE] (bass), and Adolfo de la Parra (drums).\n",
      "The music and attitude of [BAND_NAME] attracted a [GENRE] band as one of the popular acts of the hippie era. [BAND_NAME] appeared at most major musical events at the end of the [YEAR]s, performing blues standards along with their own material and occasionally indulging in lengthy 'psychedelic' solos. Two of their songs — \"Going Up the Country\" and \"On the Road Again\" — became international hits. \"Going Up the Country\" was a remake of the Henry Thomas song \"Bull Doze Blues\", recorded in Louisville, Kentucky, in [YEAR]. \"On the Road Again\" was a remake of the [YEAR] Floyd Jones song of the same name, which is reportedly based on the [PERSON_NAME_FULL_0_MALE] song \"Big Road Blues\", recorded in [YEAR].\n",
      "Since the early [YEAR]s, numerous personnel changes have occurred. For much of the [YEAR]s and [YEAR]s and following Larry Taylor's death in [YEAR], de la Parra has been the only member from the band's [YEAR]s lineup. He wrote a [GENRE] band's career, titled Living the Blues. Mandel, [PERSON_NAME_FULL_0_MALE] and [MONTH]ior Watson are among the guitarists who gained fame for playing in later editions of the band.\n"
   ]
}