{
   "Name": "The Chambers Brothers",
   "rawData": [
      "The Chambers Brothers are an American psychedelic soul band, best known for their eleven-minute 1967 hit \"Time Has Come Today\". The group was part of the wave of new music that integrated American blues and gospel traditions with modern psychedelic and rock elements. Their music has been kept alive through heavy use in film soundtracks.\n",
      "Originally from Carthage, Mississippi, the Chambers Brothers first honed their skills as members of the choir in their Baptist church. This set up ended in 1952 when the eldest brother George was drafted into the Army. George relocated to Los Angeles after his discharge, and his brothers soon settled there as well. As a foursome, they began performing gospel and folk throughout the Southern California region in 1954, but they more or less remained unknown until appearing in New York City in 1965.\n",
      "Consisting of George (September 26, 1931 - October 12, 2019) on washtub bass (later on Danelectro bass guitar), Lester (b. April 13, 1940) on harmonica, and Willie (b. March 3, 1938) and Joe (b. August 22, 1942) on guitar, the group started to venture outside the gospel circuit, playing at coffeehouses that booked folk acts. They played at places like The Ash Grove, a very popular Los Angeles folk club. It became one of their favorite haunts and brought them into contact with Hoyt Axton, Ramblin' Jack Elliott, Reverend Gary Davis, and Barbara Dane. Dane became a great supporter, performing and recording with the brothers. With the addition of Brian Keenan (January 28, 1943 – October 5, 1985) on drums, Dane took them on tour with her and introduced them to Pete Seeger, who helped put the Chambers Brothers on the bill of the 1965 Newport Folk Festival. One of the songs they performed, \"I Got It\", appeared on the Newport Folk Festival 1965 compilation LP, which was issued on the Vanguard label.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California"
      ],
      "Genres": [
         "Psychedelic soul[1][2]"
      ],
      "Years active": [
         "1954–1972, 1974–present"
      ],
      "Labels": [
         "Vault, Columbia, Avco, Roxbury"
      ],
      "Past members": [
         "George Chambers [deceased] ",
         "Joe Chambers",
         "Lester Chambers",
         "Willie Chambers",
         "Brian Keenan"
      ]
   }
}