{
   "\"Time Has Come Today\"": {
      "text": [
         "The band scored its only major hit in the fall of 1968 with \"Time Has Come Today\", an 11-minute opus written by Joe and Willie Chambers and highlighted by echoing vocal effects and Keenan's drumming which gave the song a psychedelic feel. \"Time Has Come Today\" was edited for release as a single and spent five consecutive weeks in September–October at #11 on the Billboard Hot 100, just missing the Top Ten.\n"
      ]
   },
   "Charted singles": {
      "text": [
         "\nTime Has Come Today\n",
         "\nBillboard albums listing\n"
      ]
   },
   "Discography": {
      "Collaborations": {},
      "Compilations": {},
      "Live albums": {},
      "Studio albums": {},
      "Unreleased album": {}
   },
   "Early career": {
      "text": [
         "Originally from Carthage, Mississippi,[3] the Chambers Brothers first honed their skills as members of the choir in their Baptist church. This set up ended in 1952 when the eldest brother George was drafted into the Army. George relocated to Los Angeles after his discharge, and his brothers soon settled there as well. As a foursome, they began performing gospel and folk throughout the Southern California region in 1954, but they more or less remained unknown until appearing in New York City in 1965.[4]\n",
         "Consisting of George (September 26, 1931 - October 12, 2019)[5] on washtub bass (later on Danelectro bass guitar), Lester (b. April 13, 1940) on harmonica, and Willie (b. March 3, 1938) and Joe (b. August 22, 1942) on guitar, the group started to venture outside the gospel circuit, playing at coffeehouses that booked folk acts. They played at places like The Ash Grove, a very popular Los Angeles folk club. It became one of their favorite haunts and brought them into contact with Hoyt Axton, Ramblin' Jack Elliott, Reverend Gary Davis, and Barbara Dane. Dane became a great supporter, performing and recording with the brothers. With the addition of Brian Keenan (January 28, 1943 – October 5, 1985) on drums, Dane took them on tour with her and introduced them to Pete Seeger, who helped put the Chambers Brothers on the bill of the 1965 Newport Folk Festival. One of the songs they performed, \"I Got It\", appeared on the Newport Folk Festival 1965 compilation LP, which was issued on the Vanguard label.[6]\n",
         "They were becoming more accepted in the folk community, but, like many on the folk circuit, were looking to electrify their music and develop a more rock and roll sound. Joe Chambers recalled in a May 1994 Goldmine article that people at the Newport Folk Festival were breaking down fences and rushing to the stage. \"Newport had never seen or heard anything like that.\" After the group finished and the crowd finally settled down, the MC came up and said \"Whether you know it or not, that was rock 'n' roll.\" That night they played at a post-concert party for festival performers and went to a recording session of the newly electrified Bob Dylan.[6] Shortly after appearing at Newport, the group released its debut album, People Get Ready.\n"
      ]
   },
   "External links": {},
   "Later years": {
      "text": [
         "Later incarnations of the group included session guitarist Steve Hunter (known for his work with Alice Cooper)[7] and session whiz Stephen Patt (Northwind),[citation needed] freeing the brothers up to become front men, not just instrumentalists.[citation needed] However, due to a succession of dishonest promoters and managers, the group was unable to build on their success and eventually split up in 1972. An album recorded that same year for Columbia, Oh! My God, remains unreleased. They reformed and moved from Columbia to Avco Records and released Unbonded (1974) and Right Move (1975). In 1976 the brothers released Recorded Live In Concert on Mars for the Roxbury label. They have toured irregularly since.\n",
         "They were signed to support Maria Muldaur on her Gospel Nights album. They also made commercials for Levi's jeans.\n",
         "Lester moved to New York and formed a band with former Electric Flag bassist Harvey Brooks. Guitarists Willie and Joe would find work as session men; George went back to singing gospel music[8] and would later become a deacon of his church. Keenan retired to Stamford, Connecticut where he set up his own recording studio,[8] plied his trade as a carpenter and a house painter,[citation needed] and died of heart failure in 1985.[8]\n",
         "Art Ramsey was hired as a replacement drummer. He performed live, on-the-road and in many different cities and venues with the Chambers Brothers band after Keenan's departure. Later, L.A. session drummer Fabian Jolivet joined the band for a 1997 tour that ended with the full line up returning to the Ash Grove and playing a gospel set.\n",
         "In 2006, guitarist Willie Chambers sat in with a group called Vince and the Invinceables at a benefit concert for Arthur Lee of the group Love and delivered an acclaimed performance.[9][10]\n",
         "In 2015, Joe Chambers was appearing at venues such as Harold’s Place on Pacific Ave. San Pedro as The Joe Chambers Experience.[11]\n",
         "In 2016, Willie, Joe, and occasionally George, along with their nephew Jerry Warner on bass, Crazy Tomes on guitar, and LA drummer Jon McCracken, reformed as the Chambers Brothers to do shows in the Los Angeles area;[12][13] including the world-famous Grammy Museum in Los Angeles, CA.[14]\n",
         "George Chambers died October 12, 2019 at age 88.[15][16]\n",
         "Joe Chambers collaborated with Marva Holiday, recording their version of \"To Love Somebody\".[17][18]\n"
      ]
   },
   "References": {},
   "Reviews": {},
   "Sections": [
      "1 Early career",
      "2 \"Time Has Come Today\"",
      "3 Later years",
      "4 Charted singles",
      "5 Discography",
      "5.1 Studio albums",
      "5.2 Live albums",
      "5.3 Unreleased album",
      "5.4 Compilations",
      "5.5 Collaborations",
      "6 References",
      "7 External links",
      "8 Reviews"
   ],
   "Summary": {
      "text": [
         "The Chambers Brothers are an American psychedelic soul band, best known for their eleven-minute 1967 hit \"Time Has Come Today\". The group was part of the wave of new music that integrated American blues and gospel traditions with modern psychedelic and rock elements. Their music has been kept alive through heavy use in film soundtracks.\n"
      ]
   },
   "Title": "The Chambers Brothers - Wikipedia"
}