{
   "References": {},
   "Sections": [
      "1 Track listing for \"Until December\"",
      "2 Track listing for \"Until December\" The 415 Sessions Double CD Release",
      "2.1 This Side",
      "2.2 Daddy Side",
      "3 Track listing for promo \"Until December – Heaven / Bela Lugosi's Dead\"",
      "4 References"
   ],
   "Summary": {
      "text": [
         "Until December was a San Francisco-based rock band active in the early to late 1980s.  The band released four 12\" singles in 1985 on 415 Records / CBS. A self-titled album Until December was released in 1986 by 415 Records / CBS, which contained their biggest hit \"Heaven\".\n",
         "Other notable songs performed by Until December include their song \"Until December\", \"Live Alone In Shame\" (B-Side to the 12\" of \"Until December - The Berlin Mix\") and a cover of the song \"Bela Lugosi's Dead\" by Bauhaus. In 1986, they released 12\" singles of \"Call Me\" B/W \"Free Again\" and \"Secrets (I Won't Tell)\" B/W \"We Are The Boys\". A full list of their discography can be found at Discogs.com.[1]\n",
         "They toured the U.S. as a headliner and with seminal 80's bands such as New Order, Gene Loves Jezebel, and Specimen.  The band was especially popular in the leather subculture. Before the band split up they expanded their line up to a five-piece with the addition of Mark Pistel on bass and Tim Huthert, from Specimen, as a second drummer.\n",
         "Member Adam Sherburne later formed the band Consolidated in the 1990s. Bryan Weisberg later formed Maximillion's Motorcycle Club with Tim Huthert. Greg(Auggie)Senzer former drummer owns and operates a motorcycle customizing shop and plays with several Bay Area bands.\n",
         "Frontman Adam Sherburne has negatively referred to the band as a \"profiteering, rape-oriented band,\"[2] lamenting that \"crack career ethics and rape culture took over\" and inspired his moral shift that led to forming Consolidated.[3]\n"
      ]
   },
   "Title": "Until December - Wikipedia",
   "Track listing for \"Until December\"": {
      "text": [
         "The original 1986 release.[4]\n"
      ]
   },
   "Track listing for \"Until December\" The 415 Sessions Double CD Release": {
      "Daddy Side": {
         "text": [
            "This is the August 2010 re-issue of the album on Wounded Bird Records which includes the 12\" Singles released before the original 1986 album. The track \"Forgive and Still Forget\" was originally titled \"Secrets (I Won't Tell) is included as well as are the remixed versions of \"Heaven\", \"Call Me\", and \"Free Again\".[5] The naming of each individual disc as \"This Side\" (CD1) and \"Daddy Side\" (CD2) references the Columbia 12\" release of the \"Secrets (I Won't Tell)\" / \"We Are The Boys\".[6]\n"
         ]
      },
      "This Side": {}
   },
   "Track listing for promo \"Until December – Heaven / Bela Lugosi's Dead\"": {
      "text": [
         "This side\n",
         "Daddy Side\n"
      ]
   }
}