{
   "Discography": {
      "Compilation appearances": {}
   },
   "Further reading": {},
   "History": {
      "text": [
         "The band was founded by guitarist Frank Ruffino in the fall of 1979,[4][6][7] lining up Scott Sisunik on vocals, Marc Martin as second guitarist, James Rodriguez on bass and Richard \"Skitchblade\" Katchadoorian[nb 2] on drums,[6][7] who was replaced shortly after by Vince Mesa.[1][7]\n",
         "The group's name was taken from the slang term for alpha-Methylfentanyl,[nb 3][nb 4] the same synthetic opioid that killed Darby Crash in 1980,[9] and by the Johnny Thunders and the Heartbreakers' song \"Chinese Rocks\".[1]\n",
         "According to Sisunik,[10] the band's logo[11] was inspired by a similar one[12][13] featured on The Twilight Zone episode \"Black Leather Jackets\", aired on January 31, 1964.[nb 5][15]\n",
         "After Sisunik quit the band to go on to form Social Task in late 1979,[4][7] Marc, who sang backups, and played guitar, switched to lead vocals and left guitar duties to Frank. Vince Mesa also quit in 1980 and was replaced by Frank's elder brother, Joey Ruffino. Along with Rodriguez, this is considered the most relevant and stable China White formation.[4]\n",
         "After making their mark on both the O.C. and L.A. club circuits, in 1981 China White signed to Frontier Records and released their first EP, Danger Zone with its infamous front cover of a murder scene photographed by Edward Colver in 1981.[1][4][16] They also featured tracks on New Underground Records' compilations Life Is Ugly So Why Not Kill Yourself[nb 6] from 1982, and Life Is Beautiful So Why Not Eat Health Foods[nb 7] from 1983.\n",
         "In 1984, after Marc, James and Joey quit the band, Frank brought Sisunik back to sing, while Corey Stretz took over on bass and Steven \"Spanky\" Barrios became the drummer. After a show at the Olympic Auditorium in 1985, they disbanded.\n",
         "The band resurfaced in 1993, when Frank Ruffino recorded China White's first full-length album, Addiction, with bassist Stretz, Jeff Porter as new singer and James Lugo as new drummer. This formation played some gigs on the West Coast but disbanded a few months after the release of Addiction in 1995.\n",
         "In 2002, Marc Martin, James Rodriguez and the Ruffino brothers reappeared for a reunion tour. They released two albums on Malt Soda Recordings in 2004: the limited edition Live Cheap CD, with extracts from this and past tours; and Addiction.2, a re-release of their Addiction material plus two new 1997 studio tracks as well as ten live songs from a 2003 show.\n",
         "In 2009, Frank Ruffino was diagnosed with severe liver problems, a biproduct of years of hard drinking and drug abuse, despite his resolve to get clean and sober after the band's heyday. Under medical treatment since then, by 2013, overwhelmed by cirrhosis and cancer, doctors told the guitarist and his wife, Ella, that his only shot at survival was a liver transplant.[3]\n",
         "On March 30, 2013, China White classic lineup, along with some major bands in Orange County punk scene like Cadillac Tramps, the Stitches and the Crowd, among others, gathered for a one-off benefit show held at Santa Ana´s The Observatory to raise funds for Ruffino's medical expenses. Frank was present but too ill to play, Mike Drake from the Outsiders played guitar. Despite these efforts, including an auction, Frank Ruffino died, waiting for a transplant, on June 4, 2013.[3]\n"
      ]
   },
   "Members": {
      "Current members": {},
      "Former members": {}
   },
   "Notes": {},
   "References": {},
   "Sections": [
      "1 History",
      "2 Trivia",
      "3 Members",
      "3.1 Current members",
      "3.2 Former members",
      "4 Discography",
      "4.1 Compilation appearances",
      "5 Notes",
      "6 References",
      "7 Further reading"
   ],
   "Summary": {
      "text": [
         "China White was an influential hardcore punk band from Huntington Beach, California,[1] famous for their EP Danger Zone and their violent gigs.[2] They were, along with the Crowd, Adolescents,\nSocial Distortion, T.S.O.L. and Shattered Faith, the most preeminent figures of the early Orange County punk scene.[3][4]\n",
         "Photographer Glen E. Friedman once described the band's sound as:\n",
         "\"Full doses of China White[nb 1] ... send[ing] staggering chills through your veins as you experience this nitro-punk injection.\"[5]"
      ]
   },
   "Title": "China White (band) - Wikipedia",
   "Trivia": {}
}