{
   "Biography": {
      "text": [
         "Innovators of the then-emerging sadcore movement in indie rock in the 1990s, the eclectic rock group consisted of guitarist Jonathan Kroll, drummer Christian Omar Madrigal Izzo, vocalist Troy Von Balthazar and bassist A Frank G. They formed in Honolulu in the early 1990s and moved to Los Angeles in 1992 because guitarist Jonathan Kroll was attending art school there. Shortly after the move, they were signed to Amphetamine Reptile Records in 1993, based on a demo tape the band had submitted.\n",
         "Chokebore released their debut single \"Nobody / Throats to Hit\" and their first full-length Motionless later that year. Their changing tempos and moody outbursts were unlike many other AmRep bands at the time, but their more furious and quicker paced moments aligned themselves just enough. They toured with Guzzard and Today Is The Day as well as with other more well-known like-minded bands, including the Butthole Surfers, Samiam, Girls Against Boys and Nirvana on their last 10 American shows.\n",
         "They earned a strong following in Europe, in support of 1995's Anything Near Water and A Taste for Bitters, the latter of which was recorded and engineered by Peter Deimel at Black Box studio in France. 1998's Black Black was also recorded there, and represents a portrait of the band's darker side; loneliness, depression, death and sadness recurring themes. The album was released on AmRep's European offshoot Boomba Records, but wasn't released stateside for another year, finally finding a home on Unwound's Punk In My Vitamins label.\n",
         "The band released It's a Miracle in 2002, which saw the band slightly less concerned with strict cohesion of the aesthetics and some songs were looser than on past releases (\"Ciao L.A.\" is perhaps the most straightforward rock track the band has ever put to tape). The live album A Part From Life was released in 2003 and the band went on an indefinite hiatus in 2005.\n",
         "During the following years, singer/guitar player Troy Von Balthazar recorded two solo albums in Europe, drummer Christian Omar Madrigal Izzo toured with Christian Death 1334 and guitarist Jonathan Kroll started his \"slow and wordless\" guitar project \"A Newborn Riot Of Dreams\".\n",
         "On November 18, 2009, the band announced their reunion via homepage and newsletter: \"We are happy to announce that Chokebore are getting back together again to play a handful of shows around Europe!\"[1] After a small series of European shows and festivals in 2010, Chokebore returned in October 2011 with the release of the five-track vinyl EP Falls Best, followed by a European tour in October/November 2011.[2]\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "EPs": {},
      "Singles": {}
   },
   "External links": {},
   "Members": {
      "text": [
         "\n",
         "\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Biography",
      "2 Members",
      "3 Discography",
      "3.1 Albums",
      "3.2 Singles",
      "3.3 EPs",
      "4 Videography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "\nChokebore is an American indie rock band formed in the early 1990s in Honolulu, Hawaii,  and subsequently based in Los Angeles, California, United States. The group was active between 1993-2005 before taking a hiatus for 4 years. The group reformed in 2009 and is currently active. Over the course of the band's history they were most successful with European audiences, though are based and primarily toured in the United States.\n"
      ]
   },
   "Title": "Chokebore - Wikipedia",
   "Videography": {}
}