{
   "Name": "Chokebore",
   "rawData": [
      "\nChokebore is an American indie rock band formed in the early 1990s in Honolulu, Hawaii,  and subsequently based in Los Angeles, California, United States. The group was active between 1993-2005 before taking a hiatus for 4 years. The group reformed in 2009 and is currently active. Over the course of the band's history they were most successful with European audiences, though are based and primarily toured in the United States.\n",
      "Innovators of the then-emerging sadcore movement in indie rock in the 1990s, the eclectic rock group consisted of guitarist Jonathan Kroll, drummer Christian Omar Madrigal Izzo, vocalist Troy Von Balthazar and bassist A Frank G. They formed in Honolulu in the early 1990s and moved to Los Angeles in 1992 because guitarist Jonathan Kroll was attending art school there. Shortly after the move, they were signed to Amphetamine Reptile Records in 1993, based on a demo tape the band had submitted.\n",
      "Chokebore released their debut single \"Nobody / Throats to Hit\" and their first full-length Motionless later that year. Their changing tempos and moody outbursts were unlike many other AmRep bands at the time, but their more furious and quicker paced moments aligned themselves just enough. They toured with Guzzard and Today Is The Day as well as with other more well-known like-minded bands, including the Butthole Surfers, Samiam, Girls Against Boys and Nirvana on their last 10 American shows.\n"
   ],
   "infobox": {
      "Origin": [
         "Honolulu, Hawaii, U.S."
      ],
      "Genres": [
         "Alternative rock",
         "Indie rock"
      ],
      "Years active": [
         "1993–2005",
         "2009–present"
      ],
      "Labels": [
         "Amphetamine Reptile, Boomba Rec, Punk iN My Vitamins, Pale Blue"
      ],
      "Associated acts": [
         "Dana Lynn, Troy Von Balthazar"
      ],
      "Website": [
         "www.chokebore.net"
      ],
      "Members": [
         "Troy Balthazar",
         "James Kroll",
         "Jonathan Kroll",
         "Christian Omar Madrigal Izzo"
      ],
      "Past members": [
         "Mike Featherston",
         "Johnee Kop"
      ]
   },
   "albums": [
      "Motionless",
      "Anything Near Water",
      "A Taste for Bitters",
      "Black Black",
      "It's a Miracle",
      "A Part from Life"
   ]
}