{
   "Album cover art": {
      "text": [
         "Each studio album's cover art is taken from the cover of a DAW Books edition of a book in Michael Moorcock's Elric of Melniboné saga; the art is by Michael Whelan.[16]\n"
      ]
   },
   "Discography": {
      "Albums": {
         "Compilation": {
            "text": [
               "\nBox set\n"
            ]
         },
         "Live": {},
         "Studio": {
            "text": [
               "\"×\" denotes periods where charts did not exist or were not archived.\n"
            ]
         }
      },
      "Bootlegs": {},
      "Mixtapes": {},
      "Other appearances": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "1992–2016": {
         "text": [
            "In 2001, Metal Blade Records released in Germany Servants of Chaos, a compilation album of unreleased demos and live songs.[7] With old tapes and assistance from Lindstrom and Garven, it was an attempt to give fans a wealth of archival and previously unheard material before the tapes deteriorated beyond retrieval. This double-CD was later re-released worldwide, with a rare 1984 live DVD recorded at Wolf & Rissmiller's Country Club in California.[8]\n",
            "Lindstrom now plays with Falcon, who perform some Cirith Ungol songs.[9]\n",
            "Founding guitarist Jerry Fogle died from liver failure on August 20, 1998.[10]\n"
         ]
      },
      "Disbandment": {
         "text": [
            "They played their last live show on December 13, 1991 and disbanded in 1992, following frustration with their record label.[6]\n"
         ]
      },
      "Early years": {
         "text": [
            "After forming in late 1971, the band played their first gig on January 1, 1972 at an anti-Vietnam war peace rally.\n",
            "In 1980, they were signed by Liquid Flames Records, and released their first album, Frost and Fire, with Tim Baker on vocals and songs written by bassist and guitarist Greg Lindstrom.[4] Their second album, King of the Dead was released in on July 2, 1984 and contained lyrics primarily written by vocalist Tim Baker and drummer Robert Garven.[5] The album was then followed by One Foot in Hell on August 12, 1986, and Paradise Lost on August 23, 1991.\n"
         ]
      },
      "Reunion": {
         "text": [
            "The band was reformed by members Tim Baker, Robert Garven, Jim Barraza, and Greg Lindstrom on October 8, 2016 at the 2nd annual Frost and Fire Festival in Ventura, California.[11] Throughout 2017, the band had set out to headline and co-headline several European and US festivals, including Keep It True (Germany), Up The Hammers (Greece), Defenders Of The Old (US), Chaos Descends (Germany), Psycho Las Vegas (US), Days Of Darkness (US) and Hammer of Doom (Germany).[12] In April 2018, Cirith Ungol performed at the Hell's Heroes Festival in Houston, Texas and at the NYDM Spring Bash in Milwaukee, Wisconsin. In August 2018, Cirith Ungol released the single \"Witch's Game\".\n"
         ]
      },
      "Titanic": {
         "text": [
            "Greg Lindstrom, Robert Garven, Jerry Fogle and Pat Galligan (later a guitarist in Angry Samoans) played in Titanic, their first band in junior high school. With a desire to play heavier music similar to that of Mountain and Grand Funk Railroad, the rest of the band parted with Galligan and founded Cirith Ungol in late 1971.\n"
         ]
      }
   },
   "Members": {
      "Current": {},
      "Former": {},
      "Timeline": {}
   },
   "Name": {
      "text": [
         "The band took their name from the mountain pass Cirith Ungol in J. R. R. Tolkien's epic fantasy novel The Lord of the Rings.[13]  The name is Elvish and means \"Pass of the Spider.\" While the place in Tolkien's book is pronounced \"kirith ungol,\" the band pronounced it \"sirith ungol.\" The band said they had some problems with the name:\n",
         "Everyone in the band was a big \"Sword and Sorcery\" literature fan, especially Greg [Lindstrom, guitars] and I. He would always turn us on to the great writers who gave us inspiration for our music. We read all the books... Conan, Bran Mak Morn, etcetera, but the books that stood out in my mind are Michael Moorcock's masterpieces: Elric, Hawkmoon, Corum among others. Greg Lindstrom and I met at an English Literature class where the teacher was reading Lord of the Rings... and Greg and I read it and it had an influence on our music and feelings. In retrospect I wish we had picked something easier to remember because a lot of our trouble has been over our name. People couldn't pronounce it or remember it, but we figured once they did they wouldn't forget it! We've humorously been called \"Sarah's Uncle\" and \"Serious Uncool,\" for example! I know other bands are using the Tolkien angle. Led Zeppelin even made references to it in their earlier songs. I think he was an influence both then and now on many people.",
         "I remember some other possible band names we were considering: Minas Tirith, Khazad Dum, and Uruk Hai, all names from \"The Lord Of The Rings\". Rob and I both liked J.R.R. Tolkien and Enzo Ferrari, so we knew our songs would cover both those subjects!"
      ]
   },
   "Notes": {},
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Titanic",
      "1.2 Early years",
      "1.3 Disbandment",
      "1.4 1992–2016",
      "1.5 Reunion",
      "2 Name",
      "3 Album cover art",
      "4 Members",
      "4.1 Current",
      "4.2 Former",
      "4.3 Timeline",
      "5 Discography",
      "5.1 Albums",
      "5.1.1 Studio",
      "5.1.2 Live",
      "5.1.3 Compilation",
      "5.2 Mixtapes",
      "5.3 Singles",
      "5.4 Other appearances",
      "5.5 Bootlegs",
      "6 Notes",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Cirith Ungol is an American heavy metal band formed in late 1971 in Ventura, California.[1] This early doom and power metal group is known for lyrics based on fantasy (particularly sword and sorcery).[2] The band took their name from the mountain pass Cirith Ungol in J. R. R. Tolkien's epic fantasy novel The Lord of the Rings\n",
         "Throughout the 1970s, the band generally played a style of heavy metal heavily rooted in hard and progressive rock. Its first studio album, Frost and Fire (1981), featured a heavier sound,[3] generally regarded as an early example of American power metal. By its second studio album, King of the Dead (1984), it had solidified its power metal style while gravitating toward a much \"darker\" sound, with many considering the album among the first doom metal releases.\n"
      ]
   },
   "Title": "Cirith Ungol (band) - Wikipedia"
}