{
   "Name": "Cirith Ungol (band)",
   "rawData": [
      "Cirith Ungol is an American heavy metal band formed in late 1971 in Ventura, California. This early doom and power metal group is known for lyrics based on fantasy (particularly sword and sorcery). The band took their name from the mountain pass Cirith Ungol in J. R. R. Tolkien's epic fantasy novel The Lord of the Rings\n",
      "Throughout the 1970s, the band generally played a style of heavy metal heavily rooted in hard and progressive rock. Its first studio album, Frost and Fire (1981), featured a heavier sound, generally regarded as an early example of American power metal. By its second studio album, King of the Dead (1984), it had solidified its power metal style while gravitating toward a much \"darker\" sound, with many considering the album among the first doom metal releases.\n",
      "Greg Lindstrom, Robert Garven, Jerry Fogle and Pat Galligan (later a guitarist in Angry Samoans) played in Titanic, their first band in junior high school. With a desire to play heavier music similar to that of Mountain and Grand Funk Railroad, the rest of the band parted with Galligan and founded Cirith Ungol in late 1971.\n"
   ],
   "infobox": {
      "Origin": [
         "Ventura, California, United States"
      ],
      "Genres": [
         "Heavy metal, epic doom metal, power metal"
      ],
      "Years active": [
         "1971–1992, 2016–present"
      ],
      "Labels": [
         "Metal Blade, Liquid Flames, Restless"
      ],
      "Associated acts": [
         "Titanic",
         "Falcon",
         "Angry Samoans"
      ],
      "Website": [
         "http://www.truemetal.org/cirithungol/"
      ],
      "Members": [
         "Tim Baker",
         "Greg Lindstrom",
         "Robert Garven",
         "Jim Barraza"
      ],
      "Past members": [
         "Neal Beattie",
         "Jerry Fogle",
         "Michael Vujea",
         "Bob Warrenburg",
         "Vernon Green"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in late [YEAR] in Ventura, California. This early doom and power metal group is known for lyrics based on fantasy (particularly sword and sorcery). The band took their name from the mountain pass [BAND_NAME] in J. R. R. Tolkien's epic fantasy novel The Lord of the Rings\n",
      "Throughout the [YEAR]s, the band generally played a style of heavy metal heavily rooted in hard and progressive rock. Its first studio album, Frost and Fire ([YEAR]), featured a heavier sound, generally regarded as an early example of American power metal. By its second studio album, King of the Dead ([YEAR]), it had solidified its power metal style while gravitating toward a much \"darker\" sound, with many considering the album among the first doom metal releases.\n",
      "Greg Lindstrom, Robert Garven, [PERSON_NAME_FULL_0_MALE] and Pat Galligan (later a guitarist in Angry Samoans) played in Titanic, their first band in junior high school. With a desire to play heavier music similar to that of Mountain and Grand Funk Railroad, the rest of the band parted with Galligan and founded [BAND_NAME] in late [YEAR].\n"
   ]
}