{
   "Name": "Cold Forty Three",
   "Sections": [
      "1 Formation (2006–2007)",
      "2 Early albums and moderate success (2008)",
      "3 TV show, record release and line-up changes (2008–2009)",
      "4 Continued touring, new record and Warped Tour announcement (2009–2012)",
      "5 Launch Party album (2012–2013)",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Cold Forty Three (Cold 40*3) is an American pop and punk band from Los Angeles, California. The band consists of vocalist and guitarist Moises Cruz, vocalist and bass guitarist Joshua Cruz, and drummer Ricky James Acosta. With original lead guitarist Alex Sayes, the band achieved moderate success[clarification needed] after releasing their debut album From the Garage to Your Speakers.\n"
      ]
   },
   "Formation (2006–2007)": {
      "text": [
         "Moises Cruz, Joshua Cruz and Ricky James Acosta grew up together on the same street and in 2006, after each of their previous bands split, they formed their own band.  Due to prior engagements, Ricky James Acosta was forced to leave the band in early 2007. Not wanting to leave the band without a drummer, he introduced to the band his friend, and fellow drummer, Rene Haro.  Rene Haro appeared during rehearsals and was hired soon after. The band also hired Alex Sayes to play lead guitar.\n"
      ]
   },
   "Early albums and moderate success (2008)": {
      "text": [
         "The band recorded various demos and filmed a music video for their single \"Cheating B**ch\". The publicity eventually allowed the band to play many different Los Angeles venues, including The Whiskey A Go Go, The Roxy Theater, The El Rey Theatre, The Troubadour and other various bars and clubs on the Sunset Strip. In early 2008, the band began writing music for their first, full-length EP, which would eventually become From The Garage to Your Speakers.  During the writing process, Joshua Cruz contacted Tomas Costanza, producer, vocalist and guitarist for the band Diffuser, to discuss the possibility of working with the band on the record.  After reviewing the band's demos, Tomas Costanza agreed to produce the record.\n"
      ]
   },
   "TV show, record release and line-up changes (2008–2009)": {
      "text": [
         "While producing Cold Forty Three’s first record, the band was approached by television network FUSE, to be featured in a series called Rock Bottom. The show focused on former drummer Rene Haro's habitual marijuana use and the internal band conflicts that it caused. Meanwhile the band's lead guitarist, Alex Sayes, left the band permanently due to personal issues and an arrest. While filming for the reality television show, the band signed with Chamberlain Records and finished recording their debut record, From the Garage to Your Speakers. The band released the record on October 11, 2008, the same day Fuse aired Rock Bottom, featuring Cold Forty Three. After the episode was debuted, reviews were well received[clarification needed] by fans and critics alike.\n",
         "Through 2009, the remaining members of the band toured the US extensively in support of the new record.  Rene Haro's substance abuse continued, as well as his desire to leave the band because of a girl he met on-line, leaving him unable to perform during shows, which forced the band to ask him to leave in July 2009.  Ricky James Acosta was tapped by the band to re-join and they continued on with their tour.\n"
      ]
   },
   "Continued touring, new record and Warped Tour announcement (2009–2012)": {
      "text": [
         "Not wanting to lose the momentum gained from touring, the band decided to follow Blink-182's 2009 reunion tour, as well as, the 2010 Vans Warped Tour.[2] Both of these decisions gained the band veneration with both camps, with the latter allowing the band to play four dates on the Kevin Says stage as well as the Ernie Ball Stage.  The opportunity to play at the 2010 Vans Warped Tour, as well as the hard work that they put in behind the scenes prompted Kevin Lyman to invite the band back to play the 2011 Vans Warped Tour. The band also began writing music for their second full-length record while on the road. Recording began in October 2010 and it wrapped up in December 2010. Around that time, the band tapped long-time friend and fellow musician Matthew “Machete” Flores to act as their touring lead guitarist on their upcoming 2011 US tour. On March 9, 2011, Cold Forty Three was officially announced on the 2011 Vans Warped Tour website. CFT completed the 2011 Vans Warped tour and took a much needed break. In November 2011 they announced that Flores would no longer be touring with the band, and the said that they would be looking for a replacement guitarist. They were scheduled for the \"End Of The World\" headlining tour that will take them throughout the U.S. and a few dates in Canada, with 200 West from Los Angeles, and Last Chance Casanova, from Joplin Missouri. CFT was in the studio working on an EP they hoped would be released before the summer of 2012. CFT was officially announced to perform on the 2012 Vans Warped Tour for the entire summer on February 29, 2012. Also the band announced that Johnny Young of the band Hookah Stew would be joining them on tour in 2012. He rejoined Hookahstew after the summer.\n"
      ]
   },
   "Launch Party album (2012–2013)": {
      "text": [
         "The band stated that they would be releasing an album in December 2012, but their touring schedule did not allow them to achieve this. The band performed two new songs during the summer on the 2012 Vans Warped Tour, that most likely will be included on the Launch Party album. The songs were called \"never thought we'd make it\" and \"STYX\", with the latter being released on limited-edition download cards, that were included when fans purchased merchandise during the Warped Tour. The reception to \"STYX\" was a positive one, with the band displaying a much more \"hardcore\" edge, as Joshua Cruz screams his way through the bridge. \n\"I never knew how to scream, or even tried it. I just kinda....went for it...I suppose. I have a lot to work on, to get to the level of some real screamers, like Austin Carlile, or guys like that.\"[This quote needs a citation]\nThe band is currently[when?] unsigned as their deal with Chamberlain Records expired, with the band saying that \"we don't need a label to get our music out there. We have plenty of people listening and we have enough experience, that we can just start our own label and release things ourselves\" Moses was quoted as saying. \"But if the right deal comes up, then we'll definitely [sic] entertain the idea as long as it makes sense for all parties involved\".[This quote needs a citation] Currently[when?] the band is planning on using their time off on working on the album, and finding a producer who is the \"best fit\" for the band. Ricky James was quoted, \"if it takes all year, we'll work on the record all year. We don't want to just put something out, if we're not gonna be happy with it. So, expect us to kinda take our time with it.\"[This quote needs a citation]\nIn August 2013, filming for \"Hundred Dollar Bail\"  began and was expected to be released before the holidays. There were also rumors of CFT signing a new deal with another indie label.\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Cold Forty Three (Cold 40*3) is an American pop and punk band from Los Angeles, California. The band consists of vocalist and guitarist Moises Cruz, vocalist and bass guitarist Joshua Cruz, and drummer Ricky James Acosta. With original lead guitarist Alex Sayes, the band achieved moderate success[clarification needed] after releasing their debut album From the Garage to Your Speakers.\n",
      "Moises Cruz, Joshua Cruz and Ricky James Acosta grew up together on the same street and in 2006, after each of their previous bands split, they formed their own band.  Due to prior engagements, Ricky James Acosta was forced to leave the band in early 2007. Not wanting to leave the band without a drummer, he introduced to the band his friend, and fellow drummer, Rene Haro.  Rene Haro appeared during rehearsals and was hired soon after. The band also hired Alex Sayes to play lead guitar.\n",
      "The band recorded various demos and filmed a music video for their single \"Cheating B**ch\". The publicity eventually allowed the band to play many different Los Angeles venues, including The Whiskey A Go Go, The Roxy Theater, The El Rey Theatre, The Troubadour and other various bars and clubs on the Sunset Strip. In early 2008, the band began writing music for their first, full-length EP, which would eventually become From The Garage to Your Speakers.  During the writing process, Joshua Cruz contacted Tomas Costanza, producer, vocalist and guitarist for the band Diffuser, to discuss the possibility of working with the band on the record.  After reviewing the band's demos, Tomas Costanza agreed to produce the record.\n",
      "While producing Cold Forty Three’s first record, the band was approached by television network FUSE, to be featured in a series called Rock Bottom. The show focused on former drummer Rene Haro's habitual marijuana use and the internal band conflicts that it caused. Meanwhile the band's lead guitarist, Alex Sayes, left the band permanently due to personal issues and an arrest. While filming for the reality television show, the band signed with Chamberlain Records and finished recording their debut record, From the Garage to Your Speakers. The band released the record on October 11, 2008, the same day Fuse aired Rock Bottom, featuring Cold Forty Three. After the episode was debuted, reviews were well received[clarification needed] by fans and critics alike.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California"
      ],
      "Labels": [
         "ReverbNation[1]"
      ],
      "Website": [
         "www.coldfortythree.com"
      ]
   }
}