{
   "Name": "Cold War Kids",
   "rawData": [
      "Cold War Kids is an American indie rock band from Long Beach, California. Band members are Nathan Willett (vocals, piano, guitar), Matt Maust (bass guitar), David Quon (guitar, backing vocals), Matthew Schwartz (keyboards, backing vocals, guitar, percussion), and Joe Plummer (drums, percussion). Former members of the band include Dann Gallucci (guitar, keyboards, percussion), Matt Aveiro (drums, percussion), and Jonnie Russell (guitar, vocals, piano, keyboards, percussion).\n",
      "Forming in 2004 in Fullerton California, the Cold War Kids' early releases came from independent record label Monarchy Music. In 2006, the band signed with Downtown/V2 and released their major label debut Robbers & Cowards to cult appeal from fans and critics. 2008's Loyalty to Loyalty and 2011's Mine Is Yours saw the band develop different musical sounds and lyrical content throughout to mixed reviews. The band's seventh studio album, New Age Norms 1, was released on November 1, 2019.\n",
      "The members of Cold War Kids met at Biola University. They formed a band in 2004 when they would meet regularly in Jonnie Russell's apartment above a restaurant called Mulberry Street in downtown Fullerton. Maust came up with the band's name around 1997, during his travels in Eastern Europe with his brother, where they found a park in Budapest with missing statues, taken away after Communism fell. Seeing that there was a playground in the park, Maust said \"...being in that environment just made the phrase 'Cold War Kids' pop into my head. I may have heard it before. I'm a Cold War kid, too – I was born in 1979.\" Maust used the name for his personal website, but then he repurposed it after the band decided to use the name. The band relocated to Whittier, California, and began recording their first demo, which Monarchy Music released as the EP Mulberry Street (based on the restaurant where they regularly met) in spring 2005. Between tours, the band released two more EPs: With Our Wallets Full and Up in Rags, in 2006. Monarchy Music would re-release those EPs as one compilation album titled Up in Rags/With Our Wallets Full in 2006.\n"
   ],
   "infobox": {
      "Origin": [
         "Long Beach, California"
      ],
      "Genres": [
         "Indie rock",
         "blues rock",
         "blue-eyed soul"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Capitol[1]",
         "Downtown",
         "MapleMusic",
         "V2",
         "Monarchy"
      ],
      "Associated acts": [
         "Modest Mouse",
         "We Barbarians",
         "Florence and the Machine[2]"
      ],
      "Website": [
         "coldwarkids.com"
      ],
      "Members": [
         "Nathan Willett",
         "Matt Maust",
         "David Quon",
         "Matthew Schwartz",
         "Joe Plummer"
      ],
      "Past members": [
         "Dann Gallucci",
         "Matt Aveiro",
         "Jonnie Russell"
      ]
   },
   "albums": []
}