{
   "Name": "Crazy Town",
   "Sections": [
      "1 History",
      "1.1 Formation (1995–1999)",
      "1.2 The Gift of Game and \"Butterfly\" (1999–2001)",
      "1.3 Darkhorse (2001–2003)",
      "1.4 Hiatus (2003–2007)",
      "1.5 Reformation (2007–2011)",
      "1.6 The Brimstone Sluggers (2013–2017)",
      "1.7 Mazur's departure, lineup change and Crazy Town X (2017–present)",
      "2 Musical style",
      "3 Band members",
      "3.1 Current line-up",
      "3.2 Touring members",
      "3.3 Previous members",
      "3.4 Timeline",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Singles",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Crazy Town (sometimes abbreviated as CXT) is an American rap rock band, formed in Los Angeles, California in 1995 by Bret Mazur and Seth Binzer. Crazy Town is best known for their 2000 hit single, \"Butterfly\", which reached number one on the US Billboard Hot 100 chart and helped their debut album, The Gift of Game (1999) sell over 1.5 million units. Their follow-up album, Darkhorse (2002) failed to achieve the same level of success, contributing to the band's break-up in 2003. Mazur and Binzer reformed the band in 2007, and released their third album, The Brimstone Sluggers, in  2015. In 2017, Mazur left the band and Binzer changed the name of the band to Crazy Town X.\n"
      ]
   },
   "History": {
      "Formation (1995–1999)": {
         "text": [
            "Bret Mazur and Seth Binzer, who go by the names of Epic and Shifty Shellshock, respectively, started collaborating under the name of \"The Brimstone Sluggers\" in 1995 in Los Angeles, California, along with Adam Bravin (a.k.a. DJ Adam 12) who preceded DJ AM. However, they did not become serious about releasing any material until much later.[1] By early 1999, Rust Epique, James Bradley Jr (a.k.a. JBJ)., Doug Miller, Adam Goldstein (a.k.a. DJ AM), and Antonio Lorenzo \"Trouble\" Valli joined the band. Prior to joining the band, Bradley was the drummer for jazz trumpeter Chuck Mangione from 1977 to 1981, and had been a member of the alternative rock band Mary's Danish in the early 1990s.[2] Crazy Town's debut album, The Gift of Game, was released in November 1999, having been recorded earlier that year.\n"
         ]
      },
      "The Gift of Game and \"Butterfly\" (1999–2001)": {
         "text": [
            "The release of The Gift of Game was followed by a tour support slot for the Red Hot Chili Peppers. Guitarist Rust Epique left the band while the album was being mixed, and Crazy Town was joined by Kraig Tyler shortly after. The first two singles from The Gift of Game, \"Toxic\" and \"Darkside\", were released but failed to chart.[3]\n",
            "In 2000, Crazy Town was signed to tour with Ozzfest; however, they were forced to withdraw after only two weeks when Binzer was arrested after he threw a chair through a window while he was drunk.[1][4] Crazy Town then released their third single in 2001, \"Butterfly\" (which uses samples from Red Hot Chili Peppers' \"Pretty Little Ditty\"). It reached number 1 on the Billboard Hot 100 chart. Soundscan reports 100,000 album sales of The Gift of Game prior to the release of \"Butterfly\"; after \"Butterfly\" reached number 1, sales exceeded 1.5 million.[5]\n",
            "Crazy Town toured with Ozzfest in 2001.[6] They were received with mixed reviews; many people in the Ozzfest crowd mockingly called them \"The Butterfly Boys\".[7] A fourth single, \"Revolving Door\", was released with limited success. In 2001 Crazy Town also made a cameo appearance in the music video for \"Bad Boy for Life\" by P. Diddy, Black Rob and Mark Curry.\n"
         ]
      },
      "Darkhorse (2001–2003)": {
         "text": [
            "Their second album, Darkhorse, was produced by Howard Benson and released on November 12, 2002.[8] Benson's influence resulted in a more rock oriented sound. Prior to recording the album, drummer James Bradley Jr. eventually left the band and was replaced by Kyle Hollinger. The album achieved little commercial success, spawning only two singles: \"Drowning\", which became a minor hit in the US, UK, Austria and Germany, and \"Hurt You So Bad\", which failed to chart at all.  Shortly after the release of Darkhorse the band broke up in 2003, citing amongst other things, pressure from their record company for a \"Butterfly\" follow-up.[3]\n"
         ]
      },
      "Hiatus (2003–2007)": {
         "text": [
            "During Crazy Town's hiatus, Bret Mazur went on to form The Pharmacy, a record-producing company. Shortly after leaving Crazy Town, Rust Epique formed a band which would eventually go by the name pre)Thing. He died of a heart attack shortly before their debut album 22nd Century Lifestyle was released in 2004.[9] Binzer contributed vocals to Paul Oakenfold's 2002 single Starry Eyed Surprise. He released his first solo album in 2004, Happy Love Sick, under his alias Shifty Shellshock. Kraig Tyler joined Eric Powell's industrial band 16Volt.\n"
         ]
      },
      "Reformation (2007–2011)": {
         "text": [
            "In late 2007, Crazy Town announced that the remaining members had reformed and were working on a new studio album, tentatively titled Crazy Town is Back, which would be released sometime in 2008,[10] though no such release was ever made. On August 26, 2009, Crazy Town performed at Les Deux, in Hollywood, California, on stage together for the first time in five years.[11] On August 28, 2009, former member DJ AM was found dead in his apartment, of an accidental drug overdose.[12][13] On August 7, 2010, Crazy Town played together at the festival SRH FEST 2010 in California.[14] Throughout 2011, Crazy Town released a new song, \"My Place\", on YouTube, as well as two new songs, \"Hard to Get\" and \"Hit That Switch\", on their Myspace page.\n"
         ]
      },
      "The Brimstone Sluggers (2013–2017)": {
         "text": [
            "In 2013 Shifty and Epic said that Crazy Town were in the studio recording a new album, entitled The Brimstone Sluggers.[15][16] Later that year, Crazy Town created new official Facebook and Twitter pages,[17] and released the song \"Lemonface\" as a free download.[17] On 18 December 2014, Crazy Town released their first official single from the album, Megatron. The song was used as the theme song for Impact Wrestling during its run on Destination America in 2015.[18]\n",
            "The Brimstone Sluggers was released on 28 August 2015. DJ AM appears as a featured artist on the track \"Born to Raise Hell\", which was released as a single in August 2015.[19][20] In 2016, Lead Guitarist Elias Tannous[21] was added to the lineup and from August till October 2016, the band toured with the Make America Rock Again concert, alongside other artists who had success throughout the 2000s.[22] Throughout the tour, Epic would perform and was temporarily replaced by Bobby Reeves, an ex-vocalist of Adema.\n"
         ]
      },
      "Mazur's departure, lineup change and Crazy Town X (2017–present)": {
         "text": [
            "In January 2017, after a year of hiatus from the band, Epic announced through his Facebook post that he will no longer tour with the band.[23][24] Epic intends to still be involved with Crazy Town, though not as a band member. Following Mazur's departure, Rick Dixon, Nick Diiorio and Kevin Kapler also left the band in early April.  Shifty decided to add an \"X\" next to the band's name. When asked about the letter's significance on their Instagram account, the band stated \"the X is used by gangs to symbolize a territory that has just been won\".[25]\n",
            "On November 3, 2019, Crazy Town's van crashed into a moose during a tour stop in Ontario, Canada. Seth Binzer, Elias Tannous and Roland Banks were treated for bruises and cuts at the hospital.[26]\n"
         ]
      }
   },
   "Musical style": {
      "text": [
         "Crazy Town has been noted by journalists and the group itself for its hip hop sound.[27][28][29][30][31] Their music has also been labeled as rap rock,[27][32][33][34] rap metal,[32][33][35] nu metal,[36][37][38] and alternative rock.[39][40] As of 2014, Crazy Town does not consider itself to be a rock band, but rather a hip hop group.[27]\n"
      ]
   },
   "Band members": {
      "Current line-up": {},
      "Touring members": {},
      "Previous members": {},
      "Timeline": {}
   },
   "Discography": {
      "Studio albums": {},
      "Singles": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Crazy Town (sometimes abbreviated as CXT) is an American rap rock band, formed in Los Angeles, California in 1995 by Bret Mazur and Seth Binzer. Crazy Town is best known for their 2000 hit single, \"Butterfly\", which reached number one on the US Billboard Hot 100 chart and helped their debut album, The Gift of Game (1999) sell over 1.5 million units. Their follow-up album, Darkhorse (2002) failed to achieve the same level of success, contributing to the band's break-up in 2003. Mazur and Binzer reformed the band in 2007, and released their third album, The Brimstone Sluggers, in  2015. In 2017, Mazur left the band and Binzer changed the name of the band to Crazy Town X.\n",
      "Bret Mazur and Seth Binzer, who go by the names of Epic and Shifty Shellshock, respectively, started collaborating under the name of \"The Brimstone Sluggers\" in 1995 in Los Angeles, California, along with Adam Bravin (a.k.a. DJ Adam 12) who preceded DJ AM. However, they did not become serious about releasing any material until much later.[1] By early 1999, Rust Epique, James Bradley Jr (a.k.a. JBJ)., Doug Miller, Adam Goldstein (a.k.a. DJ AM), and Antonio Lorenzo \"Trouble\" Valli joined the band. Prior to joining the band, Bradley was the drummer for jazz trumpeter Chuck Mangione from 1977 to 1981, and had been a member of the alternative rock band Mary's Danish in the early 1990s.[2] Crazy Town's debut album, The Gift of Game, was released in November 1999, having been recorded earlier that year.\n",
      "The release of The Gift of Game was followed by a tour support slot for the Red Hot Chili Peppers. Guitarist Rust Epique left the band while the album was being mixed, and Crazy Town was joined by Kraig Tyler shortly after. The first two singles from The Gift of Game, \"Toxic\" and \"Darkside\", were released but failed to chart.[3]\n",
      "In 2000, Crazy Town was signed to tour with Ozzfest; however, they were forced to withdraw after only two weeks when Binzer was arrested after he threw a chair through a window while he was drunk.[1][4] Crazy Town then released their third single in 2001, \"Butterfly\" (which uses samples from Red Hot Chili Peppers' \"Pretty Little Ditty\"). It reached number 1 on the Billboard Hot 100 chart. Soundscan reports 100,000 album sales of The Gift of Game prior to the release of \"Butterfly\"; after \"Butterfly\" reached number 1, sales exceeded 1.5 million.[5]\n"
   ],
   "infobox": {
      "Also known as": [
         "Crazy Town X"
      ],
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Rap rock",
         "rap metal",
         "nu metal",
         "alternative rock",
         "hip hop"
      ],
      "Years active": [
         "1995–2003",
         "2007–present"
      ],
      "Labels": [
         "Columbia",
         "Membran"
      ],
      "Website": [
         "crazytownband.net"
      ],
      "Members": [
         "Seth Binzer",
         "Rick Dixon",
         "Elias Tannous aka ET",
         "Hasma Angeleno",
         "Roland Banks",
         "Filippo Dallinferno"
      ],
      "Past members": [
         "Bret Mazur",
         "Adam Bravin",
         "Charles Lopez",
         "Adam Goldstein",
         "Doug Miller",
         "Antonio Lorenzo Valli",
         "James Bradley Jr.",
         "Kraig Tyler",
         "Brandon Calabro",
         "Kyle Hollinger",
         "Ahmad Alkurabi"
      ]
   }
}