{
   "Name": "Crazy Town",
   "rawData": [
      "Crazy Town (sometimes abbreviated as CXT) is an American rap rock band, formed in Los Angeles, California in 1995 by Bret Mazur and Seth Binzer. Crazy Town is best known for their 2000 hit single, \"Butterfly\", which reached number one on the US Billboard Hot 100 chart and helped their debut album, The Gift of Game (1999) sell over 1.5 million units. Their follow-up album, Darkhorse (2002) failed to achieve the same level of success, contributing to the band's break-up in 2003. Mazur and Binzer reformed the band in 2007, and released their third album, The Brimstone Sluggers, in  2015. In 2017, Mazur left the band and Binzer changed the name of the band to Crazy Town X.\n",
      "Bret Mazur and Seth Binzer, who go by the names of Epic and Shifty Shellshock, respectively, started collaborating under the name of \"The Brimstone Sluggers\" in 1995 in Los Angeles, California, along with Adam Bravin (a.k.a. DJ Adam 12) who preceded DJ AM. However, they did not become serious about releasing any material until much later. By early 1999, Rust Epique, James Bradley Jr (a.k.a. JBJ)., Doug Miller, Adam Goldstein (a.k.a. DJ AM), and Antonio Lorenzo \"Trouble\" Valli joined the band. Prior to joining the band, Bradley was the drummer for jazz trumpeter Chuck Mangione from 1977 to 1981, and had been a member of the alternative rock band Mary's Danish in the early 1990s. Crazy Town's debut album, The Gift of Game, was released in November 1999, having been recorded earlier that year.\n",
      "The release of The Gift of Game was followed by a tour support slot for the Red Hot Chili Peppers. Guitarist Rust Epique left the band while the album was being mixed, and Crazy Town was joined by Kraig Tyler shortly after. The first two singles from The Gift of Game, \"Toxic\" and \"Darkside\", were released but failed to chart.\n"
   ],
   "infobox": {
      "Also known as": [
         "Crazy Town X"
      ],
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Rap rock",
         "rap metal",
         "nu metal",
         "alternative rock",
         "hip hop"
      ],
      "Years active": [
         "1995–2003",
         "2007–present"
      ],
      "Labels": [
         "Columbia",
         "Membran"
      ],
      "Website": [
         "crazytownband.net"
      ],
      "Members": [
         "Seth Binzer",
         "Rick Dixon",
         "Elias Tannous aka ET",
         "Hasma Angeleno",
         "Roland Banks",
         "Filippo Dallinferno"
      ],
      "Past members": [
         "Bret Mazur",
         "Adam Bravin",
         "Charles Lopez",
         "Adam Goldstein",
         "Doug Miller",
         "Antonio Lorenzo Valli",
         "James Bradley Jr.",
         "Kraig Tyler",
         "Brandon Calabro",
         "Kyle Hollinger",
         "Ahmad Alkurabi"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (sometimes abbreviated as CXT) is an [GENRE] band, formed in Los Angeles, California in [YEAR] by [PERSON_NAME_FULL_0_MALE] and Seth Binzer. [BAND_NAME] is best known for their [YEAR] hit single, \"Butterfly\", which reached number one on the US Billboard Hot 100 chart and helped their debut album, The Gift of Game ([YEAR]) sell over 1.5 million units. Their follow-up album, Darkhorse ([YEAR]) failed to achieve the same level of success, contributing to the band's break-up in [YEAR]. [PERSON_NAME_LAST_0] and Binzer reformed the band in [YEAR], and released their third album, The Brimstone Sluggers, in  [YEAR]. In [YEAR], [PERSON_NAME_LAST_0] left the band and Binzer changed the name of the band to [BAND_NAME] X.\n",
      "Bret Mazur and Seth Binzer, who go by the names of Epic and Shifty Shellshock, respectively, started collaborating under the name of \"The Brimstone Sluggers\" in [YEAR] in Los Angeles, California, along with Adam Bravin (a.k.a. DJ Adam 12) who preceded DJ AM. However, they did not become serious about releasing any material until much later. By early [YEAR], Rust Epique, James Bradley Jr (a.k.a. JBJ)., [PERSON_NAME_FULL_0_MALE], Adam Goldstein (a.k.a. DJ AM), and [PERSON_NAME_FULL_1_MALE] \"Trouble\" Valli joined the band. Prior to joining the band, Bradley was the drummer for jazz trumpeter Chuck Mangione from [YEAR] to [YEAR], and had been a [GENRE] band [MONTH]y's Danish in the early [YEAR]s. [BAND_NAME]'s debut album, The Gift of Game, was released in [MONTH] [YEAR], having been recorded earlier that year.\n",
      "The release of The Gift of Game was followed by a [GENRE] band while the album was being mixed, and [BAND_NAME] was joined by [PERSON_NAME_FULL_0_MALE] shortly after. The first two singles from The Gift of Game, \"Toxic\" and \"Darkside\", were released but failed to chart.\n"
   ]
}