{
   "Name": "Cryptic Slaughter",
   "rawData": [
      "Cryptic Slaughter was an American crossover thrash band based in Santa Monica, California, United States, and originally formed in 1984.\n",
      "Cryptic Slaughter was formed in 1984 by Les Evans (age 17), Scott Peterson (age 14) and Adam Scott (age 15), who met through their mutual participation in the American Youth Soccer League (AYSO). Soon they were joined by Bill Crooks (age 15), a friend of Adam Scott and a fellow soccer player. Adam Scott was let go a few months later due to conflicts regarding his parents and school.\n",
      "Their first demo, Life in Grave, was produced in 1985 and became well circulated in the burgeoning tape-trader underground. Their first full-length LP, Convicted, was released in 1986 on Death/Metal Blade records, whose artist roster also boasted D.R.I., Corrosion of Conformity, Dr. Know, The Mentors, and Beyond Possession. Within its first year of release, Convicted sold over 25,000 copies and earned Cryptic Slaughter the reputation as being one of the fastest bands in hardcore. Next came Money Talks in 1987, which is still considered by many to be the band's best effort. Mixing crushing grooves with lightning speed, Money Talks surpassed Convicted's success by selling 35,000 in its first year and by earning Cryptic Slaughter a fanatical following around the world. They took on the right-wing theocracy directly, with songs like \"Freedom of Expression\" that skewered the censorial nature of the Parents Music Resource Center (PMRC), founded by Al Gore's wife Tipper.  Their \"American Heroes\" directly confronted the mass media heroic mythology of the astronauts who died in the explosion of the space shuttle Challenger, when millions toil to survive daily in a world of injustice.  Along with DRI they were at the forefront of a musical genre known as much for its relentless energy as its radical anti-authoritarian politics, even if not all the listeners paid attention.\n"
   ],
   "infobox": {
      "Origin": [
         "Santa Monica, California, United States"
      ],
      "Genres": [
         "Thrash metal, crossover thrash, thrashcore, hardcore punk"
      ],
      "Years active": [
         "1984–1989 1990, 2002–2003"
      ],
      "Labels": [
         "Metal Blade, Relapse"
      ],
      "Members": [
         "Bill Crooks",
         "Bret Davis",
         "Les Evans",
         "Dave Hollingsworth",
         "Brian Lehfeldt",
         "Rob Nicholson",
         "Scott Peterson"
      ]
   }
}