{
   "Covers": {
      "text": [
         "Jenny Morris included a cover of the Cruzados song \"Rising Sun\" on her 1987 album, Body and Soul.\n"
      ]
   },
   "Disbandment": {
      "text": [
         "\nThe band recorded one more album for Arista records that was never released (no title). The Cruzados went through  many line up changes but the band finally fizzled out by 1990. About their breakup, Larriva said, ",
         "\"The Cruzados started at the tail end of the punk scene,  the way I see it, we were punk rockers at heart and in true punk rock fashion we said fuck you to the punk establishment because for us it was over. We changed our name from Plugz to the Cruzados and went in a totally different musical direction. I felt we were on to something but like most bands in the mid 80's, coke and too much fun cut the ride short\".[citation needed]",
         "After the band broke up, Larriva started his current band Tito & Tarantula, known for their appearance in the 1995 cult classic From Dusk Till Dawn, written by Quentin Tarantino and directed by Robert Rodriguez.[3]\n",
         "Steven Hufsteter formed his own band in 1985 called Shrine, which was the reason he left the Cruzados. \nHe recently[when?] started playing with Tito again in Tito & Tarantula.\n",
         "In 1991, Quintana became the drummer for Izzy Stradlin & the JuJu Hounds and was the drummer for Social Distortion from 2000 to 2009 and Mike Ness's solo touring band. Quintana died in 2018.  Marsico became bassist for Matthew Sweet in 1993 until present and recorded sessions with Bob Dylan, Neil Young, Roger Daltrey and Marianne Faithfull, among others. Rohner became a guitarist for the band T.S.O.L. but died in October 2005 of AIDS-related causes.\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "Formation and success": {
      "text": [
         "The Cruzados were formed in 1984 by the third incarnation of The Plugz, featuring members Tito Larriva, Steven Hufsteter, Chalo Quintana and Tony Marsico. They were picked as \"the next big thing\" by both their musical peers and music critics[who?], and they received praise from the likes of Bob Dylan, John Fogerty, David Byrne, Brian Setzer, and Billy Joel.[citation needed] The Cruzados would record three albums for Arista Records but only two would be released.[1]\n",
         "The band's self-titled album, Cruzados, was released in 1985.\n",
         "Following the release of Cruzados, Hufsteter left the band. He was replaced by Dino's Revenge guitarist Marshall Rohner,[2] who would record on the second album After Dark, released in 1987. The Cruzados also performed the song \"Don't Throw Stones\" at the beginning of the 1989 movie Road House.\n"
      ]
   },
   "Personnel": {
      "text": [
         "Jimmy Amason - lead guitar\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Formation and success",
      "2 Disbandment",
      "3 Covers",
      "4 Personnel",
      "5 Discography",
      "6 See also",
      "7 References",
      "8 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "The   Cruzados  were a 1980s rock band from Los Angeles, California.\n"
      ]
   },
   "Title": "Cruzados - Wikipedia"
}