{
   "Discography": {},
   "External links": {},
   "History": {
      "All Those Strangers, Enough Rope and Rolling with the Punches (2009–present)": {
         "text": [
            "In 2009, original Vain drummer Tom Rickard returned to the line-up, with the band toured the UK from November 24–December 1 the same year.[8][27] The following year, after acquiring the master recordings, Vain released All Those Strangers, that was originally to be released in 1991, through Davy's Jackie Rainbow Records.[4] Reviewing All Those Strangers for The Austin Chronicle, Raoul Hernandez compared the music to Mother Love Bone, stating that the album \"initially came on like a comedown from its fast, trashy birth mother.\" However, \"upon release [the album] now proves no slump.\"[28]\n",
            "In 2011, Vain toured Europe,[20] with a new line-up including Deathstars guitarists Cat Casino and Skinny Disco, before releasing their new album entitled Enough Rope on October 28, through Music Buy Mail, in the US and Europe, and Spiritual Beast/Universal in Japan.[10] The album featured drums by Rickard, Senor and Adler as well as unreleased material from their time as Road Crew.[5][20] An additional song from the Road Crew sessions was included on the Japanese release of the album.[20]\n",
            "In 2017, Vain released the album, Rolling with the Punches. The album featured several new tracks. The band toured the UK and Germany in the Summer/Fall of 2017.\n",
            "Nova, now a multi-patented inventor of guitar gear, appears live and records with the band on a limited basis after relocating to Nashville, TN in 2009 and having greater focus on personal life as well as business with guitar amplifier company, 3rd Power Amplification. She came out as transgender in 2017.[29]\n",
            "Vain's newest member is guitar player Joel Proto. A Bay Area native, Proto has been in local bands including GhostTown with singer, actor, comedian Dean Delray. Aside from Vain, he also contributes to several Bay Area bands, including Featherwitch, which also includes Vain drummer Tommy Rickard, AC/DZ, an AC/DC cover band which includes Zetro from Exodus on vocals and Riff Raff, another AC/DC cover band.\n"
         ]
      },
      "Formation and No Respect (1986–1990)": {
         "text": [
            "—Davy Vain on being signed by Island Records.\n",
            "Davy Vain had initially began his career as a record producer, producing Death Angel's debut album The Ultra-Violence,[1][2] before recording a demo with Metallica guitarist Kirk Hammett in 1986.[3][4] After recording, Vain decided to form a band, in the San Francisco Bay Area,[2] under his own moniker, adding bassist Ashley Mitchell, drummer Tom Rickard and guitarists Dylana Nova and Danny West to the lineup.[3] From 1986 to 1987, the band proceeded to play shows in San Francisco,[1] before playing regularly in Los Angeles,[5] where they also opened for Guns N' Roses prior to their success,[4] and were featured on the cover of Kerrang! magazine.[3] After showcasing to major record labels, including Geffen Records,[5] Vain signed with Island Records in 1988.[3][6]\n",
            "Recorded with producer Paul Northfield,[5][7] Vain released their debut album entitled No Respect in 1989.[3][8] The album peaked at number 154 on the Billboard 200.[9] Critically, the album was also well received,[1][8][10] with Vain featured on the covers of both Kerrang! and BAM.[10] Geoff Barton would later give a positive review for Classic Rock describing the album as \"a Maybelline-metalised debut par excellence – no 'perhaps' about it\" with the music being \"unharnessed, haystack-haired heaviness from beginning to end\" and that \"it's the Crüe at their most coarse and corrupted.\"[11] In support of the album, Vain toured the US while they also supported Skid Row on their tour of the UK.[1][3]\n"
         ]
      },
      "Reformation and subsequent releases (1993–2008)": {
         "text": [
            "Vain reformed in 1993 with new drummer Danny Fury, formerly of The Lords of the New Church, to record their third album (and second release) Move On It, which was released in Japan through Polystar Records.[1][3] The rise in popularity of Seattle's grunge movement meant the album did not achieve the same success as No Respect.[1] By the time Vain began recording their fourth album, Nova, West and Fury had departed the band, with Nova going on to audition for Ozzy Osbourne and join Big Blue Hearts, while West released a solo EP entitled Taste the Sounds.[3] With Davy Vain handling both vocal and guitar duties, as well as producing the album, and Mitchell on bass, Vain added drummer Louie Senor to the line-up to record Fade, which was released in 1995, through Polystar.[1][3]\n",
            "In 2000, Davy recorded and released his debut solo album entitled In From Out of Nowhere with Mitchell, Senor and guitarist Craig Behrhorst.[19] The same year, Nova returned to the band and contributed to the solo album.[1][19] The following year, Davy worked with Christina Aguilera as the assistant engineer and Pro Tools engineer on her album Stripped.[4][5][20]\n",
            "Vain re-released their debut album No Respect, through Gott Discs in 2005, with West rejoining the band.[1][19] In support of the re-release, Vain toured the UK, for the first time since 1989,[1] and Europe from May 21–June 3.[21] Kerrang! writer Steve Beebee reviewed their show at Rock City in Nottingham, stating that \"even though their set-list includes a mere four songs from that Holy Grail of debuts [No Respect],\" it was a gig that \"leave[s] you genuinely amazed, and more than anything, angry that a trend-fixed music industry could possibly have suppressed this awesome band for 15 years.\"[22]\n",
            "Vain then recorded a new album entitled On the Line in Davy's recording studio, The Groove Room, which was released on August 23 of the same year through Perris Records.[23][24] Reviewing the album for Blogcritics, Chris Akin stated that \"Vain seem to have stepped back into the time machine and created an album that falls somewhere between No Respect and Fade\" and that \"one of the best unknown bands of the era comes back with a cool reunion album here.\"[25] Vain toured again in 2006 while in 2008, they performed at Rocklahoma and the four-day Rock the Bayou festival from August 29–September 1.[19][20][26]\n"
         ]
      },
      "Released by Island and Road Crew (1990–1991)": {
         "text": [
            "The band began recording their second album, titled All Those Strangers, with producer Jeff Hendrickson.[7] The release of the album was advertised in Japan while a number of pre-release cassettes were released.[1] However, when Island Records were bought by PolyGram,[12] Vain were dropped by the label in 1991, with All Those Strangers remaining unreleased.[3] The same year, West and Rickard departed the band.[3]\n",
            "Vain soon added guitarist Shawn Rorie and former Guns N' Roses drummer Steven Adler to the line-up.[3] Vain then renamed themselves Road Crew,[1][13][14][15] the name of one of Adler's previous bands that featured both Slash and Duff McKagan.[16][17][18] They recorded a new album and gained record label attention.[13] However, Adler's drug problems at the time led to the band disbanding.[13][15]\n"
         ]
      }
   },
   "Personnel": {
      "text": [
         "\n",
         "\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and No Respect (1986–1990)",
      "1.2 Released by Island and Road Crew (1990–1991)",
      "1.3 Reformation and subsequent releases (1993–2008)",
      "1.4 All Those Strangers, Enough Rope and Rolling with the Punches (2009–present)",
      "2 Personnel",
      "3 Discography",
      "4 External links",
      "5 References"
   ],
   "Summary": {
      "text": [
         "Vain is an American glam metal band from San Francisco Bay Area, California, formed in 1986. As of 2018, the lineup consists of Davy Vain (lead vocals), Joel Proto (guitar), Ashley Mitchell (bass) and Tommy Rickard (drums).\n",
         "After recording a demo, Davy Vain founded Vain in 1986, adding Dylana Nova (formerly Jamie Scott before coming out as transgender), Danny West, Ashley Mitchell and drummer Tom Rickard to the lineup. They signed with Island Records in 1988, before releasing their debut album the following year, titled No Respect, which peaked at number 154 on the Billboard 200.\n",
         "Though they recorded a second album, Vain were released by Island in 1991, with West and Rickard departing the same year. Following the addition of both Shawn Rorie and former Guns N' Roses drummer Steven Adler, Vain renamed themselves Road Crew. However, they also disbanded in 1991. The band reformed in 1993 and went through a number of lineup changes for the release of their next two studio albums. By 2005, Scott and West had returned to the band, while Rickard would rejoin them in 2009 (before departing again the following year).\n",
         "To date, Vain have released seven studio albums; No Respect (1989); All Those Strangers (1991); Move On It (1993); Fade (1995); On The Line (2005); Enough Rope (2011), and Rolling With The Punches (2017).\n"
      ]
   },
   "Title": "Vain (band) - Wikipedia"
}