{
   "Name": "Vain (band)",
   "rawData": [
      "Vain is an American glam metal band from San Francisco Bay Area, California, formed in 1986. As of 2018, the lineup consists of Davy Vain (lead vocals), Joel Proto (guitar), Ashley Mitchell (bass) and Tommy Rickard (drums).\n",
      "After recording a demo, Davy Vain founded Vain in 1986, adding Dylana Nova (formerly Jamie Scott before coming out as transgender), Danny West, Ashley Mitchell and drummer Tom Rickard to the lineup. They signed with Island Records in 1988, before releasing their debut album the following year, titled No Respect, which peaked at number 154 on the Billboard 200.\n",
      "Though they recorded a second album, Vain were released by Island in 1991, with West and Rickard departing the same year. Following the addition of both Shawn Rorie and former Guns N' Roses drummer Steven Adler, Vain renamed themselves Road Crew. However, they also disbanded in 1991. The band reformed in 1993 and went through a number of lineup changes for the release of their next two studio albums. By 2005, Scott and West had returned to the band, while Rickard would rejoin them in 2009 (before departing again the following year).\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco Bay Area, California, U.S."
      ],
      "Genres": [
         "Glam metal"
      ],
      "Years active": [
         "1986 (1986)–1991, 1993–present"
      ],
      "Labels": [
         "Island, Polystar, Gott Discs, Perris, Jackie Rainbow, Music Buy Mail, Spiritual Beast, Universal"
      ],
      "Associated acts": [
         "Road Crew"
      ],
      "Website": [
         "davyvain.com"
      ],
      "Members": [
         "Davy Vain",
         "Ashley Mitchell",
         "Joel Proto",
         "Tom Rickard"
      ],
      "Past members": [
         "Danny West",
         "Louie Senor",
         "Shawn Rorie",
         "Steven Adler",
         "Danny Fury",
         "Dylana Nova"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from San Francisco Bay Area, California, formed in [YEAR]. As of [YEAR], the lineup consists of Davy [BAND_NAME] (lead vocals), Joel Proto (guitar), [PERSON_NAME_FULL_1_FEMALE] (bass) and [PERSON_NAME_FULL_0_MALE] (drums).\n",
      "After recording a demo, Davy [BAND_NAME] founded [BAND_NAME] in [YEAR], adding Dylana [MONTH]a (formerly Jamie Scott before coming out as transgender), [PERSON_NAME_FULL_1_MALE], Ashley Mitchell and drummer [PERSON_NAME_FULL_0_MALE] to the lineup. They signed with Island Records in [YEAR], before releasing their debut album the following year, titled No Respect, which peaked at number 154 on the Billboard 200.\n",
      "Though they recorded a second album, [BAND_NAME] were released by Island in [YEAR], with West and Rickard departing the same year. Following the addition of both Shawn Rorie and former Guns N' Roses drummer [PERSON_NAME_FULL_0_MALE], [BAND_NAME] renamed themselves Road Crew. However, they also disbanded in [YEAR]. The band reformed in [YEAR] and went through a number of lineup changes for the release of their next two studio albums. By [YEAR], Scott and West had returned to the band, while Rickard would rejoin them in [YEAR] (before departing again the following year).\n"
   ]
}