{
   "Name": "A Cursive Memory",
   "rawData": [
      "A Cursive Memory was an American rock band, from Southern California who released an EP and two albums in the period 2006 to 2012.\n",
      "The band originally formed under the name 'Sincerely Me' in 2003 after band members met at a birthday party. They started off playing covers of some of their favorite bands, such as blink-182 and Jimmy Eat World, but eventually grew to write their own original songs and adopted the name A Cursive Memory.\n",
      "Over the course of the next few years, the band built up a small local fan base and self-released their first EP, A Cursive Memory. It featured the original version of The Piano Song. In 2005 the band self-released the Lights, Camera, Action EP. Although they did not tour outside of their local scene, as all of the members were still in high school, they were signed by Bunim/Murray Productions. The song Club Revolution Remix was featured on an episode of The Real World.\n"
   ],
   "infobox": {
      "Origin": [
         "Rancho Palos Verdes, California, U.S."
      ],
      "Genres": [
         "Alternative rock",
         "indie rock, emo pop"
      ],
      "Years active": [
         "2006–2012"
      ],
      "Labels": [
         "Vagrant"
      ],
      "Past members": [
         "Mark Borst-Smith",
         "Dillan Wheeler",
         "Brian Bolen"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band, from Southern California who released an EP and two albums in the period [YEAR] to [YEAR].\n",
      "The band originally formed under the name 'Sincerely Me' in [YEAR] after band members met at a [GENRE] bands, such as blink-182 and Jimmy Eat World, but eventually grew to write their own original songs and adopted the name [BAND_NAME].\n",
      "Over the course of the next few years, the band built up a small local fan base and self-released their first EP, [BAND_NAME]. It featured the original version of The Piano Song. In [YEAR] the band self-released the Lights, Camera, Action EP. Although they did not tour outside of their local scene, as all of the members were still in high school, they were signed by Bunim/Murray Productions. The song Club Revolution Remix was featured on an episode of The Real World.\n"
   ]
}