{
   "Band members": {
      "Current": {},
      "Former": {},
      "Timeline": {}
   },
   "Biography": {
      "First break up (1992–1999)": {
         "text": [
            "Rinehart's departure from the band, as well as aborted attempts to work on a fifth album, resulted in Dark Angel's first break up in September 1992.[8][9] Hoglan has indicated that this was an amicable split, telling Heavy magazine in 2019 that, \"We've always been close and tight. We never went our separate ways out of animosity by any means. It was just time to make a move back in '92 when we kind of dissolved Dark Angel, I guess.\"[10]\n",
            "Hoglan went on to collaborate on a number of musical projects. He achieved greater attention during the mid-1990s playing with Death, at the same time that bandleader Chuck Schuldiner was taking that group into a more progressive style. Subsequently, he recorded one album with the thrash metal band Testament, and made the acquaintance of Canadian multi-instrumentalist Devin Townsend, forging a lasting friendship. He has since recorded several albums with Townsend, both as part of the speed/industrial/death metal band Strapping Young Lad and under Devin Townsend's name.\n",
            "Rinehart formed the band Oil in 1997 after converting to Christianity.[11]\n"
         ]
      },
      "First reunion and second hiatus (1999–2005)": {
         "text": [
            "Tentative plans for a Dark Angel reunion tour in 1999 were scrapped, due to personal and artistic differences between its members.[9] However, the band officially reformed in 2002 with a new lineup featuring Ron Rinehart on vocals, Eric Meyer on guitar, Danyael Williams on bass and Gene Hoglan on drums.[12]\n",
            "During the reunion, Dark Angel performed the Metallica song \"Creeping Death\" which appeared on the 2004 Metallica tribute album Metallic Attack: Metallica - The Ultimate Tribute.\n",
            "By 2005, Rinehart had begun suffering health problems, and an accident that year, which caused a severe spinal injury that was apparently so serious that if Rinehart had continued singing it could have resulted in him being unable to talk, thus ending Dark Angel's reunion.[citation needed]\n"
         ]
      },
      "Initial career (1981–1991)": {
         "text": [
            "Dark Angel formed in 1981 under the name Shellshock in Downey, California, right around the time when the Bay Area thrash movement was beginning to take place. They were forced to change their name to Dark Angel in 1983 due to another band using the name. They played in local bars and clubs, acquiring a cult following in the metal underground. The band began recording and releasing several demos before releasing their debut studio album We Have Arrived in March 1985. Dark Angel promoted We Have Arrived with its first ever tour, opening for bands like Slayer, Megadeth, Venom, Savage Grace, Corrosion of Conformity, Possessed, D.R.I., Exodus and Agent Steel.[5]\n",
            "In November 1986, Dark Angel released their second studio album, Darkness Descends, which is widely considered to be their seminal release. Around the same, several other thrash metal bands such as Metallica also released seminal albums and started to gain more popularity. Although Darkness Descends did not initially reach the Billboard 200 charts or become a commercial success, Dark Angel spent most of 1986 and 1987 touring heavily behind the album, with bands like Motörhead, Megadeth, Possessed, Slayer, Overkill, Sacred Reich, Whiplash, Cryptic Slaughter and The Crumbsuckers.[5] After the Darkness Descends tour ended in August 1987,[5] vocalist Don Doty left Dark Angel in order to start a family and was replaced by Ron Rinehart, who would stay with the band until their breakup in 1992 and rejoin for their subsequent reunions. Dark Angel performed their first show with Rinehart at the Fender's Ballroom in Long Beach, California on January 29, 1988.[5]\n",
            "At this time, Megadeth frontman Dave Mustaine asked Eric Meyer to join Megadeth, but he declined in order to stay with Dark Angel. According to an interview in Voices from the Dark Side, Eric Meyer claims he did not feel comfortable with the situation.[6]\n",
            "In January 1989, Dark Angel released their third studio album Leave Scars, which was their first release with Rinehart on vocals and Mike Gonzalez on bass, and their last with guitarist Jim Durkin, who left the band before the tour and was replaced by former Viking guitarist Brett Eriksen, leaving the band with no remaining original members. Leave Scars received positive reviews from music critics, and was Dark Angel's only album to reach the Billboard 200 charts, where it peaked at number 159.[7] The band toured through much of 1989 and 1990 with several bands, including Death, Nuclear Assault, Acid Reign, Candlemass and Overkill.[5] A live album, recorded at the Country Club in Reseda on April 22, 1989, was released in 1990 as Live Scars.\n",
            "Dark Angel released their fourth and final full-length studio album, Time Does Not Heal, in February 1991. Time Does Not Heal showed increasingly progressive song structures (famously advertising its \"246 riffs\")[citation needed] and Hoglan's lyrics dealing with psychological issues and trauma. To promote Time Does Not Heal, Dark Angel embarked on the \"Years of Pain\" world tour, supported by such bands as Exhorder, Mordred and Re-Animator.[5]\n"
         ]
      },
      "Second reunion and upcoming fifth studio album (2013–present)": {
         "text": [
            "On August 10, 2013, it was reported that Dark Angel had reunited with original vocalist Don Doty, and would headline Keep It True XVII festival in Germany in April 2014. It was also reported that drummer Gene Hoglan, guitarists Eric Meyer and Justin Zych, and bassist Mike Gonzalez would be involved in the reunion.[13]\n",
            "On August 16, 2013, six days after the \"reunion\" was announced, Doty and Hoglan released statements addressing the \"reunion rumors\" in an attempt to \"put any confusion to rest.\" Hoglan admitted that he and the members of Dark Angel had been \"talking about doing something\" in 2014, and stated that some shows could be in the works, but \"right now it's just speculation.\" Hoglan also stated that, due to his commitments with Testament and Dethklok, the band is \"moving forward s-l-o-w-l-y.\" Doty also commented on the reunion rumors, stating, \"When talks are complete, a statement will be given. We will know more in the months to come. We will let you know as it unravels.\"[14] Asked on August 21, 2013 about the reunion, Hoglan replied, \"The latest is that we are talking about doing one. We will definitely keep everybody posted when there is something solid to talk about.\"[15]\n",
            "On September 4, 2013, Dark Angel's management confirmed that the band would be reuniting for \"limited number of appearances in the U.S. and select festivals in Europe\" in 2014, and added that the dates were \"still pending\" and had \"not yet been booked at this time.\" Their management also confirmed that the lineup for the \"rare and unique, select 2014 shows\" was Gene Hoglan (drums), Jim Durkin (guitar), Ron Rinehart (vocals) and Michael Gonzalez (bass).[16] On the following day, it was announced that Dark Angel had been dropped from the Keep It True XVII festival due to multiple issues with the reunion.[17]\n",
            "On October 13, 2013, Dark Angel confirmed that they were officially active again, and posted a 17-second rehearsal clip, titled \"DFA is back!\", on YouTube.[2]\n",
            "On November 1, 2014, it was announced that Dark Angel was working on new material.[18]\n",
            "On April 5, 2016, it was announced that Dark Angel would celebrate their 30th anniversary by playing a show on October 8 at the Vogue Theatre in Vancouver, British Columbia, Canada. At that show, they were supposed to play the Darkness Descends album in its entirety as well as songs from their 1991 album Time Does Not Heal.[19] The concert was cancelled \"due to circumstances beyond [the band's] control.\"[20]\n",
            "By November 2017, the band was still in the process of writing their forthcoming new album, according to Gene Hoglan.[21] When asked in October 2018 by The Aquarian Weekly about the status of the album, Rinehart stated, \"You know, I honestly feel this, if all of us could get in the same place for a certain amount of time. It would be something that is easy to do. That being said it's hard to get the world's greatest drummer who travels with everybody, Gonz in New Mexico, and me here in Washington. We have a lot of great ideas and awesome riffs. Every time I hear a new riff I just get super excited. I would rather wait and have something be amazing, than rush and have something be crap.\"[22]\n",
            "In a February 2019 interview with Agoraphobic News, Hoglan stated that Dark Angel has \"5 or 6 songs on the go\" and that their new album would be released \"by the end of this year or by 2020.\"[23] The album's release date was later pushed back to 2021.[3] During his appearance on Death Angel guitarist Ted Aguilar's Alive & Streaming internet show in August 2020, Hoglan revealed that the band was still \"attempting to write\" their new album.[24]\n"
         ]
      }
   },
   "Discography": {
      "Compilation albums": {},
      "Demos": {},
      "Live albums": {},
      "Other appearances": {},
      "Singles": {},
      "Studio albums": {},
      "Videos": {}
   },
   "External links": {},
   "References": {},
   "Sections": [
      "1 Biography",
      "1.1 Initial career (1981–1991)",
      "1.2 First break up (1992–1999)",
      "1.3 First reunion and second hiatus (1999–2005)",
      "1.4 Second reunion and upcoming fifth studio album (2013–present)",
      "2 Band members",
      "2.1 Current",
      "2.2 Former",
      "2.3 Timeline",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Live albums",
      "3.3 Compilation albums",
      "3.4 Demos",
      "3.5 Singles",
      "3.6 Videos",
      "3.7 Other appearances",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Dark Angel is an American thrash metal band from Downey, California, that formed in 1981. Their over-the-top style (extremely fast, heavy and lengthy songs with many tempo changes, lyrics, and extended instrumental parts) earned them the nickname \"the L.A. Caffeine Machine\". Although Dark Angel had never achieved a mainstream breakthrough in their initial career, they are often credited as one of the leaders of the second wave of the 1980s thrash metal movement.[1] Dark Angel released four full-length studio albums before splitting up in 1992. After a short-lived reunion from 2002 to 2005, the band reunited once again in 2013,[2] and plans to release their first studio album in three decades in 2021.[3][4] Dark Angel is also notable for featuring drummer Gene Hoglan, who has been a member of the band since 1984, and since their initial breakup in 1992, he has played in numerous bands such as Death, Testament, Strapping Young Lad, Fear Factory and Dethklok.\n"
      ]
   },
   "Title": "Dark Angel (band) - Wikipedia"
}