{
   "Name": "Dark Angel (band)",
   "rawData": [
      "Dark Angel is an American thrash metal band from Downey, California, that formed in 1981. Their over-the-top style (extremely fast, heavy and lengthy songs with many tempo changes, lyrics, and extended instrumental parts) earned them the nickname \"the L.A. Caffeine Machine\". Although Dark Angel had never achieved a mainstream breakthrough in their initial career, they are often credited as one of the leaders of the second wave of the 1980s thrash metal movement. Dark Angel released four full-length studio albums before splitting up in 1992. After a short-lived reunion from 2002 to 2005, the band reunited once again in 2013, and plans to release their first studio album in three decades in 2021. Dark Angel is also notable for featuring drummer Gene Hoglan, who has been a member of the band since 1984, and since their initial breakup in 1992, he has played in numerous bands such as Death, Testament, Strapping Young Lad, Fear Factory and Dethklok.\n",
      "Dark Angel formed in 1981 under the name Shellshock in Downey, California, right around the time when the Bay Area thrash movement was beginning to take place. They were forced to change their name to Dark Angel in 1983 due to another band using the name. They played in local bars and clubs, acquiring a cult following in the metal underground. The band began recording and releasing several demos before releasing their debut studio album We Have Arrived in March 1985. Dark Angel promoted We Have Arrived with its first ever tour, opening for bands like Slayer, Megadeth, Venom, Savage Grace, Corrosion of Conformity, Possessed, D.R.I., Exodus and Agent Steel.\n",
      "In November 1986, Dark Angel released their second studio album, Darkness Descends, which is widely considered to be their seminal release. Around the same, several other thrash metal bands such as Metallica also released seminal albums and started to gain more popularity. Although Darkness Descends did not initially reach the Billboard 200 charts or become a commercial success, Dark Angel spent most of 1986 and 1987 touring heavily behind the album, with bands like Motörhead, Megadeth, Possessed, Slayer, Overkill, Sacred Reich, Whiplash, Cryptic Slaughter and The Crumbsuckers. After the Darkness Descends tour ended in August 1987, vocalist Don Doty left Dark Angel in order to start a family and was replaced by Ron Rinehart, who would stay with the band until their breakup in 1992 and rejoin for their subsequent reunions. Dark Angel performed their first show with Rinehart at the Fender's Ballroom in Long Beach, California on January 29, 1988.\n"
   ],
   "infobox": {
      "Also known as": [
         "Shellshock (1981–1983)"
      ],
      "Origin": [
         "Downey, California, U.S."
      ],
      "Genres": [
         "Thrash metal"
      ],
      "Years active": [
         "1981–1992",
         "2002–2005",
         "2013–present"
      ],
      "Labels": [
         "Combat",
         "Relativity",
         "Nuclear Blast"
      ],
      "Associated acts": [
         "Death",
         "Strapping Young Lad",
         "Oil",
         "Tenet",
         "Testament",
         "Devin Townsend",
         "Viking"
      ],
      "Members": [
         "Jim Durkin",
         "Eric Meyer",
         "Gene Hoglan",
         "Mike Gonzalez",
         "Ron Rinehart"
      ]
   },
   "albums": [
      "We Have Arrived",
      "Darkness Descends",
      "Leave Scars",
      "Time Does Not Heal"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Downey, California, that formed in [YEAR]. Their over-the-top style (extremely fast, heavy and lengthy songs with many tempo changes, lyrics, and extended instrumental parts) earned them the nickname [SONG_NAME]. Although [BAND_NAME] had never achieved a mainstream breakthrough in their initial career, they are often credited as one of the leaders of the second wave of the [YEAR]s thrash metal movement. [BAND_NAME] released four full-length studio albums before splitting up in [YEAR]. After a short-lived reunion from [YEAR] to [YEAR], the band reunited once again in [YEAR], and plans to release their first studio album in three decades in [YEAR]. [BAND_NAME] is also notable for featuring drummer Gene Hoglan, who has been a member of the band since [YEAR], and since their initial breakup in [YEAR], he has played in numerous bands such as Death, Testament, Strapping Young Lad, Fear Factory and Dethklok.\n",
      "[BAND_NAME] formed in [YEAR] under the name Shellshock in Downey, California, right around the time when the Bay Area thrash movement was beginning to take place. They were forced to change their name to [BAND_NAME] in [YEAR] due to another band using the name. They played in local bars and clubs, acquiring a [GENRE] band began recording and releasing several demos before releasing their debut studio album We Have Arrived in [MONTH] [YEAR]. [BAND_NAME] promoted We Have Arrived with its first ever tour, opening for bands like Slayer, Megadeth, Venom, Savage Grace, Corrosion of Conformity, Possessed, D.R.I., Exodus and Agent Steel.\n",
      "In [MONTH] [YEAR], [BAND_NAME] released their second studio album, Darkness Descends, which is widely considered to be their seminal release. Around the same, several other thrash metal bands such as Metallica also released seminal albums and started to gain more popularity. Although Darkness Descends did not initially reach the Billboard 200 charts or become a commercial success, [BAND_NAME] spent most of [YEAR] and [YEAR] touring heavily behind the album, with bands like Motörhead, Megadeth, Possessed, Slayer, Overkill, Sacred Reich, Whiplash, Cryptic Slaughter and The Crumbsuckers. After the Darkness Descends tour ended in [MONTH] [YEAR], vocalist [PERSON_NAME_FULL_0_MALE] left [BAND_NAME] in order to start a family and was replaced by Ron Rinehart, who would stay with the band until their breakup in [YEAR] and rejoin for their subsequent reunions. [BAND_NAME] performed their first show with Rinehart at the Fender's Ballroom in Long Beach, California on [MONTH] 29, [YEAR].\n"
   ]
}