{
   "Name": "Dead Meadow",
   "rawData": [
      "Dead Meadow is an American psychedelic rock band, formed in Washington, D.C. in 1998 and currently composed of vocalist and guitarist Jason Simon, bassist Steve Kille, and drummer Mark Laughlin. The band have released seven studio albums, two live albums, and a Peel Session.\n",
      "Dead Meadow formed in 1998 from the remnants of two local DC bands, The Impossible Five and Colour. The band started as Jason Simon on vocals and guitar, Steve Kille on bass, and Mark Laughlin on drums. They combined 70's heavy metal and 60's psychedelic rock with themes from authors such as J. R. R. Tolkien and H. P. Lovecraft. The first album, Dead Meadow, was released in 2000 on Tolotta Records, a label run by Fugazi bassist Joe Lally. The vinyl LP version was released by Planaria Records. This was followed by 2001's Howls from the Hills, also released on Tolotta Records.\n",
      "Having heard the band's first album, John Peel asked the band to record a Peel Session. Unable to afford to tour internationally, the band recorded their session in Fugazi's home studio using an 8-track recorder previously owned by Minor Threat, the first time a Peel Session was recorded outside the BBC studios. Primarily featuring energetic versions of songs from their first two albums, Dead Meadow's session was officially released in 2011 as Peel Sessions, and includes two additional tracks recorded during the same period.\n"
   ],
   "infobox": {
      "Origin": [
         "Washington, D.C., United States"
      ],
      "Genres": [
         "Stoner rock, psychedelic rock"
      ],
      "Years active": [
         "1998–present"
      ],
      "Labels": [
         "Matador, Tolotta, Xemu Records"
      ],
      "Associated acts": [
         "Poseidotica"
      ],
      "Website": [
         "www.deadmeadow.com"
      ],
      "Members": [
         "Jason Simon",
         "Steve Kille",
         "Mark Laughlin"
      ],
      "Past members": [
         "Juan Londono",
         "Stephen McCarty",
         "Cory Shane"
      ]
   }
}