{
   "Name": "Dia de los Muertos (band)",
   "rawData": [
      "Dia de los Muertos is an American metal band, formed in Los Angeles, California, United States, in 2005.\n",
      "The band was founded by Andres Jaramillo and Alfonso Pinzón of Agony, and Vincent Price of Body Count, as a side project. Since they could not find an official singer for the band, they asked a few musicians to write lyrics and record vocals over their music.\n",
      "Their first release Day Of The Dead EP was recorded at Dungeon Studios in Los Angeles, mixed by Roy Z and released on Cinismo records in 2005, featuring vocals by Tony Campos (Static X, Asesino, Ministry, Prong - also known as Maldito X), Andres Gimenez (A.N.I.M.A.L.), Loana dP Valencia (Dreams Of Damnation), Alex Oquendo (Masacre), Alfonso Pinzón and Vincent Price. Dia De Los Muertos performed at the world's largest 'free of charge' rock festival Rock Al Parque in 2006 with Fear Factory and Death By Stereo.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California"
      ],
      "Genres": [
         "Death Metal, Heavy metal, thrash metal, hard rock, speed metal"
      ],
      "Years active": [
         "2005–present"
      ],
      "Labels": [
         "Cinismo Records"
      ],
      "Associated acts": [
         "Agony, Carcass, Brujeria, Asesino, Sepultura, A.N.I.M.A.L., Criminal, Masacre"
      ],
      "Members": [
         "Rosa Arias",
         "Alfonso Pinzón",
         "Andres Jaramillo",
         "Alejandro Corredor"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band, formed in Los Angeles, California, United States, in [YEAR].\n",
      "The band was founded by [PERSON_NAME_FULL_0_MALE] and [PERSON_NAME_FULL_1_MALE] of Agony, and Vincent Price of Body Count, as a [GENRE] an official singer for the band, they asked a few musicians to write lyrics and record vocals over their music.\n",
      "Their first release Day Of The Dead EP was recorded at Dungeon Studios in Los Angeles, mixed by Roy Z and released on Cinismo records in [YEAR], featuring vocals by [PERSON_NAME_FULL_0_MALE] (Static X, Asesino, Ministry, Prong - also known as Maldito X), [PERSON_NAME_FULL_1_MALE] (A.N.I.M.A.L.), Loana dP Valencia (Dreams Of Damnation), [PERSON_NAME_FULL_3_MALE] (Masacre), [PERSON_NAME_FULL_2_MALE] and Vincent Price. Dia De Los Muertos performed at the world's largest 'free of charge' rock festival [PERSON_NAME_FULL_4_MALE] in [YEAR] with Fear Factory and Death By Stereo.\n"
   ]
}