{
   "Name": "The Dickies",
   "rawData": [
      "The Dickies are an American punk rock band formed in the San Fernando Valley, Los Angeles, in 1977. One of the longest tenured punk rock bands, they have been in continuous existence for over 40 years. They have consistently balanced catchy melodies, harmony vocals, and pop song structures, with a speedy punk guitar attack. This musical approach is paired with a humorous style and has been labelled \"pop-punk\" or \"bubble-gum punk\". The band have sometimes been referred to as \"the clown princes of punk\".\n",
      "Eventual Dickies vocalist Leonard Graves Phillips was a self-described celibate, \"introverted character\" in the period following high school. He played keyboards in his bedroom and, together with friend Bob Davis (later Chuck Wagon), created a type of music that Phillips describes as \"autism rock\", similar to Devo, though not as good. Another friend of Phillips was Steve Hufsteter, a former junior high school and high school class mate. The latter figure was the guitarist and main songwriter for local power pop band the Quick, and was giving guitar lessons to Stan Lee (born Stan Sobol).  Although Hufsteter thought highly of Phillips' keyboard playing, it was his opinion that Phillips becoming vocalist for the band Lee was starting would be good for his friend's social well being. Phillips intentionally sabotaged his first audition, but realizing his mistake, aggressively entreated Lee for another chance. That audition was successful, \"and the rest is history\" according to Stan Lee. Singing for the Dickies had its intended effect for Phillips, causing him to break out of his shell, and improving his confidence with women.\n",
      "As a teenager, Stan Lee was a drug buddy of Iggy Pop, once accepting the well known \"leopard\" jacket that the latter wore in the Stooges as payment for heroin. Surprisingly, it was not hanging out with Iggy Pop that pushed Lee into joining the nascent punk scene, but rather it was the experience of going with eventual Dickies bassist Billy Club (Bill Remar) to see The Damned on their first American tour that proved most influential. Exposure to the music of the Ramones and the Weirdos was seminal as well. Prior to deciding on a punk rock direction, Lee had begun to learn guitar, at the urging of friend Kevin DuBrow, with the ambition of becoming a Ritchie Blackmore-like virtuoso. His teacher, Huffsteter, suggested that playing punk was a more practical idea, and by way of convincing, provided Lee with his initial introduction to the music of the Ramones. Lee and Club rounded out their initial punk band lineup with Phillips, multi-instrumentalist Chuck Wagon, and drummer Karlos Kaballero (Carlos Caballero), who came up with the name \"Dickies\" (Lee preferred \"the Imbeciles\"), and the band made their live debut at the Whisky a Go Go in September 1977. The Dickies were among the first punk rock bands to emerge from Los Angeles. They were the first California punk band to appear on network television (C.P.O. Sharkey), and the first California punk band to be signed to a major record label (A&M Records).\n"
   ],
   "infobox": {
      "Origin": [
         "San Fernando Valley, California"
      ],
      "Genres": [
         "Punk Rock, Pop Punk, Comedy Punk"
      ],
      "Years active": [
         "1977–present"
      ],
      "Labels": [
         "A&M,  Captain Oi,  Triple X, Enigma Records, Fat Wreck Chords,  Cleopatra Records, Restless Brand, ROIR"
      ],
      "Website": [
         "thedickies.com"
      ],
      "Members": [
         "Leonard Graves Phillips",
         "Stan Lee",
         "Ben David Seelig",
         "Adam Gomez",
         "Eddie Tatar"
      ],
      "Past members": [
         "Chuck Wagon",
         "Billy Club",
         "Karlos Kaballero",
         "Jerry Angel",
         "Lorenzo Buhne",
         "Steve Hufsteter",
         "Anthony Tiny Biuso",
         "Scott Sindon",
         "Enoch Hain",
         "Cliff Martinez",
         "Glen Laughlin",
         "Jonathan Melvoin",
         "Marc Vachon",
         "Mark Aber-Rooney",
         "Dylan Thomas",
         "Rick Dasher",
         "Greg Hanna",
         "Travis Johnson",
         "Kris Kwiatkowski",
         "Little Dave Teague",
         "Steven Fryette"
      ]
   }
}