{
   "Name": "The Dickies",
   "Sections": [
      "1 History",
      "1.1 Formation and early years (1977–1979)",
      "1.2 Post A&M (1980–1989)",
      "1.3 During the pop punk revival (1990–1999)",
      "1.4 The Dickies at the Turn of the Century (2000–2009)",
      "1.5 Present day (2010–present)",
      "2 Musical style and themes",
      "3 Influence",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 EPs",
      "4.3 Live albums",
      "4.4 Compilation albums",
      "4.5 Singles",
      "5 Videos",
      "5.1 Music videos",
      "5.2 Commercial Releases",
      "6 See also",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "The Dickies are an American punk rock band formed in the San Fernando Valley, Los Angeles, in 1977. One of the longest tenured punk rock bands, they have been in continuous existence for over 40 years. They have consistently balanced catchy melodies, harmony vocals,[1][2] and pop song structures, with a speedy punk guitar attack. This musical approach is paired with a humorous style and has been labelled \"pop-punk\" or \"bubble-gum punk\".[3][4] The band have sometimes been referred to as \"the clown princes of punk\".[5][6][7][8][9]\n"
      ]
   },
   "History": {
      "Formation and early years (1977–1979)": {
         "text": [
            "Eventual Dickies vocalist Leonard Graves Phillips was a self-described celibate, \"introverted character\" in the period following high school. He played keyboards in his bedroom and, together with friend Bob Davis (later Chuck Wagon), created a type of music that Phillips describes as \"autism rock\", similar to Devo, though not as good. Another friend of Phillips was Steve Hufsteter, a former junior high school and high school class mate. The latter figure was the guitarist and main songwriter for local power pop band the Quick, and was giving guitar lessons to Stan Lee (born Stan Sobol).  Although Hufsteter thought highly of Phillips' keyboard playing, it was his opinion that Phillips becoming vocalist for the band Lee was starting would be good for his friend's social well being. Phillips intentionally sabotaged his first audition, but realizing his mistake, aggressively entreated Lee for another chance. That audition was successful, \"and the rest is history\" according to Stan Lee. Singing for the Dickies had its intended effect for Phillips, causing him to break out of his shell, and improving his confidence with women.[10][11]\n",
            "As a teenager, Stan Lee was a drug buddy of Iggy Pop, once accepting the well known \"leopard\" jacket that the latter wore in the Stooges as payment for heroin.[12] Surprisingly, it was not hanging out with Iggy Pop that pushed Lee into joining the nascent punk scene, but rather it was the experience of going with eventual Dickies bassist Billy Club (Bill Remar) to see The Damned on their first American tour that proved most influential. Exposure to the music of the Ramones and the Weirdos was seminal as well. Prior to deciding on a punk rock direction, Lee had begun to learn guitar, at the urging of friend Kevin DuBrow,[13] with the ambition of becoming a Ritchie Blackmore-like virtuoso. His teacher, Huffsteter, suggested that playing punk was a more practical idea, and by way of convincing, provided Lee with his initial introduction to the music of the Ramones. Lee and Club rounded out their initial punk band lineup with Phillips, multi-instrumentalist Chuck Wagon, and drummer Karlos Kaballero (Carlos Caballero), who came up with the name \"Dickies\" (Lee preferred \"the Imbeciles\"),[14] and the band made their live debut at the Whisky a Go Go in September 1977. The Dickies were among the first punk rock bands to emerge from Los Angeles. They were the first California punk band to appear on network television (C.P.O. Sharkey),[15] and the first California punk band to be signed to a major record label (A&M Records).[11][16][17]\n",
            "The book Going Underground: American Punk Rock 1979–1989 describes the Dickies in the context of the early L.A. punk scene. Its author contends that the Dickies were \"the best musicians on the scene and made good use of their talents\". Also described is an early gig at the Masque in 1977. An opening band was so incompetent that \"some punks turned a fire hose on them\". The Dickies came out next, looking like \"normal suburban nerds\". The band \"erupted in a tight, jackhammer, speed-of-light assault\" of \"ferocious... goofball comedy punk\" which inspired manic punk rock dancing (\"bodies carooming off each other\"). The author claims that the Dickies' subsequent record contract caused jealousy among other bands, some of whom would say that the Dickies were only in it for money. This belief is contrasted with the Dickies actual stated primary goal of being written about in Slash (fanzine).[18]\n",
            "The band's A&M record deal came about after that label sacked the Sex Pistols, one of several labels to do so in what manager Malcolm McLaren would later describe as \"the Great Rock 'n' Roll Swindle\", wherein that band would behave poorly, and be booted off a label while keeping the signing money.[19][10] The label wanted a replacement punk band that was more manageable (or at least less notorious),[14]  and sent a representative to see the Dickies on the set of C.P.O. Sharky. This was followed up by a showcase at the Whisky, and some assertive bluster by Stan Lee, which, along with the enthusiastic efforts of true-believing manager John Hewlett[20] (who also managed Sparks), led to the Dickies landing the record deal. The two albums that the band recorded for the label, The Incredible Shrinking Dickies (1979) and Dawn of the Dickies (1979) are influential, well regarded early punk records,[21][22] and were modestly successful commercially (the former peaked at #18 on the UK album charts[23]).\n",
            "The Dickies had a string of successful singles in the UK, twice making the top 40. They had a Top 10 single with their speedy punk cover of the theme song to a children's show with \"Banana Splits (Tra La La Song)\" in 1979, and reached the top 40 again with their cover of \"Nights in White Satin\" (1979). Their punk rendition of \"Silent Night\" charted at #47 in December 1978, while their cover of \"Paranoid\" peaked at #45, in 1979. The band, which has claimed to have sold \"a million singles\" in England,[2] credits their popularity in that country to being perceived as a \"teeny pop\" punk band that appealed to the younger siblings of punk rockers.[10]\n",
            "Their career off to a fast start, the Dickies would tour Europe 5 times between 1978 and 1980, pausing to play Top of the Pops on May 3, 1979.[24][25]\n"
         ]
      },
      "Post A&M (1980–1989)": {
         "text": [
            "Guitarist/keyboardist/saxophonist/drummer Chuck Wagon (born Bob Davis) released a solo recording, more synth pop than punk rock, entitled \"Rock 'N' Roll Won't Go Away\" (A&M, 1979).[26][27] Wagon, who was known for his energetic and entertaining antics at Dickies shows (such as running in a circle around his keyboard, or wearing an afro wig while playing saxophone),[28] has been said to have become troubled over time,[29][27] and dissatisfied with punk rock and the Dickies. He left the band at one point, planning to pursue his solo career, but reunited with the Dickies for a number of concerts.[20] He committed suicide, shooting himself at his parents' home after a Dickies show, and passed away in a hospital the next day, on June 28, 1981.[28] The LA Times has called this event \"the most sobering moment in Dickies history.\"[10]\n",
            "Wagon's death, and drug issues among surviving members, slowed down the Dickies initial momentum considerably starting the 1980s, with John Hewlett being fired as manager and the A&M contract expiring during this period.[20]  However, Phillips and Lee have kept the band playing and recording, at times sporadically, at other times more actively, until the present day, achieving venerable, \"pop punk godfather\" status along the way.[30]\n",
            "During lulls between activity, the band would occasionally play locally around L.A. to earn a paycheck. But steadier work would come, supported by concerts on both US coasts (and occasionally in between), the UK, and elsewhere. In addition to work on several motion pictures, the band would, over time, record albums for labels like PVC Records (Stukas Over Disneyland), Restless Brand Records (Killer Klowns from Outer Space), Enigma Records (Second Coming), Triple X Records (Idjit Savant and Dogs from the Hare that Bit Us) and Fat Wreck Chords (All This and Puppet Stew).\n",
            "After having had their first two albums released within a 9-month span, there was a nearly four-year gap before the release of Stukas Over Disneyland (1983). The influential punk zine Maximum Rocknroll published an enthusiastic review of this album, with writer Steve Spinali asserting that \"The Dickies' first vinyl in almost four years ranks up there near their previous funnypunk triumphs. Most of the eight songs here veer toward amphetamine pop, with irresistible layered choruses to boot.... buoyant and entertaining as hell!\"[31]\n",
            "On March 5, 1985, the Dickies were one of a number of California punk bands to play a very unexpected benefit show; other bands on the bill included the Circle Jerks, the Vandals, and D.I. The show's beneficiaries were the Cypress College Republicans. Stan Lee and Keith Morris from the Jerks both stated that they were doing it out of fondness for the other bands on the bill, and because it was a paying gig (despite being a benefit). Both denied having political motivations for doing the show, and in fact wished for their respective bands to not be associated with politics. As to the show's organizers, one stated that there was a motivation to show their fellow college Republicans that punk was nothing to be afraid of, and to encourage them to have fun, since after all “(the college is in) Orange County, a predominantly conservative area, and a lot of punks come from conservative families.... (and) a lot of them think Orange County is good.\"[32]\n",
            "Live footage of the Dickies in concert was aired on MTV in 1985, as they were co-featured along with G.B.H. in a concert special entitled Punks and Poseurs: A Journey Through the Los Angeles Underground, which also featured interviews with fans, as well as figures like Pleasant Gehman and Iris Berry.[33]\n",
            "In 1986, cassette-only label ROIR released a Dickies live compilation entitled We Aren't the World. It contains performances from 7 different Dickies concerts, ranging in vintage from 1977 to 1985, and from  regions ranging from NY (C.B.G.B.) and NJ, to California, to the U.K.[34]\n",
            "Among the bands that the Dickies shared bills with between 1985 and 1987 are Red Hot Chili Peppers, Janes Addiction, Faith No More, Guns N' Roses, Ramones, X, T.S.O.L., Thelonious Monster, Dead Milkmen, and Murphy's Law.[35][36][37][38][39][40][41]\n",
            "In 1988, the Dickies wrote and performed the theme song for the cult classic [42] horror film Killer Klowns from Outer Space, which also became the title track for a Dickies ep released that year. It was produced by Ron Hitchcock, and was the debut of drummer Cliff Martinez who had recently played with the Red Hot Chili Peppers, The Weirdos, and Captain Beefheart. Martinez played with them from 1988 to 1994, and on albums such as Second Coming, Locked N' Loaded Live in London, and Idjit Savant.[10]\n",
            "Also in 1988, The Dickies appeared in the comedic motion picture 18 Again!, starring George Burns.[43] In the movie, Burns' 81 year old character switches consciousnesses/souls with his 18-year-old grandson. In one scene, the octogenarian-turned-teenager accompanies a teenaged girl to a punk club, where the Dickies perform \"You drive me ape (you big gorilla)\". The whole song is performed, at times in the foreground, at times in the background. Closeups of Phillips wearing an ape mask (as is his penchant during live performances of the song), and Tarzan-like rope swinging by the singer, are featured.[44]\n",
            "A gap of 5 years between studio albums number 3 and 4 having elapsed (notwithstanding the Killer Klowns EP), a writer at the Los Angeles Times was led to connect the title of their 1989 long player, Second Coming, to the band's \"comeback status\". The writer noted that this album had some Beatles-like melodicism and some \"art-rock aspirations\", while retaining the Dickies' characteristic punk \"silliness\". The writer also noted that the Dickies would be undertaking a national tour supporting the release.[10]\n",
            "The close of the decade saw the third Dickies-involved motion picture. In the opening minutes of the 1989 skateboard drama Gleaming the Cube, starring Christian Slater, Slater's character Brian is seen flying in a small airplane over Disneyland, along with 4 friends and the pilot, when the 5 skaters sing a line from the chorus of \"Stukas over Disneyland\". The song, which the characters would later listen to in a bedroom, is also featured on the soundtrack.[45]\n"
         ]
      },
      "During the pop punk revival (1990–1999)": {
         "text": [
            "The Dickies toured Europe in 1990 for the first time in a decade. Upon their arrival on the continent, meeting fans provided evidence to band members of their enduring popularity despite their ten year absence.[24] They have returned regularly since then, including participation in multi-band punk rock festivals.\n",
            "In 1990, the Dickies wrote another theme song for a motion picture. This time it was for Lucas Reiner's time travel comedy film Spirit of 76, which stars David Cassidy, Leif Garrett, Devo, and Red Kross.[46][47]\n",
            "1991 saw the release of another live Dickies album, this one entitled Live In London - Locked 'N' Loaded, put out by German label Rebel Rec. It was recorded at the Dome in London on October 11, 1990.[48]\n",
            "On June 4, 1993 the Dickies headlined a one day festival called the Milwaukee Mega Jam. Other acts on the bill included Green Day (a half year before the release of their breakthrough Dookie album), Agent Orange, and the Didjits.[49][50]\n",
            "In addition to whatever personal issues the Dickies had to cope with in the middle part of their career, there was also the commercial challenge of the decline of the original punk scene, replaced by post punk, college rock, underground hardcore punk, and, eventually, alternative rock, none of which provided the Dickies with a suitable milieu. Therefore, the profile of the band was uplifted with the rise of California pop punk in the 1990s, with successful bands like the Offspring and Green Day citing the Dickies as an influence. Leonard Phillips noted in a 1994 interview that \"We are being recognized in a mainstream way again.\"[51]\n",
            "One outgrowth of the revived attention given the Dickies, and attempts by interviewers to connect them to the current scene, was a minor feud with Green Day. This resulted from a misunderstood joke from the Dickies camp, often repeated (it was a stock answer to a frequent question), saying the multi-platinum selling Green Day should support their forbears by \"passing the hat\" at a stadium gig to fund a punk rock retirement home. One shortened version of this idea had Stan Lee saying \"they should just write us a check\", which was interpreted as Green Day ripping the Dickies off. This led to salty quotes from the former band directed at the Dickies in an issue of Guitar World, which Leonard Phillips describes as being \"WWF\" style: the Dickies are \"the most bitter old bastards\", who are \"just another Ramones rip-off\".[52] Apparently it blew over, as Green Day bassist Mike Dirnt would attend Dickies shows after this, and was friendly in his interactions with them.[53]\n",
            "By the time of Idjit Savant (1994), the Dickies had released their third consecutive album which followed a prolonged recording hiatus, at least with respect to studio LPs. About this state of affairs, Leonard Phillips told the Chicago Tribune \"every few years, it's me and Stan against the world with three new faces behind us.\"[24] Axl Rosenberg of MetalSucks wrote of Idjit Savant that it is \"one of the best pop-punk albums of all time\", superior to American Idiot. He also noted that it was recorded during a time of dour grunge and angry nu metal music, and called the Dickies album possibly \"the feel good album of the 90’s\".[54] The Dickies toured with Gwar in the fall of '94 supporting this release.[51]\n",
            "The holiday compilation Punk Rock Xmas (1995) by Rhino Entertainment includes the Dickies version of \"Silent Night\". Other artists on the collection include Ramones, The Damned, Fear, and Stiff Little Fingers.[55] A compilation that the Dickies were \"conspicuously\"[56] absent from, however, was Saturday Morning: Cartoons' Greatest Hits (1996). This compilation featured alternative and punk bands covering songs from cartoons. Entertainment Weekly labeled the Dickies \"the kings of the genre\", and noted they had already covered three of the album's songs; a fourth, \"Spider-Man\", the theme song for a comic character which is a frequent visual motif of Stan Lee's guitars and stage apparel,[57][58] went to a band the Dickies shared many concert bills with- the Ramones.[59]\n",
            "Jonathan Melvoin, who played drums on Idjit Savant, died of a heroin overdose on July 12, 1996 in New York, aged 34, while on tour playing keyboards for the Smashing Pumpkins.[60][61]\n",
            "A reviewer for a November 1998 Dickies concert in Hartford, Connecticut suggested that most attendees were old school punks wearing \"vintage leather jackets\" and \"buttons that could be artifacts at the Rock and Roll Hall of Fame\". The writer quotes Leonard Phillips as sarcastically indicating his willingness to court a younger crowd by rebranding the Dickies as an \"alternative\" punk rock band.[62]\n",
            "The Dickies closed out the decade by recording an all-covers album, Dogs From the Hare That Bit Us. Jack Rabid, noting that the Dickies had a long history of recording covers, some of which are \"terrific\", gave this release a very favorable review, writing that although the latest batch were more reverent and less humorous than some previous efforts, it was \"still frickin' great and a lot of fun.\"[63]\n"
         ]
      },
      "The Dickies at the Turn of the Century (2000–2009)": {
         "text": [
            "Stan Lee negotiated the band's Fat Wreck Chords deal by fibbing to label owner Fat Mike, a Dickies fan who had, in 1996, obtained a 4 song demo the Dickies had recorded. Neither Lee nor Leonard Phillips had heard of the label head/NOFX front man, but were filled in by a member of the Dickies camp. Lee claimed that he had \"an album's worth of material\" ready to record, when in fact the band actually only had the 4 songs. Following this claim, a deal was agreed upon, but the L.P. was delayed by the amount of time it took to come up with and record an appropriate amount of material.[64] The resulting record found a prominent fan in Milo Aukerman. The scientist/Descendents front man has stated that All This and Puppet Stew (2001) gave him encouragement to continue playing into advancing middle age. \"I was just extremely impressed with how they put out a great record [at that age]. It definitely set the kernel in my mind that you could be in your late 40s and still put out a record that full-on brought the punk rock from start to finish.\"[65]\n",
            "Spectrum Records released the 18 song compilation The Dickies – The Punk Singles Collection in 2002.[66]\n",
            "In the Summer of 2003 the Dickies were part of a package tour of classic punk bands. Called \"Fiend Fest\", it was headlined by the Misfits, and, besides the Dickies, also featured The Damned, Agnostic Front, D.I., Marky Ramone, Dez from Black Flag, and Japanese band Balzac.[67][68]\n",
            "The Dickies played the 2004 Ramones 30th Anniversary tribute concert in Los Angeles, which was filmed. The Dickies are also in the 2006 documentary Too Tough to Die: A Tribute to Johnny Ramone, along with X, Red Hot Chili Peppers, Joan Jett, Rob Zombie, and others. The film features footage from the 2004 concert, which was held in particular to honor the then seriously-ill Ramones guitarist. The Dickies perform \"You Drive Me Ape (You Big Gorilla)\" and the Ramones song \"Today Your Love (Tomorrow the World)\", and in interview footage, they talk about their shared history with the New York band.[69][70] Another video release from this period is entitled The Dickies: An Evening With the Dickies (2005, Secret Films).[71]\n",
            "The Dickies played the 2007 Warped Tour, a North American punk rock festival, for the first time in what would be four consecutive years, and five years total.\n",
            "Leonard Phillips provided guest vocals on the Vibrators' cover of \"vibrator\" by Motörhead, on the former band's Pure Punk album (2009).[72]\n",
            "The decade closed on two sour notes, as a pair of former Dickies passed away in the year 2009. Enoch Hain (born Robert Frederick Orin Lansing, Jr.), Dickies guitarist for a period stretching from the late 1980s into the mid 1990s,[73] died on July 25, 2009 from complications arising from pneumonia.[74] And original drummer Karlos Kabellero (born Carlos Cabellero), who gave the band its name and was one of its songwriters during his tenure, died on September 22, 2009 from heart-related problems.[75]\n"
         ]
      },
      "Present day (2010–present)": {
         "text": [
            "In 2010, The Dickies hit cover of \"Banana Splits\" provides the soundtrack to a hyper-violent action scene in the superhero movie Kick Ass.[76]\n",
            "The new decade found the Dickies on the road. Reviewing an August 2011 headlining concert in Bristol, England, a writer remarked on their enduring appeal in that country. The mix of young and older attendees was noted, and it was stated that the event had a \"timeless\" feel.[77] Back in the U.S. for the 2012 Riot Fest in Chicago, the Dickies played the \"after party\", along with NOFX, Adicts, and the Casualties.[78]\n",
            "The Dickies live dates in 2013 included Rob Zombie's Great American Nightmare fest in Los Angeles,[79] and supporting the Damned in Birmingham, England. Regarding the latter, an impressed reviewer suggested that the Dickies were \"the perfect support act for the Damned\", and praised the band for \"having the balls\" to play their \"crunching take\" on Black Sabbath's \"paranoid\" in that band's hometown.[80] Other tour dates that year included concerts in the US northeast.[81] The band continued to tour consistently through 2014 and 2015, including dates throughout North America, one of which was the 2015 Gwar B-Q,[6] and also shows in Australia.[82][13]\n",
            "Secret Records released Banana Splits (2016), which is the title of both a DVD and a CD documenting a 2002 Dickies concert in England, featuring a guest performance from Michael \"Olga\" Algar of Toy Dolls.[83] With respect to live performances from the calendar year 2016, the Dickies toured the US and Europe,[84] and were part of the 2016 Rebellion Festival in the U.K. Unfortunately, Phillips became ill with gallstones during a ferry trip from Holland, leading to a hospital visit and endangering the scheduled performances. With the singer's encouragement, the band performed the dates without him, in a \"Dickies karaoke\" format. Vocal duties were handled by fans, members of the band's entourage, and by guest punk notables, including members of The Rezillos, the Vibrators, Leftover Crack, the Exploited, GBH, the Dwarves, Extreme Noise Terror, Girlschool, Big D and the Kids Table, and others.[85][86]\n",
            "2017 was the band's 40th anniversary, which they celebrated by touring, including 16 dates in England and Ireland,[87] and that year's iteration of the Punk Rock Bowling festival in Las Vegas, which, among many other notable punk artists, was headlined by old band associate Iggy Pop.[88] Stan Lee, in an interview promoting the tour, explained that their somewhat erratic touring schedule, historically, was in part due to his reluctance to be separated from his pet dogs for long stretches of time.[89]\n",
            "Another leg of the band's 40th anniversary tour included a run of dates on the 2017 Warped Tour. An incident occurred on July 25, their final day with Warped, which caused the band to become the center of a controversy, to the extent that an LA Weekly writer characterized it as \"tearing apart the hardcore music community right now\".[90] While performing, Phillips was targeted by a sign-holding friend of feminist band War on Women, who protested his \"sexist\", humorous, politically incorrect stage banter. Phillips responded with angry, profane insults, and this was captured via cellphone video and posted online. As a result, some in the punk scene denounced the Dickies,[91]  while others, including Noodles of the Offspring, Buzz Osborne, Ben Weasel, and Jesse Hughes of Eagles of Death Metal, voiced their support for the band.[90][92][93][94]\n",
            "In May 2018, the Dickies, along with the Hollywood Chamber Orchestra, played the theme to Killer Klowns From Outer Space live at the sold-out Montalbán Theatre, during the 30th-anniversary screening of that film.[95] Other activity in 2018 included Oakland's \"Burger Boogaloo\" festival alongside Devo, the Damned, the Dwarves, host John Waters, and many others,[96] and two runs of tour dates supported by the Queers.[97]\n",
            "The Dickies released a single in 2019, their first studio recording in over a decade. A cover of  Cheap Trick's \"I Dig Go Go Girls\", it features a contribution from Monkey from the Adicts. The B-side is called \"the Dreaded Pigasaurus\", which is a reference to a creature that functions as garbage disposal in The Flintstones.[98][99]\n",
            "Recent live dates include Punk Rock Bowling in May 2019,[100] and T.S.O.L.'s 40th anniversary show in January 2020.[101] Continuing to share billing with peers, The Dickies were scheduled to be among the headliners (along with Cockney Rejects, UK Subs, Anti Nowhere League, and others) in a one day Scottish punk festival in April 2020,[102] and were also to play a number of concerts in the U.S. in June 2020 with Total Chaos, T.S.O.L., and headliners Black Flag.[103]\n",
            "In an interview with Goldmine, Leonard Phillips stated that the band will record a \"final\" album.[104] In the same interview, another purported project on the way is discussed- an autobiographical book of humorous short stories by Phillips.[104]\n"
         ]
      }
   },
   "Musical style and themes": {
      "text": [
         "Some artists eschew the term \"pop punk\", perhaps viewing it as implying less authenticity than the label \"punk rock\" (for example, Green Day's Billie Joe Armstrong: \"I’ve always hated the phrase. I think it’s a contradiction in terms. Either you’re punk, or you’re not”[105]). Leonard Phillips, however, has said he \"has no problem\" with the label being applied to the Dickies, rhetorically asking \"can I help it if we are musical?\"[106] Stan Lee once said of the early period of the Dickies: \"We were a pop band masquerading as a punk band.\"[107]\n",
         "During the band's formative period, they viewed the already existing punk bands as being divided into two camps: serious political bands (such as the Sex Pistols and the Clash), and fun, entertaining bands (like the Damned and the Ramones). The Dickies made a deliberate choice to belong to the latter camp, albeit with a distinctive southern California vibe.[10] Elaborating on their distinction from the angrier, angstier bands, some of whom had gritty upbringings, Stan Lee points out that at the Dawn of the Dickies' career, he was living with his parents in the valley with a swimming pool, preoccupied with waterslides and tv shows, finding not much to complain about.[89] Steven Hufsteter, an influential figure in the Dickies' formation and a sometimes \"extra member\" of the band,[108] opines that \"the Dickies never really thought of themselves as punks\" at the outset, but instead saw the form \"as an opportunity\", particularly the \"silly\" variant of punk evident in Ramones music.[11]\n",
         "Many of the Dickies lyrics concern Southern California culture, rife with references and in-jokes; examples include songs like \"Waterslide\", \"I'm A Chollo\", \"Manny, Moe, and Jack\", Stukas Over Disneyland, and \"(I'm Stuck in a Pagoda with) Tricia Toyota\".  Another theme is classic cartoons/children's TV, with songs like \"Banana Splits (tra la la song)\", \"Gigantor\", \"Eep Opp Ork (Uh Uh)\" (from the Jetsons), \"Bowling with Bedrock Barney\", and most recently, another Flintstones reference with \"The Dreaded Pigasaurus\". Leonard Phillips has said that these choices add up to a social commentary. He saw some of his peers in LA punk coming from privileged backgrounds, but projecting UK working class-style angst. \"We wanted to show all those bourgeois ‘punks’ what it really MEANT to come from the valley.\"[109]\n",
         "The Dickies are also known for recording many fast-paced punk covers of classic rock songs, including The Moody Blues' \"Nights in White Satin,\" The Quick's \"Pretty Please Me\", Black Sabbath's \"Paranoid,\" The Monkees' \"She,\" Barry McGuire's \"Eve of Destruction,\" The Isley Brothers' \"Nobody but Me,\" The Left Banke's \"Pretty Ballerina,\" The Cowsills' \"Hair\", \"Sound of Silence\" by Simon & Garfunkel, Led Zeppelin's \"Communication Breakdown\", The Germs/Pat Smear's \"golden boys\", as well as the cover album Dogs from the Hare That Bit Us. When asked about this penchant of the band, Stan Lee responded \"It was easier as you didn't have to write the songs.\"[53] Regarding the band's choice of material, Lee has said that they cover \"mostly songs we liked when we were 13.\"[6] Describing the tone of some of the early covers of 1960's music, Lee characterizes it as \"affectionate piss-takes of hippies and the old culture.\"[110]\n",
         "Leonard Phillips has said that he feels the Dickies many covers are different in character from those by latter-day punk cover band Me First and the Gimme Gimmes (who have paid homage to the Dickies by playing a snippet of \"You Drive Me Ape\" in their cover of the Beatles' \"All My Loving\"). Phillips feels that band employs a formula, whereas the Dickies reinterpret songs that are meaningful to them.[106]\n",
         "Something else that the Dickies are known for is Phillips' routines when playing live, including wearing an ape mask or scuba gear, and using props ranging from a dog puppet, to a talking penis puppet (\"Stewart\"), to an inflatable female \"love doll\", each for use during particular songs.[111][7][112][113][114][77] Regarding this \"bag of tricks\", Stan Lee has said “It’s all nonsense to me. I play guitar.”[6] Steven Hufsteter claims this aspect of the Dickies' live shows is an influence of his band the Quick, who Phillips was once involved with.[115]\n",
         "In the book Punk Rock: So What? The Cultural Legacy of Punk, edited by Roger Sabin, a writer states that the Dickies follow in a tonal/thematic tradition started by immediate predecessors the Dictators and the Ramones, but it is \"in the Dickies (that) punk's simultaneous parody and celebration of commercial teen culture reached its apex\". The author believes that 90's punk like Green Day, the Offspring, and Pennywise are indebted to the older punk trio for this reason.[116]\n"
      ]
   },
   "Influence": {
      "text": [
         "In a feature about the Bad Brains in Timeline, it was written that the Dickies and the Dead Boys were among the Brains' punk influences, which they combined with jazz and funk influences.[117] Metal Storm's biography of the Bad Brains also lists the Dickies, along with Dead Boys, Black Sabbath, and the Sex Pistols as being among the band's influences.[118] Jack Rabid, writing for AllMusic wrote, perhaps hyperbolically, that the Dickies' cover of \"paranoid\" by Sabbath \"basically inspired the Bad Brains to form!\"[63]\n",
         "Brett Gurewitz of Bad Religion and Epitaph Records has stated that members of his band \"grew up with\" the Dickies, and considers the band \"one of the greatest punk bands\", as good as the Buzzcocks. He praises the Dickies songs more than their humor.[24]\n",
         "Green Day and the Offspring have cited Dickies influence.[51] While the former band would later give mixed messages about their feelings about the Dickies, Noodles, guitarist for the Offspring, said that the Dickies are \"one of my favorites\", in a Rolling Stone interview.[24]\n",
         "Ben Weasel of Screeching Weasel included the Dickies in a short list of punk bands that \"were sort of pioneers, both musically and in what they did to lay the groundwork for bands like mine.\"[119]\n",
         "Joe \"Queer\" King has stated that his band is in a tradition of punk bands, like the Dickies, Dead Kennedys, Black Flag, X, Circle Jerks, Angry Samoans, and Flipper, that \"were funny, but... had a message\", and feels that this spirit is lost on modern, politically sensitive audiences, who are \"just looking for a reason to say they’re offended\".[120]\n",
         "The Groovie Ghoulies, themselves named after the cartoon Groovie Goolies, were influenced by the \"cartoon-punk\" aspect of the Dickies.[121]\n",
         "In a profile of Bob Mould in Pop Matters, it was said that in writing/performing for Husker Du, he was driven by \"being faster\" than the Dickies, Ramones, and Buzzcocks.[122]\n",
         "Ian MacKaye recounted an anecdote to a reporter from Salon about listening to a mix tape an acquaintance made, while in a car traveling to a Ramones concert, in 1979. He recalled \"it had that Dickies 'Banana Splits' song on it and it just blew my mind! As soon as I got back I started searching out all these bands, because I was so intoxicated with all this music.\"[123]\n",
         "Fat Mike of NOFX, Me First and the Gimme Gimmes, and Fat Wreck Chords, and Milo Aukerman of Descendents, both cite the Dickies as an influence.[124][65]\n",
         "Johnny Ramone of the punk band The Ramones \"officially\" ranked the Dickies as one of the top 10 greatest punk bands of all time.[125]\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "EPs": {},
      "Live albums": {},
      "Compilation albums": {},
      "Singles": {}
   },
   "Videos": {
      "Music videos": {},
      "Commercial Releases": {}
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Dickies are an American punk rock band formed in the San Fernando Valley, Los Angeles, in 1977. One of the longest tenured punk rock bands, they have been in continuous existence for over 40 years. They have consistently balanced catchy melodies, harmony vocals,[1][2] and pop song structures, with a speedy punk guitar attack. This musical approach is paired with a humorous style and has been labelled \"pop-punk\" or \"bubble-gum punk\".[3][4] The band have sometimes been referred to as \"the clown princes of punk\".[5][6][7][8][9]\n",
      "Eventual Dickies vocalist Leonard Graves Phillips was a self-described celibate, \"introverted character\" in the period following high school. He played keyboards in his bedroom and, together with friend Bob Davis (later Chuck Wagon), created a type of music that Phillips describes as \"autism rock\", similar to Devo, though not as good. Another friend of Phillips was Steve Hufsteter, a former junior high school and high school class mate. The latter figure was the guitarist and main songwriter for local power pop band the Quick, and was giving guitar lessons to Stan Lee (born Stan Sobol).  Although Hufsteter thought highly of Phillips' keyboard playing, it was his opinion that Phillips becoming vocalist for the band Lee was starting would be good for his friend's social well being. Phillips intentionally sabotaged his first audition, but realizing his mistake, aggressively entreated Lee for another chance. That audition was successful, \"and the rest is history\" according to Stan Lee. Singing for the Dickies had its intended effect for Phillips, causing him to break out of his shell, and improving his confidence with women.[10][11]\n",
      "As a teenager, Stan Lee was a drug buddy of Iggy Pop, once accepting the well known \"leopard\" jacket that the latter wore in the Stooges as payment for heroin.[12] Surprisingly, it was not hanging out with Iggy Pop that pushed Lee into joining the nascent punk scene, but rather it was the experience of going with eventual Dickies bassist Billy Club (Bill Remar) to see The Damned on their first American tour that proved most influential. Exposure to the music of the Ramones and the Weirdos was seminal as well. Prior to deciding on a punk rock direction, Lee had begun to learn guitar, at the urging of friend Kevin DuBrow,[13] with the ambition of becoming a Ritchie Blackmore-like virtuoso. His teacher, Huffsteter, suggested that playing punk was a more practical idea, and by way of convincing, provided Lee with his initial introduction to the music of the Ramones. Lee and Club rounded out their initial punk band lineup with Phillips, multi-instrumentalist Chuck Wagon, and drummer Karlos Kaballero (Carlos Caballero), who came up with the name \"Dickies\" (Lee preferred \"the Imbeciles\"),[14] and the band made their live debut at the Whisky a Go Go in September 1977. The Dickies were among the first punk rock bands to emerge from Los Angeles. They were the first California punk band to appear on network television (C.P.O. Sharkey),[15] and the first California punk band to be signed to a major record label (A&M Records).[11][16][17]\n",
      "The book Going Underground: American Punk Rock 1979–1989 describes the Dickies in the context of the early L.A. punk scene. Its author contends that the Dickies were \"the best musicians on the scene and made good use of their talents\". Also described is an early gig at the Masque in 1977. An opening band was so incompetent that \"some punks turned a fire hose on them\". The Dickies came out next, looking like \"normal suburban nerds\". The band \"erupted in a tight, jackhammer, speed-of-light assault\" of \"ferocious... goofball comedy punk\" which inspired manic punk rock dancing (\"bodies carooming off each other\"). The author claims that the Dickies' subsequent record contract caused jealousy among other bands, some of whom would say that the Dickies were only in it for money. This belief is contrasted with the Dickies actual stated primary goal of being written about in Slash (fanzine).[18]\n"
   ],
   "infobox": {
      "Origin": [
         "San Fernando Valley, California"
      ],
      "Genres": [
         "Punk Rock, Pop Punk, Comedy Punk"
      ],
      "Years active": [
         "1977–present"
      ],
      "Labels": [
         "A&M,  Captain Oi,  Triple X, Enigma Records, Fat Wreck Chords,  Cleopatra Records, Restless Brand, ROIR"
      ],
      "Website": [
         "thedickies.com"
      ],
      "Members": [
         "Leonard Graves Phillips",
         "Stan Lee",
         "Ben David Seelig",
         "Adam Gomez",
         "Eddie Tatar"
      ],
      "Past members": [
         "Chuck Wagon",
         "Billy Club",
         "Karlos Kaballero",
         "Jerry Angel",
         "Lorenzo Buhne",
         "Steve Hufsteter",
         "Anthony Tiny Biuso",
         "Scott Sindon",
         "Enoch Hain",
         "Cliff Martinez",
         "Glen Laughlin",
         "Jonathan Melvoin",
         "Marc Vachon",
         "Mark Aber-Rooney",
         "Dylan Thomas",
         "Rick Dasher",
         "Greg Hanna",
         "Travis Johnson",
         "Kris Kwiatkowski",
         "Little Dave Teague",
         "Steven Fryette"
      ]
   }
}