{
   "Name": "Divine Heresy",
   "rawData": [
      "Divine Heresy is an American metal band formed by founder of Fear Factory guitarist Dino Cazares and Devolved drummer John Sankey. Although the band's origins trace back to 2002, Divine Heresy was officially formed in 2006. The band currently consists of guitarist Cazares, former Vital Remains drummer and current World Under Blood drummer Tim Yeung, former Nile bassist Joe Payne and vocalist Travis Neal. Tommy \"Vext\" Cummings was fired from Divine Heresy following an onstage altercation on April 26, 2008. After holding auditions for a new frontman for the band, it was announced on August 14 that The Bereaved vocalist Travis Neal is to fill the position.\n",
      "The band's debut album Bleed the Fifth was released on August 28, 2007, and sold 2,700 copies in its first week. Receiving generally positive reviews, Eduardo Rivadavia of Allmusic commented the album \"strikes a near-perfect balance between confirmation and innovation\", while Dom Lawson of Metal Hammer commented \"All in all, the portly pioneer  has hit the bull's-eye\".\n",
      "Following his departure from Fear Factory in 2002, guitarist Dino Cazares was looking for a drummer that \"fit in\" with the band. First he tried drummers John Sankey from Devolved and Nicholas Barker from the bands Cradle of Filth and Dimmu Borgir. But both drummers had to return to their homelands of Australia and England respectively due to visa issues. He then met former Vital Remains drummer Tim Yeung. Cazares and Yeung recorded the material they wrote and sent tapes to Cummings for his vocal audition. Cazares comments \"We heard passion and anger in his voice, which was something we wanted. It was also very aggressive.\"\nDivine Heresy held auditions for a permanent bassist — Tony Campos of Static-X played bass on three songs and Cazares acted as bassist on the remaining songs. Following unsuccessful auditions, Cazares was contacted by former Nile bassist Joe Payne. Cazares knew Joe Payne from seeing him play live with Nile. After auditioning, Joe Payne joined Divine Heresy as the permanent bass guitarist.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Metalcore[1]",
         "technical death metal[2][3][4][5]",
         "groove metal[4]"
      ],
      "Years active": [
         "2005–2015 (on hiatus)"
      ],
      "Labels": [
         "Century Media",
         "Roadrunner"
      ],
      "Associated acts": [
         "Fear Factory",
         "Bad Wolves",
         "World Under Blood",
         "Nile",
         "Asesino",
         "Brujeria",
         "All That Remains",
         "Domination Through Impurity",
         "Hate Eternal",
         "Vital Remains",
         "The Bereaved",
         "Pain After Death",
         "Dirge Within"
      ],
      "Website": [
         "Divine Heresy on Myspace"
      ],
      "Members": [
         "Dino Cazares"
      ],
      "Past members": [
         "John Sankey",
         "Tim Yeung",
         "Tommy Vext",
         "Joe Payne",
         "Travis Neal"
      ]
   }
}