{
   "Name": "Divine Heresy",
   "Sections": [
      "1 History",
      "1.1 Formation (2002–2007)",
      "1.2 Bleed the Fifth (2007–2008)",
      "1.3 Departure of Tommy Vext (2008)",
      "1.4 Bringer of Plagues and hiatus (2009–2015)",
      "2 Band members",
      "2.1 Current members",
      "2.2 Former members",
      "2.3 Live members",
      "2.4 Timeline",
      "3 Discography",
      "4 Music videos",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Divine Heresy is an American metal band formed by founder of Fear Factory guitarist Dino Cazares and Devolved drummer John Sankey. Although the band's origins trace back to 2002, Divine Heresy was officially formed in 2006. The band currently consists of guitarist Cazares, former Vital Remains drummer and current World Under Blood drummer Tim Yeung, former Nile bassist Joe Payne and vocalist Travis Neal. Tommy \"Vext\" Cummings was fired from Divine Heresy following an onstage altercation[6] on April 26, 2008. After holding auditions for a new frontman for the band, it was announced on August 14 that The Bereaved vocalist Travis Neal is to fill the position.[7]\n",
         "The band's debut album Bleed the Fifth was released on August 28, 2007, and sold 2,700 copies in its first week. Receiving generally positive reviews, Eduardo Rivadavia of Allmusic commented the album \"strikes a near-perfect balance between confirmation and innovation\", while Dom Lawson of Metal Hammer commented \"All in all, the portly pioneer [Cazares] has hit the bull's-eye\".\n"
      ]
   },
   "History": {
      "Formation (2002–2007)": {
         "text": [
            "Following his departure from Fear Factory in 2002, guitarist Dino Cazares was looking for a drummer that \"fit in\" with the band. First he tried drummers John Sankey from Devolved and Nicholas Barker from the bands Cradle of Filth and Dimmu Borgir. But both drummers had to return to their homelands of Australia and England respectively due to visa issues. He then met former Vital Remains drummer Tim Yeung.[8] Cazares and Yeung recorded the material they wrote and sent tapes to Cummings for his vocal audition. Cazares comments \"We heard passion and anger in his voice, which was something we wanted. It was also very aggressive.\"[9]\nDivine Heresy held auditions for a permanent bassist — Tony Campos of Static-X played bass on three songs and Cazares acted as bassist on the remaining songs. Following unsuccessful auditions, Cazares was contacted by former Nile bassist Joe Payne. Cazares knew Joe Payne from seeing him play live with Nile. After auditioning, Joe Payne joined Divine Heresy as the permanent bass guitarist.\n"
         ]
      },
      "Bleed the Fifth (2007–2008)": {
         "text": [
            "The band recorded its debut album, Bleed the Fifth in early 2007 with production duties handled by former Machine Head guitarist Logan Mader. The title of the album is a play on words, Cazares comments \"You have the right to keep your mouth shut, but on this record we believe we’re saying a lot\".[9] Cummings wrote the majority of the lyrics, which are about personal strifes and how people overcome them. Much of the lyrical content was influenced by the Book of Revelation, natural disasters, war, and terrorism.[10] Cazares stated the album is a \"big fuck you\" to the people who want his projects to fail.[11]\n",
            "Released on August 28, 2007, in the United States, Bleed the Fifth sold 2,700 copies in its first week.[12] Dom Lawson of Metal Hammer summarized his review by saying \"All in all, the portly pioneer has hit the bull's-eye and it's going to be fascinating to see what happens next\", awarding an 8 out of a possible 10.[13] Eduardo Rivadavia of Allmusic felt the album \"strikes a near-perfect balance between confirmation (reminding fans of Cazares' abilities and unique vision) and innovation (he even plays a few guitar solos!)\".[14] Scott Alisoglu of Blabbermouth.net summarized his review claiming the album is \"one tough son of a bitch that may still have you humming melodies long after you've ejected the disc.\"[15] Chad Bowar of About.com commented \"Great musicianship, good songs and excellent production make this a very respectable debut.\"[16]\n",
            "After recording was completed, Cazares announced the band signed a North American deal with Century Media Records, and a licensing deal with Roadrunner Records in Europe. His decision to choose Century Media was based on the creative freedom the label gave him, whereas Roadrunner would ask him to produce radio and commercial songs when he was in Fear Factory.[9] However, Yeung claims Roadrunner were not interested and said he did not want to be on a label that is \"sort of interested\".[8]\n"
         ]
      },
      "Departure of Tommy Vext (2008)": {
         "text": [
            "Lead singer Tommy Vext left the band following an on-stage altercation on April 26, 2008.[6] Cause of the altercation remains controversial. \nAccording to Dino Cazares, Vext was fired because of a conflict during a live show. \"We felt that he wanted to end the show early to go hang out at the New England Metal Fest, which we were supposed to be performing at the next day\" coming up with all sorts of excuses to make this happen.[6]\nThe band continued to play after what Vext said was supposed to be the last song. Vext then began screaming at Dino and argued with him before he pushed Dino across the stage. Vext was kicked out of the band immediately.\nIn a video interview Vext explained that he wanted to prevent ruining his voice for the next show by ending the set early because the PA system went out during the show.[17]\n",
            "In exclusive \"Metal Injection\" interview Tommy explained the real reasons behind his departure from the band: \n",
            " I’ve been suffering the indignities of Dino’s massive ego for as long as I’ve worked with him, and unfortunately, everything I’ve heard about him had eventually come to fruition, and he is exactly as he’s been portrayed as by his ex-band members. And this happening now is the same reason why he’s not in Fear Factory anymore. It was a stepping stone in my life and I’m moving on.[18] "
         ]
      },
      "Bringer of Plagues and hiatus (2009–2015)": {
         "text": [
            "Divine Heresy's follow-up to 2007's Bleed the Fifth was the group's first release with new vocalist Travis Neal, formerly of Pushed. He is also currently a member of the Swedish band The Bereaved and the band Hate Times Nine from San Diego/LA. The album, titled Bringer of Plagues, was released on July 28 release via Century Media Records. Dino co-produced the album with the acclaimed producing team Dirty Icon (Logan Mader and Lucas Banker).\n",
            "As of November 25, 2010, Divine Heresy cannot be found on the Century Media Records website.\n",
            "Dino has also given interviews that during breaks from the current Fear Factory tour, Dino and drummer Tim Yeung have started writing new material for the next Divine Heresy record.\n",
            "On January 26, 2011, it was announced that bassist Joe Payne had left Divine Heresy.\n",
            "On 10 May 2011, Dino announced via Divine Heresy's Facebook page and through his own personal account that Divine Heresy are still together and that there will be a new album in 2012. He also said that they were planning a tour along the US east coast.[19]\nOn August 17, 2012, guitarist Dino Cazares via Twitter commented on the status of Tim Yeung as a DH drummer:\n",
            "Well judging from his drumming on the last MA cd not sure if I want him back. I'll try but he's David V's boy now. Might be too difficult plus there are plenty of other sick drummers out there.",
            "On July 27, 2015, in an interview with MetalSucks, Cazares confirmed that he is the only remaining member of Divine Heresy and the band is currently inactive due to his commitments with Fear Factory.[20]\n"
         ]
      }
   },
   "Band members": {
      "Current members": {},
      "Former members": {},
      "Live members": {},
      "Timeline": {}
   },
   "Discography": {},
   "Music videos": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Divine Heresy is an American metal band formed by founder of Fear Factory guitarist Dino Cazares and Devolved drummer John Sankey. Although the band's origins trace back to 2002, Divine Heresy was officially formed in 2006. The band currently consists of guitarist Cazares, former Vital Remains drummer and current World Under Blood drummer Tim Yeung, former Nile bassist Joe Payne and vocalist Travis Neal. Tommy \"Vext\" Cummings was fired from Divine Heresy following an onstage altercation[6] on April 26, 2008. After holding auditions for a new frontman for the band, it was announced on August 14 that The Bereaved vocalist Travis Neal is to fill the position.[7]\n",
      "The band's debut album Bleed the Fifth was released on August 28, 2007, and sold 2,700 copies in its first week. Receiving generally positive reviews, Eduardo Rivadavia of Allmusic commented the album \"strikes a near-perfect balance between confirmation and innovation\", while Dom Lawson of Metal Hammer commented \"All in all, the portly pioneer [Cazares] has hit the bull's-eye\".\n",
      "Following his departure from Fear Factory in 2002, guitarist Dino Cazares was looking for a drummer that \"fit in\" with the band. First he tried drummers John Sankey from Devolved and Nicholas Barker from the bands Cradle of Filth and Dimmu Borgir. But both drummers had to return to their homelands of Australia and England respectively due to visa issues. He then met former Vital Remains drummer Tim Yeung.[8] Cazares and Yeung recorded the material they wrote and sent tapes to Cummings for his vocal audition. Cazares comments \"We heard passion and anger in his voice, which was something we wanted. It was also very aggressive.\"[9]\nDivine Heresy held auditions for a permanent bassist — Tony Campos of Static-X played bass on three songs and Cazares acted as bassist on the remaining songs. Following unsuccessful auditions, Cazares was contacted by former Nile bassist Joe Payne. Cazares knew Joe Payne from seeing him play live with Nile. After auditioning, Joe Payne joined Divine Heresy as the permanent bass guitarist.\n",
      "The band recorded its debut album, Bleed the Fifth in early 2007 with production duties handled by former Machine Head guitarist Logan Mader. The title of the album is a play on words, Cazares comments \"You have the right to keep your mouth shut, but on this record we believe we’re saying a lot\".[9] Cummings wrote the majority of the lyrics, which are about personal strifes and how people overcome them. Much of the lyrical content was influenced by the Book of Revelation, natural disasters, war, and terrorism.[10] Cazares stated the album is a \"big fuck you\" to the people who want his projects to fail.[11]\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Metalcore[1]",
         "technical death metal[2][3][4][5]",
         "groove metal[4]"
      ],
      "Years active": [
         "2005–2015 (on hiatus)"
      ],
      "Labels": [
         "Century Media",
         "Roadrunner"
      ],
      "Associated acts": [
         "Fear Factory",
         "Bad Wolves",
         "World Under Blood",
         "Nile",
         "Asesino",
         "Brujeria",
         "All That Remains",
         "Domination Through Impurity",
         "Hate Eternal",
         "Vital Remains",
         "The Bereaved",
         "Pain After Death",
         "Dirge Within"
      ],
      "Website": [
         "Divine Heresy on Myspace"
      ],
      "Members": [
         "Dino Cazares"
      ],
      "Past members": [
         "John Sankey",
         "Tim Yeung",
         "Tommy Vext",
         "Joe Payne",
         "Travis Neal"
      ]
   }
}