{
   "Discography": {
      "Extended plays": {},
      "Live / compilation albums": {},
      "Singles": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "1981–1994": {
         "text": [
            "In 1982, Dramarama formed in the basement of a Wayne, New Jersey, record store owned by founding member Chris Carter.[2] Carter operated the alternative record store Looney Tunez Records (previously known as Dirt Cheap Records). Initially the line-up consisted of; singer/songwriter John Easdale, \"Mr. E Boy\" (Mark Englert) and Carter, later joined by Peter Wood on guitars and Ron Machuga on drums.\n",
            "The evolution and combined efforts prompted the emergence of the DPW (a local parody named in honor of their home town Department of Public Works) and re-incarnation, \"The F&cks\". The band emerged in North New Jersey at that time where there was a scene with radio station WHTG 106.3 and venues such as The Stone Pony, Green Parrot and Fast Lane featuring other local bands such as  Red House, Smithereens, Whirling Dervishes and The Blases.[3] In 1982, the band released its first single, \"You Drive Me\", attracting some national attention.\n",
            "In 1984, keyboard player Ted Ellenis and drummer Ken Moutenot (replacing Machuga) later joined the band and Dramarama released their first EP, Comedy, a self-funded five-track debut that garnered both critical and cult praise in the unexpected location of France. Moutenot was quickly replaced by Jesse Farbman who left the group after the band's third album to pursue mind/body purity and to obtain \"philosophical and spiritual awareness\". As such, Dramarama issued its first full-length release, 1985's Cinéma Vérité on France's New Rose Records.[2]  It was later re-released in the U.S. after receiving airplay on KROQ-FM radio from influential Los Angeles disc jockey Rodney Bingenheimer (who at first actually thought the band was French). Bingenheimer alerted Posh Boy Records at New Rose who gave Robbie Fields the green light to contact the band directly in New Jersey.\n",
            "One of the first radio stations to play the song \"Anything, Anything (I'll Give You)\" was KROQ.  It was one of the station's most requested songs in 1986 and 1987, and became one of the most requested songs in the station's history.[4][5] Following the local L.A. success of \"Anything, Anything\", the band obtained a larger advance from Chameleon and permanently packed-up and relocated from New Jersey to Los Angeles. The song has been featured in the box office success A Nightmare on Elm Street 4: The Dream Master and was covered for the East Timor Benefit Album.[6]\n",
            "As an expression of gratitude to both Bingenheimer and Fields, the band gave Robbie Fields their recording of the New York Dolls' song \"Private World\" for inclusion on The Best of Rodney on The Roq CD, released in 1987 and re-released in 1992 through Rhino Records.\n",
            "The recording sessions for Stuck in Wonderamaland produced enough material for three albums.  Instead of letting so many songs go to waste, Easdale and Carter decided to again try a foreign release.  Thus, Looking Through..., a 14-song album, was released in Europe by \"The Bent-Backed Tulips\", both pseudonym and album title in reference to lyrics from the Beatles' \"Glass Onion\".  Looking Through... was eventually re-released in the U.S. through Fullerton, California-based eggBERT Records with extra tracks, increasing the number of songs to 20.\n",
            "The band then signed with Chameleon distributor Elektra and released 1991's Vinyl.  Backed by a major label for the first time, Dramarama started getting nationwide airplay with the singles \"Haven't Got A Clue\" (which was also on a CD included with the Sega CD video game system in the United States) and \"What Are We Gonna Do?\". The album's high-end production with Don Smith (Tom Petty, Rolling Stones, Keith Richards) was a highlight adding to the success of the LP. Vinyl included contributions from Mick Taylor, Jim Keltner, Benmont Tench, and Brian Macleod of Wire Train.\n",
            "After Vinyl, a limited-edition 17-song CD called The Days of Wayne and Roses (The Trash Tapes) was made available to members of the Dramarama fan club.  It included the band's earliest recordings together, as well as songs that were dropped from their early albums, a couple of live performances, and one song exclusive (at the time) to the disc.\n",
            "The band's final release on Elektra, 1993's Hi-fi Sci-fi, was a favorite among both critics and fans, and remains a cult staple. Clem Burke, who had joined the band for the Vinyl tour, appears on this album, and there are backing vocal contributions from Dwight Twilley and Sylvain Sylvain.  The subsequent tours wound down and the group broke up shortly thereafter.[2]\n"
         ]
      },
      "1995–2005": {
         "text": [
            "Following two relatively quiet years after the 1994 breakup, John Easdale began performing live music again in 1996, doing shows in both New Jersey and the L.A. area.  He assembled a band that he has on occasion called The John Easdale Group, and has also casually named it The Newcomers, featuring Dramarama's Mark Englert, as well as Peter Wood for East Coast appearances.  Other Newcomers have included fellow eggBERT alum Nick Celeste (of former Bongo Richard Barone's band and once the frontman for In Color; has also worked with Aimee Mann and Jules Shear) on guitar, Muddy Shews on bass, Danny Roselle on keys and guitar, and Chris O'Hara on drums.  However, eventually Easdale was able to find steady players in Mike Davis, Tony Snow and Craig Ballam, who connected with Easdale circa 1996.\n",
            "In 1998, John Easdale released a solo album on the eggBERT label called Bright Side, on which many of the tracks featured musicians with ties to both Dramarama and the Newcomers, including Mark Englert and Clem Burke, as well as Mike Davis, Tony Snow and Craig Ballam, who also contributed production and engineering skills.  Prior to Bright Side, Easdale issued a homegrown, fan-only, no-label version of the Bright Side CD in 1996 that contained versions of songs that made the final cut, as well as some that did not.  Easdale refers to it as his \"blueprint\" for the final collection, and fans call it the \"pre-release\" Bright Side.\n",
            "Following the publicity from the VH1 series Bands Reunited, subsequent KROQ's Inland Invasion, and an article in Rolling Stone magazine lauding their retooling of the Dead Kennedys' politically charged \"California über alles\" in response to Arnold Schwarzenegger's 2003 run for governor of California, Easdale decided in late 2003 the band name \"Dramarama\" should go on. To cement this point, the next CD (an EP) would be billed to Dramarama, and was yet another unlabeled home-brewed affair entitled Absolutely, 100% Made in N.J., which was recorded on a whim while John and the band were on a brief tour of New Jersey in 2003. The EP's liner notes indicated that most of the seven tracks were \"from the forthcoming Dramarama album, Everybody Dies.\"\n",
            "After yet another distribution setback, the album was released on October 25, 2005 by California-based label 33rd Street Records.\n",
            "They appeared on The Ellen DeGeneres Show as Ellen's 50th birthday present from her DJ Ted Stryker.\n"
         ]
      },
      "2006–present": {
         "text": [
            "The current lineup consists of original founding members John Easdale, lead and rhythm guitar player Peter Wood (the only band member who moved back to New Jersey and still maintains a residence there), and lead guitarist Mark Englert (Mr. \"E\" Boy). Rounding out the band are Los Angeles-based musicians Tony Snow (No Sugar, Tonio & The Change, Shiteland Ponies) on drums, and (former Lizzy Borden member) Mike Davis on bass. In addition, Tony Snow leads his own band, Tonio & The Change, and Mike Davis is the bass player for both Judas Priest frontman Rob Halford's eponymous solo band Halford, and metal \"supergroup\" Death Dealer.\n",
            "The Dramarama song \"Anything Anything\" serves as the title and theme song of New York City radio station WRXP-FM's free form program \"Anything Anything with Rich Russo\".. The version from \"Live at the China Club\" begins each show. After the switch of format to all news on WRXP-FM, Russo's radio show was picked up on WXPK-FM and WDHA-FM where \"Anything Anything\" still serves as the name and the china club version opens each show.\n",
            "The band has been very active since 2005. In 2009, they returned to their roots by playing for the Troy High School Battle of the Bands. This event took place on February 3, 2009 at Plummer Auditorium, located in Fullerton, California. Over 1,000 people attended this event. They finished the event with an encore, playing the 1985 hit single Anything, Anything. Also in 2009 were several shows at House Of Blues venues in Texas and Southern California, as well as Six Flags Magic Mountain. Dramarama returned to New Jersey for two shows in November 2009, and performed in Downtown Los Angeles and San Juan Capistrano's The Coach House in December 2009. They returned to Troy High School's Battle of the Bands in 2010 and 2011.\n",
            "A special live version of \"Last Cigarette\" was recorded for the limited edition 500 pressing vinyl album \"Anything Anything with Rich Russo on 101.9 RXP presents Exclusive Live Performances\" in this version the band replaces \"Johnny Carson\" with \"Rich Russo\" as an homage to the free form DJ. The album was released April 2010.[7]\n",
            "As of 2018, Dramarama continues to perform frequently as headliners and at various festivals.\n",
            "After a 15-year hiatus the band released their 7th studio album Color TV on May 1, 2020.[1]\n"
         ]
      },
      "Post-Dramarama careers": {
         "text": [
            "Original bass player/producer and Dramarama co-founder Chris Carter is currently a disc jockey in Los Angeles where he hosts America's longest-running Beatles show, Breakfast with the Beatles, and the brilliant weekly four-hour eclectic program on the satellite radio station Sirius-XM, \"Chris Carter's British Invasion.\" Carter also went on to produce and write the film Mayor of the Sunset Strip, which in 2003 was nominated for Best Documentary by the Independent Spirit Film Awards, and which featured members of Dramarama. After Dramarama split in 1994, Carter formed QM Management, for which he manages LA pop group The Wondermints, currently touring as Beach Boy Brian Wilson's backing band.\n",
            "Drummer Jesse Farbman, aka; known as Anant Jesse, lived in Montreal, Canada, where he taught spiritual therapeutics and maintained a private practice; he died in 2014. Former keyboard player Theodore Ellenis, now serves as Senior Finance Executive for a New York City area firm.\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 1981–1994",
      "1.2 1995–2005",
      "1.3 2006–present",
      "1.4 Post-Dramarama careers",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Live / compilation albums",
      "2.3 Extended plays",
      "2.4 Singles",
      "3 Videography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "\n",
         "Dramarama is an American, New Jersey-based alternative rock/power pop band, who later moved to Los Angeles. The band was formed in New Jersey in 1982 and disbanded in 1994. The band formally reunited in 2003 following an appearance on VH1's Bands Reunited reality show.\n",
         "Since 1996, an evolving lineup of the band, always fronted by singer/songwriter John Easdale, has been performing in one incarnation or another (initially billed as Easdale solo but usually joined by former Dramarama bandmates), and from then until 2003 played occasional shows in the L.A. area, as well as in New Jersey. However, amid renewed interest since the VH1 Bands Reunited episode in January 2004 and a large-scale appearance at KROQ-FM's annual Inland Invasion festival concert (attended by more than 78,000 fans) in September 2003, Dramarama then toured nationally and released a new, full-length studio CD titled Everybody Dies on October 25, 2005. Fifteen years later, they released their seventh album: Color TV.[1]\n"
      ]
   },
   "Title": "Dramarama - Wikipedia",
   "Videography": {}
}