{
   "Name": "Dramarama",
   "rawData": [
      "Dramarama is an American, New Jersey-based alternative rock/power pop band, who later moved to Los Angeles. The band was formed in New Jersey in 1982 and disbanded in 1994. The band formally reunited in 2003 following an appearance on VH1's Bands Reunited reality show.\n",
      "Since 1996, an evolving lineup of the band, always fronted by singer/songwriter John Easdale, has been performing in one incarnation or another (initially billed as Easdale solo but usually joined by former Dramarama bandmates), and from then until 2003 played occasional shows in the L.A. area, as well as in New Jersey. However, amid renewed interest since the VH1 Bands Reunited episode in January 2004 and a large-scale appearance at KROQ-FM's annual Inland Invasion festival concert (attended by more than 78,000 fans) in September 2003, Dramarama then toured nationally and released a new, full-length studio CD titled Everybody Dies on October 25, 2005. Fifteen years later, they released their seventh album: Color TV.\n",
      "In 1982, Dramarama formed in the basement of a Wayne, New Jersey, record store owned by founding member Chris Carter. Carter operated the alternative record store Looney Tunez Records (previously known as Dirt Cheap Records). Initially the line-up consisted of; singer/songwriter John Easdale, \"Mr. E Boy\" (Mark Englert) and Carter, later joined by Peter Wood on guitars and Ron Machuga on drums.\n"
   ],
   "infobox": {
      "Origin": [
         "Wayne, New Jersey, U.S."
      ],
      "Genres": [
         "Alternative rock, power pop, indie rock, new wave"
      ],
      "Years active": [
         "1982–1994, 2003–present"
      ],
      "Labels": [
         "Binky 101, Questionmark, New Rose, Chameleon, Eggbert, Harvey Star, 33rd Street"
      ],
      "Associated acts": [
         "The Bent Backed Tulips, John Easdale Band, The Newcomers"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "John Easdale",
         "Peter Wood",
         "Mark Englert",
         "Mike Davis",
         "Tony Snow"
      ],
      "Past members": [
         "Chris Carter",
         "Jesse Farbman",
         "Clem Burke",
         "Ted Ellenis",
         "Tom Mullaney",
         "Ronny Machuga",
         "Ken Moutenout",
         "Craig Ballam",
         "Morley Bartnoff",
         "Ray Barwick"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band, who later moved to Los Angeles. The band was formed in New Jersey in [YEAR] and disbanded in [YEAR]. The band formally reunited in [YEAR] following an appearance on VH1's Bands Reunited reality show.\n",
      "Since [YEAR], an [GENRE] band, always fronted by singer/songwriter John Easdale, has been performing in one incarnation or another (initially billed as Easdale solo but usually joined by former [BAND_NAME] bandmates), and from then until [YEAR] played occasional shows in the L.A. area, as well as in New Jersey. However, amid renewed interest since the VH1 Bands Reunited episode in [MONTH] [YEAR] and a large-scale appearance at KROQ-FM's annual Inland Invasion festival concert (attended by more than 78,000 fans) in [MONTH] [YEAR], [BAND_NAME] then toured nationally and released a new, full-length studio CD titled Everybody Dies on [MONTH] 25, [YEAR]. Fifteen years later, they released their seventh album: Color TV.\n",
      "In [YEAR], [BAND_NAME] formed in the basement of a Wayne, New Jersey, record store owned by founding member Chris Carter. Carter operated the alternative record store Looney Tunez Records (previously known as Dirt Cheap Records). Initially the line-up consisted of; singer/songwriter [PERSON_NAME_FULL_0_MALE], \"Mr. E Boy\" ([MONTH]k Englert) and Carter, later joined by [PERSON_NAME_FULL_1_MALE] on guitars and Ron Machuga on drums.\n"
   ]
}