{
   "Name": "Dum Dum Girls",
   "rawData": [
      "Dum Dum Girls was an American rock band, formed in 2008. It began as the bedroom recording project of singer and songwriter Dee Dee (née Kristin Gundred). She is currently based in Los Angeles. The name is a double homage to the Vaselines' album Dum Dum and the Iggy Pop song \"Dum Dum Boys\".\n",
      "The first release under the Dum Dum Girls moniker was a five-song CDR on her own label, Zoo Music, in late 2008. It was followed by an EP on Captured Tracks and a 7\" on HoZac Records She quickly gained attention with these releases and signed to Sub Pop in July 2009.\n",
      "Dum Dum Girls' debut album, I Will Be, was released in March 2010 and was well received by critics. Pitchfork described the songs as \"genuine earworms, both unfailingly hip and often wonderfully associative\". Dee Dee produced the record with Richard Gottehrer, who had previously worked with Richard Hell, Blondie, the Go-Gos and the Raveonettes. Gottehrer also co-wrote the early 1960s hit songs \"My Boyfriend's Back\" and \"I Want Candy\". The record included guest guitarists Nick Zinner of Yeah Yeah Yeahs on \"Yours Alone\"; Dee Dee's ex-husband, Brandon Welchez of Crocodiles, on \"Blank Girl\"; and Andrew Miller on multiple tracks. The cover of the album featured a college snapshot of Dee Dee's mother, who died from cancer in 2010. After its release, Dee Dee assembled a touring band, and their first shows were in support of Girls.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Indie rock, noise pop, dream pop, shoegaze, alternative rock"
      ],
      "Years active": [
         "2008–2016"
      ],
      "Labels": [
         "HoZac, Zoo Music, Captured Tracks, Sub Pop, Hell, Yes!"
      ],
      "Associated acts": [
         "Kristin Kontrol, The Mayfair Set, Les Demoniaques, Zodiacs, Haunted Hearts, Sisu, HUNI"
      ],
      "Past members": [
         "Kristin \"Dee Dee\" Gundred",
         "Jules Medeiros",
         "Sandra Vu",
         "Andrew Miller",
         "Bambi",
         "Frankie Rose",
         "Jeremy Rojas",
         "Andrew Montoya",
         "Brandon Welchez",
         "Mike Sniper",
         "Chuck Rowell",
         "Malia James"
      ]
   }
}