{
   "Name": "Evildead",
   "rawData": [
      "Evildead is an American thrash metal band formed in Los Angeles in 1986. The band was originally composed of members of two former bands, Agent Steel and Abattoir, including guitarist Juan Garcia, who is their only remaining original member. During their initial nine-year run, Evildead released only two studio albums: Annihilation of Civilization (1989) and The Underworld (1991). Although their commercial success was limited, their music is still highly regarded amongst metal fans. Evildead was plagued by extended inactivity due to lineup changes and problems with making a follow-up to The Underworld. This resulted in their official breakup in 1995. After a short-lived reunion from 2008 to 2012, the band reformed once again in 2016, and released their third studio album United $tate$ of Anarchy, their first in 29 years, on October 30, 2020.\n",
      "Evildead was formed in 1986, initially as a side-project of Agent Steel guitarist Juan Garcia and Abattoir bassist Mel Sanchez, with the intention to write heavy music with more hardcore and thrash metal elements, more so than their bands at the time. Evildead paved new ground with their ferocious approach to songwriting, but also followed a style similar to those of their peers (including Testament, Vio-lence, Dark Angel and Sacred Reich), with lyrics exploring political and social themes mixed with humor, and horror and nuclear war topics. Their band name was inspired from the Sam Raimi horror film The Evil Dead.\n",
      "In 1988, the band signed a recording contract with the European label Steamhammer Records and released Rise Above (a 3-track EP featuring the songs \"Sloe-Death\", \"Run Again\" and the title track which is a cover version of the Black Flag song) in the following year. They followed it up with their debut full-length album Annihilation of Civilization (also released in 1989) to rave reviews. A music video was released for the title track, and it received airplay on MTV's Headbangers Ball.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California"
      ],
      "Genres": [
         "Thrash metal"
      ],
      "Years active": [
         "1986–1995",
         "2008–2012",
         "2016–present"
      ],
      "Labels": [
         "Steamhammer"
      ],
      "Associated acts": [
         "Body Count",
         "Abattoir",
         "Agent Steel",
         "Testament",
         "Slayer"
      ],
      "Members": [
         "Juan Garcia",
         "Albert Gonzales",
         "Karlos Medina",
         "Rob Alaniz",
         "Phil Flores"
      ],
      "Past members": [
         "Steve Nelson",
         "Mark Caro",
         "Dan Roe",
         "Dan Flores",
         "Mel Sanchez",
         "Doug Clawson",
         "Joe Montelongo",
         "Jon Dette",
         "Eddie Livingston"
      ]
   },
   "albums": [
      "Annihilation of Civilization",
      "The Underworld",
      "United States of Anarchy"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in Los Angeles in [YEAR]. The band was originally composed of members of two former bands, Agent Steel and Abattoir, including guitarist [PERSON_NAME_FULL_0_MALE], who is their only remaining original member. During their initial nine-year run, [BAND_NAME] released only two studio albums: Annihilation of Civilization ([YEAR]) and The Underworld ([YEAR]). Although their commercial success was limited, their music is still highly regarded amongst metal fans. [BAND_NAME] was plagued by extended inactivity due to lineup changes and problems with making a follow-up to The Underworld. This resulted in their official breakup in [YEAR]. After a short-lived reunion from [YEAR] to [YEAR], the band reformed once again in [YEAR], and released their third studio album United $tate$ of Anarchy, their first in 29 years, on [MONTH] 30, [YEAR].\n",
      "[BAND_NAME] was formed in [YEAR], initially as a side-project of Agent Steel guitarist [PERSON_NAME_FULL_0_MALE] and Abattoir bassist Mel Sanchez, with the intention to write heavy music with more hardcore and thrash metal elements, more so than their bands at the time. [BAND_NAME] paved new ground with their ferocious approach to songwriting, but also followed a style similar to those of their peers (including Testament, Vio-lence, Dark Angel and Sacred Reich), with lyrics exploring political and social themes mixed with humor, and horror and nuclear war topics. Their band name was inspired from the Sam Raimi horror film The Evil Dead.\n",
      "In [YEAR], the band signed a recording contract with the European label Steamhammer Records and released Rise Above (a 3-track EP featuring the songs [SONG_NAME] and the title track which is a cover version of the Black Flag song) in the following year. They followed it up with their debut full-length album Annihilation of Civilization (also released in [YEAR]) to rave reviews. A music video was released for the title track, and it received airplay on MTV's Headbangers Ball.\n"
   ]
}