{
   "Band members": {
      "Current lineup": {},
      "Former members": {},
      "Timeline": {}
   },
   "Discography": {
      "EPs": {},
      "Live albums": {},
      "Studio albums": {}
   },
   "History": {
      "Cancelled third album and breakup (1993–2007)": {
         "text": [
            "Following The Underworld tour, Evildead went on an extended hiatus. The band headed back into the studio in 1993 to begin work on a third album, and wrote several new songs including \"Humano\", \"Immortal\" and \"Dia de los Muertos\", which also appear on the band's 1994 demo tape Terror[3] and would be recorded again for the only Terror album Hijos de los Cometas (1997).[4] However, the album was left unfinished and Evildead soon broke up.\n",
            "After the split, Karlos Medina, and Juan Garcia reformed Agent Steel, but still played together with ex-Evildead member Danny Flores, and Rigo Amezcua in a band called Terror, which has one full-length album; with all songs in Spanish that was released on BMG in Mexico; which is not out of print. Former drummer Joe Montelongo, although in the band for a short time, played on the European tour and is on the live release. He went on to play with MX Machine and East L.A. punk band The Brat.\n"
         ]
      },
      "First reunion (2008–2012)": {
         "text": [
            "In 2008, Evildead announced that they would reunite in the summer of 2009 for shows. They also began rehearsals for the Thrasho De Mayo event that was held in Los Angeles in May, 2010. The band also performed at the \"Way of Darkness Festival\" in Germany later that year. The current line up features new vocalist, Steve Nelson (Winterthrall, Noctuary), Rob Alaniz (original drummer), Albert Gonzalez (original guitarist), Mel Sanchez (original bassist), and Juan Garcia (original guitarist).\n",
            "By May 2011, Evildead had been writing new material for their what would be their third studio album.[5] In addition, they posted a new track called \"Blasphemy Divine\", which was produced by George Pajon and is available for free download. The new album would have been Evildead's first album since 1991's The Underworld and the first new music from the band since writing and demoing songs for an unreleased album in 1993-1994. It would also have been the first Evildead album to feature the return of Albert Gonzalez on guitar, Mel Sánchez on bass and Rob Alaniz on drums since 1989's Annihilation of Civilization as well as Steve Nelson's debut album with the band.\n",
            "Despite their plans to record a new studio album, it was announced on October 17, 2012 that Evildead had disbanded once again.[6]\n"
         ]
      },
      "Formation and first two albums (1986–1992)": {
         "text": [
            "Evildead was formed in 1986, initially as a side-project of Agent Steel guitarist Juan Garcia and Abattoir bassist Mel Sanchez,[2] with the intention to write heavy music with more hardcore and thrash metal elements, more so than their bands at the time. Evildead paved new ground with their ferocious approach to songwriting, but also followed a style similar to those of their peers (including Testament, Vio-lence, Dark Angel and Sacred Reich), with lyrics exploring political and social themes mixed with humor, and horror and nuclear war topics. Their band name was inspired from the Sam Raimi horror film The Evil Dead.\n",
            "In 1988, the band signed a recording contract with the European label Steamhammer Records and released Rise Above (a 3-track EP featuring the songs \"Sloe-Death\", \"Run Again\" and the title track which is a cover version of the Black Flag song) in the following year. They followed it up with their debut full-length album Annihilation of Civilization (also released in 1989) to rave reviews. A music video was released for the title track, and it received airplay on MTV's Headbangers Ball.\n",
            "In 1990, the band returned to the studio to record their second album with producer Warren Croyle, The Underworld, which was released in the following year. The album was not as successful as Annihilation of Civilization. They released a live album taken from the tour, Live...From The Depths of The Underworld, in 1992, but was their last release due to the grunge movement that was emerging at that time, which was displacing many forms of 1980s heavy metal and hard rock in America.\n"
         ]
      },
      "Second reunion (2016–present)": {
         "text": [
            "Evildead reunited once again for a one-off show on March 12, 2016 at the Love/Hate Rock Bar in Los Angeles, in celebration of the 50th birthday of drummer Rob Alaniz.[7]\n",
            "In June 2016, Evildead confirmed that they were active once more. They also announced that they were recording new material, and planning to play some shows in 2017.[8]\n",
            "By August 2017, Evildead had been in the studio finishing four tracks for the upcoming third album, which was being produced by Bill Metoyer.[9][10] On September 23, 2017, the band premiered their first song in 26 years, \"Word of God\", on Los Anarchy Radio.[10] Six days later, the band played their first show since reuniting the year before at the Union Club in Los Angeles.[11] On February 11, 2018, Evildead announced on their Facebook page that their third album was \"coming soon.\"[12] The album, entitled United $tate$ of Anarchy, was released on October 30, 2020.[13]\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and first two albums (1986–1992)",
      "1.2 Cancelled third album and breakup (1993–2007)",
      "1.3 First reunion (2008–2012)",
      "1.4 Second reunion (2016–present)",
      "2 Band members",
      "2.1 Current lineup",
      "2.2 Former members",
      "2.3 Timeline",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Live albums",
      "3.3 EPs",
      "4 References"
   ],
   "Summary": {
      "text": [
         "Evildead is an American thrash metal band formed in Los Angeles in 1986. The band was originally composed of members of two former bands, Agent Steel and Abattoir, including guitarist Juan Garcia, who is their only remaining original member. During their initial nine-year run, Evildead released only two studio albums: Annihilation of Civilization (1989) and The Underworld (1991). Although their commercial success was limited, their music is still highly regarded amongst metal fans. Evildead was plagued by extended inactivity due to lineup changes and problems with making a follow-up to The Underworld. This resulted in their official breakup in 1995. After a short-lived reunion from 2008 to 2012, the band reformed once again in 2016, and released their third studio album United $tate$ of Anarchy, their first in 29 years, on October 30, 2020.[1]\n"
      ]
   },
   "Title": "Evildead - Wikipedia"
}