{
   "Name": "The Exies",
   "Sections": [
      "1 History",
      "1.1 Inertia",
      "1.2 Head for the Door",
      "1.3 A Modern Way of Living with the Truth",
      "2 Band members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Exies were an American rock band from Los Angeles, California, formed in 1997. Their name, \"The Exies\", is short for \"The Existentialists\". Their two Virgin Records releases, Inertia (2003) and Head for the Door (2004), have sold over 400,000 copies combined.\n"
      ]
   },
   "History": {
      "Inertia": {
         "text": [
            "In 2002 the band signed to Virgin Records and in January 2003 they released their second album, Inertia. The album received wide distribution, and their first single, \"My Goddess\", received a fair amount of radio play and was featured in the PlayStation 2 game, Splashdown: Rides Gone Wild. The song \"Without\" was featured on the soundtrack for EA Sports MVP Baseball 2003.\n",
            "The Exies continued touring in 2003 in support of Inertia, with \"My Goddess\" being performed on the Late Show with David Letterman and peaking at No. 12 on Modern Rock chart. The video for \"My Goddess\", filmed by Diane Martel, became a top 10 hit on MTV2.\n",
            "Inertia is The Exies' most successful album, reaching # 115 on the Billboard 200.[1]\n"
         ]
      },
      "Head for the Door": {
         "text": [
            "In June 2004, The Exies headed back into the studio with producer Nick Raskulinecz. Their third album Head for the Door was released in  December 2004. The album's first single, \"Ugly\", was used by World Wrestling Entertainment as the theme song for that year's Survivor Series 2004 pay-per-view event in November 2004, and was featured in a commercial for the Warner Bros. television network. The song \"Slow Drain\" was featured in the video game NFL Street 2, which was released on the Xbox and PlayStation 2 consoles. The band promoted the album by opening for Velvet Revolver on their first arena tour.\n",
            "Along with Sum 41 and Silvertide, The Exies supported Mötley Crüe on their Carnival of Sins Tour.\n",
            "Their second single from Head for the Door, \"Hey You\", is part of the PlayStation 2 video game, Guitar Hero, released in 2005. It is also part of the Xbox 360 game Guitar Hero II via download through Xbox Live, along with Guitar Hero: Smash Hits on various consoles.\n",
            "The song \"What You Deserve\" was also featured in the game Juiced.\n",
            "The song \"Slow Drain\" was also featured in the games NFL Street 2, and the PlayStation 3 version of Full Auto 2.\n"
         ]
      },
      "A Modern Way of Living with the Truth": {
         "text": [
            "After returning from the tour with Mötley Crüe, Virgin decided to release the Exies from their contract. Soon after this, Dennis Wolfe and David Walsh left the band to pursue other goals. This left Stevens and Herrera alone, and decided to reunite with former guitarist Chris Skane and began writing songs. On 26 May 2006, the band announced on its blog that they were returning to the studio with producer James Michael to work on their fourth album. The album, A Modern Way of Living with the Truth, was released 15 May 2007 by Eleven Seven Music, the band's new label.\n",
            "To promote the album the band toured with Buckcherry, Papa Roach, and Hinder. This was followed by a tour with rock band Smile Empty Soul throughout the summer of 2007.  After those shows, they toured with Drowning Pool for the This is for the Soldiers Tour. The band released five songs on MySpace and radio from A Modern Way of Living with the Truth: \"Different Than You\", \"Once in a Lifetime\", \"These Are the Days\", \"This Is the Sound\", and \"A Fear of Being Alone\". On June 28, The Exies released a music video for the song \"God We Look Good (Going Down in Flames)\", a song that was left off the album.\n",
            "In 2008, The Exies re-released A Modern Way of Living with the Truth on iTunes with five extra tracks. \"God We Look Good (Going Down in Flames)\" was included along with acoustic versions of \"My Goddess\", \"Ugly\", \"Genius\", and \"Tired of You\". Their song \"Lay Your Money Down\" was featured in the video game, WWE SmackDown! vs. Raw 2009.\n",
            "In 2008, internet rumors circulated that Scott Stevens was suffering from drug addiction. Stevens denied the drug abuse hearsay, and joked about the rumors during press interviews.[2] In June, the Exies completed The Cage-Rattle Most Wanted Tour with Nu-metal band, Nonpoint. In October that year, they began a tour with TRUSTcompany.\n",
            "In 2011 Scott Stevens co-wrote songs with Theory of a Deadman on their new CD The Truth Is..., David Cook on his new album This Loud Morning and Halestorm's new album The Strange Case Of...\n"
         ]
      },
      "text": [
         "The Exies formed in 1997 when singer and guitarist Scott Stevens drafted bassist Freddy Herrera and drummer Thom Sullivan to form a new group. Stevens' friend Chris Skane played guitar in an early incarnation of The Exies, but left citing other priorities. Skane was then replaced by guitarist David Walsh.\n",
         "Stevens picked the name \"The Exies\" from a John Lennon biography, stating on Rockline (11/9/2002) that it was the only Beatles-related name left that was not taken. When the Beatles were touring around Hamburg, Germany in the 1960s, they encountered three distinct social groups among the kids: the mods, the rockers, and the art students (who referred to themselves as \"the existentialists\"). John Lennon coined the term \"the exies\" to refer to the art students.\n",
         "The band released their self-titled debut album in 2000 on Ultimatum Records, and toured extensively. While touring, they caught the attention of Grammy-winning record producer, Matt Serletic, who bought their contract from the indie label they were on.\n",
         "Thom Sullivan and The Exies parted ways in September 2000, and Dennis Wolfe joined the band. a few months later, one of their songs is featured on the animated series Gary & Mike. The majority of 2001 and early 2002 was spent writing and recording. The band began touring in August 2002.\n"
      ]
   },
   "Band members": {
      "text": [
         "\n",
         "\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Exies were an American rock band from Los Angeles, California, formed in 1997. Their name, \"The Exies\", is short for \"The Existentialists\". Their two Virgin Records releases, Inertia (2003) and Head for the Door (2004), have sold over 400,000 copies combined.\n",
      "The Exies formed in 1997 when singer and guitarist Scott Stevens drafted bassist Freddy Herrera and drummer Thom Sullivan to form a new group. Stevens' friend Chris Skane played guitar in an early incarnation of The Exies, but left citing other priorities. Skane was then replaced by guitarist David Walsh.\n",
      "Stevens picked the name \"The Exies\" from a John Lennon biography, stating on Rockline (11/9/2002) that it was the only Beatles-related name left that was not taken. When the Beatles were touring around Hamburg, Germany in the 1960s, they encountered three distinct social groups among the kids: the mods, the rockers, and the art students (who referred to themselves as \"the existentialists\"). John Lennon coined the term \"the exies\" to refer to the art students.\n",
      "The band released their self-titled debut album in 2000 on Ultimatum Records, and toured extensively. While touring, they caught the attention of Grammy-winning record producer, Matt Serletic, who bought their contract from the indie label they were on.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Post-grunge",
         "alternative rock",
         "hard rock",
         "alternative metal"
      ],
      "Years active": [
         "1997–2010"
      ],
      "Labels": [
         "Ultimatum",
         "Virgin",
         "Eleven Seven"
      ],
      "Associated acts": [
         "Everclear"
      ],
      "Past members": [
         "Scott Stevens",
         "Freddy Herrera",
         "Chris Skane",
         "Isaac Carpenter",
         "Thom Sullivan",
         "David Walsh",
         "Dennis Wolfe",
         "Hoss Wright"
      ]
   }
}