{
   "Name": "Family of the Year",
   "Sections": [
      "1 Origins of members",
      "2 Career",
      "3 Discography",
      "4 Appearances in popular media",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Family of the Year is an American indie rock band based in Los Angeles, California. It consists of members Joseph Keefe (vocals/guitar), Sebastian Keefe (drums/vocals), James Buckey (guitar/vocals), and Christina Schroeter (keyboard/vocals). Their music uses melodic male/female vocal harmonies and folktale-style lyrics. Their 2012 song \"Hero\" was featured in Richard Linklater's 2014 film Boyhood and became a top 10 hit in Austria, Belgium, Germany, and Switzerland.\n"
      ]
   },
   "Origins of members": {
      "text": [
         "Though Family of the Year is currently based in Los Angeles, California, brothers Joseph and Sebastian Keefe were born in Massachusetts, spent their teenage years in Wales, and eventually moved to Martha's Vineyard. James Buckey is from  Jacksonville, Florida, while Christina Schroeter is from Orange County, California.[2] Prior to forming Family of the Year, members Joseph Keefe and Sebastian Keefe enjoyed local Boston success in previous bands  Unbusted and The Billionaires.[3]\n"
      ]
   },
   "Career": {
      "text": [
         "Family of the Year self-released their debut EP Where's the Sun on their Washashore imprint in September 2009. The EP includes \"Let's Go Down\", \"Castoff\", \"Summer Girl\", \"What a Surprise\", and \"Psyche or Like Scope\".\n",
         "In October 2009, they were picked out of 700 artists by Ben Folds and Keith Lockhart to open for Ben and The Boston Pops at Symphony Hall. Shortly after, the band flew west for California shows with Bell X1 before returning east for the CMJ Music Marathon, marking Family of the Year's New York debut. SPIN selected the band as one of 25 Must-Hear Artists from the 2009 CMJ Festival.[4] In November 2009, they hit the road with Edward Sharpe and The Magnetic Zeros in support of their debut album, Songbook.\n",
         "In November 2009, the band released their debut full-length album titled Songbook.\n",
         "In January 2010, the band announced the release of an exclusive song for every month of that year through their e-mail list and followed that with the digital release of their second EP Through the Trees on March 9 under their own imprint, Washashore Records.\n",
         "Family of the Year has been recognized for independent fundraising. Donation-based sales for the band's first EP Where's the Sun helped fund the recording of their debut LP Songbook, and the band has funded touring through online merchandise sales of items like postcards.\n",
         "In July 2012, the band released their second album Loma Vista with Nettwerk Records, produced by Wally Gagel. With the release, the band has been included in a number of emerging artist features on MTV,[5] USA Today,[2] Entertainment Weekly,[6] Paste,[7] Billboard,[8] Amazon,[9] KCRW,[10] and Interview.[11] The album peaked at #35 on Billboard's Top Heatseekers Chart.[12]\n",
         "With their second single, \"Hero\", Family of the Year has made a run of late-night TV appearances on shows including The Tonight Show with Jay Leno, Jimmy Kimmel Live!, Conan, and two episodes of Last Call with Carson Daly. The single peaked at #12 on the Billboard Alternative Songs Chart.[13] At radio, \"Hero\" reached #1 on the Triple A Top 30 Radio Chart and Top 15 at Alternative Radio.[14] The song was prominently used in Richard Linklater's Oscar-nominated 2014 film Boyhood.\n",
         "The group has shared the stage with a variety of artists, including fun., Mumford & Sons, Edward Sharpe and the Magnetic Zeros, Walk the Moon, Good Old War, Grouplove, Atlas Genius and others. With their first headline tour of 2013, the band sold-out shows across the country, including New York, Chicago, Philadelphia, Minneapolis, Indianapolis, Nashville, Denver, Portland and more. Often joining them on the road is touring bassist Alex Walker.[15]\n",
         "On June 8, 2015, the band released the lead single \"Make You Mine\" from its self-titled album, which itself was released on September 4, 2015. Pretty Much Amazing called the record \"broad and accessible\".[16]\n",
         "The band has been a mainstay of summer festivals, including Lollapalooza, Summerfest, Downsview, BottleRock Napa Valley, Guinness Oyster & Music Festival, Launch Sacramento, Mariposa Folk Festival, Red Rocks Amphitheatre, and others.\n",
         "In April 2019, the band announced that their planned North American tour was cancelled \"[d]ue to personal circumstances beyond our control...\"[17]\n"
      ]
   },
   "Discography": {},
   "Appearances in popular media": {
      "text": [
         "Sebastian Keefe and Joseph Keefe appeared in a scene of the non-scripted dramatic feature Hurricane Emma (a.k.a. I'm on Fire), directed by Alex Cassun and starring former Family of the Year bandmate Vanessa Long. James Buckey also worked on the movie, engineering the ADR recording.[19]\n",
         "An uncredited use of their song \"Chugjug\" from Songbook in an American TV commercial for Advil brought the band to wide attention[20] according to the comments for the song on YouTube.\n",
         "The group's song \"Hero\" was used in the 2012 motion picture Thanks for Sharing and the trailers for the 2014 film Boyhood, as well as during the film itself. Additionally, it has been featured in several television appearances, including Girls, Underemployed, World of Jenks, Couples Therapy, Degrassi: The Next Generation, the 2014 Korean drama It's Okay, That's Love, and the Chinese web series Addicted.\n",
         "The song \"Buried\" is featured on Being Human.[21] The song \"The Stairs\" is featured on Suburgatory,[22] and the song \"Find It\" has been featured on Emily Owens, M.D. and World of Jenks.[23]\n",
         "The song \"Carry Me\" premiered on Girls, season 4 season finale, episode 10 \"Home Birth.\"[24] It also featured throughout the 2018 Korean drama Live.[25]\n",
         "The song \"Everytime\" is featured in season 8 episode 13 of Weeds.[26]\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Family of the Year is an American indie rock band based in Los Angeles, California. It consists of members Joseph Keefe (vocals/guitar), Sebastian Keefe (drums/vocals), James Buckey (guitar/vocals), and Christina Schroeter (keyboard/vocals). Their music uses melodic male/female vocal harmonies and folktale-style lyrics. Their 2012 song \"Hero\" was featured in Richard Linklater's 2014 film Boyhood and became a top 10 hit in Austria, Belgium, Germany, and Switzerland.\n",
      "Though Family of the Year is currently based in Los Angeles, California, brothers Joseph and Sebastian Keefe were born in Massachusetts, spent their teenage years in Wales, and eventually moved to Martha's Vineyard. James Buckey is from  Jacksonville, Florida, while Christina Schroeter is from Orange County, California.[2] Prior to forming Family of the Year, members Joseph Keefe and Sebastian Keefe enjoyed local Boston success in previous bands  Unbusted and The Billionaires.[3]\n",
      "Family of the Year self-released their debut EP Where's the Sun on their Washashore imprint in September 2009. The EP includes \"Let's Go Down\", \"Castoff\", \"Summer Girl\", \"What a Surprise\", and \"Psyche or Like Scope\".\n",
      "In October 2009, they were picked out of 700 artists by Ben Folds and Keith Lockhart to open for Ben and The Boston Pops at Symphony Hall. Shortly after, the band flew west for California shows with Bell X1 before returning east for the CMJ Music Marathon, marking Family of the Year's New York debut. SPIN selected the band as one of 25 Must-Hear Artists from the 2009 CMJ Festival.[4] In November 2009, they hit the road with Edward Sharpe and The Magnetic Zeros in support of their debut album, Songbook.\n"
   ]
}