{
   "Name": "Faster Pussycat",
   "rawData": [
      "Faster Pussycat is an American rock band from Los Angeles, California, formed in 1985 by vocalist Taime Downe, guitarists Brent Muscat and Greg Steele and bassist Kelly Nickels. The group has since gone through numerous lineup changes leaving Downe as the only constant member. They broke up in 1993, but reformed in 2001. Faster Pussycat has released four studio albums to date: Faster Pussycat (1987), Wake Me When It's Over (1989), Whipped! (1992) and The Power and the Glory Hole (2006). They were one of the most successful hard rock bands of the late 1980s and early 1990s, having sold over two million records worldwide.\n",
      "Faster Pussycat was formed in Hollywood by Taime Downe during the glam metal and glam punk boom of the 1980s. The earliest incarnation of the band featured Downe and Greg Steele along with Brent Muscat. The name of the band is derived from the Russ Meyer film Faster, Pussycat! Kill! Kill!.\n",
      "After multiple early personnel changes, Faster Pussycat consisted of Downe (vocals), Steele (guitar), Muscat (guitar), Kelly Nickels (bass) and Mark Michals (drums).\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Hard rock",
         "glam metal",
         "glam punk",
         "industrial rock (later)"
      ],
      "Years active": [
         "1985–1993, 2001–present"
      ],
      "Labels": [
         "Elektra"
      ],
      "Associated acts": [
         "The Newlydeads, Sin City Sinners, LA Guns, Motochrist"
      ],
      "Members": [
         "Taime Downe",
         "Xristian Simon",
         "Danny Nordahl",
         "Chad Stewart",
         "Ace Von Johnson"
      ],
      "Past members": [
         "Brent Muscat",
         "Greg Steele",
         "Mark Michals",
         "Kelly Nickels",
         "Eric Stacy",
         "Brett Bradshaw",
         "Sam Bam Koltun",
         "Aaron Abellira",
         " Dish"
      ]
   },
   "albums": [
      "Front Row for the Donkey Show"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Los Angeles, California, formed in [YEAR] by vocalist Taime Downe, guitarists Brent Muscat and [PERSON_NAME_FULL_0_MALE] and bassist Kelly Nickels. The group has since gone through numerous lineup changes leaving Downe as the only constant member. They broke up in [YEAR], but reformed in [YEAR]. [BAND_NAME] has released four studio albums to date: [BAND_NAME] ([YEAR]), Wake Me When It's Over ([YEAR]), Whipped! ([YEAR]) and The Power and the Glory Hole ([YEAR]). They were one of the most successful hard rock bands of the late [YEAR]s and early [YEAR]s, having sold over two million records worldwide.\n",
      "[BAND_NAME] was formed in Hollywood by Taime Downe during the glam metal and glam punk boom of the [YEAR]s. The earliest incarnation of the band featured Downe and Greg Steele along with [PERSON_NAME_FULL_0_MALE]. The name of the band is derived from the Russ Meyer film Faster, Pussycat! Kill! Kill!.\n",
      "After multiple early personnel changes, [BAND_NAME] consisted of Downe (vocals), Steele (guitar), Muscat (guitar), Kelly Nickels (bass) and [MONTH]k Michals (drums).\n"
   ]
}