{
   "Name": "Vernian Process",
   "rawData": [
      "Vernian Process is an avant-garde band formed in San Francisco in 2003.  Taking its name from the works of 19th century author Jules Verne, Vernian Process is a band that creates music themed around Victorian scientific romance and its modern counterpart steampunk. Their sound is a fusion of modern and old-world styles including gothic-rock darkwave, progressive rock, neoclassical, trip hop, ragtime, and other related genres.  The band consists of vocalist Joshua A. Pfeiffer, and multi-instrumentalists Martín Irigoyen, Steven Farrell, and Vincent Van Veen.\n",
      "Pfeiffer began working on music under the name Vernian Process in the winter of 2003. He released a number of downloadable albums over the next 4 years, including 2004's Discovery and  2006's The Forgotten Age, before being approached by Irigoyen about joining forces to work on Behold the Machine.  From that point forward, Vernian Process evolved beyond a solo project.  Throughout 2009, as work on the album progressed, Vernian Process sought out additional members in order to play shows to support the upcoming release of Behold the Machine, as well as record new material for future albums.  \n",
      "Behold the Machine was released on October 1, 2010.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Steampunk, neoclassical dark wave, dark ambient (early), industrial, gothic rock, avant-garde"
      ],
      "Years active": [
         "2003–present"
      ],
      "Labels": [
         "None"
      ],
      "Associated acts": [
         "Unwoman, Profondo Delle Tenebre, Unextraordinary Gentlemen"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Joshua Pfeiffer",
         "Martín Irigoyen",
         "Brian Figueroa",
         "Vincent Van Veen",
         "Steven Farrell"
      ],
      "Past members": [
         "Janus Zarate (2009-2014)",
         "Eugene Dyer III (2011-2013)",
         "Kyle Thomas (2010-2012)",
         "Heather Yager (2009-2011)",
         "Free Fargo (2009-2011)",
         "Ash Brodbeck (2009-2010)",
         "Vincent Ho (2009)"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in San Francisco in [YEAR].  Taking its name from the works of 19th century author [MONTH]es Verne, [BAND_NAME] is a band that creates music themed around Victorian scientific romance and its modern counterpart steampunk. Their sound is a fusion of modern and old-world styles including gothic-rock darkwave, progressive rock, neoclassical, trip hop, ragtime, and other related genres.  The band consists of vocalist Joshua A. Pfeiffer, and multi-instrumentalists [MONTH]tín Irigoyen, Steven Farrell, and [PERSON_NAME_FULL_0_MALE].\n",
      "Pfeiffer began working on music under the name [BAND_NAME] in the winter of [YEAR]. He released a number of downloadable albums over the next 4 years, including [YEAR]'s Discovery and  [YEAR]'s The Forgotten Age, before being approached by Irigoyen about joining forces to work on Behold the Machine.  From that point forward, [BAND_NAME] evolved beyond a solo project.  Throughout [YEAR], as work on the album progressed, [BAND_NAME] sought out additional members in order to play shows to support the upcoming release of Behold the Machine, as well as record new material for future albums.  \n",
      "Behold the Machine was released on [MONTH] 1, [YEAR].\n"
   ]
}