{
   "Name": "Fear (band)",
   "Sections": [
      "1 History",
      "1.1 1970s",
      "1.2 1980s",
      "1.3 1990s",
      "1.4 2000 – present",
      "2 Band members",
      "3 Timeline",
      "4 Discography",
      "5 Influence",
      "6 In popular culture",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Fear, stylized as FEAR, is an American punk rock band from Los Angeles, California, formed in 1977. The band is credited for helping to shape the sound and style of Californian hardcore punk.[1] The group gained national prominence after an infamous 1981 performance on Saturday Night Live.\n",
         "Frontman Lee Ving has been the band's only constant member. Since its formation, the band has gone through various lineup changes, and at one point even featured Flea of the Red Hot Chili Peppers on bass. The classic FEAR lineup existed from 1978 to 1982, and was composed of Ving, guitarist Philo Cramer, bassist Derf Scratch and drummer Spit Stix.\n"
      ]
   },
   "History": {
      "1970s": {
         "text": [
            "Fear was formed in 1977 by singer/guitarist Lee Ving and bassist Derf Scratch, who recruited guitarist Burt Good and drummer Johnny Backbeat. In 1978, Fear released the single \"I Love Livin' in the City\". Shortly after this, Good and Backbeat left the band and were replaced by Philo Cramer and Spit Stix.\n"
         ]
      },
      "1980s": {
         "text": [
            "Film director Penelope Spheeris met Ving and Stix while they were hanging handbills on telephone poles in Los Angeles on Laurel Canyon Boulevard. After a brief discussion, she asked if they wanted to be in a documentary about the Los Angeles punk scene,[2] The Decline of Western Civilization (1981). In the film, Fear performed a set in which they baited members of the audience with personal attacks, sexist and homophobic slurs, and offbeat humor, inspiring some audience members to come on stage to fight them. At the time, Spheeris was married to Slash Records president Bob Biggs who, later that year, signed a recording deal with Fear.\n",
            "Spheeris's documentary brought the band to the attention of John Belushi, who lobbied successfully to get the band a spot as a musical guest on the 1981 Halloween episode of his former show Saturday Night Live. Belushi had originally offered Fear the soundtrack for his major motion picture Neighbors. The film's producers eventually forced Fear off the project, and Belushi got them the infamous SNL gig as compensation. The band's appearance included a group of slamdancers, among them Belushi, Ian MacKaye of Minor Threat (and later Fugazi), Tesco Vee of the Meatmen, Harley Flanagan and John Joseph of the Cro-Mags, and John Brannon of Negative Approach. The show's director originally wanted to prevent the dancers from participating, so Belushi offered to be in the episode if the dancers were allowed to stay.[2] The end result was the shortening of Fear's appearance on TV. They started their second song by saying, \"It's great to be in New Jersey\", drawing boos from SNL's New York live audience. Fear played \"I Don't Care About You\", \"Beef Bologna\", \"New York's Alright If You Like Saxophones\", and started to play \"Let's Have a War\" when the telecast faded into commercial. The slamdancers left ripe pumpkin remains on the set. Cameras, a piano and other property were damaged. After their SNL appearance, which resulted in $20,000 in damage, some clubs chose not to hire the band.[3][4]\n",
            "Fear also appeared in the 1981 rotoscope animated film American Pop, directed by Ralph Bakshi. Ving performed under the name Lee James Jude.[5]\n",
            "Additionally that year, Josie Cotton released the hit song \"Johnny Are You Queer\". The song was based on Fear's song \"Fetch me One More Beer\", written by Philo Cramer and John Clancy.[6] Bobby and Larson Paine, who were managing The Go-Gos, re-worked the song with new lyrics and gave it to them, but after a falling out forbid the band from playing it and gave it to Cotton.[7] In several interviews Cotton has suggested that the song's title was lifted from lyrics in the Fear song,[8][9] though she has also stated that Fear's version of it went “You're a fuckin’ queer”,[7] which is consistent with Fear's demo of the song.[10][11]\n",
            "When Fear found out a variation of their song had become popular, a meeting regarding the publishing rights of the song was arranged between them and the Paines. The two sides decided the winner of a coin toss would get the publishing rights to the song, which the Paines won.[12]\n",
            "In 1982, Fear released their debut album The Record. After touring in support of the album, Ving fired Scratch. Eric Feldman (of Captain Beefheart, Pere Ubu, and later PJ Harvey and Frank Black) briefly filled in on bass before he was replaced by Flea. Flea left the band and was replaced by Lorenzo Buhne. On July 3, 1983, Fear performed at the \"Rock Against Reagan\" protest concert at the Lincoln Memorial in Washington, D.C. along with the Dead Kennedys, MDC, Toxic Reasons, the Crucifucks and others. In the summer of 1983 through early 1984, while Stix was touring Europe with Nina Hagen, Chuck Biscuits was supposed to replace him, but Stix returned and Biscuits never played any shows with Fear.[13] With Ving producing, the band recorded their second album More Beer in 1985 in just two days, supposedly. However, according to a representative from Enigma Records, it took a full year, as quoted in a March 1986 issue of Spin.[14]\n"
         ]
      },
      "1990s": {
         "text": [
            "Live...For the Record, a live album of a 1985 performance, was released in 1991. Shortly afterwards, bassist Will \"Sluggo\" MacGregor was hired. After 1991–93 North American tours, Fear disbanded. Cramer and Stix left the band, citing disputes with Ving over finances, his right wing beliefs, and his lack of empathy. For the next two years, Ving performed in Austin, Texas as Lee Ving's Army. This eventually became the new Fear lineup, including Ving backed by LVA members Sean Cruse (guitar), Scott Thunes (bass) and Andrew Jamiez (drums). In 1995, Fear released the Have Another Beer with Fear album, followed by American Beer (2000), which featured Ving and Jamiez along with new members Richard Presley and Mando Lopez. The album included new recordings of several previously unreleased older Fear songs, as well as some new compositions. Richard Presley and Mando Lopez then began playing with Kim Deal and Kelley Deal in the Breeders.\n"
         ]
      },
      "2000 – present": {
         "text": [
            "Fear (with Ving as the only original member) performed in the annual Warped Tour in 2008, and at South by Southwest in 2012.[15]\n",
            "A re-recording of 1982's The Record was released in late 2012.[16]\n",
            "In 2018, the band reunited with Cramer and Stix, and added former AFI bassist Geoff Kresge and former Viva Hate guitarist Eric Razo.[17]\n"
         ]
      }
   },
   "Band members": {
      "text": [
         "Current\n",
         "Former\n",
         "Drums\n",
         "Bass\n",
         "Lead guitar\n"
      ]
   },
   "Timeline": {},
   "Discography": {
      "text": [
         "Studio albums\n",
         "Singles and EPs\n",
         "Live albums\n",
         "Soundtrack compilation appearances\n"
      ]
   },
   "Influence": {
      "text": [
         "Fear has influenced a number of bands who have paid tribute to the band by covering its songs.\n"
      ]
   },
   "In popular culture": {
      "text": [
         "Fear's music has also been featured in several video game soundtracks. \"I Love Livin' in the City\" appeared in The Warriors \"SLC Punk\" and Tony Hawk's Underground 2, and \"The Mouth Don't Stop (The Trouble with Women Is)\" appeared in Grand Theft Auto V, on the fictional punk rock radio station, \"Channel X\".\n",
         "The band, specifically Spit, also appear in the Brett Easton Ellis novel Less Than Zero.\n",
         "In the 1987 film Summer Camp Nightmare, the inter-camp talent show includes a performance of \"Beef Bologna\" which upsets Chuck Connors' straitlaced camp director.\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Fear, stylized as FEAR, is an American punk rock band from Los Angeles, California, formed in 1977. The band is credited for helping to shape the sound and style of Californian hardcore punk.[1] The group gained national prominence after an infamous 1981 performance on Saturday Night Live.\n",
      "Frontman Lee Ving has been the band's only constant member. Since its formation, the band has gone through various lineup changes, and at one point even featured Flea of the Red Hot Chili Peppers on bass. The classic FEAR lineup existed from 1978 to 1982, and was composed of Ving, guitarist Philo Cramer, bassist Derf Scratch and drummer Spit Stix.\n",
      "Fear was formed in 1977 by singer/guitarist Lee Ving and bassist Derf Scratch, who recruited guitarist Burt Good and drummer Johnny Backbeat. In 1978, Fear released the single \"I Love Livin' in the City\". Shortly after this, Good and Backbeat left the band and were replaced by Philo Cramer and Spit Stix.\n",
      "Film director Penelope Spheeris met Ving and Stix while they were hanging handbills on telephone poles in Los Angeles on Laurel Canyon Boulevard. After a brief discussion, she asked if they wanted to be in a documentary about the Los Angeles punk scene,[2] The Decline of Western Civilization (1981). In the film, Fear performed a set in which they baited members of the audience with personal attacks, sexist and homophobic slurs, and offbeat humor, inspiring some audience members to come on stage to fight them. At the time, Spheeris was married to Slash Records president Bob Biggs who, later that year, signed a recording deal with Fear.\n"
   ]
}