{
   "Discography": {
      "Compilation appearances": {
         "text": [
            "Valley Girl Soundtrack\nYear: 1983\nTracks: The Fanatic\nLabel: Rhino/WEA\nCatalog#:\nFormats: CD, CS\n",
            "Richard Blade's Flashback Favorites, Vol. 3\nYear: 1994\nTracks: The Fanatic\nLabel: Oglio Records\nCatalog#:\nFormats: CD, CS\n",
            "Just Can't Get Enough: New Wave Hits of the '80s, Vol. 11\nYear: 1995\nTracks: The Fanatic\nLabel: Rhino/WEA\nCatalog #:\nFormats: CD, CS\n",
            "Alternative 80's Hits\nYear: 1998\nTracks: The Fanatic\nLabel: Rhino\nCatalog #:\nFormats: CD\n"
         ]
      },
      "Television appearances": {
         "text": [
            "American Bandstand[4]\nFirst Aired: Saturday April 30, 1983\nTracks: The Fanatic, What a Way to Go\nEpisode Number: 2534\nSeason Number: 26\n"
         ]
      },
      "text": [
         "\"Gangsters of Rock\" from Graduation Day (1981)\n",
         "\"The Fanatic\"\nYear: 1983\nTracks: The Fanatic/The Girl Ain't Straight\nLabel: Rock 'n' Roll\nCatalog #: 3497\nFormats: 7\", 12\"\n",
         "The Fanatic\nYear: 1983\nTracks: 1. The Fanatic, 2. No Room in Heaven, 3. One Step, 4. Positively Negative, 5. Aggravated Man, 6. What a Way to Go, 7. Kristine, 8. The Girl Ain't Straight, 9. Teaser, 10. 666 Beware.\nLabel: Rock 'n' Roll\nCatalog #: 38453\nFormats: LP, CS, CD\n",
         "\"Pied Piper\"\nYear: 1983\nTracks: Pied Piper (long), Pied Piper (short)\nLabel: Rock 'n' Roll\nCatalog #: 04220\nFormats: 7\"\n",
         "\"Kristine\"\nYear: 1983\nTracks: Kristine, Kristine\nLabel: Rock 'n' Roll\nCatalog #: 03999\nFormats: 7\"\n",
         "Catalog #: Q-999\nFormats: LP, CD\n"
      ]
   },
   "External links": {},
   "History": {
      "text": [
         "Before Felony, Jeffrey Spry had been the singer with Detroit Proto-Punk/Hard rock legends, Ron Asheton (of Iggy & The Stooges) and Dennis \"Machine Gun\" Thompson (of The MC5) in a short lived super-group (based in Los Angeles) that was called \"The New Order\" (preceding the English new wave group of the same name).[citation needed] Jeff was in the band in 1975 and recorded an album with them that was released in 1977.\n",
         "After a period playing shows and making music business connections in the Los Angeles scene, Felony appeared in the horror b-movie Graduation Day (1981), playing their song \"Gangsters of Rock.\" [1] Soon after, they signed with producers/managers Don Rubin, formerly of pop group The Ivy Three, and Artie Kornfeld.\n[2] Live shows mixed by sound engineer Steve Sands, who is  also credited as second engineer on the debut album “The Fanatic”\n",
         "Felony went into the studio and emerged with single \"The Fanatic,\" which became a hit on Los Angeles radio station KROQ-FM with help from program director Rick Carroll.[citation needed] The song peaked at No. 42 on the Billboard Hot 100 in early 1983. It became a key track in the development of the Modern Rock radio format. \"The Fanatic\" was included in the influential 1983 Valley Girl soundtrack, which also featured Modern English's \"I Melt With You\". Felony also performed the track on American Bandstand.[1] A video was made from \"The Fanatic\" \"The Fanatic\" video was shot in Hollywood, California, in 1983 and aired on MTV. The Fanatic video includes a cameo of Jeffrey Spry with his first wife, SAG actress, Lucrecia Sarita Russo.\n",
         "The band, which now included Jeffrey on lead vocals, Joe on guitar, Danny Sands on piano/keyboards, Louis Ruiz on bass and Arty Blea on drums, recorded their first full-length album, also called The Fanatic, which was released in 1983 on Scotti Brothers Records with distribution by CBS Records. It included the single and nine other tracks that helped define the trendy-but-never-huge power-pop new wave sound of the early 1980s.[citation needed]\n",
         "Felony's second single was 1983's \"The Pied Piper,\" which producer Kornfeld had written with Steve Duboff in the 1960s and which had been a hit for Crispian St. Peters and Cher. \"Kristine\" from The Fanatic was also a single in 1983.\n",
         "The band recorded songs including \"All the King's Horses\" and \"She's My Little Girl\" for a second album on Scotti Brothers that never materialized. The original chemistry was never recaptured, and in 1985 EM-HI released Felony's sophomore effort The Vigilante, which featured a more traditional rock sound. The title track got a lot of radio play and was number two in the KROQ Top 106.7 Countdown of 1985.\" [3] The Vigilante also featured the track \"I'm No Animal,\" which appeared on the soundtrack of 1986's Friday the 13th Part VI: Jason Lives.\n",
         "Towards the end of 1991 Felony released their final album, In the Name of Rock-n-Roll on the Q9 label. Jeffrey Scott Spry committed suicide on March 9, 1992.[citation needed] March 10, 1992 was the re-release of the Fanatic. Joe formed his latest band, Kanawormz, with bass player John Avila of Oingo Boingo fame, from the ashes of Felony. Most of Kanawormz band resides in Hollywood Ca. AKA Shigletown, CA. and are currently recording their third full-length CD.[citation needed]\n",
         "\"The Fanatic\" was featured in the 2011 film \"Take Me Home Tonight\".\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Compilation appearances",
      "2.2 Television appearances",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Felony was an American new wave and rock band formed in Los Angeles, California, in the early 1970s by brothers Jeffrey Scott Spry (Lead Vocals), Joseph Anthony Spry (Guitars and Vocals), and brothers Danny Sands (Piano and Keyboards) and Steve Sands (Sound Engineer).\n"
      ]
   },
   "Title": "Felony (band) - Wikipedia"
}