{
   "Name": "Femme Fatale (band)",
   "Sections": [
      "1 Biography",
      "1.1 Formation and disbandment (1987–1990)",
      "1.2 Post breakup (1990–2013)",
      "1.3 All-female lineup (2013–2019)",
      "2 Band members",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Singles",
      "3.3 Other appearances",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Femme Fatale was an American hard rock band. Originally from Albuquerque, the band moved to Los Angeles and released one studio album before disbanding. Lead vocalist, Lorraine Lewis, restarted the band in 2013 with an all-female line-up which lasted until 2019 when she shuttered the band to join Vixen.\n"
      ]
   },
   "Biography": {
      "Formation and disbandment (1987–1990)": {
         "text": [
            "Femme Fatale was formed in 1987 in Albuquerque, New Mexico, United States.[2] Later on that year, the band moved to Los Angeles and signed a recording contract with MCA Records after a well-received showcase.[2] The band's self-titled debut album, released in 1988,[2] peaked at No. 141 on the Billboard 200 the following year. MTV gave heavy airplay to the videos  for \"Waiting for the Big One\" and \"Falling in and out of Love\" (not the same song as the Lita Ford one of the same name), the band's two signature songs. The airplay helped the album to sell nearly 225,000 copies, but Femme Fatale was unable to match the popularity of other bands in the glam metal scene. The band saw their status at MCA shrink and the band's manager, Andrea Accardo, developed a rare brain cancer. Shortly after touring the world in support of Cheap Trick, recording was to commence on a new studio album, but ultimately it was not completed and the band dissolved in 1990.[2]\n"
         ]
      },
      "Post breakup (1990–2013)": {
         "text": [
            "Since leaving Femme Fatale, Lorraine Lewis recorded a few modestly successful solo albums in country, new-age, and other rock genres.[3] Lewis competed on MTV's Remote Control in 1988, against Britny Fox's Dizzy Dean Davidson and Anthrax's Charlie Benante, who won.[4]\n",
            "Guitarist Mazzi Rawd left the music industry and went on to get his PhD in Physics.[5]\n",
            "Guitarist Bill D'Angelo died of a heart attack in 2005, aged 43. The Albuquerque Tribune reported on March 26, 2006, that D'Angelo's death was due to methamphetamine misuse.[6]\n",
            "In later years, satellite radio and VH1 Classic gave the band's two signature songs a new life, with display on VH1 Classic's Metal Mania and the two main satellite networks' 1980s-themed stations.\n"
         ]
      },
      "All-female lineup (2013–2019)": {
         "text": [
            "In 2013 Lorraine Lewis reformed the band with a new line-up consisting of Courtney Cox and Nita Strauss on guitars, Janis Tanaka on bass, Katt Scarlett on keyboards, and both Rachael Rine and Athena on drums.\n",
            "In 2016, Femme Fatale signed with Nashville, Tennessee-based company FnA Records to release their long-shelved second album under the title One More for the Road.[7] This album featured recordings dating between 1989-1990 that were originally intended to be the band's followup to their 1988 debut before being dropped by their record label. It eventually became the band's last album of new material.\n",
            "In January 2019, Lewis was named as the new vocalist for another all-female band, Vixen,[8] Femme Fatale's contemporaries during the glam metal heyday. She succeeded Janet Gardner, who stepped down to give more priority to her budding solo career. Lewis had earlier stood in for Gardner in Oklahoma during a March 2018 performance.[9] After Femme Fatale played their show at the 2019 Monsters of Rock Cruise in late February,[10] the band quietly disbanded for good. They never recorded any song in studios as an all-female group.\n"
         ]
      }
   },
   "Band members": {},
   "Discography": {
      "Studio albums": {},
      "Singles": {},
      "Other appearances": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Femme Fatale was an American hard rock band. Originally from Albuquerque, the band moved to Los Angeles and released one studio album before disbanding. Lead vocalist, Lorraine Lewis, restarted the band in 2013 with an all-female line-up which lasted until 2019 when she shuttered the band to join Vixen.\n",
      "Femme Fatale was formed in 1987 in Albuquerque, New Mexico, United States.[2] Later on that year, the band moved to Los Angeles and signed a recording contract with MCA Records after a well-received showcase.[2] The band's self-titled debut album, released in 1988,[2] peaked at No. 141 on the Billboard 200 the following year. MTV gave heavy airplay to the videos  for \"Waiting for the Big One\" and \"Falling in and out of Love\" (not the same song as the Lita Ford one of the same name), the band's two signature songs. The airplay helped the album to sell nearly 225,000 copies, but Femme Fatale was unable to match the popularity of other bands in the glam metal scene. The band saw their status at MCA shrink and the band's manager, Andrea Accardo, developed a rare brain cancer. Shortly after touring the world in support of Cheap Trick, recording was to commence on a new studio album, but ultimately it was not completed and the band dissolved in 1990.[2]\n",
      "Since leaving Femme Fatale, Lorraine Lewis recorded a few modestly successful solo albums in country, new-age, and other rock genres.[3] Lewis competed on MTV's Remote Control in 1988, against Britny Fox's Dizzy Dean Davidson and Anthrax's Charlie Benante, who won.[4]\n",
      "Guitarist Mazzi Rawd left the music industry and went on to get his PhD in Physics.[5]\n"
   ]
}