{
   "Name": "Fidlar",
   "rawData": [
      "Fidlar, stylized as FIDLAR, is an American punk rock band from Los Angeles.\n",
      "Founding members Zac Carper and Elvis Kuehn met while working at a recording studio in which Carper was employed as an engineer and Kuehn was an intern. The two started recording songs when the studio was empty and posting the finished products online. Three years after recording their first songs, they stepped on stage together with The Black Lips and went on tour with The Hives.\n",
      "In 2011, they released their debut EP, DIYDUI, produced by Lewis Pesacov. In 2012, FIDLAR were named one of Stereogum's 40 Best New Bands of 2012. In October 2012, the band made their television debut on Last Call with Carson Daly, where they performed \"Whore\" and \"No Waves\" from their then-upcoming album FIDLAR.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California"
      ],
      "Genres": [
         "Punk rock",
         "garage punk",
         "surf punk",
         "skate punk"
      ],
      "Years active": [
         "2009–present"
      ],
      "Labels": [
         "Mom + Pop",
         "Wichita",
         "Dine Alone"
      ],
      "Associated acts": [
         "Los Bolos",
         "The Diffs",
         "Headhunters",
         "Kitten",
         "Rooney",
         "The Small Wigs",
         "The Squirmers",
         "DJ Basil",
         "SWMRS",
         "The Frights"
      ],
      "Website": [
         "fidlarmusic.com"
      ],
      "Members": [
         "Zac Carper",
         "Brandon Schwartzel",
         "Elvis Kuehn",
         "Max Kuehn"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME], stylized as FIDLAR, is an [GENRE] band from Los Angeles.\n",
      "Founding members Zac Carper and [PERSON_NAME_FULL_0_MALE] met while working at a [GENRE] an engineer and [PERSON_NAME_LAST_0] was an intern. The two started recording songs when the studio was empty and posting the finished products online. Three years after recording their first songs, they stepped on stage together with The Black Lips and went on tour with The Hives.\n",
      "In [YEAR], they released their debut EP, DIYDUI, produced by Lewis Pesacov. In [YEAR], FIDLAR were named one of Stereogum's 40 Best New Bands of [YEAR]. In [MONTH] [YEAR], the band made their television debut on Last Call with [PERSON_NAME_FULL_0_MALE], where they performed [SONG_NAME] from their then-upcoming album FIDLAR.\n"
   ]
}