{
   "Name": "Fishbone",
   "rawData": [
      "Fishbone is an American rock band formed in 1979 in Los Angeles, California, which plays a fusion of ska, punk, funk, metal, reggae, and soul. AllMusic has described the group as \"one of the most distinctive and eclectic alternative rock bands of the late '80s. With their hyperactive, self-conscious diversity, goofy sense of humor, and sharp social commentary, the group gained a sizable cult following yet they were never able to earn a mainstream audience.\"\n",
      "Fishbone first assembled in 1979 with John Norwood Fisher (bass), his brother Philip \"Fish\" Fisher (drums), Angelo Moore (vocals, saxophones and theremin), Kendall Jones (guitar), \"Dirty\" Walter A. Kibby II (vocals, trumpet), and Christopher Dowd (keyboards, trombone, vocals). They achieved their greatest success in the late 1980s and early 1990s, after which they went through many personnel changes. From 2003 to 2010, John Norwood Fisher and Angelo Moore were the last remaining original members of the band. In the 2010s, all the other original members except Kendall Jones rejoined the band for various reunions and anniversary activities. In November 2020, Kendall Jones joined the band on stage for the first time since 1993 for a performance of \"Them Bones\" by Alice In Chains for a tribute to the band arranged by the Museum of Pop Culture.\n",
      "Fishbone got started in 1979 as a \"disparate, all-black oddball crew\" when the members were in junior high school. The Fisher brothers, Jones, Dowd, and Kibby were all from South Central Los Angeles and were included in a school busing program that sent them daily to the San Fernando Valley, where they met Moore, who was native to the area. After first using the name Megatron with Titus Norris on vocals, the sextet adopted the name Fishbone and formed a unique stew of different styles that became popular in the Los Angeles club scene and was a great influence on several subsequent alternative bands. Their first club date was at Madame Wong's, the influential venue in Los Angeles's Chinatown that had been a showcase for a variety of seminal punk bands in the 1980s. They formed strong friendships with Los Angeles bands like Red Hot Chili Peppers, Thelonious Monster, and Psi Com. Fishbone were signed to Columbia Records in 1983 after being spotted at a club gig by Brian O'Neal of The BusBoys. Their first release was the 1985 single \"Party at Ground Zero\", followed by a self-titled EP, Fishbone produced by David Kahne. In 1987, in support of their first full-length album, In Your Face, the band performed \"Jamaica Ska\" in the Annette Funicello/Frankie Avalon reunion movie Back to the Beach. Fishbone's first major international tour was as the opening act for Beastie Boys on the 1987 Licensed to Ill tour.\n"
   ],
   "infobox": {
      "Also known as": [
         "Fishbone & Familyhood Nextperience"
      ],
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Alternative rock[1]",
         "funk rock[2]",
         "funk metal[3]",
         "ska punk[4]"
      ],
      "Years active": [
         "1979–present"
      ],
      "Labels": [
         "Columbia, DC-Jam Records, Rowdy, Hollywood, High Times Records,  Sound In Color, Nuttsactor 5"
      ],
      "Associated acts": [
         "Suicidal Tendencies, Year of the Dragon, Dirty Walt & The Columbus Sanitation, Trulio Disgracias, Dr. Madd Vibe, The Seedy Arkhestra, The Soul of John Black"
      ],
      "Website": [
         "fishbone.net"
      ],
      "Members": [
         "Angelo Moore",
         "John Norwood Fisher",
         "Walter A. Kibby II",
         "Philip \"Fish\" Fisher",
         "Christopher Dowd ",
         " Mark Phillips "
      ],
      "Past members": [
         "Kendall Jones",
         "Spacey T",
         "Anthony Brewster",
         "Dion Murdock ",
         "Tori Ruffin",
         "Andre´ \"PaDre\" Holmes",
         "Curtis Storey",
         "John McKnight",
         "Dre Gipson",
         "Freddie Flint",
         "John Steward",
         "Rocky George",
         "Jay Armant",
         "Paul Hampton",
         "John Bigham"
      ]
   },
   "albums": [
      "In Your Face",
      "Truth and Soul",
      "Billboard",
      "The Reality of My Surroundings",
      "Billboard",
      "Give a Monkey a Brain and He'll Swear He's the Center of the Universe",
      "Billboard",
      "Chim Chim's Badass Revenge",
      "Billboard",
      "Fishbone and the Familyhood Nextperience Present: The Psychotic Friends Nuttwerx",
      "Still Stuck in Your Throat"
   ]
}