{
   "Name": "Fishbone",
   "Sections": [
      "1 History",
      "1.1 Early career (1979–1987)",
      "1.2 Rise to fame (1988–1994)",
      "1.3 Post-Sony years (1995–2002)",
      "1.4 Recent history (2003–present)",
      "2 Film and television appearances",
      "3 Members",
      "3.1 Current",
      "3.2 Past",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Live albums",
      "4.3 Compilation albums",
      "4.4 EPs",
      "4.5 Singles",
      "4.6 Music videos",
      "4.7 DVDs",
      "4.8 Appearances on soundtracks and \"various artists\" compilations",
      "4.9 Guest appearances",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Fishbone is an American rock band formed in 1979 in Los Angeles, California, which plays a fusion of ska, punk, funk, metal, reggae, and soul. AllMusic has described the group as \"one of the most distinctive and eclectic alternative rock bands of the late '80s. With their hyperactive, self-conscious diversity, goofy sense of humor, and sharp social commentary, the group gained a sizable cult following yet they were never able to earn a mainstream audience.\"[5]\n",
         "Fishbone first assembled in 1979 with John Norwood Fisher (bass), his brother Philip \"Fish\" Fisher (drums), Angelo Moore (vocals, saxophones and theremin), Kendall Jones (guitar), \"Dirty\" Walter A. Kibby II (vocals, trumpet), and Christopher Dowd (keyboards, trombone, vocals). They achieved their greatest success in the late 1980s and early 1990s, after which they went through many personnel changes. From 2003 to 2010, John Norwood Fisher and Angelo Moore were the last remaining original members of the band. In the 2010s, all the other original members except Kendall Jones rejoined the band for various reunions and anniversary activities. In November 2020, Kendall Jones joined the band on stage for the first time since 1993 for a performance of \"Them Bones\" by Alice In Chains for a tribute to the band arranged by the Museum of Pop Culture.\n"
      ]
   },
   "History": {
      "Early career (1979–1987)": {
         "text": [
            "Fishbone got started in 1979 as a \"disparate, all-black oddball crew\" when the members were in junior high school. The Fisher brothers, Jones, Dowd, and Kibby were all from South Central Los Angeles[6] and were included in a school busing program that sent them daily to the San Fernando Valley, where they met Moore, who was native to the area. After first using the name Megatron with Titus Norris on vocals, the sextet adopted the name Fishbone and formed a unique stew of different styles that became popular in the Los Angeles club scene and was a great influence on several subsequent alternative bands.[7] Their first club date was at Madame Wong's, the influential venue in Los Angeles's Chinatown that had been a showcase for a variety of seminal punk bands in the 1980s.[8] They formed strong friendships with Los Angeles bands like Red Hot Chili Peppers, Thelonious Monster, and Psi Com.[9] Fishbone were signed to Columbia Records in 1983 after being spotted at a club gig by Brian O'Neal of The BusBoys.[8] Their first release was the 1985 single \"Party at Ground Zero\",[10] followed by a self-titled EP, Fishbone produced by David Kahne.[8] In 1987, in support of their first full-length album, In Your Face, the band performed \"Jamaica Ska\" in the Annette Funicello/Frankie Avalon reunion movie Back to the Beach. Fishbone's first major international tour was as the opening act for Beastie Boys on the 1987 Licensed to Ill tour.[11]\n"
         ]
      },
      "Rise to fame (1988–1994)": {
         "text": [
            "Fishbone was mostly considered to be a ska and funk band in their early years, but later became more guitar-driven with a focus on rock and soul music.[12] The 1988 album Truth and Soul brought Fishbone wide critical acclaim.[13][14] With this album, the band also added left-leaning social commentary to their lyrics, covering important topics such as the breakup of families, early 1990s racism, fascism, nuclear war, and oppression in lower income housing projects. The album was highlighted by a hard rock-inspired version of Curtis Mayfield's classic \"Freddie's Dead\" from the film Super Fly. The music video, directed by Douglas Gayeton, became the band's first hit on MTV. That same year, the group toured with Red Hot Chili Peppers and became nationally known in the burgeoning alternative music scene.[15] Also that year, Fishbone and Little Richard recorded the Lead Belly song \"Rock Island Line\" for the tribute album Folkways: A Vision Shared.\n",
            "The band added former Miles Davis sideman John Bigham[10] on guitar and keyboards in 1989. The 1991 album The Reality of My Surroundings was a critical and commercial success, reaching #49 on the Billboard albums chart.[16] One month before the album's release, the group played a performance on Saturday Night Live of \"Sunless Saturday,\" a song which later featured an MTV video directed by Spike Lee. The song \"Everyday Sunshine\" also became a modest hit on radio and MTV.\n",
            "While the band retained their roots in funk and ska, the 1993 album Give a Monkey a Brain and He'll Swear He's the Center of the Universe included songs with free jazz, hard rock, punk, and heavy metal elements.[10] At the time of the album's release, the band began to tear apart internally. Just before Fishbone joined the 1993 Lollapalooza tour, guitarist Kendall Jones was accused of mental instability and quit the band, moving to Northern California. Bassist John Norwood Fisher tracked Jones down in the belief that he needed rescue from a religious group, only to be charged with attempted kidnapping; Fisher was acquitted at trial.[17] A benefit concert to help with Fisher's legal expenses featured Porno for Pyros, Primus, Tool, and Alice in Chains.[10] Keyboardist Christopher Dowd left Fishbone in 1994 and released an album titled Puzzle in 1997 under the name The Seedy Arkhestra, with various guests including Jeff Buckley and N'Dea Davenport. The album included an anti-Fishbone song called \"Flog Your Dead Horse.\"[citation needed]\n"
         ]
      },
      "Post-Sony years (1995–2002)": {
         "text": [
            "Now a five-piece, Fishbone was dropped by Sony Records (formerly Columbia) in 1995, upon presenting their next album. The band added more heavy metal and hardcore punk influences to their sound on the 1996 concept album Chim Chim's Badass Revenge, released by Rowdy Records and produced by Dallas Austin. The album went largely unnoticed by the general public, peaking at just #158 on the Billboard albums chart.[18] In 1996, the band contributed to the AIDS benefit album Silencio=Muerte: Red Hot + Latin produced by the Red Hot Organization. In 1998 the band lost another founding member, drummer Philip \"Fish\" Fisher, who became a session drummer and later appeared in the heavy metal band Wicked Wisdom. After brief periods with various drummers, the position was filled definitively by John Steward. John Bigham also left the band during this period to pursue his own career, later founding the band The Soul of John Black; Bigham was replaced by former Sound Barrier and Mother's Finest guitarist Tracey \"Spacey T\" Singleton.  Keyboardist and horn player Anthony Brewster (The Untouchables) was a member of the group from 1997 to 1998, while John McKnight (from Ben Harper's band) joined on keyboards, trombone, and guitar. During the latter part of the 1990s, Fishbone was without a recording contract and earned their keep through constant touring.\n",
            "Fishbone maintained their dedicated fan base and achieved another major record deal with Hollywood Records in 2000. They were given the chance to record a new album with several special guests, including H.R. of Bad Brains, Gwen Stefani, George Clinton, Rick James, Donny Osmond, and Los Fabulosos Cadillacs. The resulting album, Fishbone and the Familyhood Nextperience Present: The Psychotic Friends Nuttwerx, saw poor sales, though AllMusic called it the band's best album in a decade.[19] The band was dropped from Hollywood Records and headed back on the road. John McKnight left the band in 2001, and the group continued on as a five-piece. In 2002, on their own independent record label, they released Live at the Temple Bar and More which contained all new songs recorded live throughout 2001 and 2002. This was later complemented by a live CD/DVD, Live in Amsterdam, containing most of their hits and filmed at the 2002 Cannabis Cup Festival in Amsterdam, Netherlands.\n"
         ]
      },
      "Recent history (2003–present)": {
         "text": [
            "In late 2003 Fishbone lost another founding member when Walter Kibby left the band. Guitarist Tracy Singleton departed as well. After leaving Fishbone, Kibby released two albums with his band Dirty Walt & The Columbus Sanitation: To Put It Bluntly (2000) and Still Smokin' (2009). Kibby and Singleton also collaborated in the band Year of the Dragon, releasing the albums A Time to Love Is a Time to Bleed (2006) and Blunt Force Karma (2009). Together, they also recorded tracks with Swade G (Kibby's younger brother Wade Antonio Kibby) for the album Ghetto Life (2010).\n",
            "After the 2003 departure of Kibby and Singleton, the last two founding members John Norwood Fisher and Angelo Moore, along with drummer John Steward, restarted Fishbone with Rocky George of Suicidal Tendencies and Tori Ruffin of The Time on guitars (though Ruffin left soon thereafter), and Dre Gipson on keyboards. In 2005 John McKnight returned on trombone and guitar. Trumpet players during this period were PaDre Holmes, Fernando Pullum, Mervin Campbell, and Curtis Storey. The line-up of Fisher, Moore, Steward, George, Gipson, Storey, and McKnight recorded the studio album Still Stuck in Your Throat with producer David Kahne, who had worked on the band's early albums. The album was released in October 2006 in Europe, and in April 2007 in the United States. Music videos were recorded for the cover song \"Date Rape\" by Sublime, and for the song \"Let Dem Ho's Fight.\"\n",
            "In 2008 and 2009, departed original members Walter Kibby, Christopher Dowd, and Kendall Jones joined Fishbone on stage on various occasions,[citation needed] most notably for the shoot of the Pepsi \"Pass\" commercial, which aired in January 2009.[citation needed] In April 2008, Stephan Kraemer directed the shoot of a live CD/DVD recorded in Bordeaux, France. The DVD Fishbone Live was released on May 10, 2009.\n",
            "In January 2010, John McKnight left Fishbone for the second time. During this period original member Walter Kibby returned on trumpet and vocals. During a 2011 tour, Tom \"Tom-Bone\" Ralls, formerly of Weapon of Choice, filled in on trombone. Tori Ruffin also briefly returned to play guitar in place of Rocky George, who was unable to tour. After the tour, Jay Armant, a former student of Fernando Pullum, joined as the new trombone player. Fishbone released a seven-track EP titled Crazy Glue on October 11, 2011.\n",
            "Current and former members of the band were deeply involved in the making of the documentary film Everyday Sunshine: The Story of Fishbone,[20] directed by Lev Anderson and Chris Metzler.  Narrated by Laurence Fishburne and featuring interviews with Les Claypool, Gwen Stefani, Flea, Branford Marsalis, George Clinton, Ice-T, and Gogol Bordello, the film debuted at the Los Angeles Film Festival on June 19, 2010.  The film has screened at more than 100 film festivals in twenty countries, winning 12 awards for Best Documentary.  One of the top-reviewed documentaries of 2011–2012, the film has a certified fresh ranking of 100% on RottenTomatoes.com and was nominated for a Golden Tomato Award.  The film was rolled out in United States theaters nationwide with bookings in over seventy-five cities, including extended runs in New York, Los Angeles and San Francisco, plus week-long engagements in 20+ cities including Chicago, Boston, Seattle, Portland, Detroit, New Orleans, Baltimore, and Kansas City.  A DVD was released by The Cinema Guild on February 21, 2012 and received a national TV broadcast on the public television series AfroPoP.\n",
            "In February 2013, keyboardist Dre Gipson left the band after nine years to focus on a new project called Hunter Green. Fishbone was in the midst of a US tour, and reggae musician Freddie Flint filled in temporarily on keyboards. In July 2013, Paul Hampton (formerly of The Skeletones) joined as Fishbone's new keyboardist. In February 2014, federal judge Jan E. DuBois ruled that Fishbone had to pay $1.4 million to a woman who suffered a fractured skull and collarbone during a 2010 concert in Philadelphia when Angelo Moore stage-dove and landed on top of her.[21][22] A five-track EP titled Intrinsically Intertwined was released on April 22, 2014.[23]\n",
            "On November 18, 2016 founding member and original drummer Philip \"Fish\" Fisher played his first show with the band since his departure in 1998. On November 26, Fishbone performed at a Jimi Hendrix tribute concert at Harlem's Apollo Theater, at which time drummer John Steward departed Fishbone after 18 years to make room for the returning Fish.[24] In January 2017 the band announced a tour to commemorate the 1996 album Chim Chim's Badass Revenge. Former guitarist John Bigham returned to the band, after which Rocky George departed after 14 years of service. In late 2017 Moore, Kibby, and John Norwood Fisher were featured in the song \"Creatures of Habit\" by funk-rock supergroup The Big Ol’ Nasty Getdown.[25] In January 2018, Christopher Dowd made a guest appearance with the band onstage and decided to rejoin, thus replacing both trombonist Jay Armant and keyboardist Paul Hampton.[26] The band's 2018 lineup consisted of Angelo Moore, John Norwood Fisher, Fish, Walter Kibby, Christopher Dowd, and John Bigham, thus recreating the classic Fishbone lineup minus Kendall Jones. In December 2019, John Bigham announced on his personal social media that he was no longer playing with Fishbone to focus on his solo work. Guitarist Mark Phillips joined the band shortly after.[27] In November 2020, Kendall Jones joined the band on stage for the first time since 1993 for a performance of \"Them Bones\" by Alice In Chains for a tribute to the band arranged by the Museum of Pop Culture.\n"
         ]
      }
   },
   "Film and television appearances": {},
   "Members": {
      "Current": {},
      "Past": {}
   },
   "Discography": {
      "Studio albums": {},
      "Live albums": {},
      "Compilation albums": {},
      "EPs": {},
      "Singles": {},
      "Music videos": {},
      "DVDs": {},
      "Appearances on soundtracks and \"various artists\" compilations": {},
      "Guest appearances": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Fishbone is an American rock band formed in 1979 in Los Angeles, California, which plays a fusion of ska, punk, funk, metal, reggae, and soul. AllMusic has described the group as \"one of the most distinctive and eclectic alternative rock bands of the late '80s. With their hyperactive, self-conscious diversity, goofy sense of humor, and sharp social commentary, the group gained a sizable cult following yet they were never able to earn a mainstream audience.\"[5]\n",
      "Fishbone first assembled in 1979 with John Norwood Fisher (bass), his brother Philip \"Fish\" Fisher (drums), Angelo Moore (vocals, saxophones and theremin), Kendall Jones (guitar), \"Dirty\" Walter A. Kibby II (vocals, trumpet), and Christopher Dowd (keyboards, trombone, vocals). They achieved their greatest success in the late 1980s and early 1990s, after which they went through many personnel changes. From 2003 to 2010, John Norwood Fisher and Angelo Moore were the last remaining original members of the band. In the 2010s, all the other original members except Kendall Jones rejoined the band for various reunions and anniversary activities. In November 2020, Kendall Jones joined the band on stage for the first time since 1993 for a performance of \"Them Bones\" by Alice In Chains for a tribute to the band arranged by the Museum of Pop Culture.\n",
      "Fishbone got started in 1979 as a \"disparate, all-black oddball crew\" when the members were in junior high school. The Fisher brothers, Jones, Dowd, and Kibby were all from South Central Los Angeles[6] and were included in a school busing program that sent them daily to the San Fernando Valley, where they met Moore, who was native to the area. After first using the name Megatron with Titus Norris on vocals, the sextet adopted the name Fishbone and formed a unique stew of different styles that became popular in the Los Angeles club scene and was a great influence on several subsequent alternative bands.[7] Their first club date was at Madame Wong's, the influential venue in Los Angeles's Chinatown that had been a showcase for a variety of seminal punk bands in the 1980s.[8] They formed strong friendships with Los Angeles bands like Red Hot Chili Peppers, Thelonious Monster, and Psi Com.[9] Fishbone were signed to Columbia Records in 1983 after being spotted at a club gig by Brian O'Neal of The BusBoys.[8] Their first release was the 1985 single \"Party at Ground Zero\",[10] followed by a self-titled EP, Fishbone produced by David Kahne.[8] In 1987, in support of their first full-length album, In Your Face, the band performed \"Jamaica Ska\" in the Annette Funicello/Frankie Avalon reunion movie Back to the Beach. Fishbone's first major international tour was as the opening act for Beastie Boys on the 1987 Licensed to Ill tour.[11]\n",
      "Fishbone was mostly considered to be a ska and funk band in their early years, but later became more guitar-driven with a focus on rock and soul music.[12] The 1988 album Truth and Soul brought Fishbone wide critical acclaim.[13][14] With this album, the band also added left-leaning social commentary to their lyrics, covering important topics such as the breakup of families, early 1990s racism, fascism, nuclear war, and oppression in lower income housing projects. The album was highlighted by a hard rock-inspired version of Curtis Mayfield's classic \"Freddie's Dead\" from the film Super Fly. The music video, directed by Douglas Gayeton, became the band's first hit on MTV. That same year, the group toured with Red Hot Chili Peppers and became nationally known in the burgeoning alternative music scene.[15] Also that year, Fishbone and Little Richard recorded the Lead Belly song \"Rock Island Line\" for the tribute album Folkways: A Vision Shared.\n"
   ],
   "infobox": {
      "Also known as": [
         "Fishbone & Familyhood Nextperience"
      ],
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Alternative rock[1]",
         "funk rock[2]",
         "funk metal[3]",
         "ska punk[4]"
      ],
      "Years active": [
         "1979–present"
      ],
      "Labels": [
         "Columbia, DC-Jam Records, Rowdy, Hollywood, High Times Records,  Sound In Color, Nuttsactor 5"
      ],
      "Associated acts": [
         "Suicidal Tendencies, Year of the Dragon, Dirty Walt & The Columbus Sanitation, Trulio Disgracias, Dr. Madd Vibe, The Seedy Arkhestra, The Soul of John Black"
      ],
      "Website": [
         "fishbone.net"
      ],
      "Members": [
         "Angelo Moore",
         "John Norwood Fisher",
         "Walter A. Kibby II",
         "Philip \"Fish\" Fisher",
         "Christopher Dowd ",
         " Mark Phillips "
      ],
      "Past members": [
         "Kendall Jones",
         "Spacey T",
         "Anthony Brewster",
         "Dion Murdock ",
         "Tori Ruffin",
         "Andre´ \"PaDre\" Holmes",
         "Curtis Storey",
         "John McKnight",
         "Dre Gipson",
         "Freddie Flint",
         "John Steward",
         "Rocky George",
         "Jay Armant",
         "Paul Hampton",
         "John Bigham"
      ]
   }
}