{
   "Name": "The Flesh Eaters",
   "Sections": [
      "1 History",
      "1.1 Formation",
      "1.2 Recording history",
      "1.3 Permanent lineup",
      "1.4 1990 relaunch",
      "2 See also",
      "3 Discography",
      "4 Videography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Flesh Eaters are an American punk rock band, formed in Los Angeles, California, United States, in 1977. They are the most prominent of the bands which have showcased the compositions and singing of their founder, punk poet Chris Desjardins, best known as \nChris D. While Desjardins is the group's only continual member, the Flesh Eaters' lineup has drawn from some of the most famous bands of the L.A. punk scene, such as the Plugz, X, the Blasters, and Los Lobos.\n",
         "The band's greatest success was in the early 1980s. Though a part of that era's productive punk rock scene, their music was distinctive for its apocalyptic film noir lyricism and often for its sophisticated arrangements, as heard, for example, on 1981's A Minute to Pray, a Second to Die. Desjardins's poetry has been described as \"wonderful bleeding collages of B-movie dementia, street crime, Mexican Catholicism and Dionysian punk spurt poetics.\"[1]\n",
         "The band recently reformed with the classic 1981 lineup of Chris Desjardins (Chris D.), Dave Alvin, John Doe, Bill Bateman, Steve Berlin and D.J. Bonebrake and announced a new album I Used To Be Pretty that was released January 18, 2019 on Yep Roc Records.  The band will begin tour in support of the new record starting in January 2019.[2]\n",
         "Billboard (magazine) premiered the video for the band's first single from I Used To Be Pretty, a cover of The Sonics \"Cinderella\" on October 9, 2018.[3]\n"
      ]
   },
   "History": {
      "Formation": {
         "text": [
            "The Flesh Eaters were started in the fall of 1977 by punk poet Chris Desjardins,[4] a singer known for morbid lyrical themes,[5] as an experimental side-project featuring temporary performers from other major Los Angeles area bands, including John Curry, Dennis Walsh, and Scott Lasken of the Flyboys, Tito Larriva of the Plugz,  Stan Ridgway of Wall of Voodoo, John Doe and drummer DJ Bonebrake of X, Dave Alvin and Bill Bateman of the Blasters, and Steve Berlin of the Blasters and of Los Lobos.\n",
            "The band's sound was an amalgam of punk rock, road-house blues, rockabilly, and jazz as Chris Desjardins noted in 1982:\n",
            "\n\"The one thing that we do that mystifies our audience is we don't play in one category. The music that we play is real loud. It's real metallic and Punk with Rockabilly. It could be described as what was 1977 punk. We're not like a slam type or thrasher band.... There's lots of influences. There's a lot of Rock n Roll, Rockabilly and country western influences in it, a lot of music just sounds big, but a lot of melodies.\"[6]",
            "Their first gig was on December 21, 1977, at the Masque in Los Angeles, California.[citation needed]\n"
         ]
      },
      "Recording history": {
         "text": [
            "The first release by The Flesh Eaters was the 1978 7-inch EP entitled Flesh Eaters (aka Disintegration Nation). The effort was produced by Randy Stodola and Desjardins and released by Upsetter Records. Three members of the Flyboys co-wrote and performed on this first record.\n",
            "The band’s first full-length album No Questions Asked, was released in 1980, also on Upsetter. The band also weighed in with three tracks on the Upsetter compilation Tooth and Nail from 1979, along with the Germs, U.X.A., the Controllers, Negative Trend, and Middle Class. All of this early material has been reissued as bonus tracks, along with their debut EP and three previously unreleased demo recordings, on the 2004 remastered CD release of No Questions Asked on Atavistic Records.\n",
            "Their next, most acclaimed album A Minute to Pray, a Second to Die, featured a veritable supergroup of LA scene musicians, with vocalist Chris Desjardins joined by Dave Alvin (The Blasters) on guitar, John Doe (X) playing bass, Steve Berlin (Los Lobos) on saxophone, with DJ Bonebrake (X) and Bill Bateman (The Blasters) sharing percussion duties.  In his review on Allmusic, Patrick Kennedy states, “A classic album of trashy-noir darkness, seamy Hollywood dreck, campy blues horror, and Stax-influenced, stripped-down guitar punk, ... A Minute to Pray, a Second to Die truly delivers what it promises: simple, direct, roots-flavored early L.A. punk.”\n",
            "Asked about his own connection with the band in December 1983, X's John Doe recalled that he had been a long-time friend of Desjardins who had been called into temporary service:\n",
            "\n\"Chris had a whole bunch of songs, and he didn't have anybody to play 'em, and Dave and Bill from The Blasters and DJ and I had known Chris since we moved here basically... Anyway, we rehearsed it for about 2 to 3 weeks and then recorded it in two days. And luckily we had someone who...would put it out if it was okay.\"[7]"
         ]
      },
      "Permanent lineup": {
         "text": [
            "In the fall of 1981 Desjardens attempted to establish the band on a permanent basis. Following an X show on September 2, 1981, Desjardins was introduced to guitarist Don Kirk by John Doe and Exene Cervenka.[6] Kirk had played the instrument for 16 years but had never previously been part of a band.[6] Other members were soon added, including Robyn Jameson (bass) and Steve Berlin (saxophones). The group's fifth member, drummer Chris Wahl, was found through a bulletin board advertisement in an area record store called Vinyl Fetish.[6]\n",
            "Practices began in November 1981 with the first show played on December 21 of that same year.[6]\n",
            "This permanent band released the third Flesh Eaters album, Forever Came Today, on Ruby Records in 1982. This was followed with the album  A Hard Road to Follow in 1983.\n",
            "During this time they contributed a song to the Return of the Living Dead soundtrack.\n",
            "The Flesh Eaters initially broke up in 1983. However, a greatest hits album entitled Destroyed by Fire was released by SST Records in 1987 and a live album called Flesh Eaters Live was released on Homestead Records in 1988.\n"
         ]
      },
      "1990 relaunch": {
         "text": [
            "Desjardins performed with his new band, the Divine Horsemen until 1988. In 1989, Desjardins recorded an LP with the one-time group Stone By Stone. Shortly after this they changed their name back to The Flesh Eaters. They continued to perform on the west coast, and in 1990 released a second greatest hits album on SST Records entitled Prehistoric Fits – Flesh Eaters Greatest Vol. 2.\n",
            "Over the next three years, The Flesh Eaters released three more albums on SST Records: Dragstrip Riot (1991), Sex Diary of Mr. Vampire (1992) and Cruicified Lovers in Woman Hell (1993). All three of these albums were produced by Chris D and featured the musicians Wayne James, Glenn Hays, Ray Torres, Texas Terri Laird, Juanita Myers, Christian Free, Stuart Lederer, and Madonna M. During this period they also appeared on the 1991 compilation album Gabba Gabba Hey: A Tribute to the Ramones on Triple X Records.\n",
            "The Flesh Eaters discontinued performances in the spring of 1993. Since then, Desjardins has performed intermittently with a variety of musicians under this name. In 1999, the band released Ashes of Time on Upsetter Records (produced by Chris D. and Robyn Jameson).  The most recent Flesh Eaters album Miss Muerte was released in 2004 on Atavistic Records and produced by Chris D. This label has also reissued No Questions Asked and Hard Road to Follow.\n",
            "In February 2006, it was announced that the original Flesh Eaters would perform several live shows, including three shows in California and one in England. In 2019, The Flesh Eaters released I Used to be Pretty. Tim Hinely of Dagger says \"this record sounds like a natural successor to A Minute To Pray even though it was recorded nearly 40 years later.\" On several of the tracks appearing on earlier records, he says \"don't let [it] throw you off, as the band really does breathe new life into the songs that were very much alive to begin with.\"[8]\n"
         ]
      }
   },
   "See also": {},
   "Discography": {},
   "Videography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Flesh Eaters are an American punk rock band, formed in Los Angeles, California, United States, in 1977. They are the most prominent of the bands which have showcased the compositions and singing of their founder, punk poet Chris Desjardins, best known as \nChris D. While Desjardins is the group's only continual member, the Flesh Eaters' lineup has drawn from some of the most famous bands of the L.A. punk scene, such as the Plugz, X, the Blasters, and Los Lobos.\n",
      "The band's greatest success was in the early 1980s. Though a part of that era's productive punk rock scene, their music was distinctive for its apocalyptic film noir lyricism and often for its sophisticated arrangements, as heard, for example, on 1981's A Minute to Pray, a Second to Die. Desjardins's poetry has been described as \"wonderful bleeding collages of B-movie dementia, street crime, Mexican Catholicism and Dionysian punk spurt poetics.\"[1]\n",
      "The band recently reformed with the classic 1981 lineup of Chris Desjardins (Chris D.), Dave Alvin, John Doe, Bill Bateman, Steve Berlin and D.J. Bonebrake and announced a new album I Used To Be Pretty that was released January 18, 2019 on Yep Roc Records.  The band will begin tour in support of the new record starting in January 2019.[2]\n",
      "Billboard (magazine) premiered the video for the band's first single from I Used To Be Pretty, a cover of The Sonics \"Cinderella\" on October 9, 2018.[3]\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Punk rock"
      ],
      "Years active": [
         "1977–1983, 1990–1993, 1999–present"
      ],
      "Labels": [
         "Yep Roc Records, Upsetter, Slash/Ruby, Homestead, SST, Atavistic"
      ],
      "Associated acts": [
         "The Divine Horsemen, the Plugz, X, the Knitters, the Blasters, Los Lobos, Wall Of Voodoo, Bonebrake Syncopaters, The Gun Club"
      ],
      "Members": [
         "Chris D."
      ],
      "Past members": [
         "DJ Bonebrake, Dave Alvin, John Doe, Steve Berlin, Bill Bateman, Texas Terri, Wayne James, Stan Ridgway Glenn Hays, John Richey, Ray Torres, Juanita Myers, Christian Free, Stuart Lederer, Bobby Bones, Madonna M., Robert Arce, Jeff Vengance, Larry Schemel"
      ]
   }
}