{
   "Name": "The Flesh Eaters",
   "rawData": [
      "The Flesh Eaters are an American punk rock band, formed in Los Angeles, California, United States, in 1977. They are the most prominent of the bands which have showcased the compositions and singing of their founder, punk poet Chris Desjardins, best known as \nChris D. While Desjardins is the group's only continual member, the Flesh Eaters' lineup has drawn from some of the most famous bands of the L.A. punk scene, such as the Plugz, X, the Blasters, and Los Lobos.\n",
      "The band's greatest success was in the early 1980s. Though a part of that era's productive punk rock scene, their music was distinctive for its apocalyptic film noir lyricism and often for its sophisticated arrangements, as heard, for example, on 1981's A Minute to Pray, a Second to Die. Desjardins's poetry has been described as \"wonderful bleeding collages of B-movie dementia, street crime, Mexican Catholicism and Dionysian punk spurt poetics.\"\n",
      "The band recently reformed with the classic 1981 lineup of Chris Desjardins (Chris D.), Dave Alvin, John Doe, Bill Bateman, Steve Berlin and D.J. Bonebrake and announced a new album I Used To Be Pretty that was released January 18, 2019 on Yep Roc Records.  The band will begin tour in support of the new record starting in January 2019.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Punk rock"
      ],
      "Years active": [
         "1977–1983, 1990–1993, 1999–present"
      ],
      "Labels": [
         "Yep Roc Records, Upsetter, Slash/Ruby, Homestead, SST, Atavistic"
      ],
      "Associated acts": [
         "The Divine Horsemen, the Plugz, X, the Knitters, the Blasters, Los Lobos, Wall Of Voodoo, Bonebrake Syncopaters, The Gun Club"
      ],
      "Members": [
         "Chris D."
      ],
      "Past members": [
         "DJ Bonebrake, Dave Alvin, John Doe, Steve Berlin, Bill Bateman, Texas Terri, Wayne James, Stan Ridgway Glenn Hays, John Richey, Ray Torres, Juanita Myers, Christian Free, Stuart Lederer, Bobby Bones, Madonna M., Robert Arce, Jeff Vengance, Larry Schemel"
      ]
   }
}