{
   "Name": "Flogging Molly",
   "rawData": [
      "Flogging Molly is an Irish–American seven-piece Celtic punk band formed in Los Angeles in 1997. Led by Irish vocalist Dave King, formerly of the hard rock band Fastway.  They are signed to their own record label, Borstal Beat Records.\n",
      "Prior to forming Flogging Molly, Dublin-born Dave King was the lead singer for heavy metal band Fastway featuring guitarist \"Fast\" Eddie Clarke of Motörhead and bassist Pete Way of UFO in the early to mid '80s. He later fronted a hard rock band called Katmandu (1991), featuring Mandy Meyer of Krokus on guitars. Afterwards, Dave King retained a record deal with Epic Records and began to work on a solo album, but began to reconsider his record deal when the label opposed his idea of bringing in traditional Irish instruments. King negotiated out of his record deal to go his own way musically soon after.\n",
      "In 1993, King met guitarist Ted Hutt, bassist Jeff Peters, drummer Paul Crowder and violin player Bridget Regan and put together a rock band with a Celtic feel.  They began to play a mix of Irish traditional and rock.  Putting Dave's poetic lyrics to rocking melodies, they played at a Los Angeles pub called Molly Malone's weekly, building a small but loyal following. Together, they wrote songs such as \"Black Friday Rule\" and \"Selfish Man\", which was the beginning of Flogging Molly's sound. Ted and Jeff then left Flogging Molly because an earlier band of theirs, Reacharound, received a record deal.  Dave and Bridget began to find new members and the current band was formed.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Celtic punk, folk punk"
      ],
      "Years active": [
         "1997–present"
      ],
      "Labels": [
         "SideOneDummy, Burning Heart, Borstal Beat Records"
      ],
      "Website": [
         "www.floggingmolly.com"
      ],
      "Members": [
         "Dave King",
         "Bridget Regan",
         "Dennis Casey",
         "Nathen Maxwell",
         "Matt Hensley",
         "Mike Alonso",
         "Spencer Swain"
      ],
      "Past members": [
         "George Schwindt",
         "Bob Schmidt"
      ]
   }
}