{
   "Awards and nominations": {},
   "Discography": {
      "EPs": {},
      "Fort Minor Militia exclusive tracks": {
         "text": [
            "Militia is the debut studio EP for the Fort Minor's official fan club, known as the \"Fort Minor Militia\". Subscribers were given exclusive tracks for digital download that were never officially released with the exception of \"Kenji (Interview Version)\" and \"Believe Me (Club Remix)\", which were later released to Linkin Park and Styles of Beyond's official websites respectively. These tracks are sometimes referred to as the Fort Minor Militia EP.\n"
         ]
      },
      "Instrumental albums": {},
      "Mixtapes": {},
      "Music videos": {},
      "Singles": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "\"Welcome\" single (2015) and second hiatus": {
         "text": [
            "On June 21, 2015, Shinoda released a new, non-album single titled \"Welcome\".[14][15] Fort Minor also appeared as the musical guest on the TBS late-night talk show Conan on June 22, 2015.[16] No new announcement has been made and the future of Fort Minor is currently unknown. However, ever since Chester Bennington’s suicide on July 20, 2017, Shinoda has been performing Fort Minor songs as a solo act.\n",
            "Status of Fort Minor (2020)\n",
            "In September 2020, Shinoda addressed the status of Fort Minor on The Green Room with Neil Griffiths podcast, saying \"I'm Fort Minor the way Trent Reznor is Nine Inch Nails. Like, Nine Inch Nails is a group effort, but if Trent doesn't do it, it's not a thing.\"\n",
            "He added that there is \"no answer\" about what's next for Fort Minor. \"With Fort Minor I brought different people in to do different things and had some amazing features. I still believe that one of Black Thought's best verses of all time is on Right Now on the Fort Minor record and it just happens to be on my record. That would have been one my favourite verses he's ever done whether or not it was for that record.\n",
            "\"For me, there's a bit of a high bar. I don't know why.\"\n"
         ]
      },
      "Formation and The Rising Tied (2004–06)": {
         "text": [
            "Mike Shinoda joined Fort Minor as a vocalist. Shinoda uses the name Fort Minor for his collaborations with Ryan Patrick Maginn (Ryu) and Takbir Bashir (Tak), who themselves hail from the underground hip hop group Styles of Beyond.\n",
            "Shinoda began recording songs for this side project following the release of Collision Course in November 2004.[3] Fort Minor: We Major was a mixtape by Shinoda and DJ Green Lantern to promote his upcoming studio album. The Rising Tied, the debut album of Fort Minor, was released in November 2005. Robert Hales directed its first video \"Petrified\", which was released the previous month.[4] Jay-Z, who had previously collaborated with Linkin Park on the 2004 album Collision Course, was the executive producer for The Rising Tied.[5] Shinoda told Corey Moss of MTV News that he imposed on himself a requirement to play all the instruments and write all the lyrics to the album except for the strings, percussion, or choir parts.[6] \"Where'd You Go\", its fourth single, peaked at No. 4 on the Billboard Hot 100 chart, while second single, \"Remember the Name\", reached at No. 66.[7] Another track, \"Kenji\" describes the experiences of a Japanese-American family during the Japanese American internment of World War II.[8]\n",
            "Due to the success of \"Where'd You Go\" during the week of April 26, 2006, sales of The Rising Tied increased by 45 percent, and the album chart position went up 89 positions to No. 104 on the Billboard 200.\"[9] Where'd You Go\" was awarded Ringtone of the Year at the 2006 MTV Video Music Awards. In mid August 2006 Fort Minor performed at the Summer Sonic 2006 alongside Linkin Park.[10]\n",
            "The third track on the album, \"Right Now\", is featured in the trailer of The Family That Preys by Tyler Perry.[11]\n",
            "The song \"Remember the Name\"  was used in promotional TV trailers for the 2006 movie Gridiron Gang, as well as the trailer for the remake of the movie The Karate Kid, an episode in the second season of TV show Numb3rs, and the film The Smurfs 2.\n"
         ]
      },
      "Indefinite hiatus (2006–15)": {
         "text": [
            "In November 2006, Fort Minor released a video for \"Where'd You Go\". Shinoda has stated he felt the video was a nice wrap-up for Fort Minor.[11] Also in November, Shinoda stated that Fort Minor was currently on hiatus, because of his dedication to Linkin Park.\n",
            "In 2006, Skylar Grey released an exclusive version of \"Where'd You Go\" to radio stations, made by herself. Mike does not appear on this version.[12]\n",
            "In the Billboard One-hit Wonders of the 2000s, Fort Minor (along with Holly Brook and Jonah Matranga) were listed at No. 19, due to the success of \"Where'd You Go\" (since it was Fort Minor's only single that reached the top 25).[13] In an LPU Chat in early 2012, Mike Shinoda said there is a possibility for a new Fort Minor album after Linkin Park's sixth studio album, which was planned for release in 2014. In October 2013, on the Nick Catchdubs remix of Linkin Park's \"Skin to Bone\", Ryu from Styles of Beyond stated that Fort Minor's mission isn't over, hinting at a second studio album.\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and The Rising Tied (2004–06)",
      "1.2 Indefinite hiatus (2006–15)",
      "1.3 \"Welcome\" single (2015) and second hiatus",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Mixtapes",
      "2.3 EPs",
      "2.4 Instrumental albums",
      "2.5 Singles",
      "2.6 Fort Minor Militia exclusive tracks",
      "2.7 Music videos",
      "3 Awards and nominations",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Fort Minor is the American hip hop side project of Mike Shinoda, who is better known as the rhythm guitarist, keyboardist, producer, and lead vocalist of the American rock band Linkin Park. Shinoda's debut solo album as Fort Minor, The Rising Tied, was released on November 22, 2005. The album's fourth single, \"Where'd You Go\", propelled Fort Minor to stardom, reaching No. 4 on the Billboard Hot 100.[2]\n"
      ]
   },
   "Title": "Fort Minor - Wikipedia"
}