{
   "Name": "The Furys (new wave band)",
   "rawData": [
      "The Furys are a veteran Los Angeles rock band which started out as a punk band on the Beat Records label contemporary with Debbie Harry's Blondie. ",
      "\nThe band began in 1977 when schoolmates Jeff Wolfe and Gregg Embrey decided to take to take matters into their own hands and start a band that rocked back to their roots of rockabilly, British mods, and California surf music. ",
      "The newly formed Furys took gigs wherever they could and with a rocking punk style eventually worked their way up the ranks to major clubs such as the Whiskey a Go Go, Club 88, and many others. During this time they had a single out and were getting radio play. Things were on a fast track for the Furys but as with many bands in the fast lane, things did not last forever.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California"
      ],
      "Genres": [
         "Rock Punk Rock New Wave Power Pop"
      ],
      "Years active": [
         "1977 - present"
      ],
      "Labels": [
         "Beat Records EMI/America"
      ],
      "Associated acts": [
         "The Plimsouls, 20/20, The Weirdos, Connections, Real Impossibles, Iggy Pop, The Horse Soldiers"
      ],
      "Members": [
         "Jeff Wolfe (Vocals)",
         "Chris Silagyi (Guitar)",
         "Dave Lewty (Bass)",
         "Kelly Fair (Drums)"
      ],
      "Past members": [
         "Gregg Embrey 1977-1988 (Bass, Piano, Guitar, Vocals)",
         "Doug Martin 1977-1979 (Bass)",
         "Chaz Maley 1977-1979 (Guitar)",
         "Joe Conti 1978-1979 (Piano)",
         "Gary Embrey 1978-1983 (Drums)",
         "Bob Beland (guitar) (1980s) (performed live and on the Indoor/Outdoor mini-LP)",
         "Mark Francis White (drums)(1980s and mid-2000s) (performed live and on the Indoor/Outdoor mini-LP and on the tracks Wicked White and Tear it Down)",
         "Richard d’Andrea (while not a permanent member, played bass on Indoor/Outdoor)",
         "Glen Laughlin (bass mid-1980s; guitar mid-2000s) (performed live and produced, recorded and played guitar on Wicked White and Tear it Down)",
         "Robert Lane (bass mid-2000s) (performed live and on Wicked White and Tear it Down)"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band which started out as a punk band on the Beat Records label contemporary with Debbie Harry's Blondie. ",
      "\nThe band began in [YEAR] when schoolmates Jeff Wolfe and [PERSON_NAME_FULL_0_MALE] decided to take to take matters into their own hands and start a [GENRE]",
      "The newly formed Furys took gigs wherever they could and with a [GENRE] a Go Go, Club 88, and many others. During this time they had a single out and were getting radio play. Things were on a fast track for the Furys but as with many bands in the fast lane, things did not last forever.\n"
   ]
}