{
   "Name": "Germs (band)",
   "rawData": [
      "The Germs were an American punk rock band from Los Angeles, California, originally active from 1976 to 1980. The band's main early lineup consisted of singer Darby Crash, guitarist Pat Smear, bassist Lorna Doom, and drummer Don Bolles. They released only one album, 1979's (GI), produced by Joan Jett, and were featured the following year in Penelope Spheeris' documentary film The Decline of Western Civilization, which chronicled the Los Angeles punk movement.\n",
      "Germs disbanded following Crash's suicide in 1980. Their music was influential to many later punk rock acts. Smear went on to achieve greater fame performing with Nirvana and Foo Fighters.\n",
      "In 2005, actor Shane West was cast to play Crash in the biographical film What We Do Is Secret, titled after a song by the Germs. He performed with Smear, Doom, and Bolles at a production party for the film, after which the Germs reformed with West as the singer. The new lineup of the band toured the United States several times, including performances on the 2006 and 2008 Warped Tours.\n"
   ],
   "infobox": {
      "Also known as": [
         "Sophistifuck and the Revlon Spam Queens, GI"
      ],
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Punk rock",
         "hardcore punk"
      ],
      "Years active": [
         "1976–1980",
         "2005–2009",
         "2013"
      ],
      "Labels": [
         "Slash"
      ],
      "Associated acts": [
         "Joan Jett",
         "Darby Crash Band",
         "Nirvana",
         "Mike Watt",
         "Foo Fighters",
         "The Go-Go's",
         "The Weirdos",
         "Nervous Gender",
         "45 Grave",
         "Celebrity Skin",
         "Ariel Pink"
      ],
      "Past members": [
         "Darby Crash",
         "Pat Smear",
         "Michelle Baer",
         "Dinky Grant",
         "Lorna Doom",
         "Dottie Danger",
         "Donna Rhia",
         "David Winogrond",
         "Luisa Terrence",
         "Cliff Hanger",
         "D. J. Bonebrake",
         "Nicky Beat",
         "Don Bolles",
         "Rob Henley",
         "Shane West",
         "Charlotte Caffey"
      ]
   },
   "albums": [
      "(GI)"
   ],
   "prunedData": [
      "The [BAND_NAME] were an [GENRE] band from Los Angeles, California, originally active from [YEAR] to [YEAR]. The band's main early lineup consisted of singer Darby Crash, guitarist [PERSON_NAME_FULL_1_MALE], bassist Lorna Doom, and drummer [PERSON_NAME_FULL_2_MALE]. They released only one album, [YEAR]'s (GI), produced by [PERSON_NAME_FULL_0_FEMALE], and were featured the following year in Penelope Spheeris' documentary film The [MONTH]line of Western Civilization, which chronicled the Los Angeles punk movement.\n",
      "[BAND_NAME] disbanded following Crash's suicide in [YEAR]. Their music was influential to many later punk rock acts. Smear went on to achieve greater fame performing with Nirvana and Foo Fighters.\n",
      "In [YEAR], actor Shane West was cast to play Crash in the biographical film What We Do Is Secret, titled after a song by the [BAND_NAME]. He performed with Smear, Doom, and Bolles at a production party for the film, after which the [BAND_NAME] reformed with West as the singer. The new lineup of the band toured the United States several times, including performances on the [YEAR] and [YEAR] Warped Tours.\n"
   ]
}