{
   "Name": "The Ghost Inside (band)",
   "rawData": [
      "The Ghost Inside, formerly known as A Dying Dream, is an American metalcore band from Los Angeles, California, formed in 2004. The band currently consists of vocalist Jonathan Vigil, guitarists Zach Johnson and Chris Davis, bassist Jim Riley and drummer Andrew Tkaczyk. They have released one EP and five studio albums, with their latest, The Ghost Inside, released on June 5, 2020 via Epitaph Records as a return from their hiatus.\n",
      "As A Dying Dream, they released an EP, Now or Never on Frontline Records. A year later, they signed to Mediaskare Records, where they re-recorded and re-released the EP with an additional track and bonus live footage. The release contained early versions of their debut album that followed. Not long after, they changed their name to The Ghost Inside, and released a full-length studio album entitled Fury and the Fallen Ones.\n",
      "Their second album, titled Returners, was released on June 8, 2010 via Mediaskare Records.\n"
   ],
   "infobox": {
      "Also known as": [
         "A Dying Dream (2004–2006)"
      ],
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Metalcore",
         "melodic hardcore"
      ],
      "Years active": [
         "2004–2015",
         "2018–present"
      ],
      "Labels": [
         "Epitaph",
         "Mediaskare"
      ],
      "Website": [
         "www.theghostinside.com"
      ],
      "Members": [
         "Jonathan Vigil",
         "Zach Johnson",
         "Andrew Tkaczyk",
         "Chris Davis",
         "Jim Riley"
      ],
      "Past members": [
         "Ryan Romero",
         "Josh Navarro",
         "Anthony Rivera",
         "Tyler Watamanuk",
         "Soyer Cole",
         "Garrett Harer",
         "KC Stockbridge",
         "Aaron Brooks"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME], formerly known as A Dying Dream, is an [GENRE] band from Los Angeles, California, formed in [YEAR]. The band currently consists of vocalist Jonathan Vigil, guitarists [PERSON_NAME_FULL_1_MALE] and Chris Davis, bassist [PERSON_NAME_FULL_0_MALE] and drummer Andrew Tkaczyk. They have released one EP and five studio albums, with their latest, [BAND_NAME], released on [MONTH] 5, [YEAR] via Epitaph Records as a return from their hiatus.\n",
      "As A Dying Dream, they released an [GENRE] an additional track and bonus live footage. The release contained early versions of their debut album that followed. Not long after, they changed their name to [BAND_NAME], and released a full-length studio album entitled Fury and the Fallen Ones.\n",
      "Their second album, titled Returners, was released on [MONTH] 8, [YEAR] via Mediaskare Records.\n"
   ]
}