{
   "Name": "Goatsnake",
   "Sections": [
      "1 Biography",
      "2 Discography",
      "2.1 Albums",
      "2.2 EPs",
      "2.3 Compilations/reissues",
      "2.4 Compilation tracks",
      "3 Line up",
      "3.1 Former members",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Goatsnake is an American doom metal band from Los Angeles, California. They have released three studio albums, the first being 1999's Goatsnake Vol. 1.\n"
      ]
   },
   "Biography": {
      "text": [
         "Goatsnake was formed in 1996 after the disbanding of The Obsessed. After The Obsessed's disbanding, the rhythm section consisting of bassist Guy Pinhas (also former of the Dutch Beaver) and drummer Greg Rogers began jamming with guitarist Greg Anderson (Thorr's Hammer, Burning Witch, Sunn O)))). They soon found a vocalist in Pete Stahl (Scream, Wool, Earthlings?, The Desert Sessions). \n",
         "Goatsnake recorded and released two 7\" EPs in 1998 and were featured on several metal compilations. They released their debut full-length, 1, in 1999 on Man's Ruin Records/Rise Above Records.\n",
         "Goatsnake toured Europe in support of their debut album and played with bands such as Unida, Fatso Jetson, and Electric Wizard. They returned in 2000 for a U.K. tour with Orange Goblin and Sunn O))), another Anderson project.[1]\n",
         "In 2000 Pinhas left Goatsnake to join Acid King and was replaced by Stuart Dahlquist of Burning Witch. Later that year Goatsnake released a split album with Burning Witch on Hydra Head Records.  They also released the Dog Days EP on Anderson's Southern Lord Records that same year. They went on to release their second album, Flower of Disease on Man's Ruin Records/Rise Above Records.\n",
         "The band split up in 2001 and Anderson continued with Sunn O))) and played in Teeth of Lions Rule the Divine.\n",
         "In 2004 the band reformed with Anderson and Stahl being joined by bassist Scott Reeder (The Obsessed, Kyuss) and drummer JR Conners (Cave In). They recorded three songs which were released on the Trampled Under Hoof EP along with two previously vinyl-only tracks. This same year also saw the release of the compilation 1 + Dog Days by Southern Lord Records, which combines the first album and the Dog Days EP as well as a track from the Man of Light EP.\n",
         "Goatsnake reunited in 2010 with the original line up to headlining the Roadburn Festival on Thursday April 15. To coincide with the reunion a re-issue of Flower of Disease came out around the same time.[2] On June 16, 2011 the band played another rare reunion show as special guests to Godflesh at The Forum in London, England.\n",
         "Original members Anderson, Stahl, and Rogers, along with new bassist Scott Renner, and acclaimed record producer Nick Raskulinecz began working on a new full-length album, Black Age Blues, which was released in 2015. The current Goatsnake line up also played shows in October 2014 including the Southern Lord Records showcase in Los Angeles, California and the Southwest Terror Fest in Tucson, Arizona.\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "EPs": {},
      "Compilations/reissues": {},
      "Compilation tracks": {}
   },
   "Line up": {
      "Former members": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Goatsnake is an American doom metal band from Los Angeles, California. They have released three studio albums, the first being 1999's Goatsnake Vol. 1.\n",
      "Goatsnake was formed in 1996 after the disbanding of The Obsessed. After The Obsessed's disbanding, the rhythm section consisting of bassist Guy Pinhas (also former of the Dutch Beaver) and drummer Greg Rogers began jamming with guitarist Greg Anderson (Thorr's Hammer, Burning Witch, Sunn O)))). They soon found a vocalist in Pete Stahl (Scream, Wool, Earthlings?, The Desert Sessions). \n",
      "Goatsnake recorded and released two 7\" EPs in 1998 and were featured on several metal compilations. They released their debut full-length, 1, in 1999 on Man's Ruin Records/Rise Above Records.\n",
      "Goatsnake toured Europe in support of their debut album and played with bands such as Unida, Fatso Jetson, and Electric Wizard. They returned in 2000 for a U.K. tour with Orange Goblin and Sunn O))), another Anderson project.[1]\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Doom metal"
      ],
      "Years active": [
         "1996–2001, 2004–present"
      ],
      "Labels": [
         "Man's Ruin, Rise Above, Southern Lord, Hydra Head, Prosthetic"
      ],
      "Associated acts": [
         "The Obsessed, Thorr's Hammer, Engine Kid, Scream, Burning Witch, Sunn O))), Beaver, Brotherhood, Wool, Acid King, Teeth of Lions Rule the Divine, Kyuss, Cave In, Asva, Earthlings?, Desert Sessions, Sugartooth"
      ]
   }
}