{
   "Name": "Gram Rabbit",
   "rawData": [
      "Gram Rabbit is an indie rock band based in Joshua Tree, California. The group consists of singer/keyboardist/bassist/guitarist Jesika von Rabbit, guitarist/bassist/programmer/singer Todd Rutherford, drummer Jason Gilbert and guitarist/producer Ethan Allen. Their musical style has been described as an amalgamation of psychedelic rock and electropop. Their fanbase is sometimes referred to as a self-styled \"cult\" called The Royal Order of Rabbits.\n",
      "Jesika von Rabbit (birth name Jessica Leischow) grew up in Green Bay, Wisconsin. She started learning the piano at 6 years old. Her mother was a singer in a hotel lounge band which mostly covered '80s pop songs by artists like Madonna, Pat Benatar and Joan Jett. The Von Rabbit name came from her appreciation of Jefferson Airplane song White Rabbit. Von Rabbit moved to Minneapolis when she was 18 where she started a band called the Porn Flakes, and she was also in a band called the Minx and after five years she eventually moved to Los Angeles in about 1996 to seek music collaborators of a like mind as herself.\n",
      "Rutherford (birth name Todd Rutherford Johnson) grew up in Porterville, California, where he developed his skills on piano and guitar. His father was a professional jazz pianist. Rutherford moved to San Francisco to continue his musical dreams.\n"
   ],
   "infobox": {
      "Origin": [
         "Joshua Tree, California, United States"
      ],
      "Genres": [
         "Indie rock, psychedelic rock, electropop, space rock,[1] electronica[2]"
      ],
      "Years active": [
         "2003–present",
         "(on hiatus since 2013)"
      ],
      "Labels": [
         "Royal Order, Stinky Records"
      ],
      "Website": [
         "gramrabbit.com"
      ],
      "Members": [
         "Jesika von Rabbit",
         "Todd Rutherford",
         "Jason Gilbert",
         "Ethan Allen"
      ],
      "Past members": [
         "Travis Cline",
         "Tracy Lyons-Tarr",
         "Eric Jonasson",
         "Austin Beede",
         "Brian McLeod",
         "Hayden Scott"
      ]
   }
}