{
   "Name": "Gram Rabbit",
   "Sections": [
      "1 History",
      "1.1 1970's-1999: Jesika von Rabbit",
      "1.2 1970's-1999: Todd Rutherford",
      "1.3 2000-2003: Formation of Gram Rabbit",
      "1.4 2004: Music to Start a Cult To",
      "1.5 2005–2006: Cultivation",
      "1.6 2007–2013: Independent releases",
      "1.7 2013-present: Band hiatus and solo work",
      "1.7.1 Jesika von Rabbit",
      "1.7.2 Todd Rutherford",
      "1.7.3 Ethan Allen",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Extended plays",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Gram Rabbit is an indie rock band based in Joshua Tree, California. The group consists of singer/keyboardist/bassist/guitarist Jesika von Rabbit, guitarist/bassist/programmer/singer Todd Rutherford, drummer Jason Gilbert and guitarist/producer Ethan Allen. Their musical style has been described as an amalgamation of psychedelic rock and electropop. Their fanbase is sometimes referred to as a self-styled \"cult\" called The Royal Order of Rabbits.[2][3]\n"
      ]
   },
   "History": {
      "1970's-1999: Jesika von Rabbit": {
         "text": [
            "Jesika von Rabbit (birth name Jessica Leischow[4]) grew up in Green Bay, Wisconsin. She started learning the piano at 6 years old. Her mother was a singer in a hotel lounge band which mostly covered '80s pop songs by artists like Madonna, Pat Benatar and Joan Jett.[1][5] The Von Rabbit name came from her appreciation of Jefferson Airplane song White Rabbit.[6] Von Rabbit moved to Minneapolis when she was 18 where she started a band called the Porn Flakes,[5] and she was also in a band called the Minx[7] and after five years she eventually moved to Los Angeles in about 1996 to seek music collaborators of a like mind as herself.\n"
         ]
      },
      "1970's-1999: Todd Rutherford": {
         "text": [
            "Rutherford (birth name Todd Rutherford Johnson[8][9]) grew up in Porterville, California, where he developed his skills on piano and guitar. His father was a professional jazz pianist.[1] Rutherford moved to San Francisco to continue his musical dreams.\n"
         ]
      },
      "2000-2003: Formation of Gram Rabbit": {
         "text": [
            "Von Rabbit and Rutherford first met in the summer of 2000[10][11] when invited to Joshua Tree by a mutual friend to start a band. The two musicians did not find the band proceedings to work for them, and each night they went to their rooms to work on their own material.[1] While the two were in the legendary Room 8 of the Joshua Tree Inn (site of Gram Parsons death), Von Rabbit and Rutherford decided to work together and perform at Gram Fest, an annual festival honoring Gram Parsons at Joshua Tree in October. They intended to perform a set consisting exclusively of Gram Parsons covers, and named their side project Gram Rabbit as a combination of a nod to Gram Parsons and referencing Jesika von Rabbit's nom de plume.[12] Although they failed to qualify for the festival due to their application being too late, they found that they worked well together. Rutherford played a demo he was working on, which eventually evolved into \"Cowboys & Aliens\", and they realized that their sounds worked well, a cosmic connection between the two. The two immediately quit that band that had brought them to Joshua Tree in order to pursue Gram Rabbit full-time.[1] The two were too broke to buy instruments needed for a band, so they headed back to Rutherford's hometown to live in a trailer across the street from Rutherford's grandparents horse and cattle ranch while working on new material until they returned to Joshua Tree two years later with a collection of new songs and a vision for the group's sound, philosophy and look.[1][13] During this time, they were joined by bass player Travis Cline, a high-school friend of Rutherfords.[6] The original band when complete consisted of singer/keyboardist/guitarist Jesika von Rabbit, guitarist/singer Todd Rutherford and bassist/sampler Travis Cline and moved back to Joshua Tree ready to play in 2003,[12][10] playing shows in Silverlake and elsewhere under the name of the Gram Rabbit Experience.[6] After performing various shows in Los Angeles and San Francisco, a band that they opened for, Singapore Sling, liked them enough to recommend them to their record label, Stinky Records. The label producers listened to them the next show, and signed Gram Rabbit.[10] Gram Rabbit's shows frequently use desert scenes, and their songs and shows often use rabbit themes, helping to develop a fan-base that call themselves \"The Royal Order of the Rabbits.\"[14] The band sold rabbit ears and tossed some off the stage, so that fans could wear them. They even have fans who dress in full bunny costumes.[15]\n"
         ]
      },
      "2004: Music to Start a Cult To": {
         "text": [
            "Music to Start a Cult To was recorded over a three-week period in the spring of 2004 with producer Ethan Allen, in Los Angeles. The album was released in August on the Stinky Records label. The title for the album came from a friend of Von Rabbit's in Minneapolis, Chrissy Kesselring,[16] who was a graphic designer. Kesselring had to design a CD for a class she was taking, and the designed CD appealed to Gram Rabbit.[2][17] The idea of a cults and culty stuff felt right because of the band's rabbit ears and desert location. The band had their CD release party at Pappy & Harriet's, and were joined by a new band member, rhythm guitarist Tracy Lyons-Tarr, who used to play with Von Rabbit back in a band in Minneapolis and had contributed guitar work on \"Land of Jail\" on the album.[2] BMI, one of the major music rights organization, selected Gram Rabbit and their new album for their Pick of the Month program which showcases new artists. Per Tony George of BMI, \"We try to present bands that have commercial appeal but are also on the cutting edge of what's going on. The thing about Gram Rabbit is that it's almost uncategorizable. It's so different and unique and special that people here thought we should give them a shot.... It's such a weird confluence of styles.\"[18]\n"
         ]
      },
      "2005–2006: Cultivation": {
         "text": [
            "Gram Rabbit were hailed as best new L.A. Band in 2005 at the LA Weekly Music Awards. The momentum built during the release earned the band a Main Stage slot at 2005's Coachella Music and Arts Festival.[3] Lyons-Tarr was replaced by Rutherford's brother Eric Jonasson[17] before the recording of Cultivation, which was recorded in the fall of 2005, in Joshua Tree and in the Silverlake, California studio of producer Ethan Allen. Rutherford helped co-produce the album.[3] Like the first album, the release party was held at Pappy & Harriets.[19] The album mixed in many different styles, from shoegaze bliss to post-Kashmir grunge.[20]\n"
         ]
      },
      "2007–2013: Independent releases": {
         "text": [
            "When Gram Rabbit decided to write their third album, they decided to make it more of a party record, with a return to their electronic roots.[21] Just before RadioAngel & the RobotBeat was to come out, Stinky Records closed shop. Gram Rabbit at that time decided to call it quits with their management, and rather than find new management and a new label, decided to release their album themselves, creating their own independent label Royal Order.[22] By the time they recorded RadioAngel and the RobotBeat and released it in 2007, the band was pared down to just Von Rabbit and Rutherford.\n",
            "The independent period of seven years brought three more full lengths from the band and three EP's. They released the socially political-themed electro-rock RadioAngel & the RobotBeat in 2007, the epic spiritually driven Miracles & Metaphors in 2010, and the throwback spaced-out country styling's of 2012's Welcome to the Country. The album was intended for a side project band formed by Jesika von Rabbit and Todd Rutherford, called The Country, in order to explore different sounds, but was released as Gram Rabbit because their sound is all over the map anyway.[23] The song \"Desperate Heart\" was originally going to open Welcome to the Country, but it was licensed instead to Fruit of the Loom.[24] Their EPs during this time period include a previously unreleased collection of the band's earliest home recordings entitled Rare Bits in 2008, The Desert Sound E.P. in 2010, and Braised & Confused in 2013. To date their records have produced more than 30 licenses in television series, national commercial campaigns, and films, with more than 20 different tracks used in these spots. NBC, CBS, ABC, FOX, The CW, FX, Bravo, STARZ, and MTV have all used the band's music in hit shows like CSI, Life, The Real World, Sons of Anarchy, Crash, and 10 Things I Hate About You. Kyocera and Fruit of the Loom have used the music to promote their products in national television campaigns. Motion pictures such as Crazy, Stupid, Love (Steve Carell, Emma Stone), War, Inc. (John Cusack), and Interview (Steve Buscemi), have included the cinematic sounds of Gram Rabbit in their films.[14]\n"
         ]
      },
      "2013-present: Band hiatus and solo work": {
         "Jesika von Rabbit": {
            "text": [
               "Von Rabbit continued to tour by herself and her backing band, and has toured with other bands, such as Eagles of Death Metal. Von Rabbit released her own solo album, Journey Mitchell in 2015,[26] and her second solo album, Dessert Rock, in 2018. \n"
            ]
         },
         "Todd Rutherford": {
            "text": [
               "Rutherford is currently crowd-sourcing funding for his debut solo album.[27]\n"
            ]
         },
         "Ethan Allen": {
            "text": [
               "Ethan Allen is a Grammy nominated producer, engineer, and composer currently writing and performing with Jesika Von Rabbit and the band ASHHR.\n"
            ]
         },
         "text": [
            "After 12 years together, Von Rabbit and Rutherford decided to take a break from each other, to try to live life and experience music on their own.[5] Although on hiatus, the band still comes together for their Halloween shows at Pappy & Harriet's Pioneertown Palace.[25] Von Rabbit has stated that Gram Rabbit has never officially broken up.[25]\n"
         ]
      }
   },
   "Discography": {
      "Studio albums": {},
      "Extended plays": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Gram Rabbit is an indie rock band based in Joshua Tree, California. The group consists of singer/keyboardist/bassist/guitarist Jesika von Rabbit, guitarist/bassist/programmer/singer Todd Rutherford, drummer Jason Gilbert and guitarist/producer Ethan Allen. Their musical style has been described as an amalgamation of psychedelic rock and electropop. Their fanbase is sometimes referred to as a self-styled \"cult\" called The Royal Order of Rabbits.[2][3]\n",
      "Jesika von Rabbit (birth name Jessica Leischow[4]) grew up in Green Bay, Wisconsin. She started learning the piano at 6 years old. Her mother was a singer in a hotel lounge band which mostly covered '80s pop songs by artists like Madonna, Pat Benatar and Joan Jett.[1][5] The Von Rabbit name came from her appreciation of Jefferson Airplane song White Rabbit.[6] Von Rabbit moved to Minneapolis when she was 18 where she started a band called the Porn Flakes,[5] and she was also in a band called the Minx[7] and after five years she eventually moved to Los Angeles in about 1996 to seek music collaborators of a like mind as herself.\n",
      "Rutherford (birth name Todd Rutherford Johnson[8][9]) grew up in Porterville, California, where he developed his skills on piano and guitar. His father was a professional jazz pianist.[1] Rutherford moved to San Francisco to continue his musical dreams.\n",
      "Von Rabbit and Rutherford first met in the summer of 2000[10][11] when invited to Joshua Tree by a mutual friend to start a band. The two musicians did not find the band proceedings to work for them, and each night they went to their rooms to work on their own material.[1] While the two were in the legendary Room 8 of the Joshua Tree Inn (site of Gram Parsons death), Von Rabbit and Rutherford decided to work together and perform at Gram Fest, an annual festival honoring Gram Parsons at Joshua Tree in October. They intended to perform a set consisting exclusively of Gram Parsons covers, and named their side project Gram Rabbit as a combination of a nod to Gram Parsons and referencing Jesika von Rabbit's nom de plume.[12] Although they failed to qualify for the festival due to their application being too late, they found that they worked well together. Rutherford played a demo he was working on, which eventually evolved into \"Cowboys & Aliens\", and they realized that their sounds worked well, a cosmic connection between the two. The two immediately quit that band that had brought them to Joshua Tree in order to pursue Gram Rabbit full-time.[1] The two were too broke to buy instruments needed for a band, so they headed back to Rutherford's hometown to live in a trailer across the street from Rutherford's grandparents horse and cattle ranch while working on new material until they returned to Joshua Tree two years later with a collection of new songs and a vision for the group's sound, philosophy and look.[1][13] During this time, they were joined by bass player Travis Cline, a high-school friend of Rutherfords.[6] The original band when complete consisted of singer/keyboardist/guitarist Jesika von Rabbit, guitarist/singer Todd Rutherford and bassist/sampler Travis Cline and moved back to Joshua Tree ready to play in 2003,[12][10] playing shows in Silverlake and elsewhere under the name of the Gram Rabbit Experience.[6] After performing various shows in Los Angeles and San Francisco, a band that they opened for, Singapore Sling, liked them enough to recommend them to their record label, Stinky Records. The label producers listened to them the next show, and signed Gram Rabbit.[10] Gram Rabbit's shows frequently use desert scenes, and their songs and shows often use rabbit themes, helping to develop a fan-base that call themselves \"The Royal Order of the Rabbits.\"[14] The band sold rabbit ears and tossed some off the stage, so that fans could wear them. They even have fans who dress in full bunny costumes.[15]\n"
   ],
   "infobox": {
      "Origin": [
         "Joshua Tree, California, United States"
      ],
      "Genres": [
         "Indie rock, psychedelic rock, electropop, space rock,[1] electronica[2]"
      ],
      "Years active": [
         "2003–present",
         "(on hiatus since 2013)"
      ],
      "Labels": [
         "Royal Order, Stinky Records"
      ],
      "Website": [
         "gramrabbit.com"
      ],
      "Members": [
         "Jesika von Rabbit",
         "Todd Rutherford",
         "Jason Gilbert",
         "Ethan Allen"
      ],
      "Past members": [
         "Travis Cline",
         "Tracy Lyons-Tarr",
         "Eric Jonasson",
         "Austin Beede",
         "Brian McLeod",
         "Hayden Scott"
      ]
   }
}