{
   "Name": "Grouplove",
   "rawData": [
      "Grouplove is an American alternative rock band that was formed in 2009 by Hannah Hooper (vocals, keyboards), Christian Zucconi (vocals, guitar), Daniel Gleason (bass), Andrew Wessen (guitar, vocals), and Benjamin Homola (drums).\n",
      "Ryan Rabin produced their debut EP, Grouplove, which was originally released independently, and was later re-released by Canvasback/Atlantic with a bonus track and their hit song, \"Colours\". They are also known for their single \"Tongue Tied\". Their debut album, Never Trust a Happy Song, was also produced by Rabin and was released worldwide on September 13, 2011.\n",
      "Grouplove formed out of a friendship among the five members of the band. Hooper met Zucconi on the Lower East Side of Manhattan after hearing and enjoying his music from his former band ALOKE. Despite having just met, Hooper invited Zucconi to an artist residency in Crete she was leaving for later that week.  It was at the Ikarus artist commune in the village of Avdou where they met the rest of the band, Andrew Wessen, Ryan Rabin, and Sean Gadd. Rabin, an accomplished drummer and producer, grew up in Los Angeles with Wessen, a surfer and guitarist. Rabin comes from a musical family – his father is Trevor Rabin, former guitarist of Yes. Sean Gadd, a songwriter and guitarist from London, was also at the commune. The friendship between the members formed quickly, but the band did not form until a year later after Gadd, Zucconi and Hooper pooled their funds together and made a trip to Rabin's Los Angeles recording studio. They played their first show at El Cid in Los Angeles on May 10, 2010.  Later that year, the band went on tour with Florence and the Machine on the west coast, and then the Joy Formidable on the east coast. By November, Nylon Magazine recognized Grouplove as one of the top ten in the \"Best New Bands in 2010.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California"
      ],
      "Genres": [
         "Alternative rock, indie pop, electropop, alternative dance"
      ],
      "Years active": [
         "2009–present"
      ],
      "Labels": [
         "Canvasback",
         "Atlantic"
      ],
      "Website": [
         "www.grouplovemusic.com"
      ],
      "Members": [
         "Hannah Hooper",
         "Chris Zucconi",
         "Andrew Wessen",
         "Daniel Gleason",
         "Benjamin Homola"
      ],
      "Past members": [
         "Sean Gadd",
         "Ryan Rabin"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band that was formed in [YEAR] by [PERSON_NAME_FULL_1_FEMALE] (vocals, keyboards), Christian Zucconi (vocals, guitar), [PERSON_NAME_FULL_0_MALE] (bass), Andrew Wessen (guitar, vocals), and [PERSON_NAME_FULL_2_MALE] (drums).\n",
      "Ryan Rabin produced their debut EP, [BAND_NAME], which was originally released independently, and was later re-released by Canvasback/Atlantic with a [GENRE] a Happy Song, was also produced by Rabin and was released worldwide on [MONTH] 13, [YEAR].\n",
      "[BAND_NAME] formed out of a [GENRE] band. Hooper met Zucconi on the Lower East Side of Manhattan after hearing and enjoying his music from his former band ALOKE. Despite having just met, Hooper invited Zucconi to an artist residency in Crete she was leaving for later that week.  It was at the Ikarus artist commune in the village of Avdou where they met the rest of the band, Andrew Wessen, [PERSON_NAME_FULL_0_MALE], and [PERSON_NAME_FULL_1_MALE]. [PERSON_NAME_LAST_0], an accomplished drummer and producer, grew up in Los Angeles with Wessen, a surfer and guitarist. [PERSON_NAME_LAST_0] comes from a musical family – his father is [PERSON_NAME_FIRST_2] [PERSON_NAME_LAST_0], former guitarist of Yes. [PERSON_NAME_FULL_1_MALE], a songwriter and guitarist from London, was also at the commune. The friendship between the members formed quickly, but the band did not form until a year later after [PERSON_NAME_LAST_1], Zucconi and Hooper pooled their funds together and made a trip to [PERSON_NAME_LAST_0]'s Los Angeles recording studio. They played their first show at El Cid in Los Angeles on [MONTH] 10, [YEAR].  Later that year, the band went on tour with Florence and the Machine on the west coast, and then the Joy Formidable on the east coast. By [MONTH], Nylon Magazine recognized [BAND_NAME] as one of the top ten in the \"Best New Bands in [YEAR].\"\n"
   ]
}