{
   "Discography": {
      "text": [
         "Half Way Home - 1992 - Geffen Records #DGCD-24390 - Produced by Jim Mitchell and Chris \"Hoover\" Rankin.\n",
         "Track List:\n1) Built for Fools\n2) Breakdown\n3) Beautiful Day\n4) Crazy\n5) Jesus Rocked the Cradle\n6) Bury My Bone\n7) Push On!\n8) Look Around Yourself\n9) Come On, Come On\n10) Divine Grace\n11) Etched in Stone\n12) You're So Essential\n",
         "Half Way Home - 1992 - Half Way Home Records #HWHD-001 - Produced by Jim Mitchell and Chris \"Hoover\" Rankin.\n",
         "Track List:\n1) Queen Bee\n2) The Promoter\n3) Lost Along the Way\n4) Cry\n5) Built for Fools\n6) Bottle of Blues\n7) Lethal Love\n8) Me & Mr. Bird\n"
      ]
   },
   "External links": {},
   "History": {
      "text": [
         "Half Way Home was formed in 1986 by guitarist Dean Zuckerman, bassist Eddie Fagin, drummer Kevin Costigan, and singer Jennifer Barry with the band name officially used for the first time at a gig on November 6, 1987.[1] The band members were all from Los Angeles, CA. and played locally at backyard parties and similar casual events to build a dedicated fan base.  By the end of 1988, Half Way Home was established and started playing gigs alongside Grateful Dead style cover bands that were popular at the time in Los Angeles (e.g. The Pur'p'l Tur't'lz).  In Los Angeles, these bands often played festival type events together at outdoor venues during the Summertime, drawing large crowds of music fans for the concerts (e.g. The Extravaganza (music festival), May 22, 1993).  Half Way Home were eventually headlining regular gigs at nightclubs such as The Country Club, the Palomino Club, and The Troubador.  The band toured across the country picking up new fans along the way, building a mailing list of thousands of dedicated fans.[2] Half Way Home eventually grew a large enough fan base, from \"metalheads to deadheads,\"  to attract significant attention in the music industry.[3] The band was signed to Geffen records in 1991.[4]\n",
         "In the early 1990s the band released two albums.  First, they released an 8-song self-produced and self-titled album \"Half Way Home,\" as gift for their large following of loyal fans.[4]  This 1992 first release was very limited and was only sold at shows and through the mail.[4]  In fact, Half Way Home was one of the earliest bands to attempt to build their fan base through direct marketing and band loyalty, using mailing lists, 800 numbers, and alternative avenues to promote their new album.[2] The second album, released through Geffen Records in 1993, and also titled \"Half Way Home,\" was reviewed positively by critics,[3][5] but was heavily produced with little effective input from the band. The album sold poorly and was not promoted heavily by Geffen because of the newly found grunge scene that came alive around the same time, and also because of the \"grassroots\" marketing approach Geffen chose to take.[2] The band broke up in 1994 though some members of the band were auditioning for a new singer as early as 1993.[6] The band has never reunited and the band name was officially cancelled in 1998.[1]\n",
         "Dean Zuckerman and Kevin Costigan formed a band called \"Slush\" in 1996, and they released one album titled \"North Hollywood\" in 1997.[6] Jennifer Barry has contributed background vocals to several releases by Ugly Kid Joe, and was featured on the 2001 album Freedom, a tribute to Rage Against the Machine, singing lead on the popular song Year of the Boomerang. Eddie Fagin contributed to the soundtrack for The Cable Guy starring Jim Carey. \n",
         "In 1999, the band, minus bassist Eddie Fagin, reunited for a short time playing around the Los Angeles club scene as the Jenny Barry Band, with the last performance under that name in 2002.[7] Today, Half Way Home currently enjoys a presence on the popular social media sites YouTube and Facebook, mostly supported by fans, with no plans of reuniting in the near future.[7]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Half Way Home was a popular band from Los Angeles, CA. that had a dedicated following based on years of constant gigging and touring across the United States. Half Way Home made their mark in the Los Angeles club scene, eventually drawing the attention of Geffen records after becoming a regular presence at the Troubadour and other popular clubs in the city.\n"
      ]
   },
   "Title": "Half Way Home - Wikipedia"
}