{
   "Name": "Half Way Home",
   "rawData": [
      "Half Way Home was a popular band from Los Angeles, CA. that had a dedicated following based on years of constant gigging and touring across the United States. Half Way Home made their mark in the Los Angeles club scene, eventually drawing the attention of Geffen records after becoming a regular presence at the Troubadour and other popular clubs in the city.\n",
      "Half Way Home was formed in 1986 by guitarist Dean Zuckerman, bassist Eddie Fagin, drummer Kevin Costigan, and singer Jennifer Barry with the band name officially used for the first time at a gig on November 6, 1987. The band members were all from Los Angeles, CA. and played locally at backyard parties and similar casual events to build a dedicated fan base.  By the end of 1988, Half Way Home was established and started playing gigs alongside Grateful Dead style cover bands that were popular at the time in Los Angeles (e.g. The Pur'p'l Tur't'lz).  In Los Angeles, these bands often played festival type events together at outdoor venues during the Summertime, drawing large crowds of music fans for the concerts (e.g. The Extravaganza (music festival), May 22, 1993).  Half Way Home were eventually headlining regular gigs at nightclubs such as The Country Club, the Palomino Club, and The Troubador.  The band toured across the country picking up new fans along the way, building a mailing list of thousands of dedicated fans. Half Way Home eventually grew a large enough fan base, from \"metalheads to deadheads,\"  to attract significant attention in the music industry. The band was signed to Geffen records in 1991.\n",
      "In the early 1990s the band released two albums.  First, they released an 8-song self-produced and self-titled album \"Half Way Home,\" as gift for their large following of loyal fans.  This 1992 first release was very limited and was only sold at shows and through the mail.  In fact, Half Way Home was one of the earliest bands to attempt to build their fan base through direct marketing and band loyalty, using mailing lists, 800 numbers, and alternative avenues to promote their new album. The second album, released through Geffen Records in 1993, and also titled \"Half Way Home,\" was reviewed positively by critics, but was heavily produced with little effective input from the band. The album sold poorly and was not promoted heavily by Geffen because of the newly found grunge scene that came alive around the same time, and also because of the \"grassroots\" marketing approach Geffen chose to take. The band broke up in 1994 though some members of the band were auditioning for a new singer as early as 1993. The band has never reunited and the band name was officially cancelled in 1998.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Rock, Blues, jam band"
      ],
      "Years active": [
         "1986–1994 (Indefinite Hiatus)"
      ],
      "Labels": [
         "Geffen"
      ],
      "Website": [
         "[1]"
      ],
      "Members": [
         "Jennifer Barry - vocals",
         "Dean Zuckerman - guitars",
         "Eddie Fagin - bass",
         "Kevin Costigan - drums"
      ]
   },
   "albums": [
      "Half Way Home (Geffen) (1993)"
   ],
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band from Los Angeles, CA. that had a dedicated following based on years of constant gigging and touring across the United States. [BAND_NAME] made their mark in the Los Angeles club scene, eventually drawing the attention of Geffen records after becoming a regular presence at the Troubadour and other [GENRE] clubs in the city.\n",
      "[BAND_NAME] was formed in [YEAR] by guitarist Dean Zuckerman, bassist Eddie Fagin, drummer [PERSON_NAME_FULL_0_MALE], and singer [PERSON_NAME_FULL_1_FEMALE] with the band name officially used for the first time at a gig on [MONTH] 6, [YEAR]. The band members were all from Los Angeles, CA. and played locally at backyard parties and similar casual events to build a dedicated fan base.  By the end of [YEAR], [BAND_NAME] was established and started playing gigs alongside Grateful Dead style cover bands that were popular at the time in Los Angeles (e.g. The Pur'p'l Tur't'lz).  In Los Angeles, these bands often played festival type events together at outdoor venues during the Summertime, drawing large crowds of music fans for the concerts (e.g. The Extravaganza (music festival), [MONTH] 22, [YEAR]).  [BAND_NAME] were eventually headlining regular gigs at nightclubs such as The Country Club, the Palomino Club, and The Troubador.  The band toured across the country picking up new fans along the way, building a mailing list of thousands of dedicated fans. [BAND_NAME] eventually grew a large enough fan base, from [SONG_NAME]  to attract significant attention in the music industry. The band was signed to Geffen records in [YEAR].\n",
      "In the early [YEAR]s the band released two albums.  First, they released an 8-song self-produced and self-titled album [SONG_NAME] marketing approach Geffen chose to take. The band broke up in [YEAR] though some members of the band were auditioning for a new singer as early as [YEAR]. The band has never reunited and the band name was officially cancelled in [YEAR].\n"
   ]
}