{
   "Name": "Gruntruck",
   "rawData": [
      "Gruntruck is an American rock band formed in 1989 in Seattle, Washington, by vocalist Ben McMillan and drummer Norman Scott, both previously from early Seattle sound pioneers Skin Yard. While in Skin Yard, Norman also briefly joined Soundgarden, and collaborated with Chris Cornell on a lesser-known band, the low frequency power trio Bass Truck. Lead guitarist Tommy Niemeyer from metal thrashers The Accüsed and bassist Tim Paul, previously of Portland hardcore punk band Final Warning, rounded out the initial, classic line-up. Their sound is described as grunge, and the band focuses more on the metal side of the genre.\n",
      "While on tour with Skin Yard, Ben and Norman wrote a song (Paint from Inside Yours) in Tucson, Arizona, which had a vibe that Ben felt was worthy of forming a new band around. Before long Ben, Norman, and Tom began to collaborate on blending Bass Truck's sound with this new material, and brought in Tim Paul on bass to fill out the sound later that year. After several attempts at titling the new lineup, the name Gruntruck came to Ben while out record shopping.\n",
      "The band soon recorded a full-length album for Seattle label Empty Records, with Skin Yard alum/legendary producer Jack Endino (Nirvana, Soundgarden) producing with Gary King. Inside Yours was released in 1990, and was released simultaneously in Germany on the Musical Tragedies label. Gruntruck made a video for the song Not a Lot to Save, with Henry Shepherd (brother of Soundgarden bassist Ben) directing, which soon found its way onto MTV.\n"
   ],
   "infobox": {
      "Origin": [
         "Seattle, Washington, U.S."
      ],
      "Genres": [
         "Grunge, heavy metal[1]"
      ],
      "Years active": [
         "1989–1993, 1996–2002, 2017–present"
      ],
      "Labels": [
         "Roadrunner, eMpTy, Betty, Found Recordings"
      ],
      "Associated acts": [
         "Skin Yard,  The Accüsed, Final Warning"
      ],
      "Website": [
         "www.gruntruck.com"
      ],
      "Members": [
         "Ben McMillan (deceased) ",
         " Tom Niemeyer  ",
         " Tim Paul ",
         " Norman Scott ",
         " Alex Sibbald ",
         " Josh Sinder"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in [YEAR] in Seattle, Washington, by vocalist Ben McMillan and drummer [PERSON_NAME_FULL_1_MALE], both previously from early Seattle sound pioneers Skin Yard. While in Skin Yard, [PERSON_NAME_FIRST_1] also briefly joined Soundgarden, and collaborated with [PERSON_NAME_FULL_0_MALE] on a lesser-known band, the low frequency power trio Bass Truck. Lead guitarist [PERSON_NAME_FULL_2_MALE] from metal thrashers The Accüsed and bassist Tim Paul, previously of Portland hardcore punk band Final Warning, rounded out the initial, classic line-up. Their sound is described as grunge, and the band focuses more on the metal side of the genre.\n",
      "While on tour with Skin Yard, Ben and Norman wrote a song (Paint from Inside Yours) in Tucson, Arizona, which had a vibe that Ben felt was worthy of forming a new band around. Before long Ben, Norman, and Tom began to collaborate on blending Bass Truck's sound with this new material, and brought in Tim Paul on bass to fill out the sound later that year. After several attempts at titling the new lineup, the name [BAND_NAME] came to Ben while out record shopping.\n",
      "The band soon recorded a full-length album for Seattle label Empty Records, with Skin Yard alum/legendary producer Jack Endino (Nirvana, Soundgarden) producing with [PERSON_NAME_FULL_0_MALE]. Inside Yours was released in [YEAR], and was released simultaneously in Germany on the Musical Tragedies label. [BAND_NAME] made a video for the song Not a Lot to Save, with [PERSON_NAME_FULL_1_MALE] (brother of Soundgarden bassist Ben) directing, which soon found its way onto MTV.\n"
   ]
}