{
   "Name": "Victims Family",
   "Sections": [
      "1 History",
      "2 Line-up",
      "3 Discography",
      "3.1 Albums",
      "3.2 Singles and compilations",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Victims Family is a hardcore punk band formed in 1984 in Santa Rosa, California, by the bass guitarist Larry Boothroyd and the guitarist and vocalist Ralph Spight. Devon VrMeer completed the trio as drummer. Their sound blended punk, heavy metal and jazz, making them difficult to categorize into a single genre. Allmusic says, \"Since its inception, the trio has refused to be pigeonholed to any single musical style — incorporating elements of hardcore punk, jazz, funk, hard rock, and noise into its challenging sound\". They were known as one of the most musically diverse bands in the San Francisco underground music scene. Over the years, Victims Family went through four drummers and two break-ups. Their name was taken from a piece by the cartoonist B. Kliban.\n"
      ]
   },
   "History": {
      "text": [
         "In 1984, Victims Family played their first show at the Kennilworth Recreation Center in Petaluma, California, where they later opened for Faith No More and Suicidal Tendencies. In summer 1985, the band made their first U.S. tour, which they booked themselves by mailing out a cassette demo. They played with NOFX in Albuquerque and challenged Tales of Terror to a drinking contest in Dallas. Also that year, they opened  for the Dead Kennedys, Descendents and Social Unrest at the Novato Theater, where they first caught the attention of Jello Biafra. In 1986, they opened  for the Butthole Surfers and Camper Van Beethoven at Mabuhay Gardens in San Francisco, and recorded their first album, Voltage and Violets, for Ruth Schwartz's Mordam Records, and regularly played The Farm and Club Foot in San Francisco. 1986 was also the year they played at a pizza parlor in Oakland with Nomeansno, beginning a long friendship between the two bands.\n",
         "In 1987, they barely completed a tour of the United States and missed their dates in Canada after being banned from that country for one year.[citation needed] Highlights included playing with Capitol Punishment in Fresno and Scratch Acid in Dallas. A second album, Things I Hate To Admit, was recorded in 1988 at Prairie Sun Studio in Cotati, California.\n",
         "In 1988, they began their friendship with Primus, with whom they shared the stage many times in the years to follow.\n",
         "In 1989, they were invited by Konkurrent, a record label in Amsterdam, for a European tour. VrMeer had left the band to raise a family, so Eric Strand was recruited as drummer. The band embarked on a five-week tour of Europe with Snuff from London supporting them. Highlights included helping to break down the Berlin Wall[citation needed] and being strip searched in Norway. After returning from Europe, Strand was replaced by the roadie Tim Solyan who continued to drum for Victims Family throughout the height of their touring days.\n",
         "Their third album, White Bread Blues, produced by the Nomeansno drummer John Wright, followed in 1990 and was received on a much wider critical and commercial scale than their earlier albums.[citation needed] It included the song \"'Caged Bird\", which reached No. 6 on the Dutch national radio charts. Around this time, Mr. Bungle and Green Day, then little known acts, often opened for Victims Family. Also in 1990, they supported Tad and Nirvana on the midwest leg of their cross-country tour. Numerous tours of the US and Europe cemented the group's reputation as an incendiary live act. Their fourth album, The Germ, released in 1992 and also produced by John Wright, was their first for Alternative Tentacles Records. The band's schedule began to take its toll, and in 1992 they took a break.\n",
         "Ten months later, in spring 1993, Victims Family reformed, to play a sold-out show at the Kennel Club in San Francisco. A fifth album, Headache Remedy, was released by Alternative Tentacles in February 1994. Four Great Thrash Songs, the last album of the classic line-up was recorded live in 1994 at their final show at Melkweg in Amsterdam, the band's home from home. Founding members Spight and Boothroyd also formed the bands Saturn's Flea Collar and Hellworms, both of which toured the US and Europe and recorded albums for Alternative Tentacles.\n",
         "\nAfter the demise of Hellworms, Spight and Boothroyd continued under the name Victims Family with a new drummer David Gleza of My Name and they recorded the album Apocalicious in 2001. The band continued to tour relentlessly, including two trips to Texas for SXSW, and two more tours of Europe, causing the band to lose Gleza to tour fatigue. This time Spight and Boothroyd decided not to look for another drummer.",
         "On December 11 and 12, 2004, Victims Family reunited, with Solyan back on drums, at the Phoenix Theatre in Petaluma, California, and in San Francisco at the Bottom of the Hill, to celebrate their 20th anniversary with all their different incarnations, including The Freak Accident (Spight's solo project) and Meowmeow and the Meowmeows (Boothroyd's new band). Also included at this time was a Saturn's Flea Collar 10th anniversary reunion and a Hellworms reunion. This sparked subsequent shows with both Hellworms and Victims Family. In 2006, Boothroyd began playing with the Bay Area band that came to be known as Triclops! and began touring and releasing records with them. The Freak Accident released an LP on Alternative Tentacles and toured Europe with Nomeansno. Triclops! released a full-length album, Out of Africa, on Alternative Tentacles in March 2008, and a their follow-up, Helpers On The Other Side, also on Alternative Tentacles, in 2010.\n",
         "Solyan has been in a few bands over the years including The Kehoe Nation (for whom he played select drum tracks on Music For Livers), Wingnut, Jerry Rigg & the El Chupos. He is currently[when?] back with Bryan Kehoe in a duo of guitar and drums called Black Cat Grave.\n",
         "In 2009, the band appeared at the Phoenix Theater in Petaluma with Nomeansno and also for Alternative Tentacles 30th Anniversary shows in San Francisco with Alice Donut, Jello Biafra and the Guantanamo School of Medicine, Spight's latest band.\n",
         "In 2010, Victims Family was invited to play in the Czech Republic with Nomeansno, Le Silo (Japan), and a group of Cuban dancers and typewriter players to celebrate a friend's 50th birthday. This turned into a whirlwind mini-tour in Europe where they played nine shows in nine days. In 2012, they released the \"Have A Nice Day\" single on Alternative Tentacles, made another short tour of Europe and played a handful of Northern California shows.\n"
      ]
   },
   "Line-up": {
      "text": [
         "Past drummers:\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Singles and compilations": {}
   },
   "External links": {},
   "coreData": [
      "Victims Family is a hardcore punk band formed in 1984 in Santa Rosa, California, by the bass guitarist Larry Boothroyd and the guitarist and vocalist Ralph Spight. Devon VrMeer completed the trio as drummer. Their sound blended punk, heavy metal and jazz, making them difficult to categorize into a single genre. Allmusic says, \"Since its inception, the trio has refused to be pigeonholed to any single musical style — incorporating elements of hardcore punk, jazz, funk, hard rock, and noise into its challenging sound\". They were known as one of the most musically diverse bands in the San Francisco underground music scene. Over the years, Victims Family went through four drummers and two break-ups. Their name was taken from a piece by the cartoonist B. Kliban.\n",
      "In 1984, Victims Family played their first show at the Kennilworth Recreation Center in Petaluma, California, where they later opened for Faith No More and Suicidal Tendencies. In summer 1985, the band made their first U.S. tour, which they booked themselves by mailing out a cassette demo. They played with NOFX in Albuquerque and challenged Tales of Terror to a drinking contest in Dallas. Also that year, they opened  for the Dead Kennedys, Descendents and Social Unrest at the Novato Theater, where they first caught the attention of Jello Biafra. In 1986, they opened  for the Butthole Surfers and Camper Van Beethoven at Mabuhay Gardens in San Francisco, and recorded their first album, Voltage and Violets, for Ruth Schwartz's Mordam Records, and regularly played The Farm and Club Foot in San Francisco. 1986 was also the year they played at a pizza parlor in Oakland with Nomeansno, beginning a long friendship between the two bands.\n",
      "In 1987, they barely completed a tour of the United States and missed their dates in Canada after being banned from that country for one year.[citation needed] Highlights included playing with Capitol Punishment in Fresno and Scratch Acid in Dallas. A second album, Things I Hate To Admit, was recorded in 1988 at Prairie Sun Studio in Cotati, California.\n",
      "In 1988, they began their friendship with Primus, with whom they shared the stage many times in the years to follow.\n"
   ]
}