{
   "Discography": {
      "Music videos": {},
      "Remix albums": {},
      "Singles": {},
      "Soundtracks": {},
      "Splits": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "Death Magic": {
         "text": [
            "Health's third album, Death Magic, was released on August 7, 2015, on Loma Vista Records.[20] The album's release was preceded by three singles: On April 23, 2015, Health premiered \"New Coke\" on Sirius XMU. The song \"Stonefist\" would be the second single released in June. On July 24, \"Men Today\" was released as the third track from the album. In Autumn 2015, shortly after the release of the album, Jupiter Keyes left the band.\n",
            "Disco 3 was released in the United States on February 17, 2017, in Loma Vista. Announced and released alongside a reverse telethon event on Facebook live, broadcast from the FunnyOrDie studios. Fans were asked to text a number in order to receive a call back from those involved, including BJ and John.\n",
            "Health's fourth album, Vol. 4 :: Slaves of Fear, was released February 8, 2019, on Loma Vista. The album was preceded by singles \"Slaves of Fear\", released in December 2018, and \"Feel Nothing\", released through the Adult Swim Singles Program in January 2019.\n"
         ]
      },
      "Get Color": {
         "text": [
            "To promote their 2009 album, Get Color, the band held a sweepstakes contest, in which a winner of a golden ticket was awarded a free trip to Los Angeles to go to Six Flags Magic Mountain with the band. Other prizes included locks of the band members' hair and posters autographed in blood.[10] The album earned a score of eight from Pitchfork in which the review claimed \"Never merely meager, this project delivers, both when you're waving your orgy-snorkel all blotto on-the-town, and for a soundtrack to serious rumination at your midday desk of harsh reality.\" Duzsik agreed with an interviewer that Get Color was indeed more accessible than their self-titled debut, but \"It’s still crazy, though.\"[8] The track \"Die Slow\" was released as the album's single with its music video garnering nearly 500,000 views.[11][12] The album received a positive score of 7.4 on Pitchfork.[13]\n",
            "The band's second remix album with tracks from Get Color continued to receive critical acclaim. BBC reviewed the album and said, \"Whatever HEALTH’s secret is for excellent remix albums, they would do well to bottle it up to flog to lesser-able musicians insistent on releasing similar affairs of a much lower standard. This might not actually improve on the original, but it comprises a fine complementary release for hardcore fans and newcomers alike.\"[14]\n"
         ]
      },
      "Health": {
         "text": [
            "Health first gained reputation through a remix of their song \"Crimewave\" by experimental electronic band Crystal Castles in August 2007. The rendition helped broaden Health's audience in anticipation for their full-length debut a month later released under Lovepump United. The band's self-titled album was recorded in L.A.’s noise/experimental venue, The Smell. Known for its DIY mystique, Health knew how difficult, yet rewarding, it would be to record in the space. Famiglietti said in an interview, \"The room completely changes the tone of anything you want to record; makes a lot of things dark and beautiful. It also makes everything sound like 'CLANG!' We didn't realize how hard it would be at all, we especially weren't prepared for the Vaquero bar dropping the reggaeton jamz at 1pm every day.\"[6] Their unique sound on the album caught the attention of Spin in which they wrote, \"The near-innocuous opening track of Health's self-titled album, 'Heaven,' segues into the 36-second neurotic dissonance of 'Girl Attorney,' which picks up tempo on its transition into 'Triceratops'—a thrashing scourge of screeches, feedback, and gratuitous clanging reminiscent of Liars laced with a relief of a Deerhunter meditation.\"[7]\n",
            "Health released their first remix album, Health//Disco in 2008, which received favorable critical reception.[8]\n",
            "That year the band opened for the rock band Nine Inch Nails on their Lights In The Sky tour.[9]\n"
         ]
      },
      "Video game soundtracks": {
         "text": [
            "In 2012, Health composed the soundtrack for the Rockstar Games video game, Max Payne 3.[15] In an interview with Pitchfork, Duzsik said, \"The number one reaction from HEALTH fans was, ‘What the fuck? You guys are doing a video game score?’ Just surprise. And very congratulatory.\" Duzsik continued, \"It was fun to make music that was atypical for that sort of entertainment.\"[16]\n",
            "Ivan Pavlovich, music director of Max Payne 3 said, \"We wanted to give Max a sound that is really an identifiable sound and HEALTH as a band has an incredible sense of who they are and a very strong identity. When we saw HEALTH perform live it was very clear that they were the ones who were going to be able to capture this.\"[17]\n",
            "The score was nominated for Best Score in a Game and \"Tears\" was nominated for Best Song in a Game at the 2012 Spike Video Game Awards.[18] HEALTH later recorded a song called \"High Pressure Dave\" which appeared in Grand Theft Auto V; the song takes lyrics from \"High Pressure Days\" by The Units.[19] Health also composed the soundtrack for GTA Online's Arena War update.\n"
         ]
      },
      "Vol. 4 :: Slaves of Fear": {},
      "text": [
         "Health was created after its members agreed the name should be an \"everyday word.\" After reviewing a long list of terms, \"health\" was the only one not taken.[6]\n"
      ]
   },
   "Members": {
      "text": [
         "Current members\n",
         "Past members\n"
      ]
   },
   "Musical style": {
      "text": [
         "Health has been described as having \"artfully crafted noise and raw synth, haunting monotone vocals, and drum skills that are borderline insane.\"[21] Guardian Unlimited writer, Louis Pattison, describes the Crystal Castles version of \"Crimewave\" as \"melancholy electro-pop built from pixelated synths and depressed vocals that hint at a past programme of busy and sustained serotonin depletion.\"[22] The band's unusual sound can be partially credited to the use of the Zoothorn, which is a permutation of microphone and guitar pedal and an occasional atonal sound without a symmetrical structure.[23] Lyrically, the band describes the role of lyrics as being \"purposely kept vague for the listener\" \"...[Lyrics] sort of begin to bring out this more individual quality to the whole thing like, ‘These are the lyrics, and this is the guy is singing them, so I can relate to that.’ Which is really not something we want. We wanted the vocals to have an even, unaffected feel. A softness, like a Zombies melody, or even a Gregorian chant. We aren't just interested in being a noisy screaming band.\"[24]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Health",
      "1.2 Get Color",
      "1.3 Video game soundtracks",
      "1.4 Death Magic",
      "1.5 Vol. 4 :: Slaves of Fear",
      "2 Musical style",
      "3 Members",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Remix albums",
      "4.3 Splits",
      "4.4 Singles",
      "4.5 Music videos",
      "4.6 Soundtracks",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Health (often stylized as HEALTH) is an American noise rock band from Los Angeles, California.\n"
      ]
   },
   "Title": "Health (band) - Wikipedia"
}