{
   "Name": "Hellogoodbye",
   "rawData": [
      "Hellogoodbye (sometimes styled as hellogoodbye) is a pop rock band that was formed in Huntington Beach, California in 2001 by singer Forrest Kline. They were signed to Drive-Thru Records and released their first full-length album Zombies! Aliens! Vampires! Dinosaurs! in 2006, in addition to their previously released EP Hellogoodbye and DVD OMG HGB DVD ROTFL. In 2010, the band released Would It Kill You? on their label Wasted Summer Records. The album was released in the United Kingdom and Europe by LAB Records on the 14 March 2011. Hellogoodbye released their third album, Everything Is Debatable, on October 29, 2013, while touring as the opening act for Paramore's The Self-Titled Tour. Their fourth album, S'Only Natural, was released on October 5, 2018.\n",
      "Hellogoodbye started in 2001 as a recording project by Huntington Beach High School students Forrest Kline and Jesse Kurvink. With the interest only to entertain friends and woo crushes, Kline and Kurvink recorded some songs on Forrest's home computer. The first Hellogoodbye song ever written was Kurvink's \"Bonnie Taylor Shakedown 2K1\" which later appeared on their debut self-titled EP. With Kline's interest in web and graphic design, the unofficial group got a working title and a website and posted songs on MP3.com. As interest in the music grew, Kline recruited friends and chanced upon some opening slots at local shows.\n",
      "In the first two years the group played local shows in Orange County at venues such as the Chain Reaction (Anaheim, California), The Hub (Fullerton, California), and Koo's Cafe (Long Beach, California), made a few trips to play in Arizona, and did one mini-tour through Arizona, New Mexico, and Texas with the band Peachcake. During this time they kept busy burning demos, screen printing tee-shirts and promoting via their website before signing to Drive-Thru Records in 2003.\n"
   ],
   "infobox": {
      "Origin": [
         "Huntington Beach, California"
      ],
      "Genres": [
         "Indie pop[1]",
         "power pop[1]",
         "pop punk[1]",
         "emo pop[1]",
         "synthpop"
      ],
      "Years active": [
         "2001–present"
      ],
      "Labels": [
         "Drive-Thru",
         "Wasted Summer",
         "LAB",
         "Old Friends"
      ],
      "Associated acts": [
         "Say Anything",
         "JamisonParker",
         "The Early November"
      ],
      "Members": [
         "Forrest Kline",
         " Augie Rampolla",
         " Eric Hehr",
         " Michael Nielsen"
      ],
      "Past members": [
         "Parker Case",
         " Chris Profeta",
         " Marcus Cole ",
         " Jesse Kurvink ",
         " Paul Michael White Jr. ",
         "Joseph Marro ",
         " Ryan Daly ",
         " Aaron Flora ",
         " Michael Nielsen ",
         " Travis Head",
         " Michael Garzon",
         " Andrew Richards"
      ]
   },
   "albums": [
      "Hellogoodbye",
      "Remixes!",
      "The \"All of Your Love\" Remixes EP",
      "Ukulele Recordings",
      "When We First Met"
   ],
   "prunedData": [
      "[BAND_NAME] (sometimes styled as hellogoodbye) is a [GENRE] band that was formed in Huntington Beach, California in [YEAR] by singer Forrest Kline. They were signed to Drive-Thru [PERSON_NAME_LAST_0] and released their first full-length album Zombies! Aliens! Vampires! Dinosaurs! in [YEAR], in addition to their previously released EP [BAND_NAME] and DVD OMG HGB DVD ROTFL. In [YEAR], the band released Would It Kill You? on their label Wasted [PERSON_NAME_FULL_0_MALE]. The album was released in the United Kingdom and Europe by LAB [PERSON_NAME_LAST_0] on the 14 [MONTH] [YEAR]. [BAND_NAME] released their third album, Everything Is Debatable, on [MONTH] 29, [YEAR], while touring as the opening act for Paramore's The Self-Titled Tour. Their fourth album, S'Only Natural, was released on [MONTH] 5, [YEAR].\n",
      "[BAND_NAME] started in [YEAR] as a recording project by Huntington Beach High School students [PERSON_NAME_FULL_1_MALE] and [PERSON_NAME_FULL_0_MALE]. With the interest only to entertain friends and woo crushes, [PERSON_NAME_LAST_1] and [PERSON_NAME_LAST_0] recorded some songs on [PERSON_NAME_FIRST_1]'s home computer. The first [BAND_NAME] song ever written was [PERSON_NAME_LAST_0]'s [SONG_NAME] which later appeared on their debut self-titled EP. With [PERSON_NAME_LAST_1]'s interest in web and graphic design, the unofficial group got a working title and a website and posted songs on MP3.com. As interest in the music grew, [PERSON_NAME_LAST_1] recruited friends and chanced upon some opening slots at local shows.\n",
      "In the first two years the group played local shows in Orange County at venues such as the Chain Reaction (Anaheim, California), The Hub (Fullerton, California), and Koo's Cafe (Long Beach, California), made a [GENRE] band Peachcake. During this time they kept busy burning demos, screen printing tee-shirts and promoting via their website before signing to Drive-Thru Records in [YEAR].\n"
   ]
}