{
   "Discography": {
      "Albums": {},
      "Compilations": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "Formation": {
         "text": [
            "Guitarist Eddie Vincent and drummer Tad Malone, known mononymously as Tad, having played together in Los Angeles with various bands since the early seventies, found themselves in London after touring Europe and North Africa with Swiss rocker and performance artist Bernard Constantin during the summer of 1977. Returning to L.A. they were inspired to form the power trio they dubbed the Hollywood Squares with bass player Spider Cobb (aka Bob Schell). Cobb had migrated to L.A. in early 1977 to work as an arranger.\n",
            "The group rehearsed and experimented for several months in the San Fernando Valley garage of a disc-jockey friend, collaborating on new material and reworking classics. Vincent's songs explored themes of alienation and angst, propelled by the raw, unrelenting, and occasionally Bartókian backdrop of an extremely loud power trio. In fact, the band was so loud that Cobb suggested rehearsing with headsets, a practice which became part of the group's signature in their rare, live performances as well.\n"
         ]
      },
      "Post break-up": {
         "text": [
            "After Cobb's departure Vincent and Tad recruited bassist Laura Crowe, dubbing this new power trio The Firm (many years before the Jimmy Page/Paul Rodgers collaboration of the same name). Playing new original material, they performed at several Los Angeles clubs including the Troubadour. Although garnering positive reviews and record label interest, they were ultimately unsuccessful in landing a recording contract and split up in late 1979. Laura Crowe later joined the American punk band Chainsaw.\n",
            "At around the same time, after a stint with Badfinger, Cobb formed the new wave group Debbi and the Digits in Los Angeles with partner Debbi Meadows. Later drummer Tad joined the group after the breakup of The Firm. In early 1981 Vincent joined the Digits, replacing departing guitarist, Dana Ferris (Moon Martin). Keyboardist Carl Dahlgren (aka Carbon Unit), Tad and Vincent left the group during a 1981 Canadian tour. Cobb formed his own production and music publishing companies and re-focused on recording.\n",
            "Eddie Vincent has continued to perform and record.  His most recent CD, \"Extended Play\" will be available for sale and download in late summer 2018.\n"
         ]
      },
      "Recordings and performances": {
         "text": [
            "At an early rehearsal, Vincent played his latest composition—an ironic, tongue-in-cheek peek into the twisted mind of the Hillside Strangler, a then-unknown serial killer who was terrorizing the city at the time. After some soul searching about the subject matter and the safety of loved ones, the group booked four hours (all they could afford) in an eight-track studio (the original Music Grinder on Melrose in Hollywood).\n",
            "Cobb invited friend and freelance recording engineer Ron Hitchcock to stop by and \"look over the house engineer's shoulder\", eventually persuading him to engineer and master two tracks, \"Hillside Strangler\" and \"Hollywood Square\", for a 7-inch 45 RPM single. In return, the trio credited Hitchcock on the record label as producer and publisher. Eddie Vincent regained composition and publishing rights (through ARMOP Music Publishing Ltd.) in 2006.\n",
            "Upon release, most of the 500 records pressed went to Greg Shaw's Bomp! Records, through whom they were retailed at Bomp's North Hollywood store and wholesaled worldwide. The record sold out fast, quickly gaining cult-classic status.\n",
            "The Hollywood Squares handled their own local radio promotion. They gave Rodney Bingenheimer a copy of the single at the back door of KROQ's Pasadena studios one Sunday evening during a break on his radio show, \"Rodney On The ROQ\", and Bingenheimer debuted \"Hillside Strangler\" within the hour. Claude Bessey, who was one of Rodney's guests at the time, opined: \"I'll give it a 10 - you can pogo to it.\" Also among those who initially aired \"Hillside Strangler\" was radio personality Dr. Demento, who described it urbanely on his nationally syndicated program as a tale about someone \"who's not much fun at parties\".\n",
            "\"Hillside Strangler\" promptly charted in Record World's New Wave Hit Parade, eliciting favorable comment from reviewers. Bessey, writing in Slash Magazine, called it a \"Mysterioso release from [a] mysterioso group\", noting that, in contrast to many of their fellow L.A. bands, the Hollywood Squares rarely performed in public. The original recording is still logged regularly on the playlists of college and counterculture radio stations, discussed on boards and blogs, and sought in its rare, original format by collectors.\n",
            "In August 1978, The Hollywood Squares signed a production and publishing deal with Hitchcock, and five performances were subsequently recorded—three originals and two covers: \"Ashes and Dust\" (Vincent), \"Organized Crime\" (Vincent), \"Alienation In L.A.\" (Vincent, Spider Cobb), \"Here Comes The Weekend\" (Paul Weller), and \"Summer In The City\" (John Sebastian). \"Alienation in L.A.\" also debuted on Rodney on the ROQ, when the band brought a test pressing of the planned but never-released new single to Rodney Bingenheimer's show.\n",
            "Hitchcock shopped the first four tracks around to major record labels but, when efforts to sign the Squares proved unsuccessful, he returned to engineering for mainstream artists. The master recordings were shelved and, by the end of 1978, the Squares had gone their separate ways.\n",
            "All but two of The Hollywood Squares' studio recordings (\"Alienation In L.A.\" and \"Summer In The City\") were released in October 2006 on vinyl LP by Italian company, RaveUp Records. The LP, Hillside Strangler: Restrangled, includes the original masters of \"Hillside Strangler\" and \"Hollywood Square\", and four live tracks recorded at the Whisky A Go Go in 1978.  \nHitchcock Media released Hillside Strangler: Restrangled on CD in November 2006. In December 2006, RaveUp began offering \"Alienation In L.A.\" as a free download.\n",
            "Continued interest, bolstered by the Internet, resulted in a bootleg copy of the single with a black cover and red printing (as opposed to the original, with white sleeve and black printing) being issued in Seattle in the 1990s.  Since then, \"Hillside Strangler\" has appeared on the UK compilation \"Punk 45: Kill The Hippies! Kill Yourself! The American Nation Destroys Its Young - Underground Punk In The United States Of America, 1973-1980 Vol. 1\", released in 2013, and \"Hollywood Square\" on the UK compilation \"Punk 45: Chaos In The City Of Angels And Devils (Hollywood From X To Zero & Hardcore On The Beaches: Punk In Los Angeles 1977-81)\", released in 2016, both by Soul Jazz Records Ltd.  In addition, Soul Jazz released a 5-single vinyl box set in 2018 entitled \"Approaching the Minimal With Spray Guns\" which includes a replica of the original single, along with replicas of singles by X_X, Bizarros, Rubber City Rebels, THe Flesh Eaters, and The Scabs.\n"
         ]
      }
   },
   "Sections": [
      "1 History",
      "1.1 Formation",
      "1.2 Recordings and performances",
      "1.3 Post break-up",
      "2 Discography",
      "2.1 Singles",
      "2.2 Albums",
      "2.3 Compilations",
      "3 Trivia",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "The Hollywood Squares were an American band formed in Los Angeles, California, United States, in 1977. They are probably best known for their song \"Hillside Strangler\". Released in a very limited edition on the trio's own Square Records label, the issue quickly sold out and has since become a highly sought-after collectible. The single has reappeared in various bootleg incarnations over the years including the 1989 compilation album Killed By Death #1. The original master tapes were used on the LP and CD Hillside Strangler: Restrangled, released in 2006.\n"
      ]
   },
   "Title": "The Hollywood Squares (band) - Wikipedia",
   "Trivia": {}
}