{
   "Name": "The Hollywood Squares (band)",
   "rawData": [
      "The Hollywood Squares were an American band formed in Los Angeles, California, United States, in 1977. They are probably best known for their song \"Hillside Strangler\". Released in a very limited edition on the trio's own Square Records label, the issue quickly sold out and has since become a highly sought-after collectible. The single has reappeared in various bootleg incarnations over the years including the 1989 compilation album Killed By Death #1. The original master tapes were used on the LP and CD Hillside Strangler: Restrangled, released in 2006.\n",
      "Guitarist Eddie Vincent and drummer Tad Malone, known mononymously as Tad, having played together in Los Angeles with various bands since the early seventies, found themselves in London after touring Europe and North Africa with Swiss rocker and performance artist Bernard Constantin during the summer of 1977. Returning to L.A. they were inspired to form the power trio they dubbed the Hollywood Squares with bass player Spider Cobb (aka Bob Schell). Cobb had migrated to L.A. in early 1977 to work as an arranger.\n",
      "The group rehearsed and experimented for several months in the San Fernando Valley garage of a disc-jockey friend, collaborating on new material and reworking classics. Vincent's songs explored themes of alienation and angst, propelled by the raw, unrelenting, and occasionally Bartókian backdrop of an extremely loud power trio. In fact, the band was so loud that Cobb suggested rehearsing with headsets, a practice which became part of the group's signature in their rare, live performances as well.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1977–1978"
      ],
      "Labels": [
         "Square",
         "Bomp!",
         "RaveUp",
         "BluSide"
      ],
      "Associated acts": [
         "Badfinger",
         "Debbi and the Digits",
         "The Firm (L.A.)"
      ],
      "Past members": [
         "Eddie Vincent - vocals, guitar",
         "Spider Cobb - bass guitar, guitar, keyboards, vocals",
         "Tad - drums, vocals"
      ]
   }
}