{
   "Name": "Horse the Band",
   "rawData": [
      "Horse the Band (stylized as HORSE the band) is an American metalcore band from Lake Forest, California who are best known for their 8-bit video game-influenced sound combined with metalcore. Frontman Nathan Winneke once jokingly described their sound as \"Nintendocore,\" although the band have gone to lengths to distance themselves from the label, reiterating that this merely describes the sound, not the substance.\n",
      "HORSE the Band was started in Lake Forest, CA in 1998 while founding members Erik Engstrom and David Isen were attending El Toro High School. The original lineup included vocalists Adam Crook and Risto Metso, drummer Jason Karuza and bassist Jason Roberts. At the time, the band had a more traditional hardcore punk style. From late 2000 onwards, the band had a stable lineup with Engstrom and Isen, vocalist Adam Crook, drummer Jason Karuza and bassist Nathan Winneke, who had previously stood in as drummer for Karuza, and recorded their self-produced album Secret Rhythm of the Universe in 2001.\n",
      "The band booked its own tours starting the summer of 2002, including a three-month tour spanning seven countries, and also released the EP Beautiful Songs by Men. In late 2002, vocalist Adam Crook left the band so that he could continue his formal education. Following his departure, bassist Nathan Winneke took over vocal duties, while Andy Stokes replaced him on bass.\n"
   ],
   "infobox": {
      "Origin": [
         "Lake Forest, California, United States"
      ],
      "Genres": [
         "Metalcore[1][2][3]",
         "Nintendocore[3][4][5]",
         "chiptune[6]"
      ],
      "Years active": [
         "1998–present"
      ],
      "Labels": [
         "Combat, Koch, Pluto, LIF, Vagrant, Roadrunner"
      ],
      "Associated acts": [
         "Mavenjones[7]"
      ],
      "Website": [
         "www.horsetheband.com"
      ],
      "Members": [
         "Erik Engstrom",
         "David Isen",
         "Nathan Winneke",
         "Daniel Pouliot",
         "Jeremiah Bignell"
      ],
      "Past members": [
         "Jason Karuza",
         "Risto Metso",
         "Jason Roberts",
         "Adam Crook",
         "Guy Morgenshtern",
         "Andy Stokes",
         " Eli Green",
         "Dashiel Arkenstone",
         "Chris Prophet"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (stylized as HORSE the band) is an [GENRE] band from Lake Forest, California who are best known for their 8-bit video game-influenced sound combined with metalcore. Frontman Nathan Winneke once jokingly described their sound as \"Nintendocore,\" although the band have gone to lengths to distance themselves from the label, reiterating that this merely describes the sound, not the substance.\n",
      "HORSE the Band was started in Lake Forest, CA in [YEAR] while founding members [PERSON_NAME_FULL_2_MALE] and David Isen were attending [PERSON_NAME_FULL_4_FEMALE]. The original lineup included vocalists Adam Crook and [PERSON_NAME_FULL_1_MALE], drummer [PERSON_NAME_FIRST_0] Karuza and bassist [PERSON_NAME_FULL_0_MALE]. At the time, the band had a more traditional hardcore punk style. From late [YEAR] onwards, the band had a stable lineup with [PERSON_NAME_LAST_2] and Isen, vocalist Adam Crook, drummer [PERSON_NAME_FIRST_0] Karuza and bassist [PERSON_NAME_FULL_3_MALE], who had previously stood in as drummer for Karuza, and recorded their self-produced album Secret Rhythm of the Universe in [YEAR].\n",
      "The band booked its own tours starting the summer of [YEAR], including a three-month tour spanning seven countries, and also released the EP Beautiful Songs by Men. In late [YEAR], vocalist Adam Crook left the band so that he could continue his formal education. Following his departure, bassist [PERSON_NAME_FULL_0_MALE] took over vocal duties, while Andy Stokes replaced him on bass.\n"
   ]
}