{
   "Name": "Hotwire (band)",
   "rawData": [
      "Hotwire was an American alternative metal band from Newbury Park, California.\n",
      "Hotwire's members met at Newbury Park High School. After recording demos, they began opening for Will Haven, Strife, Hoobastank, and Audiovent but also garnered large support at the Troubadour in Los Angeles with an extended residency spanning six months. After signing with RCA Records in December 2000, they continued to tour taking slots supporting such diverse acts as Mogwai, Ben Harper, Iggy Pop and The Stooges, Björk, Darkest Hour, Bloodlet, Wu-Tang Clan, Poison The Well, Killswitch Engage, The Dillinger Escape Plan, and Atreyu. They released a four-track EP in 2002 before issuing their full-length album, The Routine in the summer of 2003. They followed the release of the album with a slot on the Ozzfest tour that year as well as making time for the Fuji Rock Festival in Japan. A single from the album, \"Not Today\", became a minor success on American rock radio, peaking at No. 40 on the Billboard Mainstream Rock chart. The band broke up soon after the Ozzfest tour despite accumulating much new material, citing both mismanagement of funds by their management and personal reasons.\n",
      "Gabriel, Rus and Brian are now under Coming Home Records and all participate in their respective projects.\n"
   ],
   "infobox": {
      "Origin": [
         "Newbury Park, California"
      ],
      "Genres": [
         "Alternative metal",
         "nu metal",
         "hard rock"
      ],
      "Years active": [
         "1999–2003"
      ],
      "Labels": [
         "RCA Records",
         "Chromium Bitch"
      ],
      "Associated acts": [
         "WarWidow",
         "St. Malaclypse",
         "Beware The Idols",
         "Deadbirds",
         "Skyscraper Frontier",
         "Mellowdrone",
         "The Transfatal Express",
         "Fake Figures"
      ],
      "Past members": [
         "Gabriel Garcia",
         "Russ Martin",
         "Dan Hartman",
         "Chris Strauser",
         "Brian Borg",
         "Jon Peloso",
         "Alexander Zapata"
      ]
   },
   "albums": [
      "Monkeywrench",
      "Hotwire",
      "The Routine"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Newbury Park, California.\n",
      "[BAND_NAME]'s members met at Newbury Park High School. After recording demos, they began opening for Will Haven, Strife, Hoobastank, and Audiovent but also garnered large support at the Troubadour in Los Angeles with an extended residency spanning six months. After signing with RCA Records in [MONTH] [YEAR], they continued to tour taking slots supporting such diverse acts as Mogwai, [PERSON_NAME_FULL_0_MALE], Iggy Pop and The Stooges, Björk, Darkest Hour, Bloodlet, Wu-Tang Clan, Poison The Well, Killswitch Engage, The Dillinger Escape Plan, and Atreyu. They released a four-track EP in [YEAR] before issuing their full-length album, The Routine in the summer of [YEAR]. They followed the release of the album with a slot on the Ozzfest tour that year as well as making time for the Fuji Rock Festival in Japan. A single from the album, [SONG_NAME], became a minor success on American rock radio, peaking at No. 40 on the Billboard Mainstream Rock chart. The band broke up soon after the Ozzfest tour despite accumulating much new material, citing both mismanagement of funds by their management and personal reasons.\n",
      "Gabriel, Rus and Brian are now under Coming Home Records and all participate in their respective projects.\n"
   ]
}