{
   "Band members": {
      "text": [
         "Current members\n",
         "Former Members:\n"
      ]
   },
   "Discography": {
      "Billboard chart": {},
      "Compilation albums": {},
      "Live albums": {},
      "Singles": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "text": [
         "House of Lords was formed in 1987 by former Angel member and keyboardist Gregg Giuffria after his solo project Giuffria. After listening to demos – originally intended for Giuffria's third record – a record deal with Gene Simmons' company Simmons Records was agreed upon, on two conditions that the band's name be changed (to House of Lords) and a new lead singer recruited (firing David Glen Eisley in the process).[2] James Christian thus replaced Eisley, after Christian was suggested by ex-Giuffria and Quiet Riot bassist Chuck Wright,[3] after having worked together in L.A. Rocks.\n",
         "House of Lords' eponymous debut was released in 1988, featuring a heavier sound than Giuffria with a lower keyboard mix. The album received critical acclaim and the band toured with Cheap Trick, Ozzy Osbourne and the Scorpions in 1989.\n",
         "The album featured one minor hit, \"I Wanna Be Loved\" (Hot 100 No. 58). The Stan Bush penned \"Love Don't Lie\" was the second single but despite MTV airplay, failed to chart. After touring, original guitarist Lanny Cordola left in 1990, replaced by ex Shark Island's Michael Guy.\n",
         "Their next effort was 1990s Sahara and featured a list of guest musicians. Other notable contributions to the album came from Doug Aldrich, Rick Nielsen, Chris Impellitteri, Mandy Meyer, David Glen Eisley, Robin Zander, Mike Tramp, Steve Plunkett and Ron Keel. Deliberately more guitar-oriented than the debut, the album hit No. 120 on the charts and in the wake of the successful single \"Can't Find My Way Home\" (a Blind Faith cover). The single & video also did well on Album Rock radio peaking at No. 10. The second single \"Remember My Name\" was a bigger hit hitting No. 72 on the Hot 100 and a Top 5 regular on DIAL MTV. Soon after, bassist Chuck Wright and drummer Ken Mary left the band.\n",
         "Promoting Sahara, House of Lords toured with Nelson, did a short tour with 38 Special, and a final show with Warrant and Tesla at the Universal Amphitheater in Hollywood.[4] Christian cites this as one of his favorite shows with House of Lords.[4]\n",
         "For 1992's release Demons Down, House of Lords had left BMG.[4] Christian says of Demon's Down: \"This album turned out fabulous.  We had a great budget and turned in a beautifully crafted album with great songs, no fillers.  I was totally happy with the record and hoped we could really take this album right to the top of the charts.\" Alongside Christian and Giuffria, line-up changes for Demons Down consisted of a new drummer Tommy Aldridge, a new bass player in Sean McNabb (ex Quiet Riot), and a new guitar player in Dennis Chick (ex-V.V.S.I.).[4] The album spawned two singles, the title track and the ballad \"What's Forever For\".\n",
         "The arrival of Grunge would impact on the airplay and overall success of Demons Down.[4] The band broke up in 1993 despite recording demos to shop for a new label. After the band broke up, guitarist Dennis Chick joined Freak of Nature, the band formed by Mike Tramp after the break-up of White Lion. Chick played on both of their studio albums, released in 1993 and 1994.[5] James Christian recorded and released \"Rude Awakening\" and spent a short time in the line up of Manic Eden.[4]\n",
         "After legal delays over the rights to the band name the group reformed in 2000, featuring an extended line up of Christian, Giuffria, Cordola, Guy, Mary, and Wright, although Guy soon departed.\n",
         "Two years later The Power and the Myth was finished but it was 2004 before it was released by Frontiers Records. The album marked the return of Chuck Wright, Lanny Cordola and Ken Mary, but is the first not to feature Giuffria, who had left the project with keyboard work done by guests Derek Sherinian, Allan Okuye, Sven Martin and Ricky Phillips. Directly after The Power and the Myth was released, Christian released his second solo CD, Meet The Man. House of Lords contacted Jeff Kent to take over the writing of lyrics and melodies due to the band's lowest scores since its inception. After Jeff Kent was finished, the band scored 96% on the 2006 CD World Upside Down with 10 of Kent's lyrical and melodic compositions, and 97% of the 2008 CD Come to My Kingdom with 13 of Kent's lyrical and melodic compositions.\n",
         "After a further reunion in 2005 for the Firefest festival in the UK, House of Lords released a new album, World Upside Down, adding songwriter Jeff Kent/melody & lyric writer and keyboardist, guitarist Jimi Bell, bassist Chris McCarvill, and drummer B.J. Zampa. Kent also played all the keyboard parts on the 2005 Frontier Record release.\n",
         "A live album Live in the UK was released in January 2007.\n",
         "In 2008, the band released their sixth studio album Come to My Kingdom. The album featured the same line-up as World Upside Down, and was produced by frontman James Christian and frequent collaborator Jeff Kent (who played bass prior to McCarvill's joining), who also co-wrote most all of the album's vocal melodies and lyrics. Bassist Chris McCarvill left the band just before the CTMK release due to prior touring commitments with Dokken. He was replaced by Matt McKenna who recorded bass for the band's next album Cartesian Dreams and performed on all the Come to My Kingdom tour dates. The group embarked on a world tour of 39 cities throughout Europe, Brazil, and the United States, commencing between March–July 2008, including main stage performances at Hard in Rio, Rocklahoma and the South Texas Rockfest festivals.\n",
         "On September 18, 2009, the band's seventh studio album Cartesian Dreams was released. Although bass was recorded by Matt McKenna, Chris McCarvill had rejoined the band following the recording and played bass on the supporting tour for the album in September–November 2009. Jeff Kent produced the album along with Christian, although this time around he did not contribute any songwriting to the album.\n",
         "On July 26, 2011, it was announced that the band would release their eighth studio album Big Money on September 23, 2011, in Europe and September 27 in North America. The album was recorded with the same line-up as the 2008 album Come to My Kingdom, including bassist Chris McCarvill, and was promoted with a European tour in October 2011, the band's first tour since 2009.[6]\n",
         "James Christian released his third solo album, Lay It All On Me in 2013.[7]\n",
         "In 2014 House of Lords released their ninth studio album, Precious Metal. The album was recorded with the same line-up as the 2008 album Come to My Kingdom.[8]\n",
         "In April 2015 it was announced that House of Lords tenth studio album Indestructible would be released in the EU on June 5 and June 9 in North America. The album was recorded with the same line-up as the 2008 album Come to My Kingdom,[9] this line-up celebrating ten years together.\n",
         "According to Christian: The name Indestructible was chosen because we all felt that we have been through a lot in our long careers and what better way to say, 'Hey, I'm still here' than by giving the CD a bold title. He adds: 'Indestructible' features eleven brand new songs... ...The album is heavier in the beginning, but we love songs that are both melodic and heavy, and the idea was to fill the best of both on one CD without sounding like two different bands. I think we have accomplished that.[10]\n",
         "In addition to announcing an appearance at the Frontiers Rock Festival in Trezzo (MI), Italy on April 12, 2015, jameschristian.com stated 'a European tour in September, with a very special surprise show to be announced soon. More details soon!'[9] As part of the Indestructible Tour 2015, House of Lords performed in Japan at Loudpark 2015 on October 10, 2015. The Indestructible tours started in Helsinki, Finland on September 25 and concluded on October 19 in Pratteln, Switzerland. A U.S. date on October 23 followed.[11]\n",
         "In January 2017 it was announced that House of Lords eleventh studio album Saint Of The Lost Souls would be released on March 24. According to a Frontiers press release the album was recorded with essentially the same line-up as previous albums, the only change being Chris Tristram replacing Chris McCarvill on bass guitar.[12]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Band members",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Singles",
      "3.3 Compilation albums",
      "3.4 Live albums",
      "3.5 Billboard chart",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "House of Lords is a rock band based out of Connecticut, with members in New Jersey and Florida.\n"
      ]
   },
   "Title": "House of Lords (band) - Wikipedia"
}