{
   "Name": "The Human Abstract (band)",
   "Sections": [
      "1 History",
      "1.1 Formation and Nocturne (2004–2007)",
      "1.2 Midheaven (2008–2009)",
      "1.3 E1 and Digital Veil (2009–current)",
      "2 Band members",
      "2.1 Timeline",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Extended plays",
      "3.3 Music videos",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Human Abstract is an American metalcore band from Los Angeles, California. Formed in 2004, the group was originally signed to the independent label Hopeless Records, the band then released the two albums Nocturne (2006) and Midheaven (2008) before signing to eOne Music and releasing Digital Veil (2011). The Human Abstract has gone through several lineup changes over the years, with the current consisting of founding members Dean Herrera, A.J. Minette and Brett Powell, in addition to Henry Selva and Travis Richter.\n"
      ]
   },
   "History": {
      "Formation and Nocturne (2004–2007)": {
         "text": [
            "The Human Abstract formed in Los Angeles, California in 2004 with guitarists Dean Herrera and A.J. Minette, drummer Brett Powell, bassist Kenny Arehart, and vocalist Nick Olaerts. The group's name was derived from the title of a William Blake poem published in Songs of Experience in 1794. The band soon released a two-track demo to sell at live performances. They would later record additional demos with Jonny Santos of Spineshank and Silent Civilian, and Logan Mader formerly of Machine Head, Soulfly and Medication.[4] The Human Abstract signed to the independent record label Hopeless Records in 2005.[5]\n",
            "In late 2006, Nick Olaerts was replaced by Nathan Ells before heading into the studio to record the band's first full-length release, Nocturne. They released their debut album on Hopeless Records on August 22, 2006.\n"
         ]
      },
      "Midheaven (2008–2009)": {
         "text": [
            "Their  album Midheaven was released on August 19, 2008.\n",
            "In the past they have toured with bands such as All That Remains, The Devil Wears Prada, As I Lay Dying, God Forbid, Misery Signals, Every Time I Die, The Bled, August Burns Red, Shai Hulud, Folly, Drop Dead Gorgeous, Protest the Hero, It Dies Today, Mushroomhead, Mnemic, Goatwhore, Look What I Did, Arsis, and The Chariot.\n",
            "The Human Abstract performed on 2007's Vans Warped Tour and 2008's Take Action Tour featuring Every Time I Die, From First To Last, The Bled, and August Burns Red. In fall 2008, they toured with the Japanese band Dir en grey.\n",
            "Nathan Ells addressed a situation regarding A.J. Minette in an interview stating, \"A.J. was tired of playing metal, plain and simple, and the rest of the band wants to continue the high-energy live shows and hard edged sound that we have fashioned and developed over the past two years.\"[6]\n",
            "Minette was quoted as saying \"I don't feel like I can get onstage and feel honest about playing metal anymore.\" The rest of the band felt that totally changing the sound would have been \"like a smack in the face to all those that had been coming out and supporting the shows.\"[7]\n",
            "As of January 9, 2009, Henry Selva was named permanent bass player for the group. Selva originally filled in after Kenny Arehart's departure in 2006.\n"
         ]
      },
      "E1 and Digital Veil (2009–current)": {
         "text": [
            "In September 2009, the band began co-writing material for the new album, Digital Veil, with A.J. Minette. Minette also served as producer on the album. It was also announced that the band would be parting ways with vocalist Nathan Ells and they had begun a search for a new vocalist. On March 29, 2010 it was announced the band had found a new vocalist, and on April 7 it was announced that The Color of Violence and former From First to Last guitarist Travis Richter had become Ells' replacement.[8]\n",
            "In November 2009, Herrera confirmed through a Myspace blog that Leonard was no longer in the band, \"Sean is not technically in the band anymore... However, we have not ruled out the possibility of him having some sort of presence on the next record.  He decided that touring wasn't for him, and wanted to go to music school.\"\n",
            "In April 2010 Travis Richter revealed to Absolutepunk.net in his first interview since becoming The Human Abstract's new frontman that A.J. Minette had officially returned.[9]\n",
            "The Human Abstract released their first single \"Faust\" from Digital Veil on November 16, 2010.\n",
            "On January 10, 2011 The Human Abstract announced that they had signed to E1 Music, and that their new album Digital Veil would be released through E1 on March 8, 2011.\n",
            "The song \"Patterns\" was released January 18, 2011, followed by \"Complex Terms\" on February 15, 2011.\nDigital Veil was produced and written by A.J. Minette, engineered by Will Putney (Lamb Of God, Chiodos), and mastered by Jamie Fergus-Jean.\n",
            "There was some speculation that Andrew Tapley is not in the band anymore, as he is no longer listed as a member on the band's Facebook profile. On February 9, 2011, Tapley confirmed this speculation via Facebook with the public message:\n",
            "As some of you know and many have been wondering, I will not be playing with The Human Abstract anymore. This wasn't decided by me; however, there are no hard feelings. Thanks to everyone who supported the band these past few years and to all the wonderful friends I had the pleasure of meeting. I will be in Los Angeles continuing with music; art is long and time is fleeting --see y'all soon!",
            "A few weeks after Digital Veil's release, they announced that they would embark on what would be called the \"Pull Me From The Gallows\" Tour with Scale the Summit. Its name comes from a line in their latest album's title track. The band has posted an update via Facebook on 31 May that the remaining dates will be canceled \"...due to a sudden and devastating loss to the THA family.\" [10]\n",
            "As of 24 August 2011, Travis Richter parted ways with the band, citing a desire to focus on his girlfriend and amateur electronic music side of his career.\n",
            "It has been announced that Ryan Devlin, frontman from the band Corelia, will be filling in for the \"Frak the Gods Tour\" headlined by Periphery.[11]\n",
            "On December 29, 2011 bassist Henry Selva, when questioned over why he was selling equipment, announced that the band was calling it quits. \"Folks, we are not looking for a new vocalist. We are not touring anytime soon. I think it's only fair you guys know that we're on \"break or hiatus if you will.\" I don't know why we haven't said anything. I guess it's because there is always that \"maybe if something happens, etc..etc...\" Or maybe it's hard for us to realize the reality of our situation, the bands situation, to finally let go. I'll be honest when I say the following: Periphery and Never Say Die were our last tours together as a band.\"[12]\n",
            "On February 8th, 2012 guitarist Dean Herrera was asked on his Formspring page whether they would've broken up even if Richter hadn't left the band. Herrera had replied stating that the band had never actually come together to decide the fate of the band. \"as far as I'm concerned we aren’t broken up, that was Henry going out and spewing the inner workings of the band. We never actually came together and decided anything. I’m still real pissed at him for that. Sure we’re taking time, but that doesn’t mean anything other than that... Taking time.. As far as Travis.... who knows... can’t say what might have happened.\"[13] On July 16, 2012, via his personal Facebook profile, vocalist Travis Richter expressed a desire to return and make another album with the band if the other members reconciled their differences. Richter said, \"Life would be a lot easier if we could just make another human abstract record - music for me is only alive when there are releases - even touring is second when you create art on that level.\"[14]\n",
            "On February 14, 2012, The Human Abstract released a cover EP of Beethoven's 3-movement \"Moonlight Sonata\".  All guitars were recorded by Dean Herrera during the Digital Veil recording sessions with engineer Will Putney in 2010. The EP is available on iTunes and Xbox music.\n",
            "In 2013, E1 dropped the band.\n"
         ]
      }
   },
   "Band members": {
      "Timeline": {},
      "text": [
         "\n",
         "\n",
         "\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Extended plays": {},
      "Music videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Human Abstract is an American metalcore band from Los Angeles, California. Formed in 2004, the group was originally signed to the independent label Hopeless Records, the band then released the two albums Nocturne (2006) and Midheaven (2008) before signing to eOne Music and releasing Digital Veil (2011). The Human Abstract has gone through several lineup changes over the years, with the current consisting of founding members Dean Herrera, A.J. Minette and Brett Powell, in addition to Henry Selva and Travis Richter.\n",
      "The Human Abstract formed in Los Angeles, California in 2004 with guitarists Dean Herrera and A.J. Minette, drummer Brett Powell, bassist Kenny Arehart, and vocalist Nick Olaerts. The group's name was derived from the title of a William Blake poem published in Songs of Experience in 1794. The band soon released a two-track demo to sell at live performances. They would later record additional demos with Jonny Santos of Spineshank and Silent Civilian, and Logan Mader formerly of Machine Head, Soulfly and Medication.[4] The Human Abstract signed to the independent record label Hopeless Records in 2005.[5]\n",
      "In late 2006, Nick Olaerts was replaced by Nathan Ells before heading into the studio to record the band's first full-length release, Nocturne. They released their debut album on Hopeless Records on August 22, 2006.\n",
      "Their  album Midheaven was released on August 19, 2008.\n"
   ]
}