{
   "Name": "Whirr (band)",
   "rawData": [
      "Whirr is an American shoegaze band from the San Francisco Bay Area. The group formed in 2010, originally as Whirl, but had to legally change its name after a woman performing acoustic covers of Black Sabbath songs trademarked the name and threatened a lawsuit. Whirr's shoegaze sound is often compared to My Bloody Valentine and Slowdive. Founding guitarist Nick Bassett also played in the band Deafheaven surrounding and including the release of their 2011 album Roads to Judah.\n",
      "Whirr self-released a demo cassette and the EP Distressor before signing to Tee Pee Records in 2011. The band released June that year, followed by their 2012 debut album, Pipe Dreams. The latter was met with a generally positive reception from music critics.\n",
      "Whirr released the Around EP on July 9, 2013, and toured to support it that August with the band Nothing. As a result of touring together, members of Nothing and Whirr formed a side project called Death of Lovers, and Whirr and Nothing released a split EP. Bassett then joined Nothing on bass and toured with them. Bassett also started a new indie pop project with former Whirr vocalist Alexandra Morte called Camera Shy, while guitarist Joseph Bautista joined Best Coast.\n"
   ],
   "infobox": {
      "Also known as": [
         "Whirl"
      ],
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Shoegaze",
         "post-rock",
         "noise rock",
         "alternative rock"
      ],
      "Years active": [
         "2010 (2010)–present"
      ],
      "Labels": [
         "Graveface",
         "Tee Pee"
      ],
      "Associated acts": [
         "Deafheaven",
         "Death of Lovers",
         "Nothing",
         "Camera Shy",
         "Best Coast",
         "Night School",
         "King Woman",
         "Fawning",
         "Pink Slip"
      ],
      "Website": [
         "freewhirl.com"
      ],
      "Members": [
         "Nick Bassett",
         "Joseph Bautista",
         "Devin Nunes",
         "Loren Rivera",
         "Eddie Salgado"
      ],
      "Past members": [
         "Kristina Esfandiari",
         "Sergio Miranda",
         "Alexandra Morte",
         "Byanca Munoz"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from the San Francisco Bay Area. The group formed in [YEAR], originally as Whirl, but had to legally change its name after a woman performing acoustic covers of Black Sabbath songs trademarked the name and threatened a lawsuit. [BAND_NAME]'s shoegaze sound is often compared to My Bloody Valentine and Slowdive. Founding guitarist [PERSON_NAME_FULL_0_MALE] also played in the band Deafheaven surrounding and including the release of their [YEAR] album Roads to Judah.\n",
      "[BAND_NAME] self-released a demo cassette and the EP Distressor before signing to Tee Pee Records in [YEAR]. The band released [MONTH] that year, followed by their [YEAR] debut album, Pipe Dreams. The latter was met with a generally positive reception from music critics.\n",
      "[BAND_NAME] released the Around EP on [MONTH] 9, [YEAR], and toured to support it that [MONTH] with the band Nothing. As a result of touring together, members of Nothing and [BAND_NAME] formed a side project called Death of Lovers, and [BAND_NAME] and Nothing released a split EP. Bassett then joined Nothing on bass and toured with them. Bassett also started a new indie pop project with former [BAND_NAME] vocalist [PERSON_NAME_FULL_0_FEMALE] called Camera Shy, while guitarist [PERSON_NAME_FULL_1_MALE] joined Best Coast.\n"
   ]
}