{
   "Name": "Whirr (band)",
   "Sections": [
      "1 History",
      "1.1 Controversies",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 EPs",
      "2.3 Singles",
      "2.4 Split releases",
      "2.5 Compilation appearances",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Whirr is an American shoegaze band from the San Francisco Bay Area. The group formed in 2010, originally as Whirl, but had to legally change its name after a woman performing acoustic covers of Black Sabbath songs trademarked the name and threatened a lawsuit.[1] Whirr's shoegaze sound is often compared to My Bloody Valentine and Slowdive.[1][2] Founding guitarist Nick Bassett also played in the band Deafheaven surrounding and including the release of their 2011 album Roads to Judah.[1][2]\n"
      ]
   },
   "History": {
      "Controversies": {
         "text": [
            "On October 19, 2015, a series of derogatory remarks towards the Washington-based hardcore punk band G.L.O.S.S. were posted on Whirr's Twitter account, including one that read: \"[G.L.O.S.S. is] just a bunch of boys running around in panties making shitty music\".[14] These tweets were interpreted as transphobic and resulted in a backlash on social media; Graveface, who released the band's Sway, and Run for Cover Records, who released three of their EPs, severed ties with the band.[15] Bassett admitted to posting the first tweet toward G.L.O.S.S. (which read: \"Lol @ G.L.O.S.S.\"[14]), in response to hearing a rumor that the band was only permitting certain types of people to attend their shows and buy their merchandise.[16] According to Bassett, the remaining tweets were posted by a friend of the band and did not reflect the views of band members.[16] Whirr posted a public apology to their Twitter account the following morning and claimed to have severed ties with the person responsible for the offensive tweets.[17] Whirr's online social media presence has otherwise been notoriously inflammatory toward its own fans, an action that the band described in a 2014 interview as \"weeding out the pussies\".[15][18]\n"
         ]
      },
      "text": [
         "Whirr self-released a demo cassette and the EP Distressor before signing to Tee Pee Records in 2011. The band released June that year, followed by their 2012 debut album, Pipe Dreams. The latter was met with a generally positive reception from music critics.[3][4][5]\n",
         "Whirr released the Around EP on July 9, 2013, and toured to support it that August with the band Nothing.[6][7] As a result of touring together, members of Nothing and Whirr formed a side project called Death of Lovers,[8] and Whirr and Nothing released a split EP. Bassett then joined Nothing on bass and toured with them.[9] Bassett also started a new indie pop project with former Whirr vocalist Alexandra Morte called Camera Shy,[10] while guitarist Joseph Bautista joined Best Coast.\n",
         "On September 23, 2014, Whirr released their second studio album, Sway, on Graveface Records.[11]\n",
         "On October 25, 2019, Time Well Recordings announced that Whirr would be releasing their third studio album, Feels Like You.[12] It has been rumored to be their final record despite any confirmation of this by the band or recording studio. Initially intended as a vinyl only release, the album was made available through the band's website as a limited pressing of 650 copies which sold out within the first day. Following this, the album was leaked online and the band opted to do an official digital release made available on Bandcamp.[13]\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "EPs": {},
      "Singles": {},
      "Split releases": {},
      "Compilation appearances": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Whirr is an American shoegaze band from the San Francisco Bay Area. The group formed in 2010, originally as Whirl, but had to legally change its name after a woman performing acoustic covers of Black Sabbath songs trademarked the name and threatened a lawsuit.[1] Whirr's shoegaze sound is often compared to My Bloody Valentine and Slowdive.[1][2] Founding guitarist Nick Bassett also played in the band Deafheaven surrounding and including the release of their 2011 album Roads to Judah.[1][2]\n",
      "Whirr self-released a demo cassette and the EP Distressor before signing to Tee Pee Records in 2011. The band released June that year, followed by their 2012 debut album, Pipe Dreams. The latter was met with a generally positive reception from music critics.[3][4][5]\n",
      "Whirr released the Around EP on July 9, 2013, and toured to support it that August with the band Nothing.[6][7] As a result of touring together, members of Nothing and Whirr formed a side project called Death of Lovers,[8] and Whirr and Nothing released a split EP. Bassett then joined Nothing on bass and toured with them.[9] Bassett also started a new indie pop project with former Whirr vocalist Alexandra Morte called Camera Shy,[10] while guitarist Joseph Bautista joined Best Coast.\n",
      "On September 23, 2014, Whirr released their second studio album, Sway, on Graveface Records.[11]\n"
   ],
   "infobox": {
      "Also known as": [
         "Whirl"
      ],
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Shoegaze",
         "post-rock",
         "noise rock",
         "alternative rock"
      ],
      "Years active": [
         "2010 (2010)–present"
      ],
      "Labels": [
         "Graveface",
         "Tee Pee"
      ],
      "Associated acts": [
         "Deafheaven",
         "Death of Lovers",
         "Nothing",
         "Camera Shy",
         "Best Coast",
         "Night School",
         "King Woman",
         "Fawning",
         "Pink Slip"
      ],
      "Website": [
         "freewhirl.com"
      ],
      "Members": [
         "Nick Bassett",
         "Joseph Bautista",
         "Devin Nunes",
         "Loren Rivera",
         "Eddie Salgado"
      ],
      "Past members": [
         "Kristina Esfandiari",
         "Sergio Miranda",
         "Alexandra Morte",
         "Byanca Munoz"
      ]
   }
}