{
   "Name": "Human Drama",
   "Sections": [
      "1 Human Drama (1985 - 2018)",
      "2 Discography",
      "2.1 Albums",
      "2.1.1 Studio albums",
      "2.1.2 Live albums",
      "2.1.3 Compilations",
      "2.2 EPs",
      "2.3 Singles",
      "2.4 Compilation appearances",
      "2.5 Videos/DVD",
      "3 Books",
      "4 Timeline",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Human Drama is an American alternative rock band led by singer/songwriter Johnny Indovina formed in 1985.[1] The band released six studio albums before splitting in 2005. They reformed for concerts in 2011 and 2012, and again in 2015. In 2017 they released their 1st studio album in 15 years, Broken Songs for Broken People featuring the singles/videos \"Rain On Me\", \"The Liar Inside\" and \"Like This One\". Broken Songs was followed by series of singles in 2019-2020, and a full length album \"Blurred Images\" in April 2021 on Sunset Blvd. Records.\n"
      ]
   },
   "Human Drama (1985 - 2018)": {
      "text": [
         "\nIndovina began his career in New Orleans in 1980 in the Models.[1] with Indovina, Michael Ciravolo (guitar), Steve Fuxan (bass) and Charlie Bouis (drums). Upon relocating in 1985 to Los Angeles they changed their name to Human Drama with the addition of Mark Balderas (keyboards).  Human Drama quickly became an integral part of the \"Scream Scene\" which developed around the underground LA club Scream.[1][2]\n",
         "Signed to RCA Records in 1988,[3] Human Drama released an EP, Hopes Prayers Dreams Heart Soul Mind Love Life Death (Recorded at the famous Rockfield Studios in Wales), and an album, Feel, a year later,[1] both of which were produced by Ian Broudie (Echo and the Bunnymen, The Fall, The Lightning Seeds and many others).\n",
         "Human Drama next signed to Triple X Records and released The World Inside in 1992.[3] A video for \"This Tangled Web\" was directed by long-time friend, roadie and tour manager for the band, Dave Eddy. The album proved so popular that Triple X eventually released a companion six-video compilation that featured detailed narration by Indovina.\n",
         "Pinups, a collection of cover songs, was released in 1993, followed by the Human Drama EP in 1994 and Songs of Betrayal in 1995, both on Projekt Records. In 1998 14,384 Days Later, a live, career-spanning retrospective was released on both Hollow Hills/Triple X and the Mexican Opcion Sonica label. A book of Indovina's lyrics, My Bag of Secrets (The Words of Human Drama)|My Bag of Secrets...the Words of Human Drama, was published in 1997. The following year brought Solemn Sun Setting, the band's seventh album, and in 2000, Triple X released The Best of Human Drama...In a Perfect World.\n",
         "Indovina then released Momento's En El Tiempo, the first live document of his solo acoustic shows. Produced by long-time Human Drama guitarist Michael Ciravolo, the disc was culled from several performances recorded between 1995 and 2000 in venues ranging from CBGB's in New York City to Café Bizarro in Mexico City.\n",
         "The last album by Human Drama before the group disbanded in 2005 was Cause and Effect, released in the US on Projekt Records and in Latin America by Noise Kontrol.[4]\n",
         "In late 2006, Indovina formed a new band, Sound of the Blue Heart, releasing the albums Beauty? in 2006 and Wind of Change in 2009.[2][5]\n",
         "In 2011 Human Drama reunited for one concert in Hollywood, CA. In 2012 they performed in Mexico City at the Plaza Condesa.[6] They recorded a new single in 2015, \"The Liar Inside\".[7] Also that year Indovina released his first solo album, Trials of the Writer.[2] In 2015 Human Drama performed in Mexico City at Circo Volador for a 30th Anniversary Concert.[8]\n",
         "In 2017, the band returned with Broken Songs for Broken People, their first album in 15 years, supported by 3 new videos for \"The Liar Inside\", \"Rain on Me\" and “Like this One”, followed in 2018 by concerts in Mexico City at Auditorio Blackberry and in Los Angeles at Bar Sinister.\n",
         "In 2019 Human Drama set out to record a series of eight singles that culminated in the 2021 album Human Drama \"Blurred Images\".\n"
      ]
   },
   "Discography": {
      "Albums": {
         "Studio albums": {},
         "Live albums": {},
         "Compilations": {}
      },
      "EPs": {},
      "Singles": {},
      "Compilation appearances": {},
      "Videos/DVD": {}
   },
   "Books": {
      "text": [
         "The book My Bag of Secrets (The Words of Human Drama) contains lyrics, photos and commentary from Johnny Indovina and his fans. It was published in 1997.\n"
      ]
   },
   "Timeline": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Human Drama is an American alternative rock band led by singer/songwriter Johnny Indovina formed in 1985.[1] The band released six studio albums before splitting in 2005. They reformed for concerts in 2011 and 2012, and again in 2015. In 2017 they released their 1st studio album in 15 years, Broken Songs for Broken People featuring the singles/videos \"Rain On Me\", \"The Liar Inside\" and \"Like This One\". Broken Songs was followed by series of singles in 2019-2020, and a full length album \"Blurred Images\" in April 2021 on Sunset Blvd. Records.\n",
      "\nIndovina began his career in New Orleans in 1980 in the Models.[1] with Indovina, Michael Ciravolo (guitar), Steve Fuxan (bass) and Charlie Bouis (drums). Upon relocating in 1985 to Los Angeles they changed their name to Human Drama with the addition of Mark Balderas (keyboards).  Human Drama quickly became an integral part of the \"Scream Scene\" which developed around the underground LA club Scream.[1][2]\n",
      "Signed to RCA Records in 1988,[3] Human Drama released an EP, Hopes Prayers Dreams Heart Soul Mind Love Life Death (Recorded at the famous Rockfield Studios in Wales), and an album, Feel, a year later,[1] both of which were produced by Ian Broudie (Echo and the Bunnymen, The Fall, The Lightning Seeds and many others).\n",
      "Human Drama next signed to Triple X Records and released The World Inside in 1992.[3] A video for \"This Tangled Web\" was directed by long-time friend, roadie and tour manager for the band, Dave Eddy. The album proved so popular that Triple X eventually released a companion six-video compilation that featured detailed narration by Indovina.\n"
   ]
}