{
   "Name": "Human Drama",
   "rawData": [
      "Human Drama is an American alternative rock band led by singer/songwriter Johnny Indovina formed in 1985. The band released six studio albums before splitting in 2005. They reformed for concerts in 2011 and 2012, and again in 2015. In 2017 they released their 1st studio album in 15 years, Broken Songs for Broken People featuring the singles/videos \"Rain On Me\", \"The Liar Inside\" and \"Like This One\". Broken Songs was followed by series of singles in 2019-2020, and a full length album \"Blurred Images\" in April 2021 on Sunset Blvd. Records.\n",
      "\nIndovina began his career in New Orleans in 1980 in the Models. with Indovina, Michael Ciravolo (guitar), Steve Fuxan (bass) and Charlie Bouis (drums). Upon relocating in 1985 to Los Angeles they changed their name to Human Drama with the addition of Mark Balderas (keyboards).  Human Drama quickly became an integral part of the \"Scream Scene\" which developed around the underground LA club Scream.\n",
      "Signed to RCA Records in 1988, Human Drama released an EP, Hopes Prayers Dreams Heart Soul Mind Love Life Death (Recorded at the famous Rockfield Studios in Wales), and an album, Feel, a year later, both of which were produced by Ian Broudie (Echo and the Bunnymen, The Fall, The Lightning Seeds and many others).\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Alternative rock, gothic rock"
      ],
      "Years active": [
         "1985–2005, 2011-2012, 2015–present"
      ],
      "Labels": [
         "RCA Records",
         "Triple X",
         " Projekt",
         "Noise Kontrol (Mexico)",
         "Opcion Sonica (Mexico)",
         "The Orchard",
         "Fonarte Latino (Mexico)"
      ],
      "Associated acts": [
         "Sound of the Blue Heart"
      ],
      "Website": [
         "www.humandrama.net"
      ],
      "Members": [
         "Johnny Indovina ",
         "Mark Balderas",
         "Steve Fuxan ",
         "Tim Grove",
         "Greg Collister"
      ],
      "Past members": [
         "Charlie Bouis ",
         "Michael Ciravolo ",
         "Jamii Szmadzinski",
         "Rob Cournoyer ",
         "Michael Mallory ",
         "CJ Eriksson",
         "Gerri Sutyak",
         "Carlo Bartolini",
         "Steve Caton",
         "Rita D'Albert",
         "Curt Harding",
         "Edward Donato",
         "Lyn Bertles"
      ]
   },
   "albums": [
      "Fourteen Thousand Three Hundred Eighty Four Days Later",
      "Momento's En El Tiempo",
      "Moments in Time"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band led by singer/songwriter Johnny Indovina formed in [YEAR]. The band released six studio albums before splitting in [YEAR]. They reformed for concerts in [YEAR] and [YEAR], and again in [YEAR]. In [YEAR] they released their 1st studio album in 15 years, Broken Songs for Broken People featuring the singles/videos [SONG_NAME] in [MONTH] [YEAR] on Sunset Blvd. Records.\n",
      "\nIndovina began his career in New Orleans in [YEAR] in the Models. with Indovina, Michael Ciravolo (guitar), [PERSON_NAME_FULL_0_MALE] (bass) and [PERSON_NAME_FULL_1_MALE] (drums). Upon relocating in [YEAR] to Los Angeles they changed their name to [BAND_NAME] with the addition of [MONTH]k Balderas (keyboards).  [BAND_NAME] quickly became an integral part of the [SONG_NAME] which developed around the underground LA club Scream.\n",
      "Signed to RCA Records in [YEAR], [BAND_NAME] released an EP, Hopes Prayers Dreams Heart Soul Mind Love Life Death (Recorded at the famous Rockfield Studios in Wales), and an album, Feel, a year later, both of which were produced by [PERSON_NAME_FULL_0_MALE] (Echo and the Bunnymen, The Fall, The Lightning Seeds and many others).\n"
   ]
}