{
   "Discography": {
      "Albums": {},
      "Videos": {}
   },
   "External links": {},
   "History": {
      "text": [
         "The Iron Maidens were originally formed in June 2001 by vocalist Jenny Warren and bassist Melanie Sisneros, formerly of the Iron Maiden tribute band Wrathchild.[4] Linda McDonald (drums) and Josephine Draven (guitar), both formerly of Phantom Blue, and Sara Marsh (guitar), joined Warren and Sisneros shortly afterward to form the band's first lineup.[5][6] Sisneros left the band in 2002 to pursue other interests and was replaced by Wanda Ortiz.\n",
         "In 2003, the band started work on their debut album. The project was delayed when Warren gave notice of her departure from the band to focus more on her personal and child's needs.[7] After Warren's departure, new vocalist Aja Kim made her debut in the band and helped complete the album (World's Only Female Tribute to Iron Maiden), which was released in June 2005.[8]\n",
         "After the album's release, Draven left the band. In February 2007, Heather Baker joined to replace Draven. In May, the band released its second album Route 666, which features a guest appearance by Motörhead guitarist Phil Campbell.[9]\n",
         "In summer 2008, Heather Baker and Aja Kim left the band to pursue solo careers.[10] The two were replaced by guitarist Courtney Cox and vocalist Kirsten Rosenberg (formerly of the Maryland-based cover band HighWire).[11] In January 2010, Marsh, who was ill, was taken off some of the Japanese tour shows and did not rejoin the band.[12] Baker rejoined the band to temporarily fill in Marsh's spot for a handful of shows.[12]\n",
         "In August 2010, The Iron Maidens released a DVD of their Japan tour titled Metal Gathering Tour Live in Japan 2010.[13][14]\n",
         "Upon Sara's departure from the band, former members Elizabeth Schall and Heather Baker would return briefly to fill in the vacant Murray position (2009-2010). For tours 2010-2014, the role of Dave Murray would be shared between artists Nili Brosh, Nita Strauss, and Nikki Stringfield. In 2014,the band approached Nikki Stringfield to become a permanent member in the Murray position.\n",
         "Courtney Cox(Caparison), Nita Strauss(Ibanez)and Nikki Stringfield (Schecter) are the first female artists to have their own signature guitar with their associated guitar companies.\n",
         "On September 8, 2015 the group announced that long-time guest guitarist Nikki Stringfield had been officially added as a permanent member of the band.[15]\n",
         "Rosenberg and Stringfield appeared as contestants on the August 3, 2017 episode of the music game show Beat Shazam.[16]\n"
      ]
   },
   "Members": {},
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Albums",
      "2.2 Videos",
      "3 Members",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Iron Maidens are an American heavy metal band from Los Angeles, California, formed in 2001[2] as an all-female tribute act to English heavy metal band Iron Maiden.[3] The band currently consists of vocalist Kirsten Rosenberg, bassist Wanda Ortiz, drummer Linda McDonald, guitarist Courtney Cox, and guitarist Nikki Stringfield.\n"
      ]
   },
   "Title": "The Iron Maidens - Wikipedia"
}