{
   "Name": "The Iron Maidens",
   "rawData": [
      "The Iron Maidens are an American heavy metal band from Los Angeles, California, formed in 2001 as an all-female tribute act to English heavy metal band Iron Maiden. The band currently consists of vocalist Kirsten Rosenberg, bassist Wanda Ortiz, drummer Linda McDonald, guitarist Courtney Cox, and guitarist Nikki Stringfield.\n",
      "The Iron Maidens were originally formed in June 2001 by vocalist Jenny Warren and bassist Melanie Sisneros, formerly of the Iron Maiden tribute band Wrathchild. Linda McDonald (drums) and Josephine Draven (guitar), both formerly of Phantom Blue, and Sara Marsh (guitar), joined Warren and Sisneros shortly afterward to form the band's first lineup. Sisneros left the band in 2002 to pursue other interests and was replaced by Wanda Ortiz.\n",
      "In 2003, the band started work on their debut album. The project was delayed when Warren gave notice of her departure from the band to focus more on her personal and child's needs. After Warren's departure, new vocalist Aja Kim made her debut in the band and helped complete the album (World's Only Female Tribute to Iron Maiden), which was released in June 2005.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Heavy metal"
      ],
      "Years active": [
         "2001–present"
      ],
      "Labels": [
         "Powerslave"
      ],
      "Associated acts": [
         "Iron Maiden, Phantom Blue, Femme Fatale, Before the Mourning"
      ],
      "Website": [
         "www.theironmaidens.com"
      ],
      "Members": [
         "Linda McDonald",
         "Wanda Ortiz",
         "Courtney Cox",
         "Kirsten Rosenberg",
         "Nikki Stringfield[1]"
      ]
   },
   "albums": [
      "World's Only Female Tribute to Iron Maiden",
      "Route 666",
      "The Root of All Evil"
   ],
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band from Los Angeles, California, formed in [YEAR] as an all-female tribute act to English heavy metal band Iron Maiden. The band currently consists of vocalist [PERSON_NAME_FULL_0_FEMALE], bassist [PERSON_NAME_FULL_3_FEMALE], drummer [PERSON_NAME_FULL_2_FEMALE], guitarist Courtney Cox, and guitarist [PERSON_NAME_FULL_1_FEMALE].\n",
      "[BAND_NAME] were originally formed in [MONTH] [YEAR] by vocalist Jenny Warren and bassist [PERSON_NAME_FULL_3_FEMALE], formerly of the Iron Maiden tribute band Wrathchild. [PERSON_NAME_FULL_2_FEMALE] (drums) and [PERSON_NAME_FULL_1_FEMALE] (guitar), both formerly of Phantom Blue, and Sara [MONTH]sh (guitar), joined Warren and [PERSON_NAME_LAST_3] shortly afterward to form the band's first lineup. [PERSON_NAME_LAST_3] left the band in [YEAR] to pursue other interests and was replaced by [PERSON_NAME_FULL_0_FEMALE].\n",
      "In [YEAR], the band started work on their debut album. The project was delayed when Warren gave notice of her departure from the band to focus more on her personal and child's needs. After Warren's departure, new vocalist [PERSON_NAME_FULL_0_FEMALE] made her debut in the band and helped complete the album (World's Only Female Tribute to Iron Maiden), which was released in [MONTH] [YEAR].\n"
   ]
}