{
   "Name": "Keel (band)",
   "Sections": [
      "1 History",
      "1.1 Post-disbandment and first reunion",
      "1.2 Second reunion",
      "2 Members",
      "2.1 Timeline",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Keel is an American heavy metal band founded in 1984 in Los Angeles, California. They are known for their rock anthem \"The Right to Rock.\" The band was active until 1989, with a brief reunion in 1998. Keel reunited again in 2008 and toured in 2009 for their 25th anniversary.[1] Although the band is still active to this day, they have not released any new material since 2010.\n"
      ]
   },
   "History": {
      "Post-disbandment and first reunion": {
         "text": [
            "In the 1990s, Ferrari wrote a gear column for Metal Edge magazine entitled \"Power Sources\", and went on to form Cold Sweat with among others ex-UFO guitarist Erik Gamans, who would release the album Break Out in 1990. After the demise of that group, Ferrari appeared in both Wayne's World movies (as the guitarist for Tia Carrere's band \"Crucial Taunt\") and formed the band Medicine Wheel, which released three CDs. In addition, he released two solo CDs and started a music publishing company called MasterSource, employing Ron Keel to write material for the library. Ferrari also recently wrote a book titled Rock Star 101.\n",
            "Bryan Jay and Dwain Miller went from Keel to forming a band called Dogbone, with ex-Riot vocalist Rhett Forrester, bassist Rob Thiessen and vocalist Eddie Saiz.[5]\n",
            "In 1998, members of Keel got together to release their sixth album Keel VI: Back in Action. It mainly consisted of unreleased material from their previous albums, including the aforementioned \"Proud To Be Loud\".\n",
            "The band's song \"Speed Demon\" (from The Right to Rock) is briefly heard on the 2002 movie Men in Black II, and appears on Mike Varney's U.S. Metal Vol. IV compilation.\n",
            "Ron Keel pursued multiple musical projects before forming the country metal band IronHorse in 2001. In 2006, Ron left IronHorse and formed K2 Featuring Ron Keel a year later.\n"
         ]
      },
      "Second reunion": {
         "text": [
            "On November 2008, Keel reunited in time to celebrate the band's 25th anniversary. All the members from The Right to Rock era had rejoined except for Chaisson. The new bassist is Ron Keel's longtime friend, Geno Arce. Their first reunion show was held in Hollywood, CA, on January 24, 2009.[6]  In addition, the band played at the third annual Rocklahoma festival on July 2009.[7]\n",
            "A reunion album, Streets of Rock & Roll was released in 2010, as well as a 25th anniversary edition of The Right to Rock featuring a brand new re-recorded version of the title song as a bonus track.[8]\n",
            "Keel continued to perform live sporadically throughout the 2010s; however, according to Ron Keel, the band has no plans to follow-up on Streets of Rock & Roll.[9]\n"
         ]
      },
      "text": [
         "Keel was formed by former Steeler vocalist Ron Keel.[2] The original members were Ron Keel on vocals, former Icon / Schoolboys member David Michael Phillips on guitar, Marc Ferrari on lead & rhythm guitars, Bobby Marks on drums and Kenny Chaisson on bass guitar. Within months, Phillips left to join King Kobra and was replaced by ex-Cheetah guitarist Bryan Jay. This was the lineup for their 1984 debut album Lay Down the Law.[3] After the album's release, Marks left and was replaced by Steven Riley, who subsequently left early in the recording of the band's second album to join W.A.S.P., and was in turn replaced by Dwain Miller, forming a lineup which would remain stable for almost four years. Their debut album caught the eye of KISS' Gene Simmons, resulting in his production of their second album, The Right To Rock, released on March 26, 1985.[2] Their next and also Simmons-produced third album The Final Frontier was released on April 30, 1986.[4] It included the single \"Because the Night\", a song that was co-written by Patti Smith and Bruce Springsteen and had been a hit for Smith in 1978.[2]\n",
         "In 1986, Keel won the Best Band of the Year award in the second annual Metal Edge magazine reader's poll, beating such noted bands as Iron Maiden and Judas Priest.\n",
         "In 1987, the song \"Rock & Roll Outlaw\" (a cover from the 1978 self titled debut of Australian hard rock band Rose Tattoo) appeared on the soundtrack of the movie Dudes. Their fourth album, Keel, was released on June 21, 1987,[2] recorded with producer Michael Wagener. An unreleased track from the album, Ferrari's \"Proud To Be Loud\", would eventually wind up on Pantera's Power Metal album, which Ferrari produced early in 1988.\n",
         "Ferrari and Jay both left in 1988, after touring in support of the Keel album. They were replaced by keyboardist Scott Warren, later in Dio, and Baton Rouge guitarist Tony Palmucci.\n",
         "Their fifth album, Larger Than Live, was released in 1989[2] with six new studio recordings, including a cover of the 1980 Humble Pie song \"Fool for a Pretty Face\". Also on the album were six live tracks recorded in March 1989. Following the shooting of the music video for the song \"Dreams Are Not Enough\" on that same year, Ron Keel announced the disbandment of Keel.[2]\n"
      ]
   },
   "Members": {
      "Timeline": {},
      "text": [
         "\n",
         "\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Keel is an American heavy metal band founded in 1984 in Los Angeles, California. They are known for their rock anthem \"The Right to Rock.\" The band was active until 1989, with a brief reunion in 1998. Keel reunited again in 2008 and toured in 2009 for their 25th anniversary.[1] Although the band is still active to this day, they have not released any new material since 2010.\n",
      "Keel was formed by former Steeler vocalist Ron Keel.[2] The original members were Ron Keel on vocals, former Icon / Schoolboys member David Michael Phillips on guitar, Marc Ferrari on lead & rhythm guitars, Bobby Marks on drums and Kenny Chaisson on bass guitar. Within months, Phillips left to join King Kobra and was replaced by ex-Cheetah guitarist Bryan Jay. This was the lineup for their 1984 debut album Lay Down the Law.[3] After the album's release, Marks left and was replaced by Steven Riley, who subsequently left early in the recording of the band's second album to join W.A.S.P., and was in turn replaced by Dwain Miller, forming a lineup which would remain stable for almost four years. Their debut album caught the eye of KISS' Gene Simmons, resulting in his production of their second album, The Right To Rock, released on March 26, 1985.[2] Their next and also Simmons-produced third album The Final Frontier was released on April 30, 1986.[4] It included the single \"Because the Night\", a song that was co-written by Patti Smith and Bruce Springsteen and had been a hit for Smith in 1978.[2]\n",
      "In 1986, Keel won the Best Band of the Year award in the second annual Metal Edge magazine reader's poll, beating such noted bands as Iron Maiden and Judas Priest.\n",
      "In 1987, the song \"Rock & Roll Outlaw\" (a cover from the 1978 self titled debut of Australian hard rock band Rose Tattoo) appeared on the soundtrack of the movie Dudes. Their fourth album, Keel, was released on June 21, 1987,[2] recorded with producer Michael Wagener. An unreleased track from the album, Ferrari's \"Proud To Be Loud\", would eventually wind up on Pantera's Power Metal album, which Ferrari produced early in 1988.\n"
   ]
}