{
   "Name": "King Kobra",
   "rawData": [
      "King Kobra is an American hard rock band, founded by drummer Carmine Appice after his tenure with Ozzy Osbourne from 1983 to 1984. During the time of their first two albums, the band consisted of four relatively unknown musicians that included vocalist Marcie Free, guitarist David Michael-Philips, guitarist Mick Sweda, and bassist Johnny Rod. After two albums on Capitol records—Ready to Strike (November 9, 1985) and Thrill of a Lifetime (1986)—and an independent release entitled King Kobra III in 1988, Appice decided to dissolve the band and join guitarist John Sykes on his Blue Murder project in 1989.\n",
      "In 2010, a new King Kobra emerged, with Carmine Appice on drums, Paul Shortino taking over vocal duties, Mick Sweda on guitar, David Henzerling (a.k.a. David Michael-Philips) on guitar, and Johnny Rod on bass. This lineup released an eponymous album, King Kobra, in 2011 on Frontiers Records, and another album in 2013 entitled King Kobra II.\n",
      "The band went on hiatus following the release of their 2013 album, largely due to the other commitments of the individual band members. They did, however, play live gigs in 2016 sans Mick Sweda.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Glam metal, heavy metal, hard rock"
      ],
      "Years active": [
         "1983–1989",
         "2000–2001",
         "2010–present"
      ],
      "Labels": [
         "Capitol",
         "New Renaissance",
         "Frontiers"
      ],
      "Associated acts": [
         "Ratt",
         "Hawk",
         "BulletBoys",
         "Blue Murder",
         "Unruly Child"
      ],
      "Members": [
         "Carmine Appice",
         "David Michael-Philips",
         "Johnny Rod",
         "Paul Shortino"
      ],
      "Past members": [
         "Marcie Free",
         "Mick Sweda",
         "Johnny Edwards",
         "Jeff Northrup",
         "Larry Hart",
         "Kelly Keeling",
         "Steve Fister"
      ]
   },
   "albums": [
      "Ready to Strike",
      "Thrill of a Lifetime",
      "King Kobra III",
      "Hollywood Trash",
      "King Kobra",
      "King Kobra II"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band, founded by drummer Carmine Appice after his tenure with [PERSON_NAME_FULL_1_MALE] from [YEAR] to [YEAR]. During the time of their first two albums, the band consisted of four relatively unknown musicians that included vocalist [MONTH]cie Free, guitarist David Michael-Philips, guitarist [PERSON_NAME_FULL_2_MALE], and bassist [PERSON_NAME_FIRST_0]ny Rod. After two albums on Capitol records—Ready to Strike ([MONTH] 9, [YEAR]) and Thrill of a Lifetime ([YEAR])—and an independent release entitled [BAND_NAME] III in [YEAR], Appice decided to dissolve the band and join guitarist [PERSON_NAME_FULL_0_MALE] on his Blue Murder project in [YEAR].\n",
      "In [YEAR], a new [BAND_NAME] emerged, with Carmine Appice on drums, [PERSON_NAME_FULL_0_MALE] taking over vocal duties, Mick Sweda on guitar, [PERSON_NAME_FULL_1_MALE] (a.k.a. [PERSON_NAME_FIRST_1] Michael-Philips) on guitar, and Johnny Rod on bass. This lineup released an eponymous album, [BAND_NAME], in [YEAR] on Frontiers Records, and another album in [YEAR] entitled [BAND_NAME] II.\n",
      "The band went on hiatus following the release of their [YEAR] album, largely due to the other commitments of the individual band members. They did, however, play live gigs in [YEAR] sans Mick Sweda.\n"
   ]
}