{
   "Name": "Kommunity FK",
   "rawData": [
      "Kommunity FK is an American  post-punk/gothic rock band, formed in 1978, that helped establish what came to be known as the deathrock scene in Los Angeles, California, United States.\n",
      "The band was formed in 1978 by singer Patrick Mata, who was influenced by musicians Throbbing Gristle, David Bowie and Joy Division as well as other artistic inspirations like Dadaism, anti-art, noise, musique concrète and the Brion Gysin/William Burroughs cut-up technique.\n",
      "Though initially named \"Kommunity Fuck\", after a piece of paste-up art created by Mata, the moniker was soon shortened. Mata has stated that the name was inspired by the cold shoulder given him by unimaginative local media venue talent buyers as well as industry powers.\n"
   ],
   "infobox": {
      "Origin": [
         "California, US"
      ],
      "Genres": [
         "Deathrock, gothic rock, post-punk"
      ],
      "Years active": [
         "1978–present"
      ],
      "Labels": [
         "Independent Project Records, Cleopatra Records, Mobilization Records, Invisible Records, KommunityPM Rekords, Crysella Records"
      ],
      "Associated acts": [
         "Texylvania, Patrick Mata, Sativa Luvbox, Jane's Addiction, A II Z, Sex Gang Children, UK Decay, Furyo, Peter Murphy, Carcrash International"
      ],
      "Website": [
         "kommunityfk.com"
      ],
      "Members": [
         "Patrick Mata",
         "Sherry Rubber"
      ],
      "Past members": [
         "Matt Chaikin",
         "CE CE",
         "Kevin Kipnis",
         "Margaret Arana",
         "Gahdi Elias",
         "Mark Pritchard",
         "Cam Campbell",
         "Eddie Branch ",
         "Dave Roberts",
         "Heather Dunham",
         "Jack Atlantis"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band, formed in [YEAR], that helped establish what came to be known as the deathrock scene in Los Angeles, California, United States.\n",
      "The band was formed in [YEAR] by singer Patrick Mata, who was influenced by musicians Throbbing Gristle, [PERSON_NAME_FULL_0_MALE] and Joy Division as well as other artistic inspirations like Dadaism, anti-art, noise, musique concrète and the Brion Gysin/William Burroughs cut-up technique.\n",
      "Though initially named \"Kommunity Fuck\", after a [GENRE]"
   ]
}