{
   "Discography": {
      "Compilation albums": {},
      "Compilation appearances": {},
      "EPs": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "text": [
         "The band was formed in 1978 by singer Patrick Mata, who was influenced by musicians Throbbing Gristle, David Bowie and Joy Division as well as other artistic inspirations like Dadaism, anti-art, noise, musique concrète and the Brion Gysin/William Burroughs cut-up technique.[1]\n",
         "Though initially named \"Kommunity Fuck\", after a piece of paste-up art created by Mata, the moniker was soon shortened. Mata has stated that the name was inspired by the cold shoulder given him by unimaginative local media venue talent buyers as well as industry powers.[2]\n",
         "Kommunity FK's debut album, The Vision and the Voice, was released in 1983 by Independent Project Records, featuring a lineup of Mata, drummer Matt Chaikin and bassist CE CE.\n",
         "The follow-up, 1985's Close One Sad Eye, garnered significant attention when a video clip for the song \"Something Inside Me Has Died\" received significant play on MTV.[3] By this time, Mata and Chaikin had been joined by bassist Kevin Kipnis and keyboardist Margaret Arana.\n",
         "After departing the band, Chaikin drummed for an early lineup of Jane's Addiction.[4]\n",
         "Later Kommunity FK lineups included bassists Cam Campbell (A II Z, Sex Gang Children), Eddie Branch (UK Decay, Furyo, Peter Murphy) and Dave Roberts (Sex Gang Children, Carcrash International.\n",
         "In 2008, Kommunity FK returned with their third effort, the collection Abandoned Here... Planet Ruled By Bastards, issued on the Invisible Records label. Now a duo of Mata and guitarist/keyboardist Sherry Rubber, they followed it up with La Santisima Muerte (2010) on KommunityPM Rekords and Thee Image & Thee Myth (2015) on Crysella Records.\n",
         "During a Kommunity FK hiatus in the late 1980s and early 1990s, Mata led the band Sativa Luvbox, who released two albums: The Bad Sleep Well (1989, Splat-Co Records) and Beloved Satellite (1993, Gasoline Alley Records). Mata had earlier issued a 1979 single, \"The Queen of Beverly Hills,\" under his own name. Using the name Texylvania, he also covered songs on several tribute albums.\n"
      ]
   },
   "Members": {},
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 EPs",
      "2.3 Compilation albums",
      "2.4 Compilation appearances",
      "3 Members",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Kommunity FK is an American  post-punk/gothic rock band, formed in 1978, that helped establish what came to be known as the deathrock scene in Los Angeles, California, United States.\n"
      ]
   },
   "Title": "Kommunity FK - Wikipedia"
}