{
   "Name": "Kush (band)",
   "rawData": [
      "Kush was an American rap metal band formed in 2000 by rapper B-Real, Deftones guitarist Stephen Carpenter, and former Fear Factory members Raymond Herrera and Christian Olde Wolbers.\n",
      "The project was first announced in 2000. \"Dr. Kush\" was chosen as an alternate name in case the original band name was already in use. In November 2000, it was reported that seven tracks had been completed. In 2001, B-Real expressed an interest in releasing the band's debut album by the following year or in 2003. Kush performed at the fifth annual Cypress Hill Smoke Out in 2002, opening with a song entitled \"Psycho Killer\", one of ten completed tracks that were prepared for an eventual album. B-Real stated that the band's music is \"unlike any other rap-metal type stuff. It's a little bit more aggressive. And the way I attack it from a lyrical standpoint is totally different from what I do with Cypress. Cypress is more street-orientated. With Kush, it's a little bit of everything.\" In April 2002, it was reported that Kush had completed its debut album, but that it would be difficult to release because all of the band members were signed to different labels. In November 2002, it was reported that the album was not completed, but that it was getting close to completion. To date, no material from the band has been released officially, but demos have been leaked on various file sharing sites.\n",
      "In 2014, during a Reddit AMA, B-Real indicated the project was stalled by \"record labels fighting\".\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California"
      ],
      "Genres": [
         "Rap metal"
      ],
      "Years active": [
         "2000–2002"
      ],
      "Members": [
         "B-Real",
         "Stephen Carpenter",
         "Christian Olde Wolbers",
         "Raymond Herrera"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band formed in [YEAR] by rapper B-Real, Deftones guitarist Stephen Carpenter, and former Fear Factory members [PERSON_NAME_FULL_0_MALE] and Christian Olde Wolbers.\n",
      "The project was first announced in [YEAR]. [SONG_NAME] In [MONTH] [YEAR], it was reported that [BAND_NAME] had completed its debut album, but that it would be difficult to release because all of the band members were signed to different labels. In [MONTH] [YEAR], it was reported that the album was not completed, but that it was getting close to completion. To date, no material from the band has been released officially, but demos have been leaked on various file sharing sites.\n",
      "In [YEAR], during a Reddit AMA, B-Real indicated the project was stalled by [SONG_NAME].\n"
   ]
}