{
   "Name": "Leatherwolf",
   "rawData": [
      "Leatherwolf is an American heavy metal band that formed in Huntington Beach, California in 1981. They split up in 1992, but reunited in 1999. The group is also nicknamed the \"Triple Axe Attack\" for pioneering the use of a 3-guitar line-up in heavy metal. \n",
      "Currently comprising lead vocalist Keith Adamiak, guitarists Rob Math and Geoff Gayer, bassist Paul Carman, and drummer Dean Roberts, the band has released five studio albums. Leatherwolf has undergone many line-up changes during its existence. No member has been constant throughout its entire timeline but several former members have returned at differing times. The band continues to perform live but has not released any studio material since their 2007 album New World Asylum.\n",
      "Formed in the early 1980s, a teenaged Leatherwolf emerged on the Southern California scene sharing bills with fellow OC metal acts such as Metallica, Witch, and Slayer at venues like the Woodstock and Radio City. Leatherwolf quickly caught the attention of Enigma Records affiliated indie label Tropical Records who financed the band's eponymous 1984 5-song EP, produced by Randy Burns. Germany's Steamhammer/SPV label released the EP, upgraded to a full-fledged album, in 1985, titled Leatherwolf, while Heavy Metal America, who had the rights for Great Britain, issued it as Endangered Species, so named after one of the songs on the album.\n"
   ],
   "infobox": {
      "Origin": [
         "Huntington Beach, California, US"
      ],
      "Genres": [
         "Heavy metal",
         "power metal"
      ],
      "Years active": [
         "1981–1992",
         "1999–present"
      ],
      "Labels": [
         "NIL8",
         "Massacre",
         "King Records",
         "Dynamo Productions",
         "Grand Slamm Records",
         "Island",
         "Heavy Metal America",
         "Tropical / Enigma"
      ],
      "Website": [
         "leatherwolfmetal.com"
      ],
      "Members": [
         "Keith Adamiak",
         "Rob Math",
         "Geoff Gayer",
         "Paul Carman",
         "Dean Roberts"
      ],
      "Past members": [
         "Michael Olivieri",
         "Carey Howe",
         "Patrick Guyton",
         "Luke Man",
         "Joey Tafolla",
         "Greg Erba",
         "Wade Black",
         "Eric Halpern",
         "Pete Perez",
         "Jeff Martin",
         "Marco Forcone",
         "Matt Hurich"
      ]
   }
}