{
   "Band members": {
      "text": [
         "Current members\n",
         "Former members\n",
         "\nTimeline\n"
      ]
   },
   "Discography": {
      "text": [
         "\n",
         "\n"
      ]
   },
   "External links": {},
   "History": {
      "Early days and first two albums (1981–1988)": {
         "text": [
            "Formed in the early 1980s, a teenaged Leatherwolf emerged on the Southern California scene sharing bills with fellow OC metal acts such as Metallica, Witch, and Slayer at venues like the Woodstock and Radio City. Leatherwolf quickly caught the attention of Enigma Records affiliated indie label Tropical Records who financed the band's eponymous 1984 5-song EP, produced by Randy Burns. Germany's Steamhammer/SPV label released the EP, upgraded to a full-fledged album, in 1985, titled Leatherwolf, while Heavy Metal America, who had the rights for Great Britain, issued it as Endangered Species, so named after one of the songs on the album.\n",
            "In 1986, Matt Hurich left to join the band Stryper and was replaced by Paul Carman, formerly of Black Sheep. The band signed a new major label record deal with Island Records, and released the confusingly titled, Kevin Beamish produced Leatherwolf in 1987.[1]  A video for the first single, \"The Calling,\" was shown on MTV.  It was followed up with another single, \"Cry Out\", featuring a cover of Creedence Clearwater Revival's \"Bad Moon Rising\" on the B-side.\n"
         ]
      },
      "Reunion and World Asylum (1999–2006)": {
         "text": [
            "It was not until 1999 when the classic Leatherwolf line-up re-emerged with a celebrated reunion show at the Galaxy Theater in Santa Ana, CA, documented on the Wide Open live album that featured 14 of the band's best songs as well as a cover of the Doors' \"Break On Through\".  Leatherwolf also made their return to Europe with an exclusive show at the Wacken Open Air festival in Germany that same year.  Further activities remained few and far between, and Michael Olivieri announced his departure in the spring of 2003 after supporting Halford at the Grove in Anaheim, CA.  Auditioning various singers, the band recorded a 3-song demo consisting of \"Disconnect\", \"Behind the Gun\", and \"Burned\" (later renamed \"The Grail\") with Jeff Martin from Racer X.  Martin eventually declined to join on a full-time basis and lone survivors, Geoff Gayer and Dean Roberts, started the search anew and were finally introduced to Florida-based screamer Wade Black (Crimson Glory, Leash Law, Seven Witches).[3]  With both Carey Howe and Paul Carman out of the picture, bass was handled by San Antonio, TX native Pete Perez (Riot, Spastic Ink) while OC local Mark Smith and Houstonian Eric Halpern (Destiny's End, Z-Lot-Z) contributed additional lead guitars to the new album. Co-produced by Roberts and Gayer and mixed by Jacob Hansen at Hansen Studios in Ribe, Denmark, World Asylum was released in the spring of 2006 to great reviews and Leatherwolf played the Bang Your Head!!! festival in Germany in June, with Paul Carman back in the fold on bass for the occasion.[4]  The band also shot a promotional video for the song \"Behind The Gun\" with director Karpis Maksudian.  Former Leatherwolf (Hail Mary & Shotgun Messiah ) member Patrick Guyton took over on bass for the band's ProgPower USA festival appearance in Atlanta, GA in fall 2006.[5] Guyton has remained as full time bassist to date.\n"
         ]
      },
      "Reunion with Michael Olivieri, New World Asylum and beyond (2007–2019)": {
         "text": [
            "Original members Carey Howe and Michael Olivieri returned in 2007 and Leatherwolf re-issued World Asylum with Olivieri's vocals in place of Wade Black as New World Asylum,[6] again mixed by Hansen. In the fall of 2007, Leatherwolf embarked on a short European tour, highlighted by a headline appearance at the 9th edition of Germany's Keep It True festival.[7] Guitarist Geoff Gayer was let go at the end of the trip[8] and replaced by Greg Erba with whom the band lensed a video clip for \"Dr. Wicked (Rx O.D.)\" with Karpis Maksudian at the helm once again. It would be included on the Monsters of Metal Vol. 6 video compilation by Nuclear Blast.\n",
            "By mid-2009, Leatherwolf were said to be writing for a new studio album and shared a bill with Anthrax, Saxon, Overkill, Anvil, and Metal Church at the third annual Rocklahoma festival on July 9, 2009.[9]  Michael Olivieri's solo album, Goodbye Rain, was released in December 2009.[10]\n",
            "In early December 2013, the band announced the release of their Unchained Live album, the first to feature the new guitar duo of Rob Math and Greg Erba.[11]\n",
            "In late May 2015, former members Carey Howe, Geoff Gayer and Wade Black announced that they were working on a new Leatherwolf studio album for a late fall release.  Drummer Dean Roberts and vocalist/guitarist Michael Olivieri, original members of the band's current line-up, countered by issuing a statement laying claim to sole legal ownership of the name Leatherwolf.[12] Howe and Gayer eventually settled on the name Haunt of Jackals[13] and released their debut album, The Chosen, in January 2017 which also included Patrick Guyton handling the bass tracks.[14]\n",
            "In early January 2017, it was announced that guitarist Joey Tafolla had joined Leatherwolf in place of Greg Erba.[15] The band parted ways with Tafolla six months later due to scheduling conflicts, with 21-year old Luke Man stepping in and taking part in the 2017 UK tour, Leatherwolf's first British live dates in some 28 years.[16]\n",
            "The band would play their first Southern California show with Man now a full band member on November 18 at the Slidebar in Fullerton, CA sharing a bill with Odin.[17]\n",
            "On Feb 11, 2019 Leatherwolf announced on their Facebook page that they have parted ways with lead vocalist and original member Michael Olivieri for reasons unknown. On August 1, 2019, the band officially introduced Keith Adamiak as their new lead vocalist and announced the return of guitarist Geoff Gayer and bassist Paul Carman in place of Luke Man and Patrick Guyton, respectively. A brand new song, \"The Henchmen\", off their forthcoming studio album, tentatively set for a spring 2020 release, was posted on the band's YouTube channel.[18]\n"
         ]
      },
      "Street Ready and split (1989–1992)": {
         "text": [
            "For 1989's Street Ready album,[2] recorded in the Bahamas, the band kept on Beamish as producer but tapped German expatriate Michael Wagener for the mix. Although the first single/video was the radio-friendly semi-power ballad \"Hideaway\", Street Ready saw the band take a step back toward their more metallic roots with songs such as opener \"Wicked Ways\", \"Too Much\", and especially the all-instrumental tour-de-force, \"Black Knight\". Leatherwolf finally made their European live debut in the spring of 1989 with an appearance at the Aardschokdag in the Netherlands and opening slots for Japan's Vow Wow and German metallers Zed Yago.  The overall lack of label support began to take its toll on the band's inner workings and drummer Dean Roberts was eventually ousted in favor of Marco Forcone (ex-Enticier). Roberts joined The Rod Squad, led by former Knightmare II vocalist Dennis \"The Rod\" Carlock, with whom he recorded the \"Body Heater\" 7\" in 1990. Even bigger changes lay ahead as Leatherwolf dropped their trademark style in favor of a grunger hybrid approach and euro-style visuals.   With Patrick Guyton (ex-Enticier, Aaronsrod) replacing Paul Carman on bass, the band had morphed into Hail Mary by 1992.  However, success under the new moniker proved as elusive as ever as Grunge Rock was quickly becoming the new flavor of the month, causing Leatherwolf/Hail Mary and many of their contemporaries to lose popularity. Due to these circumstances, midway through recording their full-length release as Hail Mary, the band would eventually call it quits in late 1993. Leatherwolf was one of those few bands that historically many feel never got enough credit and has been ranked as one of the most underrated heavy rock bands of the 80's by fans.  Grand Slamm Records re-issued the self-titled Leatherwolf debut on CD in 1991.\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Early days and first two albums (1981–1988)",
      "1.2 Street Ready and split (1989–1992)",
      "1.3 Reunion and World Asylum (1999–2006)",
      "1.4 Reunion with Michael Olivieri, New World Asylum and beyond (2007–2019)",
      "2 Band members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Leatherwolf is an American heavy metal band that formed in Huntington Beach, California in 1981. They split up in 1992, but reunited in 1999. The group is also nicknamed the \"Triple Axe Attack\" for pioneering the use of a 3-guitar line-up in heavy metal. \n",
         "Currently comprising lead vocalist Keith Adamiak, guitarists Rob Math and Geoff Gayer, bassist Paul Carman, and drummer Dean Roberts, the band has released five studio albums. Leatherwolf has undergone many line-up changes during its existence. No member has been constant throughout its entire timeline but several former members have returned at differing times. The band continues to perform live but has not released any studio material since their 2007 album New World Asylum.\n"
      ]
   },
   "Title": "Leatherwolf - Wikipedia"
}