{
   "Name": "Lizzy Borden (band)",
   "rawData": [
      "Lizzy Borden is an American heavy metal band formed in Los Angeles in 1983. To date, the band has charted on the Billboard 200 four times. Lizzy Borden is eponymous of the band's lead vocalist.\n",
      "The band was founded in 1983 by brothers Lizzy Borden (born Gregory Charles Harges; June 23, 1960) and Joey Scott. The band got noticed after their song \"Rod of Iron\" featured on Metal Blade Records' Metal Massacre IV compilation LP. The band signed to Metal Blade in 1984 and released their debut EP Give 'Em the Axe in May of the same year. The band is named after the notorious Lizzie Borden, a woman accused and acquitted of murder in the late 19th century.\n",
      "In 1985, late guitarist Alex Nelson replaced original guitarist Tony Matuzak and was first featured on the band's only live album to date, titled The Murderess Metal Road Show.\n"
   ],
   "infobox": {
      "Also known as": [
         "Starwood, Diamond Dogs"
      ],
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Heavy metal",
         "power metal",
         "glam metal",
         "shock rock",
         "hard rock"
      ],
      "Years active": [
         "1983–1996, 1999-2004, 2006–present"
      ],
      "Labels": [
         "Metal Blade"
      ],
      "Associated acts": [
         "W.A.S.P., Twisted Sister, Ozzy Osbourne, Lynch Mob"
      ],
      "Website": [
         "lizzyborden.com"
      ],
      "Members": [
         "Lizzy Borden ",
         "Joey Scott",
         "Marten Andersson",
         "Ira Black"
      ],
      "Past members": [
         "See Members"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in Los Angeles in [YEAR]. To date, the band has charted on the Billboard 200 four times. [BAND_NAME] is eponymous of the band's lead vocalist.\n",
      "The band was founded in [YEAR] by brothers [BAND_NAME] (born Gregory Charles Harges; [MONTH] 23, [YEAR]) and [PERSON_NAME_FULL_0_MALE]. The band got noticed after their song [SONG_NAME] featured on Metal Blade Records' Metal Massacre IV compilation LP. The band signed to Metal Blade in [YEAR] and released their debut EP Give 'Em the Axe in [MONTH] of the same year. The band is named after the notorious [PERSON_NAME_FULL_1_FEMALE], a [GENRE]",
      "In [YEAR], late guitarist Alex Nelson replaced original guitarist [PERSON_NAME_FULL_0_MALE] and was first featured on the band's only live album to date, titled The Murderess Metal Road Show.\n"
   ]
}