{
   "Name": "Lizzy Borden (band)",
   "Sections": [
      "1 History",
      "1.1 Early career (1983–1986)",
      "1.2 Commercial success and first hiatus (1987–1999)",
      "1.3 Reunion, death of Alex Nelson and second hiatus (2000–2004)",
      "1.4 Second reunion (2006–present)",
      "2 Musical style",
      "3 Members",
      "4 Timeline",
      "5 Discography",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "\n",
         "Lizzy Borden is an American heavy metal band formed in Los Angeles in 1983. To date, the band has charted on the Billboard 200 four times.[1] Lizzy Borden is eponymous of the band's lead vocalist.\n"
      ]
   },
   "History": {
      "Early career (1983–1986)": {
         "text": [
            "The band was founded in 1983 by brothers Lizzy Borden (born Gregory Charles Harges; June 23, 1960) and Joey Scott. The band got noticed after their song \"Rod of Iron\" featured on Metal Blade Records' Metal Massacre IV compilation LP. The band signed to Metal Blade in 1984 and released their debut EP Give 'Em the Axe in May of the same year.[2] The band is named after the notorious Lizzie Borden, a woman accused and acquitted of murder in the late 19th century.\n",
            "In 1985, late guitarist Alex Nelson replaced original guitarist Tony Matuzak and was first featured on the band's only live album to date, titled The Murderess Metal Road Show.[3]\n"
         ]
      },
      "Commercial success and first hiatus (1987–1999)": {
         "text": [
            "In 1987, the band reached their commercial peak with the release of their third LP \"Visual Lies\" which saw guitarist Joe Holmes make his debut with the band.[4] The first single from the album, \"Me Against the World\", was featured in the cult film Black Roses. Holmes later went on to join Ozzy Osbourne's band.\n",
            "In 1989, the band issued their fourth studio album Master of Disguise via their label Metal Blade, the LP was released on July 15, 1989 and has since become a cult classic.[5] The band frequently plays songs from this album live.\n",
            "The band was featured prominently in the rockumentary The Decline of Western Civilization Part II: The Metal Years (directed by Penelope Spheeris).\n",
            "In the early 1990s, the band slowed down its activity due to the changing metal scene and the rise of grunge. The band went on a short hiatus in 1996 after the departure of their two guitarists, David Philips and Corey James. Singer Lizzy alongside bassist Marten Andersson and drummer Joey Scott went on to play in the glam band Diamond Dogs (later renamed Starwood).[6]\n"
         ]
      },
      "Reunion, death of Alex Nelson and second hiatus (2000–2004)": {
         "text": [
            "In 1999, the band was once again fully active and touring with 3/5 of its classic lineup (Borden, Joey Scott & Alex Nelson) alongside longtime bassist Marten Andersson. Lizzy Borden previewed their new CD and tour, entitled Deal With the Devil, at the Wacken Open Air Festival, Germany, in front of 35,000 people followed by a worldwide tour. Longtime Lizzy Borden fan, artist and multimedia entrepreneur Todd McFarlane (best known for his creation of Spawn and stylistic revision of Spider-Man) was enlisted to capture the essence of Lizzy Borden for the stage show and the CD cover art. \nOn May 17, 2004, guitarist Alex Nelson was killed in a head-on car collision. Lizzy Borden disbanded soon after.[7]\n",
            "In a 2008 interview with Lucem Fero, when asked about Alex Nelson, singer Lizzy Borden said:\n",
            "\"He had a connection to everybody. I'm usually very business like, and don't like to screw around too much when we're working. He felt it was his job to break that down, and try to have more fun. He was the only one that could break down the wall; for some reason, he had that ability with everyone. Even though I always told him he was the most talented musician I've ever worked with in every way, He never really thought he was all that talented. People would ask him who his influences are, and he would say 'everything I've ever seen or heard.' I used to love that quote as it was so true of all of us.\"[8]"
         ]
      },
      "Second reunion (2006–present)": {
         "text": [
            "Two years after Alex Nelson's death, Lizzy Borden regrouped with new guitarist Ira Black and on November 1, 2007, the album Appointment with Death was released worldwide. The album also features guest appearances by George Lynch (Dokken, Lynch Mob), Dave Meniketti (Y&T), and Corey Beaulieu (Trivium), among others. The first video for \"Tomorrow Never Comes\" was nominated for video of the year and was in the Top 25 Metal Videos of 2008 on MTV's Headbangers Ball. The follow-up video for \"Under Your Skin\" premiered in April the same year.[9]\n",
            "In early 2008, the band announced various festival appearances including Sweden Rock Festival (Sweden), Kobetasonik festival (Spain) and Bang Your Head festival (Germany). In November 2008, Lizzy Borden toured the United States with Finnish Monster Rockers Lordi. The band toured Europe as part of their headlining tour, performing in 11 countries. Lizzy Borden was the first-day headliner of the two-day Keep It True XII festival at Tauberfrankenhalle in Lauda-Königshofen Germany 2009. North American festival appearances included Rocklahoma and Rock Gone Wild.\n",
            "On January 24, 2009, former guitarist Corey James died in a car accident.[10][11]\n",
            "In 2010, Lizzy Borden toured North America and Europe, including festival appearances at Wacken Open Air 2010, Alcatraz Metal Festival, Leyendas del Rock festival (cancelled) and Elsrock Festival.\n",
            "In 2011, Lizzy Borden launched the \"Summer of Blood\" tour in North American Followed by the European version, entitled \"Death Takes a Holiday Tour\", festival appearances in 2011 included Heaven and Hell Metal Fest, Christmas Metal Festival and the Hard Rock Hell Festival.\n",
            "In 2012, Lizzy Borden performed on various Open Air Festivals in Mexico and Europe. Festivals included Hellfest Open Air Festival in Clisson France and Gods of Metal in Milan Italy. Both festivals were with Ozzy, Mötley Crüe, Guns N' Roses and more. They returned to Europe in July 2012 to play Zwarte Cross festival in the Netherlands, Headbangers Open Air in Germany and Bulgaria the first time in their career at the Kavarna Rock Festival.\n",
            "In 2013, Lizzy Borden premiered their new tour \"30 Years of American Metal\" show created from the ground up at the 70000 Tons of Metal, followed by a string of North American shows and European Festivals, including the Swedish Festival Skogsrojet.\n",
            "On January 1, 2014, guitarist Dario Lorina left the band after joining American heavy metal band Black Label Society.\n",
            "On August 1, 2014, Lizzy Borden performed on Incheon Pentaport Rock Festival with former guitarist Ira Black.\n",
            "By 2014, Lizzy Borden had spent the last few years working on the follow up to 2007's Appointment with Death.[12][13]\n",
            "The band's first album in 11 years, My Midnight Things, was released on June 15, 2018,[14] and peaked at number 148 in the Billboard Top 200 and number 84 on the Top Hard Music Charts in Canada.[15] Lizzy Borden is currently working on a follow-up album.[16]\n",
            "February 16, 2021, former guitar player and founding member Tony Matuzak died, following complications from a kidney transplant.[citation needed]\n"
         ]
      }
   },
   "Musical style": {
      "text": [
         "Though the band was considered a part of the Los Angeles glam metal scene in the mid-1980s, their sound has been more associated with traditional heavy metal and power metal. Lizzy Borden were musically influenced by bands like Deep Purple, Van Halen, Iron Maiden, Black Sabbath, Judas Priest, The Tubes, Cheap Trick, and by the stage theatrics of Alice Cooper and Kiss. Their lyrical themes are more representative of this style, especially on earlier recordings.[citation needed]\n"
      ]
   },
   "Members": {
      "text": [
         "\n",
         "\n"
      ]
   },
   "Timeline": {},
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Lizzy Borden is an American heavy metal band formed in Los Angeles in 1983. To date, the band has charted on the Billboard 200 four times.[1] Lizzy Borden is eponymous of the band's lead vocalist.\n",
      "The band was founded in 1983 by brothers Lizzy Borden (born Gregory Charles Harges; June 23, 1960) and Joey Scott. The band got noticed after their song \"Rod of Iron\" featured on Metal Blade Records' Metal Massacre IV compilation LP. The band signed to Metal Blade in 1984 and released their debut EP Give 'Em the Axe in May of the same year.[2] The band is named after the notorious Lizzie Borden, a woman accused and acquitted of murder in the late 19th century.\n",
      "In 1985, late guitarist Alex Nelson replaced original guitarist Tony Matuzak and was first featured on the band's only live album to date, titled The Murderess Metal Road Show.[3]\n",
      "In 1987, the band reached their commercial peak with the release of their third LP \"Visual Lies\" which saw guitarist Joe Holmes make his debut with the band.[4] The first single from the album, \"Me Against the World\", was featured in the cult film Black Roses. Holmes later went on to join Ozzy Osbourne's band.\n"
   ],
   "infobox": {
      "Also known as": [
         "Starwood, Diamond Dogs"
      ],
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Heavy metal",
         "power metal",
         "glam metal",
         "shock rock",
         "hard rock"
      ],
      "Years active": [
         "1983–1996, 1999-2004, 2006–present"
      ],
      "Labels": [
         "Metal Blade"
      ],
      "Associated acts": [
         "W.A.S.P., Twisted Sister, Ozzy Osbourne, Lynch Mob"
      ],
      "Website": [
         "lizzyborden.com"
      ],
      "Members": [
         "Lizzy Borden ",
         "Joey Scott",
         "Marten Andersson",
         "Ira Black"
      ],
      "Past members": [
         "See Members"
      ]
   }
}