{
   "Discography": {
      "Albums": {},
      "EPs": {},
      "Singles": {
         "Notes": {}
      }
   },
   "External links": {},
   "History": {
      "2005–2011: Formation and Gorilla Manor": {
         "Hamm's departure": {
            "text": [
               "It was announced March 18, 2011 that the band had parted ways with bassist Andy Hamm. A post on the band's website stated, \"It is with extremely heavy hearts that we announce that we have recently parted ways with our bassist Andy Hamm. Due to unresolved differences within the band, we strongly feel that, in order to continue in a positive direction, this is the best course of action. We wish Andy the best and will miss him deeply.\"[7]\n"
            ]
         },
         "Touring": {
            "text": [
               "The band started to attract the attention of the music press after playing nine shows at the 2009 SXSW festival in Austin, Texas, where initial reviews drew favorable comparisons to Arcade Fire, Fleet Foxes, and Vampire Weekend,[4] as well as \"sort of a West Coast Grizzly Bear.\"[5]\n",
               "In 2010, the group's song Wide Eyes became known in Australia after appearing during an election campaign advertisement for the Australian Democrats.\nIn 2011, they embarked on a European tour, served as opening act for Edward Sharpe and the Magnetic Zeros, and made their debut in Australia at St Jerome's Laneway Festival [6]\n"
            ]
         },
         "text": [
            "The band came together in Orange County, where Kelcey Ayer, Ryan Hahn, and Taylor Rice attended Tesoro High School. One year after graduating college at UCLA, they were joined by bassist Andy Hamm and drummer Matt Frazier.  In December 2008, they all moved to a house in Silver Lake and started work on their debut album.[3]\n",
            "Everything the band creates comes from a complete collaboration between their members, from songwriting to artwork.[3] Their debut album, Gorilla Manor, was named after the house they all shared in Orange County, where most of the album was written. “It was insanely messy and there were always friends over knocking around on guitars or our thrift store piano,” said Hahn. “It was an incredible experience and I’ll never forget that time.” [3] The self-funded Gorilla Manor was recorded by Raymond Richards in his own Red Rockets Glare Studio, in West Los Angeles, and was produced by Richards and the band.[3]\n"
         ]
      },
      "2012–2013: Hummingbird": {
         "text": [
            "At Lollapalooza the band announced that they built a new studio and were working on completing their second full-length album, Hummingbird, which was released January 29, 2013.[8] Hummingbird was produced by Aaron Dessner of The National, and though it departed from the \"battle-cry urgency\" of Gorilla Manor's Sun Hands, singer/guitarist Taylor Rice doesn't look at 'Hummingbird' as a darker album pointing out moments of optimism, and attributing the altered subject matter to the changes and emotions that came in the years since their debut, such as Ayer's mother passing away from breast cancer.[9]\n",
            "Since 2012, the band has been joined with Nik Ewing as their touring bassist but it was announced at Austin City Limits that he has become an official member on October 11, 2013.[10]\n"
         ]
      },
      "2014–2018: Sunlit Youth": {
         "text": [
            "In August 2014, at a concert in Salt Lake City, Utah, as part of the Twilight Concert Series, the band announced that they had already begun work on their third studio album.[11]\n",
            "On April 29, 2016, Local Natives released a new single, \"Past Lives\", saying, \"The world is not static, it’s made new over and over again. But we tend to live the same patterns in a loop, loving the same way, wrestling the same demons, the same dynamics playing out around us again and again. Untangling every moment and decision that led us to where we are now can make fate feel concrete, inescapable. But our world is not fixed, it’s constantly reemerging, and we can change it into whatever we want.”[12] In May 2016, the band premiered the first songs from the album live.[13]\n",
            "The album Sunlit Youth was released on September 9, 2016.[14] The single \"I Saw You Close Your Eyes\" was released on March 23, 2017,[15] followed by another one-off single on May 19, 2017, \"The Only Heirs\", a collaboration with Nico Segal.[16]\n",
            "On September 22, 2017, Kelcey released his debut solo album, Tasha Sits Close to the Piano, under the name Jaws of Love.[17] On December 21, 2018 under the name Chewing, Nik released his debut solo album, Pacific Ocean Blue, a cover of Dennis Wilson's 1977 album in its entirety.[18]\n"
         ]
      },
      "2019-2020: Violet Street and Sour Lemon": {
         "text": [
            "On March 8, 2019, the band announced their fourth studio album, Violet Street, releasing a music video \"When Am I Gonna Lose You\", which featured actress Kate Mara.[19] Violet Street was released on April 26, 2019 and received generally positive reviews, garnering a 7.2 by Pitchfork's Ian Cohen.[20] The band have since made guest appearances on numerous television and YouTube music series, performing \"When Am I Gonna Lose You\" on the likes of Ellen and Enmore Audio.[21][22]\n",
            "In October 2020, the band released an EP, Sour Lemon, recorded in September 2019 with producer Chris Coady. The release was supported by a one-off livestream concert on October 21, 2020 due to ongoing COVID-19 pandemic.\n"
         ]
      }
   },
   "Members": {
      "Gallery": {
         "text": [
            "Kelcey Ayer on vocals and keyboards\n",
            "Ryan Hahn on vocals and guitar\n",
            "Nik Ewing on vocals and bass guitar\n",
            "Matt Frazier on drums\n",
            "Taylor Rice on vocals and guitar\n"
         ]
      },
      "text": [
         "Current\n",
         "Former\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 2005–2011: Formation and Gorilla Manor",
      "1.1.1 Touring",
      "1.1.2 Hamm's departure",
      "1.2 2012–2013: Hummingbird",
      "1.3 2014–2018: Sunlit Youth",
      "1.4 2019-2020: Violet Street and Sour Lemon",
      "2 Members",
      "2.1 Gallery",
      "3 Discography",
      "3.1 Albums",
      "3.2 EPs",
      "3.3 Singles",
      "3.3.1 Notes",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Local Natives is an American indie rock band based in Silver Lake, Los Angeles. The band consists of Taylor Rice (vocals, guitar), Kelcey Ayer (vocals, keyboards, guitar), Ryan Hahn (guitar, backing vocals), Matt Frazier (lemon) and Nik Ewing (bass).\n",
         "Their debut album, Gorilla Manor, was first released in the UK in November 2009, and later released in the US on February 16, 2010. The album received mostly positive reviews[1] and debuted on the Billboard 200 and at No. 3 in the New Artist Chart.[2] Their second album, Hummingbird, was released in January 2013. Their third album, Sunlit Youth, was released in September 2016. Their fourth album, Violet Street, was released April 2019.\n"
      ]
   },
   "Title": "Local Natives - Wikipedia"
}