{
   "Band members": {
      "Current": {},
      "Former": {}
   },
   "Discography": {
      "Compilation appearances": {},
      "Compilations": {},
      "Live albums": {},
      "Singles, EPs": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "Original late-1970s band": {
         "text": [
            "London was formed in 1978 by Lizzie Grey, Nikki Sixx and Dane Rage (real name Dane Scarborough). The three met when Sixx and Rage were recruited to play bass and drums for Sister, the band that Grey was in with Blackie Lawless. This lineup did not last long and soon Grey, Sixx and Rage left to form London.[1][2]\n",
            "London was briefly joined by Michael White as the vocalist, who bore a resemblance, both in voice and image, to Robert Plant.[3] After disagreements with the band, White left to focus on his own band, The White.[3] For years, London tried to get a record deal, but the formula was not working until 1984, when Nadir D'Priest and Brian West joined the band.\n",
            "By 1979, White had been replaced by vocalist Henri Valentine and keyboard player John St. John. Nigel Benjamin, an English vocalist who had sung for glam rock band Mott (formerly Mott the Hoople[4]) and English Assassin, joined the band after Valentine left.[2] Henri Valentine has since died.  Nigel Benjamin died in 2019, aged 64.[5]\n",
            "Becoming jaded with all of the member changes and looking to move on, Sixx and Benjamin were next to leave the band. Sixx would soon meet drummer Tommy Lee and form what would become Mötley Crüe and go on to massive international success.[6] On their debut album Too Fast for Love, Mötley Crüe released a song that Sixx and Grey had written but never recorded with London entitled \"Public Enemy No. 1\".[7] Benjamin joined Satyr and later recorded the soundtrack to the horror movie Rocktober Blood with Sorcery. Blackie Lawless was brought into the band to replace Sixx on bass,[3] but this didn't last very long, and Lawless would go on to form W.A.S.P..[6][8]\n",
            "After the original London had fallen apart, founder Lizzie Grey became involved with a couple of other groups, including hard rockers St. Valentine in 1983, featuring Nigel Itson (Ruby Slippers) and Desi Rexx (D'Molls). Rage recruited Scott Free, Paul Hanson and Bobby Blitz to form the Brooklyn Brats.  Rage later reverted to his real name and after graduating from the Santa Monica College of Design, Art and Architecture in 1992, became an inventor, eventually establishing the toy company Überstix LLC in 2005.[3][9]\n"
         ]
      },
      "Second era: 1984–early 1990s": {
         "text": [
            "1984 saw the rebirth of London, although it was now a different beast. The new lineup consisted of Grey, Itson, an English vocalist named John Ward and a bassist named Donny Cameron.\n",
            "By 1985, the lineup  consisted of Grey and Izzy Stradlin, vocalist Nadir D'Priest, drummer Bobby Marks and bassist Brian West (TKO).[6] Marks soon left to form the first lineup of Keel, and Fred Coury was brought in as his replacement.[6] Stradlin then left to join Hollywood Rose/Guns N' Roses with close friend Axl Rose. Steven Adler was also in the lineup,[6] playing on some early demos while with Nadir, Brian, Lizzie, and former Fleetwood Mac guitarist Bob Welch. Adler left the band and eventually joined up with Guns N' Roses.[6]\n",
            "Non-Stop Rock, London's debut album, was recorded at this point, and released in November 1985.[6][10] Soon after the album was finished, Coury left the band, eventually becoming part of Cinderella.[3][6] Wailin' Jennings Morgan replaced him.[6] Before the band's second album Don't Cry Wolf (produced by Kim Fowley) was recorded, two new members, drummer Derek Shea and guitarist Frankie Jones joined.\n",
            "In 1988, London appropriately appeared in the Penelope Spheeris film The Decline of Western Civilization II: The Metal Years describing their band as a \"training school for rock stars\".[6][11]\n",
            "After a decade, two albums, 19 different members and very little commercial success, founding member and guitarist Lizzie Grey left London in 1988. He went on to play with the groups Ultra Pop and Spiders and Snakes.[12] Although the band now had no more original members, London carried on for two more years in Los Angeles. Brian West and vocalist Nadir D'Priest were joined by guitarists Amos Sanfilippo and Sean Lewis and performed shows in the Hollywood and San Fernando Valley areas. London also made an appearance in the 1989 film Hollywood Boulevard II, starring Ginger Lynn, the band's record company having contributed to productions costs in return for making a promotional video as part of the filming.[13]\n",
            "D'Priest moved to Arizona for a brief period working in the adult film industry, but returned to continue working with West and Sean Lewis. They released a third and final album, Playa Del Rock in 1990,[6]but by this time the band agreed with new label Noise International to rebrand the band D'Priest. Some versions of the album had the new band name, but many were released as London.[7] By this time the band was managed by Eric Greif, coincidentally an early assistant manager of Mötley Crüe, with drummer Alan Krigger, formerly of Ike and Tina Turner and Giuffria, replacing Yasui, and Sanfilippo replaced by occasional keyboardist for The Cult Vince Gilbert.[6] A last burst of publicity via an MTV-played, David Bellino-directed video for the single \"Ride You Through the Night\", coupled with a supporting tour, fizzled quickly, with the band breaking up by late 1991 after internal strife and a label wind-down. London/D'Priest charted on the Z-Rock \"Z-50\" as well as on MTV and toured extensively during 1990–1991 at Z-Rock affiliate and subscriber markets.\n",
            "D'Priest went on to work with The Rolling Stones on their Voodoo Lounge tour CD-ROM.[6]\n",
            "Cleopatra Records also released London The Metal Years in 2008, a compilation of demos cut on the fly at American Recording Studios.[14]\n"
         ]
      },
      "Third era: 2010–present": {
         "text": [
            "London, with the Playa Del Rock lineup of D'Priest, Lewis, West and Krigger, performed a reunion show at the Roxy Theatre in Hollywood, CA in early 2010, a show in Redondo Beach, California in April 2011, and the Sunset Strip Music Festival at the Whiskey-a-Go-Go in Summer 2011. The band recorded \"Shout at the Devil\" for Cleopatra Records' Mötley Crüe tribute album Crue Believers in 2010.\n",
            "In 2012 a new lineup played dates in Europe during November and December. The London Live! album, recorded in Nashville, Tennessee, was released in 2013.\n",
            "D'Priest said in 2015 about the years before reforming London: \"I've been clean for 19 years, and have done everything from construction to being a stylist, but haven't given up on London\".[11]\n",
            "The band released a new studio album, Call That Girl, in 2018.[7][15]\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Original late-1970s band",
      "1.2 Second era: 1984–early 1990s",
      "1.3 Third era: 2010–present",
      "2 Band members",
      "2.1 Current",
      "2.2 Former",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Compilations",
      "3.3 Live albums",
      "3.4 Singles, EPs",
      "3.5 Compilation appearances",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "London is an American heavy metal band formed in Hollywood, California in 1978. The band included several members that would go on to play in more famous bands, such as Mötley Crüe, Guns N' Roses, W.A.S.P. and Cinderella.\n"
      ]
   },
   "Title": "London (heavy metal band) - Wikipedia"
}