{
   "Name": "Love (band)",
   "rawData": [
      "Love was an American psychedelic and folk-rock band formed in Los Angeles in 1965. Led by Arthur Lee, Love was one of the first racially-diverse American rock bands. Their style drew from an eclectic range of sources including hard rock, blues, jazz, flamenco, and orchestral pop.\n",
      "While finding only modest success on the music charts, peaking in 1966 with their only Top 40 hit \"7 and 7 Is\", Love would come to be praised by critics as their third album, Forever Changes (1967), became generally regarded as one of the best albums of the 1960s. It was added to the Library of Congress's National Recording Registry in 2011.\n",
      "Singer/multi-instrumentalist Arthur Lee, who was originally from Memphis, Tennessee but had lived in Los Angeles since the age of five, had been recording since 1963 with his bands the LAG's and Lee's American Four. He wrote and produced the single \"My Diary\" for Rosa Lee Brooks in 1964, which featured Jimi Hendrix on guitar. The Sons Of Adam, which included future Love drummer Michael Stuart, recorded the Lee composition \"Feathered Fish\". After attending a performance by the Byrds, Lee decided to form a band that joined the newly minted folk-rock sound of the Byrds to his primarily rhythm and blues style.\n"
   ],
   "infobox": {
      "Also known as": [
         "Love Revisited"
      ],
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Psychedelic rock[1]",
         "folk rock[2]",
         "acid rock[3]",
         "psychedelic pop[4]"
      ],
      "Years active": [
         "1965 (1965)–1996 (1996)",
         "2002 (2002)–2005 (2005)",
         "2009 (2009)–2019 (2019)"
      ],
      "Labels": [
         "Elektra",
         "Blue Thumb",
         "Harvest",
         "RSO",
         "Rhino",
         "Sundazed",
         "Big Beat"
      ],
      "Associated acts": [
         "Baby Lemonade"
      ],
      "Website": [
         "love-revisited.com"
      ],
      "Members": [
         "Johnny Echols",
         "Mike Randle",
         "David Green",
         "David Chapple",
         "Rusty Squeezebox"
      ],
      "Past members": [
         "See members section"
      ]
   }
}