{
   "Name": "Love/Hate (band)",
   "Sections": [
      "1 1985–88 unsigned",
      "2 1989–1991 Blackout in the Red Room",
      "3 1991–1992 Wasted in America",
      "3.1 Live concerts",
      "3.2 Hollywood Sign stunt",
      "4 1993–1999",
      "5 2002–present",
      "6 Members",
      "6.1 Former members",
      "7 Discography",
      "7.1 Albums",
      "7.2 Singles",
      "8 References"
   ],
   "Summary": {
      "text": [
         "Love/Hate is a Los Angeles, California based hard rock band.\n"
      ]
   },
   "1985–88 unsigned": {
      "text": [
         "Love/Hate was formed in 1985, when Jizzy Pearl (real name Jim Wilkinson) joined Jon E. Love, Skid Rose, and Joey Gold, in a 1980s influenced electronica band called Dataclan, after their previous lead singer walked out while playing in Japan. They lived together in a Los Angeles warehouse called SoulHouse, and in the first year put out a four track EP and played a short and not very well received tour of Mexico. At this time the band had a very 'glam' look, wearing make up.\n",
         "In 1986 the band renamed themselves as Love/Hate from a song they played at the time called Love and Hate. They also changed their look and style to a more gothic image, having been influenced by the release of the album Love by The Cult. For the next couple of years they tried various styles of music and were pitched to many record companies in an attempt to get signed.\n",
         "1987, the band settled on the rock genre, and had some limited success, when one of their songs was used on the soundtrack for Critters 2 and an early version of \"She's an Angel\" featured in the movie A Nightmare on Elm Street 4: The Dream Master.[1] Around this time they briefly employed guitarist Tracy G, who would later play in Dio. After seeing a video of a drunken performance, lead singer Jizzy resolved to turn himself around.\n",
         "In early 1988, Skid wrote a new collection of songs, which would later form the bulk of the album Blackout in the Red Room. They began performing regularly at the free Monday night 'No Bozo Jam' at Sunset Strip's Whisky a Go Go. This freed them from self-promotion of one off gigs and they began to collaborate as a band to improve their repertoire of songs. However, the band felt much frustration as at that time many other Sunset Strip bands were being signed by record companies, with glam metal at its height, but Love/Hate were repeatedly overlooked.\n",
         "The band then put together a four track demo engineered by guitarist Jon E. Love, and in December 1988 finally got a record deal with Columbia.\n"
      ]
   },
   "1989–1991 Blackout in the Red Room": {
      "text": [
         "Their debut album Blackout in the Red Room was recorded in 1989 and released on February 22, 1990. It reached No. 154 on the billboard 200.\n",
         "After a small club tour they supported Dio on an arena tour, their biggest to date. At this time the video for the single \"Why Do You Think They Call It Dope?\" was receiving good rotation on MTV, chiefly on Headbanger's Ball, and they went on tour with AC/DC to a much better reception. On this tour they first played in the UK. In 1991, they finished touring and started to write material for the second album.\n"
      ]
   },
   "1991–1992 Wasted in America": {
      "Live concerts": {
         "text": [
            "Love/Hate are known for their high energy performances. At their gigs in the early 1990s, the band's bass player Skid would often kick off the gig with a wild dance using a cross made out of Budweiser cans. They played the sort of venues where stage diving and crowd surfing made for a frenetic atmosphere.\n"
         ]
      },
      "Hollywood Sign stunt": {
         "text": [
            "On June 1, 1992 Jizzy performed his legendary publicity stunt to try to help album sales. This involved Jizzy, with the help of the band and a few others, successfully erecting a cross on the letter 'Y' of the Hollywood Sign and performing a mock crucifixion on it, with a camera crew in a helicopter to film it.[2] The band had assumed the authorities would quickly notice the stunt, but in the event Jizzy was stuck on the cross, 60 ft in the air, for several hours. Eventually a TV news helicopter spotted him and the police and fire dept were called to bring him down. He spent a few hours in jail and made headline news. However, Columbia were furious at the stunt and the publicity quickly faded with no noticeable impact on record sales. It did however, lead to the introduction of motion sensors on the sign.\n",
            "The band were offered a support slot with Black Sabbath, but the label refused to support them. They also cancelled a marketing campaign planned around the single \"Miss America\". The band were then formally dropped by Columbia. Immediately following this, guitarist Jon E. Love quit the band. Six months later a new guitarist, Darren Housholder, was hired, whose style was very different from Jon.\n"
         ]
      },
      "text": [
         "The initial set of songs submitted to the label for the next album were all rejected and the band had to start again from scratch. They relocated to New York City, again living together as they had done in their formative years. At this point they began to have creative differences with the label. The band was trying to move toward a 'crossover' sound with more radio appeal, but the label thought they were losing their edge (The band would later acknowledge they were correct). The band wanted to release \"Miss America\" as a single, but the label vetoed this and instead decided to put out \"Happy Hour\".\n",
         "However, six months before the album was released, Love/Hate secured a support slot for Skid Row's 'No Fucking Frills' European Tour. The label wanted to release an EP in support of the tour and in direct opposition to the band's wishes chose \"Evil Twin\", a song the band had rejected for the second album. While touring Skid made numerous attacks on the Label in interviews, with the band attempting to divert attention or prevent the comments being published. After playing at the London Arena, Jizzy got into a drunken fight with Skid Row singer, Sebastian Bach, which briefly led to the band being ejected from the tour. But they made up their differences before the next show.\n",
         "The second album Wasted in America was released later in the year 1992 and the band embarked on another European tour, this time in support of Ozzy Osbourne. On returning to America, they were told that Columbia intended to drop the band as the single for \"Happy Hour\" had not sold well and the follow-up single \"Wasted in America\" wasn't getting much airplay on the radio.\n"
      ]
   },
   "1993–1999": {
      "text": [
         "Soon after being dropped, Skid sold his car to finance a third album. Let's Rumble (1993) was recorded in a few days and the band went on a 9-week US club tour. BMG picked up the album and released it in the UK, which was followed by a 3-week UK tour. However, the label didn't want to release the album in the US. The band sent the album to a number of labels, but with the rise of Grunge their style of rock was out of fashion and there was no interest.\n",
         "Eventually they signed with a minor label to release Let's Rumble, but it was to be delayed until January 1994. In an unfortunate turn, their manager gave a copy of the album to the KNAC radio station in LA, where the lead single \"Spinning Wheel\" started to get heavy airplay. But the band were unable to release it either as a single or an album and despite playing to packed audiences in LA they were unable to capitalize on this popularity. Eventually another minor label, Calibre, arranged to release the album, but coming out in 1994 it was too late and the radio popularity had passed.\n",
         "In 1995 the band started writing and recording material for a fourth album, I'm Not Happy, Darren left by mutual agreement. Using their own studio and recording on ADAT Jon E. Love re-joined and the band produced and engineered its 4th release. Two side projects were also formed and started playing gigs. 'Skoe', with Skid, Jon E. and Joey and 'Sineaters' with Jizzy and Joey. At a Sineaters gig Jizzy was approached by Mayhem Records, who wanted to release I'm Not Happy. In December 1995 they played a two-week tour in Germany.\n",
         "In 1997 both side projects collapsed and Skid, Jon E.and Joey decided to put together a new album. Not having the time to write new material he instead put together tracks from excerpts of old B sides and other unreleased material, along with some songs from the now defunct 'Skoe'. Jizzy reluctantly provided vocals. During recording the band traveled to the UK for a two-week tour.\n",
         "On return to the US, Jizzy started a new side project with new musicians as did Joey. Upset and frustrated, the band sold all the bands equipment and Love/Hate split up. Skid employed Marq Torien from Bulletboys to complete recording for the album Livin' Off Layla (1997), which was never released on a label.\n",
         "In 1998 Jizzy was approached at a Warrant gig by their manager, who wanted to put Love/Hate on a tour with Dio. Skid declined to join in, but both Joey and Jon agreed. Cordell Crockett from Ugly Kid Joe (who used to be a roadie prior to joining Ugly Kid Joe) joined to play bass in Skids absence. The tour was difficult and afterward Jizzy left the band again to sing with L.A. Guns.\n",
         "In 1999, Jizzy put together an album of old Sineaters tracks, that he had written and it was released as Love/Hate on the Perris label, titled Let's Eat. Later that year, he left L.A. Guns as they were reforming with their classic line-up. There was some talk of the band reforming yet again with former L.A. Guns members Chris Van Dahl (on bass) and Johnny Crypt (on guitar) with Dave Moreno on drums, but in 2000 Jizzy was hired as lead singer for Ratt, which would end that prospect and occupy him for the next six years.\n"
      ]
   },
   "2002–present": {
      "text": [
         "In 2002 Jizzy toured Europe as Love/Hate in support of ex-Guns N' Roses guitarist Gilby Clarke, with some warm-up gigs in LA beforehand. The rest of the band was made up of Robbie Crane on bass, guitarist Keri Kelli, and drummer Dave Moreno.[3] Picking up on the resurgent interest in rock bands of the late 1980s/early 1990s, regular low key club tours, including trips to Europe, would follow over the next few years.\n",
         "In 2003 Love/Hate toured Europe with Jon E. Love returning for a brief stint on guitars but with the rest of the band as 2003.[4]\n",
         "In 2004 Jizzy and Jon toured together in Europe as Love/Hate[5]\n",
         "In 2006 Jizzy toured Europe as Love/Hate with guitarist Alex Grossi, bassist Robbie Crane and drummer Dave Moreno[6]\n",
         "In Dec 2006, Jizzy left Ratt, when previous singer Stephen Pearcy rejoined.[7]\n",
         "The original lineup reunited for the first time in ten years, on February 24, 2007 at Club Vodka in Hollywood, California to perform their classic debut record Black out in the Red Room (1990) in its entirety. The show sold out, with an audience of 1,500.[8]\n",
         "In April 2007, Jizzy toured the UK as Love/Hate, with Pretty Boy Floyd and Bang Tango in support. No other Love/Hate members were present and the band was shared for all three acts with the lead singer changing through the evening. Additional support was from Gypsy Pistoleros[9]\n",
         "In December 2007 Jizzy, Skid and Joey toured Europe, with Darren Housholder on guitar.[10] The setlist featured the whole of Blackout in the Red Room, played in the album order, plus selected tracks from the later albums. The tour was very well received by the UK fans. Support was from the Nottingham-based New Generation Superstars, who were also invited on stage to play Straightjacket with Love/Hate on the final night of the tour at The Rescue Rooms in Nottingham.\n",
         "In 2008 the band returned to the UK again and played a few shows in support of LA Guns\n",
         "In August/September 2009 the band toured the UK with Ricky Warwick and New Generation Superstars to celebrate \"20 Years of Beer\".\n",
         "A 2013 tour was announced in December 2012.[11]\n",
         "In late 2013, the Crucified EP was released digitally under the Love/Hate name. Following threatened lawsuits and disputes from other former Love/Hate members, Jizzy Pearl announced he would be discontinuing the name. The EP was subsequently changed to display Pearl's name instead. Pearl announced he will be touring U.K. under the name Love/Hate with a new band in November 2015.[12]\n",
         "In April 2020, it was announced that Goldon Robot Records had signed Jizzy Pearl's Love/Hate with a new record due later the same year. As part of this announcement, the band is also expected to play the Black out in the Red Room (1990) album in its entirety to celebrate its 30 year anniversary.[13]\n"
      ]
   },
   "Members": {
      "Former members": {}
   },
   "Discography": {
      "Albums": {},
      "Singles": {}
   },
   "References": {},
   "coreData": [
      "Love/Hate is a Los Angeles, California based hard rock band.\n",
      "Love/Hate was formed in 1985, when Jizzy Pearl (real name Jim Wilkinson) joined Jon E. Love, Skid Rose, and Joey Gold, in a 1980s influenced electronica band called Dataclan, after their previous lead singer walked out while playing in Japan. They lived together in a Los Angeles warehouse called SoulHouse, and in the first year put out a four track EP and played a short and not very well received tour of Mexico. At this time the band had a very 'glam' look, wearing make up.\n",
      "In 1986 the band renamed themselves as Love/Hate from a song they played at the time called Love and Hate. They also changed their look and style to a more gothic image, having been influenced by the release of the album Love by The Cult. For the next couple of years they tried various styles of music and were pitched to many record companies in an attempt to get signed.\n",
      "1987, the band settled on the rock genre, and had some limited success, when one of their songs was used on the soundtrack for Critters 2 and an early version of \"She's an Angel\" featured in the movie A Nightmare on Elm Street 4: The Dream Master.[1] Around this time they briefly employed guitarist Tracy G, who would later play in Dio. After seeing a video of a drunken performance, lead singer Jizzy resolved to turn himself around.\n"
   ]
}