{
   "Name": "Malice (American band)",
   "rawData": [
      "Malice is an American heavy metal band formed in 1981, best known for their appearance on the first Metal Massacre compilation and the release of a pair of albums on Atlantic Records. Their heavily-European-influenced style elicited comparisons to Judas Priest.\n",
      "Malice formed in Portland, Oregon in the early-1980s, when former The Ravers guitarist Jay Reynolds assembled an embryonic line-up consisting of vocalist James Neal, future Wild Dogs duo, Matt McCourt on bass and Deen Castronovo on drums, and Kip Doran on guitar. Reynolds next decided to make the move to Los Angeles, soon to be joined by fellow guitarist Mick Zane, to start an all original metal band. When the duo was unable to find suitable players for their new venture, they convinced Neal, bassist Mark Behn and drummer Pete Laufman to move down from Portland as well after the initial Malice demo caused a stir and garnered label interest from Brian Slagel of Metal Blade Records.\n",
      "\"Captive of Light\" and \"Kick You Down\" from the demo were both selected to appear on Metal Massacre I alongside tracks by Metallica, Ratt, Steeler and others. Malice made their L.A. live debut in November 1982 at the Troubadour headlining a bill with Metallica and Pandemonium as opening acts. Other memorable L.A. shows included opening up for then new major label signees Armored Saint at Perkins Palace in Pasadena, CA in the spring of 1984.\n"
   ],
   "infobox": {
      "Origin": [
         "Portland, Oregon, U.S."
      ],
      "Genres": [
         "Heavy metal, speed metal"
      ],
      "Years active": [
         "1981–1988",
         "2006–present"
      ],
      "Labels": [
         "Atlantic, Metal Blade, Wounded Bird, Retrospect, SPV"
      ],
      "Associated acts": [
         "Black 'n Blue, Wild Dogs, Monster, Metal Church, Helstar, Agent Steel"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "James Rivera",
         "Jay Reynolds",
         "Robert Cardenas",
         "Pete Holmes"
      ],
      "Past members": [
         "James Neal",
         "Mark Weitz",
         "Kip Doran",
         "Mick Zane",
         "Mike Zaputil",
         "Matt McCourt",
         "Mark Behn",
         "Deen Castronovo",
         "Pete Laufman",
         "Cliff Carothers"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in [YEAR], best known for their appearance on the first Metal Massacre compilation and the release of a pair of albums on Atlantic Records. Their heavily-European-influenced style elicited comparisons to Judas Priest.\n",
      "[BAND_NAME] formed in Portland, Oregon in the early-[YEAR]s, when former The Ravers guitarist Jay Reynolds assembled an embryonic line-up consisting of vocalist [PERSON_NAME_FULL_2_MALE], future Wild Dogs duo, [PERSON_NAME_FULL_3_MALE] on bass and Deen Castronovo on drums, and Kip Doran on guitar. Reynolds next decided to make the move to Los Angeles, soon to be joined by fellow guitarist [PERSON_NAME_FULL_1_MALE], to start an all original metal band. When the duo was unable to find suitable players for their new venture, they convinced [PERSON_NAME_LAST_2], bassist [MONTH]k Behn and drummer [PERSON_NAME_FULL_0_MALE] to move down from Portland as well after the initial [BAND_NAME] demo caused a stir and garnered label interest from Brian Slagel of Metal Blade Records.\n",
      "\"Captive of Light\" and \"Kick You Down\" from the demo were both selected to appear on Metal Massacre I alongside tracks by Metallica, Ratt, Steeler and others. [BAND_NAME] made their L.A. live debut in [MONTH] [YEAR] at the Troubadour headlining a bill with Metallica and Pandemonium as opening acts. Other memorable L.A. shows included opening up for then new major label signees Armored Saint at Perkins Palace in Pasadena, CA in the spring of [YEAR].\n"
   ]
}