{
   "Name": "Malice (American band)",
   "Sections": [
      "1 Biography",
      "2 Members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Malice is an American heavy metal band formed in 1981, best known for their appearance on the first Metal Massacre compilation and the release of a pair of albums on Atlantic Records. Their heavily-European-influenced style elicited comparisons to Judas Priest.[1]\n"
      ]
   },
   "Biography": {
      "text": [
         "Malice formed in Portland, Oregon in the early-1980s, when former The Ravers guitarist Jay Reynolds assembled an embryonic line-up consisting of vocalist James Neal, future Wild Dogs duo, Matt McCourt on bass and Deen Castronovo on drums, and Kip Doran on guitar. Reynolds next decided to make the move to Los Angeles, soon to be joined by fellow guitarist Mick Zane, to start an all original metal band. When the duo was unable to find suitable players for their new venture, they convinced Neal, bassist Mark Behn and drummer Pete Laufman to move down from Portland as well after the initial Malice demo caused a stir and garnered label interest from Brian Slagel of Metal Blade Records.[2]\n",
         "\"Captive of Light\" and \"Kick You Down\" from the demo were both selected to appear on Metal Massacre I alongside tracks by Metallica, Ratt, Steeler and others. Malice made their L.A. live debut in November 1982 at the Troubadour headlining a bill with Metallica and Pandemonium as opening acts. Other memorable L.A. shows included opening up for then new major label signees Armored Saint at Perkins Palace in Pasadena, CA in the spring of 1984.[3]\n",
         "Adding drummer Cliff Carothers, formerly with the bands Snow and Assassin, in place of Pete Laufman, Malice set about recording new demos with producer Michael Wagener and soon found themselves in the midst of a label bidding war. Eventually, the band signed with Atlantic Records in the summer of 1984 and released their debut album, In The Beginning..., in 1985. It consisted of songs the band had cut with Wagener and material recorded with Ashley Howe producing.\n",
         "Malice teamed up with producer Max Norman for their sophomore album, License to Kill, released in 1987. Dave Mustaine and Dave Ellefson of Megadeth and Black 'n Blue's Jaime St. James, Tommy Thayer and Jeff Warner provided backing vocals on two songs, \"License to Kill\" and \"Chain Gang Woman.\" The band toured with Alice Cooper, W.A.S.P. and Motörhead, among others. They were also the support act for Slayer on their 1987 \"Reign In Pain\" European tour, an ill-fated trip that saw Malice faced with open hostility from the headliner's rabid crowds which forced the band to drop off the bill once the trek reached Germany.\n",
         "In late 1987, Jay Reynolds left the band to join Megadeth in place of Chris Poland but was ultimately ousted several months later when bandleader Dave Mustaine decided on hiring Jay's former roommate and guitar teacher, Jeff Young, instead. The band also parted ways with James Neal and carried on with a new vocalist, Mark Weitz, but finally split up in late 1988.\n",
         "The 1988 film Vice Versa featured Malice in a concert sequence, filmed in Champaign, IL, performing \"Crazy In The Night\".[4] Metal Blade would issue a third Malice release, Crazy In The Night, in 1989. It contained 3 songs recorded with Neal and \"Vice Versa\", with producer Paul Sabu providing lead vocals.\n",
         "Following the demise of Malice, Jay Reynolds formed War Party with former Megadeth drummer Chuck Behler.[5] Mick Zane and Mark Behn would team up with former Black 'n Blue drummer Pete Holmes and vocalist Mark Isom under the name Monster.[6] The band's sole album, Through the Eyes of the World, surfaced on Long Island Records in Europe in 1995 and on Pulse Records in the U.S. in 1997.\n",
         "In 1999, EastWest Japan re-issued both In The Beginning... and License to Kill on CD; U.S. label Wounded Bird would follow suit in 2004.[7]\n",
         "Jay Reynolds joined a revamped Metal Church line-up in early 2004 and recorded 2 albums with the band, Weight of the World (2004) and A Light in the Dark (2006), before exiting again in 2008.[8]\n",
         "In 2006, Malice announced that they would be doing a reunion tour but canceled a number of European tour dates the following year. The band did perform a handful of shows in the U.S. utilizing the services of Last Empire and future Vicious Rumors vocalist Brian Allen. The band finally returned to Europe in April 2011 to co-headline the Keep It True XIV festival in Germany with new vocalist James Rivera (Helstar, Vicious Rumors).[9]\n",
         "In 2008, Malice issued an archives release, The Rare and Unreleased, on Retrospect Records containing all 4 songs from the Crazy In The Night EP and various early demos.[10]\n",
         "In late 2011, it was announced that Malice had signed a record deal with Germany's SPV/Steamhammer;[11] Robert Cardenas of Agent Steel was confirmed as the band's new live bass player.[12] New Breed of Godz, containing 4 new songs and re-recordings of 8 songs culled from In The Beginning... and License to Kill, was released in May 2012.[13]\n",
         "Mick Zane died from brain cancer on December 23, 2016.[14]\n"
      ]
   },
   "Members": {},
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Malice is an American heavy metal band formed in 1981, best known for their appearance on the first Metal Massacre compilation and the release of a pair of albums on Atlantic Records. Their heavily-European-influenced style elicited comparisons to Judas Priest.[1]\n",
      "Malice formed in Portland, Oregon in the early-1980s, when former The Ravers guitarist Jay Reynolds assembled an embryonic line-up consisting of vocalist James Neal, future Wild Dogs duo, Matt McCourt on bass and Deen Castronovo on drums, and Kip Doran on guitar. Reynolds next decided to make the move to Los Angeles, soon to be joined by fellow guitarist Mick Zane, to start an all original metal band. When the duo was unable to find suitable players for their new venture, they convinced Neal, bassist Mark Behn and drummer Pete Laufman to move down from Portland as well after the initial Malice demo caused a stir and garnered label interest from Brian Slagel of Metal Blade Records.[2]\n",
      "\"Captive of Light\" and \"Kick You Down\" from the demo were both selected to appear on Metal Massacre I alongside tracks by Metallica, Ratt, Steeler and others. Malice made their L.A. live debut in November 1982 at the Troubadour headlining a bill with Metallica and Pandemonium as opening acts. Other memorable L.A. shows included opening up for then new major label signees Armored Saint at Perkins Palace in Pasadena, CA in the spring of 1984.[3]\n",
      "Adding drummer Cliff Carothers, formerly with the bands Snow and Assassin, in place of Pete Laufman, Malice set about recording new demos with producer Michael Wagener and soon found themselves in the midst of a label bidding war. Eventually, the band signed with Atlantic Records in the summer of 1984 and released their debut album, In The Beginning..., in 1985. It consisted of songs the band had cut with Wagener and material recorded with Ashley Howe producing.\n"
   ],
   "infobox": {
      "Origin": [
         "Portland, Oregon, U.S."
      ],
      "Genres": [
         "Heavy metal, speed metal"
      ],
      "Years active": [
         "1981–1988",
         "2006–present"
      ],
      "Labels": [
         "Atlantic, Metal Blade, Wounded Bird, Retrospect, SPV"
      ],
      "Associated acts": [
         "Black 'n Blue, Wild Dogs, Monster, Metal Church, Helstar, Agent Steel"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "James Rivera",
         "Jay Reynolds",
         "Robert Cardenas",
         "Pete Holmes"
      ],
      "Past members": [
         "James Neal",
         "Mark Weitz",
         "Kip Doran",
         "Mick Zane",
         "Mike Zaputil",
         "Matt McCourt",
         "Mark Behn",
         "Deen Castronovo",
         "Pete Laufman",
         "Cliff Carothers"
      ]
   }
}