{
   "Name": "The Marías",
   "rawData": [
      "The Marías are an indie pop band from Los Angeles, California, composed of Puerto Rican lead singer María Zardoya and Los Angeles native and drummer Josh Conway. They are known for performing songs in both English and Spanish, as well as infusing their music with elements like jazz percussion, guitar riffs, smoke-velvet vocals, and horn solos. In their live show, with Zardoya on lead vocals and Conway on drums, they are joined by Jesse Perlman on guitar and Edward James on keyboards.\n",
      "The band is named after its lead singer María who was born in Puerto Rico and raised in Atlanta, Georgia. She and her partner Josh Conway, the drummer, met at a show at the Kibitz Room, which is described as a low-key nook in West Hollywood  next to Canter's Deli. She was performing on the bill and he was managing the sound, something he had never done before. They began writing almost immediately after meeting, and subsequently began dating. Soon they recruited close friends to join as band members; Edward James on keyboards, and guitarist Jesse Perlman. They were offered an opportunity to make songs for television, which helped them understand the visual and sonic feel that they were striving for  but when it didn't materialize, they used their recordings to make an EP, entitled Superclean Vol. I. Vol. I was released in 2017, while its counterpart Vol. II was released in 2018.\n",
      "María (who is mononymous) has stated that her influences include the late Tejano singer Selena, Norah Jones, Sade, Nina Simone, Billie Holiday, Carla Morrison, Julieta Venegas, Erykah Badu, and filmmaker Pedro Almodóvar, while Conway is influenced by Tame Impala, Radiohead, D'Angelo, and The Strokes.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Indie pop",
         "indie rock",
         "psychedelic rock",
         "psychedelic soul"
      ],
      "Years active": [
         "2016–present"
      ],
      "Website": [
         "themarias.us"
      ],
      "Members": [
         "María Zardoya",
         "Josh Conway",
         "Edward James",
         "Jesse Perlman"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band from Los Angeles, California, composed of Puerto Rican lead singer [MONTH]ía Zardoya and Los Angeles native and drummer Josh Conway. They are known for performing songs in both English and Spanish, as well as infusing their music with elements like jazz percussion, guitar riffs, smoke-velvet vocals, and horn solos. In their live show, with Zardoya on lead vocals and Conway on drums, they are joined by [PERSON_NAME_FULL_0_MALE] on guitar and Edward James on keyboards.\n",
      "The band is named after its lead singer [MONTH]ía who was born in Puerto Rico and raised in Atlanta, Georgia. She and her partner Josh Conway, the drummer, met at a [GENRE] a low-key nook in West Hollywood  next to Canter's Deli. She was performing on the bill and he was managing the sound, something he had never done before. They began writing almost immediately after meeting, and subsequently began dating. Soon they recruited close friends to join as band members; [PERSON_NAME_FULL_1_MALE] on keyboards, and guitarist [PERSON_NAME_FULL_0_MALE]. They were offered an opportunity to make songs for television, which helped them understand the visual and sonic feel that they were striving for  but when it didn't materialize, they used their recordings to make an EP, entitled Superclean Vol. I. Vol. I was released in [YEAR], while its counterpart Vol. II was released in [YEAR].\n",
      "[MONTH]ía (who is mononymous) has stated that her influences include the late Tejano singer Selena, Norah Jones, Sade, [PERSON_NAME_FULL_0_FEMALE], Billie Holiday, Carla Morrison, [MONTH]ieta Venegas, Erykah Badu, and filmmaker [PERSON_NAME_FULL_1_MALE], while Conway is influenced by Tame Impala, Radiohead, D'Angelo, and The Strokes.\n"
   ]
}