{
   "Name": "Medicine (band)",
   "rawData": [
      "Medicine are an American noise pop band, formed in Los Angeles, California in 1990 by guitarist/keyboardist Brad Laner.\n",
      "They are perhaps best known for their cameo appearance in the 1994 film The Crow, in which they performed \"Time Baby II\", although the soundtrack album included a different version titled \"Time Baby III\" (featuring guest vocals from the Cocteau Twins' Elizabeth Fraser).\n",
      "Medicine was formed by ex-Savage Republic drummer Brad Laner, based on some 4-track recordings Laner was working on in 1990. After playing the tapes for music industry representatives, he was told that if he formed a band that sounded like the tapes, he could get a record deal. Laner then assembled a band of musicians from the Los Angeles music scene. Medicine's early lineup included Laner, drummer Jim Goodall (Severed Head in a Bag, Jon Wayne, Lopez Beatles), guitarist Jim Putnam, bassist Eddie Ruscha and singer Annette Zilinskas (an original member of the Bangles). Zilinskas left before any official releases and was replaced by former Fourwaycross singer Beth Thompson. On the basis of the original demo, the band were signed to Creation Records, becoming the first American band to do so. In America, Medicine signed to Rick Rubin's American Recordings label in 1992. With a signature guitar tone, created by running Laner's guitar through a Yamaha 4-track recorder, Medicine's music managed to distinguish itself from some of the more ambiguous endeavors of the shoegaze movement.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "shoegaze, noise pop"
      ],
      "Years active": [
         "1990 (1990)-1995 (1995)",
         "2002 (2002)-2004 (2004)",
         "2011 (2011)-present (present)"
      ],
      "Labels": [
         "Creation, American, Wall of Sound, Captured Tracks, Drawing Room Records"
      ],
      "Associated acts": [
         "Savage Republic, Fourwaycross, Lusk"
      ],
      "Members": [
         "Brad Laner",
         "Annette Zilinskas",
         "Matt Devine"
      ],
      "Past members": [
         "Jim Putnam",
         "Eddie Ruscha",
         "Beth Thompson",
         "Jim Goodall",
         "Stefanie Fife",
         "He Goak",
         "Miriam Maye",
         "Justin Meldal-Johnsen",
         "Bernard Yin",
         "Dean Opseth",
         "Shannon Lee",
         "Dale Jennings"
      ]
   },
   "albums": [
      "Shot Forth Self Living",
      "The Buried Life",
      "Her Highness",
      "The Mechanical Forces of Love",
      "To the Happy Few",
      "Home Everywhere",
      "Scarred for Life"
   ]
}