{
   "Name": "Methods of Mayhem",
   "rawData": [
      "Methods of Mayhem is an American rock band formed in 1999 by Tommy Lee, who had temporarily quit his position as Mötley Crüe's drummer.\n",
      "Lee formed Methods of Mayhem on the eve of his divorce from Pamela Anderson. Their first self-titled album was released in late 1999 and went on to be certified gold. The album featured appearances by Fred Durst, Crystal Method, U-God, Kid Rock, Snoop Dogg, Lil' Kim, George Clinton and Mix Master Mike. \"It's pretty good for what it is…\" Nikki Sixx conceded in 2000. \"I guess you'd call it rap-rock.\" The band disbanded in September 2000.\n",
      "Lee announced that he is reforming Methods of Mayhem, and would start recording in March 2009. Rumors of new members such as drummer Will Hunt, guitarist J3, guitarist Phil X (who contributed to the first album), and the return of touring bassist Marty O'Brien circulated. While an official touring line-up has yet to be confirmed, it is known that each of these members have contributed to the latest album. A live performance on The Tonight Show with Jay Leno saw Morgan Rose (of Sevendust) playing drums, DJ Aero on turntables, J3 on guitar and vocals, and Lee on vocals and guitar. There was no bass player. Methods of Mayhem recently have been signed to Loud & Proud/Roadrunner Records.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Rap rock[1][2]",
         "rap metal",
         "nu metal[3]"
      ],
      "Years active": [
         "1999–2000",
         "2009–2011",
         "2019–present"
      ],
      "Labels": [
         "Roadrunner",
         "MCA"
      ],
      "Associated acts": [
         "Mötley Crüe",
         "Hed PE"
      ],
      "Members": [
         "Tommy Lee",
         "John Allen III",
         "DJ Aero",
         "Marty O'Brien",
         "Morgan Rose"
      ],
      "Past members": [
         "TiLo",
         "Chris Chaney",
         "Will Hunt",
         "Stephen Perkins",
         " Mix Master Mike ",
         " Kai Marcus"
      ]
   },
   "albums": []
}