{
   "Name": "Missing Persons (band)",
   "Sections": [
      "1 Early history",
      "1.1 Early years and Spring Session M (1980–1983)",
      "1.2 Decline and Rhyme & Reason (1984–1986)",
      "2 Reunions",
      "2.1 2001–2003",
      "2.2 2009 and 2011–present",
      "2.3 Reunions of former members",
      "3 Solo careers",
      "4 Reissues",
      "5 Personnel",
      "5.1 Lineup",
      "6 Discography",
      "6.1 Studio albums and EPs",
      "6.2 Live albums and compilations",
      "6.3 Singles",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Missing Persons is an American rock band. The band was founded in 1980 in Los Angeles by guitarist Warren Cuccurullo, vocalist Dale Bozzio, and drummer Terry Bozzio. They later added bassist Patrick O'Hearn and keyboardist Chuck Wild. Dale's quirky voice and heavy makeup made the band a favorite on MTV in the early 1980s.[1]\n",
         "Dale and Terry Bozzio met while working with Frank Zappa, and they married in 1979.[2] Cuccurullo encountered the pair while contributing to the Zappa album Joe's Garage (1979). O'Hearn was also a former member of Zappa's touring band, and Wild had played with a variety of bands before joining.\n"
      ]
   },
   "Early history": {
      "Early years and Spring Session M (1980–1983)": {
         "text": [
            "In 1980 the band was a trio consisting of Bozzio, Bozzio and Cuccurullo.  Augmented by session musicians, the group made its first record, a 4-song EP entitled Missing Persons, in Zappa's brand-new Utility Muffin Research Kitchen studios; the recording was financed by Cuccurullo's father.  The band toured, promoted the EP, appeared in the movie Lunch Wagon (1981), and became a must-see band among the Los Angeles live music crowd.  \"Mental Hopscotch\" was a No. 1 record on local radio station KROQ-FM, and the self-promoted EP sold 7,000 copies.\n",
            "Two years of hard work led up to a signing with Capitol Records in 1982.  With label support, the re-released 4-song EP—with the song \"Words\" replacing the Doors cover \"Hello, I Love You\"—sold another 250,000 units.  The band also added Wild and O'Hearn to the line up, and recorded a new full-length album Spring Session M (1982), the title of which was an anagram of 'Missing Persons'.  The album included both \"Words\" and \"Destination Unknown\" from the initial EP, and went gold.\n",
            "Spring Session M spun off four singles: \"Destination Unknown\", \"Words\", \"Walking in L.A.\",  and \"Windows\", all of which made the Billboard Hot 100, although none charted higher than #42.  The band did experience considerable success in the local markets of Los Angeles, New York, and San Francisco.  As well, the visual effects used in the music video for \"Words\" were unusual for the time, making it popular on the fledgling cable TV channel MTV.\n",
            "Missing Persons appeared at a three-day Southern California concert known as the US Festival, in 1983, along with David Bowie, the Pretenders, U2 and Stevie Nicks.\n"
         ]
      },
      "Decline and Rhyme & Reason (1984–1986)": {
         "text": [
            "The group followed up their debut with the experimental album Rhyme & Reason (1984), which was neither a commercial nor a critical success.  The video for \"Surrender Your Heart\" was designed by Peter Max and received play on MTV, but the track failed to reach the Hot 100.  Only the single \"Give\" met with any chart response.  Chuck Wild left Missing Persons after this album, and was not replaced.\n",
            "Capitol was not happy about the direction the band was taking, as well as their commercial downturn. Consequently, production reins for the third album were given to Bernard Edwards of proven hitmakers Chic; he had also recently produced The Power Station.  The result was the more conventional album Color in Your Life which was issued in June 1986 and only had a minor hit “I Can’t Think About Dancin’”\n",
            "During the short-lived promotional tour for Color in Your Life, increasing tensions between Terry and Dale Bozzio led to the end of the tour, the couple's marriage, and the band.\n"
         ]
      }
   },
   "Reunions": {
      "2001–2003": {
         "text": [
            "In late 2000, Cuccurullo and Dale Bozzio again began discussing a Missing Persons reunion.  In May 2001, after Warren's split with Duran Duran, the new Missing Persons appeared, consisting of original members Warren, Dale and Terry. Joining them were Ron Poster (jazz pianist and organist for the Boston Bruins home hockey arena) and Warren's bassist, Wes Wehmiller (also formerly  Duran Duran's tour bassist from 1997–2001). The short-lived, official reunion consisted of promotional activities and three live performances in July 2001. The studio tracks \"Dark and Dangerous Guy\" and \"Throw Money\" that appear on Lost Tracks (2002) were recorded at this time, as well as the live performances of \"Face to Face\" and \"Give\" on the same album. After the promotional tour ended, Terry Bozzio left the reunited band again due to unresolved issues stemming from his breakup with Dale. According to Dale in a 2004 interview, his parting words to her were \"It's all about you, Dale, it's always been about you\". In the FAQ section on his website, Terry stated that Missing Persons are a 'heartbreaker' for him, because he likes the band's music and playing with them, but that reunion failed because of 'the weirdness' with Dale. The band briefly continued with Jake Hayden taking Terry Bozzio's place but disbanded shortly thereafter.\n",
            "Late 2002/early 2003 brought 'Missing Persons featuring Dale Bozzio and Warren Cuccurullo'. They were joined again by Poster and Wehmiller as well as new drummer Joe Travers (formerly in Cuccurullo's solo band and Duran Duran's tour drummer from 1999–2001). This version of Missing Persons was featured on Access Hollywood (performing \"Destination Unknown\") and did three live performances in February 2003, disbanding shortly thereafter.[3]\n"
         ]
      },
      "2009 and 2011–present": {
         "text": [
            "In 2009 Dale Bozzio and Warren Cuccurullo again reunited the band; with the line-up this time consisting of Bozzio, Cuccurullo, Travers, keyboardist Scheila Gonzalez, and bassist Doug Lunn.[4]\n",
            "On May 11, 2011, it was announced on Dale Bozzio's website that \"Dale and Warren have reformed Missing Persons for an incredible reunion tour in anticipation of the 30th Anniversary of Spring Session M, the band's groundbreaking, certified-Gold album originally released in 1982.\" In the same announcement, Terry Bozzio's absence in this reunion was explained by stating that \"rock bands are dysfunctional families at best, and sometimes, the show just can't go on with all on-board.\" [5] In addition to Bozzio and Cuccurullo, this line-up consisted of Prescott Niles of the Knack on bass, Patrick Bolen on guitars, Fred Bensi on keyboards, and Andy Sanesi on drums. Cuccurullo again departed the band following the end of the 2011 shows; but the band has not officially dissolved since then.\n",
            "In December 2014 a new Missing Persons album was issued, entitled Missing In Action and credited to \"Missing Persons featuring Dale Bozzio\".  Missing Persons now consisted of Dale Bozzio and multi-instrumentalist Billy Sherwood.  Sherwood played almost all the instruments on the record, wrote most of the material, and produced; Bozzio sang, and also co-wrote two songs.\n",
            "In March 2020, another new album appeared credited to Missing Persons featuring Dale Bozzio, entitled Dreaming.  The group now consisted of Dale Bozzio on vocals, and Adam Hamilton producing and playing almost every instrument.  This album consisted mostly of radically re-worked covers of songs by 1960s and 70s artists such as The Mamas and The Papas, The Cars and Joy Division; Bozzio and Hamilton also wrote three originals for the album.\n"
         ]
      },
      "Reunions of former members": {
         "text": [
            "Since 1986, Warren Cuccurullo, Terry Bozzio, and Patrick O'Hearn have continued to support each other's solo projects. From the late 1980s through the 1990s, Cuccurullo and Bozzio performed on some of O'Hearn's albums.[6][7][8] Also, Patrick O'Hearn performed in a jazz fusion group called OUTtrio with Terry Bozzio,[9] and Bozzio is featured on Warren Cuccurullo's CD Playing in Tongues that was released in March, 2009.[10]\n"
         ]
      }
   },
   "Solo careers": {
      "text": [
         "After the breakup of the band, Cuccurullo had his greatest success as guitarist for Duran Duran for fifteen years. Replacing original guitarist Andy Taylor in August 1986, he performed on the albums Notorious (1986) and Big Thing (1988), and was the sole guitarist on the global tours that followed. Becoming an official member in June 1989, he appeared on the group's next five studio albums, and was a co-writer of the hit singles \"Ordinary World\" and \"Come Undone\". He left Duran Duran in 2001 due to a reunion of the group's original members.  Warren also recorded several solo albums before leaving Duran Duran. Later he collaborated with Neil Carlill in the experimental rock band Chicanery.\n",
         "Dale Bozzio scored success as a solo performer under the name Dale with a top 40 hit on the Billboard Dance Chart, \"Simon Simon\", produced by Robert Brookins.  Her album Riot in English was released in 1988 on Prince's Paisley Park label and her album Make Love Not War and Talk Talk EP were released on related labels in 2010. With Cleopatra Records she released New Wave Sessions in 2007 and Missing in Action in 2014.\n",
         "Terry Bozzio worked in 1987 with Mick Jagger and Jeff Beck.  He has played with several groups and artists as a session or tour drummer including the Knack. He records albums and instructional videos in multiple styles and is a highly sought-after session/tour drummer as well as performing constantly at European music festivals and worldwide drum clinics.  Most recently, Bozzio performed and recorded with California nu metal band Korn, in place of regular band drummer David Silveria, in preparation for their untitled eighth studio album.\n",
         "Patrick O'Hearn is a composer and performer of ambient instrumental music on his own albums, and for television and movies.\n",
         "Chuck Wild became an in-demand session player, playing keyboards on albums for Michael Jackson, Paula Abdul, and the Pointer Sisters. He composes New Age and meditation music under the name Liquid Mind,[11] and also has released a digital only project entitled Soundtrack Of The Inner World with singer/ songwriter Seven Whitfield.\n"
      ]
   },
   "Reissues": {
      "text": [
         "Spring Session M was released on CD in 1995, followed by Rhyme & Reason and Color in Your Life in 2000. All three reissues included unreleased B-sides and/or live tracks.\n",
         "Classic Masters is a compilation of remastered tracks and dance mixes issued by Capitol Records with no band involvement.\n",
         "Beginning in 1997, Cuccurullo began work on his 'Missing Persons Archival Trilogy' project. The first CD to be released was Late Nights Early Days in 1998, a live concert recorded in 1981 with the added 1980 studio track \"Action/Reaction\".  This was followed up by a compilation of modern remixes of classic MP tracks, Missing Persons Remixed Hits (1999) which included the TV Mania remix of \"Destination Unknown\". In 2002 Lost Tracks was released, a collection of extremely rare Missing Persons studio, live and remixed tracks from five different eras of the band.\n"
      ]
   },
   "Personnel": {
      "Lineup": {},
      "text": [
         "\n",
         "\n"
      ]
   },
   "Discography": {
      "Studio albums and EPs": {},
      "Live albums and compilations": {},
      "Singles": {
         "text": [
            "100[16]\n",
            "Main[17]\n",
            "Club[17]\n",
            "C-Box[18]\n",
            "Kent[13]\n",
            "Book[19]\n"
         ]
      }
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Missing Persons is an American rock band. The band was founded in 1980 in Los Angeles by guitarist Warren Cuccurullo, vocalist Dale Bozzio, and drummer Terry Bozzio. They later added bassist Patrick O'Hearn and keyboardist Chuck Wild. Dale's quirky voice and heavy makeup made the band a favorite on MTV in the early 1980s.[1]\n",
      "Dale and Terry Bozzio met while working with Frank Zappa, and they married in 1979.[2] Cuccurullo encountered the pair while contributing to the Zappa album Joe's Garage (1979). O'Hearn was also a former member of Zappa's touring band, and Wild had played with a variety of bands before joining.\n",
      "In 1980 the band was a trio consisting of Bozzio, Bozzio and Cuccurullo.  Augmented by session musicians, the group made its first record, a 4-song EP entitled Missing Persons, in Zappa's brand-new Utility Muffin Research Kitchen studios; the recording was financed by Cuccurullo's father.  The band toured, promoted the EP, appeared in the movie Lunch Wagon (1981), and became a must-see band among the Los Angeles live music crowd.  \"Mental Hopscotch\" was a No. 1 record on local radio station KROQ-FM, and the self-promoted EP sold 7,000 copies.\n",
      "Two years of hard work led up to a signing with Capitol Records in 1982.  With label support, the re-released 4-song EP—with the song \"Words\" replacing the Doors cover \"Hello, I Love You\"—sold another 250,000 units.  The band also added Wild and O'Hearn to the line up, and recorded a new full-length album Spring Session M (1982), the title of which was an anagram of 'Missing Persons'.  The album included both \"Words\" and \"Destination Unknown\" from the initial EP, and went gold.\n"
   ]
}