{
   "Name": "Missing Persons (band)",
   "rawData": [
      "Missing Persons is an American rock band. The band was founded in 1980 in Los Angeles by guitarist Warren Cuccurullo, vocalist Dale Bozzio, and drummer Terry Bozzio. They later added bassist Patrick O'Hearn and keyboardist Chuck Wild. Dale's quirky voice and heavy makeup made the band a favorite on MTV in the early 1980s.\n",
      "Dale and Terry Bozzio met while working with Frank Zappa, and they married in 1979. Cuccurullo encountered the pair while contributing to the Zappa album Joe's Garage (1979). O'Hearn was also a former member of Zappa's touring band, and Wild had played with a variety of bands before joining.\n",
      "In 1980 the band was a trio consisting of Bozzio, Bozzio and Cuccurullo.  Augmented by session musicians, the group made its first record, a 4-song EP entitled Missing Persons, in Zappa's brand-new Utility Muffin Research Kitchen studios; the recording was financed by Cuccurullo's father.  The band toured, promoted the EP, appeared in the movie Lunch Wagon (1981), and became a must-see band among the Los Angeles live music crowd.  \"Mental Hopscotch\" was a No. 1 record on local radio station KROQ-FM, and the self-promoted EP sold 7,000 copies.\n"
   ],
   "infobox": {
      "Also known as": [
         "Missing Persons featuring Dale Bozzio"
      ],
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "New wave, synthpop, post-punk, pop rock"
      ],
      "Years active": [
         "1980–1986, 2001–2003, 2009, 2011–present"
      ],
      "Labels": [
         "One Way, Capitol, Pioneer, Sumthing Else, Cleopatra, Hypnotic, Warner Bros."
      ],
      "Associated acts": [
         "Frank Zappa, Duran Duran, Liquid Mind, U.K., Chicanery"
      ],
      "Members": [
         "Dale Bozzio",
         "Fred Bensi",
         "Karl D'Amico",
         "Prescott Niles",
         "Andy Sanesi"
      ],
      "Past members": [
         "Terry Bozzio",
         "Warren Cuccurullo",
         "Patrick O'Hearn",
         "Chuck Wild",
         "Ron Poster",
         "Wes Wehmiller",
         "Jake Hayden",
         "Joe Travers",
         "Michael T. Ross",
         "Doug Lunn"
      ]
   }
}