{
   "Name": "Mystic Braves",
   "rawData": [
      "The Mystic Braves are an American psychedelic rock band formed by Julian Ducatenzeiler & Tony Malacara in 2011 based in Los Angeles. The band cites The Seeds, The Zombies, The Beatles, Ultimate Spinach, along with Garage Rock and Surf Rock as influences.\n",
      "Mystic Braves was founded in 2011 under the name Blackfeet Braves by friends Julian Ducatenzeiler, Dan Solis & Tony Malacara when they started going to shows together in the Los Angeles area. The three later met Shane Stotsenberg and Cameron Gartung after a show in Venice.  The band put its debut self-titled record out in 2013 and continued gaining popularity in the Southern California music scene, leading to opening for legendary english rock band The Zombies. The band was eventually joined by organ player Ignacio Gonzales one of the co-founders of Lolipop Records. Backed by the newly formed Lolipop Records the band gained momentum in Los Angeles and abroad especially in the garage rock and psychedelic revival scenes. In 2014 the band released their sophomore album Desert Island which was subsequently released on Lolipop Records how ever the band ran into a problem. Blackfeet Braves were sued by Lynyrd Skynyrd‘s former drummer, Rickey Medlocke, who has a band called Blackfoot, they initially rebranded themselves as the Mystic Rabbits, after one of their earlier songs, to then settle on a mix of the two names, Mystic Braves. The band enjoyed great international success with the release of Desert Island and toured the US and Europe several times over the next two years. The band's third release Days Of Yesteryear in 2015 was produced by Rob Campanella (The Quarter After, The Brian Jonestown Massacre) in his Echo Park studio. In 2018 the band released The Great Unknown, produced by Kyle Mullarky (The Growlers, Allah-Las) at his studio in Topanga Canyon, California and at Lolipop Records’ new studio/compound in East Los Angeles.\n",
      "Burger Records\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Psychedelic rock[1]"
      ],
      "Years active": [
         "2011 (2011)–present"
      ],
      "Labels": [
         "Lolipop Records, Burger Records"
      ],
      "Associated acts": [
         "Creation Factory, SOS, Jules Duke,"
      ],
      "Members": [
         "Julian Ducatenzeiler",
         "Shane Stotsenberg",
         "Cameron Gartung",
         "Ignacio Gonzales"
      ],
      "Past members": [
         "Tony Malacara",
         "Dan Solis"
      ]
   },
   "prunedData": [
      "The [BAND_NAME] are an [GENRE] band formed by [MONTH]ian Ducatenzeiler & [PERSON_NAME_FULL_0_MALE] in [YEAR] based in Los Angeles. The band cites The Seeds, The Zombies, The Beatles, Ultimate Spinach, along with Garage Rock and Surf Rock as influences.\n",
      "[BAND_NAME] was founded in [YEAR] under the name Blackfeet Braves by friends [MONTH]ian Ducatenzeiler, [PERSON_NAME_FULL_5_MALE] & [PERSON_NAME_FULL_3_MALE] when they started going to shows together in the Los Angeles area. The three later met [PERSON_NAME_FULL_1_MALE] and [PERSON_NAME_FULL_4_MALE] after a [GENRE] band put its debut self-titled record out in [YEAR] and continued gaining popularity in the Southern California music scene, leading to opening for legendary english rock band The Zombies. The band was eventually joined by organ player [PERSON_NAME_FULL_0_MALE] one of the co-founders of Lolipop Records. Backed by the newly formed Lolipop Records the band gained momentum in Los Angeles and abroad especially in the garage rock and psychedelic revival scenes. In [YEAR] the band released their sophomore album Desert Island which was subsequently released on Lolipop Records how ever the band ran into a problem. Blackfeet Braves were sued by Lynyrd Skynyrd‘s former drummer, Rickey Medlocke, who has a band called Blackfoot, they initially rebranded themselves as the Mystic Rabbits, after one of their earlier songs, to then settle on a mix of the two names, [BAND_NAME]. The band enjoyed great international success with the release of Desert Island and toured the US and Europe several times over the next two years. The band's third release Days Of Yesteryear in [YEAR] was produced by [PERSON_NAME_FULL_6_MALE] (The Quarter After, The Brian Jonestown Massacre) in his Echo Park studio. In [YEAR] the band released The Great Unknown, produced by [PERSON_NAME_FULL_2_FEMALE] (The Growlers, Allah-Las) at his studio in Topanga Canyon, California and at Lolipop Records’ new studio/compound in East Los Angeles.\n",
      "Burger Records\n"
   ]
}