{
   "Name": "Nekrogoblikon",
   "rawData": [
      "Nekrogoblikon is an American melodic death metal band based in Los Angeles, California. The group was formed in 2006, by Tim Lyakhovetskiy and Nicky Calonne. The band has released four full-length albums, Goblin Island, Stench, Heavy Meta, and Welcome to Bonkers and one EP, Power. The band's music centers around goblins.\n",
      "Nekrogoblikon was formed in 2006 by Nicky Calonne and Tim Lyakhovetskiy in Palo Alto, California. The two of them recorded Nekrogoblikon's first album, Goblin Island, in Lyakhovetskiy's basement. On his return to school at the University of California, Santa Barbara, Lyakhovetskiy found Ashleigh Carracino, Alex Duddy, Spencer Bartz, Alex Alereza, and Austin Nickel to form the rest of the band. The group played eleven shows before Bartz moved to Japan, and was replaced by Eddie Trager.\n",
      "On July 19, 2011 the band released Stench. Stench was reviewed positively by \"Pop and Hiss\", the Los Angeles Times music blog, which praised its technical proficiency and songwriting, and described its inclusion of electronic elements as working \"surprisingly well.\" Metal Sucks also praised the album with a 4.5/5 rating, describing it as more professional than Goblin Island, and complimenting its technicality. Blistering gave the album a 9/10 rating, calling it \"fun and entertaining.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Santa Barbara, California, United States"
      ],
      "Genres": [
         "Melodic death metal",
         "Folk metal",
         "comedy metal",
         "symphonic metal",
         "power metal",
         "death metal",
         "metalcore",
         "electronic rock"
      ],
      "Years active": [
         "2006–present"
      ],
      "Labels": [
         "Mystery Box"
      ],
      "Associated acts": [
         "Confide",
         "Psychostick",
         "Steel Panther"
      ],
      "Website": [
         "nekrogoblikon.bandcamp.com"
      ],
      "Members": [
         "Nicky Calonne",
         "Alex Alereza",
         "Aaron Minich",
         "Aaron Van Zutphen",
         "Eric W. Brown",
         "Joe Nelson"
      ],
      "Past members": [
         "Eddie Trager",
         "Brandon Frenzel",
         "Tim Lyakhovetskiy",
         "Anthony DeLorenzi",
         "Alex Duddy",
         "Austin Nickel",
         "Ashleigh Carracino",
         "Spencer Bartz",
         "Jason Kaye"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band based in Los Angeles, California. The group was formed in [YEAR], by [PERSON_NAME_FULL_1_MALE] and [PERSON_NAME_FULL_0_MALE]. The band has released four full-length albums, Goblin Island, Stench, Heavy Meta, and Welcome to Bonkers and one EP, Power. The band's music centers around goblins.\n",
      "[BAND_NAME] was formed in [YEAR] by [PERSON_NAME_FULL_3_MALE] and [PERSON_NAME_FULL_5_MALE] in Palo Alto, California. The two of them recorded [BAND_NAME]'s first album, Goblin Island, in [PERSON_NAME_LAST_5]'s basement. On his return to school at the University of California, [PERSON_NAME_FULL_2_FEMALE], [PERSON_NAME_LAST_5] found [PERSON_NAME_FULL_1_FEMALE], [PERSON_NAME_FIRST_4] [PERSON_NAME_LAST_6], Spencer Bartz, [PERSON_NAME_FULL_4_MALE], and Austin Nickel to form the rest of the band. The group played eleven shows before Bartz moved to Japan, and was replaced by [PERSON_NAME_FULL_0_MALE].\n",
      "On [MONTH] 19, [YEAR] the band released Stench. Stench was reviewed positively by [SONG_NAME]\n"
   ]
}