{
   "Band members": {
      "Current": {},
      "Former": {},
      "Timeline": {}
   },
   "Discography": {
      "Music videos": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "\"Chop Suey!\" (2020)": {
         "text": [
            "Nekrogoblikon released their cover of System of a Down's \"Chop Suey!\" on July 3, 2020.[15]\n"
         ]
      },
      "Formation and Goblin Island (2006–2010)": {
         "text": [
            "Nekrogoblikon was formed in 2006 by Nicky Calonne and Tim Lyakhovetskiy in Palo Alto, California.[1] The two of them recorded Nekrogoblikon's first album, Goblin Island, in Lyakhovetskiy's basement. On his return to school at the University of California, Santa Barbara, Lyakhovetskiy found Ashleigh Carracino, Alex Duddy, Spencer Bartz, Alex Alereza, and Austin Nickel to form the rest of the band. The group played eleven shows before Bartz moved to Japan, and was replaced by Eddie Trager.[2]\n"
         ]
      },
      "Heavy Meta (2014–2015)": {
         "text": [
            "In January 2014, Nekrogoblikon announced through their instagram account that they were working on a new release.[12]\n",
            "On March 9, 2015 the band released the first track, \"Full Body Xplosion\", on their YouTube account. They also announced on Facebook that the album Heavy Meta would be released via Mystery Box, the band's own label.[13]\n",
            "On June 2, 2015 the album was released.[14] Heavy Meta is a concept album, consisting of 10 songs that when listened to in succession, tells the story of an immortal goblin race seeking a way to finally die. The album received fairly consistent reviews with the band's previous offerings scoring a 3.5/5 on Angry Metal Guy. Metal Injection offered substantive praise for the album saying \"Heavy Meta is the best album Nekrogoblikon has released so far in their career\".\n"
         ]
      },
      "Power (2013)": {
         "text": [
            "In June 2013, Nekrogoblikon went on a European tour to perform at several venues and festivals, including Download Festival in England and Rock am Ring and Rock im Park in Germany.[7]\n",
            "In August 2013, Nekrogoblikon released an EP titled Power, produced by Nekrogoblikon and mixed by Matt Hyde.[8] The album received a 2/5 review from Metal Sucks, which criticized the songwriting and described the band as a \"lame joke.\"[9] Sputnikmusic gave the album a 3.5/5 review, describing the album as \"ridiculous,\" and praising the instrumentation and technicality but criticizing the vocals and inconsistency.[10]\n",
            "In 2014, Nekrogoblikon performed on the Kerrang! Tour, along with Limp Bizkit, Crossfaith, and HECK (then Baby Godzilla).[11]\n"
         ]
      },
      "Stench (2011–2012)": {
         "text": [
            "On July 19, 2011 the band released Stench. Stench was reviewed positively by \"Pop and Hiss\", the Los Angeles Times music blog, which praised its technical proficiency and songwriting, and described its inclusion of electronic elements as working \"surprisingly well.\"[1] Metal Sucks also praised the album with a 4.5/5 rating, describing it as more professional than Goblin Island, and complimenting its technicality.[3] Blistering gave the album a 9/10 rating, calling it \"fun and entertaining.\"[4]\n",
            "In September 2012 the band released a music video for \"No One Survives,\" directed by Brandon Dermer. The video depicts a goblin (played by Dave Rispoli) who tries, and fails, to win the affections of a coworker (played by Kayden Kross). The video became a viral hit and was viewed more than 1.5 million times in the first 3 months.[5][6]\n"
         ]
      },
      "Welcome to Bonkers (2018)": {
         "text": [
            "Nekrogoblikon released their fifth album Welcome to Bonkers, on April 13, 2018.\n",
            "Instagram photos in April 2019 show members working on new music, presumably for the sixth Nekrogoblikon album (yet to be confirmed) at Audiohammer Studios in Florida.\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and Goblin Island (2006–2010)",
      "1.2 Stench (2011–2012)",
      "1.3 Power (2013)",
      "1.4 Heavy Meta (2014–2015)",
      "1.5 Welcome to Bonkers (2018)",
      "1.6 \"Chop Suey!\" (2020)",
      "2 Band members",
      "2.1 Current",
      "2.2 Former",
      "2.3 Timeline",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Music videos",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Nekrogoblikon is an American melodic death metal band based in Los Angeles, California. The group was formed in 2006, by Tim Lyakhovetskiy and Nicky Calonne. The band has released four full-length albums, Goblin Island, Stench, Heavy Meta, and Welcome to Bonkers and one EP, Power. The band's music centers around goblins.\n"
      ]
   },
   "Title": "Nekrogoblikon - Wikipedia"
}