{
   "Name": "Nitro (band)",
   "rawData": [
      "Nitro was an American heavy metal band from Hollywood, California. Formed in 1988, the group originally featured vocalist Jim Gillette, guitarist Michael Angelo Batio, bassist T. J. Racer and drummer Bobby Rock. Nitro released its debut album O.F.R. in 1989, which reached number 140 on the US Billboard 200. Rock was replaced by K. C. Comet for the album's tour and Racer would leave the band thereafter. Nitro II: H.W.D.W.S., released in 1992, featured Ralph Carter on bass and Johnny Thunder on drums. The group broke up in 1993, with a number of previously unreleased demo recordings issued on the 1999 album Gunnin' for Glory.\n",
      "In late 2016, it was announced that Gillette and Batio had reformed the band, with Lamb of God drummer Chris Adler added to the group's lineup. Plans were made to record a third album – which would have been the band's first full-length studio album since 1992 – with Victor Wooten on bass and Kane Churko producing. Matt DeVries performed in place of Wooten at live shows. In 2017, \"It Won't Die\" was released as the lead single from the album. However, Batio announced in May 2019 that the band had once again split up, but added that some of the material from the abandoned third album would surface on his next solo release.\n",
      "In 1987, vocalist Jim Gillette released his debut solo album Proud to Be Loud, which featured contributions from guitarist Michael Angelo Batio and bassist T. J. Racer, the three of whom would later go on to form Nitro. Gillette and Batio had initially met at a beach party, while Racer was introduced to the singer as an attendee of one of his instructional vocal courses. Former Vinnie Vincent Invasion drummer Bobby Rock joined the band shortly thereafter. Speaking about joining the band, Rock recalled that Gillette and Batio recruited him by explaining that they \"wanted to record the most over-the-top, in-your-face metal record ever\". Nitro signed with Rhino Entertainment record label Rampage Records after their first show, at which Gillette \"reportedly shattered three wine glasses with his voice\".\n"
   ],
   "infobox": {
      "Origin": [
         "Hollywood, California, USA"
      ],
      "Genres": [
         "Heavy metal",
         "glam metal"
      ],
      "Years active": [
         "1988–1993",
         "2016–2019"
      ],
      "Labels": [
         "Rhino",
         "M.A.C.E."
      ],
      "Past members": [
         "Jim Gillette",
         "Michael Angelo Batio",
         "T. J. Racer",
         "Bobby Rock",
         "K. C. Comet",
         "Ralph Carter",
         "Johnny Thunder",
         "Chris Adler",
         "Victor Wooten"
      ]
   }
}