{
   "Name": "Nitro (band)",
   "Sections": [
      "1 History",
      "1.1 1987–1993: Formation and first two releases",
      "1.2 2016–2019: Return and cancelled third album",
      "2 Members",
      "3 Timeline",
      "4 Discography",
      "5 References"
   ],
   "Summary": {
      "text": [
         "Nitro was an American heavy metal band from Hollywood, California. Formed in 1988, the group originally featured vocalist Jim Gillette, guitarist Michael Angelo Batio, bassist T. J. Racer and drummer Bobby Rock. Nitro released its debut album O.F.R. in 1989, which reached number 140 on the US Billboard 200. Rock was replaced by K. C. Comet for the album's tour and Racer would leave the band thereafter. Nitro II: H.W.D.W.S., released in 1992, featured Ralph Carter on bass and Johnny Thunder on drums. The group broke up in 1993, with a number of previously unreleased demo recordings issued on the 1999 album Gunnin' for Glory.\n",
         "In late 2016, it was announced that Gillette and Batio had reformed the band, with Lamb of God drummer Chris Adler added to the group's lineup. Plans were made to record a third album – which would have been the band's first full-length studio album since 1992 – with Victor Wooten on bass and Kane Churko producing. Matt DeVries performed in place of Wooten at live shows. In 2017, \"It Won't Die\" was released as the lead single from the album. However, Batio announced in May 2019 that the band had once again split up, but added that some of the material from the abandoned third album would surface on his next solo release.\n"
      ]
   },
   "History": {
      "1987–1993: Formation and first two releases": {
         "text": [
            "In 1987, vocalist Jim Gillette released his debut solo album Proud to Be Loud, which featured contributions from guitarist Michael Angelo Batio and bassist T. J. Racer, the three of whom would later go on to form Nitro.[1] Gillette and Batio had initially met at a beach party, while Racer was introduced to the singer as an attendee of one of his instructional vocal courses.[2] Former Vinnie Vincent Invasion drummer Bobby Rock joined the band shortly thereafter.[3] Speaking about joining the band, Rock recalled that Gillette and Batio recruited him by explaining that they \"wanted to record the most over-the-top, in-your-face metal record ever\".[4] Nitro signed with Rhino Entertainment record label Rampage Records after their first show, at which Gillette \"reportedly shattered three wine glasses with his voice\".[3]\n",
            "Gillette, Batio, Racer and Rock recorded the first Nitro album at Front Page Productions in Costa Mesa, California with producer and engineer Charlie Watts.[5] The album was released in 1989 and spent nine weeks on the US Billboard 200, peaking at number 140.[6] Shortly after the recording of the album, Rock left Nitro to join Nelson, with K. C. Comet replacing him for the album's promotional concert tour (he also appeared in the music videos for the singles \"Freight Train\" and \"Long Way from Home\").[3] After the tour, Comet was replaced by Johnny Thunder while Ralph Carter was brought in after Racer's departure.[2] The band released its second album Nitro II: H.W.D.W.S. in 1992, which featured a cover version of Ted Nugent's \"Cat Scratch Fever\" as its sole single, before breaking up the following year.[2]\n",
            "After Nitro's breakup, a number of previously unreleased demo recordings were issued on the compilation Gunnin' for Glory, released on Batio's record label M.A.C.E. Music in 1999.[7] In the subsequent years, there were occasional comments from Gillette and Batio hinting at a potential reformation of the band. In 2008, when asked at Rocklahoma festival about the possibility of a return for the group, Gillette commented that \"It would be great to do; maybe next year\", adding that \"It would take about six months to get back to where I would like it to be vocally.\"[3] However, Batio responded later in the year by revealing that he did not want to reform the band as Gillette was only interested in writing new material, not performing the band's old songs, which the guitarist explained would \"not be the same\".[8]\n"
         ]
      },
      "2016–2019: Return and cancelled third album": {
         "text": [
            "On November 30, 2016, it was announced that Gillette and Batio were set to reform Nitro with then-Lamb of God drummer Chris Adler.[9] Speaking about the potential style of the band's new material, Adler commented that \"I'm blown away by the modern sound and groove in the material. The chaos has been harnessed and it's incredibly heavy.\"[10] The trio began recording for a new album the following month with engineer Josh Wilbur.[9] Victor Wooten was later enlisted as the bassist for the recording of the album,[11] followed by producer and songwriter Kane Churko.[12] Batio commented on the direction of the group's new recordings in February 2017, suggesting that it would feature more death metal than the glam for which the band was previously known, owing to Gillette's changed vocal style.[13] \"It Won't Die\" was released as the band's first new song since 1999 on July 25.[14] In September, the reunited band performed its first string of concerts on an Indian tour in September 2017, with Matt DeVries joining as the touring bassist.[15]\n",
            "In a May 2019 interview, Batio announced that Nitro had once again broken up. When asked about the status of the band's slated third album, he said, \"It's gone ... we just can't go back ... after we did a few songs, we did a tour together, we all realized\".[16] The guitarist later added, \"I'm best friends with Jim Gillette – we're like brothers. We never had an argument, even back in the old days\", as well as assuring fans that some of the material recorded with Adler and Wooten would surface on his next solo release, due later in the year.[16]\n"
         ]
      }
   },
   "Members": {
      "text": [
         "Former members\n",
         "Guests\n"
      ]
   },
   "Timeline": {},
   "Discography": {
      "text": [
         "Studio albums\n",
         "Compilations\n",
         "Singles\n",
         "Music videos\n"
      ]
   },
   "References": {},
   "coreData": [
      "Nitro was an American heavy metal band from Hollywood, California. Formed in 1988, the group originally featured vocalist Jim Gillette, guitarist Michael Angelo Batio, bassist T. J. Racer and drummer Bobby Rock. Nitro released its debut album O.F.R. in 1989, which reached number 140 on the US Billboard 200. Rock was replaced by K. C. Comet for the album's tour and Racer would leave the band thereafter. Nitro II: H.W.D.W.S., released in 1992, featured Ralph Carter on bass and Johnny Thunder on drums. The group broke up in 1993, with a number of previously unreleased demo recordings issued on the 1999 album Gunnin' for Glory.\n",
      "In late 2016, it was announced that Gillette and Batio had reformed the band, with Lamb of God drummer Chris Adler added to the group's lineup. Plans were made to record a third album – which would have been the band's first full-length studio album since 1992 – with Victor Wooten on bass and Kane Churko producing. Matt DeVries performed in place of Wooten at live shows. In 2017, \"It Won't Die\" was released as the lead single from the album. However, Batio announced in May 2019 that the band had once again split up, but added that some of the material from the abandoned third album would surface on his next solo release.\n",
      "In 1987, vocalist Jim Gillette released his debut solo album Proud to Be Loud, which featured contributions from guitarist Michael Angelo Batio and bassist T. J. Racer, the three of whom would later go on to form Nitro.[1] Gillette and Batio had initially met at a beach party, while Racer was introduced to the singer as an attendee of one of his instructional vocal courses.[2] Former Vinnie Vincent Invasion drummer Bobby Rock joined the band shortly thereafter.[3] Speaking about joining the band, Rock recalled that Gillette and Batio recruited him by explaining that they \"wanted to record the most over-the-top, in-your-face metal record ever\".[4] Nitro signed with Rhino Entertainment record label Rampage Records after their first show, at which Gillette \"reportedly shattered three wine glasses with his voice\".[3]\n",
      "Gillette, Batio, Racer and Rock recorded the first Nitro album at Front Page Productions in Costa Mesa, California with producer and engineer Charlie Watts.[5] The album was released in 1989 and spent nine weeks on the US Billboard 200, peaking at number 140.[6] Shortly after the recording of the album, Rock left Nitro to join Nelson, with K. C. Comet replacing him for the album's promotional concert tour (he also appeared in the music videos for the singles \"Freight Train\" and \"Long Way from Home\").[3] After the tour, Comet was replaced by Johnny Thunder while Ralph Carter was brought in after Racer's departure.[2] The band released its second album Nitro II: H.W.D.W.S. in 1992, which featured a cover version of Ted Nugent's \"Cat Scratch Fever\" as its sole single, before breaking up the following year.[2]\n"
   ]
}