{
   "Name": "Oingo Boingo",
   "rawData": [
      "Oingo Boingo (/ˈɔɪŋɡoʊ ˈbɔɪŋɡoʊ/) was an American new wave band, formed by songwriter Danny Elfman in 1979.  The band emerged from a surrealist musical theatre troupe, The Mystic Knights of the Oingo Boingo, that Elfman had led and written material for in the years previous.\n",
      "Oingo Boingo were known for their high energy live concerts and experimental music, which can be described as mixing rock, ska, pop, and world music. The band's body of work spanned 17 years, with various genre and line-up changes. Their best-known songs include \"Only a Lad\", \"Dead Man's Party\" and \"Weird Science\".\n",
      "As a rock band, Oingo Boingo started as a ska and punk-influenced new wave octet, achieving significant popularity in Southern California. During the mid-1980s, the band changed line-ups and adopted a more pop oriented style, until a significant genre change to alternative rock in 1994. At that point, the name was shortened to simply Boingo and the keyboardist and horn section were dropped. The band retired after a farewell concert on Halloween 1995, for which they reverted to the name Oingo Boingo and readopted the horn section.\n"
   ],
   "infobox": {
      "Also known as": [
         "Clowns of Death",
         "Mosley & The B-Men",
         "Boingo"
      ],
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "New wave[1]",
         "ska[2]"
      ],
      "Years active": [
         "1979–1995"
      ],
      "Labels": [
         "I.R.S., A&M, MCA, Giant"
      ],
      "Associated acts": [
         "The Mystic Knights of the Oingo Boingo, Tito & Tarantula"
      ],
      "Past members": [
         "Leon Schneiderman",
         "Dale Turner",
         "Sam \"Sluggo\" Phipps",
         "Danny Elfman",
         "Steve Bartek",
         "John \"Vatos\" Hernandez",
         "Josh Gordon",
         "Kerry Hatch",
         "Richard Gibbs",
         "John Avila",
         "Michael Bacich",
         "Carl Graves",
         "Warren Fitzgerald",
         "Doug Lacy",
         "Marc Mann"
      ]
   },
   "albums": [
      "Only a Lad",
      "Nothing to Fear",
      "Good for Your Soul",
      "So-Lo",
      "Dead Man's Party",
      "Boi-ngo",
      "Dark at the End of the Tunnel",
      "Boingo"
   ]
}