{
   "Name": "Oingo Boingo",
   "Sections": [
      "1 History",
      "1.1 The Mystic Knights of the Oingo Boingo (1972–1979)",
      "1.2 I.R.S. and A&M years (1979–1984)",
      "1.3 MCA years (1984–1992)",
      "1.4 Final years (1993–1995)",
      "1.5 Legacy",
      "2 Members",
      "3 Discography",
      "4 Filmography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Oingo Boingo (/ˈɔɪŋɡoʊ ˈbɔɪŋɡoʊ/) was an American new wave band, formed by songwriter Danny Elfman in 1979.  The band emerged from a surrealist musical theatre troupe, The Mystic Knights of the Oingo Boingo, that Elfman had led and written material for in the years previous.[3]\n",
         "Oingo Boingo were known for their high energy live concerts and experimental music, which can be described as mixing rock, ska, pop, and world music.[1] The band's body of work spanned 17 years, with various genre and line-up changes. Their best-known songs include \"Only a Lad\", \"Dead Man's Party\" and \"Weird Science\".\n",
         "As a rock band, Oingo Boingo started as a ska and punk-influenced[4][5] new wave octet, achieving significant popularity in Southern California. During the mid-1980s, the band changed line-ups and adopted a more pop oriented style, until a significant genre change to alternative rock in 1994. At that point, the name was shortened to simply Boingo and the keyboardist and horn section were dropped. The band retired after a farewell concert on Halloween 1995, for which they reverted to the name Oingo Boingo and readopted the horn section.\n"
      ]
   },
   "History": {
      "The Mystic Knights of the Oingo Boingo (1972–1979)": {
         "text": [
            "The Mystic Knights of the Oingo Boingo began as a street theater troupe in Los Angeles, founded by Richard Elfman. The name was inspired by a fictional secret society on the Amos 'n' Andy TV series called The Mystic Knights of the Sea. This version of the band employed as many as 15 performers at any given time, playing over 30 instruments, including some instruments built by band members.\n",
            "Richard's brother, Danny Elfman joined the band in 1974 and later became its leader. The group gradually moved away from its street theatre origins and transformed into a dedicated musical theatre act. The group performed an eclectic repertoire ranging from Cab Calloway covers to instrumentals in the style of Balinese gamelan and Russian ballet music, and later original songs by Danny Elfman. Guitarist Steve Bartek joined in 1976 as musical co-director.\n"
         ]
      },
      "I.R.S. and A&M years (1979–1984)": {
         "text": [
            "In 1979, Danny Elfman reformed the group as a dedicated rock band, under the new name Oingo Boingo, at which point most existing members left. Steve Bartek and a brass trio of Dale Turner, Sam 'Sluggo' Phipps and Leon Schneiderman continued with the new band. Various reasons were given for the restart as a rock band, notably Danny's emerging musical interests and reducing the need for transportation and set-up of multiple stage sets and props. Elfman stated the shift was inspired by ska revival bands such as the Specials, Madness and the Selecter, the new wave band XTC, as well as the \"energy and speed\" of punk.[6][7][5]\n",
            "For some early gigs during the reformation, the band used the shortened name The Mystic Knights (and in the animated short \"Face Like a Frog\" by Sally Cruikshank, the song \"Don't Go in the Basement\" is credited to that name). The name Oingo Boingo was settled on in 1979, at which point their early song \"I'm Afraid\" appeared on the Rhino Records Los Angeles rock and new wave \"up and coming\" compilation, L.A. In.\n",
            "That same year, the band issued a limited print, promo-only EP record, the Demo EP, intended for distribution to radio stations and recording industry A&R representatives, to help land a contract. The effort paid off, as the record caught the attention of I.R.S. Records, who released a revised version of the EP in 1980; the Oingo Boingo EP.\n",
            "The band had now coalesced as an octet: Danny Elfman on lead vocals and rhythm guitar; Steve Bartek on lead guitar; Richard Gibbs on keyboards; Kerry Hatch on bass; Johnny \"Vatos\" Hernandez on drums; and Leon Schneiderman, Sam \"Sluggo\" Phipps and Dale Turner on horns. Early success for the group came in 1980 with the song \"Only a Lad\" from the eponymous EP. The song aired frequently in Los Angeles on KROQ-FM and complemented the station's then-unusual new wave format.\n",
            "Following regional success of \"Only a Lad\", the group released its first full-length album in 1981, also titled Only a Lad (and featuring a new recording of the song). The band released further albums Nothing to Fear in 1982 and Good for Your Soul in 1983. Although the band's sound was termed as new wave, Oingo Boingo's use of exotic percussion, a three-piece horn section, unconventional scales and harmony, and surreal imagery was a genre-skewing combination.\n",
            "In 1984, bassist Kerry Hatch and keyboardist Richard Gibbs departed to form the short-lived band Zuma II and Oingo Boingo went on temporary hiatus, although this was not known publicly at the time. Elfman later claimed the two departing members had \"lost the spirit\", but stated, \"I could never blame anybody for losing the spirit. It's very hard being an 8-piece ensemble doing what, at the time, was non-commercial music\".[8]\n"
         ]
      },
      "MCA years (1984–1992)": {
         "text": [
            "Elfman used the 1984 hiatus as an opportunity to release a solo album, co-produced with Steve Bartek, with the remaining members of Oingo Boingo returning as session musicians. This was released as So-Lo in late 1984. At this point, new manager Mike Gormley, who had just left the position of VP of Publicity and Asst. to the Chairman of A&M, negotiated a release from the label and signed the band to MCA Records.\n",
            "Shortly after releasing So-Lo, Oingo Boingo returned to performing with new bassist John Avila and keyboardist Mike Bacich. The first release with the new line-up was Dead Man's Party in 1985. The album marked a notable change towards more pop oriented songwriting and production style and became the band's most commercially successful record. It featured their highest-charting song on the Billboard Hot 100, \"Weird Science\", which was written for the John Hughes film of the same name. \n",
            "The band appeared on a number of movie soundtracks in the early to mid-1980s, including an appearance in the movie Back to School in 1986, performing their hit single \"Dead Man's Party\". The soundtrack to the movie Bachelor Party included a theme song written by Elfman and a song unreleased on any Oingo Boingo album, \"Something Isn't Right\".\n",
            "During this era, Danny Elfman also began scoring major films, beginning with 1985's Pee-wee's Big Adventure. Elfman would go on to write the scores to almost all of Tim Burton's films. Oingo Boingo guitarist Steve Bartek has orchestrated most of Elfman's film and television scores.\n",
            "The album BOI-NGO was released in 1987. Following its recording, Bacich was replaced by new keyboardist Carl Graves. The band's 1988 release, Boingo Alive, comprised \"live\" re-recordings of previous album songs on a studio soundstage, plus a new song, \"Winning Side\". This new track was also released as a single and became a No. 14 hit on US Modern Rock radio stations.\n",
            "In 1990, the band released their seventh studio album, Dark at the End of the Tunnel, featuring more mellow songs than any previous release and including the singles \"Out of Control\" and \"Flesh 'N Blood\".\n"
         ]
      },
      "Final years (1993–1995)": {
         "text": [
            "Oingo Boingo continued to regularly perform live, most notably with annual Halloween concerts at Irvine Meadows and the Universal Amphitheatre. Following a short hiatus in 1992, during which time Elfman was busy scoring films, the band returned in 1993 with an increasingly different, hard-rock musical direction and debuted new material, such as \"Insanity\", \"Helpless\" and the unreleased song \"Did It There\". Shows during these years often included the so-called \"Sad Clown Orchestra\" providing additional accordion and circus percussion.\n",
            "That same year, Oingo Boingo began recording an eighth studio album for new label Giant Records. The sessions stalled when Elfman became heavily involved writing the music for animated musical The Nightmare Before Christmas with Tim Burton.[9][10] Of this period, Elfman would later reflect that, after over 15 years, he had begun losing his passion for the band.[11]\n",
            "In 1994, the band consolidated their new musical style and shortened its name to \"Boingo\". Guitarist Warren Fitzgerald joined while keyboardist Carl Graves and the horn trio were removed. This marked the only year that the band toured without the horn section.[12][13]\n",
            "The previously-shelved album was completed with the new 5-piece line-up, including orchestral instrumentation and several songs improvised in the studio for the first time in the band's history.[14] This was released as Boingo in 1994, and would be the band's final studio album.\n",
            "In 1995, it was announced that Boingo would be disbanding after 17 years. The band embarked on a \"Farewell\" tour in 1995, restoring the original horn trio and reverting its name back to Oingo Boingo, ending with a final Halloween performance at the Universal Amphitheatre. The concert was filmed and released as a live album and DVD.\n"
         ]
      },
      "Legacy": {
         "text": [
            "Following the band's dissolution, Danny Elfman continued composing for film and has been nominated for four Academy Awards for his work. While he has provided the scores for Tim Burton's films almost exclusively since Pee-wee's Big Adventure in 1985, Elfman continues to be much sought-after by other directors in the movie business as well. Elfman's other scores have included those for Batman, Edward Scissorhands, Good Will Hunting, Men in Black, Spider-Man, Big Fish, and The Nightmare Before Christmas. Elfman has also written themes for more than a dozen TV series, including The Simpsons, Batman: The Animated Series, Tales from the Crypt and Desperate Housewives. Elfman almost exclusively employs former Oingo Boingo guitarist Steve Bartek as his orchestrator. \n",
            "In early 2007, Danny Elfman said there would not be an Oingo Boingo reunion, due to fears that playing live would exacerbate his, and possibly other band members', hearing loss. Not withstanding this announcement, on Halloween 2015, Danny Elfman, along with two of the other original voices from the movie The Nightmare Before Christmas, Catherine O'Hara and Ken Page, performed at the Hollywood Bowl, singing all of the songs from the movie with a complete orchestra, while the film played in its entirety. Paul Reubens made a special guest appearance in an encore performance of \"Kidnap the Sandy Claws,\" reprising his original role of Lock from the film, and the event culminated in Elfman and Oingo Boingo guitarist Steve Bartek performing \"Dead Man's Party\" for the first time in twenty years.\n",
            " – Los Angeles radio & TV host Richard Blade speaking in 2016 on the band's impact.[15]\n",
            "Over 20 years since their Farewell concert, Oingo Boingo were honored with a resolution at the LA City Hall in April 2016. Popular LA radio & television personality Richard Blade gave a speech describing Oingo Boingo. Several members attended the meeting from across the band's changing line-ups, including Johnny \"Vatos\" Hernandez, founding keyboardist Richard Gibbs, John Avila, Carl Graves and Sam \"Sluggo\" Phipps.[16]\n",
            "In 2003, former keyboardist Richard Gibbs scored the Battlestar Galactica miniseries with composer Bear McCreary. In 2005, John Avila, Johnny \"Vatos\" Hernandez and Steve Bartek began contributing to the subsequent McCreary-scored Battlestar Galactica television series. During the 2006 Halloween season, there were two Johnny Vatos Tribute to Halloween shows, one in Los Angeles and one in Orange County, California, with Vatos, Bartek, Avila, Phipps, and Legacy.[17]\n",
            "Since the 2005 Halloween season, former drummer Johnny \"Vatos\" Hernandez has regularly put together an Oingo Boingo tribute band for performances at different venues, mainly throughout Southern California and Arizona, including The Grove of Anaheim. Initially billed as the \"Johnny 'Vatos' Tribute to Halloween, Featuring Former Members of Oingo Boingo,\"[18][19] Hernandez eventually titled the project Boingo Dance Party and then Oingo Boingo Former Members. The group is joined intermittently by former Oingo Boingo members such as Steve Bartek, Carl Graves, John Avila and Sam \"Sluggo\" Phipps, while vocals are usually provided by singer Brendan McCreary, also known as Bt4.[20]\n",
            "John Avila and Johnny \"Vatos\" Hernandez were two members of the trio Food For Feet. They also formed the rhythm section of Tito & Tarantula, a Los Angeles band fronted by Tito Larriva of The Plugz and the Cruzados. Avila and Hernandez also joined Larriva and guitarist Stevie Hufstetter in a one-off project band called Psychotic Aztecs. The Aztecs released one album on the Grita label called Santa Sangre. Doug Lacy (Boingo live keyboardist and percussionist) recruited bassist John Avila, guitarist Steve Bartek, drummer Johnny \"Vatos\" Hernandez, and saxophonist Sam Phipps (among other musicians) for a band called Doug & The Mystics. They recorded one album, New Hat, which included a cover of the Oingo Boingo song \"Try to Believe\", as well as original songs and covers of songs by Frank Zappa and other artists. Doug had released one solo album previously.\n",
            "On June 25, 2019, The New York Times Magazine listed Oingo Boingo among hundreds of artists who had tapes destroyed in the 2008 Universal fire, likely affecting the A&M and MCA recordings following their mergers under UMG.[21]\n"
         ]
      }
   },
   "Members": {},
   "Discography": {},
   "Filmography": {
      "text": [
         "As Oingo Boingo\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Oingo Boingo (/ˈɔɪŋɡoʊ ˈbɔɪŋɡoʊ/) was an American new wave band, formed by songwriter Danny Elfman in 1979.  The band emerged from a surrealist musical theatre troupe, The Mystic Knights of the Oingo Boingo, that Elfman had led and written material for in the years previous.[3]\n",
      "Oingo Boingo were known for their high energy live concerts and experimental music, which can be described as mixing rock, ska, pop, and world music.[1] The band's body of work spanned 17 years, with various genre and line-up changes. Their best-known songs include \"Only a Lad\", \"Dead Man's Party\" and \"Weird Science\".\n",
      "As a rock band, Oingo Boingo started as a ska and punk-influenced[4][5] new wave octet, achieving significant popularity in Southern California. During the mid-1980s, the band changed line-ups and adopted a more pop oriented style, until a significant genre change to alternative rock in 1994. At that point, the name was shortened to simply Boingo and the keyboardist and horn section were dropped. The band retired after a farewell concert on Halloween 1995, for which they reverted to the name Oingo Boingo and readopted the horn section.\n",
      "The Mystic Knights of the Oingo Boingo began as a street theater troupe in Los Angeles, founded by Richard Elfman. The name was inspired by a fictional secret society on the Amos 'n' Andy TV series called The Mystic Knights of the Sea. This version of the band employed as many as 15 performers at any given time, playing over 30 instruments, including some instruments built by band members.\n"
   ],
   "infobox": {
      "Also known as": [
         "Clowns of Death",
         "Mosley & The B-Men",
         "Boingo"
      ],
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "New wave[1]",
         "ska[2]"
      ],
      "Years active": [
         "1979–1995"
      ],
      "Labels": [
         "I.R.S., A&M, MCA, Giant"
      ],
      "Associated acts": [
         "The Mystic Knights of the Oingo Boingo, Tito & Tarantula"
      ],
      "Past members": [
         "Leon Schneiderman",
         "Dale Turner",
         "Sam \"Sluggo\" Phipps",
         "Danny Elfman",
         "Steve Bartek",
         "John \"Vatos\" Hernandez",
         "Josh Gordon",
         "Kerry Hatch",
         "Richard Gibbs",
         "John Avila",
         "Michael Bacich",
         "Carl Graves",
         "Warren Fitzgerald",
         "Doug Lacy",
         "Marc Mann"
      ]
   }
}