{
   "Band members": {
      "Timeline": {},
      "text": [
         "Current members\n",
         "\n",
         "Former members\n",
         "\n"
      ]
   },
   "Discography": {
      "EPs": {},
      "Music videos": {},
      "Singles": {
         "text": [
            "Promotional singles\n"
         ]
      },
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "Candyass and Vapor Transmission (1998–2001)": {
         "text": [
            "In 1998, Orgy released their debut album, Candyass, the name inspired by a drag queen they had met, selling almost two million copies.[3] The album produced two singles, a cover of the New Order song \"Blue Monday\", and \"Stitches\". Both charted on Total Request Live. The song \"Revival\" featured Jonathan Davis of Korn.\n",
            "Orgy made their live debut at EdgeFest, an annual radio show in Tulsa, Oklahoma in 1998. They also appeared on the Family Values Tour with Korn, Limp Bizkit, Ice Cube, Incubus, and Rammstein. They were featured on the live compilation album of the tour, released in 1999.  Other tours with Love and Rockets and Sugar Ray followed.[citation needed]\n",
            "Their second album, the science fiction-themed Vapor Transmission, was released in 2000, with \"Fiction (Dreams in Digital)\" and \"Opticon\" as singles.\n"
         ]
      },
      "Early years (1994–1997)": {
         "text": [
            "Orgy was formed in 1994 by vocalist Jay Gordon and guitarists Amir Derakh and Ryan Shuck. Bassist Paige Haley, and drummer Bobby Hewitt soon completed the line-up. Derakh had previously gained some fame in the 1980s metal band Rough Cutt, and Hewitt was a former member of Electric Love Hogs. Gordon and Derakh were also experienced producers, having produced Coal Chamber's self-titled CD.[1]\n",
            "Within six months Jonathan Davis, who performed with Shuck in Sexart, signed Orgy to Korn's label Elementree Records.\n"
         ]
      },
      "Hiatus and return with new lineup (2005–present)": {
         "text": [
            "When asked for an Orgy update in late July 2008, Shuck informed fans that Orgy's return is still underway but their priority is getting the much delayed Julien-K album released. During a video interview at the annual Californian NAMM 2009 convention, Derakh mentioned a 2010 Orgy reunion.\n",
            "Shuck and Derakh released their first album as Julien-K, titled Death to Analog, in March 2009. In the same year they also released an album with Chester Bennington of Linkin Park under the name Dead by Sunrise.\n",
            "On March 30, 2010, through a video to his Julien-K, Dead By Sunrise, and Orgy followers, Shuck informed that there are plans for a tour in 2010.[6]\n",
            "On October 25, 2010, Ryan Shuck and Amir Derakh informed on the Julien-K blog that \"As of Oct. 26th we will no longer be part of Orgy. Jay will continue making music without the original members.\" [7]\n",
            "On October 30, 2010, Jay Gordon released a statement via his official Facebook profile stating that he still owns the Orgy name and wants to continue forth creating new material for the band.[8] Jay wrote that all previous members of the band were too busy with numerous side-projects to continue with the original band. \"Everyone has been so busy with their different projects I figured this was the only way for me to continue on with the name. I started this band, and I don't want to let it fall to the wayside completely.\"\n",
            "On November 7, 2011, Blabbermouth.net published a news story detailing the bitter feud between vocalist Gordon and guitarists Shuck and Derakh that has spiraled out of control after Gordon revealing his plans to assemble a band of musicians and begin touring under the name Orgy.[9]\n",
            "On February 3, 2012, it was announced that Orgy would embark on a five-week run titled the Bad Blood Tour. Vocalist Jay Gordon is the only original member of Orgy appearing on this tour;.[10]\n",
            "On August 4, 2012, Orgy linked to a 30-second demo of a new song, \"Grime of the Century\" via their Twitter and Facebook page. The song \"Grime of the Century\" was later made available on iTunes and the new Orgy website, www.orgymusic.com.\n",
            "In 2013, Orgy embarked on the Wide Awake and Dead Tour with Vampires Everywhere! and Davey Suicide.\n",
            "Orgy launched a crowdfunding campaign in August 2013 via Indiegogo.com with a $100,000 goal. Two months later, at the conclusion of the campaign, the band had only raised $8,739, falling short of their goal by over $91,000.[11]\n",
            "On February 23, 2014, the band announced through their official website that the new single “WIDE AWAKE AND DEAD” will be available through iTunes & Amazon on March 18, 2014. The \"Wide Awake and Dead\" video was filmed on April 22.[12]\n",
            "In 2015 they released their first collection of new music in 11 years, an EP titled Talk Sick. Originally it was to be followed with another EP titled Entropy,[13] but Gordon later told Westward Magazine the band would instead release it as a full-length album,[14] that has yet to materialize.\n"
         ]
      },
      "Side work and Punk Statik Paranoia (2001–2005)": {
         "text": [
            "In 2001, Orgy released the song \"Faces\" for the soundtrack of the film Zoolander.[4]  Orgy was a musical guest on WB's Charmed, performing \"Opticon\" in the episode \"Sin Francisco\".[3][5]\n",
            "In late 2003, guitarists Shuck and Derakh formed a side project, Julien-K, as an outlet for electronic material they had come up with during the writing process for Orgy.[3] Jay Gordon also remixed the Linkin Park track \"Points of Authority\", for their album Reanimation, where it was renamed \"Pts.of.Athrty\".\n",
            "After the release of Vapor Transmission, Orgy left Reprise Records and had already severed ties with Elementree. Gordon started his own independent record label, D1 Music, releasing the band's third album, Punk Statik Paranoia in 2004.\n"
         ]
      }
   },
   "Musical style": {
      "text": [
         "The band's sound has been described as alternative metal,[15][16] industrial rock,[17] industrial metal,[18] electronic rock,[19] and nu metal.[20]\n"
      ]
   },
   "Notes": {},
   "References": {},
   "Related projects": {},
   "Sections": [
      "1 History",
      "1.1 Early years (1994–1997)",
      "1.2 Candyass and Vapor Transmission (1998–2001)",
      "1.3 Side work and Punk Statik Paranoia (2001–2005)",
      "1.4 Hiatus and return with new lineup (2005–present)",
      "2 Musical style",
      "3 Band members",
      "3.1 Timeline",
      "4 Related projects",
      "5 Discography",
      "5.1 Studio albums",
      "5.2 EPs",
      "5.3 Singles",
      "5.4 Music videos",
      "6 Notes",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Orgy is an American rock band formed in 1994, from Los Angeles, California.[1] Orgy described their industrial rock music as \"death pop\".[2] The band is best known for their cover version of the New Order song \"Blue Monday\"; as well as \"Stitches\", both from their 1998 album Candyass.\n"
      ]
   },
   "Title": "Orgy (band) - Wikipedia"
}