{
   "Awards": {
      "text": [
         "In 2004, the music video for the single \"Warhead\" was on the top ten of MTV Headbanger's Ball.[45]\n",
         "In 2010, Otep was nominated for a GLAAD Media Award for \"Outstanding Music Artist\" for the album Smash the Control Machine during the 21st GLAAD Media Awards.[46]\n",
         "Beginning with The Ascension and continuing through to Generation Doom, Otep has consistently charted high, most often in the top five on the Billboard Hard Rock Chart.[47]\n"
      ]
   },
   "Band members": {
      "text": [
         "Current members\n",
         "Former members\n",
         "Touring musicians\n",
         "Timeline\n"
      ]
   },
   "Discography": {
      "Albums": {
         "Live albums": {},
         "Studio albums": {}
      },
      "Extended plays": {},
      "Singles": {
         "Promotional singles": {}
      }
   },
   "External links": {},
   "History": {
      "Atavist and Sounds Like Armageddon (2011–2012)": {
         "text": [
            "On April 26, 2011,[20] Otep released their fifth studio album, Atavist.[1] It peaked at 61 on the Billboard 200,[5] 10 on the Independent Charts[15] and 19 on the US Rock Charts.[21]\n",
            "On November 6, 2012, Otep released their first live album, Sounds Like Armageddon.[22][23]\n"
         ]
      },
      "Early years, Jihad and Sevas Tra (2000–2003)": {
         "text": [
            "Otep began as a band in Los Angeles, California, in late 2000.[1] They were invited to play Ozzfest before they had signed to a label after Sharon Osbourne witnessed their live performance. They have since played Ozzfest several times.[1] Otep signed with Capitol Records after a few shows and without a demo, purely on the power of their live performance.[1] They started gigging around Los Angeles a lot and released the Jihad EP in February 2001.[1]\n",
            "The band released their album Sevas Tra with Terry Date[3] on June 18, 2002,[4] and then played several gigs at the Ozzfest and was considered one of the prime bands there in 2002.[1] Their first time at Ozzfest was in 2001 with their eighth gig.[1] The first album peaked at 145 on the Billboard 200[5] and 86 on the UK Albums Chart.[6]\n"
         ]
      },
      "Generation Doom (2015-2017)": {
         "text": [
            "\"Signing with Napalm Records is one of the most exciting alliances I’ve ever made. I haven't felt this excited to write a new album since ‘Sevas Tra.’ There's a lot of work to do, a lot of music to write, a lot of things to say, a lot of injustices to confront and a lot of madness to summon and capture. To be able to forge this sacred alchemy with the dark brilliance of producer Howard Benson is a dream come true.\"[29]\n",
            "On February 4, 2016, Otep announced that the album would be titled Generation Doom and would be released on April 15. They also released the album art on their Facebook page.[30]\n",
            "On April 11, 2016 Billboard was to stream Generation Doom in its entirety for 24 hours, but due to its success extended the streaming time to several days.\n",
            "The music video for the song \"In Cold Blood\" premiered on April 15, 2016 on Music Choice.\n",
            "On Record Store Day (April 16, 2016), record stores released a picture vinyl disk of Generation Doom.\n",
            "On April 20, Napalm Records released the video for \"In Cold Blood\" on their YouTube page.[31]\n",
            "Generation Doom was number 3 of the top 8 Napalm Record sellers in the week of April 23. On April 26 the album reached #7 on the Billboard Rock Chart, #10 on the Independent Chart and #109 on the Top 200 Albums Chart. On May 7, the album reached #4 on the Billboard Hard Rock Chart [32]\n"
         ]
      },
      "House of Secrets (2004–2006)": {
         "text": [
            "On July 27, 2004, Otep released their second album, House of Secrets,[7] produced by Greg Wells.[1] The album peaked at 93 on the Billboard 200[5] and 102 on the French Chart.[8]\n"
         ]
      },
      "Hydra and further activity (2013-2014)": {
         "text": [
            "In an interview, Otep Shamaya stated that Hydra will be her band's final album.[24] The album was released on January 22, 2013[25] and peaked at 133 on the Billboard 200.[26]\n",
            "The band is still touring and have tours in places such as the US's east coast and Australia for their Sounds of Armageddon tour.[27][28]\n",
            "In early 2014, Otep confirmed on her personal Facebook account and the band account that another album would be made.\n",
            "In April 2014, Otep signed a new management deal with Kam 9.8 Machlation Group, a company founded by Slipknot's DJ Sid Wilson and his business partner Synonym Mead.[citation needed] The contract with Kam 9.8 was not renewed. In September 2015 Otep announced on her Facebook page that the band had signed a new management deal with Napalm Records, and that a new album would be released in the spring of 2016 (pre-order from winter 2015).\n"
         ]
      },
      "Kult 45 (2018–present)": {
         "text": [
            "On May 2, 2018 Otep disclosed the album title and artwork for their eighth album, together with disclosing interviews about the content of the album. The official Napalm announcement read: \"You can expect a complete and total mutiny of the senses on Kult 45,\" says Shamaya. \"That said, it’s important for fans to know that this record is not just an indictment of Trump. The idea is rather to empower people to stand up and remind them this is our country and we have the power. It’s primarily a rallying cry for people with common sense and good-natured patriots to rise up and know that we own this nation.\"\n",
            "\"Although the album is produced well technically, lyrically, it’s very raw. Musically, we explore different genres – we’re trying to reach everyone. I don’t want to be limited to one genre or to be anchored to a particular space where I can only reach certain political minds. It's important to me that I'm sending a clear and concise message to the Resistance - the people out there bending the barricades and fighting for justice is this country.\"\n",
            "Kult 45 was recorded at The Lair in Los Angeles, completely utilizing the same equipment used for OTEP's first album, Sevas Tra (down to Shamaya's vocal microphone, a SHURE Beta 58), in order to create a sound reminiscent of their roots. Kult 45 was self-produced by the band, with assistant engineering from Larry Goetz, Nicolas Schilke and Lizzy Ostro.[33]\nIt was also mentioned that the lyrics will tackle subjects like the immigrant crisis, rape culture and the US government.\n",
            "In an episode of 'Wake and Bake' (a weekly Facebook live stream on the Otep page) Justin Kier said that while creating this album the band had kept the fans in mind. Therefore, making it an album for the fans, rather than for self-exploration.\n",
            "The first single of the album, \"To the Gallows\",  was released on May 25, 2018 along with a lyric video.\n"
         ]
      },
      "Smash the Control Machine (2009–2010)": {
         "text": [
            "In 2009, Otep signed with Victory Records.[1] Their 2009 album, Smash the Control Machine, which was released on August 18, 2009,[1][16] included a reunion with former members Mark \"Moke\" Bistany on drums and Rob Patterson on guitar. The album also featured Koichi Fukuda on piano, and Emilie Autumn on violin, and a song co-written with songwriter Holly Knight, which resulted in \"UR a WMN NOW\". Knight previously co-wrote \"Perfectly Flawed\" with Otep on The Ascension.[17] It peaked at 47 on the Billboard 200[5] and 6 on the US Independent Charts.[15]\n",
            "The band appeared with 2Cents, Five Finger Death Punch and Shadows Fall on the 'Shock & Raw Tour' of North America in the fall of 2009.[18]\n",
            "On September 30, 2010, bassist Jay McGuire left the band.[19]\n"
         ]
      },
      "The Ascension (2007–2008)": {
         "text": [
            "After three years of touring, on March 20 during 2007 they signed to Koch Records and released their third album, The Ascension.[9] They supported it with constant touring with Static-X starting in the spring of 2007.[1] Despite the original release date, the album was delayed indefinitely due to the recent Capitol/Virgin Records merger.[10][11][12] It peaked at 81 on the Billboard 200[5][13][14] and 6 on the US Independent Charts.[14][15] The album sold about 10,200 album copies in its first week of release.[13]\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Early years, Jihad and Sevas Tra (2000–2003)",
      "1.2 House of Secrets (2004–2006)",
      "1.3 The Ascension (2007–2008)",
      "1.4 Smash the Control Machine (2009–2010)",
      "1.5 Atavist and Sounds Like Armageddon (2011–2012)",
      "1.6 Hydra and further activity (2013-2014)",
      "1.7 Generation Doom (2015-2017)",
      "1.8 Kult 45 (2018–present)",
      "2 Style and influences",
      "3 Awards",
      "4 Band members",
      "5 Discography",
      "5.1 Albums",
      "5.1.1 Studio albums",
      "5.1.2 Live albums",
      "5.2 Extended plays",
      "5.3 Singles",
      "5.3.1 Promotional singles",
      "6 References",
      "7 External links"
   ],
   "Style and influences": {
      "text": [
         "The band's style is primarily nu metal,[7][34][35][36][37] and is also considered alternative metal.[22][27][28] It has also been labelled as gothic metal,[38] rap metal[39] and extreme metal.[40] AllMusic has described Otep as \"art house nu-metal\".[7] Otep's influences include Slipknot, Slayer, Korn, Rage Against the Machine, The Notorious B.I.G., Nine Inch Nails, Jim Morrison, Tool, the Doors, Nirvana, and Deftones.[41][42][43] While the band's style is primarily nu metal, their music incorporates strong elements of death metal.[39][44]\n"
      ]
   },
   "Summary": {
      "text": [
         "Otep is an American heavy metal band from Los Angeles, California, formed in 2000. They have released two EPs, eight studio albums, and one live album. As of December 2013, they are no longer under their previous label Victory Records and currently are signed with Napalm Records.[2]\n"
      ]
   },
   "Title": "Otep - Wikipedia"
}