{
   "Name": "Otep",
   "rawData": [
      "Otep is an American heavy metal band from Los Angeles, California, formed in 2000. They have released two EPs, eight studio albums, and one live album. As of December 2013, they are no longer under their previous label Victory Records and currently are signed with Napalm Records.\n",
      "Otep began as a band in Los Angeles, California, in late 2000. They were invited to play Ozzfest before they had signed to a label after Sharon Osbourne witnessed their live performance. They have since played Ozzfest several times. Otep signed with Capitol Records after a few shows and without a demo, purely on the power of their live performance. They started gigging around Los Angeles a lot and released the Jihad EP in February 2001.\n",
      "The band released their album Sevas Tra with Terry Date on June 18, 2002, and then played several gigs at the Ozzfest and was considered one of the prime bands there in 2002. Their first time at Ozzfest was in 2001 with their eighth gig. The first album peaked at 145 on the Billboard 200 and 86 on the UK Albums Chart.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Nu metal",
         "alternative metal",
         "rap metal"
      ],
      "Years active": [
         "2000–present"
      ],
      "Labels": [
         "Capitol[1]",
         "Victory[1]",
         "Koch[1]",
         "EMI[1]",
         "Napalm"
      ],
      "Website": [
         "otepsaves.me"
      ],
      "Members": [
         "Otep Shamaya"
      ],
      "Past members": [
         "Tarver Marsh",
         "Dave \"Spooky\" Aguilera",
         "Mark \"Moke\" Bistany",
         "Rob Patterson",
         "Jason \"eViL J\" McGuire",
         "Karma Singh Cheema",
         "Brian \"Haggis\" Wolff"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Los Angeles, California, formed in [YEAR]. They have released two EPs, eight studio albums, and one live album. As of [MONTH] [YEAR], they are no longer under their previous label Victory Records and currently are signed with Napalm Records.\n",
      "[BAND_NAME] began as a band in Los Angeles, California, in late [YEAR]. They were invited to play Ozzfest before they had signed to a label after [PERSON_NAME_FULL_0_FEMALE] witnessed their live performance. They have since played Ozzfest several times. [BAND_NAME] signed with Capitol Records after a few shows and without a demo, purely on the power of their live performance. They started gigging around Los Angeles a lot and released the Jihad EP in [MONTH] [YEAR].\n",
      "The band released their album Sevas Tra with Terry Date on [MONTH] 18, [YEAR], and then played several gigs at the Ozzfest and was considered one of the prime bands there in [YEAR]. Their first time at Ozzfest was in [YEAR] with their eighth gig. The first album peaked at 145 on the Billboard 200 and 86 on the UK Albums Chart.\n"
   ]
}