{
   "Band members": {
      "text": [
         "Final lineup\n",
         "\n",
         "Former members\n",
         "\n",
         "Touring musicians\n",
         "\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "History": {
      "Formation and Nuclear Blast signing (2002–2008)": {
         "text": [
            "All Shall Perish was founded in 2002 from the former members of the San Francisco Bay Area bands Antagony, End of All, and Boof. The founding members were Matt Kuykendall, Ben Orum, Mike Tiner, Caysen Russo, and Craig Betit. The band released their demo in 2003 and caught the attention of Japanese label Amputated Vein Records. On August 19, 2003, they released their debut album Hate, Malice, Revenge, which was re-released by Nuclear Blast in 2005. In 2006, The Price of Existence was released, whose first single, \"Eradication,\" was made into a video and played on MTV2's Headbanger's Ball. A viral video of the song \"There Is No Business to Be Done On a Dead Planet\" set to the boy-band 'N Sync's video for \"Bye Bye Bye\" helped to garner a new fanbase for the band.\n",
            "The group released their third studio album, Awaken the Dreamers, on September 16, 2008, through Nuclear Blast. It debuted at number 126 on the Billboard 200 and number 1 on the Top Heatseekers charts,[1] with 5,500 copies sold in its first week. Guitarist Caysen Russo and vocalist Craig Betit only appear on the band's first studio album, and were replaced by Chris Storey and Hernan \"Eddie\" Hermida, respectively.\n",
            "All Shall Perish completed several successful tours across America in 2006, and they were also on The Darkness Over Europe 2007 tour. Bray Almini (Suffokate) occasionally filled in for Mike Tiner on bass during tours. In September 2008, they toured parts of Russia and became the first all-American metal band to tour Siberia, playing shows in Irkutsk, Novosibirsk, Tomsk, and Omsk.[2] The band was also part of the European leg of the Hell On Earth Tour 2008. On November 11, 2008, the band recorded the video to their single \"Never... Again,\" directed by Gary Smithson, in downtown Los Angeles.[3]\n"
         ]
      },
      "Line-up changes (2009–2010)": {
         "text": [
            "On February 5, 2009, All Shall Perish stated on their website that they were parting ways with guitarist Chris Storey and replacing him with Jason Richardson. The band issued the following statement: \"We will be doing all upcoming tours and fests! We have an unbelievable replacement named Jason Richardson. Can't wait to see everyone on the road! We will be doing a small headliner, the Atticus Clothing tour and then a ton of major fests in Europe. We have some surprises in store as well!\"\n",
            "After finishing the Night of the Living Shred Tour, All Shall Perish returned to California where they began writing a new album. Mike Tiner stated that the process was \"going slow, very slow.\" In early 2010, Richardson left All Shall Perish to join Born of Osiris. On June 5, 2010, the band announced a new line-up. Drummer Matt Kuykendall, one of the founding members, was replaced by Adam Pierce (formerly of Sea of Treachery) and Francesco Artusato (Hiss of Atrocities) became the new lead guitar player, the band's third. The only original member remaining is Mike Tiner.\n"
         ]
      },
      "Return of original lineup and disbandment (2015–2020)": {
         "text": [
            "On October 21, 2015, All Shall Perish announced the return of Hernan \"Eddie\" Hermida and guitarist Chris Storey, alongside founding members Matt Kuykendall, Ben Orum, and Caysen Russo, now on bass. The group's press release noted that original vocalist Craig Betit will participate in some fashion as well. The band stated that bassist Mike Tiner, the last original member in the lineup before the return of Orum, Kuykendall, and Russo declined a personal invitation to participate. Francesco Artusato and drummer Adam Pierce are no longer part of the band.[8]\n",
            "On April 21, 2020, vocalist Hernan \"Eddie\" Hermida announced that the reunion was no longer happening.[9]\n"
         ]
      },
      "This Is Where It Ends (2010–2015)": {
         "text": [
            "On the November 8, 2010, the band announced they were starting work on a new album. Guitarist Ben Orum said on the band's official website, \"After two very successful tours at home and abroad, we are now home writing the new All Shall Perish record! The writing process is flowing very naturally, and so far the material itself is very impressive. It is safe to say this will be one of the most aggressive, epic, groovy records we have ever written. I cannot wait to start playing this material live.\" On January 31, 2011, the band was announced to be billed on the fourth annual Mayhem Festival, playing on the Revolver Stage alongside other metal acts including Suicide Silence, Machine Head, Straight Line Stitch, and Testament.\n",
            "Their fourth full-length album, titled This Is Where It Ends, was released on July 26, 2011, in United States and July 29, 2011, in Europe.[4] A legal organization named World Digital filed suit on April 20, 2012, against 80 fans for $150,000 for allegedly using BitTorrent to download this album. This action by the company was done without the band's permission or knowledge, and as a result All Shall Perish sided with their fans against the lawsuit. The lawsuit was dropped by request of the band.[5]\n",
            "Hermida joined Suicide Silence on October 3, 2013, which was officially announced on the Suicide Silence Facebook page. On October 4, All Shall Perish released a statement about Hermida leaving, confirming that the band would continue.[6] An interview with Mike Tiner on the Metal Injection website stated that Mike Tiner's position was that Hermida chose to leave by not being able to commit to the band.[7]\n"
         ]
      }
   },
   "Music videos": {},
   "Musical style and lyrical themes": {
      "Influences": {
         "text": [
            "Much of the band is influenced by European metal,[10] particularly Swedish death metal.[11]  Their influences are by a large number of groups, including Opeth, Cannibal Corpse, At the Gates, Dying Fetus, Irate, Tenacious D, Blood Has Been Shed, Hatebreed, The Beatles, Journey, Michael Jackson, Queen, The Police, Harry Belafonte, Rusty Cooley, GWAR, Dissection, Dimmu Borgir, Carcass, Pantera and many others.[12]\n"
         ]
      },
      "Lyrics": {
         "text": [
            "The band's lyrics consist of several different themes, including politics, such as government control, fascism, corporate control, and organised religion. For example, the song \"Black Gold Reign\" from Awaken the Dreamers references countries around the world adopting oil as the main source of currency. A majority of their songs are politically based.[13] Although rare, the band wrote a few songs on personal subjects such as the song \"In This Life of Pain\" from the album This Is Where It Ends,[14] and the song \"Deconstruction,\" from the album Hate, Malice, Revenge, which was written about original vocalist Craig Betit's ex-girlfriend.[11]\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and Nuclear Blast signing (2002–2008)",
      "1.2 Line-up changes (2009–2010)",
      "1.3 This Is Where It Ends (2010–2015)",
      "1.4 Return of original lineup and disbandment (2015–2020)",
      "2 Musical style and lyrical themes",
      "2.1 Influences",
      "2.2 Lyrics",
      "3 Band members",
      "4 Discography",
      "5 Music videos",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "All Shall Perish was an American deathcore band from Oakland, California, United States, formed in 2002. The band was signed to Nuclear Blast and have released four full-length albums through the label. Their final album, This Is Where It Ends, was released on July 26, 2011.\n",
         "All Shall Perish are noted for being one of the earliest pioneering bands in the deathcore genre.\n"
      ]
   },
   "Title": "All Shall Perish - Wikipedia"
}