{
   "Name": "Ozomatli",
   "rawData": [
      "Ozomatli is an American six-piece band playing primarily Latin, hip hop, and rock music, formed in 1995 in Los Angeles. They are known both for their vocal activist viewpoints and their wide array of musical styles – including salsa, jazz, funk, reggae, rap, and others. The group formed in 1995 and has since released seven studio albums.  The group is also known for advocating for farm-workers' rights and immigration reform. The band has performed in various countries all over the world, including China, Tunisia, Jordan, Cuba, and Burma. Although the band has had many member changes over the years and has sometimes had as many as ten members, the current six members have been in the band since its debut album.\n",
      "In 1998, Ozomatli released its self-titled debut album, and soon after opened for Santana on their Supernatural Tour. The group released Embrace the Chaos in 2001, followed by Street Signs in 2004. Don't Mess with the Dragon followed in 2007, which saw the band experimenting with a more diverse array of musical styles.  The group composed music for Happy Feet 2 and recorded Ozomatli Presents Ozokidz, a family-friendly album. From 2011 to 2014, Ozomatli also served as the house band for stand-up comedian Gabriel Iglesias' television show, Gabriel Iglesias Presents Stand Up Revolution. \n",
      "Ozomatli take their name from the Nahuatl word from the astrological symbol of the monkey, taken from the Aztec calendar. Ozomatli is also a god of dance, fire, the new harvest, and music. In 1995, all the members met while attempting to form a workers union within Los Angeles. Though they were not able to win recognition, they were given an abandoned building for one month. The building turned into a cultural arts center, and within it Ozomatli was born.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Latin rock, Chicano rock, hip hop, world fusion, funk"
      ],
      "Years active": [
         "1995–present"
      ],
      "Labels": [
         "Almo Sounds (1998–1999)",
         "Interscope (2001–2002)",
         "Concord/Real World (2004–2007)",
         "Downtown/Mercer Street (2010)",
         "Hornblow/Vanguard (2012–)",
         "Cleopatra Records (2017)[1]",
         "ONErpm (2019)[2]",
         "Blue Élan Records (2021–)"
      ],
      "Website": [
         "www.ozomatli.com"
      ]
   }
}