{
   "Biography": {
      "Formation and main career (1988-2001)": {
         "text": [
            "Phantom Blue was formed in 1988 in Hollywood, California by Michelle Meldrum and Nicole Couch. Couch and Meldrum were students of Paul Gilbert and Bruce Bouillet of Racer X.[1][failed verification] Michelle Meldrum had played with drummer Linda McDonald in previous projects and together with vocalist Gigi Hangach and original bassist, Debra Armstrong. Armstrong left the band in June 1988, prior to the band signing with Shrapnel Records, in October 1988, and was replaced by Kim Nielsen, a student of John Alderete, bassist for Racer X and The Mars Volta.[1] Phantom Blue recorded their self-titled first album with the help of producer Steve Fontano and fellow Shrapnel label mate, Marty Friedman.[2] Couch and Meldrum also co-wrote a track on the album with Marty Freidman.[1] Roadrunner Records, who owned the bands European distribution rights, were responsible for the band shooting a video for the single \"Why Call It Love?\" and a successful European tour followed.\n",
            "Upon returning to the States, Phantom Blue caught the attention of singer Don Dokken who introduced them to Tom Zutaut of Geffen Records. Other major labels were interested in signing the band, most notably Disney's Hollywood Records, but the band signed with Geffen. Couch and Meldrum began writing the material for the Geffen release. Couch left the band prior to recording and Meldrum successfully recorded all the guitar parts for Built to Perform.[2] Guitarist Karen Kreutzer replaced Couch and the band embarked on another successful European tour and shot a video for the single \"Time to Run\".\n",
            "The band was eventually dropped from Geffen, sued by manager Byron Hontas and the management position was taken over by Mark Dawson, boyfriend of drummer Linda McDonald. Guitarist Michelle Meldrum was the first to leave due to disagreement as to the direction of the band under Dawson and vocalist Gigi Hangach soon followed. By 1996, McDonald was the only original member left and she continued to use the name Phantom Blue, enlisting a total of ten different members until finally calling it quits in early 2001.\n"
         ]
      },
      "Post-disbandment (2001-present)": {
         "text": [
            "Drummer Linda McDonald went on to form The Iron Maidens (billed as \"The World's Only Female Tribute to Iron Maiden\"), who released a self-titled tribute album worldwide and Japanese release version, the CD/DVD release Route 666 and the EP The Root of All Evil in Japan. In addition, she played drums in the cover bands Crabby Patty (I'm So Unclear!), Unholy Pink and Valley Dolls. She was also the drummer of the all-female Ozzy Osbourne tribute The Little Dolls from 2005 to 2010.\n",
            "Original bassist Debra Armstrong[3] currently lives in Sioux City, Iowa with her husband. She left the music industry soon after being replaced by Kim Nielsen in 1988, and went on to pursue a career in 3D modeling and engineering, working for clients such as Disney Imagineering, DARPA and others.\n",
            "Guitarist Michelle Meldrum went on to form an international band called Meldrum. The band has toured with Zakk Wylde's Black Label Society, Motörhead, Sepultura, Nashville Pussy and Danzig. They have released a live DVD, Loaded Live, and two albums, Loaded Mental Cannon and Blowin' Up the Machine, the latter featuring her former Phantom Blue bandmate, drummer Linda McDonald. On May 21, 2008, Meldrum died as a result of a cerebral hemorrhage.[4] She left behind her husband John Norum (of Europe) and their son Jake.[4]\n"
         ]
      },
      "Reunion (2009)": {
         "text": [
            "On May 26, 2009, Linda McDonald, Gigi Hangach and Kim Nielsen reunited as Phantom Blue for the Michelle Meldrum Memorial Concert at the Whisky a Go Go in Hollywood, California. Meldrum's position was filled by Tina Wood (from the 1997 lineup), while Sara Marsh and Courtney Cox of The Iron Maidens filled in for Nicole Couch.[5][6][7]\n"
         ]
      }
   },
   "Discography": {
      "Compilation album": {},
      "EP": {},
      "Live album": {},
      "Singles": {},
      "Studio albums": {}
   },
   "External links": {},
   "Members": {},
   "References": {},
   "Sections": [
      "1 Biography",
      "1.1 Formation and main career (1988-2001)",
      "1.2 Post-disbandment (2001-present)",
      "1.3 Reunion (2009)",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 EP",
      "2.3 Live album",
      "2.4 Compilation album",
      "2.5 Singles",
      "3 Members",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Phantom Blue was an all-female American heavy metal band from Los Angeles, California, United States, formed in 1987. Phantom Blue were the first and only female artists to be signed to Mike Varney's Shrapnel Records, only three months after forming.\n"
      ]
   },
   "Title": "Phantom Blue - Wikipedia"
}