{
   "Name": "Phantom Planet",
   "rawData": [
      "Phantom Planet is an American rock band from Los Angeles, formed in 1994. The band consists of Alex Greenwald (vocals, rhythm guitar), Darren Robinson (lead guitar), Sam Farrar (bass guitar) and Jeff Conrad (drums). The band is best known for its track \"California\", which became the theme song for the TV series The O.C.. The band featured actor Jason Schwartzman on drums until 2003 and continued to release well-received albums in his absence.\n",
      "On November 25, 2008, the band announced in a blog entry on their website that they are going on \"hiatus, and will not be playing any more live shows or making any new records, indefinitely.\" They played their last pre-hiatus show on December 12, 2008, in Los Angeles.\n",
      "The band reunited in 2019, announcing that their hiatus was over.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Alternative rock",
         "garage rock",
         "pop rock",
         "power pop"
      ],
      "Years active": [
         "1994–2008",
         "2012",
         "2019–present"
      ],
      "Labels": [
         "Fueled by Ramen",
         "Daylight",
         "Epic",
         "MCA",
         "Geffen",
         "Interscope"
      ],
      "Website": [
         "phantompla.net"
      ],
      "Members": [
         "Alex Greenwald ",
         "Sam Farrar ",
         "Darren Robinson",
         "Jeff Conrad"
      ],
      "Past members": [
         "Jason Schwartzman ",
         "Jacques Brautbar"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Los Angeles, formed in [YEAR]. The band consists of [PERSON_NAME_FULL_2_MALE] (vocals, rhythm guitar), Darren Robinson (lead guitar), [PERSON_NAME_FULL_1_MALE] (bass guitar) and Jeff Conrad (drums). The band is best known for its track \"California\", which became the theme song for the TV series The O.C.. The band featured actor [PERSON_NAME_FULL_0_MALE] on drums until [YEAR] and continued to release well-received albums in his absence.\n",
      "On [MONTH] 25, [YEAR], the band announced in a blog entry on their website that they are going on \"hiatus, and will not be playing any more live shows or making any new records, indefinitely.\" They played their last pre-hiatus show on [MONTH] 12, [YEAR], in Los Angeles.\n",
      "The band reunited in [YEAR], announcing that their hiatus was over.\n"
   ]
}