{
   "Band members": {
      "Timeline": {},
      "text": [
         "Current members\n",
         "\n",
         "Former members\n",
         "\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "Filmography": {},
   "History": {
      "Early years (1994–1998)": {
         "text": [
            "Phantom Planet was named in 1994 after a 1961 B-movie called The Phantom Planet.[2] They played their first show in 1994 at The Troubadour in Hollywood, California.[citation needed] Most of their friends could not attend because they were still in high school.[citation needed] Two of the songs they played are featured on the bonus material of the Chicago, Chicagogoing, Chicagogone DVD. Among the songs performed were \"My Friend Liz's Dad\" (misprinted as \"My Friend Liz Is Dead\" on the DVD) and a cover of the Beastie Boys 1994 song \"Sabotage\".\n",
            "While still in their teens, the group played frequently in and around the Hollywood area, finally catching the eye of Geffen Records executives. Phantom Planet signed with Geffen in 1997 and released their first effort, Phantom Planet Is Missing in 1998. Phantom Planet is Missing showed musical similarities to the popular band Weezer, with influences ranging from The Beach Boys to Electric Light Orchestra, but the album failed to gain any significant ground with either critics or fans. However, as some group members started to make appearances on both the small and large screen and the group pressed on, Phantom Planet gradually built momentum.\n"
         ]
      },
      "First reunion (2011–2013)": {
         "text": [
            "On November 4, 2011, an official Phantom Planet reunion Twitter account was created which stated they would be reuniting in 2012. Since then, they have held their first practice in 3 years. In late January 2012, Phantom Planet announced their first reunion show, June 13, at The Troubadour in Los Angeles. On January 31, they announced the addition of a second Troubadour show to be played June 14, 2012. Former member of the band, Jacques Brautbar, joined them for songs at the June 13 show.\n",
            "In August 2013, the band, under Alex Greenwald & Phriends, performed a new song titled Balisong, which ended up being on Greenwald's solo album and later released in 2019 as a single by the full band.[5] This performance did not have bassist Sam Farrar because he was touring with Maroon 5. He was replaced by Jamiroquai bassist Stuart Zender.\n"
         ]
      },
      "Indefinite hiatus (2008)": {
         "text": [
            "On November 25, 2008, Phantom Planet announced in a blog entry on their website that they would be playing their last show December 12, 2008 at The Troubadour in Los Angeles. The band issued a statement about their hiatus:\n",
            "This could be the most difficult piece of news we have ever had to post. Sadly, Phantom Planet will be playing our last show, December 12, at the Troubadour in Los Angeles, the same venue that we played our very first live all ages gig, back in 1994. We have had an amazing time playing together for 15 years, but we have officially decided to go on hiatus, and will not be playing any more live shows or making any new records, indefinitely. There is so much more to write, but at this time, we just want to say thank you, to everyone, for their support, friendship, inspiration, attendance, and love.\n-alex, darren, jeff and sam.[1][4]",
            "They played their last show on December 12, 2008, in Los Angeles. Alex mentioned numerous times during their last show that the band was, in fact, going on a hiatus, not breaking up.\n",
            "Former drummer Jason Schwartzman makes a cheeky reference to this hiatus in his song \"Drummer\" from the Coconut Records album Davy (released January 2009). The lyrics state \"I was a drummer in a band that you've heard of / I was a drummer in a band that just broke up / Isn't that the way it goes?\"\n",
            "Guitarist Darren Robinson posted this message on his personal Myspace page telling fans that they are not broken up:\n\"We have NOT broken up. We are on an indefinite hiatus. That means we don't know when we'll regroup. But we are NOT broken up. I swear to you it's not just a polite way of saying we have broken up. Got it?\"\n"
         ]
      },
      "Phantom Planet (2004)": {
         "text": [
            "The band's eponymous third album in 2004 marked a change in both the band's sound and lineup. Ditching their radio-friendly pop rock, the band moved towards a garage rock sound. Lead singer Alex Greenwald stated that he wants the band to continue to change its sound. \"I love rock 'n' roll music,\" Greenwald said. \"I especially loved bands, like The Beatles, that changed with every single record they made. That's been our plan from the get-go. We want our records to be like experiments. We want to have fun with the music. People can hear when you're not having fun. They discover you're bored and you're boring.\"[3] In the middle of recording the album, founding member and drummer Jason Schwartzman abruptly left the band to focus on his acting career. He was replaced by Jeff Conrad, who helped record the remainder of the album. Phantom Planet was released to mixed reviews from critics. Shortly after the album's release, guitarist Jacques Brautbar left the band to pursue a career in photography. The band performed \"Big Brat\", the album's first single, on the Late Show with David Letterman.\n"
         ]
      },
      "Raise the Dead (2007–2008)": {
         "text": [
            "Early on in the recording process Phantom Planet's contract with Epic Records expired, which left them searching for a new record label. Soon after this, they signed to Fueled by Ramen.\n",
            "On January 20, 2008, Phantom Planet posted a bulletin on their Myspace page that stated that the album will officially be finished by the January 24, and that the official release date would be April 15, 2008. Fueled By Ramen re-released a teaser trailer and stated that the first single from the album will be a reworking of \"Do the Panic\".\n",
            "In an interview with RaggedMag, Greenwald stated that \"all bands are kind of their own cult, you know, but we want to take it to a new level. We really like the show Lost, and even though it's totally fiction, there's this air of mystery that's lacking in a lot entertainment these days. I really like mystery in things, and what a little bit of enigma brings out of people and their imaginations... a band is about community, and within itself it is a brotherhood; it's companionship. But a band can't be anything without the people to love it. Our goal will be to recruit and befriend as many people as possible with our message.\"\n",
            "When describing the new record, Greenwald said that \"the next record is a concept record. If The Beatles had Sgt. Pepper's and The Rolling Stones had Their Satanic Majesties Request, we have our 'Leader.' We're concocting it, but at the same time we're following it.\"\n",
            "The album, titled Raise the Dead, was released as scheduled on April 15, 2008.\n"
         ]
      },
      "Second reunion and Devastator (2019–present)": {
         "text": [
            "A Phantom Planet Instagram account [6] was created on January 19, 2019, indicating that the band could be reforming. Additionally, band members posted the logo on their personal social media accounts. It was confirmed that the band played a small secret private show January 19, 2019, at No Name on Fairfax in Los Angeles.[7]\n",
            "On March 18, 2019, the band officially announced \"Hiatus. Over.\" [8] They announced their first \"public\" show in over seven years at Hanson's \"Hop Jam\" Music and Beer Festival in Tulsa, OK on May 19, 2019.[9] Before that event, they scheduled three shows across Southern California.\n",
            "On May 7, the band officially released their first new song in 11 years, Balisong. The song was a reworked version of a track previously released on Alex's solo album. The band is \"50 to 75 percent\" finished with a new album.[10] In March 2020, Phantom Planet announced the release of their fifth album Devastator on May 8, 2020, and their first album in 12 years since Raise the Dead (2008).[11] However, the album was delayed to June 19, due to the COVID-19 pandemic. It was later pushed again one day earlier June 18, as a way of showing respect and support to the Black Lives Matter movement.[12]\n"
         ]
      },
      "The Guest (2002–2003)": {
         "text": [
            "Shortly thereafter Geffen Records folded into Universal as part of a major record industry merger, and within a few years Phantom Planet had signed with Epic Records. Charlotte Froom, the daughter of famed producer Mitchell Froom—who had worked with Elvis Costello and Paul McCartney—caught the band's show just at the time when the group was looking for a producer to record their second effort. Excited by the group's music, the young Froom approached her father to produce the group, and after meeting with Phantom Planet, he agreed. Froom also brought in engineer Tchad Blake, who had worked with Pearl Jam and Sheryl Crow, to work on the record.\n",
            "The Guest was released in 2002 and showcased a solid dose of poppy vocals, solid melodies, and sing-along choruses, which helped anchor Phantom Planet as a formidable indie outfit. The group's presence was also solidified by its commitment to touring. The group toured for almost 18 months both as a headliner and an opening act, and in late 2002 the band got the opportunity to open for one of their collective idols, the legendary Elvis Costello. The Guest got an extra boost when the record's notable power ballad \"California\" was chosen as the theme song for the Fox Network's hit TV series The O.C. As a result, the record was reissued in late 2003 with bonus tracks and a new cover, giving Phantom Planet a whole new round of exposure.\n"
         ]
      }
   },
   "In popular culture": {
      "text": [
         "The band has opened for many well-known artists, including Guns N' Roses, Sting,[24] Elvis Costello, Incubus, Guided by Voices, Blink-182, The Zombies, The Hives, Sloan, American Hi-Fi, Maroon 5, Ludacris, Panic! at the Disco, The Rocket Summer and Paramore.\n",
         "Phantom Planet has appeared on Sabrina the Teenage Witch, performing \"So I Fall Again\". They have also appeared on American Dreams, playing British rock band The Zombies and performing \"Tell Her No\" in the episode \"A Clear and Present Danger\". The song \"Lonely Day\" appeared in the television series Smallville. They have appeared in the 2005 film Bad News Bears, playing as a fictional \"skate\" band called The Bloodfarts.\nIn 2005, they covered the CSNY track \"Our House\" for the movie The Chumscrubber.\nPhantom Planet also performed a cover of Jackson Browne's \"Somebody's Baby\" for Not Another Teen Movie. \"Big Brat\" was also introduced in the soundtrack to the video game Driver 3 and featured in an episode from the first season of One Tree Hill, as well as used in the film The Amazing Spider-Man. Alex Greenwald, the band's vocalist, sang a fusion jazz cover of Radiohead's \"Just\" for the 2006 compilation Exit Music: Songs with Radio Heads.\nSam Farrar also contributed to the Hanson album, Underneath, on the song \"Lost Without Each Other.\nIn 2008, \"Raise the Dead\" was featured in an episode from the second season of Gossip Girl and \"Do the Panic\" was featured on the Gossip Girl soundtrack, OMFGG – Original Music Featured on Gossip Girl.\nTheir music has been heard frequently on television, most notably \"California\", as the theme song for the popular TV show The O.C., and the songs \"Do the Panic\" and \"Dropped\" in various commercials. Greenwald made an impact on the British music scene in early 2008 by featuring on Mark Ronson's cover of the Radiohead song \"Just\".\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Early years (1994–1998)",
      "1.2 The Guest (2002–2003)",
      "1.3 Phantom Planet (2004)",
      "1.4 Raise the Dead (2007–2008)",
      "1.5 Indefinite hiatus (2008)",
      "1.6 First reunion (2011–2013)",
      "1.7 Second reunion and Devastator (2019–present)",
      "2 Side projects and related work",
      "3 In popular culture",
      "4 Band members",
      "4.1 Timeline",
      "5 Discography",
      "6 Filmography",
      "7 References",
      "8 External links"
   ],
   "Side projects and related work": {
      "text": [
         "In September 2009, Alex Greenwald officially announced the tracks for his solo record. He posted the track listing and a CD mockup to his Twitter account.[13] The debut solo studio album by Alexander Greenwald, Yo, was released on May 5, 2014.\n",
         "Greenwald has co-produced and appeared on ex - Panic! at the Disco members, Ryan Ross and Jon Walker's new band, The Young Veins debut record, Take a Vacation!.[14] He has also produced a few tracks on the band The Like's new album. More recently, Greenwald recorded with Mark Ronson & the Business Intl, playing guitar, keyboards, and singing on the album.\n",
         "Alex Greenwald was a part of the group Phases.[15] He is also helping fellow band member Darren Robinson in his side project Twin Terrors.[16]\n",
         "Sam Farrar joined a band called Operation Aloha with members of Gomez, Maroon 5.[17] Operation Aloha's self-titled, fourth full-length album was released on May 12, 2009.[18] It was recorded over a period of 30 days in Maui, Hawaii.[19]\n",
         "Since 2012, Farrar is touring with Maroon 5 - as an additional band member - on guitars, occasionally on the bass guitar, percussion, backing vocals, turntables and providing samples and other special effects (using the MPC). He co-wrote and co-produced a few of the band's songs on almost all of their studio albums and also remixed one of their songs, which is called \"Woman\", on Call and Response: The Remix Album, released in 2008. On August 31, 2012 - during a show in Argentina on the Overexposed World Tour - Farrar filled-in for Mickey Madden on the bass guitar for the very first time. He subsequently filled-in for Madden on the next few shows of the tour. In 2016, he has become an official member.\n",
         "Darren Robinson went on tour with the band Miniature Tigers in January, February and March 2009.[20] He toured as member of singer/songwriter John Graney's Southern California surf band The Californian, in the summer of 2009. The band then included John Graney (vocals), himself (guitar and vocals), Jonathan Price (guitar Keys and vocals), Wendy Wang (bass and vocals), Mike Hopkins (drums).\n",
         "Darren has two projects, Twin Terrors[21] and Dead Honcho,[22] which has songs uploaded to SoundCloud.\n",
         "Jeff Conrad has a project called Vibe Mountain.[23]\n"
      ]
   },
   "Summary": {
      "text": [
         "Phantom Planet is an American rock band from Los Angeles, formed in 1994. The band consists of Alex Greenwald (vocals, rhythm guitar), Darren Robinson (lead guitar), Sam Farrar (bass guitar) and Jeff Conrad (drums). The band is best known for its track \"California\", which became the theme song for the TV series The O.C.. The band featured actor Jason Schwartzman on drums until 2003 and continued to release well-received albums in his absence.\n",
         "On November 25, 2008, the band announced in a blog entry on their website that they are going on \"hiatus, and will not be playing any more live shows or making any new records, indefinitely.\"[1] They played their last pre-hiatus show on December 12, 2008, in Los Angeles.\n",
         "The band reunited in 2019, announcing that their hiatus was over.\n"
      ]
   },
   "Title": "Phantom Planet - Wikipedia"
}