{
   "Name": "The Pity Party",
   "rawData": [
      "The Pity Party is a two-piece band from Los Angeles composed of Julie Edwards, aka Heisenflei (simultaneous drums, keyboards, and vocals) and Marc Smollin (guitar, vocals).  They are the first band without representation to score a full-page feature in NME.  The Pity Party's artwork is created exclusively by Ronald Dzerigian.\n",
      "Heisenflei and Smollin met in high school, where they sang in choir together.  In 2004 they recorded their first music on a digital 8-track recorder in Heisenflei's studio apartment in Silverlake, California.  Their first self-release was The EP (produced by Noah Shain) in 2006; champions of the environment, Heisenflei and Smollin folded and glued 750 CD sleeves made out of recycled cereal boxes.  Their second self-released EP, Orgy Porgy (produced by Stevehimself) was recorded at Moonshine Studios.  The group used recycled billboard vinyl to create 1,000 CD jackets which were hand sewn and screen printed with six unique images by artist Ronald Dzerigian.\n",
      "In July 2007, Los Angeles' Indie 103.1FM KDLD featured The Pity Party live in its \"Also I Like to Rock\" series at The Hammer Museum. They have received attention from members of the band Ozomatli who played \"The War Between 8 & 4\" on their show Ozolocal on LA's Star 98.7FM KYSR.  \"Guru of the soon-to-be-great,\" John Kennedy, has included \"H.O.T.S.\" on his playlist for his highly popular show X-Posure on XFM London.  \nAdditionally, The Pity Party presented RUBBISH, a celebration of trash, at Echo Curio Art Gallery in Echo Park. For the event, The Pity Party produced 100 limited edition EPs with recycled billboard vinyl sleeves.  While the band performed, artist Ronald Dzerigian drew a unique image on the sleeve of each distributed CD.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, USA"
      ],
      "Genres": [
         "rock"
      ],
      "Years active": [
         "2005 in music-present"
      ],
      "Website": [
         "The Pity Party Facebook Page"
      ],
      "Members": [
         "Heisenflei (Julie Edwards) & M"
      ]
   }
}