{
   "Name": "The Plugz",
   "Sections": [
      "1 Early history",
      "2 Line up",
      "3 Discography",
      "4 Track listing - Electrify Me (1979)",
      "5 Track listing - Better Luck (1981)",
      "6 In popular culture",
      "7 See also",
      "8 References",
      "9 External links"
   ],
   "Summary": {
      "text": [
         " The Plugz  (also known as \"Los Plugz\") were a Latino punk band from Los Angeles, California that formed in 1977 and disbanded in 1984. They and The Zeros were among the first Latino punk bands, although several garage rock bands, such as Thee Midniters and Question Mark & the Mysterians, predated them. The Plugz melded the spirit of punk and Latino music.\n",
         "The Big Takeover magazine was an early fan of The Plugz, and editor Jack Rabid most recently played one of their songs, “In the Wait”, on August 12, 2019.[1]\n"
      ]
   },
   "Early history": {
      "text": [
         "The band was formed in 1977 and was a contemporary of the bands featured in the film The Decline of Western Civilization.[2] Their songs reflected the anger and angst of growing up Chicano, and this was reflected in their sardonic hi-speed version of Ritchie Valens' \"La Bamba\". The Plugz are generally acknowledged as being the first D.I.Y. punk band in L.A., having started their own PLUGZ RECORDS and later Fatima records.\n"
      ]
   },
   "Line up": {
      "text": [
         "The band was initially composed of:\n",
         "This lineup recorded the band's first album, Electrify Me (1979).[2]\nProduced and engineered by Alan Kutner\n",
         "After McBride left (sometime in 1979-80), he was replaced by John Curry from The Flyboys, who left to form Choir Invisible less than a year later.[3] Larriva and Curry wrote the title track to the second album Better Luck. The musicians on the band's second album, Better Luck (1981), were:\n",
         "Guests:\n",
         "Tony Marsico joined the band in late 1980, and Steven Hufsteter began playing lead guitar with the group in 1984.\n",
         "With the addition of Steven Hufsteter on lead guitar, The Plugz also feature prominently on the soundtrack to the movie Repo Man.  The group performed \"Hombre Secreto,\" a Spanish version of Johnny Rivers' \"Secret Agent Man\", \"El Clavo y la Cruz\" and original instrumental background music for the film.  Both \"Hombre Secreto\" and \"Reel Ten\" (the instrumental soundtrack for Repo Man), featured Hufsteter on lead guitar.\n",
         "Plugz bassist Tony Marsico and drummer Charlie Quintana accompanied Bob Dylan on his appearance on Late Night with David Letterman on 22 March 1984 for three songs: \"Don't Start Me Talkin'\" (by Sonny Boy Williamson), \"Jokerman\", and \"License to Kill\".[4]\n",
         "In 1984, The Plugz name was retired and the three members continued as the Cruzados with Steven Hufsteter.\n",
         "The Plugz reunited the three founding members for The Masque 30th Anniversary Party and Book Release show on November 11, 2007 at The Echoplex in the Echo Park district of Los Angeles, California.[5]\n"
      ]
   },
   "Discography": {},
   "Track listing - Electrify Me (1979)": {},
   "Track listing - Better Luck (1981)": {},
   "In popular culture": {},
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      " The Plugz  (also known as \"Los Plugz\") were a Latino punk band from Los Angeles, California that formed in 1977 and disbanded in 1984. They and The Zeros were among the first Latino punk bands, although several garage rock bands, such as Thee Midniters and Question Mark & the Mysterians, predated them. The Plugz melded the spirit of punk and Latino music.\n",
      "The Big Takeover magazine was an early fan of The Plugz, and editor Jack Rabid most recently played one of their songs, “In the Wait”, on August 12, 2019.[1]\n",
      "The band was formed in 1977 and was a contemporary of the bands featured in the film The Decline of Western Civilization.[2] Their songs reflected the anger and angst of growing up Chicano, and this was reflected in their sardonic hi-speed version of Ritchie Valens' \"La Bamba\". The Plugz are generally acknowledged as being the first D.I.Y. punk band in L.A., having started their own PLUGZ RECORDS and later Fatima records.\n",
      "The band was initially composed of:\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California"
      ],
      "Genres": [
         "Punk rock, rock"
      ],
      "Years active": [
         "1977-1984"
      ],
      "Associated acts": [
         "Los Cruzados, Tito & Tarantula, Izzy Stradlin and the Ju Ju Hounds, The Psychotic Aztecs"
      ]
   }
}