{
   "Name": "Poco",
   "rawData": [
      "Poco is an American country rock band originally formed by Richie Furay, Jim Messina and Rusty Young.  They were formed following the demise of Buffalo Springfield in 1968, Poco was part of the first wave of the West Coast country rock genre. The title of their first album, Pickin' Up the Pieces, is a reference to the break-up of Buffalo Springfield. Throughout the years Poco has performed in various groupings, and is still active.\n",
      "During recording of Buffalo Springfield's third and final album, Last Time Around, lead singers Stephen Stills, Neil Young and Richie Furay each recorded songs without the other members present.  One of Furay's solo efforts was the country-influenced ballad \"Kind Woman\", which he recorded with the help of producer/engineer/bassist Jim Messina and pedal steel guitarist Rusty Young.\n",
      "When Buffalo Springfield split up, Furay, Messina and Rusty Young decided to start their own group oriented toward such songs. Its original lineup was Furay (vocals and rhythm guitar), Messina (lead guitar, vocals, producer), Rusty Young (pedal steel guitar, banjo, dobro, guitar, mandolin and vocals), George Grantham (drums and vocals) and Randy Meisner (bass and vocals). The group was signed to a recording contract with Epic Records, which acquired the rights to Furay from the Springfield's Atlantic Records subsidiary Atco label in return for those to Graham Nash of The Hollies (who was moving to Atlantic as part of forming Crosby, Stills & Nash). Originally, the new group was named \"Pogo\", after the Pogo comic strip character, but was changed when its creator, Walt Kelly, objected and threatened to sue.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States[1]"
      ],
      "Genres": [
         "Country rock, folk rock, soft rock"
      ],
      "Years active": [
         "1968–present"
      ],
      "Labels": [
         "Epic, ABC, MCA"
      ],
      "Associated acts": [
         "Buffalo Springfield, Eagles, Great Plains, Loggins and Messina, The Sky Kings, Souther–Hillman–Furay Band"
      ],
      "Website": [
         "www.poconut.org"
      ],
      "Members": [
         "Rusty Young",
         "Jack Sundrud",
         "Rick Lonow",
         "Tom Hampton"
      ],
      "Past members": [
         "George Grantham",
         "Richie Furay",
         "Jim Messina",
         "Randy Meisner",
         "Timothy B. Schmit",
         "Paul Cotton",
         "Al Garth",
         "Steve Chapman",
         "Charlie Harrison",
         "Kim Bullard",
         "Rick Seratte",
         "Jeff Steele",
         "Dave Vanecore",
         "Gary Mallaber",
         "Richard Neville",
         "Tim Smith",
         "George Lawrence",
         "Michael Webb",
         "Lex Browning"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band originally formed by [PERSON_NAME_FULL_1_MALE], Jim Messina and [PERSON_NAME_FULL_0_MALE].  They were formed following the demise of Buffalo Springfield in [YEAR], [BAND_NAME] was part of the first wave of the West Coast country rock genre. The title of their first album, Pickin' Up the Pieces, is a reference to the break-up of Buffalo Springfield. Throughout the years [BAND_NAME] has performed in various groupings, and is still active.\n",
      "During recording of Buffalo Springfield's third and final album, Last Time Around, lead singers [PERSON_NAME_FULL_2_MALE], Neil Young and [PERSON_NAME_FULL_0_MALE] each recorded songs without the other members present.  One of [PERSON_NAME_LAST_0]'s solo efforts was the country-influenced ballad \"Kind Woman\", which he recorded with the help of producer/engineer/bassist [PERSON_NAME_FULL_1_MALE] and pedal steel guitarist Rusty Young.\n",
      "When Buffalo Springfield split up, Furay, Messina and [PERSON_NAME_FULL_0_FEMALE] decided to start their own group oriented toward such songs. Its original lineup was Furay (vocals and rhythm guitar), Messina (lead guitar, vocals, producer), [PERSON_NAME_FULL_0_FEMALE] (pedal steel guitar, banjo, dobro, guitar, mandolin and vocals), George Grantham (drums and vocals) and [PERSON_NAME_FULL_1_MALE] (bass and vocals). The group was signed to a recording contract with Epic Records, which acquired the rights to Furay from the Springfield's Atlantic Records subsidiary Atco label in return for those to [PERSON_NAME_FULL_2_MALE] of The Hollies (who was moving to Atlantic as part of forming Crosby, Stills & [PERSON_NAME_LAST_2]). Originally, the new group was named \"Pogo\", after the Pogo comic strip character, but was changed when its creator, Walt Kelly, objected and threatened to sue.\n"
   ]
}