{
   "Name": "Porno for Pyros",
   "rawData": [
      "Porno for Pyros was an American alternative rock band formed in Los Angeles, California, United States in 1992, following the break-up of Jane's Addiction. The band comprised former Jane's Addiction members Perry Farrell (vocals) and Stephen Perkins (drums), as well as Peter DiStefano (guitar) and Martyn LeNoble (bass).\n",
      "The band released two studio albums, Porno for Pyros (1993) and Good God's Urge (1996), before parting ways in 1998.\n",
      "Following the demise of the critically and commercially successful Jane's Addiction, frontman Perry Farrell and drummer Stephen Perkins formed Porno for Pyros after acquiring guitarist Peter DiStefano and bass player Martyn LeNoble. Farrell named the band after seeing an ad for fireworks in a pornographic magazine. The name has also been connected through song lyrics to the LA riots which occurred in the band's hometown around the time of Porno for Pyros inception.  Prior to releasing their eponymous first album, Porno for Pyros embarked on a nationwide tour to support the new band. By the time the band's debut album was released in 1993, anticipation surrounding the project was enough to briefly drive the album to the No. 3 position on the Billboard top 200 list. The video for the album's second single, \"Pets\", received heavy airplay on MTV. Following the album's release, Porno for Pyros continued a heavy touring schedule, including an appearance at Woodstock '94 along with a cameo on HBO's The Larry Sanders Show. Unlike the relatively straight-ahead rock shows that were the hallmark of live Jane's Addiction, Porno for Pyros live shows relied heavily on props, extras and special effects (including pyrotechnics).\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Alternative rock"
      ],
      "Years active": [
         "1992–1998, 2009, 2018–present[1]"
      ],
      "Labels": [
         "Warner Bros."
      ],
      "Associated acts": [
         "Jane's Addiction",
         "Banyan",
         "Class of '99"
      ],
      "Past members": [
         "Perry Farrell",
         "Stephen Perkins",
         "Peter DiStefano",
         "Martyn LeNoble",
         "Mike Watt"
      ]
   },
   "albums": [
      "Rhino Hi-Five : Porno for Pyros"
   ]
}