{
   "Name": "Psi Com",
   "rawData": [
      "Psi Com was an American post-punk band of the early 1980s, consisting of Perry Farrell (vocals), Aaron Sherer (drums and percussion), Vince Duran (guitar) and Kelly Wheeler (bass). Prominent in the underground Los Angeles music scene, the group were noted for being the first band of Farrell, who went on to achieve greater fame in the bands Jane's Addiction, Porno for Pyros and the Satellite Party.\n",
      "The first incarnation of the band, later known as Psi Com, was initiated in 1981 by Duran, bassist Rich \"Evac\" Robinson (formerly of Afterimage), and Robinson's wife, keyboardist Mariska Leyssius. Lacking a drummer, they placed a classified ad in the free weekly L.A. newspaper The Recycler. Farrell responded to the ad, with the intention of becoming the group's singer rather than drummer. Robinson agreed to let Farrell join the band as the vocalist in early 1983.\n",
      "On March 27, 1984, the band recorded and rough-mixed a three-song demo cassette known as Worktape 1 at Pacifica Studios in Los Angeles. The tape, consisting of \"Hopeful\", \"Them\" and \"Psi Com Theme\", was produced by the band and Tony Cahill, and engineered by Glenn Feit. Additional copies of the cassette were manufactured and sold at Psi Com concerts. Robinson and Leyssius left after the demo recording. The drummer ad was left in The Recycler because the band was still practicing with the aid of a drum machine. Sherer called Farrell in response to the ad, and after he finally joined Duran and Farrell, Psi Com played their first significant live show, opening for the Cult at L.A.'s Music Machine club on August 1, 1984. One notable gig was held on the roof of the Oki Dog fast food restaurant, playing with the Minutemen.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Post-punk, gothic rock"
      ],
      "Years active": [
         "1981–1985"
      ],
      "Labels": [
         "Mohini Records",
         "Triple X Records"
      ],
      "Associated acts": [
         "Afterimage, Jane's Addiction, Porno for Pyros, the Satellite Party"
      ],
      "Members": [
         "Vince Duran",
         "Perry Farrell",
         "Aaron Sherer",
         "Kelly Wheeler"
      ],
      "Past members": [
         "Rich \"Evac\" Robinson",
         "Mariska Leyssius"
      ]
   },
   "albums": [
      "Psi Com"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band of the early [YEAR]s, consisting of Perry Farrell (vocals), [PERSON_NAME_FULL_0_MALE] (drums and percussion), [PERSON_NAME_FULL_1_MALE] (guitar) and Kelly Wheeler (bass). Prominent in the underground Los Angeles music scene, the group were noted for being the first band of Farrell, who went on to achieve greater fame in the bands [MONTH]e's Addiction, Porno for Pyros and the Satellite Party.\n",
      "The first incarnation of the band, later known as [BAND_NAME], was initiated in [YEAR] by Duran, bassist Rich [SONG_NAME] Robinson (formerly of Afterimage), and Robinson's wife, keyboardist [MONTH]iska Leyssius. Lacking a [GENRE] a classified ad in the free weekly L.A. newspaper The Recycler. Farrell responded to the ad, with the intention of becoming the group's singer rather than drummer. Robinson agreed to let Farrell join the band as the vocalist in early [YEAR].\n",
      "On [MONTH] 27, [YEAR], the band recorded and rough-mixed a three-song demo cassette known as Worktape 1 at Pacifica Studios in Los Angeles. The tape, consisting of [SONG_NAME], was produced by the band and [PERSON_NAME_FULL_0_MALE], and engineered by Glenn Feit. Additional copies of the cassette were manufactured and sold at [BAND_NAME] concerts. Robinson and Leyssius left after the demo recording. The drummer ad was left in The Recycler because the band was still practicing with the aid of a drum machine. Sherer called Farrell in response to the ad, and after he finally joined Duran and Farrell, [BAND_NAME] played their first significant live show, opening for the Cult at L.A.'s Music Machine club on [MONTH] 1, [YEAR]. One notable gig was held on the roof of the Oki Dog fast food restaurant, playing with the Minutemen.\n"
   ]
}