{
   "Name": "Psi Com",
   "Sections": [
      "1 History",
      "2 Post-breakup",
      "3 Discography",
      "3.1 EPs",
      "3.2 Cassettes",
      "4 References"
   ],
   "Summary": {
      "text": [
         "Psi Com was an American post-punk band of the early 1980s, consisting of Perry Farrell (vocals), Aaron Sherer (drums and percussion), Vince Duran (guitar) and Kelly Wheeler (bass). Prominent in the underground Los Angeles music scene, the group were noted for being the first band of Farrell, who went on to achieve greater fame in the bands Jane's Addiction, Porno for Pyros and the Satellite Party.\n"
      ]
   },
   "History": {
      "text": [
         "The first incarnation of the band, later known as Psi Com, was initiated in 1981 by Duran, bassist Rich \"Evac\" Robinson (formerly of Afterimage), and Robinson's wife, keyboardist Mariska Leyssius. Lacking a drummer, they placed a classified ad in the free weekly L.A. newspaper The Recycler. Farrell responded to the ad, with the intention of becoming the group's singer rather than drummer. Robinson agreed to let Farrell join the band as the vocalist in early 1983.\n",
         "On March 27, 1984, the band recorded and rough-mixed a three-song demo cassette known as Worktape 1 at Pacifica Studios in Los Angeles. The tape, consisting of \"Hopeful\", \"Them\" and \"Psi Com Theme\", was produced by the band and Tony Cahill, and engineered by Glenn Feit. Additional copies of the cassette were manufactured and sold at Psi Com concerts.[1] Robinson and Leyssius left after the demo recording. The drummer ad was left in The Recycler because the band was still practicing with the aid of a drum machine. Sherer called Farrell in response to the ad, and after he finally joined Duran and Farrell, Psi Com played their first significant live show, opening for the Cult at L.A.'s Music Machine club on August 1, 1984.[2][3] One notable gig was held on the roof of the Oki Dog fast food restaurant, playing with the Minutemen.\n",
         "By 1985, the group had realized that they needed a bass player to fill out the bottom end of their sound, and they recruiting their friend Wheeler, who moved into a house with Farrell near the University of Southern California. Just after Wheeler joined, the quartet performed on January 5, 1985 at the Gila Monster Jamboree in the middle of the Mojave Desert, opening for Sonic Youth, Redd Kross and the Meat Puppets.[4] The performance was regarded as poor due to Farrell being high on magic mushrooms at the time.[1]\n",
         "In March 1985, Psi Com made plans to release a five-song 12\" EP. The band entered Radio Tokyo Studios in Venice, California that spring and recorded the songs \"Xiola,\" \"Human Condition,\" \"Ho Ka Hey\", \"Winds\" and \"City of Nine Gates.\" Ethan James produced the sessions, which lasted for one weekend. James was known for producing the Minutemen's most popular album, Double Nickels on the Dime. To achieve the EP's distinctive sound, Psi Com used unique equipment. Wheeler used a full-scale, small-bodied Ibanez that the band had bought for him and played it through an SWR bass amplifier, Duran played a late 1970s Fender Stratocaster through a Roland JC120 amplifier and Sherer played a set of DW Drums, while Farrell contributed to percussion by drumming on church bells, hubcaps and even a Chevy engine block. For certain vocal effects he used an Ibanez DM-1000 analogue echo unit.[1]\n",
         "Psi Com ordered 1,500 copies of their self-titled EP that July for release on their own label, Mohini Records. The band went into shock when the records were delivered from the pressing plant, as more than half of the EPs were warped. Frustrated by the experience, the band drifted apart musically and personally, and by September 1985, Psi Com had ended. It was rumored that the demise of Psi Com was a result of Sherer and Duran becoming Hare Krishnas, but this assertion was declared to be false by both men in an interview with American magazine Musician.[1]\n"
      ]
   },
   "Post-breakup": {
      "text": [
         "After the split, Farrell remained living in the house that he had shared with Wheeler, before forming Jane's Addiction with Eric Avery later in 1985, while Wheeler spent time performing with musician Dino Paredes, later the bassist for Red Temple Spirits and vice president of A&R for American Recordings. Duran and Sherer lessened their involvement with bands and only performed part-time with local L.A. groups. However, Sherer did play drums on two tracks on Mazzy Star's 1996 album Among My Swan.[2]\n",
         "Due to the subsequent popularity of Jane's Addiction, Psi Com's EP was reissued on CD in 1993 by Triple X Records.\n",
         "A demo of three Psi Com tracks, \"14th Floor\", \"Cat\" (aka \"In the Holly Grove\") and \"Karuna\" (aka \"Finger Puppets\"), recorded at Radio Tokyo Studios in 1984, surfaced as part of the Jane's Addiction bootleg CD Skin and Bones in the early 1990s.[5] Different versions of these songs were also made available on the Jane's Addiction bootleg CD Pigs in Zen.[1][6] Several live bootleg tracks by Psi Com also circulated around the fan community, the most notable being \"Silhouette\", \"Greedy Was the Beggar\" and \"Follow the Insated\".[7]\n"
      ]
   },
   "Discography": {
      "EPs": {},
      "Cassettes": {}
   },
   "References": {},
   "coreData": [
      "Psi Com was an American post-punk band of the early 1980s, consisting of Perry Farrell (vocals), Aaron Sherer (drums and percussion), Vince Duran (guitar) and Kelly Wheeler (bass). Prominent in the underground Los Angeles music scene, the group were noted for being the first band of Farrell, who went on to achieve greater fame in the bands Jane's Addiction, Porno for Pyros and the Satellite Party.\n",
      "The first incarnation of the band, later known as Psi Com, was initiated in 1981 by Duran, bassist Rich \"Evac\" Robinson (formerly of Afterimage), and Robinson's wife, keyboardist Mariska Leyssius. Lacking a drummer, they placed a classified ad in the free weekly L.A. newspaper The Recycler. Farrell responded to the ad, with the intention of becoming the group's singer rather than drummer. Robinson agreed to let Farrell join the band as the vocalist in early 1983.\n",
      "On March 27, 1984, the band recorded and rough-mixed a three-song demo cassette known as Worktape 1 at Pacifica Studios in Los Angeles. The tape, consisting of \"Hopeful\", \"Them\" and \"Psi Com Theme\", was produced by the band and Tony Cahill, and engineered by Glenn Feit. Additional copies of the cassette were manufactured and sold at Psi Com concerts.[1] Robinson and Leyssius left after the demo recording. The drummer ad was left in The Recycler because the band was still practicing with the aid of a drum machine. Sherer called Farrell in response to the ad, and after he finally joined Duran and Farrell, Psi Com played their first significant live show, opening for the Cult at L.A.'s Music Machine club on August 1, 1984.[2][3] One notable gig was held on the roof of the Oki Dog fast food restaurant, playing with the Minutemen.\n",
      "By 1985, the group had realized that they needed a bass player to fill out the bottom end of their sound, and they recruiting their friend Wheeler, who moved into a house with Farrell near the University of Southern California. Just after Wheeler joined, the quartet performed on January 5, 1985 at the Gila Monster Jamboree in the middle of the Mojave Desert, opening for Sonic Youth, Redd Kross and the Meat Puppets.[4] The performance was regarded as poor due to Farrell being high on magic mushrooms at the time.[1]\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Post-punk, gothic rock"
      ],
      "Years active": [
         "1981–1985"
      ],
      "Labels": [
         "Mohini Records",
         "Triple X Records"
      ],
      "Associated acts": [
         "Afterimage, Jane's Addiction, Porno for Pyros, the Satellite Party"
      ],
      "Members": [
         "Vince Duran",
         "Perry Farrell",
         "Aaron Sherer",
         "Kelly Wheeler"
      ],
      "Past members": [
         "Rich \"Evac\" Robinson",
         "Mariska Leyssius"
      ]
   }
}