{
   "Name": "Queens of the Stone Age",
   "rawData": [
      "Queens of the Stone Age (commonly abbreviated QOTSA) is an American rock band formed in 1996 in Palm Desert, California. The band was founded by vocalist and guitarist Josh Homme, who has been the only constant member throughout multiple line-up changes. The current line-up consists of Homme alongside Troy Van Leeuwen (guitar, lap steel, keyboard, percussion, backing vocals), Michael Shuman (bass guitar, keyboard, backing vocals), Dean Fertita (keyboards, guitar, percussion, backing vocals), and Jon Theodore (drums, percussion). The band also have a large pool of contributors and collaborators. Queens of the Stone Age are known for their blues, Krautrock and electronica-influenced style of riff-oriented and rhythmic hard rock music, coupled with Homme's distinct falsetto vocals and unorthodox guitar scales. \n",
      "Formed after the dissolution of Homme's previous band Kyuss, the band originated from the Palm Desert music scene, known for its distinct \"desert rock\" sound and highly collaborative nature. Their self-titled debut album was recorded by former Kyuss bandmates Alfredo Hernández on drums and Homme on all other instruments. It was well received by critics for its stoner rock sound which Homme has described as \"robot rock\". Nick Oliveri joined the band as bassist and vocalist along with additional vocalist Mark Lanegan for the recording of Rated R, which was commercially and critically successful. Now with three singers and a myriad of other collaborators, Rated R diversified their musical palette with forays into psychedelic rock, punk rock and heavy metal, and featured their breakout single \"Feel Good Hit of the Summer\", which lists six recreational drugs. Featuring former Nirvana drummer and Foo Fighters singer Dave Grohl on drums and contributions from Alain Johannes and Natasha Shneider, Songs for the Deaf was released in 2002, to universal acclaim and commercial success. The album saw the band further experiment with instrumentation, such as string and horn arrangements, and featured some of the band's most enduring singles \"No One Knows\" and \"Go with the Flow\". By this time the band had achieved considerable international recognition, and have since embarked on successive world tours. Homme fired Oliveri and Lanegan left as a core member but continued to occasionally contribute vocals, making Homme the primary singer for 2005's Lullabies to Paralyze and 2007's electronic-influenced Era Vulgaris. \n",
      "After a few years of inactivity while the band members worked on other projects, the more somber and introspective ...Like Clockwork was released in 2013, receiving critical acclaim. The band released Villains in 2017 with Mark Ronson as producer.\n"
   ],
   "infobox": {
      "Also known as": [
         "Gamma Ray (1996)"
      ],
      "Origin": [
         "Palm Desert, California, U.S."
      ],
      "Genres": [
         "Alternative rock",
         "stoner rock",
         "hard rock",
         "alternative metal"
      ],
      "Years active": [
         "1996 (1996)–present"
      ],
      "Labels": [
         "Man's Ruin",
         "Loosegroove",
         "Interscope",
         "Matador"
      ],
      "Associated acts": [
         "Kyuss",
         "Screaming Trees",
         "the Desert Sessions",
         "Eagles of Death Metal",
         "the Mars Volta",
         "Mondo Generator",
         "Mini Mansions",
         "Them Crooked Vultures",
         "Blast",
         "Iggy Pop"
      ],
      "Website": [
         "qotsa.com"
      ],
      "Members": [
         "Josh Homme",
         "Troy Van Leeuwen",
         "Dean Fertita",
         "Michael Shuman",
         "Jon Theodore"
      ],
      "Past members": [
         "Alfredo Hernández",
         "Nick Oliveri",
         "Mark Lanegan",
         "Dave Grohl",
         "Joey Castillo",
         "Alain Johannes",
         "Natasha Shneider"
      ]
   },
   "albums": [
      "Queens of the Stone Age",
      "Rated R",
      "Songs for the Deaf",
      "Lullabies to Paralyze",
      "Era Vulgaris",
      "...Like Clockwork",
      "Villains"
   ]
}