{
   "Name": "Ratt",
   "Sections": [
      "1 History",
      "1.1 Ratt EP (1982-83)",
      "1.2 Out of the Cellar (1984)",
      "1.3 Invasion of Your Privacy (1985–1986)",
      "1.4 Dancing Undercover (1986–1987)",
      "1.5 Reach for the Sky (1988–1989)",
      "1.6 Detonator (1990–1991)",
      "1.7 Struggles and hiatus (1991–1996)",
      "1.8 First reunion and self-titled album (1996–2000)",
      "1.9 Two versions of Ratt and death of Robbin Crosby (2000–2006)",
      "1.10 Second reunion (2006–2008)",
      "1.11 Infestation and hiatus (2009–2011)",
      "1.12 Reunion with Croucier and second departure of Pearcy (2012–2015)",
      "1.13 Legal issues and two versions of Ratt again (2015–2018)",
      "1.14 Ratt's \"New Breed\" (2018–present)",
      "2 Members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Ratt is an American heavy metal[2] band that had significant commercial success in the 1980s, with their albums having been certified as gold, platinum, and multi-platinum by the RIAA. The group is perhaps best known for hit singles such as \"Round and Round\" and \"Lay It Down\", each track having ranked on Billboard's top 40. Other songs such as \"Wanted Man\", \"You're in Love\" and \"Dance\" also have ranked there. \n",
         "Along with groups like Mötley Crüe, Ratt has been recognized as instrumental in the formation of the early 1980s Los Angeles glam metal scene, also known as \"hair metal\" or \"pop metal\".[3][4] The band has continued to tour and record following extended hiatuses and line-up changes, releasing their latest studio album, Infestation, on April 20, 2010.[5]\n"
      ]
   },
   "History": {
      "Ratt EP (1982-83)": {
         "text": [
            "In July 1983, Ratt signed with the production company Time Coast Music. The company was run by the band's then-manager, Marshall Berle.[citation needed] Time Coast had previously issued records by Spirit[6] and The Alley Cats.[7]\n",
            "Released in 1983, the band's self-titled EP sold over 100,000 records. The band grew in popularity on the Hollywood, L.A. club circuit, selling out multiple shows on weekends. Stephen Pearcy and Robbin Crosby co-wrote the band's first single, \"You Think You're Tough\", which found its way onto local radio stations KLOS and KMET.[citation needed]\n"
         ]
      },
      "Out of the Cellar (1984)": {
         "text": [
            "The self-titled independent EP was well-received, and the band was signed by Atlantic Records. Ratt immediately started writing and recording their first full-length album. Out of the Cellar was released in March 1984 and was praised by both fans and critics. Pearcy's raspy yet bluesy vocals were noted for melding with the pyrotechnic guitar playing of twin leads Crosby and DeMartini, combining the then-prevalent Van Halen and Aerosmith-influenced bravado elements with the then-novel muted, staccato guitar-picking style of Judas Priest. Tawny Kitaen, who was previously in a relationship with Crosby, agreed to appear on the cover of their debut full-length album. She also appeared in their video for \"Back for More\" and on their EP from the previous year.[citation needed]\n",
            "The album scored much radio and MTV play with songs like \"Round and Round\" (which peaked at No. 12 on the Billboard Hot 100 chart), \"Wanted Man\", \"Back for More\", and \"Lack of Communication\".[citation needed] The video for “Round and Round” was notable for its guest appearance by Marshall Berle's uncle,[8] Milton Berle, in his Uncle Miltie drag character. Out of the Cellar became a commercial success, going platinum three times over in the United States and making Ratt stars at home and abroad.[citation needed] The album release was capped off by a successful world tour that saw the band sell out stadiums and arenas worldwide. Out of the Cellar is widely regarded as the band's best work and a definitive moment in 1980s heavy metal, while \"Round and Round\" scored at No. 61 on VH1's Greatest Hard Rock Songs Show.[citation needed]\n"
         ]
      },
      "Invasion of Your Privacy (1985–1986)": {
         "text": [
            "The band's second full-length album, Invasion of Your Privacy, was released in July 1985.\nIt peaked at No. 7 (which is the same peak position that Out of the Cellar attained). The album met with mostly positive reactions from fans and critics. AllMusic has called it \"another batch of solid pop-metal tunes\".[9] It contained favorites \"You're in Love\" and \"Lay It Down\" (which made No. 40 on the Hot 100) that assured the band a presence on radio and MTV. Footage from the band's performances at Hirsch Memorial Coliseum in Shreveport, Louisiana and the Mississippi Coast Coliseum in Biloxi, Mississippi were featured in the video to \"You're In Love\".[citation needed]\n",
            "DeMartini and Crosby's impressive guitar solos and Pearcy's sexual lyrics helped to further define the Ratt sound. Although it did not achieve the sales figures or the status of their debut, Invasion of Your Privacy nonetheless was certified double platinum (selling over two million copies) and remains highly regarded amongst fans.[citation needed]\n",
            "A couple of months after the album release, the band released a home video entitled Ratt: The Video. The video featured the music videos from the Ratt EP, Out of the Cellar and Invasion of Your Privacy. The video was the first commercially available video to achieve gold sales status in the USA; it eventually reached platinum.[citation needed]\n",
            "The model on Invasion's cover is Playboy Playmate Marianne Gravatte, who also made an appearance in the \"Lay It Down\" music video. Using a beautiful female model on an album cover later became a trend copied by many glam metal bands of the 1980s, including Great White and Slaughter. Invasion of Your Privacy was displayed by Parents Music Resource Center at a congressional hearing dealing with parental advisory labels.[citation needed]\n",
            "The band toured extensively in the United States and Japan. In August 1985, the band played on the Monsters of Rock festival in Castle Donington, England.[citation needed]\n"
         ]
      },
      "Dancing Undercover (1986–1987)": {
         "text": [
            "Ratt's next release was Dancing Undercover in September 1986. The album was a relative disappointment with most music critics at the time of its release. From a commercial standpoint however, the album kept Ratt's string of consecutive platinum albums alive. Popular tracks generated by the album included \"Dance\" and \"Slip of the Lip\".[citation needed]\n",
            "In an effort to be taken more seriously, Ratt broke from the tradition of featuring a woman on the cover. Instead, they opted for gritty black-and-white photos of each of the five band members. Likewise, the album does not contain a single power ballad amongst its ten tracks and even features experimental forays into thrashier and heavier sounds. The song that reflected this shift most strikingly was \"Body Talk\", which was featured on the soundtrack for the 1986 Eddie Murphy film The Golden Child. The more straight-ahead style of the album led many fans to believe that Ratt was headed in a direction  akin to the thrash style promulgated by such bands as Anthrax, Megadeth, and Slayer. However, the slightly experimental undertones of the album were replaced with a bluesier sound throughout the band's next three releases.[citation needed]\n",
            "Through 1987, Ratt embarked on a U.S. tour with newcomers Poison and played in Europe as a part of the Monsters Of Rock Tour. Their tour with Poison was one of the highest grossing tours of 1987.[citation needed]\n"
         ]
      },
      "Reach for the Sky (1988–1989)": {
         "text": [
            "Reach for the Sky was released in November 1988. Although the album achieved platinum sales status and reached No. 17 on Billboard's album charts, it was widely panned by critics. After this album, the band parted ways with long-time producer Beau Hill. Reach for the Sky nevertheless contained the popular tracks \"Way Cool Jr.\" and \"I Want a Woman\", which received MTV airplay. These two songs are regarded as glam metal classics.[citation needed]\n",
            "The surreal, Dali-esque album cover featured a statue wearing night vision goggles, a human hand emerging from a bundle of twine, a World War II fighter plane, and a wicker chair. The band has remained mum as to what the album cover is supposed to symbolize so as to facilitate the diverse interpretations of their fans. Early pressings of the album cover revealed the breast part of the statue as requested by lead singer Stephen Pearcy. According to Pearcy, he wanted to use that version of the cover, but the other band members feared that this cover would keep the record out of certain music stores.[citation needed]\n"
         ]
      },
      "Detonator (1990–1991)": {
         "text": [
            "Ratt's fifth album, Detonator, was released in August 1990. Sir Arthur Payson took over as producer for the band following Reach for the Sky. The album garnered mixed reactions. Critics claimed it lacked the live-sounding energy of the band's earlier work,[10] while some that the band was maturing and striving to expand their sound.[11] Detonator featured  \"Givin' Yourself Away\" and \"Lovin' You's a Dirty Job\". The band co-wrote most of the album's songs with Desmond Child while Jon Bon Jovi appeared as a guest background vocalist on \"Heads I Win, Tails You Lose\". \n",
            "During the seven shows of the Japanese leg of the 'Detonator' tour in February 1991, Crosby's substance abuse caused his playing to become increasingly inconsistent onstage. During one particular show, after the band performed two songs using non-standard tuning, Crosby did not properly switch out guitars with his guitar technician; as a result, he was not in tune with the band for the next two songs. The last show of the band's Japanese tour, in Osaka, turned out to be Crosby's last with Ratt. When the band returned to the United States, Crosby checked again into a rehab facility and Ratt continued on with Michael Schenker, formerly of Scorpions, UFO, Michael Schenker Group, and McAuley Schenker Group.[citation needed]\n"
         ]
      },
      "Struggles and hiatus (1991–1996)": {
         "text": [
            "In February 1992, Pearcy exited the group to form a new band called Arcade. He moved on to Vicious Delite in 1995 and the industrial-tinged Vertex in 1996.[citation needed]\n",
            "Robbin Crosby started Secret Service, which included bassist Krys Baratto (from Samantha 7, Juice 13, The Oddfathers). In 1993, Crosby performed on Rumbledog's self-titled debut album. In 1994, Crosby was diagnosed with HIV, which later developed into AIDS.[citation needed]\n"
         ]
      },
      "First reunion and self-titled album (1996–2000)": {
         "text": [
            "In 1996, the five classic era members of Ratt began discussing a reunion and a subsequent album. Ratt eventually moved forward with a lineup of Pearcy, DeMartini and Blotzer, along with new member Robbie Crane (formerly of Vince Neil's solo band and Pearcy's Vertex tour) on bass. When the band toured in 1997, they were a four-piece; Pearcy occasionally played guitar during this tour.[citation needed]\n",
            "The band issued a compilation album called Collage in July 1997, which consisted of B-sides, alternate recordings, and new versions of songs from the Mickey Ratt period. In 1998, Ratt secured a worldwide record deal with Sony. The self-titled Ratt album, released in July 1999, featured new material with a more conventional blues rock feel. The album's first single, \"Over the Edge\", did graze the Top 40 Mainstream Rock charts.[citation needed]\n"
         ]
      },
      "Two versions of Ratt and death of Robbin Crosby (2000–2006)": {
         "text": [
            "In 1999, Ratt added Keri Kelli as a second guitarist. In January 2000, Pearcy left the group again and went on tour with his band Nitronic, which soon after became \"Ratt Featuring Stephen Pearcy\".[citation needed]\n",
            "In 2001, former guitarist Robbin Crosby publicly announced that he was HIV-positive. He died on June 6, 2002, from a heroin overdose. He was 42 years old.[2]\n",
            "On May 11, 2006, Ratt was profiled on VH1's Behind the Music.[citation needed]\n",
            "During the group's inactive years, present-day and former members continued to work on their own side projects.[12]\n"
         ]
      },
      "Second reunion (2006–2008)": {
         "text": [
            "On December 1, 2006, the website \"Metal Sludge\" generated rumors after reporting that Pearcy and Croucier would re-unite with Blotzer and DeMartini.[13] On December 4, 2006, Jizzy Pearl announced on his message board that he was no longer a member of the band.[14] On March 17, 2007, another website stated that Ratt would go on the 2007 tour with Poison and Great White.[15] Later that month, Blabbermouth.net reported that Ratt would take part in the \"Rocklahoma\" festival on July 13–15, 2007 in Pryor, Oklahoma, with original singer Stephen Pearcy and without Juan Croucier, who decided not to participate in the reunion tour. Robbie Crane continued to play bass instead.[16]\n",
            "The summer tour started June 13, 2007 at the Bi Lo Center in Greenville, S.C., and ended August 19, 2007 at the Coors Amphitheatre in Denver. The tour, which brought Poison and Ratt onstage together for the first time since 1999, visited amphitheaters, festivals and fairs in such cities as Boston, Detroit, New York, Atlantic City and Los Angeles.[citation needed]\n",
            "In August 2008, Sirius Satellite Radio's Hair Nation channel reported that former Mötley Crüe singer John Corabi had resigned as rhythm guitarist for Ratt and was rumored to be replaced by former Quiet Riot guitarist Carlos Cavazo.[17] Bobby Blotzer confirmed these rumors stating that Cavazo was set to replace Corabi and would make his debut with the band on August 27. His first show with Ratt was in Baton Rouge, LA.[citation needed]\n"
         ]
      },
      "Infestation and hiatus (2009–2011)": {
         "text": [
            "In April 2009 Loud & Proud/Roadrunner Records announced the signing of a worldwide deal with Ratt. Their new album, Infestation, was released in April 2010. Infestation reached No. 30 on Billboard's Top 200 chart. A video was filmed for the album's first single, \"Best of Me\",[18] and the band went on a world tour in support of the album.[19]\n",
            "In a March 18, 2010 interview with Metalholic Magazine, DeMartini said of the new album Infestation: \"It really exceeded our expectations. Conceptually we kinda wanted to revisit the period of Out of the Cellar and Invasion of Your Privacy. We were sort of loosely trying to shoot for something that could fit between those two records. We were looking for more uptempo ideas and the double leads that Robbin Crosby and I started doing back in 1983.\"[20]\n",
            "On October 26, 2010, it was announced Ratt would be going into an indefinite hiatus after tensions within the band reared their head.[21][22] On October 27, 2010, Pearcy said Ratt would be on hiatus \"for a while.\".[23]\n"
         ]
      },
      "Reunion with Croucier and second departure of Pearcy (2012–2015)": {
         "text": [
            "In January 2012, Pearcy said Ratt was in the process of writing material for a new album, planned to be released that summer.[24] On March 22, bassist Robbie Crane announced his departure from Ratt to focus on Lynch Mob.[25] In April 2012, rumors arose original bassist Juan Croucier would rejoin the band that summer;[26] these rumors were confirmed when Croucier played with Ratt at the M3 festival on May 12.[27]\n",
            "On April 24, 2014, Pearcy announced that he had left the band again, explaining he was \"officially done with having anything to do with them due to the constant turmoil, unresolved business, personal attacks/threats in the public forum, and most of all, the disrespect to the fans.\"[28][29]\n"
         ]
      },
      "Legal issues and two versions of Ratt again (2015–2018)": {
         "text": [
            "In June 2015, Blotzer formed a band called Bobby Blotzer's Ratt Experience.[30] In August 2015, Croucier formed a touring band that played Ratt's deep cuts, with the band debuting in September.[31] Within days, Blotzer criticized Croucier for using the band's logo, arguing trademark infringement.[32]\n",
            "In September 2015, Blotzer took over control of WBS, a company he set up with DeMartini and Pearcy in 1997 to handle RATT business, over the objection of DeMartini and announced that he had \"taken control\" of Ratt and his Ratt Experience lineup was the real Ratt and would be embarking a tour in 2016 titled the American Made Re-Invasion Tour.[33][34] Within days, DeMartini spoke out against Blotzer using the band name.[35] but Blotzer claims he has the legal right to do so on his behalf.[36] In October 2015, DeMartini sued Blotzer for allegedly falsely advertising his \"tribute band\" as the actual band.[37] On November 5, 2015, the Los Angeles federal court rejected[38] DeMartini's claim.[39][40][41]\n",
            "Until early 2017, Blotzer toured using the name Ratt. The 2016 Re-Invasion tour took Ratt throughout North America. Their tour also took them to the UK, including Hard Rock Hell and London. During this time, Blotzer was using the company WBS to sue the band's original bassist, Juan Croucier, for trademark infringement.[42] On November 8, 2016 that Court granted summary judgment against WBS and in favor of Croucier, finding that the trademark rights had never properly been transferred to WBS and thus were still held by the RATT Partnership under its 1985 partnership agreement.[43] Blotzer had also used WBS to sue Pearcy for trademark infringement in a separate lawsuit, but that lawsuit also failed.[44]\n",
            "On November 29, 2016, Pearcy, Croucier and DeMartini announced that they had expelled Blotzer from the Ratt Partnership and announced their own Back for More Tour.[45][46]\n",
            "Despite adverse court decisions, Blotzer continued to tour as RATT with his band, claiming the right to do so because final judgment had not yet been entered in the cases.[47]\n",
            "In June 2017, judgment was finally entered in the Croucier case, and Blotzer's WBS filed an appeal to the Ninth Circuit Court of Appeals.[48] In May 2018, the RATT Partnership filed suit against Blotzer and WBS for trademark infringement for continuing to perform as RATT after February 2016, when it was adjudicated that WBS had no rights in the RATT marks and Blotzer was expelled from the Partnership.[49] In March 2019, the Ninth Circuit affirmed the district court judgment in favor of Croucier and sent the case back to the district court to determine whether WBS and its counsel should be liable for Croucier's attorneys' fees.[50]\n"
         ]
      },
      "Ratt's \"New Breed\" (2018–present)": {
         "text": [
            "On June 1, 2018, it was announced by vocalist Pearcy that Ratt would move forward with him and bassist Croucier. It was confirmed that DeMartini had departed from Ratt with Cavazo and Degrasso following.[51] On July 5, 2018, it was revealed that Pearcy and Croucier would be joined by Black 'N Blue drummer Pete Holmes and guitarists Jordan Ziff and Chris Sanders.[52]  In February 2020, guitarist Chris Sanders announced his departure from the band, along with announcing his retirement from the music industry.[53]\n",
            "In April 2020, Ratt was featured in a GEICO commercial depicting new homeowners that love their house, but note that they have a \"rat problem\".  To the dismay of the homeowners, the band is shown performing their hit song \"Round and Round\" in different parts of the house.[54]\n",
            "Due to the COVID-19 pandemic, all shows in 2020 were rescheduled for 2021.[55] On September 11, 2020, Pearcy announced that the band's upcoming album would not be released until 2021.[56] On October 13, 2020, he said that Ratt would be \"ready to go\" with their new rhythm guitarist and new material that year;[57] however, guitarist Erik Ferentinos for Pearcy's solo band, said that Pearcy would possibly put Ratt on hold to focus his attention on his solo project.[58]\n"
         ]
      }
   },
   "Members": {
      "text": [
         "Current\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Ratt is an American heavy metal[2] band that had significant commercial success in the 1980s, with their albums having been certified as gold, platinum, and multi-platinum by the RIAA. The group is perhaps best known for hit singles such as \"Round and Round\" and \"Lay It Down\", each track having ranked on Billboard's top 40. Other songs such as \"Wanted Man\", \"You're in Love\" and \"Dance\" also have ranked there. \n",
      "Along with groups like Mötley Crüe, Ratt has been recognized as instrumental in the formation of the early 1980s Los Angeles glam metal scene, also known as \"hair metal\" or \"pop metal\".[3][4] The band has continued to tour and record following extended hiatuses and line-up changes, releasing their latest studio album, Infestation, on April 20, 2010.[5]\n",
      "In July 1983, Ratt signed with the production company Time Coast Music. The company was run by the band's then-manager, Marshall Berle.[citation needed] Time Coast had previously issued records by Spirit[6] and The Alley Cats.[7]\n",
      "Released in 1983, the band's self-titled EP sold over 100,000 records. The band grew in popularity on the Hollywood, L.A. club circuit, selling out multiple shows on weekends. Stephen Pearcy and Robbin Crosby co-wrote the band's first single, \"You Think You're Tough\", which found its way onto local radio stations KLOS and KMET.[citation needed]\n"
   ],
   "infobox": {
      "Also known as": [
         "Mickey Ratt (1976–1981)"
      ],
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Heavy metal",
         "glam metal",
         "hard rock[1]"
      ],
      "Years active": [
         "1976–1992",
         "1996–present"
      ],
      "Labels": [
         "Atlantic",
         "Portrait",
         "Roadrunner"
      ],
      "Associated acts": [
         "Dokken",
         "Whitesnake",
         "Arcade",
         "L.A. Guns",
         "Steeler",
         "Queensrÿche",
         "Quiet Riot",
         "Black 'n Blue",
         "Britny Fox"
      ],
      "Website": [
         "therattpack.com"
      ],
      "Members": [
         "Stephen Pearcy",
         "Juan Croucier",
         "Bobby Blotzer",
         "Jordan Ziff"
      ],
      "Past members": [
         "Jake E. Lee",
         "Warren DeMartini",
         "Robbin Crosby",
         "Michael Schenker",
         "Keri Kelli",
         "John Corabi",
         "Carlos Cavazo",
         "Robbie Crane",
         "Jimmy DeGrasso",
         "Chris Sanders",
         "Marq Torien",
         "Pete Holmes"
      ]
   }
}