{
   "Name": "Renegade (band)",
   "rawData": [
      "Renegade is an American rock n' roll band composed of Luis Cardenas, Kenny Marquez and Tony De La Rosa. Although all the band members hail from the United States, the band were among the most successful Hispanic or \"Chicano rock\" acts founded in the United States during the 1980s. Throughout Latin America, the band is known as Los Renegados.\n",
      "Renegade was formed by drummer Luis Cardenas and the band's manager/producer Kim Richards. Deney Terrio, host of Dance Fever, introduced Renegade in what is believed to be their first national television appearance as being from \"Whittier, California\". The band members were unusual in being ethnic Hispanics playing rock music, and this proved to be a barrier for Renegade during their early years. Manager Richards, a music industry veteran, was unable to get the band booked at local Los Angeles clubs as a result of their skin color and a perception that a group of \"Mexicans\" would bring in spray cans and knives. He told Performance magazine:\n",
      "\"here used to be a place called Flippers Roller Disco in West Hollywood that booked bands and had a lot of industry people hanging out. I played Renegade's demo tape for the booker, and he said, 'great, sure, your guys are booked for next Wednesday. Got a picture? \"Well, I gave him a group photo and he looks at it and says, 'Oh ... Latino, huh? Let me just check the book here a second. Oh, I made a mistake, we already had a booking for that night  .. sorry.' \"I said cut the jive. I know what's happening. He finally admitted he didn't want the spray paint and knife carriers coming in to see the group. I was truly surprised by this, especially in this so-called enlightened age. I found that another very key club owner in town had the same attitude about us. But this increased my determination to make Renegade work. If they didn't make it, it wasn't going to be because of discrimination..\" said  Richards. He finally went to Bill Gazzarri, a longtime friend of Richards and owner of a teen dance club that helped establish \"video go-go dancing\" in the 60's on the Sunset Strip. \"I said Bill, you're the only one left. I want this band booked. Bill said, 'You can put em on every Wednesday night. This is my joint, and I do what I want with it.'\" Said Richards ... \"They  SRO business  every Wednesday night ... Suddenly, that big club owner who'd turned me down contacted me about booking the band. I decided if Renegade was to play a club that turned the group down when we needed the club, the group was going to get 100 percent of the door plus 20 percent of the bar. I eventually got 100 percent of the door and 10 percent of the bar.\n"
   ],
   "infobox": {
      "Origin": [
         "Whittier, California, United States"
      ],
      "Genres": [
         "Rock, rock and roll, glam metal, Latin rock"
      ],
      "Years active": [
         "1983–present"
      ],
      "Labels": [
         "Allied Artists Music Group, Columbia, Warner Bros., Capitol"
      ],
      "Website": [
         "renegadeusa.com"
      ],
      "Members": [
         "Luis Cardenas",
         "Kenny Marquez",
         "Tony De La Rosa"
      ],
      "Past members": [
         "Daryl Sanchez",
         "Steve Mercado",
         "Danny David Flores"
      ]
   }
}