{
   "Name": "Renegade (band)",
   "Sections": [
      "1 Background",
      "2 Success (1985–1990)",
      "3 Reformation and current activities (2000 to present)",
      "4 Luis Cardenas solo projects",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Renegade is an American rock n' roll band composed of Luis Cardenas, Kenny Marquez and Tony De La Rosa. Although all the band members hail from the United States, the band were among the most successful Hispanic or \"Chicano rock\" acts founded in the United States during the 1980s. Throughout Latin America, the band is known as Los Renegados.\n"
      ]
   },
   "Background": {
      "text": [
         "Renegade was formed by drummer Luis Cardenas and the band's manager/producer Kim Richards.[1] Deney Terrio, host of Dance Fever, introduced Renegade in what is believed to be their first national television appearance as being from \"Whittier, California\". The band members were unusual in being ethnic Hispanics playing rock music, and this proved to be a barrier for Renegade during their early years.[2] Manager Richards, a music industry veteran, was unable to get the band booked at local Los Angeles clubs as a result of their skin color and a perception that a group of \"Mexicans\" would bring in spray cans and knives. He told Performance magazine:\n",
         "\"[T]here used to be a place called Flippers Roller Disco in West Hollywood that booked bands and had a lot of industry people hanging out. I played Renegade's demo tape for the booker, and he said, 'great, sure, your guys are booked for next Wednesday. Got a picture? \"Well, I gave him a group photo and he looks at it and says, 'Oh ... Latino, huh? Let me just check the book here a second. Oh, I made a mistake, we already had a booking for that night  .. sorry.' \"I said cut the jive. I know what's happening. He finally admitted he didn't want the spray paint and knife carriers coming in to see the group. I was truly surprised by this, especially in this so-called enlightened age. I found that another very key club owner in town had the same attitude about us. But this increased my determination to make Renegade work. If they didn't make it, it wasn't going to be because of discrimination..\" said [Kim] Richards. He finally went to Bill Gazzarri, a longtime friend of Richards and owner of a teen dance club that helped establish \"video go-go dancing\" in the 60's on the Sunset Strip. \"I said Bill, you're the only one left. I want this band booked. Bill said, 'You can put em on every Wednesday night. This is my joint, and I do what I want with it.'\" Said Richards ... \"They [began doing] SRO business [with Renegade] every Wednesday night ... Suddenly, that big club owner who'd turned me down contacted me about booking the band. I decided if Renegade was to play a club that turned the group down when we needed the club, the group was going to get 100 percent of the door plus 20 percent of the bar. I eventually got 100 percent of the door and 10 percent of the bar.[3]\n",
         "Renegade's original record label wanted the band members to change their names to more \"Americanized\" names, but Richards supported their refusal, ultimately prevailing. Richards opted to go the opposite direction and promoted the band's ethnicity, persuading the then head of WEA Distribution Nesuhi Ertegün to release the band's single, \"Girls, Girls, Girls\" in Latin America. Its popularity resulted in a worldwide release of the band's first album, Rock N' Roll Crazy!. \"Los Renegados\", as the band is known throughout Latin America, became a household name based on a combination of the band's teen idol appearance and the fact they were Latin.\n"
      ]
   },
   "Success (1985–1990)": {
      "text": [
         "Renegade was the Saturday night headline attraction for the Los Angeles Street Scene Festival in both 1985 and 1986, with audiences of 150,000 in attendance.[4] The band released four albums: Rock n' Roll Crazy, Renegade II – On the Run, Nuns on Wheels and Renegade Live. The band sold well in Mexico, Canada, Japan, the United Kingdom and locally in California,[disputed  – discuss] but did not enjoy the same level of success throughout the United States as they did internationally. In the United States, Renegade was widely viewed as teen idols, appearing in Tiger Beat, 16 Magazine, Bop and on television programs, such as Dance Fever. The band played music festivals alongside bands such as 38 Special, Foreigner, Journey and Night Ranger, and was popular enough in the late 1980s to be asked by Kenny Rogers to appear on the Texas-New Mexico Border with Lionel Richie and Lee Greenwood to support Rogers' Hands Across America effort.[5] In 1990, the band was featured in a 98-minute television special aired on MTV International, entitled Renegade MTV Special.[6] The band was honored in August 2001 at a David Hasselhoff-hosted event at the Conga Room in Los Angeles for record sales in excess of 30 million units worldwide.[7][dubious  – discuss]\n"
      ]
   },
   "Reformation and current activities (2000 to present)": {
      "text": [
         "In 2001 Renegade reformed and headlined a performance at the Los Angeles Staples Center for Infinity Broadcasting shortly after the September 11 attacks to raise funds for victims.[citation needed] In 2002, the band announced another charity concert at the Hollywood House of Blues to benefit the Music Cares effort to put music back into schools. Renegade invited a number of their industry friends, such as Vivian Campbell (Def Leppard), Mike Pinera (Iron Butterfly, Blues Image and Alice Cooper) and Mick Fleetwood (Fleetwood Mac) to join them. The show was filmed and released on DVD.[8]\n",
         "In an interview with the band in April 2001 Ritmo Beat magazine described Renegade as the first Latin rock band, calling them \"Chicano rock-gods\".[9]\n"
      ]
   },
   "Luis Cardenas solo projects": {
      "text": [
         "In 1986 Cardenas held the world record for having the world's largest drumkit[10] and released a solo album entitled Animal Instinct. The album's lead single, a cover of the Del Shannon song \"Runaway\", reached number 83 on the Billboard Hot 100[11] and its video, featuring cameo appearances by Shannon and Donny Osmond,[12] was nominated for Best Music Video, Short Form at the 29th Annual Grammy Awards.[13] However, further singles and the album failed to match the success of \"Runaway\".\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Renegade is an American rock n' roll band composed of Luis Cardenas, Kenny Marquez and Tony De La Rosa. Although all the band members hail from the United States, the band were among the most successful Hispanic or \"Chicano rock\" acts founded in the United States during the 1980s. Throughout Latin America, the band is known as Los Renegados.\n",
      "Renegade was formed by drummer Luis Cardenas and the band's manager/producer Kim Richards.[1] Deney Terrio, host of Dance Fever, introduced Renegade in what is believed to be their first national television appearance as being from \"Whittier, California\". The band members were unusual in being ethnic Hispanics playing rock music, and this proved to be a barrier for Renegade during their early years.[2] Manager Richards, a music industry veteran, was unable to get the band booked at local Los Angeles clubs as a result of their skin color and a perception that a group of \"Mexicans\" would bring in spray cans and knives. He told Performance magazine:\n",
      "\"[T]here used to be a place called Flippers Roller Disco in West Hollywood that booked bands and had a lot of industry people hanging out. I played Renegade's demo tape for the booker, and he said, 'great, sure, your guys are booked for next Wednesday. Got a picture? \"Well, I gave him a group photo and he looks at it and says, 'Oh ... Latino, huh? Let me just check the book here a second. Oh, I made a mistake, we already had a booking for that night  .. sorry.' \"I said cut the jive. I know what's happening. He finally admitted he didn't want the spray paint and knife carriers coming in to see the group. I was truly surprised by this, especially in this so-called enlightened age. I found that another very key club owner in town had the same attitude about us. But this increased my determination to make Renegade work. If they didn't make it, it wasn't going to be because of discrimination..\" said [Kim] Richards. He finally went to Bill Gazzarri, a longtime friend of Richards and owner of a teen dance club that helped establish \"video go-go dancing\" in the 60's on the Sunset Strip. \"I said Bill, you're the only one left. I want this band booked. Bill said, 'You can put em on every Wednesday night. This is my joint, and I do what I want with it.'\" Said Richards ... \"They [began doing] SRO business [with Renegade] every Wednesday night ... Suddenly, that big club owner who'd turned me down contacted me about booking the band. I decided if Renegade was to play a club that turned the group down when we needed the club, the group was going to get 100 percent of the door plus 20 percent of the bar. I eventually got 100 percent of the door and 10 percent of the bar.[3]\n",
      "Renegade's original record label wanted the band members to change their names to more \"Americanized\" names, but Richards supported their refusal, ultimately prevailing. Richards opted to go the opposite direction and promoted the band's ethnicity, persuading the then head of WEA Distribution Nesuhi Ertegün to release the band's single, \"Girls, Girls, Girls\" in Latin America. Its popularity resulted in a worldwide release of the band's first album, Rock N' Roll Crazy!. \"Los Renegados\", as the band is known throughout Latin America, became a household name based on a combination of the band's teen idol appearance and the fact they were Latin.\n"
   ]
}