{
   "Name": "Rough Cutt",
   "rawData": [
      "Rough Cutt is an American heavy metal band from Los Angeles, California, United States, who released two studio albums on Warner Bros. Records in the mid-1980s.  Rough Cutt never achieved the commercial success enjoyed by many other Los Angeles bands of that time but various members went on to success in other groups, including Jake E. Lee with Ozzy Osbourne, Amir Derakh with Orgy, Paul Shortino with Quiet Riot, and Craig Goldy and Claude Schnell with Dio.\n",
      "After the end of their work with Warner Brothers, Rough Cutt signed with Virgin Records in the early 1990s. The band released its fourth studio album, Lapsed On My Own (1993), and toured steadily, playing festivals in the United States, United Kingdom, Germany.\n",
      "The current line-up of Rough Cutt, which debuted on November 29, 2019 at the Bossanova Ballroom in Portland, Oregon is drummer Dave Alford, first guitarist Chris Hager, second guitarist Darren Housholder (Shrapnel Records recording artist, Love/Hate, War & Peace), bassist Jeff Buehner (The Loyal Order), and lead vocalist Steven St. James.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Heavy metal",
         "glam metal"
      ],
      "Years active": [
         "1981–1987, 2000–2002, 2016–present"
      ],
      "Labels": [
         "Warner Bros.",
         "DeRock",
         "MusicWorks",
         "Wounded Bird",
         "Deadline"
      ],
      "Associated acts": [
         "Ratt",
         "Magic",
         "Sarge",
         "Vengeance",
         "Giuffria",
         "Orgy",
         "Julien-K",
         "Dead by Sunrise",
         "Jailhouse",
         "Quiet Riot, Woop & the Count, Dio, Warrior, Jag Wire, Ozzy Osbourne, Badlands, Aerosmith",
         "Magnitude 9",
         "Platinum Overdose",
         "Love/Hate",
         "War & Peace",
         "The Loyal Order"
      ],
      "Members": [
         "Dave Alford",
         "Chris Hager",
         "Steven St. James",
         "Jeff Buehner",
         "Darren Housholder"
      ],
      "Past members": [
         "Paul Shortino",
         "Jake E. Lee",
         "Amir Derakh",
         "Matt Thorr",
         "Craig Goldy",
         "Eddie Cantu",
         "Claude Schnell",
         "Parramore McCarty",
         "Jimmy Crespo",
         "J.T. Garrett",
         "Sean McNabb",
         "Jeff Mayer",
         "John Homan"
      ]
   }
}