{
   "Name": "Rough Cutt",
   "Sections": [
      "1 History",
      "2 Line-ups",
      "2.1 Mk. 1 (1982-1983)",
      "2.2 Mk. 2 (1983-1984)",
      "2.3 Mk. 3 (1984-1987) (2016-2019)",
      "2.4 Mk. 4 (1987)",
      "2.5 Mk. 5 (2000)",
      "2.6 Mk. 6 (2019)",
      "3 Discography",
      "3.1 Studio and live albums",
      "3.2 Compilations",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Rough Cutt is an American heavy metal band from Los Angeles, California, United States, who released two studio albums on Warner Bros. Records in the mid-1980s.[1]  Rough Cutt never achieved the commercial success enjoyed by many other Los Angeles bands of that time but various members went on to success in other groups, including Jake E. Lee with Ozzy Osbourne, Amir Derakh with Orgy, Paul Shortino with Quiet Riot, and Craig Goldy and Claude Schnell with Dio.\n",
         "After the end of their work with Warner Brothers, Rough Cutt signed with Virgin Records in the early 1990s. The band released its fourth studio album, Lapsed On My Own (1993), and toured steadily, playing festivals in the United States, United Kingdom, Germany.\n",
         "The current line-up of Rough Cutt, which debuted on November 29, 2019 at the Bossanova Ballroom in Portland, Oregon is drummer Dave Alford, first guitarist Chris Hager, second guitarist Darren Housholder (Shrapnel Records recording artist, Love/Hate, War & Peace), bassist Jeff Buehner (The Loyal Order), and lead vocalist Steven St. James.\n"
      ]
   },
   "History": {
      "text": [
         "The first Rough Cutt line-up featured vocalist Paul Shortino, drummer Dave Alford, guitarist Jake E. Lee, keyboardist Claude Schnell, and bassist Joey Cristofanilli.[1] Both Lee and Alford had also previously been in another Los Angeles band, Ratt. Both Schnell and Cristofanilli had previously been in the band Magic.[2]\n",
         "Two other former Ratt members and band mates in Sarge, guitarist Chris Hager and bassist Matt Thorne a.k.a. Matt Thorr (who replaced Cristofanilli) would also soon join Rough Cutt. After his departure, Cristofanilli temporarily joined Ratt himself, later joining forces with members of the band Sin who went on to release the album Made In Heaven under the name Jag Wire in 1985.\n",
         "Lee left Rough Cutt in 1982, auditioned for, and was hired briefly by the band Dio, and then replaced the deceased Randy Rhoads as Ozzy Osbourne's guitarist. Lee in turn was replaced by Craig Goldy, formerly of the San Diego band Vengeance.[3] Ronnie James Dio greatly influenced the development of the band. Dio's wife Wendy Dio was the group's manager, and Dio himself helped write one of the band's songs. Rough Cutt contributed two tracks, \"A Little Kindness\" and \"Used & Abused\", both produced by Dio and featuring Jake E Lee on guitar, to the compilation album L.A's Hottest Unsigned Bands, issued in 1983. Another Dio-produced track, \"Try A Little Harder\", with Goldy on guitar featured on the KLOS 95 1/2: Rock to Riches compilation, along with another Wendy Dio project NuHaven, released later on in 1983. Goldy soon left the band, and went on to play in Giuffria, and later in Dio's band. Goldy was replaced by Amir Derakh, another San Diego band alumnus.[4]\n",
         "With the line-up solidified with Shortino, Alford, Derakh, Hager, and Thorne, Rough Cutt was signed to Warner Bros. Records in 1984.[1]  The band gained national exposure when they appeared on the 'Rock Palace' TV show performing the songs \"Crank It Up\", \"Dreamin' Again\", \"Street Gang Livin'\", and \"Try A Little Harder.\"[5] Hosted by comedian Howie Mandel, the recording took place on January 1, 1984 at the Hollywood Palace, now the Avalon Hollywood. Rough Cutt also made their way to Europe showcasing at London's famed Marquee Club on April 13, 1984 and playing a badly promoted show at the Fabrik in Hamburg, Germany, both well in advance of recording their first studio album.\n",
         "After waiting around for a year to work with producer Ted Templeman, who had signed the band to Warner Bros. but was busy with David Lee Roth, Eric Clapton and Aerosmith at the time, Rough Cutt decided to record their debut album, Rough Cutt (1985), with Tom Allom instead.[6]  The band toured extensively in the United States as an opening act supporting Krokus[1] on their The Blitz tour,[7] alongside Accept,[8] followed by an extensive trek with Dio on their Sacred Heart tour,[9] which lasted from August through December 1985.[10]  Rough Cutt were also part of the Super Rock '85 festival bill on August 10, 1985 at Odaiba-Undohiroba in Odaiba, Tokyo, Japan, sharing the stage with headliners Dio, Foreigner, Mama's Boys,  Sting, and Japanese act, Earthshaker.  The show was commemorated with a VHS release titled Super Rock In Japan '85; Rough Cutt was featured with four songs from their debut album, \"Black Widow\", \"Take Her\", \"Dreamin' Again\", and \"Piece of My Heart.\"\n",
         "Veteran producer Jack Douglas of Aerosmith fame guided the band's follow-up effort Wants You! (1986).[1]  Rough Cutt joined Dio on the last date of their Sacred Heart tour at the R.C. Coliseum in San Juan, Puerto Rico on October 10, 1986 and once again made their way to Japan. While in Japan, Shortino made the decision to leave the band due to internal differences about what direction their music should take, Rough Cutt's manager Wendy Dio introduced Shortino to Quiet Riot and engineered a deal for him to step in as their new lead singer in place of Kevin DuBrow who had been fired.  Shortino was briefly replaced by Parramore McCarty of Warrior before Rough Cutt called it quits.[1] Derakh, Thorne and Alford re-grouped with singer Danny Simon and guitarist Michael Raphael to form Jailhouse, releasing a live EP, Alive in a Mad World, in 1989;[1] while Hager would team up with Jeff Warner of Black 'N Blue in Woop & the Count.  Thorne was also briefly a member of L.A. Rocks, renamed Eyes once vocalist James Christian entered the fray, while Derakh found major success with self-proclaimed death pop band Orgy in the late 1990s.\n",
         "In 1996, DeRock Records released Rough Cutt Live which contained three new studio cuts, \"House of Pain\", \"Prowler\", and \"Peyote\", as bonus tracks. The same label would also issue a full-length studio album by Rough Cutt offshoot Jailhouse in 1998, with all five songs from the 1989 Alive in a Mad World EP added as bonus tracks.\n",
         "Shortino reformed Rough Cutt in 2000 with an all-new lineup that included former Aerosmith guitarist Jimmy Crespo, keyboardist James 'J.T.' Garrett, Shortino's former Quiet Riot bandmate bassist Sean McNabb, and Magnitude 9 drummer John Homan.  The band announced the release of an EP, titled Sneak Peek, in 2000 but it was canceled and expanded into a full length-album instead.  Sacred Place was released in 2002 under the name Paul Shortino's The Cutt on Shortino's own MusicWorks Entertainment label and featured additional contributions by guitarists Brad Gillis, Carlos Cavazo, Howard Leese, and Dave Whiston as well as bassists Chuck Wright and Jason Boyleston.\n",
         "The classic Warner Bros. era line-up of Rough Cutt reformed for a one-off reunion show in October 2002 at the Viper Room in Hollywood with Shortino, Alford, Derakh, Hager, and Thorne performing together once again.[11]\n",
         "In late 2005, Wounded Bird Records re-issued both Rough Cutt Warner Bros. studio albums as a two-for-one single disc, Rough Cutt/Rough Cutt Wants You. British label Rock Candy re-issued remastered versions of both albums in 2016, complete with 16-page full color booklets, 3500 word essays about the making of the album with new band member interviews, and enhanced artwork.[12]\n",
         "In 2008, Deadline Records issued the double disc Anthology consisting of pre- and post-Warner Bros. era demos and a live set recorded in Syracuse, New York in 1985.[13]  In October 2019, 10 songs from the Fiddler's Studio Sessions portion of the Anthology were released as The Fiddler Sessions '84 on limited edition red vinyl, with only 300 copies made.\n",
         "In 2016, the classic lineup of Shortino, Alford, Derakh, Hager, and Thorne reunited again. They played on the Monsters of Rock cruise in 2018.\n",
         "2019 saw Shortino singing and playing lead guitar for Carlos Cavazo's Rough Riot and Alford and Hager began auditioning to complete the Rough Cutt line-up. After hiring vocalist Steven St. James, whom Hager had previously played with in Sarge in his pre-Rough Cutt days, the band added Buehner and then Housholder. After three rehearsals, the new Rough Cutt played its first live show as a band opening for L.A. Guns featuring Tracii Guns and Phil Lewis in Portland, Oregon at the Bossanova Ballroom on Black Friday, November 29, 2019. Rough Cutt closed its 10-song set by playing \"You Wanna Be A Star,\" a song written by Hager, St. James, and Alford. According to Alford in an interview after the performance, the song aired on an episode of the 1980s television series Fame (1982 TV series), and has not been played live by Rough Cutt since the 1980s when arena audiences of the time failed to appreciate it.[14]\n",
         "Rough Cutt is currently writing and recording new music and is in negotiations with an unnamed record label.\n",
         "Former Rough Cutt bassist Matt Thorne most recently played rhythm guitar with the band Platinum Overdose whose debut album, Murder In High Heels, was released on the Demon Doll label in August 2019.\n"
      ]
   },
   "Line-ups": {
      "Mk. 1 (1982-1983)": {},
      "Mk. 2 (1983-1984)": {},
      "Mk. 3 (1984-1987) (2016-2019)": {},
      "Mk. 4 (1987)": {},
      "Mk. 5 (2000)": {},
      "Mk. 6 (2019)": {}
   },
   "Discography": {
      "Studio and live albums": {},
      "Compilations": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Rough Cutt is an American heavy metal band from Los Angeles, California, United States, who released two studio albums on Warner Bros. Records in the mid-1980s.[1]  Rough Cutt never achieved the commercial success enjoyed by many other Los Angeles bands of that time but various members went on to success in other groups, including Jake E. Lee with Ozzy Osbourne, Amir Derakh with Orgy, Paul Shortino with Quiet Riot, and Craig Goldy and Claude Schnell with Dio.\n",
      "After the end of their work with Warner Brothers, Rough Cutt signed with Virgin Records in the early 1990s. The band released its fourth studio album, Lapsed On My Own (1993), and toured steadily, playing festivals in the United States, United Kingdom, Germany.\n",
      "The current line-up of Rough Cutt, which debuted on November 29, 2019 at the Bossanova Ballroom in Portland, Oregon is drummer Dave Alford, first guitarist Chris Hager, second guitarist Darren Housholder (Shrapnel Records recording artist, Love/Hate, War & Peace), bassist Jeff Buehner (The Loyal Order), and lead vocalist Steven St. James.\n",
      "The first Rough Cutt line-up featured vocalist Paul Shortino, drummer Dave Alford, guitarist Jake E. Lee, keyboardist Claude Schnell, and bassist Joey Cristofanilli.[1] Both Lee and Alford had also previously been in another Los Angeles band, Ratt. Both Schnell and Cristofanilli had previously been in the band Magic.[2]\n"
   ]
}