{
   "Name": "Saccharine Trust",
   "rawData": [
      "Saccharine Trust is an American punk rock band from Los Angeles, California, formed in 1980 by singer Jack Brewer and guitarist Joe Baiza. The band would frequently perform with SST labelmates Minutemen and Black Flag. However, Baiza described Saccharine Trust as the \"black sheep\" of the SST roster. Drummer Rob Holzman appeared on their 1981 debut Paganicons but left the band to play in Slovenly, replaced by drummer Tony Cicero. After a ten-year hiatus circa 1986 to 1996, the band re-formed and began performing around the West Coast.\n",
      "Baiza describes the band's sound as \"poetry music\" or \"mini-theater.\"\n",
      "Joe Baiza met Jack Brewer in Wilmington, California while looking for a summer job. Brewer was already in a band called The Obstacles with Marshall Mellow on guitar, William Trujillo on drums and Joe Burgos singing and playing organ. Baiza wanted to join the band so he suggested the need for a bass player and ended up taking the position. The group was initially more mainstream but Baiza slowly pushed them in a punk rock direction. One by one band members quit until finally it was just Brewer and Baiza.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Post-hardcore, punk jazz"
      ],
      "Years active": [
         "1980–1986, 1996-present[1]"
      ],
      "Labels": [
         "SST, Hazelwood"
      ],
      "Associated acts": [
         "Universal Congress Of, Unknown Instructors, Slovenly"
      ],
      "Members": [
         "Joe Baiza",
         "Jack Brewer",
         "Brian Christopherson",
         "Chris Stein"
      ],
      "Past members": [
         "Tony Cicero",
         "Richie Hass",
         "Mark Hodson",
         "Rob Holzman",
         "Bob Fitzer",
         "Earl Liberty",
         "Steve Moss",
         "Luis MadMax Maldonado",
         " Larry Salzman",
         "Ritchie Wilder"
      ]
   },
   "albums": [
      "Surviving You, Always",
      "We Became Snakes",
      "The Great One Is Dead"
   ]
}