{
   "Name": "Saccharine Trust",
   "Sections": [
      "1 History",
      "2 Legacy and influence",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Saccharine Trust is an American punk rock band from Los Angeles, California, formed in 1980 by singer Jack Brewer and guitarist Joe Baiza. The band would frequently perform with SST labelmates Minutemen and Black Flag.[2] However, Baiza described Saccharine Trust as the \"black sheep\" of the SST roster.[1] Drummer Rob Holzman appeared on their 1981 debut Paganicons but left the band to play in Slovenly, replaced by drummer Tony Cicero. After a ten-year hiatus circa 1986 to 1996, the band re-formed and began performing around the West Coast.\n",
         "Baiza describes the band's sound as \"poetry music\" or \"mini-theater.\"[3]\n"
      ]
   },
   "History": {
      "text": [
         "Joe Baiza met Jack Brewer in Wilmington, California while looking for a summer job.[1] Brewer was already in a band called The Obstacles with Marshall Mellow on guitar, William Trujillo on drums and Joe Burgos singing and playing organ.[4] Baiza wanted to join the band so he suggested the need for a bass player and ended up taking the position.[4] The group was initially more mainstream but Baiza slowly pushed them in a punk rock direction.[4] One by one band members quit until finally it was just Brewer and Baiza.[4]\n",
         "After spending almost a year attempting to put together a new lineup[1] which included a failed audition by Mike Watt,[5] Saccharine Trust played their first gig in 1980 with Minutemen.[1] The lineup consisted of Baiza on guitar, Brewer on vocals, Luis Maldonado on bass, and Richie Wilder on drums.[5] The band's name came from a line in the David Bowie song \"The Bewlay Brothers\" on Hunky Dory.[5]\n",
         "Wilder left the band and joined Mood of Defiance.[6] He was replaced by Rob Holzman who heard about the open position from his friends Bruce Lossen and Tom Watson.[6] Maldonado was more interested in hardcore punk and as the band started exploring jazz he decided to leave and Earl Liberty replaced him on bass.[6]\n",
         "Soon the band was invited by members of Black Flag to play a show at the Star Theater in San Pedro.[2] Black Flag band members and SST owners Greg Ginn and Chuck Dukowski were present at the show and asked the band to record for SST. Before their debut EP Paganicons was released, Saccharine Trust appeared on Cracks in the Sidewalk a compilation album on Mike Watt's New Alliance Records label.[2]\n",
         "Joe Baiza contributed guitar to Minutemen's What Makes a Man Start Fires?[7] and Jack Brewer contributed songwriting to the Minutemen's landmark  1984 album Double Nickels on the Dime.[8]\n",
         "The band's lineup continued to change over the years and even broke up in the 1990s before being revived in 1996.[3] The reformed lineup of Baiza, Brewer, Brian Christopherson on drums and Chris Stein on bass is considered the \"best version\" by Baiza[2] and was together longer than the original version of the band.[3] In late 2018, Stein died after a two-year battle with cancer.[9]\n"
      ]
   },
   "Legacy and influence": {
      "text": [
         "In his journals, Nirvana  guitarist Kurt Cobain listed  Saccharine Trust's  Paganicons as one of his Top 50 favorite albums.[10] Buzz Osborne of The Melvins stated in the book Everybody Loves Our Town: An Oral History of Grunge that Saccharine Trust were hugely influential in terms of atmosphere.[11] Sonic Youth covered their song \"I Am Right\" on the SST compilation The Melting Plot.[12] Double bassist Damon Smith has credited the album with altering his views on punk rock, jazz, and free-form jamming.[3] Weasel Walter has described Saccharine Trust as \"true modernists\".[3]\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Saccharine Trust is an American punk rock band from Los Angeles, California, formed in 1980 by singer Jack Brewer and guitarist Joe Baiza. The band would frequently perform with SST labelmates Minutemen and Black Flag.[2] However, Baiza described Saccharine Trust as the \"black sheep\" of the SST roster.[1] Drummer Rob Holzman appeared on their 1981 debut Paganicons but left the band to play in Slovenly, replaced by drummer Tony Cicero. After a ten-year hiatus circa 1986 to 1996, the band re-formed and began performing around the West Coast.\n",
      "Baiza describes the band's sound as \"poetry music\" or \"mini-theater.\"[3]\n",
      "Joe Baiza met Jack Brewer in Wilmington, California while looking for a summer job.[1] Brewer was already in a band called The Obstacles with Marshall Mellow on guitar, William Trujillo on drums and Joe Burgos singing and playing organ.[4] Baiza wanted to join the band so he suggested the need for a bass player and ended up taking the position.[4] The group was initially more mainstream but Baiza slowly pushed them in a punk rock direction.[4] One by one band members quit until finally it was just Brewer and Baiza.[4]\n",
      "After spending almost a year attempting to put together a new lineup[1] which included a failed audition by Mike Watt,[5] Saccharine Trust played their first gig in 1980 with Minutemen.[1] The lineup consisted of Baiza on guitar, Brewer on vocals, Luis Maldonado on bass, and Richie Wilder on drums.[5] The band's name came from a line in the David Bowie song \"The Bewlay Brothers\" on Hunky Dory.[5]\n"
   ]
}