{
   "Name": "Daron Malakian and Scars on Broadway",
   "Sections": [
      "1 History",
      "1.1 Self-titled debut album (2005–2008)",
      "1.2 Hiatus, reformation, and second hiatus (2008–2018)",
      "1.3 Dictator (2018–present)",
      "2 Musical style",
      "3 Band members",
      "3.1 Current",
      "3.2 Touring members",
      "3.3 Former",
      "3.4 Former touring members",
      "4 Timeline",
      "5 Discography",
      "5.1 Studio albums",
      "5.2 Singles",
      "5.3 Music videos",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Daron Malakian and Scars on Broadway (previously known as just Scars on Broadway) is an American rock band founded by Daron Malakian of the metal band System of a Down. The band's eponymous debut album was released on July 29, 2008.\n",
         "In late 2008, the band entered a hiatus, with Malakian citing a lack of enthusiasm and \"his heart not being into touring\", as the primary reasons for the band's cessation. Despite reforming with various line-up changes in 2010 and 2012, and announcing a second album, the band ceased any further announcements by 2013. In April 2018 Malakian announced that the band would be releasing their second album titled Dictator on July 20, 2018.\n"
      ]
   },
   "History": {
      "Self-titled debut album (2005–2008)": {
         "text": [
            "In December 2005, Malakian stated in an interview that he \"could release ten solo records tomorrow.\"[2] He revealed that he has \"tons of material laying around\", as well as his plans for the future: \"After these albums, – (Mezmerize and Hypnotize) – I'm gonna go off and do something on my own, just like Serj.\"[2] Following System of a Down's hiatus in May 2006, Malakian announced his latest project — Scars on Broadway — a band which would include System of a Down drummer John Dolmayan and himself.[3][4][5] Malakian stated \"I haven't decided if I'm going to make it a revolving door of musicians or one solid band but it all revolves around my writing.\"[6]\n",
            "After Malakian and Dolmayan experimented with different musicians, for a period of nine months in 2007 the band took form and forged its sound in intense rehearsals and recording sessions under Malakian's direction at his home studio and Sunset Sound; with musicians Danny Shamoun on keyboards, Dominic Cifarelli on bass, and Franky Perez on guitar and backing vocals. The band begun recording their debut album in September 2007.[7]\n",
            "The band's website featured a countdown timer, counting down to 15:00 PST on March 28, 2008. Additionally, above the timer, in quotation marks was the phrase \"They say it's all about to end.\" When the countdown ended, the song \"They Say\" was made available on the site and their Myspace account.[8]\n",
            "Scars on Broadway played their first live show April 11, 2008, at the Whisky A Go Go in Los Angeles, CA.[9] They also played with Metallica at KFMA Day 2008 in Tucson, AZ.[10] On January 22, 2008, Scars on Broadway were announced to be performing at the Coachella Valley Music and Arts Festival on April 26, 2008.[11] They also performed at the sixteenth annual KROQ Weenie Roast.[12]\n",
            "On May 2, 2008, the band announced that their debut album, Scars on Broadway, would be released on July 28, 2008.[13][14] A week later, the band was signed to Interscope Records.[15] The first single would be the aforementioned \"They Say\", which would receive radio airplay, and be made available on Guitar Hero 5 and as a downloadable track on Rock Band.[16][17][18] The music video for the track was released on June 27.[19]\n",
            "In July, the band announced a headlining tour set for October 2008.[20] Scars on Broadway was released on July 28, 2008, to generally favorable reviews and debuted at No. 17 on the Billboard charts.[21][22] A second single, \"World Long Gone\", was released on September 8, and featured a music video directed by filmmaker Joel Schumacher.[23][24]\n"
         ]
      },
      "Hiatus, reformation, and second hiatus (2008–2018)": {
         "text": [
            "In late 2008, Malakian announced that the headlining tour to promote the album's release, which included an appearance on Jimmy Kimmel Live!, would be cancelled with no plans of rescheduling.[25] Malakian cited personal reasons as the reason behind the cancellations.[26] Malakian later cited burn-out of touring as an additional factor behind the cancellations. Interviews with both Cifarelli and Dolmayan suggested that the band was finished.[27][28] When asked later in May 2009 if the band would ever record or perform again, drummer John Dolmayan stated: \"I'm not sure, but I do miss it.\"[29]\n",
            "In August 2009, Dolmayan, Perez, Shamoun, and Cifarelli as Scars on Broadway traveled to Iraq for a USO tour across the US army bases, without Malakian.[30][31] Their setlist consisted of covers as well as a few Scars on Broadway songs. Perez stated on his Twitter that \"the Scars tunes sound amazing but they're not the same without D...\"[32] On October 31, 2009, Malakian performed with Perez, Dolmayan, and System of a Down bassist Shavo Odadjian for Odadjian's Halloween party at Roxie Theater.[33] The group performed a System of a Down song (\"Suite-Pee\"), a Scars on Broadway song (\"They Say\") as well as an untitled song.\n",
            "On April 10, 2010, the band announced their return show.[34] On May 2, Scars on Broadway played a sold out show at The Troubadour in West Hollywood.[35] The band performed all of the songs off their first album (except for \"Kill Each Other / Live Forever\"), as well as a new song \"Talkin' Shit\". They also played a cover song \"Forever My Queen\" by the band Pentagram. System of a Down bassist Shavo Odadjian accompanied and played 3rd guitar for \"Cute Machines\" and \"They Say\".\n",
            "On July 29, 2010, a new song titled \"Fucking\" was released on SoundCloud, using a special feature where users had to share the song on social media to unlock the download.[36] On August 20, 2010, Scars on Broadway played a sold out show at the Avalon in Hollywood.[37] The first 500 people in line at the concert received a free copy of the single on vinyl.[38] A music video for \"Fucking\" was later released in March 2011, using footage from the concert.[39]\n",
            "In February 2012 a preview of a new song called \"Guns Are Loaded\" was released.[40] In August, Dolmayan announced his departure, but stated the album was still scheduled for release \"in the next 3 to 4 months\".[41][42] In September 2012, an accompanying EP was announced to come out around the release of their second album as well. The band also performed at the Epicenter Festival in Irvine, Ca. with new drummer Jules Pampena.[43][44] However, Perez was not present, and later confirmed he had left the band as well.[45] Malakian later talked about the upcoming album in November 2012, mentioning new songs \"Dictator\", \"Till the End\", and \"Fuck n Kill\".[46] Malakian also noted he will perform the entirety of the new album by himself.[47]\n",
            "Despite plans for an untitled album to be out early 2013 mentioned at live shows, no new information regarding the album was given until 2018.\n"
         ]
      },
      "Dictator (2018–present)": {
         "text": [
            "On April 16, 2018, Malakian announced the lead single from the second album would be released on April 23.[48] The band was re-branded as \"Daron Malakian and Scars on Broadway\".[49] Regarding the change, Malakian stated, \"Nobody quit [the band]. When I first started Scars, I always said that it would be different line-ups from album to album. Depends on the type of direction I want to take. Different musicians work for different styles. That is partly why I added my name in front of the band's.\"[50] On April 23, 2018, Malakian released the official video of the song \"Lives\", also releasing the release date of the band's second album, titled Dictator, on July 20, 2018.[49] The song is meant to commemorate the Armenian Genocide and celebrate its survivors.[49] The \"Lives\" music video featured guitarist Orbel Babayan, bassist Niko Chantziantoniou, and drummer Roman Lomtadze, who later joined the band as touring members.[51]\n",
            "The album was recorded in 2012, with Malakian explaining the delay by saying \"Not knowing what's happening with System has kept me from putting my own stuff out. Too much time has passed, and I'm really excited to finally get some music out finally.\"[52] Malakian stated that the new album could have been System of a Down music, however members of the band couldn't agree on musical direction.[53] Malakian also confirmed that \"Gie mou\", a song originally sung by Stamatis Kokotas, was going to be in the album.[54] Additionally, he revealed that he was working with a full band for the band's third release, scheduled to begin recording in August.[53]\n"
         ]
      }
   },
   "Musical style": {
      "text": [
         "From its early days, Daron Malakian always addressed the project as just rock, and \"a lot more rock driven, although there will be some metal influences in the System of a Down style\".[55] Malakian stated, \"I think a System fan will be able to relate to the music, but there's a few different directions I want to take, whether it be a little bit more ethnic or sometimes electronic.\"[56] In a later interview, Malakian stated that the music would be influenced by classic rock acts such as David Bowie, Brian Eno, Neil Young, and Roxy Music.[57] He also stated that he shifted his songwriting from System of a Down's \"frazzled metal\" to more song-based work, which was inspired by Neil Young and David Bowie.[5] \"I don't feel we're the mosh-pit band,\" said Malakian. \"That's just where I'm comfortable as a writer right now,\" he said, hinting at the band's rock over metal music approach.[58] He also stated his intentions for the band to \"have their own identity\" from System of a Down, while still maintaining the same \"thematic and sonic territory\".[59]\n"
      ]
   },
   "Band members": {
      "Current": {},
      "Touring members": {},
      "Former": {},
      "Former touring members": {}
   },
   "Timeline": {},
   "Discography": {
      "Studio albums": {},
      "Singles": {},
      "Music videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Daron Malakian and Scars on Broadway (previously known as just Scars on Broadway) is an American rock band founded by Daron Malakian of the metal band System of a Down. The band's eponymous debut album was released on July 29, 2008.\n",
      "In late 2008, the band entered a hiatus, with Malakian citing a lack of enthusiasm and \"his heart not being into touring\", as the primary reasons for the band's cessation. Despite reforming with various line-up changes in 2010 and 2012, and announcing a second album, the band ceased any further announcements by 2013. In April 2018 Malakian announced that the band would be releasing their second album titled Dictator on July 20, 2018.\n",
      "In December 2005, Malakian stated in an interview that he \"could release ten solo records tomorrow.\"[2] He revealed that he has \"tons of material laying around\", as well as his plans for the future: \"After these albums, – (Mezmerize and Hypnotize) – I'm gonna go off and do something on my own, just like Serj.\"[2] Following System of a Down's hiatus in May 2006, Malakian announced his latest project — Scars on Broadway — a band which would include System of a Down drummer John Dolmayan and himself.[3][4][5] Malakian stated \"I haven't decided if I'm going to make it a revolving door of musicians or one solid band but it all revolves around my writing.\"[6]\n",
      "After Malakian and Dolmayan experimented with different musicians, for a period of nine months in 2007 the band took form and forged its sound in intense rehearsals and recording sessions under Malakian's direction at his home studio and Sunset Sound; with musicians Danny Shamoun on keyboards, Dominic Cifarelli on bass, and Franky Perez on guitar and backing vocals. The band begun recording their debut album in September 2007.[7]\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, US"
      ],
      "Genres": [
         "Alternative metal",
         "experimental rock"
      ],
      "Years active": [
         "2006–2009, 2010–2012, 2018–present"
      ],
      "Labels": [
         "Interscope[1]"
      ],
      "Associated acts": [
         "System of a Down, Amen, Axis of Justice, Viza, The Chronicles of Israfel, Hella, Pulse Ultra, Scum, Team Sleep, DKFXP"
      ],
      "Website": [
         "www.scarsonbroadway.com"
      ],
      "Members": [
         "Daron Malakian"
      ],
      "Past members": [
         "Dominic Cifarelli",
         "John Dolmayan",
         "Jules Pampena",
         "Franky Perez",
         "Danny Shamoun"
      ]
   }
}