{
   "Name": "The Scream (band)",
   "rawData": [
      "The Scream was an American, Los Angeles, California-based hard rock band, originally formed in 1989 as Saints Or Sinners. The band originally featured former Angora singer John Corabi and former Racer X members guitarist Bruce Bouillet, bassist Juan Alderete, and drummer Scott Travis. However, Scott Travis quickly left to join Judas Priest, and was replaced by former Shark Island drummer Walt Woodward III. Scott Travis co-wrote \"I Don't Care\" on Let It Scream, though he did not actually play on the album.\n",
      "They changed their name from Saints Or Sinners to The Scream shortly after Walt Woodward III replaced Scott Travis. Many of the songs on their 1991 debut Let It Scream were performed by the band in concert before the album was ever recorded.\n",
      "After releasing their 1991 debut Let It Scream on Hollywood Records, which included the single \"I Believe in Me,\" Corabi left the band to replace the recently departed Vince Neil in Mötley Crüe.  The Scream then recruited former Dashboard Mary singer Billy Fogarty and recorded their second album, Takin' It To The Next Level, but were dropped from the record label before the album could be released. The Scream split up and Fogarty, Bouillet and Alderete went on to form a brief musical project with John Moore and drummer Abe Laboriel, Jr. called DC-10, which recorded and released the album Co-Burn.\n"
   ],
   "infobox": {
      "Also known as": [
         "Saints Or Sinners"
      ],
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Hard rock, blues rock"
      ],
      "Years active": [
         "1989–1993"
      ],
      "Labels": [
         "Hollywood Records"
      ],
      "Associated acts": [
         "Hawk, Racer X, Judas Priest, Angora, Mötley Crüe, Ratt, Union, Shark Island, Dashboard Mary, DC-10, Badlands, The Dead Daisies"
      ],
      "Past members": [
         "John Corabi",
         "Billy Fogarty",
         "Bruce Bouillet",
         "Juan Alderete",
         "Scott Travis",
         "Walt Woodward III"
      ]
   },
   "albums": [
      "Let It Scream",
      "Takin' It To The Next Level"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band, originally formed in [YEAR] as Saints Or Sinners. The band originally featured former Angora singer John Corabi and former Racer X members guitarist [PERSON_NAME_FULL_0_MALE], bassist [PERSON_NAME_FULL_1_MALE], and drummer Scott Travis. However, Scott Travis quickly left to join Judas Priest, and was replaced by former Shark Island drummer [PERSON_NAME_FULL_2_MALE]. Scott Travis co-wrote [SONG_NAME] on Let It Scream, though he did not actually play on the album.\n",
      "They changed their name from Saints Or Sinners to [BAND_NAME] shortly after Walt Woodward III replaced [PERSON_NAME_FULL_0_MALE]. Many of the songs on their [YEAR] debut Let It Scream were performed by the band in concert before the album was ever recorded.\n",
      "After releasing their [YEAR] debut Let It Scream on Hollywood Records, which included the single [SONG_NAME] Corabi left the band to replace the recently departed [PERSON_NAME_FULL_2_MALE] in Mötley Crüe.  [BAND_NAME] then recruited former Dashboard [MONTH]y singer Billy Fogarty and recorded their second album, Takin' It To The Next Level, but were dropped from the record label before the album could be released. [BAND_NAME] split up and Fogarty, Bouillet and Alderete went on to form a brief musical project with [PERSON_NAME_FULL_0_MALE] and drummer [PERSON_NAME_FULL_1_MALE], Jr. called DC-10, which recorded and released the album Co-Burn.\n"
   ]
}