{
   "Name": "Sea Wolf (band)",
   "rawData": [
      "Sea Wolf is a band led by Alex Brown Church, an indie folk musician based in Los Angeles, California.\n",
      "Church attended film school at NYU and was a founding member of  a group called Irving in 1998. Many of the songs he wrote as a member of Irving didn't fit the group's style, so Church began performing as Sea Wolf with a rotating ensemble of backing musicians, playing locally in Los Angeles and recording demos in Seattle with producer Phil Ek. Sea Wolf signed to Dangerbird Records in 2007 and released the Get To The River Before It Runs Too Low EP and a full-length titled Leaves In The River. The latter hit No. 24 on the Billboard Heatseekers chart. Church named the band after a Jack London book, saying that he identifies with the main character, a sea captain who is a \"self-taught, blue-collar intellectual guy.\"\n",
      "On September 22, 2009, Sea Wolf's second album, White Water, White Bloom was released by Dangerbird Records. The album was produced by Mike Mogis at his studio in Omaha. Sea Wolf contributed a song entitled \"Song of the Magpie\" to the audio book for Augusten Burroughs' book \"A Wolf at the Table\". Burroughs asked Sea Wolf’s Alex Brown Church to read the book and respond with an original song. Sea Wolf also wrote a song titled \"The Violet Hour\" in 2009 for the second part of the Twilight movie series, New Moon.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Indie folk,[1] indie rock, alternative rock"
      ],
      "Years active": [
         "2003–present"
      ],
      "Labels": [
         "Dangerbird Records, MapleMusic Recordings (Canada), Albert Records"
      ],
      "Associated acts": [
         "Irving"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Alex Brown Church",
         "Lisa Fendelander",
         "Joey Ficken",
         "Scott Leahy",
         "Eliot Lorango"
      ],
      "Past members": [
         "Theodore Liscinski",
         "Nathan Anderson",
         "Joyce Lee",
         "Aaron Burrows ",
         "Aaron Robinson",
         "Aniela Perry",
         "April Guthrie",
         "Byron Reynolds",
         "Jennifer Furches",
         "Peter Johansen",
         "Scott McPherson",
         "Elliot Chenault"
      ]
   },
   "albums": [
      "Get To The River Before It Runs Too Low",
      "Leaves in the River",
      "White Water, White Bloom",
      "Old World Romance",
      "Song Spells, No. 1: Cedarsmoke",
      "Through A Dark Wood (",
      ", 2020)"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] an indie folk musician based in Los Angeles, California.\n",
      "Church attended film school at NYU and was a [GENRE] a group called Irving in [YEAR]. Many of the songs he wrote as a member of Irving didn't fit the group's style, so Church began performing as [BAND_NAME] with a rotating ensemble of backing musicians, playing locally in Los Angeles and recording demos in Seattle with producer [PERSON_NAME_FULL_0_MALE]. [BAND_NAME] signed to Dangerbird Records in [YEAR] and released the Get To The River Before It Runs Too Low EP and a full-length titled Leaves In The River. The latter hit No. 24 on the Billboard Heatseekers chart. Church named the band after a Jack London book, saying that he identifies with the main character, a sea captain who is a [SONG_NAME]\n",
      "On [MONTH] 22, [YEAR], [BAND_NAME]'s second album, White Water, White Bloom was released by Dangerbird Records. The album was produced by [PERSON_NAME_FULL_0_MALE] at his studio in Omaha. [BAND_NAME] contributed a song entitled [SONG_NAME] in [YEAR] for the second part of the Twilight movie series, New Moon.\n"
   ]
}