{
   "Name": "Attitude Adjustment",
   "rawData": [
      "Attitude Adjustment is an American crossover thrash band from the San Francisco Bay Area. Their debut album, American Paranoia, is considered to be an early \"crossover\" between hardcore and thrash metal.\n",
      "The band was formed by Chris Kontos, Eric Smith and Rick Strahl in early 1985, with Nick Koljian briefly on vocals. The lineup was changed with the addition of Kevin Reed on vocals. This lineup played a number of initial shows at Ruthie's Inn, the New Method, the Mabuhay Gardens and other Bay Area venues. Several months later, Kevin Reed was replaced by Andy Andersen on vocals and Chris Scaparro joined as a second guitarist. They shortly went into the studio to record the \"Dead Serious Demo\" in 1985. The demo was recorded by Doug Piercy at the Turk Street Practice Pad.\n",
      "In 1986 and 1987, Attitude Adjustment played frequent gigs throughout California. They played alongside bands such as Forbidden (Known as Forbidden Evil at that time), Vio-lence, Sacrilege, Possessed, Hirax, Death Angel, R.K.L., Dr. Know, Suicidal Tendencies, Corrosion of Conformity, D.R.I., Discharge, UK Subs, Neurosis, The Exploited and Operation Ivy, among others. The band finally released their debut album, American Paranoia, released by Pusmort Records, is considered to be an early \"crossover\" between hardcore punk and thrash metal.\n"
   ],
   "infobox": {
      "Also known as": [
         "Condemned Attitude, Attitude"
      ],
      "Origin": [
         "Walnut Creek, California, United States"
      ],
      "Genres": [
         "Crossover thrash",
         "thrash metal",
         "hardcore punk"
      ],
      "Years active": [
         "1985–1992",
         "2007-present"
      ],
      "Labels": [
         "Pusmort Records[1]",
         "Eva-Tone",
         "A Matter of Image",
         "In Your Face Records",
         "We Bite Records",
         "Taang records",
         "Beer City Records"
      ],
      "Associated acts": [
         "Agnostic Front",
         "Death",
         "D.R.I.",
         "Condemned to Death",
         "Hirax",
         "Machine Head",
         "Testament",
         "Two Bit Thief",
         "Vio-lence"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Walter Ryan",
         "Kevin Reed",
         "Eric McIntire aka Eric \"Bobo\" Smith",
         "Ray Vegas",
         "Greg Orr"
      ],
      "Past members": [
         "Andy Andersen\n  ",
         "Paul Birnbaum\n  ",
         "Tezz Bones\n  ",
         "Eric Brecht\n  ",
         "Keith Chatham\n  ",
         "Nick Koljian\n  ",
         "Chris Kontos\n",
         "Keith Medeiros\n  ",
         "Chris Scarparo\n  ",
         "Bryon \"Yapple\" Ruelas\n  ",
         "Rick Stahl\n  ",
         "Sean Sutton\n  ",
         "Ray Vegas\n  "
      ]
   },
   "albums": [
      "Dead Serious",
      "American Paranoia",
      "The Good, The Bad, The Obnoxious (12\", as Attitude) - EP 1987",
      "No More Mr. Nice Guy",
      "Out of Hand",
      "True to the Trade - EP 1996",
      "The Collection",
      "No Way Back",
      "Terrorize"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from the San Francisco Bay Area. Their debut album, American Paranoia, is considered to be an early [SONG_NAME] between hardcore and thrash metal.\n",
      "The band was formed by [PERSON_NAME_FULL_0_MALE], Eric Smith and [PERSON_NAME_FULL_2_MALE] in early [YEAR], with Nick Koljian briefly on vocals. The lineup was changed with the addition of [PERSON_NAME_FULL_4_MALE] on vocals. This lineup played a number of initial shows at Ruthie's Inn, the New Method, the Mabuhay Gardens and other Bay Area venues. Several months later, [PERSON_NAME_FULL_4_MALE] was replaced by Andy Andersen on vocals and [PERSON_NAME_FIRST_0] [PERSON_NAME_LAST_1] joined as a second guitarist. They shortly went into the studio to record the [SONG_NAME] in [YEAR]. The demo was recorded by [PERSON_NAME_FULL_3_MALE] at the Turk Street Practice Pad.\n",
      "In [YEAR] and [YEAR], [BAND_NAME] played frequent gigs throughout California. They played alongside bands such as Forbidden (Known as Forbidden Evil at that time), Vio-lence, Sacrilege, Possessed, Hirax, Death Angel, R.K.L., Dr. Know, Suicidal Tendencies, Corrosion of Conformity, D.R.I., Discharge, UK Subs, Neurosis, The Exploited and Operation Ivy, among others. The band finally released their debut album, American Paranoia, released by Pusmort Records, is considered to be an early [SONG_NAME] between hardcore punk and thrash metal.\n"
   ]
}