{
   "Name": "She Wants Revenge",
   "rawData": [
      "She Wants Revenge was an American rock band, based in San Fernando Valley, California and formed in 2004. The group's debut album She Wants Revenge was released in early 2006, with three singles to follow (\"These Things\", a video featuring Shirley Manson from Garbage, \"Out of Control\", and \"Tear You Apart\" for which the video was directed by Joaquin Phoenix). The band has sold more than 300,000 records in the US. The band's second album, This Is Forever, was released in 2007. The group's third album, entitled Valleyheart, was released in 2011.\n",
      "The band toured extensively through 2006 with Depeche Mode and Placebo.\n",
      "In 2007, the group was featured on the track \"Time\" with Timbaland. In a recent interview, Adam Bravin told Suicide Girls that She Wants Revenge has a lot of unreleased potential b-sides, like \"Love to Sleep\", which they would like to share. Adam added that the band would like to tour with their heroes The Cure and Bauhaus and in 2011 they did tour with Peter Murphy, lead singer of Bauhaus, on his \"Ninth\" tour in the US. \nThey were released from their contract with the label Geffen/Interscope, according to a MySpace bulletin. The group formed their own label, Perfect Kiss, formerly an imprint, in 2008.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Post-punk revival[1][2]",
         "gothic rock[3][4]"
      ],
      "Years active": [
         "2004–2012",
         "2015–2020"
      ],
      "Labels": [
         "Five Seven",
         "Perfect Kiss",
         "Flawless",
         "Geffen",
         "Interscope",
         "Universal"
      ],
      "Website": [
         "shewantsrevenge.com"
      ],
      "Members": [
         "Justin Warfield",
         "Adam Bravin",
         "Thomas Froggatt",
         "Jason Payne"
      ]
   },
   "albums": [
      "The Nightmare Before Christmas Soundtrack",
      "Timbaland Presents: Shock Value"
   ]
}