{
   "Name": "Silent Civilian",
   "rawData": [
      "Silent Civilian is an American metal band originating from Los Angeles, California. Following his departure from nu metal band Spineshank in 2004, frontman Jonny Santos felt he wanted to move in a different direction musically and start from scratch. Silent Civilian was thus formed and the band faced trouble from the start after experiencing several line-up changes and departing from their original record label Corporate Punishment Records.\n",
      "The band signed with Mediaskare Records and released their debut record, Rebirth of the Temple, in 2006. Receiving generally positive reviews, the album has sold more than 25,000 copies since its release in the United States. Their line-up consists of Santos (vocals and guitar), Matt Bredemeier (guitar) and Robbie Young (bass).\n",
      "Silent Civilian released their second album, Ghost Stories, on in 2010. The band has plans to release a third studio album. As of December 2017, no new material has been released.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Metalcore, groove metal, melodic death metal"
      ],
      "Years active": [
         "2005–present"
      ],
      "Labels": [
         "Mediaskare"
      ],
      "Associated acts": [
         "Spineshank, Dualized, Temper, Bleed the Sky"
      ],
      "Members": [
         "Jonny Santos",
         "Matt Bredemeier",
         "Robbie Young",
         "Zac Morris"
      ],
      "Past members": [
         "Chris Mora",
         "Daylen Elsey",
         "Rudy \"Fyto\" Perez",
         "Tim Mankowski",
         "Ryan Ready",
         "Marcus Rafferty",
         "Henno",
         "Stan Derby",
         "Shaun Feiler",
         "Dave Delacruz",
         "Ryan Halpert"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band originating from Los Angeles, California. Following his departure from nu metal band Spineshank in [YEAR], frontman Jonny Santos felt he wanted to move in a different direction musically and start from scratch. [BAND_NAME] was thus formed and the band faced trouble from the start after experiencing several line-up changes and departing from their original record label Corporate Punishment Records.\n",
      "The band signed with Mediaskare Records and released their debut record, Rebirth of the Temple, in [YEAR]. Receiving generally positive reviews, the album has sold more than 25,000 copies since its release in the United States. Their line-up consists of Santos (vocals and guitar), Matt Bredemeier (guitar) and [PERSON_NAME_FULL_0_MALE] (bass).\n",
      "[BAND_NAME] released their second album, Ghost Stories, on in [YEAR]. The band has plans to release a third studio album. As of [MONTH] [YEAR], no new material has been released.\n"
   ]
}