{
   "Name": "Silversun Pickups",
   "rawData": [
      "Silversun Pickups is an American alternative rock band from Los Angeles that was formed in 2000. The band is composed of Brian Aubert, Nikki Monninger, Christopher Guanlao, and Joe Lester.\n",
      "The band released their debut EP, Pikul, in July 2005, and their debut album, Carnavas, on July 26, 2006. Their second album, Swoon, was released on April 14, 2009.  Neck of the Woods, the band's third album, came out on May 8, 2012. They issued their fourth album, Better Nature, on September 25, 2015. Their fifth album, Widow's Weeds, came out on June 7, 2019.\n",
      "The members of Silversun Pickups are friends who had played together previously. They began their career in Los Angeles clubs, most often at Silverlake Lounge or nearby Spaceland, and began to draw a strong following upon the release of the Pikul EP. The band originated in L.A.'s Silver Lake music scene, home of Rilo Kiley and others.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Alternative rock",
         "indie rock",
         "post-punk revival",
         "dream pop[1]",
         "shoegaze[2]"
      ],
      "Years active": [
         "2000 (2000)–present"
      ],
      "Labels": [
         "Dangerbird",
         "New Machine Recordings",
         "MapleMusic"
      ],
      "Website": [
         "silversunpickups.com"
      ],
      "Members": [
         "Brian Aubert",
         "Christopher Guanlao",
         "Joe Lester",
         "Nikki Monninger"
      ],
      "Past members": [
         "Jack Kennedy",
         "Elvira Gonzalez"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Los Angeles that was formed in [YEAR]. The band is composed of Brian Aubert, [PERSON_NAME_FULL_0_FEMALE], Christopher Guanlao, and [PERSON_NAME_FULL_1_MALE].\n",
      "The band released their debut EP, Pikul, in [MONTH] [YEAR], and their debut album, Carnavas, on [MONTH] 26, [YEAR]. Their second album, Swoon, was released on [MONTH] 14, [YEAR].  Neck of the Woods, the band's third album, came out on [MONTH] 8, [YEAR]. They issued their fourth album, Better Nature, on [MONTH] 25, [YEAR]. Their fifth album, Widow's Weeds, came out on [MONTH] 7, [YEAR].\n",
      "The members of [BAND_NAME] are friends who had played together previously. They began their career in Los Angeles clubs, most often at Silverlake Lounge or nearby Spaceland, and began to draw a [GENRE] band originated in L.A.'s Silver Lake music scene, home of Rilo Kiley and others.\n"
   ]
}