{
   "Name": "Silversun Pickups",
   "Sections": [
      "1 History",
      "1.1 Early years and Pikul EP (2000–2005)",
      "1.2 Carnavas (2006–2007)",
      "1.3 Swoon (2008–2010)",
      "1.4 Neck of the Woods (2011–2013)",
      "1.5 Better Nature (2014–2017)",
      "1.6 Widow's Weeds (2018–present)",
      "2 Musical style",
      "3 Equipment",
      "4 Band members",
      "4.1 Current members",
      "4.2 Former members",
      "4.3 Former touring members",
      "5 Discography",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Silversun Pickups is an American alternative rock band from Los Angeles that was formed in 2000. The band is composed of Brian Aubert, Nikki Monninger, Christopher Guanlao, and Joe Lester.\n",
         "The band released their debut EP, Pikul, in July 2005, and their debut album, Carnavas, on July 26, 2006. Their second album, Swoon, was released on April 14, 2009.  Neck of the Woods, the band's third album, came out on May 8, 2012. They issued their fourth album, Better Nature, on September 25, 2015. Their fifth album, Widow's Weeds, came out on June 7, 2019.\n"
      ]
   },
   "History": {
      "Early years and Pikul EP (2000–2005)": {
         "text": [
            "The members of Silversun Pickups are friends who had played together previously. They began their career in Los Angeles clubs, most often at Silverlake Lounge or nearby Spaceland, and began to draw a strong following upon the release of the Pikul EP. The band originated in L.A.'s Silver Lake music scene, home of Rilo Kiley and others.[3]\n",
            "They have been repeatedly rumored to have been originally named A Couple of Couples, as the original lineup was supposedly composed of a pair of romantically involved couples — lead guitarist and vocalist Brian Aubert was dating drummer Elvira Gonzales, while bassist Nikki Monninger was dating rhythm guitarist/record producer Jack Kennedy. However, the band has stated that this is untrue.[4] The name Silversun Pickups was derived from a liquor store located across from Silverlake Lounge. One of the friends would often arrive at the store late at night to buy liquor, making a \"Silversun Pickup\". In interviews, the band has said its name is more of \"a state of mind\".[5]\n",
            "Brian Aubert met Nikki Monninger in 1994 on a flight from Los Angeles to London. Both of them were headed to Cambridge for a school exchange program. Aubert noticed Monninger sitting across the aisle from him stealing alcohol from the drink cart by distracting the flight attendant.[6]\n",
            "For the Pikul EP, fellow Silverlaker Tanya Haden was enlisted to play cello on the track \"Kissing Families\".[7]\n"
         ]
      },
      "Carnavas (2006–2007)": {
         "text": [
            "On July 25, 2006, Silversun Pickups released their debut full-length album Carnavas. Two of the album's four singles, \"Lazy Eye\" and \"Well Thought Out Twinkles\", made the top 10 of the Billboard Modern Rock Tracks chart in 2007. \"Lazy Eye\" is also featured in the video games Rock Band 2 and Guitar Hero World Tour, one of only 13 songs to be featured in both games.[8] The songs \"Melatonin\" and \"Well Thought Out Twinkles\" are also available as downloadable content for the Rock Band series.[9] Forza Horizon, released in 2012, features \"Lazy Eye\" as a track played on \"Horizon Rocks\", one of three in-game radio stations.\n",
            "The band finished a three-week tour opening for Wolfmother on December 9, 2006, and later toured with OK Go and Snow Patrol on their U.S. spring tour, which ended on April 10, 2007. They also played at the Coachella Music Festival in Indio, California, on April 27, 2007, as well as various concerts for modern rock-formatted radio stations in the US throughout the year. They also toured the UK and Ireland while Carnavas was released there on May 28, 2007. The band opened for Foo Fighters in Edinburgh and Dublin. They also opened for the Kaiser Chiefs during their European tour.\n",
            "Carnavas peaked at No. 80 on the Billboard 200 and has sold 435,000 copies since its release.[10]\n"
         ]
      },
      "Swoon (2008–2010)": {
         "text": [
            "Silversun Pickups' second album, Swoon,[11] includes 10 tracks, and instead of having a straightforward mid-tempo sound, Aubert said: \"Some songs are very quiet and delicate, [while] others are just [freaking] loud.\"[12] The album was released on April 14, 2009, to positive reviews. It debuted at No. 7, selling approximately 43,000 copies in its first week.[13]\n",
            "The first single released was \"Panic Switch\", which aired on VH1 and MTV music video shows and radio stations worldwide. \"Panic Switch\" is also featured in the video games Rock Band and Rocksmith.\n",
            "Silversun Pickups played the 2009 Voodoo Music Experience Festival over the Halloween weekend.[14] In 2009, the band performed \"Catch and Release\", \"Panic Switch\", \"Lazy Eye\", \"Well Thought Out Twinkles\", \"Growing Old is Getting Old\", and \"Kissing Families\" for MTV Unplugged.\n",
            "In early December 2009, the band was nominated in the Best New Artist category for the 52nd Grammy Awards. Their nomination drew some controversy, because the band was already moderately successful before the 2008-2009 nominating year, although this was mainly due to misunderstandings involving the selections of Best New Artist nominees.[15]\n",
            "They supported Placebo on their Winter 2009 European tour. Upon the release of Swoon, they toured with Manchester Orchestra as main support. In spring 2010, the band toured with Muse for their US tour.[16] They toured North America again in summer 2010 with Against Me! and The Henry Clay People.[17] Another tour took place with Australian rock band Birds of Tokyo in September 2010 and ended an 18-month set of shows in support of Swoon at Austin City Limits.\n"
         ]
      },
      "Neck of the Woods (2011–2013)": {
         "text": [
            "The band released a three-song 10\" vinyl single for Record Store Day's \"Back to Black Friday\" event on November 25, 2011 titled \"Seasick\".  It was composed of three previously unreleased songs: \"Seasick\", \"Broken Bottles\", and \"Ribbons and Detours\". These were songs left over from the Swoon sessions, and were not put on their third studio album. The band also contributed a cover of Bob Dylan's \"Not Dark Yet\" for the tribute album Chimes of Freedom.\n",
            "On February 7, 2012, it was announced that Silversun Pickups would be playing the main stage at the 2012 Sasquatch! Music Festival.[18] On March 7, 2012, Aubert confirmed via Twitter both the name of the album - Neck of the Woods[19] - as well as the release date - May 8, 2012.[20] Shortly afterward, the album artwork was posted to the band's Facebook account.[21] On March 25, 2012, the first single from the new album, \"Bloody Mary (Nerve Endings)\", was released. The pre-order for Neck of the Woods also started.[22]\n",
            "On May 8, 2012, Silversun Pickups' third album Neck of the Woods was released. It opened near the top of the iTunes top 100 albums and moved into the number one spot the following day.[23]  Around the same time, the band announced that they would be playing a number of high-profile summer music festivals. On May 30, 2012, the video to \"Bloody Mary (Nerve Endings)\" was released and announced on Twitter.[24]\n",
            "On July 24, 2012, the band announced plans for a North American Tour beginning in September 2012. The tour took place on the West Coast, Midwest, and western Canada, with supporting acts including School of Seven Bells and Atlas Genius.[25] In August 2012, Sarah Negahdari, singer and guitarist for The Happy Hollows, temporarily replaced Monninger for live performances while the latter was on maternity leave.\n"
         ]
      },
      "Better Nature (2014–2017)": {
         "text": [
            "On January 7, 2014, Silversun Pickups announced a compilation album entitled The Singles Collection, comprising 10 previously released songs, as well as the new track \"Cannibal\", which was also the lead single. A video for the song aired in the middle of February and the band appeared on the Jimmy Kimmel Live! show while performing in-store at Amoeba Music (Hollywood).[26] The collection was released on February 25 and appeared in regular formats as well as a box of six 7\" vinyl records that included the additional track \"Devil's Cup\".[27]\n",
            "On July 15, 2015, the band announced their next album, Better Nature.[28] It was released on September 25, 2015.\n",
            "In 2017, they featured as the one-band soundtrack to Aisha Tyler's feature film directorial debut, Axis.[29][30]\n"
         ]
      },
      "Widow's Weeds (2018–present)": {
         "text": [
            "On June 28, 2018, Silversun Pickups posted a photo from a studio session, announcing they had broken ground on recording their fifth album. Butch Vig was mentioned in the post, potentially indicating he would be producing the album.[31] Later, they posted a photo to their social media platforms from the studio with Vig, confirming his involvement.\n",
            "On April 11, 2019, the band released the video for the first single from the album, \"It Doesn't Matter Why\". The album, entitled Widow's Weeds, was released on June 7, 2019. A further two singles were released from the album: \"Freakazoid\" and \"Don't Know Yet\".\n",
            "On June 10, 2020, Silversun Pickups released a 7\" single titled \"Toy Soldiers\", a cover of the 1989 Martika song. Like Widow's Weeds, the cover was produced by Butch Vig.[32]\n"
         ]
      }
   },
   "Musical style": {
      "text": [
         "Silversun Pickups' sound on their first two albums, Carnavas and Swoon, often encompassing multiple overdubs of distorted guitars, is frequently compared to that of The Smashing Pumpkins and My Bloody Valentine.[33] Later albums Neck of the Woods and Better Nature largely dropped that aspect of the music, instead focusing on the incorporation of electronic elements.[34][35]\n"
      ]
   },
   "Equipment": {
      "text": [
         "Aubert predominantly uses a 1994 Epiphone Sheraton II (Korean reissue), 1965 Gibson Non-Reverse Firebird, (unknown year) Gibson Reverse Firebird, Gibson SG Custom, and a Gibson Midtown Custom; Ernie Ball strings; Yellow Dunlop picks; (1990s) Fender Hot Rod DeVille amplifiers; Fractal Axe-FX II XL+.[36]\n",
         "Monninger plays Gibson Thunderbirds and is seen with a Fender Precision Bass in the video for \"Well Thought Out Twinkles\".\n",
         "Guanlao mainly played Ludwig Vistalites until around the Swoon era, when he switched to an acrylic C&C kit. He also uses Istanbul cymbals.[37]\n"
      ]
   },
   "Band members": {
      "Current members": {},
      "Former members": {},
      "Former touring members": {}
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Silversun Pickups is an American alternative rock band from Los Angeles that was formed in 2000. The band is composed of Brian Aubert, Nikki Monninger, Christopher Guanlao, and Joe Lester.\n",
      "The band released their debut EP, Pikul, in July 2005, and their debut album, Carnavas, on July 26, 2006. Their second album, Swoon, was released on April 14, 2009.  Neck of the Woods, the band's third album, came out on May 8, 2012. They issued their fourth album, Better Nature, on September 25, 2015. Their fifth album, Widow's Weeds, came out on June 7, 2019.\n",
      "The members of Silversun Pickups are friends who had played together previously. They began their career in Los Angeles clubs, most often at Silverlake Lounge or nearby Spaceland, and began to draw a strong following upon the release of the Pikul EP. The band originated in L.A.'s Silver Lake music scene, home of Rilo Kiley and others.[3]\n",
      "They have been repeatedly rumored to have been originally named A Couple of Couples, as the original lineup was supposedly composed of a pair of romantically involved couples — lead guitarist and vocalist Brian Aubert was dating drummer Elvira Gonzales, while bassist Nikki Monninger was dating rhythm guitarist/record producer Jack Kennedy. However, the band has stated that this is untrue.[4] The name Silversun Pickups was derived from a liquor store located across from Silverlake Lounge. One of the friends would often arrive at the store late at night to buy liquor, making a \"Silversun Pickup\". In interviews, the band has said its name is more of \"a state of mind\".[5]\n"
   ]
}