{
   "Name": "The Skulls (American band)",
   "rawData": [
      "The Skulls were a Los Angeles punk band formed in 1976. After a short lifespan, vocalist Steven William \"Billy Bones\" Fortuna reformed the band from time to time with various differing members, however The Skulls were re-established full-time with James 'Hardslug' Harding in 2000 until 2006. In recent years the band plays a casual show here and there with the '2000-2003' lineup of Billy Bones, James Harding, Sean Antillon and Kevin Preston - full history below.\n",
      "The Skulls formed in late 1976 and are widely considered to have been one of Los Angeles's first punk rock bands. Their influences consisted of American 50s surf and punk bands such as the Ventures, Dick Dale and the del tones, Iggy and the Stooges, and the Ramones, British punk bands such as the Sex Pistols and The Vibrators. As well as pre-punk artists such as MC5 and Roxy Music. They were at the forefront of the early Los Angeles punk scene alongside infamous acts like The Screamers and The Weirdos and were a staple band at the venue The Masque, where Bruce Moreland (brother of the Skulls' then-guitarist Marc Moreland, who went on to form Wall of Voodoo) was the emcee.\n",
      "The original line up of The Skulls formed in late 1976 and consisted of Danny Death on guitar, Framin'J on bass, Victor Bissetti on Drums, and Mick \"Sten Gun\" Wallace on vocals. In the summer of 1977 they started renting a practice room at Brendan Mullen's Masque, and played at the very first parties and shows at the Masque. This line up, in fact, existed just as long as the second line up with Billy Bones, if not longer. In October 1977, the original Skulls line up split, with the musicians going on to form Death By Death with Margaret Guzman on vocals. Sten Gun decided to continue under the name the Skulls and recruited his friend Billy Bones to sing. The band's second line up consisted of Billy Bones on vocals and Marc Moreland on guitar, with bass duties being held by Bruce Moreland or Chas T. Gray and drums by Mick \"Sten Gun\" Wallace. This line up became the most recognizable due to their inclusion on the What? Records ep in 1978 and the Live From The Masque cd in 1996. The band did not tour extensively nor make many official releases. Bootlegs can be found of original recordings, but the band's studio albums were all recorded and released years later. They broke up with no apparent plans to reunite.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, USA"
      ],
      "Genres": [
         "Punk rock"
      ],
      "Years active": [
         "1976–1978, 2000–2006, 2009-Present"
      ],
      "Labels": [
         "Dr. Strange Records, Finger Records, Headline Records"
      ],
      "Members": [
         "Billy Bones",
         "James Hardslug",
         "Kevin Preston",
         "Sean Antillon"
      ],
      "Past members": [
         "Marc Moreland",
         "Chas T. Gray",
         "Bruce Moreland",
         "Mick \"Sten Gun\" Wallace",
         "Alex Gomez",
         "Matt Montalto",
         "Skot Snot",
         "Nate Shaw",
         "Andy Andersson"
      ]
   },
   "albums": []
}