{
   "Name": "The Skulls (American band)",
   "Sections": [
      "1 History",
      "1.1 The Early Years",
      "1.2 The 'New' Skulls",
      "2 Current situation",
      "3 Film",
      "3.1 Who Is Billy Bones?",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Skulls were a Los Angeles punk band formed in 1976. After a short lifespan, vocalist Steven William \"Billy Bones\" Fortuna reformed the band from time to time with various differing members, however The Skulls were re-established full-time with James 'Hardslug' Harding in 2000 until 2006. In recent years the band plays a casual show here and there with the '2000-2003' lineup of Billy Bones, James Harding, Sean Antillon and Kevin Preston - full history below.\n"
      ]
   },
   "History": {
      "The Early Years": {
         "text": [
            "The Skulls formed in late 1976 and are widely considered to have been one of Los Angeles's first punk rock bands. Their influences consisted of American 50s surf and punk bands such as the Ventures, Dick Dale and the del tones, Iggy and the Stooges, and the Ramones, British punk bands such as the Sex Pistols and The Vibrators. As well as pre-punk artists such as MC5 and Roxy Music. They were at the forefront of the early Los Angeles punk scene alongside infamous acts like The Screamers and The Weirdos and were a staple band at the venue The Masque, where Bruce Moreland (brother of the Skulls' then-guitarist Marc Moreland, who went on to form Wall of Voodoo) was the emcee.\n",
            "The original line up of The Skulls formed in late 1976 and consisted of Danny Death on guitar, Framin'J on bass, Victor Bissetti on Drums, and Mick \"Sten Gun\" Wallace on vocals. In the summer of 1977 they started renting a practice room at Brendan Mullen's Masque, and played at the very first parties and shows at the Masque. This line up, in fact, existed just as long as the second line up with Billy Bones, if not longer. In October 1977, the original Skulls line up split, with the musicians going on to form Death By Death with Margaret Guzman on vocals. Sten Gun decided to continue under the name the Skulls and recruited his friend Billy Bones to sing. The band's second line up consisted of Billy Bones on vocals and Marc Moreland on guitar, with bass duties being held by Bruce Moreland or Chas T. Gray and drums by Mick \"Sten Gun\" Wallace. This line up became the most recognizable due to their inclusion on the What? Records ep in 1978 and the Live From The Masque cd in 1996. The band did not tour extensively nor make many official releases. Bootlegs can be found of original recordings, but the band's studio albums were all recorded and released years later. They broke up with no apparent plans to reunite.\n"
         ]
      },
      "The 'New' Skulls": {
         "text": [
            "In 2000, Billy Bones was introduced to James 'Hardslug' Harding (The Adicts) by a mutual friend, Keith Miller, who had performed with Bones in the past with other projects. After discovering Hardslug was also into performing music, a 'jam' was suggested and Bones (vocals), Miller (bass) and Hardslug(drums) got together, joined by a young Kevin Preston (guitar) who attended the same school as Bones' daughter. This band practiced by covering Skulls songs among others and was to be called the DB5's, apparently after Bones' favorite automobile and interest in old James Bond movies. A few weeks later, Bones was asked to put together a version of The Skulls to perform at the 'Tribute to 77' event at The El Rey in Los Angeles, where many of the early punk bands were to perform. That line-up was to be Bones (vocals), Preston (guitar), Sean 'Geronimo' Antillon (ex Gears, Snake Charmers) (drums, who'd also played with Bones at an impromptu quasi Skulls appearance a few years before) and Keith Miller on Bass. However, Miller had to bow out at the last minute and Bones asked Hardslug if he knew anybody who could jump in. The story goes that Hardslug bought a bass, learned the songs in a week, and after just a few rehearsals, the band nailed it at the El Rey. The new version of The Skulls was born, with the DB5 project left by the wayside.\n",
            "The SKULLS’ soon released an album titled Therapy for the Shy on Dr. Strange Records containing mostly re-recorded Skulls songs written by the original members of 77, with the notable exceptions of: 'Gold and Ruby Red', a song written by Bones years earlier and subsequently rehashed, rearranged and 'punked-up' by Bones and Hardslug; 'Life Ain't So Pretty', another older composition given some Bones/Hardslug treatment and brought up to speed; 'Girlfriend, Shower, Sleep', a slice of fun by the new 4-piece; and finally an amazing cover of The Saints' 'Erotic Neurotic'. Various singles were also spawned from this release and, along with the CD and its Vinyl counterpart, all sold out fast.\n",
            "In addition, The SKULLS appeared on three separate tribute compilation CD’s released by Cleopatra Records performing covers of AC/DC, Weezer and NOFX tunes. On realizing this surge of interest, The Skulls did some soul searching, wondering if their recent offerings were valid, bearing in mind they were mostly penned by past members of the band from nearly a quarter of a century before. The decision was made to write a brand new album from the ground up, with contributions from each of the new members, either solo or as collaborations. “The Golden Age of Piracy” was recorded in Los Angeles and Seattle and released in late 2003, again on Dr. Strange Records. Garnering 5 star reviews across the board, it contained 14 completely original songs and captured the energy the band was becoming renowned for in its live performances. This solidified the band's confidence as a 'new' band in its own right, and empowered them to press on with a slew of new material. Subsequent tours of the USA (including a string of dates on the Van's Warped Tour) and two tours of Europe established a large core following. Everyone who ever saw The SKULLS was amazed at the energy they delivered. Their recorded work is true to their live sound – To prove the point, The SKULLS then released a full-length LIVE DVD/CD (directed by Bad Otis Link) in 2004 on Finger Records. Titled “Night of the Living Skulls” the DVD featured a full live set from the El Rey Theatre in Los Angeles, a sell out show cited by many as being THE punk rock event of 2003. It also contained priceless interviews with key members of the US and UK punk scenes and special features, including skateboard mayhem, hidden ‘easter eggs’ and other features.\n",
            "Just as things seemed to be going full tilt, Kevin Preston decided to quit the band to pursue a new project for which he would be front man, called Prima Donna. Almost immediately, Antillon also quit to pursue projects with The Weirdos, the Generators and other L.A. punk rock outfits with whom he'd been filling in over previous months, leaving a big void in the band just prior to another US and European tour. Both musicians left amicably and kindly made themselves available to assist in the selection and training of their replacements if required, a legacy of the tight family the four had become. Monster Matt, singer with Chicago-based skate-punk band MONSTER TRUX, took on drumming duties and relocated from Chicago to California. Guitar duties were filled by Orange County resident Skot Snot and the band embarked on the US leg of their tour, however he was subsequently replaced by L.A. musician Nate Shaw (Duane Peters & The Hunns, etc.) for the European portion. Due to Shaw's other commitments with bands and studio projects, he couldn't commit to the live performance schedule ahead, so the band finally settled with talented Swedish guitarist and studio engineer Andy Andersson who relocated to Orange County, California from Sweden. Just when it seemed that The Skulls had finally settled back down, Billy Bones suddenly announced his wish to disband, citing many reasons: he did not want to drag the SKULLS name down by having all the line up changes; it was just time to move on and do something new and different, the need to spend time with his family, and, a discomfort with the creative direction of the last configuration of The Skulls. The band went on to play three final shows and called it a day amicably in April 2006.\n"
         ]
      }
   },
   "Current situation": {
      "text": [
         "In 2008, Billy's new band The Billybones released a 7\" EP, We're Selfish, produced by Kevin Preston, and featuring Prima Donna's Aaron Minton on saxophone on a cover of Roxy Music's (Editions of You). He is currently working on a new full-length album. Band members include Billy Bones, ex-skullmate and U.S. Bombs drummer Alex Gomez, Rob Blue on bass, and Alex Mack on guitar. The Billybones began work on a new album in 2009 due for release by 2010. Monster Matt went on to drum with Orange County band The Johns and is now permanent drummer for THE COMMOTIONS. Andy Andersson and Hardslug formed a new project called Hardslug (Hardslug dropped his nickname and pledged it to the band, reverting to James Harding once more) and released a 12 song album in late 2006. Six of the songs written by Harding were to originally appear on what was to be the 3rd Skulls studio album, but, when The Skulls split, were then carried over into the new band project. While Hardslug subsequently split due to other commitments, James Harding still records material as his hobby from time to time. In July 2008, Kevin Preston joined The Foxboro Hot Tubs (featuring all the members of GREEN DAY) as 2nd guitarist. He is still pursuing his career with Prima Donna and in October 2009 Prima Donna embarked on a 39 city European tour as direct support for GREEN DAY. Sean Antillon continues to perform with many notable artists. Most recently he has been touring with Duane Peters. In September 2009 The Skulls announced plans to reunite with the 'Golden Age Four' from the 2000-2004 line-up, namely Billy, Kevin, Hardslug and Sean. The re-union show was to be at the Galaxy Theatre in Santa Ana California in November but had to be postponed until Sat January 9, 2010 due to Kevin's commitments with Prima Donna on the Green Day tour.\n",
         "2014: The Skulls announced a long-awaited reunion show to feature Billy Bones, Sean Antillon, Kevin Preston and James 'Hardslug' Harding, taking place in Burbank on November 16, 2014. Currently, The Skulls remain active in a part-time capacity, appearing once or twice a year in California.\n"
      ]
   },
   "Film": {
      "Who Is Billy Bones?": {
         "text": [
            "In 2015, the documentary film Who Is Billy Bones? premiered at the Downtown Film Festival Los Angeles.[1] The movie follows the life of Steven William \"Billy Bones\" Fortuna and details both the formation and reformation of The Skulls, as well as the band's place in the Los Angeles punk scene. Directed by filmmaker Kathy Kolla, the film also features footage of The Masque and new music from The BillyBones.[2]\n"
         ]
      }
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Skulls were a Los Angeles punk band formed in 1976. After a short lifespan, vocalist Steven William \"Billy Bones\" Fortuna reformed the band from time to time with various differing members, however The Skulls were re-established full-time with James 'Hardslug' Harding in 2000 until 2006. In recent years the band plays a casual show here and there with the '2000-2003' lineup of Billy Bones, James Harding, Sean Antillon and Kevin Preston - full history below.\n",
      "The Skulls formed in late 1976 and are widely considered to have been one of Los Angeles's first punk rock bands. Their influences consisted of American 50s surf and punk bands such as the Ventures, Dick Dale and the del tones, Iggy and the Stooges, and the Ramones, British punk bands such as the Sex Pistols and The Vibrators. As well as pre-punk artists such as MC5 and Roxy Music. They were at the forefront of the early Los Angeles punk scene alongside infamous acts like The Screamers and The Weirdos and were a staple band at the venue The Masque, where Bruce Moreland (brother of the Skulls' then-guitarist Marc Moreland, who went on to form Wall of Voodoo) was the emcee.\n",
      "The original line up of The Skulls formed in late 1976 and consisted of Danny Death on guitar, Framin'J on bass, Victor Bissetti on Drums, and Mick \"Sten Gun\" Wallace on vocals. In the summer of 1977 they started renting a practice room at Brendan Mullen's Masque, and played at the very first parties and shows at the Masque. This line up, in fact, existed just as long as the second line up with Billy Bones, if not longer. In October 1977, the original Skulls line up split, with the musicians going on to form Death By Death with Margaret Guzman on vocals. Sten Gun decided to continue under the name the Skulls and recruited his friend Billy Bones to sing. The band's second line up consisted of Billy Bones on vocals and Marc Moreland on guitar, with bass duties being held by Bruce Moreland or Chas T. Gray and drums by Mick \"Sten Gun\" Wallace. This line up became the most recognizable due to their inclusion on the What? Records ep in 1978 and the Live From The Masque cd in 1996. The band did not tour extensively nor make many official releases. Bootlegs can be found of original recordings, but the band's studio albums were all recorded and released years later. They broke up with no apparent plans to reunite.\n",
      "In 2000, Billy Bones was introduced to James 'Hardslug' Harding (The Adicts) by a mutual friend, Keith Miller, who had performed with Bones in the past with other projects. After discovering Hardslug was also into performing music, a 'jam' was suggested and Bones (vocals), Miller (bass) and Hardslug(drums) got together, joined by a young Kevin Preston (guitar) who attended the same school as Bones' daughter. This band practiced by covering Skulls songs among others and was to be called the DB5's, apparently after Bones' favorite automobile and interest in old James Bond movies. A few weeks later, Bones was asked to put together a version of The Skulls to perform at the 'Tribute to 77' event at The El Rey in Los Angeles, where many of the early punk bands were to perform. That line-up was to be Bones (vocals), Preston (guitar), Sean 'Geronimo' Antillon (ex Gears, Snake Charmers) (drums, who'd also played with Bones at an impromptu quasi Skulls appearance a few years before) and Keith Miller on Bass. However, Miller had to bow out at the last minute and Bones asked Hardslug if he knew anybody who could jump in. The story goes that Hardslug bought a bass, learned the songs in a week, and after just a few rehearsals, the band nailed it at the El Rey. The new version of The Skulls was born, with the DB5 project left by the wayside.\n"
   ]
}