{
   "Band members": {},
   "Discography": {
      "EPs": {},
      "Live albums/DVDs": {},
      "Singles": {},
      "Studio albums": {}
   },
   "External links": {},
   "Further reading": {},
   "Gallery": {
      "text": [
         "Flagstaff, AZ show 2007\n",
         "Slightly Stoopid in concert\n",
         "Bassist Kyle McDonald crowdsurfing\n",
         "New Year's Eve 2007 at the House of Blues, Anaheim, CA\n",
         "Group picture\n",
         "New Years 2014\n"
      ]
   },
   "History": {
      "Founding, early releases": {
         "text": [
            "In 1994 Slightly Stoopid was formed in Ocean Beach, California by Miles Doughty and Kyle McDonald, both childhood friends, as well as high school friend and drummer Adam Bausch. Soon after, Sublime frontman Bradley Nowell discovered the band, asking them to perform in Long Beach, California at the Foot Hill Tavern. Nowell shortly after signed them to his label Skunk Records while the members were still attending high school.[2] In 1996 the band released their first studio album, the punk-tinged Slightly $toopid[3] (featuring a guest appearance by Nowell on the song \"Prophet\" – later covered by Sublime and released on their box set, Everything Under the Sun) and 1998's surf-inspired The Longest Barrel Ride.[4]\n",
            "The group self-released 2001's Acoustic Roots: Live & Direct (a 40-minute acoustic set, captured live at San Diego 's 91X radio station) – the first for their own label, Stoopid Records,[3] before issuing 2003's Everything You Need on Surfdog Records (a musical departure for the band,[3] that sold more than 185,000 copies).\n",
            "Adam Bausch left the band shortly after recording and releasing The Longest Barrel Ride. Slightly Stoopid had fourteen drummers between Adam Bausch and their current drummer, Ryan 'RyMo' Moran. These drummers include: Kelly Vargas (of Sublime / Dissension), Dan Lancelot, Damion Ramirez (of Capitol Eye / Long Beach Shortbus), and Paul Vrieling (who is pictured in the background on the cover of the Everything You Need album.) After solidifying a new line-up with first the removal of Bausch, due to personal differences, then with the additions of Ryan 'RyMo' Moran (drums), as well as Oguer 'OG' Ocon (congas, percussion, harp, vocals), C-Money (trumpet, keyboard) and Dela (saxophone) from John Brown's Body, the band began to mix even more different musical styles on 2005's Closer to the Sun. The album featured collaborations with well-known reggae names such as Barrington Levy and Scientist. Closer to the Sun impressively debuted in the Billboard Top 200 and sold nearly 25,000 copies in its first two months of release.[5]\n",
            "A year later, Slightly Stoopid issued their first-ever electric live album, Winter Tour '05-'06 Live CD/DVD, as well as their first-ever DVD, Live in San Diego, while 2007 saw the release of the group's fifth studio effort, Chronchitis, which debuted at No. 55 on the Billboard 200, and No. 2 on the indie charts.\n"
         ]
      },
      "Live touring": {
         "text": [
            "The group has toured frequently since its inception, including appearances at arts festivals such as Coachella, Harmony, Lollapalooza, Austin City Limits, and New Orleans Jazz Fest. Additionally, the group has played sold-out shows in Australia, Japan, Guam, Portugal, Denmark, the UK, Germany, the Netherlands, and the Dominican Republic. \"Without [the fans], we'd just be playing at the bar,\" admits Kyle. \"They make it worth our while – when we go out and people are having that good of a time, the energy goes back and forth. Just a good time – we rely on each other's energy.\"\n",
            "Slightly Stoopid has played with the Dave Matthews Band, Damian \"Jr. Gong\" Marley and the Marley Brothers, Sublime, the Roots, The Expendables, Snoop Dogg, G. Love & Special Sauce, Ozomatli, Toots and the Maytals, Helva, and Pennywise, among others, as well as their first-ever sole headlining tour of amphitheaters in 2008, joined by their friends Pepper and Sly & Robbie featuring Cherine Anderson.  The band teamed up with Snoop Dogg in 2009 for the co-headlining \"Blazed & Confused Tour\" across North America.[6]\n"
         ]
      },
      "Stoopid Records, live albums": {
         "text": [
            "2008 saw the band issuing their first-ever 'odds and ends' collection, Slightly Not Stoned Enough to Eat Breakfast Yet Stoopid – the group's newest release for their growing label, Stoopid Records (which will also feature releases by other groups, including the label's first signed act, The Expendables from Santa Cruz, California). Included on Slightly Not Stoned Enough to Eat Breakfast Yet Stoopid are outtakes from both the Closer to the Sun (including tracks that were previously issued as a limited edition bonus CD) and Chronchitis sessions, as well as a bevy of new material recorded at the famed Circle House Studios in Miami, Florida, and such cover tunes as UB40's \"I Would Do For You\" and the traditional \"I Know You Rider\" (most notably covered by The Grateful Dead). Also making their first appearance on a Slightly Stoopid studio album are newly recorded renditions of the long-time live standards \"False Rhythms\" and \"Sinsemilla.\"\n",
            "On September 13, 2011, the band was invited by the Grateful Dead's Bob Weir into his state-of-the-art TRI Studios for a live webcast and in-studio performance. Utilizing the technology of their studio's Constellation sound system, Slightly Stoopid had the privilege to invite some of their close friends and family down to record Live at Roberto's TRI Studios, performing alongside Weir as well as Karl Denson, Don Carlos (musician), Ivan Neville, Ian Neville, and host Tommy Chong.[7]\n"
         ]
      },
      "Top of the World and Meanwhile...Back At The Lab (2012-Present)": {
         "text": [
            "The band's seventh studio album, Top of the World, was released on August 14, 2012.[8] The seven-piece band continues to explore a variety of styles on Top of the World, with help from some of their biggest influences and heroes including: reggae legends Barrington Levy and Don Carlos (musician) of Black Uhuru; \"unofficial 8th member\" Karl Denson of Greyboy Allstars; longtime band friend and touring partner G. Love; Fishbone frontman Angelo Moore; ex-Jurassic 5 emcee extraordinaire Chali 2na; Dumpstaphunk's Ian Neville; and hit-making singer/songwriter Angela Hunte. The album entered the Billboard 200 at a career high No. 13 as well as on Billboards Independent Albums chart at No. 3. Top of the World also debuted on Billboards Rock Albums and Alternative Albums charts with a final position of No. 4.   Following the album release, the band performed on the \"Red Bull Sound Space at KROQ\" (www.kroq.com/soundspace and www.redbullusa.com/soundspace) on August 23, followed by appearances on tastemaker indie music website Daytrotter and SiriusXM. The group also appeared on Jimmy Kimmel Live! on September 12 to play their current single, \"Top of the World.\"[9]\n",
            "Slightly Stoopid continued to tour extensively, playing 38 dates in 2014 in cities all across the US.[10] Their summer 2014 tour featured G. Love and also Bob Marley's son, Stephen Marley.\n",
            "On April 20, 2015, Slightly Stoopid announced via their social media pages and website that they intended to release a new album, entitled Meanwhile...Back At The Lab. The album was released on June 30, 2015.  The album's track list was subsequently published on iTunes.[11]\n",
            "The band's 2018 album, Everyday Life, Everyday People, topped the Billboard Reggae Albums chart.[12]\n"
         ]
      }
   },
   "Musical influences": {
      "text": [
         "The group is noted for their eclectic mix of rock, reggae, blues, hip-hop, metal and funk in their works. When the group first started out, they drew numerous influences from the likes of punk rock groups such as Sublime, Operation Ivy, Rancid, and Streetwise. Slightly Stoopid's self-titled album was released months after Brad Nowell's death in 1996 under Skunk Records. Their reggae influences stem from artists such as Yellowman, Don Carlos (musician) and Buju Banton.[13]\n",
         "The band has also experimented with hip-hop on their more recent albums.  The song \"The Otherside\" off the album Chronchitis features the late rapper Guru. They note hip hop influences NWA and Eazy-E, Wu-Tang Clan, and Gang Starr. \nKyle McDonald’s vocal style in particular references reggae legends Eek a Mouse, Pinchers, and Tenor Saw quite often.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Founding, early releases",
      "1.2 Live touring",
      "1.3 Stoopid Records, live albums",
      "1.4 Top of the World and Meanwhile...Back At The Lab (2012-Present)",
      "2 Musical influences",
      "3 Band members",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Live albums/DVDs",
      "4.3 EPs",
      "4.4 Singles",
      "5 Summer tours",
      "6 Gallery",
      "7 References",
      "8 External links",
      "9 Further reading"
   ],
   "Summary": {
      "text": [
         "Slightly Stoopid is an American band based in the Ocean Beach neighborhood of San Diego, California, who describe their music as \"a fusion of folk, rock, reggae and blues with hip-hop, funk, metal and punk.\" As a band, they have released thirteen albums (four live), with their ninth studio album entitled Everyday Life, Everyday People on July 13, 2018. The band was originally signed by Bradley Nowell from the band Sublime to his label Skunk Records while still in high school.\n"
      ]
   },
   "Summer tours": {},
   "Title": "Slightly Stoopid - Wikipedia"
}