{
   "Band members": {},
   "Discography": {
      "EPs": {},
      "Singles": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Mike Kamerman, from Marlboro, New Jersey and Sean Scanlon, from Verplanck, New York, had been playing in various bands since 2007. After relocating to Los Angeles to further their musical careers, they met Oregon natives Joe Intile and Beau Kuther. Working with producer trio Captain Cuts, the band released their debut single \"Dreaming\" online on May 16, 2013,[3] quickly reaching the #1 position on the Hype Machine, #1 on Sirius XM Alt Nation (Alt 18 Countdown), as well as reaching #23 on Billboard's Alternative Songs chart.[2] The song was released as the first single off their debut self-titled EP.\n\"Dreaming\" was featured on the FIFA 14 soundtrack. \n",
         "Smallpools made their late night television debut performing \"Dreaming\" on Jimmy Kimmel Live! on October 28th, 2013. The band and their song \"Over & Over\" were featured in a promotional video for Snapchat, introducing Snapchat Stories in October 2013. The band released their first full-length album, Lovetap!, on March 23, 2015. In support of the album, they performed their second single \"Karaoke\" live on Late Night With Seth Meyers, in March 2015.[4][5] On December 1, 2016 the band announced a new single to be released titled \"RUN WITH THE BULLS.\" The song was accompanied with a music video via Billboard.com. After parting ways with RCA Records, the band partnered with AWAL / Kobalt Music Group and released \"The Science of Letting Go\" on August 4, 2017 followed up by the \"So Social\" EP on December 7, 2018. Collectively, the two EP's have generated over 72 million streams on Spotify.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Touring",
      "3 Band members",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 EPs",
      "4.3 Singles",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Smallpools is an American indie pop band formed in 2013. The band consists of Sean Scanlon (vocals), Mike Kamerman (guitar), and Beau Kuther (drums).\n",
         "After their debut single \"Dreaming\" charted at number one on The Hype Machine, Smallpools' self-titled debut EP was released via RCA Records on July 16, 2013.[2]\n"
      ]
   },
   "Title": "Smallpools - Wikipedia",
   "Touring": {
      "text": [
         "The band made their live debut at the Brooklyn Bowl on July 13, 2013.[6] On July 15, the band began touring in support of San Cisco across 10 cities in the United States.[7] They have also supported several bands whilst touring America, including Two Door Cinema Club, Walk the Moon, Grouplove, Neon Trees, and Twenty One Pilots. On March 26, 2014, it was announced that Smallpools would perform at Lollapalooza on August 2, the second day of the three-day festival.\nOn May 8, 2015, Smallpools performed on the main stage at the Rock in Rio USA in Las Vegas, Nevada. The band has also graced the stage at Firefly Music Festival twice, gathering large eager crowds in both 2014 and 2018. In 2015 Smallpools embarked on 2 sold out headlining tours (LOVETAP! Tour & The American Love Tour) in support of their RCA debut album 'LOVETAP!'. Smallpools supported MisterWives on their 2017 'Connect the Dots' tour and in 2018 they co-headlined the 'Spring is Sprung' tour with Great Good Fine Ok. \n",
         "In 2019, Smallpools hit the road on their 'So Social' tour which included sold out nights at the 930 Club in Washington, DC, Bowery Ballroom in New York City, the Bluebird Theatre in Denver. Smallpools finished off the year supporting Third Eye Blind on their \"Screamer\" tour.\n"
      ]
   }
}