{
   "Name": "Smallpools",
   "rawData": [
      "Smallpools is an American indie pop band formed in 2013. The band consists of Sean Scanlon (vocals), Mike Kamerman (guitar), and Beau Kuther (drums).\n",
      "After their debut single \"Dreaming\" charted at number one on The Hype Machine, Smallpools' self-titled debut EP was released via RCA Records on July 16, 2013.\n",
      "Mike Kamerman, from Marlboro, New Jersey and Sean Scanlon, from Verplanck, New York, had been playing in various bands since 2007. After relocating to Los Angeles to further their musical careers, they met Oregon natives Joe Intile and Beau Kuther. Working with producer trio Captain Cuts, the band released their debut single \"Dreaming\" online on May 16, 2013, quickly reaching the #1 position on the Hype Machine, #1 on Sirius XM Alt Nation (Alt 18 Countdown), as well as reaching #23 on Billboard's Alternative Songs chart. The song was released as the first single off their debut self-titled EP.\n\"Dreaming\" was featured on the FIFA 14 soundtrack. \n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Indie pop,[1] alternative dance"
      ],
      "Years active": [
         "2013–present"
      ],
      "Labels": [
         "RCA Records"
      ],
      "Website": [
         "https://www.smallpoolsmusic.com/"
      ],
      "Members": [
         "Sean Scanlon",
         "Mike Kamerman",
         "Beau Kuther"
      ],
      "Past members": [
         "Joe Intile"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in [YEAR]. The band consists of Sean Scanlon (vocals), Mike Kamerman (guitar), and [PERSON_NAME_FULL_0_MALE] (drums).\n",
      "After their debut single \"Dreaming\" charted at number one on The Hype Machine, [BAND_NAME]' self-titled debut EP was released via RCA Records on [MONTH] 16, [YEAR].\n",
      "Mike Kamerman, from [MONTH]lboro, New Jersey and [PERSON_NAME_FULL_0_MALE], from Verplanck, New York, had been playing in various bands since [YEAR]. After relocating to Los Angeles to further their musical careers, they met Oregon natives [PERSON_NAME_FULL_1_MALE] and Beau Kuther. Working with producer trio Captain Cuts, the band released their debut single \"Dreaming\" online on [MONTH] 16, [YEAR], quickly reaching the #1 position on the Hype Machine, #1 on Sirius XM Alt Nation (Alt 18 Countdown), as well as reaching #23 on Billboard's Alternative Songs chart. The song was released as the first single off their debut self-titled EP.\n\"Dreaming\" was featured on the FIFA 14 soundtrack. \n"
   ]
}