{
   "Name": "SouthGang",
   "rawData": [
      "SouthGang was a Los Angeles-based rock band composed of lead vocalist Jesse Harte, guitarist Butch Walker, bassist Jayce Fincher, and drummer Mitch \"Slug\" McLee, active in the late 1980s and early 1990s.  The band's original name was Byte the Bullet, which was changed to SouthGang before they released their first album, Tainted Angel. They had a similar style to many of the other \"hair bands\" of the era. The band is best remembered for their 1991 single \"Tainted Angel,\" which received some MTV airplay, especially during Headbanger's Ball.\n",
      "Tainted Angel was produced by Howard Benson and Desmond Child.\n",
      "After the band's breakup in the mid-1990s, Butch Walker, Jayce Fincher, and Mitch McLee went on to form power pop band Marvelous 3, scoring a minor hit with \"Freak of the Week\" in 1998.\n"
   ],
   "infobox": {
      "Also known as": [
         "Byte the Bullet"
      ],
      "Origin": [
         "Rome, Georgia"
      ],
      "Genres": [
         "Hard rock, heavy metal, glam metal"
      ],
      "Years active": [
         "1988-1993"
      ],
      "Associated acts": [
         "Warrant",
         "Floyd's Funk Revival/The Floyds",
         "Marvelous 3",
         "Butch Walker and the Let's Go Out Tonights"
      ],
      "Past members": [
         "Jesse Harte",
         "Butch Walker",
         "Jayce Fincher",
         "Mitch McLee"
      ]
   },
   "albums": [
      "Tainted Angel",
      "Group Therapy"
   ],
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band composed of lead vocalist Jesse Harte, guitarist [PERSON_NAME_FULL_1_MALE], bassist [PERSON_NAME_FULL_0_MALE], and drummer Mitch [SONG_NAME] which received some MTV airplay, especially during Headbanger's Ball.\n",
      "Tainted Angel was produced by Howard Benson and [PERSON_NAME_FULL_0_MALE].\n",
      "After the band's breakup in the mid-[YEAR]s, Butch Walker, [PERSON_NAME_FULL_1_MALE], and [PERSON_NAME_FULL_0_MALE] went on to form power pop band [MONTH]velous 3, scoring a minor hit with [SONG_NAME] in [YEAR].\n"
   ]
}