{
   "Name": "Spindrift (band)",
   "Sections": [
      "1 Soundtrack and television",
      "2 Classic Soundtracks",
      "3 Spindrift - Ghost of the West and the Ghost Town Tour",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Spindrift is an American psychedelic rock band, created by singer-songwriter-composer-producer-actor  Kirpatrick Thomas.[1] Founded in 1992, the band originated in Newark, Delaware along with such other local bands of the period including Jake and the Stiffs, The Verge, Boy Sets Fire, Zen Guerilla and Smashing Orange. Heavily influenced by The Doors, My Bloody Valentine, Hawkwind, Bruce Haack, and Chrome, Spindrift's early stages were experimental and differed greatly from their present sound though the band's musical style is ever in a period of flux.\n",
         "In the summer of 2001, band members Kirpatrick Thomas, Joe Baluta and Zachary Hansen re-located to Los Angeles. The band re-formed to include Bobby Bones, Dave Koenig, Frankie \"Teardrop\" Emerson and Rob Campanella of The Brian Jonestown Massacre and Jason “Plucky” Anchondo of The Warlocks. Inspired by their new locale, the band began a new stylistic approach evoking the spirit of the Old West as mythologized by Western Cinema, Spaghetti Westerns in particular.\n",
         "In 2005, Kirpatrick Thomas along with filmmaker Mike Bruce began production on the psychedelic western independent feature film, The Legend Of God’s Gun,[2] inspired by the same classic Western Films that influenced their music, most often those directed by Sergio Leone and scored by Ennio Morricone.[3][4]\n",
         "During this period (2005–2009), the lineup consisted of David Koenig on rhythm guitar and harmonica, Julie Patterson on vocals, organ, and lap steel, Jason \"Plucky\" Anchondo on drums, Henry Evans on double neck bass and baritone guitar, and Kirpatrick Thomas on vocals and guitar. Tours with Dead Meadow (Kirpatrick Thomas filled in for an ailing Jason Simons on guitar during one tour), The Black Angels, and The Dandy Warhols followed until November 2009 when the band suffered a major lineup change due to tour burnout and financial difficulties.\n",
         "It was around this time that Spindrift began performing electro-acoustic shows with a more intimate, stripped down campfire atmosphere under the name of \"Bluniform\" and \"Boy Scout Jamboree\" with Koenig and Thomas taking the lead harmonies and performing tunes written by the likes of the \"singing cowboys\" such as Johnny Western, Johnny Bond, Tex Ritter, The Louvin Brothers, Frankie Laine, The Sons of the Pioneers,  and Rex Allen. Spindrift also began incorporating these songs into their regular set and on occasion, would play them live. This would prove to be a huge influence on their later years.\n",
         "In December 2009, Henry Evans and Kirpatrick Thomas began reforming and rebuilding Spindrift while rehearsing and writing new songs in the Gram Parsons death room at Joshua Tree Inn. Added were Luke Dawson (who was innkeeper at the time) on pedal steel and rhythm guitar, Sasha Vallely on vocals, organ, and Native American flute, and James Acton on autoharp, vocals, and drums. This current lineup performed at SXSW 2010, Psych Fest III, supported Black Mountain, and toured Europe for the first time with B.R.M.C. in May 2010. In December 2010 after a 7-week U.S. Tour and following a successful Kickstarter campaign, the band went in and tracked Classic Soundtracks Volume 1 at Hicksville Trailer Palace in  Joshua Tree, CA.\n"
      ]
   },
   "Soundtrack and television": {
      "text": [
         "In 2008, Spindrift contributed to the soundtrack of the feature film Hell Ride produced by Quentin Tarantino.[5][6]\n",
         "The motion picture The Legend Of God’s Gun was inspired by the Spindrift's 2002 album of the same name which was released three years prior to the making of the film.[7] The movie's soundtrack features work from that album as well as tracks by Gram Rabbit and Mike Bruce's own band the Low-flying Owls. The album, The Legend Of God's Gun, was updated and re-released in 2007. In 2009, Tee Pee Records re-released the soundtrack and the band toured the United States, opening for The Dandy Warhols who under their Beat The World record label released the Spindrift album \"The West\" Nov. 2008.\n",
         "Spindrift has also contributed to the VBS.tv VICE documentary series Coffin Joe, and the songs \"Ace Coletrain\" and \"Girlz, Booze, Gunz\" were featured in the HBO Comedy series Eastbound & Down.\"  The band has also scored a restored version of \"Tecumseh's Curse\", a film about the Curse of Tippecanoe by director J.X. Williams.\n",
         "In 2010, Spindrift went on to supply the score to Mike Bruce's next feature \"Treasure of the Black Jaguar\", an action survival story loosely based on The Treasure of the Sierra Madre (film).\n",
         "Spindrift has cited the Sergio Leone film Once Upon a Time in the West and Sam Peckinpah's \"The Wild Bunch\" as cinematic influences on the band's music and overall style.\n",
         "In 2011, Spindrift supported the soundtrack of the award-winning skiing documentary film All.I.Can by Sherpa Cinema with three songs.\n",
         "The film, Dust Up,[8] starring Amber Benson also contained a Spindrift score and was released Oct. 2012.\n",
         "In Jan 2016, the band contributed to the score and soundtrack of the film \"Diablo\" which was Directed by Lawrence Roeck and starred Scott Eastwood, Danny Glover, and Walton Goggings. As well, early that year, Cherry Red Records released the 5 disc box set title \"Still In A Dream: A History of Shoegaze 1988-1995 which featured Spindrift's first B-Side Single (originally recorded in 1992 and released by Neck Records) called \"Surround Sound\".\n"
      ]
   },
   "Classic Soundtracks": {
      "text": [
         "In Spring of 2011, Spindrift released Classic Soundtracks Volume 1 on Xemu Records. The album featured 14 theme songs to various film scores they are set to and up to 8 different directors participated in the project. The film clips, music videos, and movie trailers were all premiered on IFC and featured films by Burke Roberts, J. X. Williams, Abigail Bean, Simon Chan, and many others. The music crossed genres such as Bollywood songs, Science fiction, Exploitation films, and Film noir. The album was engineered by Ethan Allen (of Gram Rabbit) and mastered by Howie Weinberg. The band went on to tour Europe in the Spring of 2011 for 2 months supporting Black Mountain, Dead Meadow, and Kurt Vile and did a full U.S. and Canadian tour in the Fall with The Black Angels and Dead Meadow totaling over 100 live shows throughout the year.\n"
      ]
   },
   "Spindrift - Ghost of the West and the Ghost Town Tour": {
      "text": [
         "In 2012, production for the album Spindrift - Ghost of the West[9] began. The songs consisted of variations on early golden era singing cowboy tunes and originals. New styles and instrumentation were brought in such as Henry Evans playing acoustic upright bass, more trumpet, and the ever more present vocal harmonies. During the mixing with engineer Riley Bray, Kirpatrick brought forth the idea that the band should tour ghost towns, perform the songs, and document the journey. Booking, filming, and performing during the tour was a difficult process as many of the destinations were unreachable and roads and conditions were hazardous. However, the tour brought them to over twenty-one different ghost towns, including Bodie, California, Tombstone, Arizona, and Deadwood, South Dakota, and it was all tracked and filmed. Many landmarks and monuments were also reached, such as Cathedral Gorge State Park and the Sonoran Desert. The soundtrack album was released October 22, 2013, on Tee Pee Records and the feature film companion, directed by Burke Roberts, is set to follow in 2014. Directly following the Ghost Town Tour of October 2012, keyboardist-vocalist Michelle Vidal replaced Sasha Vallely due to her inability to tour from a recent back surgery. In 2013, the band toured the US with Joshua Tree desert pals Gram Rabbit, toured Europe in the spring, and once again headlined a tour around the United States in the fall in promotion of the soundtrack which included supporting the punk band X in front of a crowd of 7,500 at Pershing Square in downtown Los Angeles, California. Guitarist Thomas Bellier from Paris, France, joined the band officially in January 2014 after guesting on guitar during several tours and independent gigs. Bellier also fronts the heavy surf-middle eastern influenced band Blaak Heat and is label-mates on Tee Pee Records. Spindrift performed and screened Spindrift - Ghost of the West at Slamdance Film Festival in Park City, Utah, in January 2014.\n",
         "In 2015, even while the lineup lost longtime bass player Henry Evans, the band continued to tour and work on new recordings and soundtrack productions with older members including bass player Joe Baluta and drummer Daniel Allare rejoining the ranks. The band's Engineer, Riley Bray, briefly filled in for Mr. Evans taking over his famed signature custom made Danelectro double neck bass and baritone guitar. After Riley's second rehearsal, the double neck was stolen and a search went out to find the unique instrument. Remarkably, due to some detective work done by Riley and one specific fans relentless internet search, the instrument was recovered in a \"set up and recover\" operation which local authorities helped to set up the sting operation. Highlights from 2015 were performances at Austin's \"Levitation\" Psychedelic Rock Festival and \"Desert Stars\" festival in Yucca Valley, CA. One new member, the young, talented guitarist Becca Davidson also joined the band that year.\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Spindrift is an American psychedelic rock band, created by singer-songwriter-composer-producer-actor  Kirpatrick Thomas.[1] Founded in 1992, the band originated in Newark, Delaware along with such other local bands of the period including Jake and the Stiffs, The Verge, Boy Sets Fire, Zen Guerilla and Smashing Orange. Heavily influenced by The Doors, My Bloody Valentine, Hawkwind, Bruce Haack, and Chrome, Spindrift's early stages were experimental and differed greatly from their present sound though the band's musical style is ever in a period of flux.\n",
      "In the summer of 2001, band members Kirpatrick Thomas, Joe Baluta and Zachary Hansen re-located to Los Angeles. The band re-formed to include Bobby Bones, Dave Koenig, Frankie \"Teardrop\" Emerson and Rob Campanella of The Brian Jonestown Massacre and Jason “Plucky” Anchondo of The Warlocks. Inspired by their new locale, the band began a new stylistic approach evoking the spirit of the Old West as mythologized by Western Cinema, Spaghetti Westerns in particular.\n",
      "In 2005, Kirpatrick Thomas along with filmmaker Mike Bruce began production on the psychedelic western independent feature film, The Legend Of God’s Gun,[2] inspired by the same classic Western Films that influenced their music, most often those directed by Sergio Leone and scored by Ennio Morricone.[3][4]\n",
      "During this period (2005–2009), the lineup consisted of David Koenig on rhythm guitar and harmonica, Julie Patterson on vocals, organ, and lap steel, Jason \"Plucky\" Anchondo on drums, Henry Evans on double neck bass and baritone guitar, and Kirpatrick Thomas on vocals and guitar. Tours with Dead Meadow (Kirpatrick Thomas filled in for an ailing Jason Simons on guitar during one tour), The Black Angels, and The Dandy Warhols followed until November 2009 when the band suffered a major lineup change due to tour burnout and financial difficulties.\n"
   ]
}