{
   "Name": "Spindrift (band)",
   "rawData": [
      "Spindrift is an American psychedelic rock band, created by singer-songwriter-composer-producer-actor  Kirpatrick Thomas. Founded in 1992, the band originated in Newark, Delaware along with such other local bands of the period including Jake and the Stiffs, The Verge, Boy Sets Fire, Zen Guerilla and Smashing Orange. Heavily influenced by The Doors, My Bloody Valentine, Hawkwind, Bruce Haack, and Chrome, Spindrift's early stages were experimental and differed greatly from their present sound though the band's musical style is ever in a period of flux.\n",
      "In the summer of 2001, band members Kirpatrick Thomas, Joe Baluta and Zachary Hansen re-located to Los Angeles. The band re-formed to include Bobby Bones, Dave Koenig, Frankie \"Teardrop\" Emerson and Rob Campanella of The Brian Jonestown Massacre and Jason “Plucky” Anchondo of The Warlocks. Inspired by their new locale, the band began a new stylistic approach evoking the spirit of the Old West as mythologized by Western Cinema, Spaghetti Westerns in particular.\n",
      "In 2005, Kirpatrick Thomas along with filmmaker Mike Bruce began production on the psychedelic western independent feature film, The Legend Of God’s Gun, inspired by the same classic Western Films that influenced their music, most often those directed by Sergio Leone and scored by Ennio Morricone.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles/Delaware/California/United States"
      ],
      "Genres": [
         "Psychedelic rock, Acid Western, Soundtrack album, Black metal"
      ],
      "Years active": [
         "1994–present"
      ],
      "Labels": [
         "Vacancy Records",
         "Tee Pee Records",
         "Beat The World",
         "Xemu Records",
         "Alternative Tentacles"
      ],
      "Associated acts": [
         "Brian Jonestown Massacre",
         "The Warlocks",
         "Crooked Cowboy"
      ],
      "Website": [
         "Spindrift official website"
      ],
      "Members": [
         "Kirpatrick Thomas",
         "James Acton",
         "Daniel Allaire",
         "Joe \"Party Chango\" Baluta",
         "Bobby Bones",
         "Becca Davidson",
         "Julie Patterson"
      ],
      "Past members": [
         "Henry Evans",
         "Michelle Vidal",
         "Paul Budd",
         "Peter Van Kowenburg",
         "Chris Andrews",
         "Zachary Hansen",
         "Cameron Murray",
         "Blair Warner",
         "Jay Caddle",
         "Frankie \"Teardrop\" Emerson",
         "Dave Koenig",
         "Jason \"Plucky\" Anchondo",
         "Marcos Diablero",
         "Bill Degnan",
         "Dan Kerrigan",
         "Sasha Vallely",
         "Luke Dawson",
         "Thomas Bellier"
      ]
   },
   "albums": []
}