{
   "Discography": {
      "Compilation albums": {},
      "Singles": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "Formation, Roadrunner Records years (1996–2003)": {
         "text": [
            "Formed in February 1996, Spineshank was assembled from the remains of a previous musical endeavor called \"Basic Enigma\". That band included future Spineshank members in vocalist Jonny Santos, guitarist Mike Sarkisyan and drummer Tom Decker.\nUpon hearing Fear Factory's 1995 release Demanufacture,[citation needed] a new bassist in Robert Garcia was recruited, and with a refined musical style, Spineshank was formed.  They have cited Fear Factory as a major influence.\n",
            "The band soon befriended Fear Factory guitarist Dino Cazares, and after hearing their demo tape he offered to have them open a show for Fear Factory at a concert held at the Whiskey A-Go-Go in Los Angeles. This led to other coveted opening slots, with such popular acts as Coal Chamber, Snot, Soulfly, Sepultura and Danzig. As a result of these shows, Spineshank gathered interest from several record labels. Eventually, the band signed with Roadrunner Records, and released their debut album Strictly Diesel on September 22, 1998. Fear Factory vocalist Burton C. Bell provides vocals on the track \"Stain\". Spineshank joined Fear Factory and Kilgore on a European tour that year.\n",
            "Spineshank's second album The Height of Callousness was released on October 10, 2000. Unlike their debut album, The Height of Callousness has a strong industrial metal influence. The band was featured at Ozzfest 2001, and toured with such artists as Disturbed, Hed PE, Orgy and Mudvayne in support of the album's release. The songs \"Synthetic\" and \"New Disease\" were released as singles in 2000 and 2001, respectively.\n",
            "The band's third album Self-Destructive Pattern was released on September 9, 2003. The album's lead single \"Smothered\" was nominated for a Grammy in the category of Best Metal Performance (2004). Shortly after the album was released the band went on a European tour with Ill Nino and Chimaira. A show in the Netherlands was filmed on October 6, and was to become a DVD entitled Roadrage. However, it was never officially released.\n"
         ]
      },
      "Lineup change and hiatus (2004–2008)": {
         "text": [
            "In January 2004, it was reported that Santos had officially left Spineshank. Drummer Tommy Decker stated that the split was \"amicable\" and was mainly due to \"musical differences\".[5] A day after the news was reported, Decker vowed that the band would continue, and stated that the musical differences were due to the fact the rest of the band wanted to play heavier music than Santos.[6]\n",
            "On January 17, 2004, Spineshank launched a search for a new vocalist,[7] and on November 7, 2005, Spineshank's official website announced that they would be working with Brandon Espinoza. They also stated that they had already been working together for five months at the time, and had produced five songs. At the time, the band did not intend to continue to use the name Spineshank. Meanwhile, Santos went on to release two albums with his new band Silent Civilian.\n",
            "On July 7, 2006, Espinoza posted an update on the band's message board, and stated that they were still in the process of writing material. Then, February 7, 2008, after almost two years of silence about the band, Espinoza announced that the band had broken up due to the lack of chemistry between its members.[8] Later on, in February 2008, the band (excluding Espinoza) announced open tryouts for a new unnamed project.[9]\n"
         ]
      },
      "New music (2020)": {
         "text": [
            "In March, 2020, Spineshank released \"Infected\", a song that was originally a B-side on the Japanese release of their 2003 album Self-Destructive Pattern, to Spotify.[12]\n"
         ]
      },
      "Reunion with original lineup and disbanding (2008–2016)": {
         "text": [
            "In 2008, Spineshank reunited with Santos, and in August of that year recorded a demo. Drummer Tom Decker said of the reunion, \"First of all, you don't have to worry about us abandoning our sound; there will be plenty of electronics/loops/synths on this record. Jonny is also singing better than he ever has, so there will be a ton of singing and melody as well. This will definitely be heavier than our previous albums but it will not be all bashing. I can wholeheartedly promise you that we will not be trying to be anything we are not. This is simply going to be Spineshank five years later. There will be a few new elements but it will be undeniably us (for better or worse!!!). . . \"\n",
            "On October 3, 2011, Spineshank debuted a new song \"Murder Suicide\" via Noisecreep.[10] On June 19, 2012, the band released Anger Denial Acceptance through Century Media. After several years of silence, on February 16, 2016, Mike Sarkisyan in an online interview said that the band had completed what they had set out to do and that there were no plans to continue the band.[11]\n"
         ]
      }
   },
   "Members": {
      "Final lineup": {},
      "Former": {}
   },
   "References": {},
   "References in popular culture": {},
   "Sections": [
      "1 History",
      "1.1 Formation, Roadrunner Records years (1996–2003)",
      "1.2 Lineup change and hiatus (2004–2008)",
      "1.3 Reunion with original lineup and disbanding (2008–2016)",
      "1.4 New music (2020)",
      "2 Members",
      "2.1 Final lineup",
      "2.2 Former",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Compilation albums",
      "3.3 Singles",
      "4 References in popular culture",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Spineshank was an American nu metal band. The band has sold over 540,000 records.[citation needed] Spineshank has released four studio albums: Strictly Diesel (1998), The Height of Callousness (2000), Self-Destructive Pattern (2003), and Anger Denial Acceptance (2012).\n"
      ]
   },
   "Title": "Spineshank - Wikipedia"
}