{
   "Name": "Spineshank",
   "rawData": [
      "Spineshank was an American nu metal band. The band has sold over 540,000 records. Spineshank has released four studio albums: Strictly Diesel (1998), The Height of Callousness (2000), Self-Destructive Pattern (2003), and Anger Denial Acceptance (2012).\n",
      "Formed in February 1996, Spineshank was assembled from the remains of a previous musical endeavor called \"Basic Enigma\". That band included future Spineshank members in vocalist Jonny Santos, guitarist Mike Sarkisyan and drummer Tom Decker.\nUpon hearing Fear Factory's 1995 release Demanufacture, a new bassist in Robert Garcia was recruited, and with a refined musical style, Spineshank was formed.  They have cited Fear Factory as a major influence.\n",
      "The band soon befriended Fear Factory guitarist Dino Cazares, and after hearing their demo tape he offered to have them open a show for Fear Factory at a concert held at the Whiskey A-Go-Go in Los Angeles. This led to other coveted opening slots, with such popular acts as Coal Chamber, Snot, Soulfly, Sepultura and Danzig. As a result of these shows, Spineshank gathered interest from several record labels. Eventually, the band signed with Roadrunner Records, and released their debut album Strictly Diesel on September 22, 1998. Fear Factory vocalist Burton C. Bell provides vocals on the track \"Stain\". Spineshank joined Fear Factory and Kilgore on a European tour that year.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Nu metal[1][2]",
         "industrial metal[3]",
         "alternative metal[4]"
      ],
      "Years active": [
         "1996–2004, 2008–2016"
      ],
      "Labels": [
         "Roadrunner",
         "Century Media"
      ],
      "Associated acts": [
         "Silent Civilian",
         "Dualized",
         "Temper",
         "Basic Enigma"
      ],
      "Past members": [
         "Jonny Santos",
         "Mike Sarkisyan",
         "Robert Garcia",
         "Tommy Decker"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band. The band has sold over 540,000 records. [BAND_NAME] has released four studio albums: Strictly Diesel ([YEAR]), The Height of Callousness ([YEAR]), Self-Destructive Pattern ([YEAR]), and Anger Denial Acceptance ([YEAR]).\n",
      "Formed in [MONTH] [YEAR], [BAND_NAME] was assembled from the remains of a [GENRE] band included future [BAND_NAME] members in vocalist Jonny Santos, guitarist [PERSON_NAME_FULL_0_MALE] and drummer Tom [MONTH]ker.\nUpon hearing Fear Factory's [YEAR] release Demanufacture, a new bassist in [PERSON_NAME_FULL_1_MALE] was recruited, and with a refined musical style, [BAND_NAME] was formed.  They have cited Fear Factory as a major influence.\n",
      "The band soon befriended Fear Factory guitarist [PERSON_NAME_FIRST_1] [PERSON_NAME_LAST_0]zares, and after hearing their demo tape he offered to have them open a [GENRE] a concert held at the Whiskey A-Go-Go in Los Angeles. This led to other coveted opening slots, with such popular acts as [PERSON_NAME_LAST_0]al [PERSON_NAME_LAST_0]amber, Snot, Soulfly, [MONTH]ultura and Danzig. As a result of these shows, [BAND_NAME] gathered interest from several record labels. Eventually, the band signed with Roadrunner Records, and released their debut album Strictly Diesel on [MONTH] 22, [YEAR]. Fear Factory vocalist [PERSON_NAME_FULL_0_MALE] provides vocals on the track \"Stain\". [BAND_NAME] joined Fear Factory and Kilgore on a European tour that year.\n"
   ]
}