{
   "Name": "The Standells",
   "Sections": [
      "1 History",
      "2 Later reformations and versions of the band",
      "3 Boston connection",
      "4 Discography",
      "4.1 Albums",
      "4.1.1 Studio albums",
      "4.1.2 Live Albums",
      "4.1.3 Compilation albums",
      "4.2 Singles",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Standells are an American garage rock band from Los Angeles, California, formed in the 1960s, who have been referred to as a \"punk band of the 1960s\", and said to have inspired such groups as the Sex Pistols and Ramones.[1] They are best known for their 1966 cover of Ed Cobb's hit \"Dirty Water\", now the anthem of several Boston sports teams and is played following every Boston Red Sox and Boston Bruins home win.\n"
      ]
   },
   "History": {
      "text": [
         "The original Standells band was formed in 1962 by lead vocalist and keyboard player Larry Tamblyn (born Lawrence A. Tamblyn, February 5, 1943, in Los Angeles),[2] and guitarist Tony Valentino (born May 24, 1941,[3] aka Emilio Bellissimo), bass guitarist Jody Rich,[4]  and drummer Benny King (aka Hernandez). Tamblyn had previously been a solo performer, recording several 45 singles in the late 1950s and early 1960s including \"Dearest\", \"Patty Ann\", \"This Is The Night\", \"My Bride To Be\" and \"Destiny\" for Faro and Linda Records. He is the brother of actor Russ Tamblyn and the uncle of actor Amber Tamblyn.\n",
         "The Standells band name was created by Larry Tamblyn and Tony Valentino, [5] derived from standing around booking agents' offices trying to get work.[6]  In early 1962, drummer Benny King joined the group, and as \"the Standels\", their first major performance was in Honolulu at the Oasis Club. After several months, Rich and King departed. Tamblyn then assumed leadership of the group. He and Valentino re-formed the Standels, adding bass guitarist Gary Lane (September 18, 1938 – November 5, 2014)[7] and drummer Gary Leeds, later known as Gary Walker of The Walker Brothers. Later that year, the band lengthened its name to \"Larry Tamblyn & the Standels\". In 1963 an extra \"L\" was added, and as \"Larry Tamblyn and the Standells\" the group made its first recording \"You'll Be Mine Someday/Girl In My Heart\" for Linda Records (released in 1964).[8] In the latter part of the year, the band permanently shortened its name to \"The Standells\".[6]  After the Standells signed with Liberty in 1964, Leeds left the group, and was replaced by lead vocalist and drummer Dick Dodd.[9] Dodd was a former Mouseketeer[10] who had been the original drummer for The Bel-Airs, known for the surf rock song \"Mr. Moto\", and eventually became the singer who sang lead on all of the Standells hit songs.\n",
         "In 1964, Liberty Records released three singles and an album, The Standells in Person at P.J.s. The album was later re-issued as The Standells Live and Out of Sight.  The band also appeared on The Munsters TV show, as themselves in the episode \"Far Out Munster,\" performing \"Come On and Ringo\" and a version of The Beatles' \"I Want to Hold Your Hand\".[11]  In late 1964, they signed with Vee Jay and released two singles in 1965. Later in the year they signed with MGM for one single.\n",
         "The group appeared in several low-budget films of the 1960s, including Get Yourself a College Girl (1964) and cult classic Riot on Sunset Strip (1967). The Standells performed incidental music in the 1963 Connie Francis movie Follow the Boys, which coincidentally co-starred Larry Tamblyn's brother, Russ Tamblyn. The Standells played the part of the fictional rock group the \"Love Bugs\" on the television sitcom Bing Crosby Show in the January 18, 1965 episode \"Bugged by the Love Bugs\". In addition to appearing in the aforementioned The Munsters episode as themselves, they also appeared performing an instrumental in the background in the March 29, 1965 Ben Casey series episode, \"Three 'Lil Lambs.\" The band also performed the title song for the 1965 children's movie, Zebra in the Kitchen.\n",
         "Some reports state that early versions of the band had a relatively clean image and performed only cover songs.[11] However, early 1964 photos counter that notion, showing the Standells with long hair, making them one of the first American rock groups to adopt that style. In order to work in conservative nightclubs like P.J.'s, the group members were forced to cut their shaggy locks.[12] Like the Beatles, early rock groups did mostly cover songs in nightclubs.\n",
         "In 1965 the group – Dodd, Tamblyn, Valentino and Lane – signed with Capitol Records' label Tower, teaming up with producer Ed Cobb. Cobb wrote the group's most popular song, \"Dirty Water\", which the band recorded in late 1965. The song's references to the city of Boston are owed to Cobb's experiences with a mugger in Boston. The song also makes reference to the Boston Strangler and the dorm curfews for college women in those days.[13]\n",
         "\"Dirty Water\" reached No. 11 on the Billboard charts on June 11, 1966, No. 8 on the Cashbox charts on July 9, 1966 and No. 1 on the Record World charts.  \"Dirty Water\" was on the WLS playlist for 17 total weeks, tied only by \"California Dreamin'\" for most weeks on that playlist during the 1960s.  Though the song is credited solely to Cobb, band members Dodd, Valentino and Tamblyn have claimed substantial material-of-fact song composition copyright contributions to it as well as contributing to its arrangement.[14] Tamblyn has stated that Cobb's version was a \"standard blues song\", adding: \"We took the song with the condition that we could arrange in any way we want; we added the guitar riff into it and all of the wonderful vocal asides like, 'I'm gonna tell you a story, It's all about my town, I'm going to tell you a big fat story'...that was all written by us.\"[14]\n",
         "\nAccording to critic Richie Unterberger,[11]",
         "\" 'Dirty Water' [was] an archetypal garage rock hit with its Stones-ish riff, lecherous vocal, and combination of raunchy guitar and organ. While they never again reached the Top 40, they cut a number of strong, similar tunes in the 1966–1967 era that have belatedly been recognized as 1960s punk classics. 'Garage rock' may not have been a really accurate term for them in the first place, as the production on their best material was full and polished, with some imaginative touches of period psychedelia and pop.\"",
         " \"Dirty Water\" is listed in the Rock and Roll Hall of Fame's \"500 Songs that Shaped Rock and Roll.\"[15]\n",
         "Dodd briefly left the Standells in early 1966, and was replaced by Dewey Martin, who became a member of Buffalo Springfield. Dodd returned to the group a few months later, as the \"Dirty Water\" song began to climb the charts.[12] The band recorded additional songs for their first full studio album Dirty Water in April 1966. Another popular track on the album was \"Sometimes Good Guys Don't Wear White\", which would later be recorded by Washington, D.C. hardcore band Minor Threat, New York City punk band The Cramps, and Swedish garage band The Nomads.\n",
         "The follow-up studio album, Why Pick on Me — Sometimes Good Guys Don't Wear White, was released in November 1966 and included the single \"Why Pick on Me\", which peaked at No. 54 on the Billboard chart. Gary Lane left the Standells in 1966, and was replaced by bass guitarist Dave Burke. John Fleck (born John William Fleckenstein in Los Angeles, August 2, 1946 – October 18, 2017),[16][17] formerly of Love, soon replaced Burke in early 1967. The band's third studio album, Try It, released in October 1967, contained the song \"Riot on Sunset Strip\", which had been released earlier in 1967 to support the soundtrack for the movie of the same name. The title track \"Try It\" was later recorded by Ohio Express and Cobra Killer. Picked by Billboard magazine to be the Standells' next hit, \"Try It\" was banned by Texas radio mogul Gordon McLendon, who deemed the record to have sexually suggestive lyrics.[18] The Standells were asked by Art Linkletter to debate with McLendon on his House Party TV show in 1967. By most accounts, McLendon was handily defeated,[5][19] but, by then, most radio stations had followed McLendon's lead and would not play the record. A third single released from this album, \"Can't Help But Love You\", would be the Standells last entry into the Billboard Hot 100, reaching No. 78, while also peaking at No. 9 in the Cashbox charts.\n",
         "In 1968, Dick Dodd left the band to pursue a solo career. The Standells continued to perform with a varying line-up thereafter, briefly including guitarist Lowell George who went on to play with Little Feat.[11]\n"
      ]
   },
   "Later reformations and versions of the band": {
      "text": [
         "In the 1980s, Dodd, Tamblyn and Valentino performed at a few shows with the likes of The Fleshtones. In 1984 the Standells played at the Club Lingerie on Sunset in Los Angeles and did some Casino shows in Reno Nevada.\nIn the late 1980s, the Standells, with Tamblyn and Valentino, recorded and released an independent single featuring Tamblyn singing \"60's Band\"[6]  In 1999, the Standells, featuring Dodd, Valentino and Tamblyn, along with bass player Peter Stuart,[20] p. 1001 appeared at the Cavestomp festival in New York, and their performance was subsequently released as an album called Ban THIS!. As the title suggests, the Standells were thumbing their noses at McLendon.  In 2000, bassist Gary Lane re-joined the Standells to perform at Las Vegas Grind. Between 2004 and 2007 the band was called upon to reform to make several appearances at major Boston sporting events. In 2006 the band sued Anheuser Busch for over $1 million after the company used \"Dirty Water\" in sports-related beer commercials without permission.[21]\n",
         "After a show at the Cannery Casino and Hotel in Las Vegas in May 2009, The Standells reformed with Tamblyn and former bassist John Fleck, along with guitarist Paul Downing and veteran drummer Greg Burnham.  The group went on to make appearances at Los Angeles venues Amoeba Records, Echoplex and the Whisky a Go Go. In 2010 they toured in Europe, performing in several countries,including their first ever UK show at 229 The Venue in London on June 19th 2010.In late 2010, Downing was replaced by guitarist Adam Marsland. In 2011, the band decided to record the first new album in over 40 years. Through Kickstarter, the Standells raised money towards the cost of the album.[22] Marsland left the group shortly thereafter. He was replaced by singer/guitarist Mark Adrian, a former member of the rock group Artica. In March 2012, the Standells performed at the SXSW Festival.[23]\n",
         "In September 2012, Dick Dodd briefly rejoined the group, and they appeared at the Monterey Summer of Love \"45 Years On\" Festival that month.[24][25][26]  On August 9, 2013 they released a new album, Bump, on GRA Records.[27] Dodd did not participate in the album. In June, Dodd again departed from the Standells for personal reasons. The group (without Dodd) headlined at the Satellite Club in Los Angeles, California, August 9,[28] the Adams Ave. St. Fair, San Diego, California on September 28,[28] and at the Ponderosa Stomp in New Orleans, Louisiana, October 5, 2013.[29]\n",
         "Dick Dodd died on November 29, 2013.[30]\n",
         "The Standells completed an extensive national tour from April 27 through May 21, 2014. It was their first major U.S. tour since the 1960s.[31] The group performed in Parma, Italy, on July 5 for the Festival Beat, and returned to California for the Tiki Oasis on August 17, 2014.[32]\n",
         "Former band member, Gary Lane (Gary McMillan) died on November 5, 2014, from lung cancer aged 76.[33]\n",
         "John \"Fleck\" Fleckenstein died October 18, 2017 of complications of AML Leukemia.[34]\nHe was also a notable cinematographer.[35]\n"
      ]
   },
   "Boston connection": {
      "text": [
         "Despite the references to Boston and the Charles River in \"Dirty Water,\" the Standells are not from Massachusetts.  Tower Records producer Ed Cobb wrote the song after a visit to Boston, during which he was robbed on a bridge over the Charles River.  None of the Standells had been to Boston before the song was released.[36]\n",
         "In 1997, \"Dirty Water\" was decreed the \"official victory anthem\" of the Red Sox, and is played after every home victory won by the Boston Red Sox.[36] Also, in 1997 two Boston area music-related chain stores celebrated their joint 25th anniversary by assembling over 1500 guitarists, plus a handful of singers and drummers, to perform \"Dirty Water\" for over 76 minutes at the Hatch Shell adjacent to the Charles River.[37]  At short notice, at the invitation of the Red Sox, The Standells played \"Dirty Water\" before the second game of the 2004 World Series at Fenway Park.[38] The band played at Fenway Park again in 2005 and 2006.  In 2007, the Standells performed the National Anthem at the first game of the 2007 American League Division Series, also at Fenway Park.[39]\n",
         "In 2007, \"Dirty Water, as sung by the Standells\" was honored by official decree of The Massachusetts General Court. The song is now played not only at Red Sox games, but also those of the Boston Celtics, the Boston Bruins, and the Northeastern Huskies' hockey games. A book Love That Dirty Water: The Standells and the Improbable Red Sox Victory Anthem was published.[40]\n",
         "In April 2019, Liverpool F.C., a club in the English Premier League, began playing \"Dirty Water\" after home matches, due to the fact that the club is owned by Fenway Sports Group, the same owners as the Boston Red Sox.[41][better source needed]\n"
      ]
   },
   "Discography": {
      "Albums": {
         "Studio albums": {
            "text": [
               "Global Recording Artists (GRA13234)\n"
            ]
         },
         "Live Albums": {},
         "Compilation albums": {}
      },
      "Singles": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Standells are an American garage rock band from Los Angeles, California, formed in the 1960s, who have been referred to as a \"punk band of the 1960s\", and said to have inspired such groups as the Sex Pistols and Ramones.[1] They are best known for their 1966 cover of Ed Cobb's hit \"Dirty Water\", now the anthem of several Boston sports teams and is played following every Boston Red Sox and Boston Bruins home win.\n",
      "The original Standells band was formed in 1962 by lead vocalist and keyboard player Larry Tamblyn (born Lawrence A. Tamblyn, February 5, 1943, in Los Angeles),[2] and guitarist Tony Valentino (born May 24, 1941,[3] aka Emilio Bellissimo), bass guitarist Jody Rich,[4]  and drummer Benny King (aka Hernandez). Tamblyn had previously been a solo performer, recording several 45 singles in the late 1950s and early 1960s including \"Dearest\", \"Patty Ann\", \"This Is The Night\", \"My Bride To Be\" and \"Destiny\" for Faro and Linda Records. He is the brother of actor Russ Tamblyn and the uncle of actor Amber Tamblyn.\n",
      "The Standells band name was created by Larry Tamblyn and Tony Valentino, [5] derived from standing around booking agents' offices trying to get work.[6]  In early 1962, drummer Benny King joined the group, and as \"the Standels\", their first major performance was in Honolulu at the Oasis Club. After several months, Rich and King departed. Tamblyn then assumed leadership of the group. He and Valentino re-formed the Standels, adding bass guitarist Gary Lane (September 18, 1938 – November 5, 2014)[7] and drummer Gary Leeds, later known as Gary Walker of The Walker Brothers. Later that year, the band lengthened its name to \"Larry Tamblyn & the Standels\". In 1963 an extra \"L\" was added, and as \"Larry Tamblyn and the Standells\" the group made its first recording \"You'll Be Mine Someday/Girl In My Heart\" for Linda Records (released in 1964).[8] In the latter part of the year, the band permanently shortened its name to \"The Standells\".[6]  After the Standells signed with Liberty in 1964, Leeds left the group, and was replaced by lead vocalist and drummer Dick Dodd.[9] Dodd was a former Mouseketeer[10] who had been the original drummer for The Bel-Airs, known for the surf rock song \"Mr. Moto\", and eventually became the singer who sang lead on all of the Standells hit songs.\n",
      "In 1964, Liberty Records released three singles and an album, The Standells in Person at P.J.s. The album was later re-issued as The Standells Live and Out of Sight.  The band also appeared on The Munsters TV show, as themselves in the episode \"Far Out Munster,\" performing \"Come On and Ringo\" and a version of The Beatles' \"I Want to Hold Your Hand\".[11]  In late 1964, they signed with Vee Jay and released two singles in 1965. Later in the year they signed with MGM for one single.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Garage rock, proto-punk"
      ],
      "Years active": [
         "1962–present"
      ],
      "Associated acts": [
         "The Bel-Airs, Little Feat, The Walker Brothers, Love, Buffalo Springfield"
      ],
      "Members": [
         "Larry Tamblyn",
         "Martin Blasick",
         "Greg Burnham",
         "Mark Adrian"
      ],
      "Past members": [
         "Tony Valentino",
         "Jody Rich",
         "Dick Dodd",
         "Benny King (Benny Hernandez)",
         "Gary Lane",
         "Gary Leeds",
         "Dewey Martin",
         "Dave Burke",
         "Lowell George",
         "Paul Downing",
         "Adam Marsland",
         "John Fleck (John Fleckenstein)",
         "Bruce Michael Miller (guitar 1980s)"
      ]
   }
}