{
   "Name": "The Standells",
   "rawData": [
      "The Standells are an American garage rock band from Los Angeles, California, formed in the 1960s, who have been referred to as a \"punk band of the 1960s\", and said to have inspired such groups as the Sex Pistols and Ramones. They are best known for their 1966 cover of Ed Cobb's hit \"Dirty Water\", now the anthem of several Boston sports teams and is played following every Boston Red Sox and Boston Bruins home win.\n",
      "The original Standells band was formed in 1962 by lead vocalist and keyboard player Larry Tamblyn (born Lawrence A. Tamblyn, February 5, 1943, in Los Angeles), and guitarist Tony Valentino (born May 24, 1941, aka Emilio Bellissimo), bass guitarist Jody Rich,  and drummer Benny King (aka Hernandez). Tamblyn had previously been a solo performer, recording several 45 singles in the late 1950s and early 1960s including \"Dearest\", \"Patty Ann\", \"This Is The Night\", \"My Bride To Be\" and \"Destiny\" for Faro and Linda Records. He is the brother of actor Russ Tamblyn and the uncle of actor Amber Tamblyn.\n",
      "The Standells band name was created by Larry Tamblyn and Tony Valentino,  derived from standing around booking agents' offices trying to get work.  In early 1962, drummer Benny King joined the group, and as \"the Standels\", their first major performance was in Honolulu at the Oasis Club. After several months, Rich and King departed. Tamblyn then assumed leadership of the group. He and Valentino re-formed the Standels, adding bass guitarist Gary Lane (September 18, 1938 – November 5, 2014) and drummer Gary Leeds, later known as Gary Walker of The Walker Brothers. Later that year, the band lengthened its name to \"Larry Tamblyn & the Standels\". In 1963 an extra \"L\" was added, and as \"Larry Tamblyn and the Standells\" the group made its first recording \"You'll Be Mine Someday/Girl In My Heart\" for Linda Records (released in 1964). In the latter part of the year, the band permanently shortened its name to \"The Standells\".  After the Standells signed with Liberty in 1964, Leeds left the group, and was replaced by lead vocalist and drummer Dick Dodd. Dodd was a former Mouseketeer who had been the original drummer for The Bel-Airs, known for the surf rock song \"Mr. Moto\", and eventually became the singer who sang lead on all of the Standells hit songs.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Garage rock, proto-punk"
      ],
      "Years active": [
         "1962–present"
      ],
      "Associated acts": [
         "The Bel-Airs, Little Feat, The Walker Brothers, Love, Buffalo Springfield"
      ],
      "Members": [
         "Larry Tamblyn",
         "Martin Blasick",
         "Greg Burnham",
         "Mark Adrian"
      ],
      "Past members": [
         "Tony Valentino",
         "Jody Rich",
         "Dick Dodd",
         "Benny King (Benny Hernandez)",
         "Gary Lane",
         "Gary Leeds",
         "Dewey Martin",
         "Dave Burke",
         "Lowell George",
         "Paul Downing",
         "Adam Marsland",
         "John Fleck (John Fleckenstein)",
         "Bruce Michael Miller (guitar 1980s)"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band from Los Angeles, California, formed in the [YEAR]s, who have been referred to as a [SONG_NAME], now the anthem of several Boston sports teams and is played following every Boston Red Sox and Boston Bruins home win.\n",
      "The original Standells band was formed in [YEAR] by lead vocalist and keyboard player [PERSON_NAME_FULL_2_MALE] (born Lawrence A. [PERSON_NAME_LAST_2], [MONTH] 5, [YEAR], in Los Angeles), and guitarist [PERSON_NAME_FULL_3_MALE] (born [MONTH] 24, [YEAR], aka [PERSON_NAME_FULL_4_MALE]), bass guitarist Jody Rich,  and drummer [PERSON_NAME_FULL_0_MALE] (aka Hernandez). [PERSON_NAME_LAST_2] had previously been a solo performer, recording several 45 singles in the late [YEAR]s and early [YEAR]s including [SONG_NAME] for Faro and [PERSON_NAME_FULL_1_FEMALE]. He is the brother of actor Russ [PERSON_NAME_LAST_2] and the uncle of actor Amber [PERSON_NAME_LAST_2].\n",
      "[BAND_NAME] band name was created by [PERSON_NAME_FULL_2_MALE] and [PERSON_NAME_FULL_3_MALE],  derived from standing around booking agents' offices trying to get work.  In early [YEAR], drummer Benny King joined the group, and as [SONG_NAME], and eventually became the singer who sang lead on all of the Standells hit songs.\n"
   ]
}