{
   "Name": "Strawberry Alarm Clock",
   "rawData": [
      "Strawberry Alarm Clock is a psychedelic rock band formed in 1967 with origins in Glendale, California, a city near Los Angeles. They are best known for their 1967 hit single \"Incense and Peppermints\". Strawberry Alarm Clock, who have been also categorized as acid rock, psychedelic pop, and sunshine pop, charted five songs, including two Top 40 hits.\n",
      "A history of the band written by George Bunnell stated that \"The Strawberry Alarm Clock came about by parts of two bands, Thee Sixpence and Waterfyrd Traene, morphing into one.\" The group originally named Thee Sixpence initially consisted of Ed King (lead guitar, vocals), Michael Luciano (vocals), Lee Freeman (rhythm guitar, harmonica, vocals), Gary Lovetro (bass), Steve Rabe (guitar, vocals), and Gene Gunnels (drums). Randy Seol (drums, vibes, percussion, vocals) and Mark Weitz (keyboards, vocals) joined to replace the departing Gunnels, Rabe, and Luciano just as the name change to Strawberry Alarm Clock (SAC) was occurring. Seol eventually brought in songwriters Bunnell and Steve Bartek, who participated in the writing and recording of SAC's first album.\n",
      "The inception of Strawberry Alarm Clock aside from Thee Sixpence is not well documented, largely because none of the other band's recordings (subsequently lost) were released. However, according to Bunnell, many SAC songs came from the band he had formed previously with Seol, Bartek, Randy Zacuto, Fred Schwartz, and Criss Jay, which performed under the names Waterfyrd Traene (pre-SAC), Public Bubble (during SAC), and Buffington Rhodes (post-SAC). There were two recording sessions with some of these personnel, one with Dave Hassinger at the Recording Factory and one with Bill Lazarus at Sunset Sound. There were probably 10 songs in all that were recorded but Bunnell stated that both masters were stolen. The post-SAC incarnation broke up before any success was realized.\n"
   ],
   "infobox": {
      "Origin": [
         "Glendale, California, United States"
      ],
      "Genres": [
         "Rock",
         "pop",
         "psychedelic rock",
         "psychedelic pop",
         "sunshine pop",
         "acid rock"
      ],
      "Years active": [
         "1967–71",
         "1974–75",
         "1982–present"
      ],
      "Labels": [
         "Uni Records",
         "Global Recording Artists"
      ],
      "Associated acts": [
         "Thee Sixpence",
         "Waterfyrd Traene",
         "Hunger",
         "Buffington Roads",
         "the Nightcrawlers",
         "Lynyrd Skynyrd",
         "Oingo Boingo",
         "Spirits in the Sky"
      ],
      "Website": [
         "strawberryalarmclock.com"
      ],
      "Members": [
         "Gene Gunnels",
         "Randy Seol",
         "Mark Weitz",
         "George Bunnell",
         "Steve Bartek",
         "Howie Anderson"
      ],
      "Past members": [
         "Lee Freeman",
         "Ed King",
         "Gary Lovetro",
         "Greg Munford",
         "Marty Katon",
         "Jimmy Pitman",
         "Paul Marshall",
         "Leo Gaffney",
         "Doug Freeman",
         "Peter Wasner",
         "James Harrah",
         "Clay Bernard",
         "Bob Caloca",
         "Bruce Hubbard",
         "Jon Walmsley",
         "Glenn Brigman"
      ]
   }
}