{
   "Band members": {
      "Timeline": {}
   },
   "Career": {
      "1966–1967: Formation and early success": {
         "text": [
            "A history of the band written by George Bunnell stated that \"The Strawberry Alarm Clock came about by parts of two bands, Thee Sixpence and Waterfyrd Traene, morphing into one.\"[7] The group originally named Thee Sixpence initially consisted of Ed King (lead guitar, vocals), Michael Luciano (vocals), Lee Freeman (rhythm guitar, harmonica, vocals), Gary Lovetro (bass), Steve Rabe (guitar, vocals), and Gene Gunnels (drums). Randy Seol (drums, vibes, percussion, vocals) and Mark Weitz (keyboards, vocals) joined to replace the departing Gunnels, Rabe, and Luciano just as the name change to Strawberry Alarm Clock (SAC) was occurring. Seol eventually brought in songwriters Bunnell and Steve Bartek, who participated in the writing and recording of SAC's first album.\n",
            "The inception of Strawberry Alarm Clock aside from Thee Sixpence is not well documented, largely because none of the other band's recordings (subsequently lost) were released. However, according to Bunnell, many SAC songs came from the band he had formed previously with Seol, Bartek, Randy Zacuto, Fred Schwartz, and Criss Jay, which performed under the names Waterfyrd Traene (pre-SAC), Public Bubble (during SAC), and Buffington Rhodes (post-SAC). There were two recording sessions with some of these personnel, one with Dave Hassinger at the Recording Factory and one with Bill Lazarus at Sunset Sound. There were probably 10 songs in all that were recorded but Bunnell stated that both masters were stolen. The post-SAC incarnation broke up before any success was realized.\n",
            "The first and most famous SAC single was \"Incense and Peppermints\", produced by Frank Slay and initially released by Thee Sixpence on All American Records, owned by Bill Holmes, the band's manager and producer. The band was not impressed by songwriter John Carter's singing, so Slay chose Greg Munford, a 16-year-old friend of the band who was from another group called Shapes of Sound, to sing lead on the track.[8] The song reached No. 1 on the Billboard Hot 100 during the week ending November 25, 1967. The band made a cameo appearance performing the song in the Richard Rush film Psych-Out.\n",
            "Weitz and King (also a member of Hunger) were denied songwriting credits by Slay because (according to him) they did not write the melody line or the lyrics, although the song was built on an instrumental by Weitz with a bridge by King.[9] This instrumental was originally intended as a B-side to \"The Birdman of Alkatrash\", which ultimately became the B-side to \"Incense and Peppermints\". The single stayed at No. 1 for one week, with 16 weeks in total on the charts.[10] A gold disc was awarded for 500,000 sales by the Recording Industry Association of America on December 19, 1967.[11]\n",
            "Shortly after recording \"Incense and Peppermints\", the band added Bunnell (on bass, rhythm guitar, and vocals) before making their first album. Also titled Incense and Peppermints, it hit No. 11 on the US album chart in late 1967. Bunnell would also become their main songwriter. Some early Strawberry Alarm Clock songs were penned by Bunnell with Bartek. The latter played flute on the first two SAC albums and would continue to be involved with the band's later incarnations. Bartek later joined The Mystic Knights of the Oingo Boingo and orchestrated Boingo frontman Danny Elfman's film scores.\n",
            "In November 1967, and then again in April 1968, SAC toured on a bill with the Beach Boys and Buffalo Springfield. During the April leg of the tour, several dates in the South were canceled following the assassination of Martin Luther King Jr. in Memphis, Tennessee on April 4, 1968. Ed King said that the band all acquired handguns after King's death for the remaining shows in the South, and that he carried his in his waistband onstage.[citation needed]\n",
            "In their early days of touring, the band members would often sit on \"magic carpets\" as their roadies carried them to the stage. Drummer Seol would rig up wrist gas jets to give the illusion that he was playing the bongos and vibes with his hands on fire, until the gimmick became too dangerous.\n"
         ]
      },
      "1968–1969: Lineup changes": {
         "text": [
            "During the Strawberry Alarm Clock's short lifespan, it saw many lineup changes. Since Bunnell had become the main writer, he began playing more of the bass parts, since he already knew the songs. Original bassist Lovetro gradually moved over to the road manager's job, then was eventually bought out of the group after conflicts with the others prior to the release of the second album, Wake Up...It's Tomorrow. The album's single, \"Tomorrow\", was a minor hit and their only other Top 40 appearance, reaching No. 23 in early 1968.\n",
            "Later 1968 singles included \"Sit with the Guru\" (charting at No. 65) and \"Barefoot in Baltimore\" (which peaked at No. 67 and later was included on their The World in a Sea Shell album). The latter song was especially popular in its namesake city of Baltimore, Maryland in the counterculture neighborhood of Mount Vernon-Belvedere. The tune received considerable airplay on local Baltimore radio stations and was even occasionally used as a theme song for the city's image in following decades.\n",
            "Bunnell and Seol left the band in late 1968 at the end of the sessions for The World in a Sea Shell, due to disagreements with the band over their manager Bill Holmes' mishandling of their business affairs. Bunnell, Seol, and Bartek formed a new band, Buffington Rhodes. Holmes was fired by the remaining band members and he angrily retaliated by putting together an alternate version of the SAC (with Bunnell and Seol) and sending them out on the road. The band countered with an injunction against Holmes, who was subsequently stopped by the Los Angeles County Superior Court from using the name to start an alternative band with the same name.[12] The band then moved from All American Records to Uni Records.\n",
            "Drummer Marty Katon then came aboard, along with new lead singer/guitarist Jimmy Pitman (formerly of the Nightcrawlers), and the band shifted to a more blues rock style. King moved over to bass, as he had been playing many of the bass parts in the studio anyway. In early 1969, original \"Incense and Peppermints\" drummer Gunnels rejoined SAC, replacing Katon. Pitman left in July 1969, after their Good Morning Starshine album failed to sell. He was succeeded by Paul Marshall, who would remain with the group until they disbanded temporarily in 1971. The title track, \"Good Morning Starshine\", peaked at No. 87 in 1969, but was beaten out by Oliver's version, a bigger hit. Weitz quit in December 1969 and the group continued on as a quartet with King, Freeman, Gunnels, and Marshall.\n"
         ]
      },
      "1970–1981: Breakup and brief reunion": {
         "text": [
            "In 1970 the band appeared in the Russ Meyer cult classic film Beyond the Valley of the Dolls. By this time the band's popularity had waned considerably, but the band continued on for some time, touring the South in 1970 and 1971 with a then-unknown Florida band called Lynyrd Skynyrd opening for them. In the latter part of 1971, the group, now without a record label and with internal conflicts over musical direction, opted to disband. Lead guitarist King deciding to relocate to the South while Gunnels joined the backup band for the Everly Brothers, alongside Waddy Wachtel and Warren Zevon. King had earlier expressed an interest in joining Lynyrd Skynyrd to vocalist Ronnie Van Zant when the two bands toured together, and he accepted an invitation to join the band in November 1972. It was King who composed the classic opening riff to the band's biggest hit, \"Sweet Home Alabama\", released in 1974.[13]\n",
            "SAC reunited briefly in 1974–1975 with Bunnell, Seol, and Bartek. The trio played some shows and contributed the theme song to late-night 1970s televised rock concert series ABC in Concert. They also appeared on one of the smaller stages at the first California Jam on April 6, 1974.\n"
         ]
      },
      "1982–2001: Reunion and alternate lineup": {
         "text": [
            "Strawberry Alarm Clock reunited once again in 1982 after guitarist Freeman spotted a newspaper ad promoting an appearance by the group at a Los Angeles club, The Music Machine. Freeman knew nothing about this gig and went to the club to investigate. There he discovered that the advertisement had actually been a plot by the club's owners to get the real band to reunite. At this point, Freeman, Bunnell, Weitz, and Gunnells reformed as Strawberry Alarm Clock. They were joined in 1983 by singer Leo Gaffney and Freeman's brother, Doug.\n",
            "By 1983, the SAC lineup was Freeman, Bunnell, Peter Wasner (keyboards), and James Harrah (guitar). \"Incense and Peppermints\" was re-recorded the same year with a lineup of Freeman, Bunnell, Harrah, Bartek, and Clay Bernard (keyboards), with Bob Caloca on lead vocals. The remake was produced by Dennis Dragon (brother of Daryl Dragon), who also played percussion on the track.\n",
            "Freeman, Bunnell, Harrah, and Bernard continued on, with Seol rejoining. Seol left again in 1984, and Harrah and Bernard were replaced by actor/musician Jon Walmsley (guitar, keyboards, vocals). Bruce Hubbard, who had earlier played with Bunnell in Buffington Roads, took over percussion duties. Walmsley was out by 1986, replaced by guitarist Howie Anderson along with a returning Bernard. Anderson also handled keyboard parts via his synth guitar after Bernard left once again, this time to relocate to New Mexico at the end of the 1980s.\n",
            "The band began performing on oldies concert tours during the 1980s, usually alongside other late 1960s-era acts such as Moby Grape, the Seeds, and It's a Beautiful Day. The Freeman/Bunnell/Hubbard/Anderson grouping was their longest lived, lasting from 1989 to 2001. During this time, the members continued to work on new material and make occasional concert appearances while also pursuing their other individual careers.\n",
            "Meanwhile, in 1982, late-1960s SAC member Pitman was playing with a band called Thunderchicken in Salt Lake City, Utah, and decided to recreate his own version of SAC, teaming up with Preston Kofoed (bass), Mordecai Noble (guitar), Dave Stone (keyboards), and Dave (Plumb) Derrick (drums). This version of the group played a benefit for the Veterans of the Vietnam War at New Faces Roadhouse and toured extensively throughout the western US. They disbanded a few years later in Jackson, Wyoming.\n"
         ]
      },
      "2001–present: New album": {
         "text": [
            "On June 16, 2001 the group appeared at a concert at San Diego's Balboa Park with Moby Grape, Jefferson Starship, Iron Butterfly, Big Brother and the Holding Company, and Country Joe McDonald. Seol and Gunnells joined Freeman, Bunnell, Anderson, and Hubbard for this show.\n",
            "On October 23, 2003, the above lineup was joined by Bartek and Marshall for an appearance at Amoeba Records in Hollywood to celebrate the DVD release of Beyond the Valley of the Dolls.\n",
            "In December 2004, Weitz and King were slated to reunite with Seol, Freeman and Bunnell, along with original \"Incense\" singer Munford, for a PBS special on 1960s-era rock music, but the band did not appear. Bunnell later said in interviews that PBS never sent the proper contracts to the band.\n",
            "By 2006, Weitz, Bartek, Bunnell, Seol, and Anderson were back playing shows with the group. King, Freeman, Marshall, and Gunnels joined them to perform at the Virginia Theatre in Champaign, Illinois on April 29, 2007. The event was part of the last day of Chicago Sun-Times and Siskel and Ebert movie critic Roger Ebert's ninth annual Overlooked Film Festival, and was preceded by a screening of Beyond the Valley of the Dolls (co-written by Ebert and director Russ Meyer). Freeman, Weitz, Bartek, Bunnell, Seol, Gunnels, and Anderson continued making 2007 concert appearances.\n",
            "By 2008, an ill Freeman was sidelined, and in 2010, Bartek began to cut back his appearances with the group.\n",
            "In January 2010 SAC started recording new material for a record label created by Billy Corgan of the Smashing Pumpkins. SAC keyboardist Weitz (who played keyboards in 2009 for Corgan's side project Spirits in the Sky) said, \"We’re picking up where we left off, but with a modern sound\". The band also reworked some of its 1960s songs.[14]\n",
            "Founding member Lee Freeman (born November 8, 1949) died on February 14, 2010, at the age of 60, from complications arising from cancer.[15]\n",
            "Carrying on as Strawberry Alarm Clock were Weitz, Seol, Bunnell, Gunnels, and Anderson (with Bartek appearing as his schedule permitted). SAC performed live during 2012 around southern California, including appearances at The Satellite in Los Feliz, the Whisky a Go Go, the Echoplex (for the West Psych Fest), and the Adams Avenue Street Fair in San Diego.\n",
            "On October 21, 2012, SAC performed at the 29th annual Love Ride benefit in Glendale, which featured grand marshals Jay Leno, Peter Fonda, and Robert Patrick. Immediately following their Love Ride appearance, the band were awarded proclamations from the City of Los Angeles by City Councilman Tom LaBonge, Eric Garcetti, and Leno to commemorate the 45th anniversary of \"Incense and Peppermints\" reaching No. 1. The band accepted plaques for Freeman (posthumously) and King (who by this time was happily retired in Nashville, Tennessee). Bartek was on hand for their performance, as was the Neville Brothers' longtime harmonica player, Robert Cowan.\n",
            "On April 1, 2012, SAC released Wake Up Where You Are on the Global Recording Artists label. It was the band's fifth studio album and first since 1969.[16]\n",
            "Ebert died on April 4, 2013, and on July 27, his widow, Chaz Ebert, asked SAC to appear at the Saban Theatre in Beverly Hills as part of a tribute to her late husband. SAC performed a half-dozen songs, followed by a screening of Beyond the Valley of the Dolls. Charles Dierkop, a veteran character actor and longtime friend of the band, introduced them. In the months after the Saban Theatre engagement, SAC made plans to write and record new material for an EP.\n",
            "On August 19, 2016, Weitz was hospitalized after a car accident; veteran keyboardist Glenn Brigman took his place while Weitz recovered.[17]\n",
            "On March 18, 2017 SAC played the Starry Nights Festival in Santa Barbara with Weitz back on stage with the band once again.[18]\n",
            "Jimmy Pitman (born September 28, 1946) died in hospice care on August 29, 2019, at age 72.[19]\n",
            "Strawberry Alarm Clock was among hundreds of artists whose material was reportedly destroyed in the 2008 Universal fire.[20]\n"
         ]
      }
   },
   "Discography": {
      "Compilation albums": {},
      "Singles": {},
      "Studio albums": {}
   },
   "External links": {},
   "References": {},
   "Sections": [
      "1 Career",
      "1.1 1966–1967: Formation and early success",
      "1.2 1968–1969: Lineup changes",
      "1.3 1970–1981: Breakup and brief reunion",
      "1.4 1982–2001: Reunion and alternate lineup",
      "1.5 2001–present: New album",
      "2 Band members",
      "2.1 Timeline",
      "3 Television and films",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Compilation albums",
      "4.3 Singles",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Strawberry Alarm Clock is a psychedelic rock band formed in 1967 with origins in Glendale, California,[1] a city near Los Angeles. They are best known for their 1967 hit single \"Incense and Peppermints\".[2] Strawberry Alarm Clock, who have been also categorized as acid rock, psychedelic pop,[3][4][5] and sunshine pop,[6] charted five songs, including two Top 40 hits.\n"
      ]
   },
   "Television and films": {
      "text": [
         "Strawberry Alarm Clock made several television appearances, including American Bandstand, Happening '68, The Steve Allen Show, and the first episode of Rowan & Martin's Laugh-In. Drummer Seol made an appearance as one of three eligible bachelors on The Dating Game and was chosen by the girl.\n",
         "SAC also made two notable appearances in films. In the 1968 Jack Nicholson movie Psych-Out, they played several songs including \"Incense and Peppermints\", \"Rainy Day Mushroom Pillow\", and \"The World's on Fire\". \"The Pretty Song from Psych-Out\" was re-recorded by a San Fernando Valley garage band, the Storybook, for the film's soundtrack album, but the SAC's version was heard in the film. The soundtrack release did feature two songs not on any previous albums, recorded with Marshall on vocals.\n",
         "The band's second movie appearance was in 1970's Beyond the Valley of the Dolls, where they played \"Incense and Peppermints\", \"I'm Comin' Home\", and \"Girl from the City\".\n"
      ]
   },
   "Title": "Strawberry Alarm Clock - Wikipedia"
}