{
   "Name": "The Submarines",
   "Sections": [
      "1 Band history",
      "2 Blake Hazard",
      "3 John Dragonetti",
      "4 Band",
      "5 Contributors",
      "6 826LA ‘Chickens In Love’ compilation",
      "7 Awards",
      "8 In popular media",
      "9 Discography",
      "9.1 Albums",
      "9.2 EPs",
      "9.3 Live",
      "9.4 Compilations",
      "9.5 Video",
      "10 References",
      "11 External links"
   ],
   "Summary": {
      "text": [
         "The Submarines are an American indie rock band from Los Angeles formed in 2006.\n"
      ]
   },
   "Band history": {
      "text": [
         "Working as solo artists in Boston, the two members of the band, John Dragonetti and Blake Hazard, were introduced through a mutual friend, Joe Klompus. Dragonetti and Hazard formed a romantic and musical partnership, then took their show to Europe. The relationship lasted for four years, but ended in the fall of 2004 when the pair moved to L.A.[1] After the break-up, both Hazard and Dragonetti continued writing songs, and because Hazard still recorded her music in Dragonetti's home studio, the pair quickly discovered the songs they had written were about each other and their sadness in having broken up. They decided to work on a few songs together and eventually got back together, and married. The new songs were mastered for the couple as a wedding present, and those tracks eventually became their first album.[2] Hazard has said of the relationship, \"It’s hard, definitely hard. Luckily we are like-minded aesthetically and musically.\" Declare a New State!, The Submarines' first album was released in 2006 on the Nettwerk label.[3]\n"
      ]
   },
   "Blake Hazard": {
      "text": [
         "Blake Hazard is from Burlington, Vermont. Her full given name is Eleanor Blake Hazard, although she prefers her middle name and uses it as her first. She attended the Putney School in southern Vermont, southeast of her hometown.[4] She is also a graduate of Harvard University and is the great-granddaughter of American writer F. Scott Fitzgerald.[5]\n",
         "Blake released a solo album of her own titled \"Little Airplane\" (2002) just two years previous to her breakup with John on California's election night in 2004. \"Little Airplane\" was recorded by John in his studio and was released on Boston-based independent record label Kimchee Records. The album can still be obtained on Kimchee's website[6] or through The Submarines web store.\n",
         "Blake is an avid runner and has run numerous marathons and races for many causes. These marathons have taken place in Boston, Chicago, New York, and Los Angeles.[citation needed]\n"
      ]
   },
   "John Dragonetti": {
      "text": [
         "John attended the American School of Dubai.[7] Originally from Jackson, Michigan, his family moved to Dubai when he was young.[8] Upon arriving in Boston, he briefly attended college at the Berklee School of Music.[9]\n",
         "To support himself, John worked as a bike messenger in the city of Boston[10] and played in several Boston-area bands before going solo. Jack Drag was his moniker for music he recorded at his apartment home studio, which he called Space 67. Much of the recorded material was done on a 4-track cassette recorder. Several singles and a self-titled, full-length album, \"The Red Record,\" or \"cataloged as Pop Spelled Backwards\" (as dubbed by his friends and bandmates[11]) were released. The first single, \"Velour,\" was released by Dave Gibbs (of the Gigolo Aunts), on his label called Sumerville Records. The second single was put out by John's record label, called Devil's Weed, Inc.  A third single was released on Hepcat Records. As a result of these recordings, John was signed to A&M Records. When A&M was acquired by Universal Music, Jack Drag was dropped from the label and he continued recording independently in Space 67. Vowing to keep releasing his music, he rolled up his sleeves and released more albums with Shifty Disco, Scientific Records and Sugar Free Records. This eventually led to a project with his old friend Peter DuCharme (AKA: Master Cylinder) called the Junior Communist Club.[12] Several tracks left over from the Jack Drag A&M sessions were used for the project, and a few staple commercials resulted from the release.\nTo this date, there have been no plans to release any new material by Jr. Communist Club. John has stated that \"Although encouraged to, we never did put together a live show. I'm sure we'll collaborate again but whether it will be under the Jr.Commy moniker remains to be seen.\"[13] As for his moniker Jack Drag, he states on the Jack Drag web site, \"It's all about The Submarines now!\"[14]\n"
      ]
   },
   "Band": {
      "text": [
         "Jason Stare and Scott Barber are part of the touring band.  (As an inside joke, John has said that when the Subs play live with some computer tracks, the band is called The Robots).  The Submarines have toured the United States and the world, sometimes as a duo, and sometimes as a full band. Many shows in the beginning, for the band's first tour, consisted of just Blake and John. For the band's second release, Honeysuckle Weeks, Jason joined to play drums for their live shows. Jason has been the band's live set drummer since the release of Honeysuckle Weeks, and is featured in Apple commercials for the iPhone 3G and iPhone 3GS. He is an artist, a college graduate and is from Long Island, New York. On bringing him on tour, John has stated, \"I saw him live and I liked his playing. But seriously, just look at him. He looks cool!\"\n",
         "For the first leg of the 2011 Love Notes/Letter Bombs tour, The Submarines brought on Scott Barber to play Bass for live performances. Jason and Scott also have a side project together.\n"
      ]
   },
   "Contributors": {
      "text": [
         "Peter also sits in on a Beatles cover \"For No One\" done in John's home studio in Eaglerock, CA in a home shot video recorded by The Voice Project. The video is on Vimeo and Peter plays organ for the song.\n",
         "John traveled to Austin, Texas to work with Jim in his studio and contributed drum tracks for the Love Notes/Letter Bombs release. Jim's studio is called Public Hi-Fi and is based in Austin, Texas. The studio has a rare Neve 8036 Console (marked as #A41) with Uptown Automated Faders, 22 1064 mic/lin input modules and 2 1081 mic/line input modules in the board. The studio runs on both analog and digital. Which runs a Pro Tools HD2 system and a Studer 827 2\" 24 track analog tape machine in the facility.[15]\n"
      ]
   },
   "826LA ‘Chickens In Love’ compilation": {
      "text": [
         "In 2010, The Submarines donated their time and efforts to teach children of the 826LA Organization the art of songwriting and how to creatively express themselves. 826LA held a workshop titled \"Songwriting With The Submarines\".[16] The results of the workshop were released as a compilation. The compilation includes Los Angeles local bands (She and Him, Cold War Kids, Fiona Apple and Dum Dum Girls among others) covering songs written by children in the Submarines' workshop. To celebrate the workshop and the children who participated in the songwriting. 826LA held a Mini Festival on March 6, 2010 which featured performances by The Submarines, The Happy Hollows and The Growlers.\n"
      ]
   },
   "Awards": {},
   "In popular media": {},
   "Discography": {
      "Albums": {},
      "EPs": {},
      "Live": {},
      "Compilations": {},
      "Video": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Submarines are an American indie rock band from Los Angeles formed in 2006.\n",
      "Working as solo artists in Boston, the two members of the band, John Dragonetti and Blake Hazard, were introduced through a mutual friend, Joe Klompus. Dragonetti and Hazard formed a romantic and musical partnership, then took their show to Europe. The relationship lasted for four years, but ended in the fall of 2004 when the pair moved to L.A.[1] After the break-up, both Hazard and Dragonetti continued writing songs, and because Hazard still recorded her music in Dragonetti's home studio, the pair quickly discovered the songs they had written were about each other and their sadness in having broken up. They decided to work on a few songs together and eventually got back together, and married. The new songs were mastered for the couple as a wedding present, and those tracks eventually became their first album.[2] Hazard has said of the relationship, \"It’s hard, definitely hard. Luckily we are like-minded aesthetically and musically.\" Declare a New State!, The Submarines' first album was released in 2006 on the Nettwerk label.[3]\n",
      "Blake Hazard is from Burlington, Vermont. Her full given name is Eleanor Blake Hazard, although she prefers her middle name and uses it as her first. She attended the Putney School in southern Vermont, southeast of her hometown.[4] She is also a graduate of Harvard University and is the great-granddaughter of American writer F. Scott Fitzgerald.[5]\n",
      "Blake released a solo album of her own titled \"Little Airplane\" (2002) just two years previous to her breakup with John on California's election night in 2004. \"Little Airplane\" was recorded by John in his studio and was released on Boston-based independent record label Kimchee Records. The album can still be obtained on Kimchee's website[6] or through The Submarines web store.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Indie rock, indie pop, electronica, folk"
      ],
      "Years active": [
         "2006–present"
      ],
      "Labels": [
         "Nettwerk"
      ],
      "Website": [
         "TheSubmarines.com"
      ],
      "Members": [
         "John Dragonetti",
         "Blake Hazard",
         "Jason Stare",
         "Scott Barber"
      ]
   }
}