{
   "Name": "Suburban Legends",
   "rawData": [
      "Suburban Legends are an American ska punk band that formed in Huntington Beach, California, in 1998 and later based themselves in nearby Santa Ana. After building a fanbase in the Orange County ska scene through their numerous regular performances at the Disneyland Resort, a series of lineup changes in 2005 introduced elements of funk and disco into the group's style.\n",
      "Since 2009, the band has gradually returned to its ska roots, and has also recorded cover versions of songs from Disney films and television series.\n",
      "Influenced by artists such as Reel Big Fish, Michael Jackson and Oingo Boingo, the band was formed in 1998 as The No Tones, consisting of vocalist Tim Maurer, guitarist Josh Landers, bassist Justin Meacham, drummer Fred Johnson, trumpet players Vince Walker and Aaron Bertram, and trombonists Ryan Dallas Cook and Brian Robertson. A few months after forming, Landers was replaced by Brent Feige and Johnson by Jimmy Sullivan and the band changed their name to Bomb Squad, under which name they released an EP, now known as the Bomb Squad EP.\n"
   ],
   "infobox": {
      "Also known as": [
         "The No Tones, Bomb Squad"
      ],
      "Origin": [
         "Huntington Beach, California, U.S."
      ],
      "Genres": [
         "Ska punk, rock, pop, funk, disco"
      ],
      "Years active": [
         "1998–present"
      ],
      "Labels": [
         "Rock Ridge Music, Self-released, Subrange (Japan), Brand New Hero (UK)"
      ],
      "Associated acts": [
         "Avenged Sevenfold, The Belvederes, Big D and the Kids Table, Hooray for Our Side, Kids Imagine Nation, The Littlest Man Band, Mêlée, Perilous, Personal Satisfaction, PopBritannica, Skrotum Kiss, Aquabats, Pinkly Smooth, Reel Big Fish"
      ],
      "Members": [
         "Vincent Walker",
         "Aaron Bertram",
         "Brian Robertson",
         "Brian Klemm",
         "Chris Lucca",
         "Brad Polidori",
         "Edward Larsen"
      ],
      "Past members": [
         "Tim Maurer",
         "Chris Batstone",
         "Luis Beza",
         "Dallas Cook",
         "Phillip Inzerillo",
         "Josh Lander",
         "Brent Feige",
         "Justin Meacham",
         "Chris Maurer",
         "Mikey Hachey",
         "Fred Johnson",
         "The Rev",
         "Derek Rock",
         "Dallas Kruse"
      ]
   },
   "albums": [
      "Origin Edition",
      "Rump Shaker",
      "Dance Like Nobody's Watching: Tokyo Nights",
      "Infectious",
      "Let's Be Friends... and Slay the Dragon Together",
      "Day Job",
      "Forever in the Friend Zone"
   ],
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band that formed in Huntington Beach, California, in [YEAR] and later based themselves in nearby Santa Ana. After building a fanbase in the Orange County ska scene through their numerous regular performances at the Disneyland Resort, a series of lineup changes in [YEAR] introduced elements of funk and disco into the group's style.\n",
      "Since [YEAR], the band has gradually returned to its ska roots, and has also recorded cover versions of songs from Disney films and television series.\n",
      "Influenced by artists such as Reel Big Fish, [PERSON_NAME_FULL_3_MALE] and Oingo Boingo, the band was formed in [YEAR] as The No Tones, consisting of vocalist [PERSON_NAME_FULL_5_MALE], guitarist Josh Landers, bassist [PERSON_NAME_FULL_2_MALE], drummer Fred Johnson, trumpet players [PERSON_NAME_FULL_4_MALE] and Aaron Bertram, and trombonists [PERSON_NAME_FULL_1_MALE] and Brian Robertson. A few months after forming, Landers was replaced by [PERSON_NAME_FULL_0_MALE] and Johnson by Jimmy Sullivan and the band changed their name to Bomb Squad, under which name they released an [GENRE]"
   ]
}