{
   "Discography": {
      "Albums": {},
      "Collaborations": {},
      "Compilations": {},
      "DVDs": {},
      "EPs": {},
      "Music videos": {},
      "Singles": {},
      "text": [
         "A majority of the band's material has been self-released, with the exception of the red, blue, and green versions of the Tim Maurer Suburban Legends EP (released by We The People Records) the UK version of Rump Shaker (released by Brand New Hero Records), the Japan-only Dance Like Nobody's Watching: Tokyo Nights (released by Subrange Records), and Dreams Aren't Real, But These Songs Are, Vol. 1 (released by Rock Ridge Music). Some out-of-print and/or rare recordings were previously made available by fans on the now-defunct Suburban Legends official forums in the \"Suburban Legends Collection\" forum, under permission of trombonist Brian Robertson.\n"
      ]
   },
   "External links": {},
   "History": {
      "Day Job era (2010-present)": {
         "text": [
            "In 2009 the band had announced they were planning to release a full ska record once again, and in late 2010 the band released a seven-track EP as a preview, Going on Tour EP. This was followed by the departure of bassist Mikey Hachey, even though he continues to collaborate with the band on some occasions. He was soon replaced by Brad Polidori.\n",
            "On January 1, 2011, the band's song, \"You,\" from their 2003 album, Rump Shaker, was performed by the Western Carolina University Pride of the Mountains Marching Band in the 2011 Tournament of Roses Parade in Pasadena, California. The band chose to perform the song in honor of the late Ryan Dallas Cook.\n",
            "In July 2011, it was announced that Suburban Legends was cast as the house band for Pick-a-Split, a retro-themed bowling game show pilot hosted by Neil Hamburger.\n",
            "During November 2011, Connecticut's Asbestos Records and Chicago, IL's Underground Communiqué Records launched a fundraiser together on Kickstarter to release Rump Shaker on vinyl, among other third-wave ska classics from Pilfers, Edna's Goldfish, and The Pietasters. The funding goal was met by January 18, 2012, and the records began pre-production in Spring 2012.[7]\n",
            "On February 23, the band's 2009 collaboration track with MC Lars and The Aquabats' MC Bat Commander, \"This Gigantic Robot Kills\", was released on Rock Band Network.\n",
            "On April 3, 2012, the band released its fifth full-length album, Day Job. It includes new songs, four re-recorded tracks from Going on Tour, a collaborative track with rapper Lyrics Born, as well as two Disney covers, \"Under the Sea\" from The Little Mermaid and \"I Just Can't Wait to Be King\" from The Lion King, which have been long-time staples of the band's live performances. In November 2012, long-time drummer Derek Rock left the band to pursue other career options. Reel Big Fish drummer Ryland Steen and former Big D and the Kids Table drummer Max MacVeety filled in on drums between Rock's departure and the hiring of current drummer Edward Larsen in 2013.\n",
            "The group released its all-Disney covers EP, Dreams Aren't Real, But These Songs Are, Vol. 1, through Rock Ridge Music on October 7, 2013. On March 17, 2015, the band officially announced their next album, Forever in the Friend Zone.[8]\n",
            "In 2015, Suburban Legends and Roger Lima (of Less Than Jake) recorded with MC Lars to release \"Sublime With Rome (Is Not the Same Thing as Sublime)\" on his 2015 LP, The Zombie Dinosaur LP.[9]\n",
            "Klemm, Walker, and former bassist Chris Maurer also currently perform in Personal Satisfaction, a blues/comedy side project.\n"
         ]
      },
      "Death of Dallas Cook and new formation (2005-2006)": {
         "text": [
            "At 12:25 AM on October 19, 2005, trombone player Dallas Cook was killed in a hit-and-run motorcycle accident on the Costa Mesa Freeway.[3] A few days after the incident, a large group of Suburban Legends' fans and Dallas' friends and family gathered nearby the ESPN Zone at Disneyland Resort's Downtown Disney, where the band played their many performances in the early 2000s, to share their memories of Cook. On November 29, 2005, the band performed a benefit show for the Dallas Cook Memorial Fund, which was as set up in Cook's honor to donate money to the Huntington Beach High School instrumental music program. The performance also featured former members Tim Maurer, Chris Maurer and Aaron Bertram returning for one final show, and trumpet player Vince Walker permanently switching to the vocalist position.\n",
            "In 2006 the band recruited trombonist Phillip Inzerillo to replace Dallas Cook. They released their first EP with Vince Walker on vocals, Dance Like Nobody's Watching, which showed the band's shift in style towards disco rock. The band promoted the EP by appearing on G4's Attack of the Show! on April 18, 2006. \n",
            "On July 19, 2006, while they were on tour and in St. Louis, Missouri, Phillip Inzerillo woke up to notice the band's tour van was on fire. The fire destroyed the front driver's side of the van. The band's tour money had also been missing from the van. It is suspected that the fire and robbery was caused by an arsonist.\n",
            "At the end of the year, trombonist Phillip Inzerillo left the band without official announcement, and wasn't replaced. Around this time keyboardist Dallas Kruse started performing with the band, despite never being listed as an official member.\n"
         ]
      },
      "Formation and first EP (1998-2002)": {
         "text": [
            "Influenced by artists such as Reel Big Fish, Michael Jackson and Oingo Boingo, the band was formed in 1998 as The No Tones, consisting of vocalist Tim Maurer, guitarist Josh Landers, bassist Justin Meacham, drummer Fred Johnson, trumpet players Vince Walker and Aaron Bertram, and trombonists Ryan Dallas Cook and Brian Robertson. A few months after forming, Landers was replaced by Brent Feige and Johnson by Jimmy Sullivan and the band changed their name to Bomb Squad, under which name they released an EP, now known as the Bomb Squad EP.\n",
            "In 1999, the band changed their name to Suburban Legends. Guitarist Brent Feige left the band shortly before the release of the first demo album, Origin Edition, for which they recruited guitarist Brian Klemm. The album was self-pressed and even though Brian Klemm was already in the band, Vince Walker recorded the guitar parts for the demo album. Later that year, vocalist Tim Maurer and drummer Jimmy Sullivan left the band, the latter to form the band Pinkly Smooth, and co-found the band Avenged Sevenfold. The former was replaced by Chris Batstone, the latter by Derek Lee Rock. A few months later, bassist Justin Meacham left the band as well and was soon replaced by former lead vocalist Tim Maurer's brother, Chris Maurer. Sullivan and Meacham would later perform together as members of metal band Avenged Sevenfold, under the respective pseudonyms \"The Rev\" and \"Justin Sane\".\n",
            "In 2001, the band released their first, self-titled, EP, Suburban Legends, on We The People Records, featuring some re-recorded songs from Origin Edition. This was the band's only release with Chris Batstone on vocals, as he left the band in early 2002.\n"
         ]
      },
      "New musical direction (2007-2009)": {
         "text": [
            "In 2007 the band released a Japan-only album, an extended version of their EP release, titled Dance Like Nobody's Watching: Tokyo Nights, containing several new and re-recorded songs. In early July 2007, the band started releasing videos on their YouTube account documenting progress recording new material in the studio. Later that year, the band released their first full album with Vince Walker on vocals, Infectious. The album continued the shift in style started with Dance Like Nobody's Watching, with ska being traded in for a pop-rock sound with disco and funk elements.\n",
            "On November 11, 2007, the band was robbed again, while supporting Streetlight Manifesto on their Somewhere in the Between Tour. This time, Suburban Legends' van was stolen along with approximately $80,000 worth of all their equipment and instruments. Fans were first alerted of this when Dallas Kruse posted a MySpace bulletin reading:\n",
            "\" You all know just HOW MUCH suburban legends have been through throughout the years! .... lets all gather to HELP THEM through this!\nI just got a call from my dear friend MIKEY, bassist for Suburban Legends.\nThey are on tour in Philly and woke up to head down to the van and trailer from the hotel room and the van and trailer were stolen.\nEvery piece of equipment and merchandise the band owns is gone.\nDrum sets, horns, clothing, basses, guitars, amps, etc.\nThe value of the equipment alone is appx 40k. The value of the trailer alone is 30k. Estimated value of everything is probably close to 80k (in my estimation) including the van, trailer and gear.\nThey are troopers and going to try and rent another van, rent gear and finish the tour.\nThis is devastating. Most, if not ALL of you know just how dear and sincere these guys are and how close I am with them.\nIs there ANYTHING we can do to help them?\nMy idea was to find someone with money who would be able to immediately front them an investment for gear and work out terms for the band to pay that person back. Or does someone here have connections to a car dealership? Instruments? SOMETHING!?!\nPlease help!\nif you have some help or ideas, PLEASE, lets help the guys out!\"\n",
            "Another MySpace bulletin which was posted on November 13, said that the van was recovered in a neighborhood in Philadelphia, apparently after somebody saw the news story on the van theft and gave information of its whereabouts. When the van was recovered, it only required minor repairs. However, the contents of the van and trailer were missing. While insurance issues were still being resolved, the band apologized to the fans for any shows they missed and stated that they would be back on the road again.\nThe song \"Fire\" from their 2008 album, Let's Be Friends, was about the van fire and robberies.\n",
            "The band's second DVD Poisonous Candy Factory was released in March 2008. Similar to Season One, it featured live sets containing songs from Rump Shaker through to new, unreleased material, music videos and extra videos from the band.\n",
            "Shortly after this release, the band headed back into the studio and recorded their third official album, Let's Be Friends, released on July 10, 2008, while touring with Less Than Jake, Goldfinger, and Big D and the Kids Table on the Shout It Loud Tour 2. This album mixed elements of previous albums, featuring a return to ska on some songs as well as a continued focus on a pop-rock sound.\n",
            "In the winter of 2008, they toured with The Aquabats on the Hooray for the Holidays Tour.[4] In February 2009, they appeared along with The Aquabats' MC Bat Commander on MC Lars' new song, \"This Gigantic Robot Kills\", from Lars' new album of the same name. MC Lars describes that \"this song is about bringing ska back. It's about this kid who builds this giant robot\" who \"as he destroys Orange County, he leaves behind a trail of Less Than Jake CDs, a field of Aquabat limited edition vinyls, and a stack of CDs by Suburban Legends.\"[5] They also performed at Miley Cyrus' 16th Birthday Party celebration.[6] \nShortly after, trumpet player Luis Beza left the band.\n",
            "In 2009 the band appeared as a full ska band on the 2009 Jerry Lewis MDA Telethon, with a new ska song titled \"Open Your Eyes\". The performance featured former member Aaron Bertram on trumpet once again, and guest musicians Byron Panopio and Justin Lewis, on trumpet and trombone respectively. The three continued to perform with the band on the subsequent tour and Disney shows, along with touring trumpet player Chris Lucca. At the end of 2009 Panopio and Lewis, as well as long-time collaborator Dallas Kruse, stopped performing with the band.\n"
         ]
      },
      "Retirement from touring": {
         "text": [
            "On December 23, 2015, the band announced via their Facebook page that their 2016 US tour in support of Reel Big Fish would be their \"last tour ever,\" while also leaving the possibility to tour again open, stating, \"who knows what the future will hold but after this we will be taking a time out from touring.\"[10] In late 2018 Suburban Legends commenced a tour as the support for Reel Big Fish and supported fellow supports from the tour Zebrahead on select UK gigs where they had days off and Zebrahead headlined gigs at pubs and clubs.\n"
         ]
      },
      "Rump Shaker and Disney (2002-2005)": {
         "text": [
            "In early 2002 previous vocalist Tim Maurer rejoined the band on vocals, and the band re-recorded the vocals for their EP, and re-released it independently as Suburban Legends (Tim Remix). During the year, the band played close to 1000 shows at Downtown Disney.[2] They also performed on many occasions for the X Games Xperience promotion at Disney California Adventure Park in 2003.\n",
            "In 2003, the band recorded and released their first actual album, Rump Shaker, followed by a year of heavy touring. The band released their first live DVD in 2004 titled Season One. At the end of the year trumpet player Vince Walker and bassist Chris Maurer left the band, the former to go to college and the latter to get married. While Maurer was replaced by Mikey Hachey, Walker wasn't replaced and the band continued with only one trumpet player. In May 2005, trumpet player Aaron Bertram left the band to get married as well, and was replaced by Luis Beza.\n",
            "In late 2005, former trumpet player Vince Walker rejoined the band for the 2005 Jerry Lewis MDA Telethon, after which vocalist Tim Maurer left the band once again. The band went on a pause until further notice.\n"
         ]
      }
   },
   "Lineup": {
      "Current lineup": {},
      "Former": {},
      "text": [
         "The band has had many lineup changes over the years. Original vocalist Tim Maurer left the band after the recording of Origin Edition, and was replaced by Chris Batstone. Batstone later left the band, and Maurer rejoined. After an album and live DVD, Maurer left again after the 2005 Jerry Lewis MDA Telethon to spend more time with his family. He was replaced by former trumpet player Vince Walker, who returned to the band in the same performance, oddly switching roles from horns to vocals. Walker also plays the trumpet and guitar in some songs on stage. Before becoming the band's lead vocalist, he already had provided lead vocals on several songs such as \"Desperate\", \"Blingity Bling\" and \"Powerful Game\". Walker sometimes switches to guitar so that Brian Klemm can take over lead vocals.\n",
         "Guitarist Brian Klemm joined the band in 1999 and has been with the band ever since. He can also be heard doing lead vocals in several of the band's songs, such as \"Desperate\", \"Powerful Game\", \"This Cherry\", \"So Fine\", \"Love Fair\", \"I Just Can't Wait to be King\" and \"Girlfriend's Pretty\". After the departure of Aaron Bertram, Klemm started providing more backing vocals live, and this increased even more after the departure of Mikey Hachey.\n",
         "The band's original bassist, Justin Meacham, left the band in 2000 to join Avenged Sevenfold and replace their original bassist Matt Wendt. He was soon replaced by Chris Maurer, the younger brother of former lead vocalist Tim Maurer. Apart from bass, Chris Maurer also provided backing vocals on many songs live. Maurer left the band in 2004 to marry his fiancée and was replaced by Mikey Hachey, who stayed with the band until 2010, when he left the band to pursue other musical activities, notably becoming the house bassist for Cirque du Soleil's Viva Elvis show at the Aria Resort & Casino in Las Vegas. He also did many of the band's main backing vocals after Aaron Bertram left, and also occasionally sang lead vocals in \"Powerful Game\" live. The band's current bassist is Brad Polidori who joined in 2010.\n",
         "One of the band's early drummers, Jimmy Sullivan, left the band to form Pinkly Smooth and later became known as \"The Rev\" in Avenged Sevenfold, along with former Suburban Legends bassist Justin Meacham, who became known as Justin Sane during his time with Avenged Sevenfold. After that drummer Derek Lee Rock was with the band from 2000 onwards. He recently left the band in 2012, and temporarily filling in on drums were Max McVeety and Reel Big Fish's Ryland Steen. In 2013 Edward Larsen joined the band on drums.\n",
         "Trumpet player Vince Walker was with the band until his departure in 2004 to focus on his education. He rejoined the band in 2005 to become the band's new lead vocalist. Aaron Bertram left the band in 2005 to marry his fiancée, but returned to the band in 2009 as a touring trumpet player. In between this, Luis Beza was the band's only trumpet player. Since 2009, Bertram usually performs with the band as their trumpet player, but Chris Lucca often takes the trumpet player role in the band's overseas tours. Bertram was the band's main backing vocalist before he left, and has also provided lead vocals for several songs such as \"Gummi Bears\", \"Rose Tint My World\" and \"Powerful Game\". In 2013, Chris Lucca became the band's official trumpet player. Aaron Bertram still regularly performs with the band at local shows,\n",
         "Trombonist Brian Robertson is the only member to have been in the band since its inception in 1998. Dallas Cook, who also provided lead vocals for the band's cover of \"Rose Tint My World\", was killed in 2005, and was replaced by Phillip Inzerillo who left the band in 2006. Since then, Robertson has been the band's only trombonist. He usually only plays trombone, but also sings backing in the song \"Blingity Bling\" from Rump Shaker.\n",
         "Keyboardist Dallas Kruse began playing with the band around 2006 after the departure of Inzerillo. While not an \"official\" member, not appearing on the band's website and not announced by the band, he often performed with the band since the tour at local shows until late 2009. Kruse served as producer for Dance Like Nobody's Watching: Tokyo Nights, Infectious, and Let's Be Friends and Slay the Dragon Together.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and first EP (1998-2002)",
      "1.2 Rump Shaker and Disney (2002-2005)",
      "1.3 Death of Dallas Cook and new formation (2005-2006)",
      "1.4 New musical direction (2007-2009)",
      "1.5 Day Job era (2010-present)",
      "1.6 Retirement from touring",
      "2 Style",
      "2.1 Covers",
      "3 Lineup",
      "3.1 Current lineup",
      "3.2 Former",
      "4 Timeline",
      "5 Discography",
      "5.1 Albums",
      "5.2 EPs",
      "5.3 DVDs",
      "5.4 Singles",
      "5.5 Collaborations",
      "5.6 Music videos",
      "5.7 Compilations",
      "6 References",
      "7 External links"
   ],
   "Style": {
      "Covers": {
         "text": [
            "Suburban Legends are known to perform many live covers, most often when performing at the Disneyland Resort, sometimes performing top 40 and classic pop or rock hits to appeal to the theme park guests outside of the band's usual fanbase. The band has also performed and recorded many songs from Disney films and television shows. They have performed \"Under the Sea\" from The Little Mermaid at many of its shows since 2002, and the theme songs from Disney's Adventures of the Gummi Bears and DuckTales, \"I Just Can't Wait to Be King\" from The Lion King, and more recently, \"Kiss the Girl\" from The Little Mermaid and \"Colors of the Wind\" from Pocahontas. Until 2013, only \"Gummi Bears\", \"Under the Sea\", and \"I Just Can't Wait to Be King\" had seen recorded releases, with the first track appearing on the Bomb Squad EP and Origin Edition, and the latter two tracks appearing on the band's 2012 album, Day Job. The band released an EP consisting of Disney covers in October 2013, including \"DuckTales\", \"Kiss the Girl\", and others. The band's Disneyland performances have also featured \"Build Me Up Buttercup\" by The Foundations, \"Celebration\" by Kool & the Gang, \"Higher Ground\" by Stevie Wonder, \"Rubberneckin'\" by Elvis Presley, \"Can't Take My Eyes Off You\" by Frankie Valli, \"I'm the Leader of the Gang (I Am)\" by Gary Glitter, \"Sweet Caroline\" by Neil Diamond, and an excerpt of \"Moves Like Jagger\" by Maroon 5 as a segue into the band's own \"All Around the World\".\n",
            "Outside of the three Disney songs, cover songs rarely appear on the band's studio releases. An exception is \"Dancing Machine\", a song originally performed by The Jackson 5, appearing on the 2007 Japan-only release, Dance Like Nobody's Watching: Tokyo Nights, an extended version of the U.S.-released Dance Like Nobody's Watching EP. All other covers have been released as part of compilations, such as the band's cover of \"On the Outside\" appearing on Dead Bands Party: A Tribute to Oingo Boingo. During Chris Batstone's tenure as lead vocalist, a recording of \"Rose Tint My World\" from The Rocky Horror Show was made for an abandoned Rocky Horror tribute album (which would have also featured fellow ska artists such as Chris Murray and Pain), and was eventually released in MP3 format by the band. The band began performing The Gregory Brothers' and Antoine Dodson's \"Bed Intruder Song\" at live performances in 2010, eventually releasing a studio recording on a 7\" single backed with \"It Was a Dark and Stormy Night\" by Five Iron Frenzy as part of Asbestos Records' Ska is Dead 7\" Club series in 2012.\n"
         ]
      },
      "text": [
         "Suburban Legends' style of music has evolved over time and is different from that of other ska bands. While earlier material being heavily rooted in ska, the 2006 release Dance Like Nobody's Watching brought a different sound took ideas and influence from disco, funk, and pop, some songs on the EP containing little to no ska sound at all. The band furthered its distance from ska with the 2007 release of Infectious, heavily focusing on disco on the record. The band has not abandoned their earlier sound, though, regularly performing older material alongside their current work.\n",
         "The 2008 album Let's Be Friends combines elements from all their previous releases. In May 2009, the band announced that they would be recording a \"full blown ska rock album,\" not simply a ska-influenced album because they have horns or an album with only a few ska songs.[11] Further supporting the band's transition back to ska, less time was devoted in live performances to songs found on more recent albums, such as Infectious, with the band reintroducing older songs such as \"Alternative is Dead,\" \"Gummi Bears,\" \"I Want More,\" and \"Waikiki,\" all of which were found either on Origin Edition (1999) and Suburban Legends (2001). The band has been playing these songs and other from that era ever since. In 2009 the band also started performing a new ska song, \"Open Up Your Eyes\", which later appeared on their 2010 Going on Tour EP and their 2012 Day Job album.\n",
         "Part of the band's claim to fame has been its live shows which often involve dance routines far more complicated than those often found in ska bands, as horn playing usually inhibits movement on stage.\n"
      ]
   },
   "Summary": {
      "text": [
         "Suburban Legends are an American ska punk band[1] that formed in Huntington Beach, California, in 1998 and later based themselves in nearby Santa Ana. After building a fanbase in the Orange County ska scene through their numerous regular performances at the Disneyland Resort, a series of lineup changes in 2005 introduced elements of funk and disco into the group's style.\n",
         "Since 2009, the band has gradually returned to its ska roots, and has also recorded cover versions of songs from Disney films and television series.\n"
      ]
   },
   "Timeline": {},
   "Title": "Suburban Legends - Wikipedia"
}