{
   "Name": "Three Dog Night",
   "rawData": [
      "Three Dog Night is an American rock band formed in 1967, with founding members consisting of vocalists Danny Hutton, Cory Wells, and Chuck Negron. This lineup was soon augmented by Jimmy Greenspoon (keyboards), Joe Schermie (bass), Michael Allsup (guitar), and Floyd Sneed (drums). The band had 21 Billboard Top 40 hits between 1969 and 1975, with three hitting number one. Three Dog Night recorded many songs written by outside songwriters, and they helped to introduce mainstream audiences to writers such as Paul Williams (\"An Old Fashioned Love Song\") and Hoyt Axton (\"Joy to the World\").\n",
      "The official commentary included in the CD set Celebrate: The Three Dog Night Story, 1965–1975 states that vocalist Danny Hutton's girlfriend, actress June Fairchild (best known as the \"Ajax Lady\" from the Cheech and Chong movie Up In Smoke) suggested the name after reading a magazine article about Aboriginal Australians, in which it was explained that on cold nights they would customarily sleep in a hole in the ground while embracing a dingo, a native species of wild dog. On colder nights they would sleep with two dogs and, if the night were freezing, it was a \"three dog night\".\n",
      "Musician Van Dyke Parks, an arranger at Warner Bros Records, disputed the above story and claimed that he coined the name. He wrote, \"I wuz nuts about Hutton's girlfriend. Quite a dancer. Yet, she didn’t read Mankind magazine, nor have an inkling of anthtopology   and the cold aboriginal nights that inspired my suggestion.\"\n"
   ],
   "infobox": {
      "Also known as": [
         "Redwood (1967–1968)"
      ],
      "Origin": [
         "Los Angeles"
      ],
      "Genres": [
         "Pop rock[1]",
         "boogie rock",
         "hard rock",
         "soft rock",
         "blue-eyed soul[2]"
      ],
      "Years active": [
         "1967–1976, 1981–present"
      ],
      "Labels": [
         "Dunhill, MGM, MCA, Epic, Columbia"
      ],
      "Associated acts": [
         "The Enemys, Cory Wells Blues Band, SS Fools"
      ],
      "Members": [
         "Danny Hutton",
         "Michael Allsup",
         "Paul Kingery",
         "Pat Bautz",
         "David Morgan",
         "Howard Laravea"
      ],
      "Past members": [
         "Cory Wells",
         "Chuck Negron",
         "Jimmy Greenspoon",
         "Floyd Sneed",
         "Joe Schermie",
         "Ron Morgan",
         "Jack Ryland",
         "Skip Konte",
         "Mickey McMeel",
         "James \"Smitty\" Smith",
         "Dennis Belfield",
         "Al Ciner",
         "Jay Gruska",
         "Ron Stockert",
         "Mike Seifrit",
         "Richard Grossman",
         "John Mrowiec   Mike Keeley",
         "Scott Manzo",
         "Steve Ezzo",
         "Gary Moon",
         "T.J. Parker",
         "Richard Campbell",
         "Mike Cuneo"
      ]
   },
   "albums": [
      "Three Dog Night",
      "Suitable for Framing",
      "It Ain't Easy",
      "Naturally",
      "Harmony",
      "Seven Separate Fools",
      "Cyan",
      "Hard Labor",
      "Coming Down Your Way",
      "American Pastime",
      "It's a Jungle"
   ]
}