{
   "Name": "Throwdown (band)",
   "rawData": [
      "Throwdown is an American straight edge hardcore punk band from Orange County, California. They have toured as part of Ozzfest, Sounds of the Underground, Hellfest, and Warped Tour, as well as with bands such as In Flames, Lamb of God, As I Lay Dying, Killswitch Engage, Korn and Cavalera Conspiracy. The songs \"Forever\" and \"Burn\" were staples on MTV2's Headbanger's Ball and Revolver Magazine called them part of \"The Future of Metal\" after hearing the album Vendetta. Initially branded a hardcore punk band, albums like Venom and Tears and Deathless took a sharp turn towards metal, with critics likening the band's sound to that of Pantera, Sepultura, and Crowbar.\n",
      "Throwdown was formed in 1997 by vocalist Keith Barney, an active member of both Adamantium and Eighteen Visions, guitarists Tommy Love and Javier Van Huss, bassist Dom Macaluso, and drummer Marc Jackson. The group took on the title Throwdown as a \"wry irony on their collective stature,\" at the time no band member being more than 5 feet 8 inches (1.73 m). The band released their debut, self-titled 7-inch single that same year through Prime Directive Records. Van Huss left the band and was replaced by Brandan Schieppati. After signing a recording contract with Indecision Records, they released their first studio album Beyond Repair the following year. Schieppati was replaced by Dave Peters. The following year, the new line-up released the Drive Me Dead EP.\n",
      "In 2001, Throwdown was scheduled to release a split 7\" vinyl with Poison the Well through Surprise Attack Records. Instead, the band released their second studio album, You Don't Have to Be Blood to Be Family. Not long afterward, Jackson left the band, who, lacking a permanent replacement, recruited Barney's 18 Visions bandmate Ken Floyd to fill-in. Floyd appeared on their self-released 2002 EP Face the Mirror. The same year, Barney told the band he'd like to switch from vocals to guitar, as he would often lose his voice on tour, so Peters took over on vocals. Barney would often miss shows due to his commitments to 18 Visions; Matt Mentley was drafted to fill in for him.\n"
   ],
   "infobox": {
      "Origin": [
         "Orange County, California, U.S."
      ],
      "Genres": [
         "Metalcore[1]",
         "groove metal[2]",
         "hardcore punk[1]"
      ],
      "Years active": [
         "1997–present"
      ],
      "Labels": [
         "Indecision",
         "Prime Directive",
         "Trustkill",
         "Koch",
         "Nuclear Blast",
         "E1 Music"
      ],
      "Associated acts": [
         "Bleeding Through",
         "Culture",
         "Eighteen Visions",
         "Unashamed"
      ],
      "Website": [
         "www.throwdownoc.com"
      ],
      "Members": [
         "Dave Peters",
         "Matt Mentley"
      ],
      "Past members": [
         "Keith Barney",
         "Tommy Love",
         "Dom Macaluso",
         "Brandan Schieppati",
         "Javier Van Huss",
         "Marc Jackson",
         "Mark Choiniere",
         "Mark Mitchell",
         "Ben Dussault"
      ]
   }
}