{
   "Name": "Throwdown (band)",
   "Sections": [
      "1 History",
      "1.1 Early years (1997–2002)",
      "1.2 Haymaker (2003–2004)",
      "1.3 Vendetta (2005–2006)",
      "1.4 Venom & Tears (2007–2008)",
      "1.5 Deathless (2009–2013)",
      "1.6 Intolerance & Take Cover (2014–present)",
      "2 Members",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Extended plays",
      "3.3 Videos",
      "3.4 Music videos",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Throwdown is an American straight edge[3] hardcore punk band from Orange County, California. They have toured as part of Ozzfest, Sounds of the Underground, Hellfest, and Warped Tour, as well as with bands such as In Flames, Lamb of God, As I Lay Dying, Killswitch Engage, Korn and Cavalera Conspiracy. The songs \"Forever\" and \"Burn\" were staples on MTV2's Headbanger's Ball and Revolver Magazine called them part of \"The Future of Metal\" after hearing the album Vendetta. Initially branded a hardcore punk band, albums like Venom and Tears and Deathless took a sharp turn towards metal, with critics likening the band's sound to that of Pantera, Sepultura, and Crowbar.\n"
      ]
   },
   "History": {
      "Early years (1997–2002)": {
         "text": [
            "Throwdown was formed in 1997 by vocalist Keith Barney, an active member of both Adamantium and Eighteen Visions, guitarists Tommy Love and Javier Van Huss, bassist Dom Macaluso, and drummer Marc Jackson. The group took on the title Throwdown as a \"wry irony on their collective stature,\" at the time no band member being more than 5 feet 8 inches (1.73 m). The band released their debut, self-titled 7-inch single that same year through Prime Directive Records. Van Huss left the band and was replaced by Brandan Schieppati. After signing a recording contract with Indecision Records, they released their first studio album Beyond Repair the following year. Schieppati was replaced by Dave Peters. The following year, the new line-up released the Drive Me Dead EP.[4]\n",
            "In 2001, Throwdown was scheduled to release a split 7\" vinyl with Poison the Well through Surprise Attack Records.[5] Instead, the band released their second studio album, You Don't Have to Be Blood to Be Family. Not long afterward, Jackson left the band, who, lacking a permanent replacement, recruited Barney's 18 Visions bandmate Ken Floyd to fill-in. Floyd appeared on their self-released 2002 EP Face the Mirror. The same year, Barney told the band he'd like to switch from vocals to guitar, as he would often lose his voice on tour, so Peters took over on vocals. Barney would often miss shows due to his commitments to 18 Visions; Matt Mentley was drafted to fill in for him.\n"
         ]
      },
      "Haymaker (2003–2004)": {
         "text": [
            "In 2003, Throwdown recorded and released Haymaker, featuring the Peters-penned straight-edge anthem \"Forever,\" on Trustkill Records. The lineup was Peters on vocals, Macaluso on bass, Love & Barney on guitars, and session drummer Jarred Alexander. A tour with Hatebreed followed in support of the album's release. \n",
            "As Barney stayed busy with 18 Visions, Macaluso and Love started the band The Lost, who released an EP with Indecision very reminiscent of the group HIM. \n",
            "Mentley officially replaced Barney in 2004. The band played Japan, with a fill in drummer, and embarked on a short tour of Europe with new drummer Ben Dussault. Former drummer Jackson filled in for Love, on guitar. Peters, Mentley, Dussault, Macaluso, and Love spent the summer of 2004 on Ozzfest's second stage. In the fall, they toured with Norma Jean, followed by a successful U.S. tour co-headlined by Lamb Of God and Fear Factory, with additional support from Children of Bodom. Love left the band, on good terms, at the end of that year.\n"
         ]
      },
      "Vendetta (2005–2006)": {
         "text": [
            "Throwdown spent the early part of the year recording Vendetta, made at Planet Z Studios with producer Zeuss. Mark Choiniere joined the band shortly before the album was recorded, although he does not appear in the music video for \"Burn\". Peters, Dussault, Choiniere, Mentley and Macaluso hit the inaugural Sounds of the Underground tour that summer. \n",
            "In the fall, they headlined a US tour sponsored by To Die for Clothing with Sinai Beach as support. Following this tour, Macaluso, the band's only remaining original member, exited Throwdown. Mentley switched to bass, with Mark Choiniere covering all guitar duties in the live setting. Throwdown has remained a four-piece ever since.\n",
            "Throwdown toured with As I Lay Dying, In Flames and Soulfly at various points, co-headlined with The Black Dahlia Murder and went to South America, Australia and on a US headliner with Zao, Evergreen Terrace and Maylene and the Sons of Disaster as support. They also played a handful of West Coast Vans Warped Tour dates and the UK's Download Festival in 2006, alongside Metallica and Guns N' Roses.\n"
         ]
      },
      "Venom & Tears (2007–2008)": {
         "text": [
            "Throwdown recorded Venom & Tears with producer Mudrock in Los Angeles. \n",
            "They spent the summer headlining the Ernie Ball stage on the Vans Warped Tour. After the tour, they filmed a video for \"Holy Roller\" with director Andy Reale. In the fall, they supported Machine Head on a US tour. Mentley left the band afterward. His replacement, Mark Mitchell, made his live debut in South America in December. Mitchell had previously been the vocalist in the straight edge, vegan metalcore band Culture in the mid-1990s and had also played guitar in Until the End and Red Roses for a Blue Lady.[6]\n",
            "In February, the band commenced headlining the \"Scum of the Earth Tour\" in support of Venom and Tears with Soilwork, Through the Eyes of the Dead and War of Ages in tow. They also appeared on tour with Korn in Australia in April. This was followed by a trek supporting Killswitch Engage in Canada and a return to the UK Download Festival, as well as several other European festivals and shows. They next toured in the US with Cavalera Conspiracy, sharing the main support slot with the Dillinger Escape Plan. Dussault exited the band sometime after that tour. \n",
            "In March 2008, Throwdown announced that they had fulfilled their contractual obligations and were no longer signed to Trustkill Records. In December 2008, the band signed to Koch Records and began working on their sixth album.[7] In the same announcement, it was stated that Jarrod Alexander, who worked with the band on Haymaker, would return for the new album.\n"
         ]
      },
      "Deathless (2009–2013)": {
         "text": [
            "In February 2009, the band played at the second annual MusInk festival in Orange County, supporting Danzig and The Used.\n",
            "In the Spring, Throwdown began recording with Mudrock (who previously recorded Venom & Tears) in Los Angeles. The new album featured Peters, Choiniere, Mitchell, and session drummer Alexander. The album was mixed by Zeuss, who had produced and mixed Vendetta. \n",
            "They spent September and October touring Europe with Chimaira and Unearth, with Living Sacrifice drummer Lance Garvin behind the kit.[8]\n",
            "On November 10, 2009, Throwdown released Deathless in North America via Koch (now called eOne). \n",
            "In November and December, they headlined the Deathless Tour across America, with support from Bury Your Dead, For Today, ABACABB, and The World We Knew, again with the lineup of Peters, Choiniere, Mitchell, and Garvin. \n",
            "In December, the band announced they would join Five Finger Death Punch and Shadows Fall on a lengthy U.S. tour set for January and February of 2010. However, without a permanent replacement for Dussault, Choiniere opted to bow out of Throwdown roughly two weeks before the start of the tour. Throwdown dropped out of the tour and was replaced on the bill by the band God Forbid. \n",
            "Deathless was released in Europe on January 25, 2010, via Nuclear Blast Records.\n",
            "In October 2011, Throwdown headlined a short West Coast trek dubbed \"Brawloween.\" The lineup was Peters and Mitchell with Demon Hunter drummer Tim \"Yogi\" Watts and then Bleeding Through guitarist Dave Nassie filling in. Support for the shows included Carnifex, First Blood, and Suffokate.\n"
         ]
      },
      "Intolerance & Take Cover (2014–present)": {
         "text": [
            "After a long period of inactivity, Throwdown released a new album, Intolerance, on January 21, 2014, via eOne Music.[9] It was produced by Peters with Davey Worsop and mixed/mastered by Zeuss. Peters performed everything on the album, save for drums (handled by longtime session player Alexander) and guitar solos, which were tracked by Nassie. [10] Since the release of Intolerance, the band has made only two live appearances: at Canada's Amnesia Rockfest in 2014 and Belgium's Groezrock festival in 2015. Both shows featured Dave Peters on vocals and the return of bassist Matt Mentley, with Alexander and Nassie filling in.[11]\n",
            "In April 2020, Throwdown released a surprise EP, Take Cover, collecting five cover songs from over the years. The EP was issued by the band's own label, Pit Viper Records. Throwdown's Trustkill era albums are now on all digital services via Pit Viper Records, as well.[12]\n"
         ]
      }
   },
   "Members": {
      "text": [
         "Current\n",
         "Former\n",
         "\n",
         "Touring\n",
         "\n",
         "Timeline\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Extended plays": {},
      "Videos": {},
      "Music videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Throwdown is an American straight edge[3] hardcore punk band from Orange County, California. They have toured as part of Ozzfest, Sounds of the Underground, Hellfest, and Warped Tour, as well as with bands such as In Flames, Lamb of God, As I Lay Dying, Killswitch Engage, Korn and Cavalera Conspiracy. The songs \"Forever\" and \"Burn\" were staples on MTV2's Headbanger's Ball and Revolver Magazine called them part of \"The Future of Metal\" after hearing the album Vendetta. Initially branded a hardcore punk band, albums like Venom and Tears and Deathless took a sharp turn towards metal, with critics likening the band's sound to that of Pantera, Sepultura, and Crowbar.\n",
      "Throwdown was formed in 1997 by vocalist Keith Barney, an active member of both Adamantium and Eighteen Visions, guitarists Tommy Love and Javier Van Huss, bassist Dom Macaluso, and drummer Marc Jackson. The group took on the title Throwdown as a \"wry irony on their collective stature,\" at the time no band member being more than 5 feet 8 inches (1.73 m). The band released their debut, self-titled 7-inch single that same year through Prime Directive Records. Van Huss left the band and was replaced by Brandan Schieppati. After signing a recording contract with Indecision Records, they released their first studio album Beyond Repair the following year. Schieppati was replaced by Dave Peters. The following year, the new line-up released the Drive Me Dead EP.[4]\n",
      "In 2001, Throwdown was scheduled to release a split 7\" vinyl with Poison the Well through Surprise Attack Records.[5] Instead, the band released their second studio album, You Don't Have to Be Blood to Be Family. Not long afterward, Jackson left the band, who, lacking a permanent replacement, recruited Barney's 18 Visions bandmate Ken Floyd to fill-in. Floyd appeared on their self-released 2002 EP Face the Mirror. The same year, Barney told the band he'd like to switch from vocals to guitar, as he would often lose his voice on tour, so Peters took over on vocals. Barney would often miss shows due to his commitments to 18 Visions; Matt Mentley was drafted to fill in for him.\n",
      "In 2003, Throwdown recorded and released Haymaker, featuring the Peters-penned straight-edge anthem \"Forever,\" on Trustkill Records. The lineup was Peters on vocals, Macaluso on bass, Love & Barney on guitars, and session drummer Jarred Alexander. A tour with Hatebreed followed in support of the album's release. \n"
   ],
   "infobox": {
      "Origin": [
         "Orange County, California, U.S."
      ],
      "Genres": [
         "Metalcore[1]",
         "groove metal[2]",
         "hardcore punk[1]"
      ],
      "Years active": [
         "1997–present"
      ],
      "Labels": [
         "Indecision",
         "Prime Directive",
         "Trustkill",
         "Koch",
         "Nuclear Blast",
         "E1 Music"
      ],
      "Associated acts": [
         "Bleeding Through",
         "Culture",
         "Eighteen Visions",
         "Unashamed"
      ],
      "Website": [
         "www.throwdownoc.com"
      ],
      "Members": [
         "Dave Peters",
         "Matt Mentley"
      ],
      "Past members": [
         "Keith Barney",
         "Tommy Love",
         "Dom Macaluso",
         "Brandan Schieppati",
         "Javier Van Huss",
         "Marc Jackson",
         "Mark Choiniere",
         "Mark Mitchell",
         "Ben Dussault"
      ]
   }
}