{
   "Name": "The Vandals",
   "rawData": [
      "The Vandals are an American punk rock band, established in 1980 in Orange County, California, United States. They have released ten full-length studio albums, two live albums, and have toured the world extensively, including performances on the Vans Warped Tour. They are well known for their use of humor, preferring to use their music as a vehicle for comedy and sarcasm rather than as a platform for more serious issues. As of 2000, they are signed to Kung Fu Records.\n",
      "The band's lineup fluctuated significantly over their first nine years, though founding members Steven Ronald Jensen, guitarist Jan Nils Ackermann, and first consistent drummer Joe Escalante remained regular fixtures. Of the early members, only Escalante has remained through all subsequent incarnations of the band. The current lineup of Escalante, Dave Quackenbush, Warren Fitzgerald, and Josh Freese has remained intact since 1990 and is generally considered far removed from the band's early 1980s incarnation. Since 2002 Escalante has released all of the band's albums through his Kung Fu Records label, with Fitzgerald generally producing.\n",
      "The Vandals formed in 1980 in Huntington Beach, California by guitarist Jan Nils Ackermann. Soon vocalist Steven Ronald \"Stevo\" Jensen (1959 – August 21, 2005) was found and he and Ackermann practiced and performed with a rotating cast of other members before a permanent lineup coalesced to include bassist Steve \"Human\" Pfauter and drummer Joe Escalante. Other early members included Steve Gonzalez on bass and Vince Mesa on drums.\n"
   ],
   "infobox": {
      "Also known as": [
         "S.N.I.V. (Stevo's New and Improved Vandals)",
         "Anarchy Taco[1]"
      ],
      "Origin": [
         "Huntington Beach, California, United States"
      ],
      "Genres": [
         "Punk rock",
         "pop punk",
         "cowpunk[2]",
         "comedy rock",
         "comedy punk",
         "skate punk",
         "melodic hardcore",
         "hardcore punk",
         "ska punk"
      ],
      "Years active": [
         "1980–present"
      ],
      "Labels": [
         "Epitaph",
         "National Trust",
         "Enigma",
         "Restless",
         "Triple X",
         "Nitro",
         "Kung Fu",
         "Time Bomb"
      ],
      "Associated acts": [
         "Oingo Boingo",
         "Devo",
         "6 Voltios"
      ],
      "Website": [
         "www.vandals.com/Vandals/The_Vandals.html"
      ],
      "Members": [
         "Joe Escalante",
         "Dave Quackenbush",
         "Josh Freese",
         "Warren Fitzgerald"
      ],
      "Past members": [
         "Jan Nils Ackermann",
         "Steven Ronald Jensen (\"Stevo\") (deceased)",
         "Steve \"Human\" Pfauter",
         "Vince Mesa",
         "Steve Gonzalez",
         "Bob Emory",
         "Brent Turner",
         "Chalmer Lumary",
         "Robbie Allen",
         "Doug MacKinnon",
         "Todd Barnes (1989)"
      ]
   }
}