{
   "Band members": {},
   "Bibliography": {},
   "Discography": {
      "Studio albums": {}
   },
   "History": {
      "text": [
         "Forming the band in 1984, Vinnie Vincent recruited bassist Dana Strum, who had served as a talent scout in L.A., recruiting band members for the likes of Ozzy Osbourne. Strum had found both Jake E. Lee and the late Randy Rhoads for Ozzy Osbourne, so when Paul Stanley had contacted Osbourne to inquire about where he found the guitarists, he was given Strum's name. Unable to find anyone KISS considered to be on Vincent's level, Strum decided to find Vincent himself in hopes of working together. Bobby Rock came on board as the drummer. With the nucleus of the band completed, the band searched for a lead vocalist.[citation needed]\n",
         "Former Journey singer Robert Fleischman provided vocals on Vinnie Vincent Invasion's self-titled debut album. The record included primarily the style of glam metal, with much of it re-worked versions of demos Vincent recorded in 1982 with former New England members Hirsch Gardner, Gary Shea, and Jimmy Waldo under the band name Warrior, with Vincent essentially replacing John Fannon as guitarist and vocalist. Warrior disbanded when Vincent was selected to be a member of KISS.[citation needed]\n",
         "Fleischman exited the band during a contract dispute and a video was produced for the song \"Boyz Are Gonna Rock\" with new vocalist Mark Slaughter lipsyncing over Fleischman's vocal track. With Slaughter now on board, the band released their second album, All Systems Go in May 1988. The album featured one of the group's best-known hits, \"Ashes to Ashes,\" and \"Love Kills,\" which appeared on the A Nightmare on Elm Street 4: The Dream Master soundtrack.[citation needed]\n",
         "Later in 1988, the band was released from their contract with Chrysalis Records. Having grown annoyed with what they perceived to be Vincent's domination of the project, Slaughter and Strum left to form the band Slaughter, which would go on to have success. Bobby Rock has played as a touring drummer for Slaughter, but was not in the initial line-up. After Vinnie Vincent Invasion broke up, he briefly joined Nitro, later Nelson, and then went on to play as a session musician with Gary Hoey and other bands. Subsequent to the band's release from their Chrysalis contract and the resultant split of Slaughter and Strum to form Slaughter, Vincent reunited with original Vinnie Vincent Invasion vocalist Robert Fleischman and recorded the unreleased album Pyro Messiah (aka Guitars From Hell). Andre LaBelle, (drummer from 1989 to 1992), along with Fleischman, formed a new band \"The Sky\" in 2011.[1]\n",
         "A tribute album entitled KISS MY ANKH: A Tribute To Vinnie Vincent was released by SplitScreen Entertainment on August 27, 2008. The album consists of new recordings of songs from Vincent's careers with KISS and Vinnie Vincent Invasion. Featured artists include Steve Brown of Trixter, Troy Patrick Farrell of White Lion, T.J. Racer of Nitro, Sheldon Tarsha of Adler's Appetite, Chris Caffery of Savatage and Trans-Siberian Orchestra, Ryan Roxie and Rick Marty of Alice Cooper, and rock and roll comic C.C. Banana, who performs a parody of the KISS song \"Unholy\" (rewritten as a roast of Danger Danger vocalist Ted Poley).[2]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Band members",
      "3 Discography",
      "3.1 Studio albums",
      "4 References",
      "5 Bibliography"
   ],
   "Summary": {
      "text": [
         "Vinnie Vincent Invasion was an American glam metal band, formed in 1984 by former Kiss guitarist Vinnie Vincent.\n"
      ]
   },
   "Title": "Vinnie Vincent Invasion - Wikipedia"
}