{
   "Name": "Vinnie Vincent Invasion",
   "rawData": [
      "Vinnie Vincent Invasion was an American glam metal band, formed in 1984 by former Kiss guitarist Vinnie Vincent.\n",
      "Forming the band in 1984, Vinnie Vincent recruited bassist Dana Strum, who had served as a talent scout in L.A., recruiting band members for the likes of Ozzy Osbourne. Strum had found both Jake E. Lee and the late Randy Rhoads for Ozzy Osbourne, so when Paul Stanley had contacted Osbourne to inquire about where he found the guitarists, he was given Strum's name. Unable to find anyone KISS considered to be on Vincent's level, Strum decided to find Vincent himself in hopes of working together. Bobby Rock came on board as the drummer. With the nucleus of the band completed, the band searched for a lead vocalist.\n",
      "Former Journey singer Robert Fleischman provided vocals on Vinnie Vincent Invasion's self-titled debut album. The record included primarily the style of glam metal, with much of it re-worked versions of demos Vincent recorded in 1982 with former New England members Hirsch Gardner, Gary Shea, and Jimmy Waldo under the band name Warrior, with Vincent essentially replacing John Fannon as guitarist and vocalist. Warrior disbanded when Vincent was selected to be a member of KISS.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Hard rock, heavy metal, glam metal"
      ],
      "Years active": [
         "1984–1989"
      ],
      "Labels": [
         "Chrysalis"
      ],
      "Associated acts": [
         "Slaughter"
      ],
      "Past members": [
         "Vinnie Vincent",
         "Dana Strum",
         "Bobby Rock",
         "Mark Slaughter",
         "Robert Fleischman"
      ]
   },
   "albums": [
      "Headbangers"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band, formed in [YEAR] by former Kiss guitarist [PERSON_NAME_FULL_0_MALE].\n",
      "Forming the band in [YEAR], [PERSON_NAME_FULL_2_MALE] recruited bassist Dana Strum, who had served as a [GENRE] band members for the likes of [PERSON_NAME_FULL_3_MALE]. Strum had found both Jake E. Lee and the late [PERSON_NAME_FULL_0_MALE] for [PERSON_NAME_FULL_3_MALE], so when Paul Stanley had contacted [PERSON_NAME_LAST_3] to inquire about where he found the guitarists, he was given Strum's name. Unable to find anyone KISS considered to be on [PERSON_NAME_LAST_2]'s level, Strum decided to find [PERSON_NAME_LAST_2] himself in hopes of working together. [PERSON_NAME_FULL_1_MALE] came on board as the drummer. With the nucleus of the band completed, the band searched for a lead vocalist.\n",
      "Former Journey singer Robert Fleischman provided vocals on [BAND_NAME]'s self-titled debut album. The record included primarily the style of glam metal, with much of it re-worked versions of demos Vincent recorded in [YEAR] with former New England members Hirsch Gardner, Gary Shea, and [PERSON_NAME_FULL_0_MALE] under the band name Warrior, with Vincent essentially replacing John Fannon as guitarist and vocalist. Warrior disbanded when Vincent was selected to be a [GENRE]"
   ]
}