{
   "Name": "Volumes (band)",
   "rawData": [
      "Volumes (stylized sometimes as VOLUMES) is an American progressive metalcore band and self-proclaimed \"groove metal\" band based in Los Angeles, California. The group consists of  bassist Raad Soudani, vocalists Myke Terry and Michael Barr, and drummer Nick Ursich. The group was founded in 2009 By Daniel Braunstein, Diego & Gus Farias and debuted with their first EP, The Concept of Dreaming in 2010. This was followed with their debut album Via (2011) and their sophomore album No Sleep in 2014. Both albums peaked at No. 1 on the iTunes Rock and Metal charts.\n",
      "Volumes make use of \"bouncy\" guitar riffs, groove-driven breakdowns, nu metal influence and dual lead vocalists. The band has been credited as an important contributor to the djent scene, and has also been associated with groove metal.\n",
      "Throughout the band's history, bassist Raad Soudani has remained the only constant member.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Progressive metalcore[1]",
         "nu metal",
         "djent[2]"
      ],
      "Years active": [
         "2009–present"
      ],
      "Labels": [
         "Fearless",
         "Mediaskare"
      ],
      "Associated acts": [
         "Bury Your Dead",
         "Born Of Osiris",
         "Emmure",
         "Issues",
         "Sylar",
         "Pouya"
      ],
      "Website": [
         "fearlessrecords.com/artists/volumes/"
      ],
      "Members": [
         "Michael Barr",
         "Raad Soudani",
         "Nick Ursich",
         "Myke Terry"
      ],
      "Past members": [
         "Daniel Schwartz",
         "Chris Khoury",
         "Daniel Braunstein",
         "Gus Farias",
         "Diego Farias"
      ]
   },
   "albums": [
      "Via",
      "No Sleep",
      "Different Animals"
   ],
   "prunedData": [
      "[BAND_NAME] (stylized sometimes as VOLUMES) is an [GENRE] band and self-proclaimed [SONG_NAME] band based in Los Angeles, California. The group consists of  bassist Raad Soudani, vocalists Myke Terry and [PERSON_NAME_FULL_0_MALE], and drummer Nick Ursich. The group was founded in [YEAR] By [PERSON_NAME_FULL_1_MALE], Diego & Gus Farias and debuted with their first EP, The Concept of Dreaming in [YEAR]. This was followed with their debut album Via ([YEAR]) and their sophomore album No Sleep in [YEAR]. Both albums peaked at No. 1 on the iTunes Rock and Metal charts.\n",
      "[BAND_NAME] make use of [SONG_NAME] guitar riffs, groove-driven breakdowns, nu metal influence and dual lead vocalists. The band has been credited as an [GENRE]",
      "Throughout the band's history, bassist Raad Soudani has remained the only constant member.\n"
   ]
}