{
   "Controversy": {
      "text": [
         "In an Alternative Press article pressed in late January 2013, it was reported that Volumes had been banned from Rocketown in Nashville, after vocalist Michael Barr was evicted from the venue for dedicating a song to a gay friend.[68] However, later reports described how Barr was escorted from the venue by security after he had assaulted crowd members whilst hardcore dancing to other bands, and that he was \"looking for a fight\" while doing so. Some crowd members ganged up on Barr, at which point security had arrived to the situation and ultimately escorted Barr from the venue. After being denied access back inside when attempting to re-enter the venue, Barr allegedly shouted pejorative slurs at the concert promoter working the door.[69] The band was still not allowed at the venue when they returned to the area three years later with a new vocalist.[70]\n",
         "In February 2017, vocalist Gus Farias generated controversy when he failed to deliver on paid guest spots for other bands, later offering refunds.[71]\n"
      ]
   },
   "Discography": {
      "text": [
         "Albums\n",
         "EPs\n",
         "Collaborations\n"
      ]
   },
   "History": {
      "Coming Clean and firing Gus Farias (2019)": {
         "text": [
            "On April 23, 2019, the band surprised released their EP Coming Clean, having spent the last eight months working on it and recorded the effort throughout Southern California out of Butter Studios in Venice, West Alley Recording Studios, and Farias Productions. Self-producing and keeping everything \"in-house and organic\", they enlisted Kyle Black (Pierce the Veil, New Found Glory) and Max Schad (Veil of Maya) for additional perspective. Bassist Soudani declared that \"...Coming Clean is an emotional moment for us\" and that \"...I hope you feel something when you hear it and gain some perspective. This is Volumes. Coming Clean hints at where we're headed in the future.\"[57][58] On May 9, the band released a music video for the song \"Until the End\", directed by Joshua Fu.[59][60]\n",
            "On December 16, vocalist Gus Farias addressed his departure from the band releasing the following statement: “I just want to make it clear that I did not quit. I love being in the band. I got kicked out for personal bullshit, which really is bullshit. I’m gonna be the bigger man and not air out business like that. I got a check, I secured my royalties. I’m out. I’m putting me first. I’m putting everything I got into Yogi. I know what it took to get Volumes where it’s at because I had a big, big, big part in it…”.[61] Farias later wrote to Twitter in January to chastise the band over Michael Barr rejoining Volumes.[62]\n"
         ]
      },
      "Departure of Barr, arrival of Terry and Different Animals (2015–2019)": {
         "text": [
            "On October 5, 2015, it was announced by the band that Barr would be sitting out their European tour with Northlane to continue working on the upcoming album and further the creative process. Consequently, The Contortionist frontman Michael Lessard would be filling in.[40] The following month on the 19th Volumes announced that Barr had departed from the band due to not wanting to scream & or pursue metal as well as conflicts with other vocalist Gus Frais. , and Born of Osiris member Joe Buras will be stepping in for current touring duties until their new vocalist is announced.[41][42] It wouldn't be until the following year that Barr would return to music with a solo project, separate from the rest of the band.[43]\n",
            "On June 5, 2016, the band announced that they had finally found their permanent replacement for Barr, with former Bury Your Dead vocalist Myke Terry.[44][45] On the 16th the band followed the announcement of their new vocalist with the news that they had left Mediaskare Records and signed with Fearless Records also releasing their new single, \"Feels Good\" and first song with new vocalist Terry.[46][47] Bassist Raad Soudani expressed that the band \"..ultimately came to the decision to sign with Fearless Records after spending years watching them evolve into one of the top labels\" and \"...Fearless Records 'family' is a perfect fit for Volumes. We feel more confident moving forward as group and believe this opportunity will open\".\n",
            "On June 29, 2016, the band re-released both Via and No Sleep through their own record label \"91367 Records.\" It was revealed that their previous label, Mediaskare, had not given them income from the sales of their first 2 studio albums, with each selling over 40,000 copies to date.[48]\n",
            "On February 7, 2017, According to a report from RockFeed, Volumes vocalist Gus Farias and ex-vocalist Michael Barr got into a heated Twitter discussion regarding drugs, jealousy and their past relationship with each other. After Gus Farias targeted Barr with a tweet regarding his take on the ex-member’s solo project, Barr responded, trying to respectfully sort out the matter, even wishing Farias the best and stating his comments were “unfortunate.”[49] On the 19, Volumes released the single, \"On Her Mind\" featuring rapper Pouya. Alongside the single, they announced that their new album, entitled \"Different Animals\", would be released on June 9 through Fearless Records.[50] During the New Reign tour with Born of Osiris, Volumes premiered their new song \"Left For Dead\" live.[51]\n",
            "On March 10, 2017, while still on tour with Oceans Ate Alaska, Born of Osiris, Within the Ruins and Fire from the Gods the band announced an upcoming spring headlining tour beginning on April 23 with supporting act Fire from the Gods.[52]\n",
            "On June 12, 2017, the band released the music video for their single, \"Finite\" directed by Samuel Halleen.[53] On the 20, they were announced to be opening for Issues' upcoming fall \"Headspace\" headlining tour beginning September 24 in Ft. Lauderdale, FL.[54]\n",
            "On November 16, 2017, as the music industry mourned the loss of Lil Peep, who was a friend of the band's vocalist, Gus Farias, took to Twitter to state he will be checking himself into rehab.[55]\n",
            "On December 6, 2018, it was announced via Game Informer that former vocalist Michael Barr would be providing vocals to Capcom's Devil May Cry 5  video game after original Suicide Silence vocalist Eddie Hermida was removed from the track following sexual misconduct allegations. Barr will appear on the track, \"Subhuman\" co-written by the game's composer Cody Matthew Johnson.[56]\n"
         ]
      },
      "Formation, The Concept of Dreaming and Via (2009–2013)": {
         "text": [
            "The band was founded in January 2009, by guitarists and songwriter Diego Farias, His older brother screamer and rapper Gus Farias and Producer, guitarist and song writer Daniel Braunstein. Originally was planned to just be a studio project until Gus insisted the project had to be a full band & pursued full time upon hearing the first demo recordings which were 30 second tracks consisting of just a riff or two full songs were written once agreed a full band was to be formed.[5][6] The trio began searching for likeminded musicians in the area to further their heavy metal, hip-hop, jazz and classical influenced music, and would go on to expand the band's lineup, Originally there was only suppose to be one vocalist but upon Gus’s request to have duel singers he suggested Michael Barr to be added as well as being the one to suggest bass player Raad Soudani and drummer Chris Khoury.[7][8] After completing their lineup, the band began work on their debut EP, The Concept of Dreaming with an expected release date of December 2009. But publication came to a halt when guitarist Daniel Braunstein decided to leave the band citing time constraints with both university and no longer being able to participate actively in the band. He was soon replaced by guitarist Daniel Schwartz, and the band was able to continue working on the EP.\n",
            "On September 29, 2009 the band was signed to Mediaskare Records, with vocalist Gus Farias stating that the band is \"..stoked to announce that we have signed to Mediaskare Records, joining a great team and roster of bands we look up to\". Along with the announcement of being signed, the band also revealed that their delayed EP, \"The Concept of Dreaming\" would be released on November 16, 2010.[9][10][11][12]\n",
            "On November 20, 2010, the band were announced to be a part of It Prevails' \"Dollar Menu, Where's the Venue? Tour\" in January 2011 with fellow acts Counterparts, Betrayal and Bermuda.[13][14]\n",
            "On February 1, 2011, the band was announced to be a part of the \"New England Metal and Hardcore Festival\" in Worcester, Ma.[15]\n",
            "On May 15, 2011, Volumes were announced to be a part of Arsonists Get All the Girls spring headlining tour with fellow bands A Plea for Purging, Lionheart and The Contortionist.[16] On the 23rd, the band was announced to be a part of the summer \"Slaughter Survivors Tour\" with fellow metal acts Conducting from the Grave, The Contortionist, Scale the Summit and Rings of Saturn.[17][18] On June 10, 2011 the band played a new Jersey show with metal acts Arsonists Get All the Girls and Failure in Vanity.[19]\n",
            "On August 24, 2011, the band released the first single \"Affirmation of Ascension\" from their forthcoming album and less than two weeks later on September 2, the band released their next single, \"Edge of the Earth\".[20][21] The band would go on to release their debut studio album, Via through Mediaskare Records on September 27, 2011, with it reaching #1 on the iTunes Rock & Metal Charts. Later on the band would release the music video for their song, \"Wormholes\" which originally appeared on their debut EP and also re-recorded for their debut album on October 13.[22]\n",
            "On November 23, 2011, Barr was forced to leave the band's tour due to a back injury. Barr had the following to say: \"If you haven't heard already, I unfortunately had to return home for the remainder of Thrash And Burn tour due to a severe and hazardous back injury requiring exclusive medical attention. Volumes will still be killing every show for the next 24 days. Please do not be discouraged, I will be back in full force soon. Thank you for all the support and kind comments, get out to the rest of the shows and have fun with my boys.\"[23]\n",
            "By the end of 2011, drummer Chris Khoury departed the band, leading to Daniel Schwartz taking over the drums at live shows. Schwartz would also leave the band by the end of the year. In early 2012, they found a new permanent replacement drummer, Nick Ursich.[24]\n",
            "On November 19, 2012, the band was announced as part of Of Mice & Men 2013 headlining tour from January to February alongside Texas in July, Woe, Is Me and Capture the Crown.[25] While on tour the band recorded a live music video featuring clean vocals from Woe, Is Me vocalist, Hance Alligood, and released the video on February 13, 2013.[26]\n",
            "On March 24, 2013, the band was announced to be a part of the 2013 Van's Warped Tour alongside fellow metal act Crown the Empire.[27] The following month they were announced to be a part of the summer All-Stars Tour alongside bands Iwrestledabearonce, For All Those Sleeping and DayShell.[28]\n",
            "On August 24, 2013, Volumes' posted footage from their summer spent on the Vans Warped Tour and following All-Stars Tour recapping the tours.[29] On the 29th the band's label released a professional recorded live video of the band performing their song, \"Intake\" while at Warped Tour on their YouTube channel.[30]\n"
         ]
      },
      "No Sleep and Mediaskare dispute (2013–2015)": {
         "text": [
            "On September 12, 2013, the band released a pre-production version of the song, \"Vahle\", a tribute song to a close friend of the band that  died in a car accident. A fully-mixed version of the song would later appear on the band's second outing.[31]\n",
            "On May 28, 2014, the band announced that their second album, No Sleep, would release on July 15 via Mediaskare Records. The effort was recorded in late 2013, with Brandon Hall Paddock and the band's guitarist, Diego Farias at the helm. Along with the announcement the band also released the lyric video for their song, \"The Mixture\" which appeared on the album.[32]\n",
            "On June 26, 2014, the band were announced to be a part of Crown the Empire's \"Welcome to the Resistance Tour\" alongside Ice Nine Kills, Secrets and The Family Ruin.[33][34]\n",
            "On July 13, 2014, the band released their next single, \"Erased\", from the album.[35] Two days later, they released No Sleep which reached #1 on the iTunes Rock and Metal Charts featuring the fully mastered version of \"Vahle\".\n",
            "On October 13, 2014, Volumes were announced to be contributing to Fearless Records' Punk Goes Pop 6, with a cover of Drake's \"Hold On, We're Going Home\".[36]\n",
            "In summer 2014, Volumes completed their first full US Vans Warped Tour in 2014.[37]\n",
            "On January 24, 2015, it was revealed that the band helped a man escape a serious car accident after a show in Lawrence, KS.[38]\n",
            "On February 5, 2015, after nearly two years of silence it was announced that the Volumes and Structures collaborative project originally announced in 2013, named \"Vol/tures\" had finally begun working on new material releasing a 15 second snippet of what is to come.[39]\n"
         ]
      },
      "Return of Barr, departure and death of Diego Farias, and new singles (2020–present)": {
         "text": [
            "On January 30, the band released a new single titled \"Holywater\", confirming rumors that Michael Barr was back in the band, and revealing that guitarist Diego Farias is no longer a part of the band.[63][64]\n",
            "Later the same day, the band released a statement on social media giving more of an insight into the lineup changes, giving clarity on the departure of the Farias brothers and the arrival of Barr. They also stated that Max Schad mixed and tracked the \"Holywater\" whilst also providing guitar for the band. Further talking about guitarists, they said that a touring guitarist will be with them for their upcoming UK/EU tour with Born Of Osiris, and they will \"figure out permanent guitarists when it organically happens\".[65]\n",
            "On February 6, former vocalist Gus Farias announced on his Twitter page that his brother and former guitarist of the band, Diego, had died.[66]\nThe band released their own personal statement on the band's official Twitter later the same day, reading:\n",
            "\"We are absolutely devastated by the tragic passing of Diego Farias. We are trying to cope and process this as it all seems so surreal. We send our love and thoughts to his brothers Gus and Andres, his mother and father, and his entire extended family.\n",
            "As we collect our thoughts we will then be able to properly convey them more. But for now... we love you Diego, rest in power.\n",
            "\n~ Volumes[67]",
            "On May 15, the band released a single entitled \"Pixelate\".\n"
         ]
      }
   },
   "Members": {
      "text": [
         "Current\n",
         "Former\n",
         "Session musicians\n",
         "Touring musicians\n",
         "\nTimeline\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation, The Concept of Dreaming and Via (2009–2013)",
      "1.2 No Sleep and Mediaskare dispute (2013–2015)",
      "1.3 Departure of Barr, arrival of Terry and Different Animals (2015–2019)",
      "1.4 Coming Clean and firing Gus Farias (2019)",
      "1.5 Return of Barr, departure and death of Diego Farias, and new singles (2020–present)",
      "2 Controversy",
      "3 Members",
      "4 Discography",
      "5 Videography",
      "6 References"
   ],
   "Summary": {
      "text": [
         "Volumes (stylized sometimes as VOLUMES) is an American progressive metalcore band and self-proclaimed \"groove metal\" band based in Los Angeles, California. The group consists of  bassist Raad Soudani, vocalists Myke Terry and Michael Barr, and drummer Nick Ursich. The group was founded in 2009 By Daniel Braunstein, Diego & Gus Farias and debuted with their first EP, The Concept of Dreaming in 2010. This was followed with their debut album Via (2011) and their sophomore album No Sleep in 2014. Both albums peaked at No. 1 on the iTunes Rock and Metal charts.\n",
         "Volumes make use of \"bouncy\" guitar riffs, groove-driven breakdowns, nu metal influence and dual lead vocalists.[3] The band has been credited as an important contributor to the djent scene, and has also been associated with groove metal.[3][4]\n",
         "Throughout the band's history, bassist Raad Soudani has remained the only constant member.\n"
      ]
   },
   "Title": "Volumes (band) - Wikipedia",
   "Videography": {}
}