{
   "Name": "Wall of Voodoo",
   "rawData": [
      "Wall of Voodoo was an American rock band from Los Angeles, California, United States, best known for its 1983 hit \"Mexican Radio\". The band had a sound that was a fusion of synthesizer-based new wave music with the spaghetti Western soundtrack style of Ennio Morricone.\n",
      "Wall of Voodoo had its roots in Acme Soundtracks, a film score business started by Stan Ridgway, later the vocalist and harmonica player for Wall of Voodoo. Acme Soundtracks' office was across the street from the Hollywood punk club The Masque and Ridgway was soon drawn into the emerging punk/new wave scene. Marc Moreland, guitarist for the Skulls, began jamming with Ridgway at the Acme Soundtracks office and the soundtrack company morphed into a new wave band. In 1977, with the addition of Skulls members Bruce Moreland (Marc Moreland's brother) as bassist and Chas T. Gray as keyboardist, along with Joe Nanini, who had been the drummer for the Bags, the Eyes, and Black Randy and the Metrosquad, the first lineup of Wall of Voodoo was born.\n",
      "The band was named Wall of Voodoo before their first gig in reference to a comment made by Joe Berardi, a friend of Ridgway's and member of the Fibonaccis. Berardi was listening to some of the Acme Soundtracks music Ridgway and Moreland had created in their studio. When Ridgway jokingly compared the multiple-drum-machine- and Farfisa-organ-laden recordings to Phil Spector's Wall of Sound, Berardi commented it sounded more like a \"wall of voodoo\" and the name stuck.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "New wave, post-punk, alternative rock, dark wave, industrial rock, cowpunk"
      ],
      "Years active": [
         "1977–1988"
      ],
      "Labels": [
         "I.R.S."
      ],
      "Associated acts": [
         "Stan Ridgway, The Skulls, Nervous Gender, Eye Protection"
      ],
      "Website": [
         "www.wallofvoodoo.net"
      ],
      "Past members": [
         "Stan Ridgway",
         "Marc Moreland",
         "Bruce Moreland",
         "Chas T. Gray",
         "Joe Nanini",
         "Bill Noland",
         "Andy Prieboy",
         "Ned Leukhardt"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Los Angeles, California, United States, best known for its [YEAR] hit \"Mexican Radio\". The band had a sound that was a fusion of synthesizer-based new wave music with the spaghetti Western soundtrack style of [PERSON_NAME_FULL_0_MALE].\n",
      "[BAND_NAME] had its roots in Acme Soundtracks, a film score business started by [PERSON_NAME_FULL_1_MALE], later the vocalist and harmonica player for [BAND_NAME]. Acme Soundtracks' office was across the street from the Hollywood punk club The Masque and [PERSON_NAME_LAST_1] was soon drawn into the emerging punk/new wave scene. [MONTH]c [PERSON_NAME_LAST_0], guitarist for the Skulls, began jamming with [PERSON_NAME_LAST_1] at the Acme Soundtracks office and the soundtrack company morphed into a new wave band. In [YEAR], with the addition of Skulls members [PERSON_NAME_FULL_0_MALE] ([MONTH]c [PERSON_NAME_LAST_0]'s brother) as bassist and Chas T. Gray as keyboardist, along with [PERSON_NAME_FULL_2_MALE], who had been the drummer for the Bags, the Eyes, and Black Randy and the Metrosquad, the first lineup of [BAND_NAME] was born.\n",
      "The band was named [BAND_NAME] before their first gig in reference to a comment made by [PERSON_NAME_FULL_0_MALE], a friend of Ridgway's and member of the Fibonaccis. [PERSON_NAME_LAST_0] was listening to some of the Acme Soundtracks music Ridgway and Moreland had created in their studio. When Ridgway jokingly compared the multiple-drum-machine- and Farfisa-organ-laden recordings to [PERSON_NAME_FULL_1_MALE]'s Wall of Sound, [PERSON_NAME_LAST_0] commented it sounded more like a \"wall of voodoo\" and the name stuck.\n"
   ]
}