{
   "Name": "Warbringer",
   "rawData": [
      "Warbringer is an American thrash metal band formed in 2004. Century Media Records signed Warbringer after seeing them at a local show in LA. Originally, a Century Media rep was at the show to see another LA thrash metal band but decided to sign Warbringer instead. Warbringer's second album Waking into Nightmares was released on May 19, 2009. The album reached No. 14 on the Billboard Heatseekers chart. Despite numerous line-up changes, Warbringer has released six full-length studio albums.\n",
      "The band formed in 2004 when John Laux and Victor Mikhaltsevich met during high school. They shared a strong common interest in heavy metal and began writing instrumental songs together.  Eventually Victor introduced John Kevill to Laux as the new vocalist and immediately a strong creative partnership was forged. Originally they had named the band Onslaught but changed their name after realizing that there is a band using the same name. Nothing had been recorded and released while they had used the name. They soon recruited Andy Laux as the bassist and Evan Reiter as drummer. A few weeks later Reiter left and was replaced by Adam Carroll whom Kevill had met opening as a guitarist in a local band at a Metal Church show.\n",
      "The band finally had a solid line up in place and had adopted the name Warbringer after attempting to combine \"War\" as a prefix to a variety of words. They recorded a four-song demo in 2004 that was never released. It is the only recording with Victor Mikhaltsevich in the band. Due to creative differences the band decided to seek out another guitar player. Emilio Hoschet soon joined the band, and in 2005 they self-financed the Born of the Ruins demo. Copies were handmade and passed out for free at local shows.\n"
   ],
   "infobox": {
      "Origin": [
         "Newbury Park, California,",
         " United States"
      ],
      "Genres": [
         "Thrash metal"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Century Media, Napalm"
      ],
      "Associated acts": [
         "John Waters"
      ],
      "Website": [
         "warbringermusic.com"
      ],
      "Members": [
         "John Kevill",
         "Adam Carroll",
         "Carlos Cruz",
         "Chase Becker",
         "Chase Bryant"
      ],
      "Past members": [
         "Evan Reiter",
         "Ryan Bates",
         "Alex Malmquist",
         "Emilio Hoschet",
         "Ben Bennet",
         "Nic Ritter",
         "Jeff Potts",
         "Andy Laux",
         "Ben Mottsman[1]",
         "John Laux[2]",
         "Jessie Sanchez"
      ]
   },
   "albums": [
      "War Without End",
      "Waking into Nightmares",
      "Worlds Torn Asunder",
      "IV: Empires Collapse",
      "Woe to the Vanquished",
      "Weapons of Tomorrow"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in [YEAR]. Century Media Records signed [BAND_NAME] after seeing them at a local show in LA. Originally, a Century Media rep was at the show to see another LA thrash metal band but decided to sign [BAND_NAME] instead. [BAND_NAME]'s second album Waking into Nightmares was released on [MONTH] 19, [YEAR]. The album reached No. 14 on the Billboard Heatseekers chart. Despite numerous line-up changes, [BAND_NAME] has released six full-length studio albums.\n",
      "The band formed in [YEAR] when John [PERSON_NAME_LAST_1] and [PERSON_NAME_FULL_2_MALE] met during high school. They shared a strong common interest in heavy metal and began writing instrumental songs together.  Eventually [PERSON_NAME_FIRST_2] introduced John Kevill to [PERSON_NAME_LAST_1] as the new vocalist and immediately a strong creative partnership was forged. Originally they had named the band Onslaught but changed their name after realizing that there is a band using the same name. Nothing had been recorded and released while they had used the name. They soon recruited [PERSON_NAME_FULL_1_MALE] as the bassist and Evan Reiter as drummer. A few weeks later Reiter left and was replaced by [PERSON_NAME_FULL_0_MALE] whom Kevill had met opening as a guitarist in a local band at a Metal Church show.\n",
      "The band finally had a solid line up in place and had adopted the name [BAND_NAME] after attempting to combine [SONG_NAME] as a prefix to a variety of words. They recorded a four-song demo in [YEAR] that was never released. It is the only recording with Victor Mikhaltsevich in the band. Due to creative differences the band decided to seek out another guitar player. [PERSON_NAME_FULL_0_MALE] soon joined the band, and in [YEAR] they self-financed the Born of the Ruins demo. Copies were handmade and passed out for free at local shows.\n"
   ]
}