{
   "Name": "Cold Blood (band)",
   "rawData": [
      "Cold Blood is a long-standing R&B horn funk band founded by Larry Field in 1968 and was originally based in the East Bay region of the San Francisco Bay Area. The band has also performed and recorded under the name Lydia Pense and Cold Blood, due to the popularity of their lead singer, Lydia Pense.\n",
      "The band first came to prominence in 1969 when rock impresario Bill Graham signed them after an audition and they played the Fillmore West in San Francisco. Pense has been compared to Janis Joplin, and it was Joplin who recommended the audition to Graham.\n",
      "The term \"East Bay Grease\" has been used to describe the San Francisco Bay Area's brass horn heavy funk-rock sound of the 1960s, 1970s and 1980s, Cold Blood was one of the pioneer bands of this sound. Other bands include Tower of Power, Chicago, and Blood Sweat And Tears. The Tower of Power horn players have performed with Cold Blood on a regular basis since the early 1970s. Skip Mesquite and Mic Gillette have been members of both Tower of Power and Cold Blood.\n"
   ],
   "infobox": {
      "Origin": [
         "Oakland, California"
      ],
      "Genres": [
         "Rock, Urban contemporary, Blue-eyed soul, East Bay Grease"
      ],
      "Years active": [
         "1969–present"
      ],
      "Labels": [
         "San Francisco/Atlantic (1969); Reprise (1972); Warner Bros. Records (1974); ABC (1976); Dig Music (2005)"
      ],
      "Associated acts": [
         "Tower of Power, Sons of Champlin, Donny Hathaway"
      ],
      "Members": [
         "Lydia Pense",
         "Steve Salinas",
         "Steve Dunne",
         "Evan Palmerston",
         "Rich Armstrong",
         "Rob Zuckerman",
         "T. Moran"
      ],
      "Past members": [
         "Rock Hendricks",
         " Larry Field",
         "Danny Hull",
         "Larry Jonutz",
         "Pat O'Hara",
         "Raul Matute",
         "Jerry Jonutz",
         "David Padron",
         "Rod Ellicott",
         "Frank Davis",
         "Sandy McKee",
         "Alex Sarmiento",
         "Skip Mesquite",
         "Rob Moitoza",
         "Billy Stogden"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band founded by Larry Field in [YEAR] and was originally based in the East Bay region of the San Francisco Bay Area. The band has also performed and recorded under the name [PERSON_NAME_FULL_0_FEMALE] and [BAND_NAME], due to the popularity of their lead singer, [PERSON_NAME_FULL_0_FEMALE].\n",
      "The band first came to prominence in [YEAR] when rock impresario Bill Graham signed them after an audition and they played the Fillmore West in San Francisco. Pense has been compared to [MONTH]is Joplin, and it was Joplin who recommended the audition to Graham.\n",
      "The term \"East Bay Grease\" has been used to describe the San Francisco Bay Area's brass horn heavy funk-rock sound of the [YEAR]s, [YEAR]s and [YEAR]s, [BAND_NAME] was one of the pioneer bands of this sound. Other bands include Tower of Power, Chicago, and Blood Sweat And Tears. The Tower of Power horn players have performed with [BAND_NAME] on a regular basis since the early [YEAR]s. Skip Mesquite and Mic Gillette have been members of both Tower of Power and [BAND_NAME].\n"
   ]
}