{
   "Name": "Cold Blood (band)",
   "Sections": [
      "1 History",
      "2 Personnel",
      "2.1 Current members",
      "2.2 Additional personnel",
      "2.3 Former members",
      "3 Discography",
      "3.1 Albums",
      "3.2 Singles",
      "4 See also",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Cold Blood is a long-standing R&B horn funk band founded by Larry Field in 1968 and was originally based in the East Bay region of the San Francisco Bay Area. The band has also performed and recorded under the name Lydia Pense and Cold Blood, due to the popularity of their lead singer, Lydia Pense.\n"
      ]
   },
   "History": {
      "text": [
         "The band first came to prominence in 1969 when rock impresario Bill Graham signed them after an audition and they played the Fillmore West in San Francisco.[1] Pense has been compared to Janis Joplin, and it was Joplin who recommended the audition to Graham.\n",
         "The term \"East Bay Grease\" has been used to describe the San Francisco Bay Area's brass horn heavy funk-rock sound of the 1960s, 1970s and 1980s, Cold Blood was one of the pioneer bands of this sound.[2] Other bands include Tower of Power, Chicago, and Blood Sweat And Tears.[2] The Tower of Power horn players have performed with Cold Blood on a regular basis since the early 1970s. Skip Mesquite and Mic Gillette have been members of both Tower of Power and Cold Blood.[3][4]\n",
         "The band disbanded in the late 1970s. Pense suspended her music career in the early 1980s to raise her daughter Danielle, before re-forming the group in 1988.[2] The band stabilized with its current membership in the 1990s.[citation needed] Cold Blood continues to record and perform today, and some former band members such as Raul Matute (and some from Tower of Power) appear on the band's most recent album.\n",
         "Cold Blood is featured playing \"You Got Me Hummin’\" live in Fillmore: The Last Days, a documentary of the last concerts at the Fillmore West auditorium during July 1971.[5]\n"
      ]
   },
   "Personnel": {
      "Current members": {
         "text": [
            "\n"
         ]
      },
      "Additional personnel": {
         "text": [
            "\n"
         ]
      },
      "Former members": {
         "text": [
            "Over the years there have been various incarnations of the band including singer/trumpet player Max Haskett (born 7 March 1947, died 15 September 1999, ex-Rubicon), Tower of Power horn player Mic Gillette, Journey keyboardist Stevie \"Keys\" Roseman on Hammond B-3 organ, Sons Of Champlin drummer Jim Preston, Starship Drummer T Moran guitar player Michael Sasaki (born June 24, 1951), Tower of Power guitarist Jeff Tamelier, Boz Scaggs horn player Tom Poole, Elvin Bishop sax player Bill Slais, bass player Michael White & others.\n",
            "\n",
            "\n"
         ]
      },
      "text": [
         "Original band members were founder Larry Field (lead guitar), Lydia Pense (vocals), Danny Hull (tenor saxophone and songwriter), Larry Jonutz (trumpet; born Mar 15 1947), Pat O'Hara (trombone; born May 25, 1946 (?), died August 1977 of an overdose), Raul Matute (Hammond organ, piano, arranger and songwriter, born Feb 19 1946), Jerry Jonutz (baritone, alto and tenor saxophone; born Mar 15 1947), David Padron (trumpet; born May 4, 1946), Rod Ellicott (bass), and Frank Davis, who was replaced on drums by Sandy McKee (real name Cecil James Stoltie, born 12 July 1945, died 15 October 1995) during the Sisyphus sessions.  Narada Michael Walden and Jonathan \"Sugarfoot\" Moffett both mention McKee on their short list of drummers most influential in their stylistic development.\n",
         "Current personnel are Lydia Pense (vocals), Steve Salinas (keyboards), Steve Dunne (guitar), Mike Morgan (percussion), Evan Palmerston (bass), Rich Armstrong (trumpet, cornet, percussion), Rob Zuckerman (alto, tenor, baritone saxes, and flute) and Donny Baldwin (drums).\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Singles": {},
      "text": [
         "Their initial four albums, Cold Blood (produced by David Rubinson), Sisyphus (produced by Fred Catero), First Taste of Sin (produced by Donny Hathaway), and Thriller (produced by David Rubinson) remain their best known work.\n"
      ]
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Cold Blood is a long-standing R&B horn funk band founded by Larry Field in 1968 and was originally based in the East Bay region of the San Francisco Bay Area. The band has also performed and recorded under the name Lydia Pense and Cold Blood, due to the popularity of their lead singer, Lydia Pense.\n",
      "The band first came to prominence in 1969 when rock impresario Bill Graham signed them after an audition and they played the Fillmore West in San Francisco.[1] Pense has been compared to Janis Joplin, and it was Joplin who recommended the audition to Graham.\n",
      "The term \"East Bay Grease\" has been used to describe the San Francisco Bay Area's brass horn heavy funk-rock sound of the 1960s, 1970s and 1980s, Cold Blood was one of the pioneer bands of this sound.[2] Other bands include Tower of Power, Chicago, and Blood Sweat And Tears.[2] The Tower of Power horn players have performed with Cold Blood on a regular basis since the early 1970s. Skip Mesquite and Mic Gillette have been members of both Tower of Power and Cold Blood.[3][4]\n",
      "The band disbanded in the late 1970s. Pense suspended her music career in the early 1980s to raise her daughter Danielle, before re-forming the group in 1988.[2] The band stabilized with its current membership in the 1990s.[citation needed] Cold Blood continues to record and perform today, and some former band members such as Raul Matute (and some from Tower of Power) appear on the band's most recent album.\n"
   ]
}