{
   "Current members": {},
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "As was the case with contemporaries Ratt and Rough Cutt, the group's core – guitarists Joe Floyd and Tommy Asakawa, bassist Rick Bennett and vocalist Parramore McCarty – was made up of San Diego, California transplants in search of fame and fortune. Prior to Warrior, McCarty had fronted the band Phenomenon, active during 1977–78, which also featured future Ratt guitarist Robbin Crosby and posthumously issued \"The Final Word\" b/w \"Ain't No Doubt About It\" 7\" single in 1980. By 1979, Phenomenon had morphed into Secret Service and McCarty and Crosby were joined by guitarist Tommy Asakawa. When McCarty and Asakawa exited, Secred Service became Aircraft, now fronted by future Riverdogs vocalist Rob Lamothe, re-named Mac Meda in 1981. McCarty and Asakawa would soon join forces with Floyd and Bennett. Adding drummer Liam Jason to the line-up after making the move to Los Angeles and initially going under the name Fury, the band soon started to make a name for themselves in the local clubs with their futuristic brand of European influenced heavy metal.\n",
         "In 1984, the band recorded a three-song demo, including the anthemic \"Fighting for the Earth\", which went into heavy rotation on KMET radio and became a local hit. Subsequently, the band signed a record deal with MCA Records and Richard Branson's Virgin/10 Records label in Europe, and began to record their debut album with producer Doug Rider at Cherokee Studios and Sunset Sound in Los Angeles.[2]  The rhythm section of Jason and Bennett was replaced after the sessions were completed with Black Sheep bassist Bruce Turgon and drummer Jimmy Volpe stepping in.[2] Although Bennett's replacement Turgon was pictured and credited on the album, he actually joined the band after the album was recorded. Before leaving, Bennett contacted Robert Preston who had designed the costumes for Star Trek II: The Wrath of Khan and he agreed to make the band's outfits for the album and video. Fighting for the Earth was released in 1985 and though not a huge commercial success,[2] the album became a favorite among underground metal heads.[who?] A short trip to the UK that same year saw Warrior perform at the Marquee Club in London, and make an exclusive TV appearance on Channel 4's ECT program where the band performed \"Fighting for the Earth\" (the band's single and video) and \"Defenders of Creation.\" A \"Fighting for the Earth\" holographic LaserDisc version of the album was on display at the Los Angeles Museum of Science and Industry from the mid to late 1980s. Fueled by internal turmoil, Michael Browning's mismanagement and record company problems, Warrior lost their record contract with Virgin and split up in early 1987, with vocalist Parramore McCarty briefly fronting Rough Cutt in place of the Quiet Riot bound Paul Shortino and Jimmy Volpe joining Foreplay, with Jason and Bennett forming their own band.[2] According to founding members, Floyd was making excuses not to play live, before and after the signing, and moving from Los Angeles to Escondido after the album was released resulted in the band losing their contract. Floyd initially teamed up with former Warlord drummer Mark Zonder.  Floyd and Zonder's partnership was to be short-lived, with Zonder joining Fates Warning.\n",
         "Warrior then continued on with Floyd acquiring the services of bassist Kelly Magee and vocalist Shawn Carvin from the band Wrathborne, along with former Warrior drummer Liam Jason.  This marked the only time in Warrior's history that the band was a four-piece as opposed to their traditional five-piece lineup with two guitarists. \"Cold Fire\" became Warrior's new name.  The band went through several drummers, including Jason, and David Eagle (Oingo Boingo) before finally settling with future Megadeth drummer Nick Menza. Cold Fire contributed the song \"Of The Flesh\" (with Floyd, Magee, Carvin and Jason) to the Rock Climbers: The Hottest of Hollywood compilation LP before folding in 1990. Meanwhile, McCarty had been brought in by Warner Bros. to complete the Atomic Playboys album, a new project put together by Steve Stevens. Released in 1989, the album proved a commercial disappointment and the group disbanded after undertaking a US club tour. McCarty next formed the short-lived PTM with Hellion guitarist Alan Barlam, bassist Mike Davis (ex-Lizzy Borden), and drummer Reynold 'Butch' Carlson (ex-Jag Panzer). Barlam was let go in favor of Carlson's Driver bandmate, Roy Z, who collaborated with McCarty on several new songs which soon sparked the idea of a Warrior reunion.\n",
         "In 1991, Floyd and McCarty had put together a new Warrior line-up featuring Roy Z on guitar, bassist Kelly Pattrik, and drummer Dave Imondi. The band played several shows before Imondi was replaced by Jorge Miguel Palacios. In 1992, the band cut a three-song demo at Joe Floyd's Silver Cloud studio consisting of \"Fight/ Or Fall\", \"White Mansions\", and the Bruce Turgon-penned \"New Nation\", produced by Warren DeMartini of Ratt. The band came to the attention of the German-based indie label Dream Circle, who had previously signed Roy Z's Latin hard rock band, Tribe of Gypsies. A deal was struck but progress on the album was slow and eventually halted, when Z left the fold to concentrate on his own group and work with former Iron Maiden vocalist Bruce Dickinson. Most of his guitar tracks were erased and eventually re-cut by new arrival Mick Perez. The album, titled Ancient Future, was released in 1998 with Dream Circle handling Europe, Metal Blade taking care of North America, and Teichiku releasing the album in Japan where it included a bonus track (\"All I Need\"). Warrior were also invited to play Germany's Wacken Open Air festival with a line-up that now featured McCarty, Floyd, Perez, bassist Sam, and drummer Dave DuCey.\n",
         "In 2001, Warrior returned with The Code of Life on Reality Entertainment/Nuclear Blast, the band's first album not to feature Parramore McCarty on vocals who had declined to take part in the recording. His replacement was Rob Rock. Rock and Floyd were joined by guitarist Mick Perez, bassist Simon Oliver, and drummer Dave DuCey. The album featured a number of notable writing contributions: Roy Z co-wrote the album opener \"Day of Reckoning\" while Bruce Dickinson is credited on \"We Are One.\" Dickinson's The Chemical Wedding touring guitarist, Richard Carrette, co-authored and played lead guitar on \"The Endless Beginning.\" Even though the album earned some of the best reviews in the band's career,[citation needed] The Code of Life was not supported with any gigs or touring.\n",
         "With Rob Rock away on his fledgling solo career, Warrior was once again in need of a vocalist for their next album. At the suggestion of the band's co-producer, Warren Croyle, Marc Storace was included on 2004's The Wars of Gods and Men. Storace flew to Los Angeles where he recorded all his vocal tracks at Floyd's San Fernando Valley studio. Godhead guitarist Jason Miller contributed additional lead guitars as Mick Perez had retired from music. The album also marked the debut of new bassist Rob Farr, a bandmate of drummer Dave DuCey in National Dust. Again, the album was not supported by any live work and Warrior remained strictly a Joe Floyd studio project.\n",
         "In 2008, Floyd once again reunited with original vocalist Parramore McCarty who brought along San Diego-based guitarist AC Alexander, with Farr and DuCey remaining on board on bass and drums, respectively.  The band played their first live show in nearly a decade in April 2008 in San Diego. As of 2009, Warrior have markedly stepped up their live profile, playing their first show in over a decade for Hollywood Sheriff Productions on February 28, 2009, at the Key Club on the Sunset Strip for the DC4 record release show. Warrior also played their first European show in over a decade at the Bang Your Head!!! festival in Germany as well making an appearance at Rocklahoma 2009.\n",
         "The band recorded a cover of \"Neon Knights\" for the 2010 Neon Knights – A Tribute to Black Sabbath release on Reality Entertainment,[3] before parting ways with McCarty once again.  With guitarist AC Alexander also joining Lizzy Borden[4] in the summer of 2010, Warrior activities came to a crawl until the band briefly re-emerged in 2014 when they made an appearance at Germany's Keep It True XVII festival,[5] fronted by Sean Peck of Cage.\n",
         "In 2017, Parramore McCarty made a comeback fronting Radiation Romeos, named after a line in the song \"Atomic Playboys\" from his 1989 album of the same name with Steve Stevens. Initiated by German producer Michael Voss, the group's debut album was released June 2 on Italy's Frontiers Records,[6] preceded by a video for the song \"Ocean Drive\".[7]\n"
      ]
   },
   "Past line-ups": {
      "text": [
         "Mk.XI\n",
         "Mk.XI\n",
         "Mk.X\n",
         "Mk.IX\n",
         "Mk.VIII\n",
         "Mk.VII\n",
         "\n",
         "Mk.VI\n",
         "Mk.V\n",
         "Mk.IV\n",
         "Mk.III (Warrior/Cold Fire)\n",
         "Mk.II\n",
         "Mk.I\n",
         "\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Current members",
      "3 Past line-ups",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Warrior is an American heavy metal band from Los Angeles, formed in 1982.[1] Best known for their 1985 debut album, Fighting for the Earth, the band has released a total of four studio albums. Guitarist and co-founder Joe Floyd is the only Warrior member to appear on every album.\n",
         "Floyd is also a notable engineer and producer and has worked with Bruce Dickinson, Halford, Earl Slick, Tribe of Gypsies, Rob Rock, downset, Godhead, Jake E. Lee, Ratt, Riot, Malice, Odin, World War III, Helstar, and Steel Prophet, among others. In addition, Floyd is the CEO of ElectroPhonic Innovations, a guitar company.\n"
      ]
   },
   "Title": "Warrior (band) - Wikipedia"
}