{
   "Name": "Warrior (band)",
   "rawData": [
      "Warrior is an American heavy metal band from Los Angeles, formed in 1982. Best known for their 1985 debut album, Fighting for the Earth, the band has released a total of four studio albums. Guitarist and co-founder Joe Floyd is the only Warrior member to appear on every album.\n",
      "Floyd is also a notable engineer and producer and has worked with Bruce Dickinson, Halford, Earl Slick, Tribe of Gypsies, Rob Rock, downset, Godhead, Jake E. Lee, Ratt, Riot, Malice, Odin, World War III, Helstar, and Steel Prophet, among others. In addition, Floyd is the CEO of ElectroPhonic Innovations, a guitar company.\n",
      "As was the case with contemporaries Ratt and Rough Cutt, the group's core – guitarists Joe Floyd and Tommy Asakawa, bassist Rick Bennett and vocalist Parramore McCarty – was made up of San Diego, California transplants in search of fame and fortune. Prior to Warrior, McCarty had fronted the band Phenomenon, active during 1977–78, which also featured future Ratt guitarist Robbin Crosby and posthumously issued \"The Final Word\" b/w \"Ain't No Doubt About It\" 7\" single in 1980. By 1979, Phenomenon had morphed into Secret Service and McCarty and Crosby were joined by guitarist Tommy Asakawa. When McCarty and Asakawa exited, Secred Service became Aircraft, now fronted by future Riverdogs vocalist Rob Lamothe, re-named Mac Meda in 1981. McCarty and Asakawa would soon join forces with Floyd and Bennett. Adding drummer Liam Jason to the line-up after making the move to Los Angeles and initially going under the name Fury, the band soon started to make a name for themselves in the local clubs with their futuristic brand of European influenced heavy metal.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Heavy metal, power metal"
      ],
      "Years active": [
         "1982–present"
      ],
      "Labels": [
         "MCA, Metal Blade, Nuclear Blast, Reality Entertainment"
      ],
      "Associated acts": [
         "\nAssassin\nRhino Bucket\nRough Cutt\nForeigner\nCold Fire\nSteve Stevens\nI Napoleon\nDriver\nTribe of Gypsies\nMustard Seeds\nKeel\nShadow King\nBlack Sheep\nWorld War III\nJones Street\nLife After Death\nRatt\nPhenomenon\nSecret Service\nRewind\nNational Dust\nImpellitteri\nGodhead\nKrokus\nWrathborne\nLizzy Borden\nSnew\nCage\nDeath Dealer\nRadiation Romeos\n",
         "Assassin",
         "Rhino Bucket",
         "Rough Cutt",
         "Foreigner",
         "Cold Fire",
         "Steve Stevens",
         "I Napoleon",
         "Driver",
         "Tribe of Gypsies",
         "Mustard Seeds",
         "Keel",
         "Shadow King",
         "Black Sheep",
         "World War III",
         "Jones Street",
         "Life After Death",
         "Ratt",
         "Phenomenon",
         "Secret Service",
         "Rewind",
         "National Dust",
         "Impellitteri",
         "Godhead",
         "Krokus",
         "Wrathborne",
         "Lizzy Borden",
         "Snew",
         "Cage",
         "Death Dealer",
         "Radiation Romeos"
      ],
      "Website": [
         "Warrior on Facebook"
      ],
      "Members": [
         "Joe Floyd",
         "AC Alexander",
         "Rob Farr",
         "Dave DuCey",
         "Sean Peck"
      ],
      "Past members": [
         "Parramore McCarty",
         "Rick Bennett",
         "Liam Jason",
         "Bruce Turgon",
         "Jimmy Volpe",
         "Tommy Asakawa",
         "Shawn Carvin",
         "Kelly Magee",
         "Roy Z",
         "Kelly Pattrik",
         "Dave Imondi",
         "Jorge Miguel Palacios",
         "Kenny Chaisson",
         "Ray Burke",
         "Mick Perez",
         "Sam",
         "Simon Oliver",
         "Rob Rock",
         "Marc Storace"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Los Angeles, formed in [YEAR]. Best known for their [YEAR] debut album, Fighting for the Earth, the band has released a total of four studio albums. Guitarist and co-founder [PERSON_NAME_FULL_1_MALE] is the only [BAND_NAME] member to appear on every album.\n",
      "Floyd is also a notable engineer and producer and has worked with Bruce Dickinson, Halford, [PERSON_NAME_LAST_0]rl [PERSON_NAME_LAST_1], Tribe of Gypsies, Rob Rock, downset, Godhead, [P[PERSON_NAME_LAST_0]SON_NAM[PERSON_NAME_LAST_0]FULL_0_MAL[PERSON_NAME_LAST_0], Ratt, Riot, Malice, Odin, World War III, Helstar, and Steel Prophet, among others. In addition, Floyd is the C[PERSON_NAME_LAST_0] of [PERSON_NAME_LAST_0]ectroPhonic Innovations, a guitar company.\n",
      "As was the case with contemporaries Ratt and Rough Cutt, the group's core – guitarists [PERSON_NAME_FULL_2_MALE] and [PERSON_NAME_FULL_0_MALE], bassist Rick Bennett and vocalist Parramore McCarty – was made up of San Diego, California transplants in search of fame and fortune. Prior to [BAND_NAME], McCarty had fronted the band Phenomenon, active during [YEAR]–78, which also featured future Ratt guitarist [PERSON_NAME_FIRST_3]bin Crosby and posthumously issued \"The Final Word\" b/w \"Ain't No Doubt About It\" 7\" single in [YEAR]. By [YEAR], Phenomenon had morphed into Secret Service and McCarty and Crosby were joined by guitarist [PERSON_NAME_FULL_0_MALE]. When McCarty and [PERSON_NAME_LAST_0] exited, Secred Service became Aircraft, now fronted by future Riverdogs vocalist [PERSON_NAME_FULL_3_MALE], re-named Mac Meda in [YEAR]. McCarty and [PERSON_NAME_LAST_0] would soon join forces with [PERSON_NAME_LAST_2] and Bennett. Adding drummer Liam Jason to the line-up after making the move to Los Angeles and initially going under the name Fury, the band soon started to make a [GENRE]"
   ]
}