{
   "Name": "Wasted Youth (American band)",
   "Sections": [
      "1 History",
      "1.1 Reagan's In",
      "1.2 Black Daze",
      "1.3 Get Out of My Yard",
      "2 Aftermath",
      "3 References"
   ],
   "Summary": {
      "text": [
         "Wasted Youth (also known as LA's Wasted Youth) was a hardcore punk band in the early 1980s from Los Angeles, California. The band followed in the footsteps of Black Flag and the Circle Jerks. It was a prominent and popular act among the Los Angeles punk underground. Other bands active in the early 1980s Los Angeles punk scene were The Adolescents, T.S.O.L., Social Distortion, Bad Religion, Agent Orange, and The Stains.\n",
         "Footage of the original lineup (1981-1983) can be seen in the film Slog Movie, which is a film documenting the Orange County punk scene.\n"
      ]
   },
   "History": {
      "Reagan's In": {
         "text": [
            "The band's first album Reagan's In, is in the early West Coast hardcore punk music style.[2] It is known for the Pushead artwork of Ronald Reagan on the front cover.[1] The back of the album features Edward Colver's photograph of an upside down stagediver in midair. Though this album consists of ten tracks, it is less than fifteen minutes long.\n"
         ]
      },
      "Black Daze": {
         "text": [
            "The band's later releases moved towards a heavy metal sound, including a cover of Van Halen's \"On Fire\". The more advanced musical and lyrical development on Black Daze brought Wasted Youth to new thrash metal audiences. The video for the album's \"Good Day For a Hanging\" depicts a motorcycle spinning amongst concert-goers in a mud-pit.\n"
         ]
      },
      "Get Out of My Yard": {
         "text": [
            "Jeff Dahlgren, front man after Allah Akhbar (1983–1985), left the band. His work was re-recorded by Paolo Rossi co-produced with Darin Scheff and titled \"Get out of My Yard\".  Paolo Rossi (the last generation of Wasted Youth front men) went on to start an indie label \"Open Circle Records\" in Glendale, California (Open Circle released Get Out of My Yard LP). Wasted Youth led a successful \"Crack Across America Tour\" in the late 1980s to support \"Get Out of My Yard.\" Michael Licalsi, a club and show promoter from the SF Bay Area, served as their manager, with Louis (VideoLouis) Elovitz taking part in management for a period of time as well. Wasted Youth performed with bands such as Bad Brains, The Ramones, and Circle Jerks on this final tour.\n"
         ]
      },
      "text": [
         "The original members of Wasted Youth were Chett Lehrer, Jeff Long, Allen Stiritz, and Danny Spira.[1]\n"
      ]
   },
   "Aftermath": {
      "text": [
         "Members went on to perform in the tribal-industrial group Savage Republic; Joey Castillo became a drummer for Danzig from 1994 to 2002, and later Queens of the Stone Age from 2002 to 2012; while Dave Kushner, who played guitar on Black Daze, went on to become a member of Velvet Revolver from 2002 to 2008.[1]\n"
      ]
   },
   "References": {},
   "coreData": [
      "Wasted Youth (also known as LA's Wasted Youth) was a hardcore punk band in the early 1980s from Los Angeles, California. The band followed in the footsteps of Black Flag and the Circle Jerks. It was a prominent and popular act among the Los Angeles punk underground. Other bands active in the early 1980s Los Angeles punk scene were The Adolescents, T.S.O.L., Social Distortion, Bad Religion, Agent Orange, and The Stains.\n",
      "Footage of the original lineup (1981-1983) can be seen in the film Slog Movie, which is a film documenting the Orange County punk scene.\n",
      "The original members of Wasted Youth were Chett Lehrer, Jeff Long, Allen Stiritz, and Danny Spira.[1]\n",
      "The band's first album Reagan's In, is in the early West Coast hardcore punk music style.[2] It is known for the Pushead artwork of Ronald Reagan on the front cover.[1] The back of the album features Edward Colver's photograph of an upside down stagediver in midair. Though this album consists of ten tracks, it is less than fifteen minutes long.\n"
   ]
}