{
   "Name": "Wednesday Week (band)",
   "rawData": [
      "Wednesday Week is an American rock band formed in Los Angeles, California in 1983. After releasing two albums, the band split up in 1990, with members going on to form Lucky. Since 1998 Wednesday Week plays occasional shows with various lineups consisting of previous members.\n",
      "Founders of the band were the sisters Kristi and Kelly Callan—daughters of actress K Callan. The sisters formed their first group, The Undeclared, in 1979. The duo evolved into a trio, Goat Deity, in 1980, when they were joined by Steve Wynn. Wynn left to concentrate on his other band, The Dream Syndicate, and Kjehl Johansen (of The Urinals) joined on bass guitar, with the band name changing again to Narrow Adventure. With David Provost replacing Johansen in 1983, the band became Wednesday Week (named after the Undertones song), and they released their debut EP, Betsy's House, later that year. Further lineup changes followed, with Provost being replaced by Heidi Rodewald at the end of 1983, and Tom Alford joining on lead guitar in early 1984. In 1985, David Nolte (of The Last) replaced Alford, giving the band its most stable lineup.\n",
      "The band signed with Enigma Records, releasing the Don Dixon-produced debut album What We Had in 1987. Two songs from the album were featured in the film Slumber Party Massacre II, with actresses in the movie miming to the songs. Towards the end of 1987 Rodewald left, and another former Urinals member, John Talley-Jones, joined as one of a string of short-lived members before the band split up in 1990. Before splitting up they self-released a second album, No Going Back  on cassette only.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Pop/rock"
      ],
      "Years active": [
         "1983 (1983)–1990 (1990), 1998–present"
      ],
      "Labels": [
         "Enigma"
      ],
      "Associated acts": [
         "The Undeclared",
         "Goat Deity",
         "Narrow Adventure",
         "The Urinals",
         "The Last",
         "Lucky",
         "Dime Box",
         "The Mistaken",
         "dragsterbarbie"
      ],
      "Website": [
         "www.wednesdayweek.com"
      ],
      "Members": [
         "Kristi Callan",
         "Kelly Callan",
         "David Nolte",
         "Heidi Rodewald"
      ],
      "Past members": [
         "David Provost",
         "Tom Alford",
         "Steve Ney",
         "Jennifer Dorfman",
         "John Talley-Jones",
         "Ilene Markell",
         "Karen Blankfeld",
         "Mike Anderson",
         "Jeff Burgess",
         "Russell Chaput",
         "Tracy Elms",
         "John Ferriter",
         "\"Whitey\" Pryor",
         "Tim Edmundson",
         "Rob Hunt"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in Los Angeles, California in [YEAR]. After releasing two albums, the band split up in [YEAR], with members going on to form Lucky. Since [YEAR] [BAND_NAME] plays occasional shows with various lineups consisting of previous members.\n",
      "Founders of the band were the sisters Kristi and Kelly Callan—daughters of actress K Callan. The sisters formed their first group, The Undeclared, in [YEAR]. The duo evolved into a trio, Goat Deity, in [YEAR], when they were joined by [PERSON_NAME_FULL_2_MALE]. [PERSON_NAME_LAST_2] left to concentrate on his other band, The Dream Syndicate, and Kjehl Johansen (of The Urinals) joined on bass guitar, with the band name changing again to Narrow Adventure. With [PERSON_NAME_FIRST_0] [PERSON_NAME_LAST_3] replacing Johansen in [YEAR], the band became [BAND_NAME] (named after the Undertones song), and they released their debut EP, Betsy's House, later that year. Further lineup changes followed, with [PERSON_NAME_LAST_3] being replaced by [PERSON_NAME_FULL_1_FEMALE] at the end of [YEAR], and Tom Alford joining on lead guitar in early [YEAR]. In [YEAR], [PERSON_NAME_FULL_0_MALE] (of The Last) replaced Alford, giving the band its most stable lineup.\n",
      "The band signed with Enigma Records, releasing the Don Dixon-produced debut album What We Had in [YEAR]. Two songs from the album were featured in the film Slumber Party Massacre II, with actresses in the movie miming to the songs. Towards the end of [YEAR] Rodewald left, and another former Urinals member, John Talley-Jones, joined as one of a [GENRE] band split up in [YEAR]. Before splitting up they self-released a second album, No Going Back  on cassette only.\n"
   ]
}