{
   "Discography": {
      "Compilation albums": {},
      "Singles and EPs": {},
      "Studio albums": {}
   },
   "External links": {},
   "Footnotes": {},
   "Further reading": {},
   "History": {
      "Breakup and legacy": {
         "text": [
            "The Weirdos broke up in 1981.\n",
            "Cliff Martinez, who briefly drummed for the band, went on to join Red Hot Chili Peppers, playing on the latter's first two albums. Dix Denney was also close to becoming a member of the Chili Peppers. However, after many practices with Denney, things didn't work out and he was replaced by guitarist Jack Sherman.\n",
            "LA-based rock band Symbol Six stated that the Weirdos were one of their biggest formative influences, and covered \"The Hideout'\" which appeared on their self-titled 2013 album on Dr. Strange Records, even creating a tribute video for the song that honored the Weirdos.[4]\n"
         ]
      },
      "Formation": {
         "text": [
            "The band was formed in 1976 by singer John Denney and his guitarist brother Dix (sons of Hollywood actress Nora Denney), initially using the band names the Barbies and the Luxurious Adults.[2] The Weirdos were originally a 1950s-inspired hard rock and roll band that, like the Ramones in New York City, predated the UK punk scene. While initially trying to distance themselves from the genre name \"punk\" that was created in New York, ultimately the band, in the words of John Denney, \"just kinda became more like this punk ROCK N ROLL type thing and we kinda went with it because the fans wanted it. They wore us down and we just said 'OK, fine! We're punk rock, similar to the Ramones. Whatever you say.'\"[3]\n",
            "In a 1990 Flipside interview, John Denney listed the Ramones, New York Dolls and Iggy Pop as fundamental musical inspirations, adding:\n",
            "\n\"When we saw the Ramones in '76, we already had short hair and we were already playing fast music like that in late 1975 in small venues and halls mostly, but the Ramones really made us decide to go for it even more. We came before the Sex Pistols and The Damned. They may have been our peers later, but we already had a set of songs in 1975 which were sort of Ramones meets Iggy Pop's Stooges influenced punk songs. Well before any of the UK bands started cloning America's punk sound and before any of the UK albums were released. I always felt we were a true garage punk band...\"[3]",
            "Denney claimed that the band's name dated from the early part of the 1970s and referred to his countercultural short hair, at a time when long hair on men was the fashion of the day.[3] \"In 1974 according to some left over hippies, I looked like a lobotomy, hippies thought I was weird,\" Denney said. \"A few months later when we formed, the rest of the band got really short cropped hair too. \"We were all weird then, we were considered weirdos\".[3]\n",
            "By the beginning of 1977, the Weirdos were able to pack clubs (eventually including the Whisky a Go Go, The Roxy and later The Masque) as a headlining band.[3] Known for their zany stage costumes and antics, the band helped shape the vigorous and experimental early Los Angeles punk scene and served as an inspiration to a crop of new bands.[3]\n",
            "John Denney recalled:\n",
            "\n\"We [Los Angeles] had our own look, our own sound. It was apart from New York or London.... We were staunchly against safety pins, we tried to parody punk rock at first. We did happy faces onstage as a joke sometimes, which was the exact opposite of what New York was doing. We were just thumbing our noses at everything. Everything was a joke; punk was a joke, we were a joke. Nonetheless, we were still serious about rocking.\"[3]"
         ]
      },
      "Personnel": {
         "text": [
            "The Denney brothers were the only constant members, though guitarist/bassist Cliff Roman, bassist Dave Trout and Bruce Moreland (also of Wall of Voodoo), and drummer Nickey \"Beat\" Alexander were relatively long-term Weirdos.\n"
         ]
      },
      "Recordings": {
         "text": [
            "The Weirdos' first release was a 7-inch EP, \"Destroy All Music,\" released in 1977 on Greg Shaw's Bomp! Records.[3] It was followed by the 1978 single \"We Got the Neutron Bomb,\" released on the Los Angeles punk label Dangerhouse.[3] The band later released two 12\" EPs in 1979 and 1980.\n",
            "The band were highly critical of some of their recordings and shady engineers, with John Denney characterizing the 1979-80 period as \"a big botch job\" marked by a series of \"aborted recording sessions.\"[3] It was not until 1991 that a first volume of early recordings would be remixed by the band for release by Frontier Records as a compilation album, Weird World - Volume One 1977-1981.[3] More than another decade would pass before a long-planned second compilation album of early tracks would see the light of day, issued by Frontier in 2003 as We Got The Neutron Bomb - Weird World Volume Two 1977-1989.\n"
         ]
      },
      "Reformations": {
         "text": [
            "The Weirdos have reunited several times, beginning in 1990. The resulting first full-length studio album, Condor, issued that year by Frontier, was an effort to \"re-establish ourselves as contemporary,\" according to John Denney.[2][3]\n",
            "A 2004 reunion included Circle Jerks bassist Zander Schloss and the Skulls drummer Sean Antillon in the lineup.\n",
            "Another reformed edition of the Weirdos, featuring the Denney brothers, Schloss and Devo drummer Jeff Friedl, appeared at the Punk Rock Bowling and Music Festival in Las Vegas on May 25, 2013,[5][6] followed by additional 2013-2014 shows in California, Denver and Austin, as well as an appearance at the Dangerhouse Records Night concert on November 29, 2014 at the Echoplex in Los Angeles.[7]\n",
            "In 2016, Bruce Moreland, the bassist from the 1978 version of the Weirdos, rejoined the band.\n"
         ]
      }
   },
   "Sections": [
      "1 History",
      "1.1 Formation",
      "1.2 Recordings",
      "1.3 Personnel",
      "1.4 Breakup and legacy",
      "1.5 Reformations",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Singles and EPs",
      "2.3 Compilation albums",
      "3 Footnotes",
      "4 Further reading",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Weirdos are an American punk rock band from Los Angeles, California. They formed in 1976, split-up in 1981, re-grouped in 1986 and have remained semi-active ever since. Critic Mark Deming calls them \"quite simply, one of the best and brightest American bands of punk's first wave.\"[1]\n"
      ]
   },
   "Title": "The Weirdos - Wikipedia"
}