{
   "Name": "Young the Giant",
   "rawData": [
      "Young the Giant is an American rock band that formed in Irvine, California, in 2004. The band's line-up consists of Sameer Gadhia (lead vocals), Jacob Tilley (guitar), Eric Cannata (guitar), Payam Doostzadeh (bass guitar), and Francois Comtois (drums). Formerly known as The Jakes, Young the Giant was signed by Roadrunner Records in 2009, and they released their eponymous debut album in 2010. The band's first three singles, \"My Body\", \"Cough Syrup\", and \"Apartment\", all charted on the US Alternative Songs chart.\n",
      "The Jakes formed in 2004 in Irvine, California. Consisting of Jacob Tilley, Addam Farmer, Kevin Massoudi, Ehson Hashemian, and Sameer Gadhia, the band's name was an acronym of the members' first names. After several personnel changes, the group's lineup by 2008 included Gadhia (born July 10, 1989), Tilley, Hashemian, Eric Cannata, Francois Comtois (born May 20, 1988), and Jason Burger. Initial coordination of musical contributions was difficult because the members all attended different schools. With two members still in high school and the others each attending different colleges, the Jakes recorded an EP, Shake My Hand, with producer Ian Kirkpatrick. Band members then individually decided whether or not to put their schooling on hold to focus on music. Burger left the band to pursue an education at Manhattan School of Music in New York City, and Comtois took over as the drummer. Shortly thereafter, longtime friend and collaborator Payam Doostzadeh (Persian: پیام دوستزده‎) joined as bassist. In 2009, the band played four shows at the South by Southwest music festival in Austin, Texas. The band's song \"Texas Tea\" was played during an episode of MTV's The Real World: Brooklyn, and \"Paid the Piper\" was featured on A&E's The Beast. Another song, \"Cough Syrup\", received airplay on the Los Angeles radio station KROQ. Shortly before signing to Roadrunner Records in August, keyboardist Ehson Hashemian left the band. In December 2009, the band announced they had changed their name to Young the Giant.\n",
      "The Jakes officially changed their name to Young the Giant in January 2010 during the production of their eponymous album. Young the Giant spent 2010 opening for Minus the Bear and Steel Train while working its debut album with Joe Chiccarelli at Sunset Sound Studios in Los Angeles. They took an old-school approach to recording the album. All the tracks were performed live which resulted in a lot of “chopping” during production. The band was very vigilant of their tracks but trusted the decisions of Joe Chiccarelli who had previously produced albums for The Shins, The Strokes, and Saints of Valory. The band believed in transparency; they only wanted to record what they could reproduce in front of an audience at a live show.\n"
   ],
   "infobox": {
      "Also known as": [
         "The Jakes (formerly)"
      ],
      "Origin": [
         "Irvine, California, U.S."
      ],
      "Genres": [
         "Alternative rock",
         "indie rock",
         "indie pop"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Elektra, Fueled by Ramen, Roadrunner"
      ],
      "Associated acts": [
         "American Pets (Previously Travelers)"
      ],
      "Website": [
         "youngthegiant.com"
      ],
      "Members": [
         "Sameer Gadhia",
         "Jacob Tilley",
         "Eric Cannata",
         "Payam Doostzadeh",
         "Francois Comtois"
      ],
      "Past members": [
         "Ehson Hashemian",
         "Jason Burger",
         "Sean Fischer"
      ]
   }
}