{
   "Biography": {
      "text": [
         "In 1977, The Zeros played their first major gig in Los Angeles at the Orpheum. Opening the show was the first performance by The Germs, followed by The Zeros and then The Weirdos. The gig was promoted by Peter Case of The Nerves, who later served as the frontman of The Breakaways and The Plimsouls. The Zeros' first single  release, \"Wimp\" b/w \"Don't Push Me Around\", was released in 1977 on Bomp! Records.\n",
         "In 1978, Penalosa left the band briefly to live and play in Los Angeles, and was replaced by Guy Lopez, Robert Lopez's brother. Soon after, Robert left to live in Los Angeles as well, and his brother quit the Zeros. Penalosa rejoined the band and they continued as a trio, and eventually relocated to San Francisco. In March 1979, UK music magazine NME reported that \"punk riots had come to the U.S., when Los Angeles police broke up a Zeros' gig at Elks Hall.\"[2] In 1980, the band recorded a new single, including the songs \"They Say That (Everything's Alright),\" \"Girl on the Block\" and \"Getting Nowhere Fast.\" After more touring that led to Austin, Texas and New York, the band fizzled out.\n",
         "The band is infamous for playing an entire set consisting of eight replays of \"Beat Your Heart Out\" in San Francisco.\n",
         "In 1995, the band resurfaced with a new album, Knockin' Me Dead.[3] More recently, the Zeros reunited to tour in Spain in early 2007. All four members reunited again for a short West Coast tour that began in San Diego in June 2009.[4][5] In October 2010, The Zeros embarked on a short tour of the East Coast.[6]\n",
         "Cover versions of songs by The Zeros have been released by The Hoodoo Gurus (\"Wimp\"), Brazilian band Periferia S.A. (Reality), Wednesday Week (\"They Say That Everything's Alright\"), The Muffs (\"Beat Your Heart Out\"), and the Swedish band Sator (\"Black and White\").[7]\n"
      ]
   },
   "Discography": {
      "text": [
         "Singles\n",
         "EP's\n",
         "Albums\n"
      ]
   },
   "External links": {},
   "References": {},
   "Sections": [
      "1 Biography",
      "2 Discography",
      "3 See also",
      "4 References",
      "5 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "The Zeros are an American punk rock band, formed in 1976 in Chula Vista, California. The band were originally composed of Javier Escovedo (younger brother of Alejandro Escovedo, older brother of Mario Escovedo of The Dragons) on vocals/guitar and Robert Lopez (later known as El Vez) on guitar, who were both attending Chula Vista High School; Hector Penalosa, (bass), and Baba Chenelle, (drums), who attended Sweetwater High School.  Sometimes compared to the Ramones, the band was considered a pioneer of punk rock on the West Coast.[1]\n"
      ]
   },
   "Title": "The Zeros (American band) - Wikipedia"
}