{
   "Name": "Alien Kulture",
   "rawData": [
      "Alien Kulture was a British punk band active from 1979 through 1981, founded by Ausaf Abbas, Azhar Rana, Pervez Bilgrami, and self-described \"token white\" Huw Jones.  Inspired by the nascent punk scene, the Anti-Nazi League and the Rock Against Racism concert series, and wanting to express the frustrations of second-generation Asian immigrants during a period of ethnic tension and race riots in Britain, the members of the band turned to music to achieve politically what they had not been able to via protest rallies, and to draw on their Pakistani Muslim backgrounds to promote an Asian presence in popular culture.  They took their name as a response to then newly elected Prime Minister Margaret Thatcher's stated fears of being \"swamped by people with a different culture\".\n",
      "Seeking to express themselves as youth caught between two cultures, they wrote songs about racism and issues within the Asian community, such as arranged marriage, leading to attacks both from neo-Nazis supporting the National Front as well as other Asians who felt they were disgracing their community. The band eventually recorded one single, \"Culture Crossover\" b/w \"Asian Youth\", which was released by Rock Against Racism Records.  They attracted the support of famed BBC DJ John Peel, who said he played them on air not just because they were Asian but because he liked their music.  However, they were otherwise ignored by mainstream media, and the group came to feel their music was not having the political effect they had hoped for. They declined an invitation to perform at a concert with The Specials at Coventry Stadium in protest of racial profiling by police because Ausaf and Azhar were due to sit their finals exams at the London School of Economics that same day, and disbanded soon after, having played only 30 shows.\n",
      "Today, Huw Jones works in the non-profit sector in Leeds, Pervez Bilgrami runs a successful recruitment agency with his wife, Azhar Rana is a partner in a firm of chartered accountants, and Ausaf Abbas is a financial advisor.\n"
   ],
   "infobox": {},
   "albums": [],
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band active from [YEAR] through [YEAR], founded by Ausaf Abbas, Azhar Rana, [PERSON_NAME_FULL_0_MALE], and self-described [SONG_NAME].\n",
      "Seeking to express themselves as youth caught between two cultures, they wrote songs about racism and issues within the Asian community, such as arranged marriage, leading to attacks both from neo-Nazis supporting the National Front as well as other Asians who felt they were disgracing their community. The band eventually recorded one single, [SONG_NAME], which was released by Rock Against Racism Records.  They attracted the support of famed BBC DJ [PERSON_NAME_FULL_0_MALE], who said he played them on air not just because they were Asian but because he liked their music.  However, they were otherwise ignored by mainstream media, and the group came to feel their music was not having the political effect they had hoped for. They declined an [GENRE] a concert with The Specials at Coventry Stadium in protest of racial profiling by police because Ausaf and Azhar were due to sit their finals exams at the London School of Economics that same day, and disbanded soon after, having played only 30 shows.\n",
      "Today, Huw Jones works in the non-profit sector in Leeds, [PERSON_NAME_FULL_0_MALE] runs a [GENRE] a partner in a firm of chartered accountants, and Ausaf Abbas is a financial advisor.\n"
   ]
}