{
   "Name": "Androids of Mu",
   "rawData": [
      "Androids of Mu was an English all-female anarcho-punk/post-punk band based in London, active from 1979 to 1983. They were part of a West London squatland scene, alongside bands such as the Poison Girls, Zounds, The Mob and The Astronauts.\n",
      "Emerging from associations with the hippy-orientated Here & Now, Nik Turner, Gong's Daevid Allen and Gilli Smyth, the Androids of Mu formed out of the Frestonia squatter community in Notting Hill Gate, West London, notable in its time for producing non-conformist music.\n",
      "The band's driving force was vocalist Suze da Blooze (11 February 1950 – 19 August 2007). She shared lead vocals with Corrina, and wrote much of the band's material. They released one album, Blood Robots, recorded by F*** Off Records label-head Keith Dobson (Kif Kif le Batteur) in his Street Level studio.\n"
   ],
   "infobox": {
      "Origin": [
         "Frestonia, West London, England"
      ],
      "Genres": [
         "Anarcho-punk",
         "Post-punk"
      ],
      "Years active": [
         "1979-1983"
      ],
      "Labels": [
         "F*** Off Records"
      ],
      "Associated acts": [
         "Planet Gong",
         "Here & Now"
      ],
      "Past members": [
         "Suze da Blooze",
         "Corrina",
         "Cozmic",
         "Bess"
      ]
   },
   "albums": [
      "Androids of Mu",
      "Blood Robots"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band based in London, active from [YEAR] to [YEAR]. They were part of a West London squatland scene, alongside bands such as the Poison Girls, Zounds, The Mob and The Astronauts.\n",
      "Emerging from associations with the hippy-orientated Here & Now, Nik Turner, Gong's Daevid Allen and Gilli Smyth, the [BAND_NAME] formed out of the Frestonia squatter community in Notting Hill Gate, West London, notable in its time for producing non-conformist music.\n",
      "The band's driving force was vocalist Suze da Blooze (11 [MONTH] [YEAR] – 19 [MONTH] [YEAR]). She shared lead vocals with Corrina, and wrote much of the band's material. They released one album, Blood Robots, recorded by F*** Off Records label-head [PERSON_NAME_FULL_0_MALE] (Kif Kif le Batteur) in his Street Level studio.\n"
   ]
}