{
   "Name": "The Apostles (band)",
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Albums",
      "2.2 EPs",
      "2.3 Compilations",
      "2.4 Demo albums (cassette only)",
      "2.5 Tracks on various artists compilation albums",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "The Apostles are an English experimental punk rock band, who developed within the confines of the 1980s anarcho-punk scene in the UK, but did not necessarily adhere to the aesthetics of that movement.\n"
      ]
   },
   "History": {
      "text": [
         "The Apostles were formed in the Islington area of London in 1979 by William 'Bill' Corbett (vocals), Julian Portinari (bass), Dan McIntyre (drums) and Pete Byng-Hall (guitar).[1] This line-up of the group did not play any concerts, and only appeared in a small number of fanzines (including Paroxysm Fear and New Crimes) before Bill Corbett left the group.\n",
         "Andy Martin joined as vocalist in summer 1981, and the group played their first concert on 22 September 1981. This line-up of the group then recorded an eponymous demo tape later that year.\n",
         "The music of the group is generally characterised by a varied eclecticism which encompasses punk and Blues rock, with influences like Lemon Kittens, Five Or Six, and other avant-garde groups.\n",
         "The remaining founder members of the group left the group in early 1982. Martin recruited Dave Fanning (ex-Innocent Bystander) as bass player, along with a revolving line-up of musicians – including John Soares, Kev Apostle, Flump, Chris Low (ex-Political Asylum) and Olly Bucket (Eat Shit) – to continue the group, who went on to play numerous concerts in the London area, and to record 8 demo cassettes and 4 7\" singles between 1982 and 1984.\n",
         "Andy Martin and Dave Fanning were joined in 1984 by Malcolm \"Scruff\" Lewty (later of Hellbastard, Sidewinder, Nero Circus and Heavy Water) and drummer Chris \"Widni\" Wiltshire which created a line-up which remained relatively stable (with the addition of Sean Stokes and Colin Murrell) until the group's demise at the end of the 1980s. The group recorded over 10 demo cassettes, 4 7\" singles and 7 12\" LP's between mid-1984 and 1990. Original guitarist Pete Bynghall re-joined the group in late 1988 for their last recordings and final concert (cf Live at the Academy).\n",
         "Always highly critical of the seemingly inward looking anarchist movement of the times, the autonomous and extreme libertarian approach of The Apostles seemed to portray classic anarchism, as opposed to the conformity of many of their contemporaries. This led the group receiving respect from notable members of the anarcho-punk movement such as Conflict, who released three records by The Apostles, and Crass with whom the band co-operated with during the squatting of the Zig-Zag Club and during the time in which The Autonomy Centre and Centro Iberico anarchist venues operated. Both Martin and Fanning worked during this period at the Little @ printers – an anarchist printers located in the same building as the Autonomy Centre in Wapping. The Autonomy Centre was founded with proceeds from the Crass \"Bloody Revolutions\" single in 1980 where Martin was a keyholder prior to joining The Apostles.\n",
         "The anti-communist and anti-gay lyrics of 'Rock Against Communism' and 'Kill or Cure' on the 'Giving of Loving Costs Nothing' ep and other similarly themed later songs opened the group to charges of fascism and homophobia. Whilst this material was intended to expose the supine attitudes of those within the 'anarcho punk' milieu who did not challenge such blatantly provocative sentiments (a tactic which Andy Martin had used since his entrance to the group), they undermined the coherence of the band's ideology, leading Stewart Home, in his book Cranked Up Really High, to describe The Apostles as \"locked into...a stasis if not actual paralysis\".\n",
         "During the time the band was together Andy Martin began to write about his homosexuality and the subject in general which alienated many of their former fans but did not deter Martin. In 1989, Martin and Fannig gave an interview with Homocore fanzine which addressed this issue.[2] Among their many recordings released, The Apostles contributed the song \"Forbidden Love\" to the first queercore compilation, JD.s Top Ten Homocore Hits, released by J.D.s fanzine in 1990.\n",
         "The Apostles split as a group in 1990, immediately forming Academy 23 which also included Nathan Coles (of The Unbelievables) and Lawrence Burton (formerly of Konstruktivists). The group collaborated with the industrial band The Grey Wolves on two songs, \"Terror Chamber\" and \"Terror Intensifies\", both featured on compilations. Academy 23 were renamed in 1994 as Unit.\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "EPs": {
         "text": [
            "Chart placings shown are from the UK Independent Chart.[3]\n",
            "The Joy Of Living were a female folk/punk band who released one cassette demo in addition to the above recording.\n"
         ]
      },
      "Compilations": {},
      "Demo albums (cassette only)": {},
      "Tracks on various artists compilation albums": {
         "text": [
            "Several early Apostles tracks are featured on the Cause For Concern compilation A Sudden Surge of Power. A sampler of the early 1980s post-punk industrial music scene, it also featured contributions from Nocturnal Emissions, Test Department, Attrition, 400 Blows, We Be Echo and ex-Throbbing Gristle members Chris and Cosey.\n"
         ]
      }
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Apostles are an English experimental punk rock band, who developed within the confines of the 1980s anarcho-punk scene in the UK, but did not necessarily adhere to the aesthetics of that movement.\n",
      "The Apostles were formed in the Islington area of London in 1979 by William 'Bill' Corbett (vocals), Julian Portinari (bass), Dan McIntyre (drums) and Pete Byng-Hall (guitar).[1] This line-up of the group did not play any concerts, and only appeared in a small number of fanzines (including Paroxysm Fear and New Crimes) before Bill Corbett left the group.\n",
      "Andy Martin joined as vocalist in summer 1981, and the group played their first concert on 22 September 1981. This line-up of the group then recorded an eponymous demo tape later that year.\n",
      "The music of the group is generally characterised by a varied eclecticism which encompasses punk and Blues rock, with influences like Lemon Kittens, Five Or Six, and other avant-garde groups.\n"
   ],
   "infobox": {
      "Origin": [
         "London, England"
      ],
      "Genres": [
         "Punk rock, anarcho-punk"
      ],
      "Years active": [
         "1979–1990"
      ],
      "Labels": [
         "Mortarhate Records"
      ],
      "Associated acts": [
         "Academy 23, Innocent Bystander, Political Asylum, Oi Polloi, The Parkinsons, Geordie, Hellbastard, Sidewinder, Nero Circus, Heavy Water, The Demolition Company"
      ],
      "Past members": [
         "Andy Martin",
         "William 'Bill' Corbett",
         "Julian Portinari",
         "Dan McIntyre",
         "Pete Byng-Hall",
         "John Soares",
         "Chris Low",
         "Dave Fanning",
         "Chris \"Widni\" Wiltshire",
         "Malcolm \"Scruff\" Lewty",
         "Sean Stokes",
         "Colin Murrell"
      ]
   }
}