{
   "Name": "The Burial",
   "Sections": [
      "1 Political views",
      "2 Members",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "\n",
         "\nThe Burial were an English Oi! band that incorporated ska, northern soul and folk influences into their music. Formed in 1981 in Yorkshire, England, they released one album, A Day On the Town, in 1988, and worked with Bradford's anarchist rant-poet Nick Toczek on various projects under the name Britanarchists. They disbanded in 1988.\n",
         "Two of The Burial's earliest recordings, \"Backstreet Child\" and \"I Just Can't Forget\", appear on the compilation album Oi! The Demos (80-83), whose liner notes describe them as \"the prototype Skacore band\". They have three songs on the compilation Oi! of Sex — two as The Burial (\"Old Mans Poison\", \"Friday Night\") and one as Nick Toczek's Britanarchists (\"Stiff With a Quiff\"). Their song \"Sheila\" appears on the compilation The Sound of Oi!, and their song \"Holding On\" appears on  Oi! Glorious Oi!\n",
         "Their sound is described in Spirit of '69: A Skinhead Bible as a \"volatile Punk and Soul cocktail.\"[1] In his article \"Oi!: The Truth\", Garry Bushell wrote: \"Scarborough’s Burial cited Oi and 2-Tone as forebears and mixed the sounds of ska and rowdy bootboy punk in their set.\" [2] A song by Bushell's band The Gonads, \"Joys of Oi!\", included the lyric \"Burial at number one\". i-D magazine stated The Burial are \"probably the first skinhead band to ever play ska\".[3] The Burial are described in Burning Britain: The History of UK Punk 1980–1984 as \"Skinhead Ska\".[4] The band were regularly featured in the traditional skinhead fanzine Hard as Nails, and were described in Issue 4 as \"Great Streetpunk hopes\".\n"
      ]
   },
   "Political views": {
      "text": [
         "Eric \"Barney\" Barnes was the chief leftist influence on the band. He was an active member of the Militant tendency, and he vigorously supported the National Union of Miners in its year-long strike action, as well as supporting working class revolutionary socialist groups such as Red Action, to whom The Burial gave an interview in which guitarist Chris said: \"I've got short hair doesn't mean I'm a frigging Nazi. Don't mean I'm a Commie either.\"[5] Barnes told i-D magazine: \n",
         "I come from an iron ore mining village near Middlesbrough and a strong trade union background. A lot of my family were original skins and to us skinhead was a working class movement and fascism is totally opposed to that. The strong grounding in working class politics has given Northern Skins an abhorrence of  the National Front that London skins never had.[3]\n",
         "i-D wrote: \"They formed six years ago, emerging at the same time as The Redskins, but whereas the later responded to boneheads by moving into the student circuit, a strong feature of The Burial's gigs was the Nazi-bashing.\"[3] The article includes a quote from Paul McGinn of the Glasgow Spy Kids: \"They were the first band to stand up and say what a lot of people felt\".[3] The book Spirit of '69: A Skinhead Bible included a quote from singer Mick Hall at a concert in Stockton in 1985, in which he said to the audience: \"You read in the papers all Skinheads are thick fascist thugs. I'm not a thick fascist thug. Are there any thick fascist thugs in here?\"[1] The Burial are described in Oi! Oi! Oi!: Class, Locality, and British Punk (Oxford: Oxford University Press) as \"militantly anti-fascist\". [6]\n"
      ]
   },
   "Members": {},
   "References": {},
   "External links": {},
   "coreData": [
      "\nThe Burial were an English Oi! band that incorporated ska, northern soul and folk influences into their music. Formed in 1981 in Yorkshire, England, they released one album, A Day On the Town, in 1988, and worked with Bradford's anarchist rant-poet Nick Toczek on various projects under the name Britanarchists. They disbanded in 1988.\n",
      "Two of The Burial's earliest recordings, \"Backstreet Child\" and \"I Just Can't Forget\", appear on the compilation album Oi! The Demos (80-83), whose liner notes describe them as \"the prototype Skacore band\". They have three songs on the compilation Oi! of Sex — two as The Burial (\"Old Mans Poison\", \"Friday Night\") and one as Nick Toczek's Britanarchists (\"Stiff With a Quiff\"). Their song \"Sheila\" appears on the compilation The Sound of Oi!, and their song \"Holding On\" appears on  Oi! Glorious Oi!\n",
      "Their sound is described in Spirit of '69: A Skinhead Bible as a \"volatile Punk and Soul cocktail.\"[1] In his article \"Oi!: The Truth\", Garry Bushell wrote: \"Scarborough’s Burial cited Oi and 2-Tone as forebears and mixed the sounds of ska and rowdy bootboy punk in their set.\" [2] A song by Bushell's band The Gonads, \"Joys of Oi!\", included the lyric \"Burial at number one\". i-D magazine stated The Burial are \"probably the first skinhead band to ever play ska\".[3] The Burial are described in Burning Britain: The History of UK Punk 1980–1984 as \"Skinhead Ska\".[4] The band were regularly featured in the traditional skinhead fanzine Hard as Nails, and were described in Issue 4 as \"Great Streetpunk hopes\".\n",
      "Eric \"Barney\" Barnes was the chief leftist influence on the band. He was an active member of the Militant tendency, and he vigorously supported the National Union of Miners in its year-long strike action, as well as supporting working class revolutionary socialist groups such as Red Action, to whom The Burial gave an interview in which guitarist Chris said: \"I've got short hair doesn't mean I'm a frigging Nazi. Don't mean I'm a Commie either.\"[5] Barnes told i-D magazine: \n"
   ],
   "infobox": {}
}