{
   "Name": "The Cravats",
   "rawData": [
      "\nThe Cravats are an English punk rock band originally from Redditch, England, founded in 1977 by Robin Dallaway (vocals, guitar) and The Shend (bass, vocals), with Svor Naan (saxophone) and Dave Bennett on drums. Lead vocal duties in the original incarnation of the band were shared between Dallaway and The Shend. Current members are The Shend (vocals), Svor Naan (sax), Viscount Biscuits (guitar), Joe 91 (bass) and Rampton Garstang (drums).\n",
      "The first single from the Cravats was the self-financed \"Gordon\", released in 1978. On 31 July 1979 they recorded their first session for the John Peel show on BBC Radio 1. Soon after they received a recording contract with Small Wonder Records. Three further Peel Sessions followed on 6 October 1980, 18 August 1981 and 15 November 1982. Debut album In Toytown was released in 1980.\n",
      "The band had a rest at the close of 1982 although a second Cravats LP The Colossal Tunes Out was released in 1983 on the Corpus Christi label. Dallaway and The Shend formed The Very Things, as well as DCL Locomotive and The Babymen - the latter two had originally featured Svor Naan on guitar. A final release by Dallaway and The Shend as 'The Cravats DCL' was The Land of the Giants EP (1985) however, this incarnation did not include either Svor Naan (saxophone) who had joined Pigbros or, Dave Bennett (on drums) who had joined The Poison Girls.\n"
   ],
   "infobox": {},
   "albums": [],
   "prunedData": [
      "\n[BAND_NAME] are an [GENRE] band originally from Redditch, England, founded in [YEAR] by Robin Dallaway (vocals, guitar) and The Shend (bass, vocals), with Svor Naan (saxophone) and Dave Bennett on drums. Lead vocal duties in the original incarnation of the band were shared between Dallaway and The Shend. Current members are The Shend (vocals), Svor Naan (sax), Viscount Biscuits (guitar), Joe 91 (bass) and Rampton Garstang (drums).\n",
      "The first single from the Cravats was the self-financed [SONG_NAME], released in [YEAR]. On 31 [MONTH] [YEAR] they recorded their first session for the John Peel show on BBC Radio 1. Soon after they received a recording contract with Small Wonder Records. Three further Peel Sessions followed on 6 [MONTH] [YEAR], 18 [MONTH] [YEAR] and 15 [MONTH] [YEAR]. Debut album In Toytown was released in [YEAR].\n",
      "The band had a rest at the close of [YEAR] although a second Cravats LP The Colossal Tunes Out was released in [YEAR] on the Corpus Christi label. Dallaway and The Shend formed The Very Things, as well as DCL Locomotive and The Babymen - the latter two had originally featured Svor Naan on guitar. A final release by Dallaway and The Shend as '[BAND_NAME] DCL' was The Land of the Giants EP ([YEAR]) however, this incarnation did not include either Svor Naan (saxophone) who had joined Pigbros or, Dave Bennett (on drums) who had joined The Poison Girls.\n"
   ]
}