{
   "Name": "The Cravats",
   "Sections": [
      "1 History",
      "2 Reformation",
      "3 Discography",
      "3.1 Singles",
      "3.2 Albums",
      "4 Compilations",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "\n",
         "\nThe Cravats are an English punk rock band originally from Redditch, England, founded in 1977 by Robin Dallaway (vocals, guitar) and The Shend (bass, vocals), with Svor Naan (saxophone) and Dave Bennett on drums.[1][2] Lead vocal duties in the original incarnation of the band were shared between Dallaway and The Shend. Current members are The Shend (vocals), Svor Naan (sax), Viscount Biscuits (guitar), Joe 91 (bass) and Rampton Garstang (drums).[3]\n"
      ]
   },
   "History": {
      "text": [
         "The first single from the Cravats was the self-financed \"Gordon\", released in 1978. On 31 July 1979 they recorded their first session for the John Peel show on BBC Radio 1. Soon after they received a recording contract with Small Wonder Records. Three further Peel Sessions followed on 6 October 1980, 18 August 1981 and 15 November 1982. Debut album In Toytown was released in 1980.[4]\n",
         "The band had a rest at the close of 1982 although a second Cravats LP The Colossal Tunes Out was released in 1983 on the Corpus Christi label. Dallaway and The Shend formed The Very Things, as well as DCL Locomotive and The Babymen[5] - the latter two had originally featured Svor Naan on guitar. A final release by Dallaway and The Shend as 'The Cravats DCL' was The Land of the Giants EP (1985) however, this incarnation did not include either Svor Naan (saxophone) who had joined Pigbros or, Dave Bennett (on drums) who had joined The Poison Girls.\n"
      ]
   },
   "Reformation": {
      "text": [
         "In 2006, a double CD compilation of Cravats singles and other material was released as The Land Of The Giants - The Best Of The Jazz-Punk Colossals on Overground Records, including new track \"Seance\" mixed by Paul Hartnoll of Orbital, and also released as a single.[6] Seance was the last Cravats release to feature Dallaway as lead vocalist.\n",
         "The Cravats original members The Shend and Svor Naan put together a 'live ensemble' for the Rebellion Festival in August 2009. The band continued to play live with gigs in Dublin, London, and further appearances at Rebellion in August 2010, 2011/[7] and 2012, at the Incubate Festival in Tilburg, and as special guests of Steve Ignorant (Crass) at his final 'Last Supper' show at Shepherd's Bush Empire.\n",
         "A CD reissue of their first LP, The Cravats In Toytown was released in 2012. It includes all five singles (A & B sides) originally released by Small Wonder including the band's 1st single Gordon / Situations Vacant. It is accompanied by an additional CD featuring a complete remoulding of the original In Toytown 8 track masters by Penny Rimbaud (Crass).\n",
         "On 11 March 2016, The Cravats released their first new recorded material in 30 years in the form of \"Jingo Bells\"/\"Batterhouse\", a limited edition 7\" released on Overground Records. The record received favourable reviews and numerous radio plays including from Gideon Coe, Marc Riley and Henry Rollins. The Cravats third album Dustbin of Sound followed on Overground Records in October 2017.[8]\n"
      ]
   },
   "Discography": {
      "Singles": {},
      "Albums": {},
      "text": [
         "Chart placings are from the UK independent chart.[9]\n"
      ]
   },
   "Compilations": {},
   "References": {},
   "External links": {},
   "coreData": [
      "\nThe Cravats are an English punk rock band originally from Redditch, England, founded in 1977 by Robin Dallaway (vocals, guitar) and The Shend (bass, vocals), with Svor Naan (saxophone) and Dave Bennett on drums.[1][2] Lead vocal duties in the original incarnation of the band were shared between Dallaway and The Shend. Current members are The Shend (vocals), Svor Naan (sax), Viscount Biscuits (guitar), Joe 91 (bass) and Rampton Garstang (drums).[3]\n",
      "The first single from the Cravats was the self-financed \"Gordon\", released in 1978. On 31 July 1979 they recorded their first session for the John Peel show on BBC Radio 1. Soon after they received a recording contract with Small Wonder Records. Three further Peel Sessions followed on 6 October 1980, 18 August 1981 and 15 November 1982. Debut album In Toytown was released in 1980.[4]\n",
      "The band had a rest at the close of 1982 although a second Cravats LP The Colossal Tunes Out was released in 1983 on the Corpus Christi label. Dallaway and The Shend formed The Very Things, as well as DCL Locomotive and The Babymen[5] - the latter two had originally featured Svor Naan on guitar. A final release by Dallaway and The Shend as 'The Cravats DCL' was The Land of the Giants EP (1985) however, this incarnation did not include either Svor Naan (saxophone) who had joined Pigbros or, Dave Bennett (on drums) who had joined The Poison Girls.\n",
      "In 2006, a double CD compilation of Cravats singles and other material was released as The Land Of The Giants - The Best Of The Jazz-Punk Colossals on Overground Records, including new track \"Seance\" mixed by Paul Hartnoll of Orbital, and also released as a single.[6] Seance was the last Cravats release to feature Dallaway as lead vocalist.\n"
   ],
   "infobox": {}
}