{
   "Name": "The Defects",
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Singles",
      "2.3 Live albums",
      "2.4 Compilation albums",
      "2.5 Compilation appearances",
      "2.6 Videos",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "The Defects are a punk rock band from Belfast, Northern Ireland, formed in 1978\n"
      ]
   },
   "History": {
      "text": [
         "The band formed in 1978 with a lineup of Ian \"Buck\" Murdock (vocals), Marcus \"Dukie\" Duke (guitar), Jeff Gilmore (bass) and Glenn Kingsmore (drums).[1]\n",
         "After playing locally, they recorded their first demo, but when this failed to gain them a record deal, they started their own Casualty Records label and issued their debut 7\", \"Dance (Until You Drop)\".[1] The three-song EP sold all 2,000 copies and brought the band to the attention of the UK music press. Melody Maker journalist Carol Clerk befriended the band and recommended them to John Curd, manager of WXYZ Records, who signed them to his label.[1] Gary Smith replaced Fenton on bass, and the Defects moved to London in 1982 and embarked on the six-week \"So What\" UK tour with labelmates the Anti-Nowhere League, Chelsea and Chron Gen. The tour was filmed by Stewart Copeland (with backing from brother Miles) and intended for cinema release, but it was never issued.[2]\n",
         "A second single, \"Survival\", was issued in 1982, reaching No. 8 in the UK Indie Chart.[3] The band released their debut album, Defective Breakdown, in 1982. \n",
         "With Curd looking for ways to gain crossover success for the bands on his label, he persuaded the Defects to record a cover version of Elvis Presley's \"Suspicious Minds\" with producer Ray Shulman on keyboards. The single's release in early 1984 coincided with the decline in popularity of second-wave punk, and did not sell well. With control of the band's destiny slipping away, Murdock left after the release of \"Suspicious Minds\". The band continued, playing a gig supporting 999 with Kingsmore on vocals, before Murdock rejoined to play in support of the Clash in Belfast. The band then permanently split, with all members returning to Belfast except Duke, who stayed in London.[1] Kingsmore joined Western Justice with former members of Rabies, including Murdock's brother Gary, and was later a member of Ashanti.\n",
         "Murdock revived the Defects name in 1996 for a one-off performance at a punk festival at the Bath Pavilion, which was filmed and released on video by Barn End Video as Live at the Pavilion 12.10.96. He later started the punk and ska covers band Doghouse.[1]\n",
         "The Defects reformed again in 2010 and played various punk festivals. Added to the lineup were Roy McAllister and Aidy \"Fudge\" Dunlop (replacing Smith and Duke). In 2012, they toured Australia, followed by appearances at the Rebellion Punk Festival in Blackpool in 2013, 2014, 2016, 2017 and 2018. Since 2014, Duke occasionally joins them on stage for some of their best known songs.\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Singles": {},
      "Live albums": {},
      "Compilation albums": {},
      "Compilation appearances": {},
      "Videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Defects are a punk rock band from Belfast, Northern Ireland, formed in 1978\n",
      "The band formed in 1978 with a lineup of Ian \"Buck\" Murdock (vocals), Marcus \"Dukie\" Duke (guitar), Jeff Gilmore (bass) and Glenn Kingsmore (drums).[1]\n",
      "After playing locally, they recorded their first demo, but when this failed to gain them a record deal, they started their own Casualty Records label and issued their debut 7\", \"Dance (Until You Drop)\".[1] The three-song EP sold all 2,000 copies and brought the band to the attention of the UK music press. Melody Maker journalist Carol Clerk befriended the band and recommended them to John Curd, manager of WXYZ Records, who signed them to his label.[1] Gary Smith replaced Fenton on bass, and the Defects moved to London in 1982 and embarked on the six-week \"So What\" UK tour with labelmates the Anti-Nowhere League, Chelsea and Chron Gen. The tour was filmed by Stewart Copeland (with backing from brother Miles) and intended for cinema release, but it was never issued.[2]\n",
      "A second single, \"Survival\", was issued in 1982, reaching No. 8 in the UK Indie Chart.[3] The band released their debut album, Defective Breakdown, in 1982. \n"
   ],
   "infobox": {
      "Origin": [
         "Belfast, Northern Ireland"
      ],
      "Genres": [
         "Punk rock"
      ],
      "Years active": [
         "1978 - 1984, 2010–present"
      ],
      "Labels": [
         "WXYZ Records, Casualty Records, I.D. Records, Punkerama Records, Antisociety"
      ],
      "Associated acts": [
         "Western Justice, Ashanti, Doghouse Ska"
      ],
      "Members": [
         "Ian \"Buck\" Murdock",
         "Glenn Kingsmore",
         "Aidy \"Fudge\" Dunlop",
         "Roy McAllister"
      ],
      "Past members": [
         "Marcus \"Dukie\" Duke",
         "Jeff Gilmore",
         "Gary Smith"
      ]
   }
}