{
   "Name": "The Magazine Spies",
   "rawData": [
      "The Magazine Spies were an English post-punk band from the town of Horley. They were active during 1979 and 1980, and are notable for band members who went on to play in the Cure, Fools Dance and related projects. The Magazine Spies were also known as the Magspies and Mag/Spys; a wordplay on \"magpies\".\n",
      "The initial lineup in 1979 comprised the original members of Horley punk rock band Lockjaw (1976–1978); Gary Bowe (vocals), Simon Gallup (bass guitar), Stuart Hinton (guitar) and Martin Ordish (drums). They were joined by Matthieu Hartley (keyboards). The band's transition from Lockjaw to the Magspies coincided with their parting company with Raw Records, and expanding from their punk origins to explore post-punk and new wave. As they had done as Lockjaw, the Magspies continued to play regularly around Horley and Crawley with the Cure, among others. Both Lockjaw and The Magspies were managed and promoted by bassist Gallup's elder brothers Dave Gallup and Ric Gallup.\n",
      "In October 1979, Gallup and Hartley left the Magspies to join the new lineup of the Cure. During the same month, however, the Magspies entered Morgan Studios in London as part of a recording session for Cult Hero. Hartley and Simon Gallup both performed as members of Cult Hero during these sessions. In between recording Cult Hero, Robert Smith of the Cure and Ric Gallup produced tracks by the Obtainers and the Magspies for Ric Gallup's new record label Dance Fools Dance, including \"Lifeblood\", \"Bombs\", \"Dishonour\" and \"Gary’s Gone to War\". Simon Gallup performed bass on the Magspies recordings apart from \"Gary's Gone to War\", which featured Rik Kite on bass, but Hartley's keyboard playing did not appear. Backing vocals were provided by Simon Gallup's then-girlfriend Carol Thompson.\n"
   ],
   "infobox": {},
   "prunedData": [
      "[BAND_NAME] were an [GENRE] band from the town of Horley. They were active during [YEAR] and [YEAR], and are notable for band members who went on to play in the Cure, Fools Dance and related projects. [BAND_NAME] were also known as the Magspies and Mag/Spys; a wordplay on \"magpies\".\n",
      "The initial lineup in [YEAR] comprised the original members of Horley punk rock band Lockjaw ([YEAR]–[YEAR]); Gary Bowe (vocals), [PERSON_NAME_FULL_0_MALE] (bass guitar), Stuart Hinton (guitar) and [MONTH]tin Ordish (drums). They were joined by [PERSON_NAME_FULL_2_MALE] (keyboards). The band's transition from Lockjaw to the Magspies coincided with their parting company with Raw Records, and expanding from their punk origins to explore post-punk and new wave. As they had done as Lockjaw, the Magspies continued to play regularly around Horley and Crawley with the Cure, among others. Both Lockjaw and The Magspies were managed and promoted by bassist [PERSON_NAME_LAST_0]'s elder brothers [PERSON_NAME_FIRST_1] [PERSON_NAME_LAST_0] and Ric [PERSON_NAME_LAST_0].\n",
      "In [MONTH] [YEAR], Gallup and Hartley left the Magspies to join the new lineup of the Cure. During the same month, however, the Magspies entered Morgan Studios in London as part of a recording session for Cult Hero. Hartley and Simon Gallup both performed as members of Cult Hero during these sessions. In between recording Cult Hero, [PERSON_NAME_FULL_1_MALE] of the Cure and Ric Gallup produced tracks by the Obtainers and the Magspies for Ric Gallup's new record label Dance Fools Dance, including \"Lifeblood\", \"Bombs\", \"Dishonour\" and \"Gary’s Gone to War\". Simon Gallup performed bass on the Magspies recordings apart from \"Gary's Gone to War\", which featured Rik Kite on bass, but Hartley's keyboard playing did not appear. Backing vocals were provided by Simon Gallup's then-girlfriend [PERSON_NAME_FULL_0_FEMALE].\n"
   ]
}