{
   "Career": {
      "text": [
         "Initially playing exclusively on the London Irish bar circuit, apparently mainly for more hedonistic reasons, and with a correspondingly 'cavalier' attitude towards required band possessions and responsibilities, their name was serendipitously gleaned from the reaction to their approach by the exasperated (Irish) landlord at their first ever gig, cursing them with an old Irish saying using the term \"neck\" – implying high levels of nerve or impudence.\n",
         "After this initial period, whereby the band learned their craft and consolidated their line-up, they branched-out considerably, both aspirationally and geographically: touring extensively throughout the US, Europe, UK and Ireland, leading to them playing a large number of international festivals. Such festivals include: Tantsy festival in Moscow Hermitage Garden; Dublin Irish Festival, Ohio – the second-largest Irish festival in the USA; SXSW in Texas & their good friends' Flogging Molly's Salty Dog cruise out of Miami, also in the USA; Paas Pop in Holland; The West Belfast Féile an Phobail in The North and The Waterford Spraoi in The Republic in Ireland; Berlin's Punk & Disorderly festival four times, as well as With Full Force in Germany; while, in the UK, they have played their largest festival, Glastonbury, six times, as well as The Levellers own festival Beautiful Days four, Solfest three, Boomtown Fair twice and the Rebellion Festival, ten times.\n",
         "Their music reflects the life experience of the emigrant and second-generation Irish diaspora, with their front-man's voice and song-writing being considered both faithful to the form,[1] and in direct lineage from his former band-leader and mentor, Shane MacGowan. Neck have released four albums to date, with their third album, Sod 'Em & Begorrah!, being picked out for particularly high praise by being judged, variously, the second[2] and third[3] greatest Celtic punk album of all time, the former above, and the latter behind only The Pogues and Flogging Molly. \nThey have also appeared on numerous compilation albums, and their natural London inclusiveness and punk sensibilities came well to the fore on their Joe Strummer-inspired Anti-racism / Pro-inclusiveness anthem, \"Everybody's Welcome to The Hooley!\", which charted in the UK Indie Chart in 2006. Famously, the song was written as an immediate reaction to Far-right Skinheads violently disrupting an ostensibly 'No Politics' festival they were playing at in Belgium. Their frontman, incensed by how wrong these people were about punk rock, and inspired by the incendiary memory of seeing The Clash live in 1977, wrote the song in five minutes, taught it to the band before they went onstage, and played it at the Far-right Skinheads, invoking the whole crowd to chant Joe Strummer, prior to doing so. Making it clear, in the process, that being a London band, inspired by The Clash and the 1978 Rock Against Racism festival, and being an Irish band having both Catholics and Protestants in the band made them, intrinsically, political. The version of the song on the single also references, and is dedicated to, Stephen Lawrence and Anthony Walker, both of them being black British teenagers murdered in racially motivated attacks. Proceeds from the single went to Love Music Hate Racism. \n",
         "Their music can also be heard on various motion picture soundtracks: on the \"surreal\" Pirates of the White Sand[4] short (2005); The Emerald Diamond, a 2006 documentary film about the Irish National Baseball Team - contributing four songs, including the traditional \"Star of the County Down\" and the original \"Every Day's Saint Patrick's Day\"; the Boston-set Gang War Shoot-'em Up Beantown (2007); and the \"Capraesque\" homage to 'Small Town America Coming of Age' The Supermarket (2009).[5][6]  They also appear performing two songs, the traditional \"Carrickfergus\" and the original \"The Ferry Fare\", in the 1999, Belfast-set, Film 4 Romantic Comedy Drama With or Without You,[7][8] directed by Michael Winterbottom.\n",
         "With over half their members drawn from the renowned London Irish traditional music session scene, their authentic musicianship has earned them much respect and admiration. Staying true to those roots, they often perform acoustic 'Unplugged / Irish traditional music session' sets, at times alongside full electric ones, with one such performance, at 'The Irish House' during the celebrated London 2012 Olympics, enhancing their reputation (of passionate playing, 'knowing how to 'be' and their front-man 'wearing his heart on his sleeve') sufficiently that they were chosen by the Irish Cultural Centre in London to have the honour of performing such a Seisiún at the Reception for the Irish Paralympic team at the London 2012 Paralympics, in order to set the right encouraging Irish tone and ambience prior to them participating in the Opening ceremony. Accordingly, their front-man has also been given the honour by Sinn Féin, to host such sessions for any social functions that they stage in London, including the centenary celebrations for the Easter Rising in Portcullis House.\n",
         "This reputation has led to various members being invited to collaborate both live and on other band's recordings. The most well known is their front-man guesting, on banjo, with the Alabama 3 (alongside Segs of Ruts DC), and co-writing an original song \"That's It, I Quit\" on the Hayseed Dixie album No Covers.[9] He has also played in the folk punk supergroup, Folk Finger, alongside Cush and Ricky McGuire from The Men They Couldn't Hang and his old band-mate Danny Heatley from The Popes - including touring Ireland and an eventful New Year's Eve show in Prague; and also 'depped' for the front-man of Steampunk band The Men That Will Not Be Blamed For Nothing at the Glastonbury Festival. Collaboration can work the other way too, with their former member, Leigh Heggarty now of Ruts DC guesting live periodically.  \n",
         "This has all led to them being recognised as one of the leading bands on the international Celtic punk and folk punk scenes,[10] alongside their US contemporaries Dropkick Murphys and Flogging Molly, with the Boston, Massachusetts-based website covering the Celtic punk scene,  Shite 'n' Onions,[11] being named after one of their tunes,[12] and bands as far flung as in Germany and the United States now cover their songs, while their front-man even gets name-checked in songs by other bands.[13][14][15]\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Movie soundtracks": {},
      "Singles and EPs": {}
   },
   "External links": {},
   "References": {},
   "Sections": [
      "1 Career",
      "2 Discography",
      "2.1 Albums",
      "2.2 Singles and EPs",
      "2.3 Movie soundtracks",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Neck are a six-piece London-Irish Celtic punk band from the North London neighbourhood of Holloway. Following their front-man's cathartic 'Tour of Duty' as a member of the original line-up of Shane MacGowan and the Popes, Neck were 'born in a bottle' during late-night drinking sessions in 1994 by a mixture of Irish emigrant and second-generation Irish drinking buddies. The band takes their lead, both musically and ideologically, from two other London bands: The Clash and The Pogues, blending punk rock with traditional Irish music to play a London-Irish style known as 'Psycho-Ceilídh'.\n"
      ]
   },
   "Title": "Neck (band) - Wikipedia"
}