{
   "Name": "The Oppressed",
   "rawData": [
      "The Oppressed is a Welsh Oi! band that formed in 1981 in Cardiff, Wales. Most of the musicians in the band's various lineups have been skinheads. Throughout the band's career, the members (especially vocalist Roddy Moreno) openly expressed opposition to racism and fascism — in their lyrics, interviews, on-stage comments and other actions. In 1989, Moreno visited New York City and met a few members of Skinheads Against Racial Prejudice (SHARP). On his return to the United Kingdom, he started promoting SHARP ideals to British skinheads. The band has also had ties to other anti-racist groups, such as Anti-Fascist Action.  Moreno is a Cardiff City F.C. supporter, and some of the band's songs express that support. \n",
      "The band has split and re-formed several times, the first occasion in 1984 after which Moreno focused on his record labels, Oi! Records and Ska Records for the remainder of the decade.\n",
      "Their most recent split was in 2016, but they re-formed in 2020, and continue performing today. The present day line-up is Roddy Moreno (vocals/guitar), fellow founder member Russell \"Ducky\" Payne (guitar), Che Jones (drums) and Ross Goldworthy (bass).\n"
   ],
   "infobox": {
      "Origin": [
         "Cardiff, Wales"
      ],
      "Genres": [
         "Oi!, punk"
      ],
      "Years active": [
         "1981–1984, 1994–1996, 1998–2006, 2009–2016, 2020–present"
      ],
      "Labels": [
         "Oppressed Records, Step-1 Music, Oi! Records, Dojo, Knockout, Insurgence Records, Captain Oi! Records"
      ]
   },
   "albums": [
      "Never Say Die",
      "Victims / Work Together",
      "Fuck Fascism",
      "5-4-3-2-1",
      "They Think Its All Over...It Is Now",
      "Anti-Fascist Oi!",
      "Best of The Oppressed Bonus 7 Inch",
      "Strength In Unity",
      "The Noise",
      "Oppressed / Fatskins",
      "Insurgence",
      "7er Jungs / The Oppressed",
      "Antifa Hooligans",
      "S.H.A.R.P. as a Razor",
      "2 Generations - 1 Message",
      "Blue Army"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band that formed in [YEAR] in Cardiff, Wales. Most of the musicians in the band's various lineups have been skinheads. Throughout the band's career, the members (especially vocalist [PERSON_NAME_FULL_0_MALE]) openly expressed opposition to racism and fascism — in their lyrics, interviews, on-stage comments and other actions. In [YEAR], [PERSON_NAME_LAST_0] visited New York City and met a few members of Skinheads Against Racial Prejudice (SHARP). On his return to the United Kingdom, he started promoting SHARP ideals to British skinheads. The band has also had ties to other anti-racist groups, such as Anti-Fascist Action.  [PERSON_NAME_LAST_0] is a Cardiff City F.C. supporter, and some of the band's songs express that support. \n",
      "The band has split and re-formed several times, the first occasion in [YEAR] after which Moreno focused on his record labels, Oi! Records and Ska Records for the remainder of the decade.\n",
      "Their most recent split was in [YEAR], but they re-formed in [YEAR], and continue performing today. The present day line-up is [PERSON_NAME_FULL_1_MALE] (vocals/guitar), fellow founder member Russell [SONG_NAME] Payne (guitar), Che Jones (drums) and [PERSON_NAME_FULL_0_MALE] (bass).\n"
   ]
}