{
   "Name": "The Partisans (band)",
   "rawData": [
      "The Partisans are a Welsh punk rock band formed in Bridgend, South Wales, in early 1978, when all four members were in their early teens. They continued until 1984, having several hits on the UK Indie Chart. The band re-formed in the late 1990s.\n",
      "The band formed in early 1978, with an original line-up of Phil Stanton (vocals), Rob \"Spike\" Harrington (guitar and vocals), Andy Lealand (guitar), Mark \"Shark\" Harris (drums), and Mark \"Savage\" Parsons (bass guitar). Parsons and Stanton left in 1979, with Harrington moving to lead vocals, and Lealand's girlfriend Louise Wright joining on bass.\n",
      "Influenced by Sex Pistols, The Clash, and The Ramones, the band started off covering punk rock hits and soon started to compose their own material. They were the second band signed to Chris Berry's No Future Records label, and their debut release, the double A-sided \"Police Story\" / \"Killing Machine\" was released on 28 September 1981. It reached No. 5 on the UK Indie Chart, on the back of a tour with label-mates Blitz, and with strong support from Sounds writer Garry Bushell. Following the success of this single, The Partisans were included on the third volume of Bushell's Oi! compilation series Carry On Oi!, which reached No. 60 on the UK Albums Chart, and won the band gig slots with Blitz, Peter and the Test Tube Babies and The Ejected, as well as a 'No Future' night at London's Zig Zag Club with Red Alert, The Lombardos, and Peter and the Test Tube Babies. \n"
   ],
   "infobox": {
      "Origin": [
         "Bridgend, Wales, UK"
      ],
      "Genres": [
         "Punk rock, Hardcore punk"
      ],
      "Years active": [
         "1978–1984, late 1990s–present"
      ],
      "Labels": [
         "se"
      ],
      "Associated acts": [
         "Agent Orange, Transvision Vamp, Bush"
      ],
      "Members": [
         "Rob \"Spike\" Harrington",
         "Andy Lealand",
         "Magnus Neundorff",
         "Charlie Claesson"
      ],
      "Past members": [
         "Phil Stanton",
         "Mark \"Shark\" Harris",
         "Mark \"Savage\" Parsons",
         "Louise Wright",
         "Dave Parsons",
         " Mikael \"Gustav\" Gustavsson"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band formed in Bridgend, South Wales, in early [YEAR], when all four members were in their early teens. They continued until [YEAR], having several hits on the UK Indie Chart. The band re-formed in the late [YEAR]s.\n",
      "The band formed in early [YEAR], with an original line-up of Phil Stanton (vocals), Rob [SONG_NAME] Parsons (bass guitar). Parsons and Stanton left in [YEAR], with Harrington moving to lead vocals, and [PERSON_NAME_LAST_0]'s girlfriend Louise Wright joining on bass.\n",
      "Influenced by Sex Pistols, The Clash, and The Ramones, the band started off covering punk rock hits and soon started to compose their own material. They were the second band signed to [PERSON_NAME_FULL_0_MALE]'s No Future Records label, and their debut release, the double A-sided [SONG_NAME] was released on 28 [MONTH] [YEAR]. It reached No. 5 on the UK Indie Chart, on the back of a tour with label-mates Blitz, and with strong support from Sounds writer [PERSON_NAME_FULL_1_MALE]. Following the success of this single, [BAND_NAME] were included on the third volume of [PERSON_NAME_LAST_1]'s Oi! compilation series Carry On Oi!, which reached No. 60 on the UK Albums Chart, and won the band gig slots with Blitz, Peter and the Test Tube Babies and The Ejected, as well as a 'No Future' night at London's Zig Zag Club with Red Alert, The Lombardos, and Peter and the Test Tube Babies. \n"
   ]
}