{
   "Name": "Petrol Girls",
   "rawData": [
      "Petrol Girls is an English punk rock band formed in London in 2012 by Ren Aldridge and Liepa Kuraitė, with Joe York and Zock Astpai joining later. The band is named after the historical Pétroleuses and is outspokenly feminist. They have received media coverage from The Independent, Kerrang!, NPR and Vice Media\n",
      "Petrol Girls formed and played their first show in 2012, after just two practises, at a house party hosted by founding member Ren Aldridge (vocals) to celebrate International Women’s Day. Retaining original bassist Liepa Kuraitė, who had never played before Aldridge invited her to join, they eventually recruited Joe York (guitar) and Zock Astpai (drums) to complete a sustainable lineup.\n",
      "Aldridge took the name from a group of 19th century French revolutionaries, les Pétroleuses, after hearing them mentioned by Laurie Penny.\n"
   ],
   "infobox": {
      "Origin": [
         "London, England"
      ],
      "Genres": [
         "Hardcore punk",
         "post-hardcore",
         "riot grrrl"
      ],
      "Years active": [
         "2012 (2012)–present"
      ],
      "Labels": [
         "Bomber Music",
         "Laser Life Records",
         "Panic State Records",
         "Hassle Records"
      ],
      "Website": [
         "petrolgirls.bandcamp.com"
      ],
      "Members": [
         "Ren Aldridge",
         "Liepa Kuraitė",
         "Joe York",
         "Zock Astpai"
      ]
   },
   "albums": [
      "Talk of Violence",
      "Cut & Stitch"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in London in [YEAR] by [PERSON_NAME_FULL_0_FEMALE] and Liepa Kuraitė, with Joe York and Zock Astpai joining later. The band is named after the historical Pétroleuses and is outspokenly feminist. They have received media coverage from The Independent, Kerrang!, NPR and Vice Media\n",
      "[BAND_NAME] formed and played their first show in [YEAR], after just two practises, at a house party hosted by founding member [PERSON_NAME_FULL_0_FEMALE] (vocals) to celebrate International Women’s Day. Retaining original bassist Liepa Kuraitė, who had never played before [PERSON_NAME_LAST_0] invited her to join, they eventually recruited Joe York (guitar) and Zock Astpai (drums) to complete a sustainable lineup.\n",
      "Aldridge took the name from a [GENRE]"
   ]
}