{
   "Name": "The Piranhas",
   "Sections": [
      "1 Career",
      "2 Post The Piranhas, Dates & Piranhas revived",
      "3 Discography",
      "4 Original line-up (1977-1981)",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "\n",
         "\nThe Piranhas were a British ska-influenced punk band from Brighton. They are best known for their cover version of the song \"Tom Hark\".\n"
      ]
   },
   "Career": {
      "text": [
         "The Piranhas formed in 1977, and were originally part of the Brighton punk scene, first coming  to prominence when DJ John Peel started playing their single \"I Don't Want My Body\" on his BBC Radio 1 programme, but achieved their biggest success with their cover version of the South African kwela song \"Tom Hark\". This had been an instrumental hit in 1958 for Elias & His Zig Zag Jive Flutes, and had already been covered in a ska style by Millie Small and by Georgie Fame on his 1964 EP \"Rhythm & Blue-Beat\".  With new lyrics written by the band's frontman \"Boring\" Bob Grover (allegedly en route to the recording studio), and with Pete Waterman on executive production duties, it was a Top 10 hit in the UK Singles Chart in 1980.[1]\nIt was the first song to feature on BBC Television's pop music programme, Top of the Pops, when it returned in 1980 after being blacked out for nine weeks by industrial action. During the obviously mimed performance the drummer played using a pair of plastic fish as drumsticks.[2]\n",
         "Much later it also became a popular chant amongst British football fans.[3]  It is also popular at limited-overs cricket games, often being played when a boundary is hit, and the tune was also used in the novelty World Cup song \"We're England\", performed by the presenters of the radio station talkSPORT with adapted lyrics for the 2006 FIFA World Cup Finals. Two years later the band's version of Lou Busch's \"Zambesi\" - produced by Pete Collins - was a Top 20 hit in the UK Singles Chart.[1]\n"
      ]
   },
   "Post The Piranhas, Dates & Piranhas revived": {
      "text": [
         "After The Piranhas dissolved \"Boring\" Bob Grover continued to live in Brighton. \n",
         "Guitarist Johnny Helmer went on to become a songwriter. He is best known for writing lyrics for Marillion's second incarnation with Steve Hogarth, after the departure of original singer Fish. He also published a novel entitled Mother Tongue in 1999. As a day job, he works in marketing for a Brighton company (as of 1999).[3]\n",
         "Bassist, Reginald Frederick Hornsbury, now works as a mechanic in Wiltshire and has two children.\n",
         "The band gave their blessing to a song that entered the UK chart in 2005, a remake of their biggest hit entitled \"Tom Hark (We Want Falmer)\", recorded under the name of Seagulls Ska, featuring Brighton resident Attila the Stockbroker and members of the ska band, Too Many Crooks.  This was to help raise money for a new stadium for Brighton & Hove Albion F.C. (nicknamed \"The Seagulls\") at Falmer.[4][5] Grover received a co-writing credit for the Seagulls Ska version of the song.[6]\n",
         "In 2005 Grover was coaxed out of a 'self-imposed retirement' to join musical friends from The Greys pub in a rehearsal room. The new songs that came from these sessions inspired the formation of a band, ambiguously named 'Dates'. Dates music echoed elements of the Piranhas in that quirky lyrics were at the forefront of their sound, plus the band was fronted by two singer guitarists, but although still highly melodic it was a lot brasher and heavier utilising distorted guitars and feedback. \n",
         "Dates debut album, First Party, Fire and Theft was released on Hah! Records in March 2007, gaining airplay on BBC 6Music from Phill Jupitus. The band dissolved in 2009.\n",
         "In 2011 Grover and Helmer reunited to co-write new material and perform together again as Piranhas 3D. The new line-up featured Grover, guitar and vocals; Helmer, guitar and vocals; Oweninstereo (Owen Kellett) bass and vocals; Steve Burnaby Davies, drums, percussion and vocals, with guest Dominic Dring on saxophone.\n",
         "In 2015, Grover started gigging with Piranhas Four, with the line-up: Harry Jellywell, guitar / vocals; Owen Kellett bass / vocals; Ian Hills, drums.\n",
         "In 2015 Grover and Helmer featured in the BBC's Top of the Pops: The story of 1980 documentary. Alongside their 1980 performance and interviews with both, the film also features rare tour footage and John Peel soundbites.\n",
         "2018 sees a new update to the Band.\nBob Grover is still the mainstay, with the following backing up:\n",
         "Bon Bessom : Sax and vocal\nKen Brotherston : Drums, Vocals\nStu Wagstaff : Bass, Vocals\nGary Browne: Guitar, Vocals\n"
      ]
   },
   "Discography": {
      "text": [
         "1978\n",
         "1979\n",
         "1980\n",
         "1981\n",
         "1982\n",
         "1983\n"
      ]
   },
   "Original line-up (1977-1981)": {
      "text": [
         "\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "\nThe Piranhas were a British ska-influenced punk band from Brighton. They are best known for their cover version of the song \"Tom Hark\".\n",
      "The Piranhas formed in 1977, and were originally part of the Brighton punk scene, first coming  to prominence when DJ John Peel started playing their single \"I Don't Want My Body\" on his BBC Radio 1 programme, but achieved their biggest success with their cover version of the South African kwela song \"Tom Hark\". This had been an instrumental hit in 1958 for Elias & His Zig Zag Jive Flutes, and had already been covered in a ska style by Millie Small and by Georgie Fame on his 1964 EP \"Rhythm & Blue-Beat\".  With new lyrics written by the band's frontman \"Boring\" Bob Grover (allegedly en route to the recording studio), and with Pete Waterman on executive production duties, it was a Top 10 hit in the UK Singles Chart in 1980.[1]\nIt was the first song to feature on BBC Television's pop music programme, Top of the Pops, when it returned in 1980 after being blacked out for nine weeks by industrial action. During the obviously mimed performance the drummer played using a pair of plastic fish as drumsticks.[2]\n",
      "Much later it also became a popular chant amongst British football fans.[3]  It is also popular at limited-overs cricket games, often being played when a boundary is hit, and the tune was also used in the novelty World Cup song \"We're England\", performed by the presenters of the radio station talkSPORT with adapted lyrics for the 2006 FIFA World Cup Finals. Two years later the band's version of Lou Busch's \"Zambesi\" - produced by Pete Collins - was a Top 20 hit in the UK Singles Chart.[1]\n",
      "After The Piranhas dissolved \"Boring\" Bob Grover continued to live in Brighton. \n"
   ],
   "infobox": {}
}