{
   "Name": "Cuddly Toys",
   "rawData": [
      "Cuddly Toys were a new wave band from London that grew out of the glam rock-influenced punk rock band Raped.\n",
      "The punk band Raped formed in 1976 with a line-up of Sean Purcell (vocals), Faebhean Kwest (guitar), Tony Baggett (bass), and Paddy Phield (drums). They released the Pretty Paedophiles EP and the \"Cheap Night Out\" single in 1978 on Parole Records. Their last gig as 'Raped' was in Belfast with the punk band Rudi at Christmas 1978. In January 1979 they changed their name to 'Cuddly Toys'.\n",
      "On the first recording sessions as Cuddly Toys (that later were to appear on the album \"Guillotine Theatre\"}, they were augmented by Alig Fodder and Nicky Brockway (piano). Then Billy Surgeoner joined the band for further album sessions as well as live appearances, playing keyboard synthesisers. The band's first release was the single \"Madman\", a song written by David Bowie and Marc Bolan shortly before Bolan's death, which reached No. 3 in the UK Indie Chart. They next released the Guillotine Theatre album in 1979 on Japanese label Teichiku, and a remixed version issued in the UK in 1980 on Fresh Records, which reached No. 1 in the indie album chart and 8 in the main billboard charts. The album was described by Dave Thompson, in a review for Allmusic, as \"one of the underrated classics of the late 1970s, as delivered by one of the most underrated bands\".  The band continued with various personnel changels through until 1987. \n"
   ],
   "infobox": {
      "Also known as": [
         "Raped"
      ],
      "Origin": [
         "Ireland / London"
      ],
      "Genres": [
         "New wave, glam rock"
      ],
      "Years active": [
         "1977–1992"
      ],
      "Labels": [
         "Parole, Teichiku, Orinoko, CDS Eire Fresh, Jungle Records"
      ],
      "Past members": [
         "Sean Purcell",
         "Faebhean Kwest",
         "Billy Surgeoner",
         "Tony Baggett",
         "Paddy Phield",
         "Kassy Andrews",
         "Terry Noakes",
         "Robert Barker",
         "S. Paul Wilson",
         "David Kovacevic"
      ]
   }
}