{
   "Name": "Red Alert (band)",
   "Sections": [
      "1 Band history",
      "2 Discography",
      "2.1 Singles and EPs",
      "2.2 Albums",
      "2.3 Compilation albums",
      "2.4 Compilation appearances",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "\n",
         "\nRed Alert were аn English punk/oi!-band, formed in Sunderland, England, in May 1979.[1] The quartet recorded three studio albums and appeared on numerous compilations, including Punk And Disorderly (Abstract Records, 1981) and Carry On Oi! (Secret Records, 1981). Three of the band's releases reached UK Indie Charts Top 30.[2] Red Alert broke up in 1985, reformed four years later and continued touring and occasionally recording.\n"
      ]
   },
   "Band history": {
      "text": [
         "Red Alert's original line-up — Steve 'Cast Iron' Smith (vocals), Tony Van Frater (guitar), Gaz Stuart (bass) and Dona (drums) — debuted in the summer of 1979, at a carnival in Sunderland, performing mostly Clash and UK Subs covers.[3]\n",
         "Their first demo became their debut release: a self-financed four track EP Third And Final, only 250 copies of which were pressed and then sold at gigs. With the new drummer Mitch the band produced its second demo In Britain and recorded two tracks for the Carry On Oi! compilation, only one of which -\"SPG\"- was included. Gary Bushell suggested that the band should send their material to No Future Records which they did and were signed a week later.[3]\n",
         "In the course of two years Red Alert released two 7-inch EPs (In Britain, Take No Prisoners), their debut LP We've Got The Power, a single (\"City Invasion\") and a 6 track 12-inch EP(There's A Guitar Burning). Another EP, Guitar Burning followed and another drummer came in: Matty Forster. This change bore little fruit: disillusioned and weary, the band called it quits. For some time Tony and Matty toured with Red London.\n",
         "In 1989, all four original members of Red Alert started meeting again, at a new Kazbah club, opened in Sunderland. In early 1990 the reformed band did a gig with Red London and Attila the Stockbroker and, inspired by their warm reception, decided to go on — with the exception of Gaz, who was replaced by Tom Spencer.\n",
         "After touring Western Europe alongside Red London, the quartet (with Gaz Stoker of Red London, as a new bassist) recorded their second LP Blood, Sweat 'N' Beers, released on Nightmare Records in Germany. The Beyond The Cut EP (Nightmare/Knockout) followed.\n",
         "With new drummer John Forster (Matty's brother) and later Lainey of Leatherface the band toured the United States and released the Super Yobs album, a split with The Templars. On return they released the \"Street Survivors\"/\"Drinkin' With Red Alert\" double 7-inch EP set.\n",
         "In August 1994, new drummer Ian joined. With him in 1995-96 the band recorded Breakin' All The Rules CD for Dojo Records. Shortly after the release Lainey returned, this time as bassist. This line-up recorded Wearside, released by PlasticHead Records to coincide with the 1999 Red Alert - The Rarities compilation (20 previously unreleased tracks) on Captain Oi! Records.[3]\n",
         "Tony Van Frater died on 29 October 2015.[4]\n",
         "The band's current lineup includes:\n"
      ]
   },
   "Discography": {
      "Singles and EPs": {},
      "Albums": {},
      "Compilation albums": {},
      "Compilation appearances": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "\nRed Alert were аn English punk/oi!-band, formed in Sunderland, England, in May 1979.[1] The quartet recorded three studio albums and appeared on numerous compilations, including Punk And Disorderly (Abstract Records, 1981) and Carry On Oi! (Secret Records, 1981). Three of the band's releases reached UK Indie Charts Top 30.[2] Red Alert broke up in 1985, reformed four years later and continued touring and occasionally recording.\n",
      "Red Alert's original line-up — Steve 'Cast Iron' Smith (vocals), Tony Van Frater (guitar), Gaz Stuart (bass) and Dona (drums) — debuted in the summer of 1979, at a carnival in Sunderland, performing mostly Clash and UK Subs covers.[3]\n",
      "Their first demo became their debut release: a self-financed four track EP Third And Final, only 250 copies of which were pressed and then sold at gigs. With the new drummer Mitch the band produced its second demo In Britain and recorded two tracks for the Carry On Oi! compilation, only one of which -\"SPG\"- was included. Gary Bushell suggested that the band should send their material to No Future Records which they did and were signed a week later.[3]\n",
      "In the course of two years Red Alert released two 7-inch EPs (In Britain, Take No Prisoners), their debut LP We've Got The Power, a single (\"City Invasion\") and a 6 track 12-inch EP(There's A Guitar Burning). Another EP, Guitar Burning followed and another drummer came in: Matty Forster. This change bore little fruit: disillusioned and weary, the band called it quits. For some time Tony and Matty toured with Red London.\n"
   ]
}