{
   "Name": "The Coup",
   "Sections": [
      "1 History",
      "1.1 First decade",
      "1.2 Party Music and post-9/11 aftermath",
      "1.3 Mid-2000s",
      "1.4 2010-2020",
      "2 Band members",
      "2.1 Boots Riley",
      "2.2 Silk-E",
      "2.3 Hassan Hurd",
      "2.4 JJ Jungle",
      "2.5 Grego Simmons",
      "2.6 B'nai Rebelfront",
      "2.7 Pam the Funkstress",
      "2.8 E-roc",
      "2.9 Lionel \"LJ\" Holoman",
      "2.10 DJO",
      "3 Cultural impact",
      "3.1 Literature",
      "3.2 Music",
      "3.3 Film",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Extended plays",
      "5 Music videos",
      "5.1 From Kill My Landlord",
      "5.2 From Genocide And Juice",
      "5.3 From Steal This Album",
      "5.4 From Party Music",
      "5.5 From Pick A Bigger Weapon",
      "5.6 From Sorry To Bother You",
      "6 Song uses in media",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "The Coup is an American hip hop band from Oakland, California. Their music is an amalgamation of influences, including funk, punk, hip hop, and soul. Frontman Boots Riley's revolutionarily-charged lyrics rank The Coup as a renowned political hip hop band aligned to radical music groups such as Crass, Dead Prez and Rage Against the Machine.\n",
         "The Coup's music is driven by assertive and danceable bass-driven backbeats overlaid by critical, hopeful, and witty lyrics, often with a bent towards the literary. The Coup's songs critique, observe, and lampoon capitalism, American politics, white patriarchal exploitation, police brutality, marijuana addiction, romance, and disparities among races and social classes.\n"
      ]
   },
   "History": {
      "First decade": {
         "text": [
            "The Coup's debut album was 1991s The EP and almost all of the songs on it (except \"Economics 101\") were put on 1993's Kill My Landlord.  In 1994, the group released its second album, Genocide & Juice. The group took a four-year recording hiatus to work as community activists before releasing Steal This Album to critical acclaim in 1998. The record's title pays tribute to 1960s radical Abbie Hoffman's yippie manifesto, Steal this Book. Steal This Album featured the stand-out single, \"Me and Jesus the Pimp in a ’79 Granada Last Night.\" The online magazine Dusted called Steal This Album \"the best hip-hop album of the 1990s\".[1]\n"
         ]
      },
      "Party Music and post-9/11 aftermath": {
         "text": [
            "In 2001, The Coup released Party Music to widespread praise. However, in part because of distribution problems, sales of the album were low. The original album cover art depicted group members Pam the Funkstress and Riley standing in front of the twin towers of the World Trade Center as they are destroyed by huge explosions, and Riley is pushing the button on a guitar tuner. The cover art was finished in June 2001 and the album was scheduled to be released in mid-September.[2] However, in response to the uncanny similarity of the artwork with the September 11, 2001, attacks, the album release was delayed until November of that year with the cover featuring a hand with a flaming martini glass.\n",
            "The attention generated concerning the album's cover art precipitated some criticism of the group's lyrical content as well, particularly the Party Music track \"5 Million Ways to Kill a CEO.\" The song's lyrics includes lines such as \"You could throw a twenty in a vat of hot oil/When he jump in after it, watch him boil.\" Conservative columnist Michelle Malkin cited the song in calling the Coup's work a \"stomach-turning example of anti-Americanism disguised as highbrow intellectual expression.\"[3]\n"
         ]
      },
      "Mid-2000s": {
         "text": [
            "On November 15, 2005, Tarus Jackson (AKA Terrance), who had joined the group as a promoter, was fatally shot during a robbery at his home in Oakland.[4]\n",
            "December 2, 2006 saw another tragedy for the Coup: About two hours following a performance at the San Diego House of Blues, the tour bus in which the group was riding drove off the road and flipped over before becoming engulfed in flames.[5] All passengers managed to climb out alive, although some were badly injured. The group did, however, lose all of its clothes, computers, cash, identification, house/car keys, cell phones, all of its instruments, and sound equipment.  The ensuing insurance payment was delayed in its arrival, and the group was forced to cancel the rest of its tour.\n",
            "The group’s songs \"My Favorite Mutiny\" and \"Pork & Beef\" were featured in the 2007 film, Superbad, with the former also being featured in the HBO miniseries 24/7 Flyers-Rangers, as well as in the video game NBA Live 07, while \"Ride the Fence\" was featured in EA's 2007 skateboarding video game Skate. The song “Captain Sterling’s Little Problem” accompanied the closing credits of Sir, No, Sir, a documentary about the GI anti-war movement.[citation needed]\n"
         ]
      },
      "2010-2020": {
         "text": [
            "On Wednesday January 13, 2010, The Coup’s bassist Dewey Tucker was shot and killed on the I-80 freeway in Hercules, CA, while driving from his home in Vallejo, CA, to rehearsal with The Coup in Oakland, CA. It was later found to be a case of mistaken identity.[6][7]\n",
            "The Coup's sixth album, a concept album entitled Sorry to Bother You, was released on October 30, 2012, to wide acclaim.[8] The first track, \"The Magic Clap\", was leaked by the band themselves and posted below an article on August 13, 2012.[9]\n",
            "The album Sorry to Bother You was inspired by a screenplay written by Riley, \"a dark comedy with magical realism\" that drew inspiration from his time spent working as a telemarketer.[10] The film's screenplay was published by McSweeney's in 2014.[11] Riley was able to secure funding to turn the script into the film Sorry to Bother You, which was released in theaters by Annapurna Pictures on July 6, 2018. The film, which follows a young African-American telemarketer who adopts a white accent in order to thrive at his job, stars Lakeith Stanfield, with Armie Hammer, Tessa Thompson, Terry Crews, and Danny Glover in supporting roles.[12] Having taken six years after their last album, The Coup recorded a full soundtrack to the film, entitled The Soundtrack to Sorry to Bother You, and released the first single, \"OYAHYTT (feat. Lakeith Stanfield)\", on July 13, 2018.\n",
            "In June 2018, The Coup released “Sorry To Bother You: The Soundtrack” on Interscope Records. It was a whole new album of Coup songs that appeared in the film of the same name. Guest artists included Janelle Monae, Killer Mike, and E40. Songs from the 2012 album were not in the actual film. Vinyl for the album was released in February 2020.\n"
         ]
      }
   },
   "Band members": {
      "Boots Riley": {
         "text": [
            "—Boots Riley\n",
            "Among other things, Boots Riley is known for charismatic, and seemingly inexhaustibly energetic, punk-like stage presence.[13]\n",
            "In 1991, he and other artists founded the Mau Mau Rhythm Collective, a group set up to use the power of hip hop music to publicize other efforts and movements. The next year, Riley founded The Coup.\n",
            "In July 2002, Riley was a guest on Bill Maher's Politically Incorrect and repeatedly referred to himself as a communist. Maher criticized him by saying that communists don't sell records.[14]\n",
            "Riley was charged with abusive language for allegedly using profanity on stage while performing with the band Galactic in Downtown Norfolk, Virginia, in the city's annual Bayou Boogaloo Festival at Town Point Park in June 2008. This was a result of controversy that started a few weeks prior in the same park when, at a different festival, singer Ray-J used language some found offensive. Riley's charge only carried a small fine. However, the American Civil Liberties Union decided to help him fight it on free speech grounds before the charge was ultimately dismissed by the city shortly thereafter.[15]\n",
            "During Tom Morello's Fall 2008 tour as the Nightwatchman, Riley appeared on selected dates, and the two debuted a song from an upcoming project called Street Sweeper Social Club. In March 2009, a Web site appeared at the url streetsweepermusic.com, which debuted its first single \"Fight! Smash! Win!\" It was also announced that the band would be the opening act on the upcoming tour[16] with Nine Inch Nails and Jane's Addiction.\n",
            "Boots Riley is also an active political/social organizer and speaker. He has been known to work with eviltwinbooking.org and speakoutnow.org, among other groups.\n"
         ]
      },
      "Silk-E": {
         "text": [
            "Silk-E is a vocalist with The Coup, performing in-studio and on stage. She joined The Coup in 2003, during promotion of the Party Music album. Known for her wild, engaging performance antics, energetic dancing, and her soulful, gravelly voice.[17][18][19] Pitchfork said she \"sings and struts like Tina Turner raised on hip-hop.[20]\nPart of her prowess is due to the fact that she started her career as a rapper. She has a solo album in which she is mainly rapping, entitled Urban Therapy.[21]\n",
            "There was a single and video from the album, \"Hard Times\", which received some MTV airtime.[22]\n"
         ]
      },
      "Hassan Hurd": {
         "text": [
            "Hassan Hurd is the drummer for The Coup. Hassan grew up in the church and was first known as a gospel drummer. He is known for the unshakable lock on his groove, explosive power and velocity, and crazy chops. At one point, he quit The Coup for a couple of years to pursue college football.[17][18][23]\n"
         ]
      },
      "JJ Jungle": {
         "text": [
            "JJ Jungle is the bassist for The Coup. He joined the group after bassist Dewey Tucker died. JJ Jungle is known for his energy, his never-failing lock into pocket, and his on stage acrobatics. JJ Jungle also has a band with Mike Dillon called Mike Dillon's Go-Go Jungle.\n"
         ]
      },
      "Grego Simmons": {
         "text": [
            "Grego Simmons plays guitar for The Coup. He also plays with Goapele and Ursus Minor.[citation needed]\n"
         ]
      },
      "B'nai Rebelfront": {
         "text": [
            "B'nai Rebelfront plays guitar for The Coup. In the past, B'nai has played for R&B singer Tweet, and Tony! Toni! Toné![citation needed]\n"
         ]
      },
      "Pam the Funkstress": {
         "text": [
            "Pam the Funkstress (born Pam Warren), DJ for The Coup, was a student of the late DJ Prince of Charm. In addition to DJing, she owned and operated a successful catering business in Northern California. Pam did not usually tour with The Coup. On December 22, 2017, Pam died at age 51, due to complications following organ transplant surgery.[24][25]\n"
         ]
      },
      "E-roc": {
         "text": [
            "Eric Davis, known as E-roc, was part of The Coup as a rapper for the first 2 albums and then left the group in 1997 to become a longshoreman with the International Longshore and Warehouse Union.[citation needed]\n"
         ]
      },
      "Lionel \"LJ\" Holoman": {
         "text": [
            "Lionel \"LJ\" Holoman is a keyboardist for The Coup. In the past, Holoman worked with 50 Cent, B-Legit, Joss Stone and many other well known artist.[citation needed]\n"
         ]
      },
      "DJO": {
         "text": [
            "DJO was part of The Coup as the original DJ before being replaced by Pam the Funkstress. He appeared in The Coup's first EP in 1991 and contributed to a handful of songs from “Kill My Landlord” before departing from the group.\n"
         ]
      }
   },
   "Cultural impact": {
      "Literature": {},
      "Music": {},
      "Film": {
         "text": [
            "The 1997 film Money Talks starring Chris Tucker, has exactly the same opening scene as the opening scene of The Coup's 1993 video for \"Not Yet Free\". In both, the protagonist is riding around in an expensive looking Mercedes-Benz, pulls up to the car wash to park and gets out. In both, it is at this time that we figure out that the protagonist merely works at the car wash. In both, the protagonist holds the keys out in front of the actual owner and feigns as if he's going to hit the owner.[34][35]\n"
         ]
      }
   },
   "Discography": {
      "Studio albums": {},
      "Extended plays": {}
   },
   "Music videos": {
      "From Kill My Landlord": {},
      "From Genocide And Juice": {},
      "From Steal This Album": {},
      "From Party Music": {},
      "From Pick A Bigger Weapon": {},
      "From Sorry To Bother You": {}
   },
   "Song uses in media": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Coup is an American hip hop band from Oakland, California. Their music is an amalgamation of influences, including funk, punk, hip hop, and soul. Frontman Boots Riley's revolutionarily-charged lyrics rank The Coup as a renowned political hip hop band aligned to radical music groups such as Crass, Dead Prez and Rage Against the Machine.\n",
      "The Coup's music is driven by assertive and danceable bass-driven backbeats overlaid by critical, hopeful, and witty lyrics, often with a bent towards the literary. The Coup's songs critique, observe, and lampoon capitalism, American politics, white patriarchal exploitation, police brutality, marijuana addiction, romance, and disparities among races and social classes.\n",
      "The Coup's debut album was 1991s The EP and almost all of the songs on it (except \"Economics 101\") were put on 1993's Kill My Landlord.  In 1994, the group released its second album, Genocide & Juice. The group took a four-year recording hiatus to work as community activists before releasing Steal This Album to critical acclaim in 1998. The record's title pays tribute to 1960s radical Abbie Hoffman's yippie manifesto, Steal this Book. Steal This Album featured the stand-out single, \"Me and Jesus the Pimp in a ’79 Granada Last Night.\" The online magazine Dusted called Steal This Album \"the best hip-hop album of the 1990s\".[1]\n",
      "In 2001, The Coup released Party Music to widespread praise. However, in part because of distribution problems, sales of the album were low. The original album cover art depicted group members Pam the Funkstress and Riley standing in front of the twin towers of the World Trade Center as they are destroyed by huge explosions, and Riley is pushing the button on a guitar tuner. The cover art was finished in June 2001 and the album was scheduled to be released in mid-September.[2] However, in response to the uncanny similarity of the artwork with the September 11, 2001, attacks, the album release was delayed until November of that year with the cover featuring a hand with a flaming martini glass.\n"
   ],
   "infobox": {
      "Origin": [
         "Oakland, California, United States"
      ],
      "Genres": [
         "Hip hop"
      ],
      "Years active": [
         "1991–Present"
      ],
      "Labels": [
         "Wild Pitch, EMI, Dogday, 75 Ark, Tommy Boy, Warner Bros., Epitaph, ANTI-"
      ],
      "Associated acts": [
         "Street Sweeper Social Club, Dead Prez, Talib Kweli, E-40, Black Thought, Spice-1, Rage Against the Machine, Anti-Flag, Star Fucking Hipsters, Les Claypool, Galactic, Del the Funky Homosapien, Das Racist, Latoya London, Atari Teenage Riot, Killer Mike, Jolie Holland, Joe Henry, Japanther, Vernon Reid"
      ],
      "Members": [
         "Boots Riley",
         "Silk-E",
         "B'nai Rebelfront",
         "Hassan Hurd",
         "J.J. Jungle",
         "L.J. Holoman"
      ],
      "Past members": [
         "E-Roc",
         "T-K.A.S.H.",
         "Latoya London",
         "Grego Simmons",
         "Pam the Funkstress (deceased)",
         "DJO"
      ]
   }
}