{
   "Discography": {
      "Albums": {},
      "Compilation appearances": {},
      "Singles and EPs": {}
   },
   "External links": {},
   "Further reading": {},
   "History": {
      "text": [
         "Red Monkey was formed by Rachel Holborow, Pete Dale and Marc Walker in 1996,[4] following on from Rachel and Pete’s earlier bands, the riot grrrl four-piece Pussycat Trash,[5][6][7] and lo-fi duo Avocado Baby.[8] Both acts had released records on the duo’s own record label Slampt, based in their adopted home town of Newcastle. Marc had previously drummed for Newcastle-based Post Hardcore/Rock bands Spinach and Kodiak.[9]\n",
         "Red Monkey’s first release was the \"Do What You Feel\"[10] EP on Slampt, followed by \"The Time Is Right\"[11] EP on US label Troubleman Unlimited and then their debut album Make The Moment. Allmusic praised the album for its \"melodic appeal\" and the band’s \"ability to make entirely political lyrics work in a personal, intelligent manner\",[12] while the group’s sound was compared to Gang of Four.\n",
         "In 1998, the band toured the US to support the stateside release of the album, and a third single followed on Kill Rock Stars records,[13] including two tracks performed on the band’s Peel Session earlier the same year.[14] Tours of Ireland and Europe followed before the band recorded their second album Difficult Is Easy, released in 1999. The record received more mixed reviews than the first; it was praised by the NME[15] but Popmatters criticised the album for failing to capture the live energy of the band,[16] albeit while making favourable comparisons to both Minutemen and Fugazi, the latter of whom Red Monkey supported on their American tours.\n",
         "Third and final album Gunpowder, Treason and Plot[17] was released in 2001 on Troubleman Unlimited, after Slampt records was wound down the previous year. Joe Mask (of Leeds group Bilge Pump) joined the band on second guitar. The album was praised as a return to form and noted for the use of non-standard time signatures, as well as horns, which brought comparisons to The Ex.[18]\n",
         "From 2001, the band was less active as members focused increasingly on their families and careers. A final split single with Erase Errata was released in 2003 and the band played their last shows in 2005.[1] Dale started work as a music teacher, and later as a lecturer at Oxford Brookes University,[19] while continuing to play in long term side project Milky Wimpshake[20] and also, immediately following Red Monkey, in a band called Chronicity. Marc Walker and Rachel Holborow went on to play in The Guise and Do The Right Thing, respectively.[1]\n",
         "Red Monkey reformed for a night to play a Slampt Records retrospective event in Newcastle in 2008, alongside a new generation of post riot-grrrl bands which they and their label helped influence.[6] They continue to be invoked as a touchstone for bands up to the present day.[21][22][23] In 2014, Berlin-based label Our Voltage released a Red Monkey singles and rarities compilation, calling it \"posthumous post-punk.. by one of England’s finest Post-RiotGrrrl-Outfits\".[24]\n"
      ]
   },
   "Reception": {
      "text": [
         "The band have been notated for their overt left-leaning political lyrics. Allmusic acclaimed the political agenda of the group, describing it as \"down with materialist culture, up with self-actualization\".[2] Chris Nelson, writing for MTV in 1998, noted the group's lyrics and \"jagged\" sound. He added that the three members had \"... distinct voices moving forward as one.\"[3]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Reception",
      "3 Discography",
      "3.1 Singles and EPs",
      "3.2 Albums",
      "3.3 Compilation appearances",
      "4 References",
      "5 Further reading",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Red Monkey were an English DIY post-hardcore, post-riot grrrl band, active from 1996 to 2005.[1] The band are notable for their political lyrics.[2][3]\n"
      ]
   },
   "Title": "Red Monkey (band) - Wikipedia"
}