{
   "Name": "Snuff (band)",
   "Sections": [
      "1 History",
      "2 Bubble and Squeak",
      "3 Don't Wake Up The Kids",
      "4 2011 to present",
      "5 Timeline",
      "6 Discography",
      "6.1 Studio albums",
      "6.2 Extended plays",
      "6.3 Compilation albums",
      "6.4 Live albums",
      "6.5 Singles",
      "6.6 Videos",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "For the country rock band active in the early 1980s, see Snuff (country rock band)\n",
         "\n",
         "\n",
         "Snuff are a British punk rock band formed in Hendon in 1986.[1]  The original line-up was Duncan Redmonds on drums and vocals, Simon Wells on guitar and vocals and Andy Crighton on bass, with Dave Redmonds being added to the line-up on trombone before the release of Flibbiddydibbiddydob.\n",
         "Snuff have released their material through a variety of independent record labels including their own, 10past12records, as well as on Fat Wreck Chords a label owned by Fat Mike of NOFX.\n"
      ]
   },
   "History": {
      "text": [
         "The band signed to the Workers Playtime label and their first release was the Not Listening Anymore EP, which received regular airplay from BBC Radio 1 disc jockey John Peel, and reached number nine in the UK Independent Chart.[2] Their first album was named Snuff Said, but the full album name was Snuffsaidbutgorblimeyguvstonemeifhedidn'tthrowawobblerchachachachachachachachachachachayou'regoinghomeinacosmicambience, which started their habit of playing on their supposed Cockney roots. The album peaked at number three on the UK Indie Chart.[2]\n",
         "Following up from their first album was the 'mini-album' Flibbiddydibbiddydob, featuring mainly cover versions and TV commercial jingles reworked by the band. The release was the subject of a disagreement with the British Phonographic Industry (BPI); Snuff maintained it was an EP, and as such should be eligible for the UK Singles Chart, but the BPI insisted on classifying it as an album because of the large number of tracks.\n",
         "In 1991, Snuff split up.[1] During this period all three members applied to be the bassist for Leatherface. The break-up also spawned Guns n' Wankers and Your Mum in 93-94 and who's line up included simon wells, Loz Wong, Rory Blaney, Paul McMahon and Tony Poole.\n",
         "Following a reformation of the original line-up in 1994, along with permanent Hammond and trombone, Simon Wells left the band and was replaced by Loz Wong who had played in Guns n' Wankers with Simon. A while later Andy Crighton was replaced by Lee Erinmez (née Batsford) on bass. They released a Christmas single, the theme to \"Whatever Happened to the Likely Lads?\".[1] Steve Lamacq has also featured Snuff on his radio show. Simon Wells has since formed the band, Southport, and has played occasionally with Duncan under the name Footballer's Wives.\n",
         "In 2005, Snuff released a greatest hits double album. Also in 2005, Duncan Redmonds released a self-titled solo project CD Billy No Mates, and at live shows his solo material is combined with some Snuff and Guns n' Wankers songs. Billy No Mates have two touring bands, one in Japan and one in the UK, and Redmonds has recorded different EP's with each band.\n",
         "In 2006 a new band called Pot Kettle Black formed. This featured Redmonds on drums, Wells on guitar, and Wes Wasley completing the trio on bass. The line-up played a mixture of old Snuff songs (generally up until Demmamussabebonk), and new material in the same vein. The project was pronounced 'dead' by Redmonds on the 10 Past 12 Records website guestbook in August 2007. Since then, Redmonds has played a series of gigs in Japan with Duncan's Divas, and embarked on solo acoustic gigs in the UK.\n",
         "In 2008, a brief tour of Japan was announced, featuring gigs in Tokyo.[3] Following this, the band continued to gig in 2009, supporting NOFX in Birmingham and London on their UK tour, and played both the Reading and Leeds Festivals.\n"
      ]
   },
   "Bubble and Squeak": {
      "text": [
         "In 2009, Duncan Redmonds released Bubble and Squeak.[4] The album featured collaborations with numerous members of bands on similar labels or tours, including Fat Mike from NOFX, Frankie Stubbs from Leatherface and Ken Yokoyama from the Japanese punk band Hi-Standard, as well as former and current members of Snuff, Billy No Mates and Pot Kettle Black. Notably, the album also included a new track recorded by Guns N Wankers, the first since bassist Jools Parkin suffered a brain haemorrhage.\n"
      ]
   },
   "Don't Wake Up The Kids": {
      "text": [
         "In March 2010, an album titled Don't Wake Up The Kids, which featured acoustic tracks recorded by Duncan Redmonds, Joey Cape of Lagwagon and Ken Yokoyama of Hi-Standard was released on Inyaface Records. To coincide with the release of the album, Duncan Redmonds and Joey Cape toured  Japan, playing a series of acoustic shows.[5]\n"
      ]
   },
   "2011 to present": {
      "text": [
         "The band undertook another short tour of Japan in 2011, as well as the recording and release of a tour EP, entitled 5-4-3-2-1 Ding-a-Ling Yahon, which consisted of new songs and Japanese covers.\n",
         "In spring 2012, the band took to the road for a 10-date UK tour, with Oliver Stewart taking over trombone duties from Dave Redmonds. Shows included The Borderline, London and Trillians, Newcastle.[6] Snuff also appeared at the 2012 Rebellion festival, in Blackpool, alongside bands such as Rancid and SNFU, as well as being lead support for the summer 2012 NOFX UK tour.\n",
         "In 2012, Snuff recorded their first full-length album since 2003's Disposable Income. The album titled 5-4-3-2-1 Perhaps? contains 12 new tracks and was released on 8 January 2013. The vinyl was released in black vinyl, limited edition purple vinyl with green haze (407 copies) and even more limited green vinyl with Fat Record Store labels (100 copies). The album also came as a CD version along with a Japanese issue with exclusive artwork.\n",
         "In August 2015, Snuff completed a full UK tour supporting Bad Religion. In February 2016, they celebrated '30 Years of Snuff' with a full UK tour.\n",
         "In September 2019 Snuff released a new album - There's A Lot of It About on Fat Wreck Chords, which was recorded in 2018. Lee Erinmez left the band shortly after the recording and was replaced by Dan Goatham. In May 2020 Snuff released a new EP - The Wrath Of Thoth.\n"
      ]
   },
   "Timeline": {},
   "Discography": {
      "Studio albums": {},
      "Extended plays": {},
      "Compilation albums": {},
      "Live albums": {},
      "Singles": {},
      "Videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "For the country rock band active in the early 1980s, see Snuff (country rock band)\n",
      "Snuff are a British punk rock band formed in Hendon in 1986.[1]  The original line-up was Duncan Redmonds on drums and vocals, Simon Wells on guitar and vocals and Andy Crighton on bass, with Dave Redmonds being added to the line-up on trombone before the release of Flibbiddydibbiddydob.\n",
      "Snuff have released their material through a variety of independent record labels including their own, 10past12records, as well as on Fat Wreck Chords a label owned by Fat Mike of NOFX.\n",
      "The band signed to the Workers Playtime label and their first release was the Not Listening Anymore EP, which received regular airplay from BBC Radio 1 disc jockey John Peel, and reached number nine in the UK Independent Chart.[2] Their first album was named Snuff Said, but the full album name was Snuffsaidbutgorblimeyguvstonemeifhedidn'tthrowawobblerchachachachachachachachachachachayou'regoinghomeinacosmicambience, which started their habit of playing on their supposed Cockney roots. The album peaked at number three on the UK Indie Chart.[2]\n"
   ]
}