{
   "History": {
      "text": [
         "Young and Barnes met at Cathays High School in Cardiff, and started writing and playing songs together.  They performed together from 1971 in the band John Stabber, and formed Do You Want This Table (later shortened to The Table) in 1972.  The band was named after an overheard random comment by a stranger, and originally intended being a studio-only recording group.[2]\n",
         "Although they performed at the Windsor Free Festival in 1974,[3] publicity material at the time stated that they did not own any musical instruments, refused to tour, and said that they were not a \"real\" band and had no future in the music industry.  Despite this, they were signed to Virgin Records in a one-off deal, and released \"Do The Standing Still (Classics Illustrated)\", first recorded as a demo in 1975.[1]  The single was an NME 'Single Of The Week',[3] rapidly becoming a cult favourite.[1]  The lyrics were a collection of lines from comic books,[3][2] and \"people used to rush the dance floor and stand still for the duration of the song when it came on in clubs.\"[4]\n",
         "\nAccording to Barnes: ",
         "We [were].. not Punks, not hippies, just too arty-probably-for-our-own-good writers primarily. And certainly not disco either. ...When the single came out to good reception [we] got offers for a few gigs and tours. Trouble was the sheer cost of paying for the PA equipment and crew and all that.   We were offered tours but Virgin wouldn't back us which we felt aggrieved by as it would've promoted our material on their label, so we were kind of stuck in a Catch-22. There wasn't exactly pressure from Virgin to tour but they had signed the Sex Pistols and XTC so probably lost what little interest they had....  That's where the legend of us having no gear must have come about. Basically we had our instruments and attendant amps, but nothing else, so when we played we were in the hands of whoever was running the PA and who of course wouldn't know our songs. That said, we made a good fist of it despite essentially not being showbiz types. There were memorably good gigs with XTC and us swapping top spot and using their PA.  Others, not so good, with The Police heckling us! Getting management was a problem too, and as we didn't connect with anyone we deemed legitimate that became a hassle too.[3]",
         "Record label pressure saw the band become a well-received live act,[2] but their uncompromising stance led to disagreements with Virgin, and published interviews between music journalists and band members \"left readers wondering if they really wanted to support a band whose projected debut album threatened to feature the singer reading a shopping list.\"[1]  They left Virgin, but signed to Chiswick Records in 1978 and released a second single, \"Sex Cells\".   However, the song's references to \"a mad desire for sex with schoolgirls\" meant that it received little radio play.[3]\n",
         "The band continued but with a policy of playing increasingly uncommercial and distasteful material,[1] and several line-up changes – O'Connor was replaced by Tim Cox and later Tony Lowe; Lewis was replaced by Richard Rae and later Dave Regan; and in 1980 Barnes was replaced by Rod Fogg.[2]   Barnes later said: \"The Table gradually petered out due to being ignored, lack of interest or perceived commercial viability, just plain being crap or whatever. We were essentially ourselves, unique but sadly totally ignored.\"[3]\n",
         "Young's later band with Lowe and Regan, Flying Colours, released a single, \"Abstract Art\", on the No Records label in 1981.[2]\n",
         "\"Do the Standing Still\" has subsequently appeared on several punk compilation albums.[3][2] Cardiff band Boy Azooga recorded a cover version of \"Do The Standing Still\" in 2018.[5]\n"
      ]
   },
   "Summary": {
      "text": [
         "The Table were a punk rock band from Cardiff, Wales, best known for their 1977 single \"Do The Standing Still (Classics Illustrated)\". The band originally comprised Russell Young (vocals, guitar, keyboards, bass), Tony Barnes (guitars, bass), Len Lewis (drums) and Mickey O'Connor (guitars).[1][2]\n"
      ]
   }
}