{
   "Name": "Crimpshrine",
   "rawData": [
      "Crimpshrine was an American punk rock band from Berkeley, California. The group was formed in 1982 by Aaron Cometbus, founder of the seminal punk rock zine Cometbus, and future Operation Ivy vocalist Jesse Michaels. They grew out of the East Bay scene, centered on 924 Gilman Street, and had an important influence on later East Bay bands such as Operation Ivy, Green Day and punk rock in general.\n",
      "Crimpshrine originally formed in 1982 under the name S.A.G. with Aaron Cometbus playing guitar and Jesse Michaels (later of Operation Ivy) on vocals, both 13 years old. They quickly added friend Jeff Ott, then 12, on drums initially but switched to guitar soon after and Cometbus took over drums. Regarding Ott's guitar skills, Michaels described him as \"twenty times better than us\", as he initially tried to play guitar but \"didn't know any chords, so I played with my thumb.\" According to Elliot, the band had a \"serious lack of equipment\", as they had one drum and only 3 strings on the guitar. Michaels was kicked out of the band in 1984, which he said was for \"smoking too much pot\", and Ott and Cometbus changed the band's name to Crimpshrine. According to Ott, the name came from a nickname for a girl they knew who had \"bleached-blond, burned, crimped hair.\" The group initially wanted a female singer, but couldn't find one so Ott took over on vocals in late 1984 and they then went through various different line-ups during 1985. Ott began experimenting with playing synthesizer and piano, a man named Isaac joined on violin and Tim Armstrong (then known as Lint) played bass for a brief period. Pete Rypins joined as the group's bassist in October 1986 and, according to Cometbus, they \"started to get out of Jeff's basement and play some parties and shows.\"\n",
      "After Rypins joined, they played shows sporadically during its early years, with vocalist Ott living on the streets of Berkeley for a time. In February 1987, the group recorded their first demo tape, which received enough circulation that Maximumrocknroll asked the band to record songs for the magazine's upcoming compilation Turn It Around!, to which the band agreed and recorded \"Another Day\" and \"Rearranged\" in August. Shortly after, they went to Dangerous Rhythm in Oakland, California to record songs for their debut EP with producer/engineer Kevin Army. David Hayes, co-founder of Lookout Records, was impressed with the band and offered to release the tracks recorded at Dangerous Rhythm. The group agreed and their debut EP Sleep, What's That? was released in January 1988. Idon Bryant, a friend of the band's, joined on second guitar soon after and they went to Dancing Dog Studios in Emeryville, California to record their debut album in April. Although the recordings were turned down by Lookout, the band added tracks from previous sessions and released Lame Gig Contest in Germany on the label Musical Tragedies.\n"
   ],
   "infobox": {
      "Origin": [
         "Berkeley, California, United States"
      ],
      "Genres": [
         "Punk rock"
      ],
      "Years active": [
         "1982–1989"
      ],
      "Labels": [
         "Lookout"
      ],
      "Associated acts": [
         "Fifteen",
         "Pinhead Gunpowder",
         "Tilt",
         "Operation Ivy",
         "Monsula",
         "Screeching Weasel"
      ],
      "Past members": [
         "Aaron Cometbus",
         "Jeff Ott",
         "Jesse Michaels",
         "Pete Rypins",
         "Tim Armstrong",
         "Idon Bryant",
         "Paul Curran",
         "Harry Smith"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Berkeley, California. The group was formed in [YEAR] by Aaron Cometbus, founder of the seminal punk rock zine Cometbus, and future Operation Ivy vocalist [PERSON_NAME_FULL_0_MALE]. They grew out of the East Bay scene, centered on 924 Gilman Street, and had an important influence on later East Bay bands such as Operation Ivy, Green Day and punk rock in general.\n",
      "[BAND_NAME] originally formed in [YEAR] under the name S.A.G. with Aaron Cometbus playing guitar and [PERSON_NAME_FULL_2_MALE] (later of Operation Ivy) on vocals, both 13 years old. They quickly added friend [PERSON_NAME_FULL_0_MALE], then 12, on drums initially but switched to guitar soon after and Cometbus took over drums. Regarding [PERSON_NAME_LAST_0]'s guitar skills, [PERSON_NAME_LAST_2] described him as \"twenty times better than us\", as he initially tried to play guitar but \"didn't know any chords, so I played with my thumb.\" According to Elliot, the band had a \"serious lack of equipment\", as they had one drum and only 3 strings on the guitar. [PERSON_NAME_LAST_2] was kicked out of the band in [YEAR], which he said was for \"smoking too much pot\", and [PERSON_NAME_LAST_0] and Cometbus changed the band's name to [BAND_NAME]. According to [PERSON_NAME_LAST_0], the name came from a nickname for a girl they knew who had \"bleached-blond, burned, crimped hair.\" The group initially wanted a female singer, but couldn't find one so [PERSON_NAME_LAST_0] took over on vocals in late [YEAR] and they then went through various different line-ups during [YEAR]. [PERSON_NAME_LAST_0] began experimenting with playing synthesizer and piano, a man named Isaac joined on violin and Tim Armstrong (then known as Lint) played bass for a brief period. [PERSON_NAME_FULL_1_MALE] joined as the group's bassist in [MONTH] [YEAR] and, according to Cometbus, they \"started to get out of [PERSON_NAME_FIRST_0]'s basement and play some parties and shows.\"\n",
      "After Rypins joined, they played shows sporadically during its early years, with vocalist Ott living on the streets of Berkeley for a time. In [MONTH] [YEAR], the group recorded their first demo tape, which received enough circulation that Maximumrocknroll asked the band to record songs for the magazine's upcoming compilation Turn It Around!, to which the band agreed and recorded \"Another Day\" and \"Rearranged\" in [MONTH]. Shortly after, they went to Dangerous Rhythm in Oakland, California to record songs for their debut EP with producer/engineer [PERSON_NAME_FULL_0_MALE]. David Hayes, co-founder of Lookout Records, was impressed with the band and offered to release the tracks recorded at Dangerous Rhythm. The group agreed and their debut EP Sleep, What's That? was released in [MONTH] [YEAR]. Idon Bryant, a friend of the band's, joined on second guitar soon after and they went to Dancing Dog Studios in Emeryville, California to record their debut album in [MONTH]. Although the recordings were turned down by Lookout, the band added tracks from previous sessions and released [PERSON_NAME_FULL_1_MALE] in Germany on the label Musical Tragedies.\n"
   ]
}