{
   "Name": "Crematory (band)",
   "rawData": [
      "Crematory is a gothic metal band formed in Mannheim, Germany in 1991.\n",
      "The band received its earliest recognition in the mid-1990s by touring with My Dying Bride, Tiamat and Atrocity. Much like the latter two groups, the band had begun as traditional death metal, then evolved in an industrial music and gothic metal musical direction on later albums. The band received heavy rotation on MTV Germany, and made appearances at various extreme metal festivals, including Germany's Wacken Open Air in 1996, 1998, 1999, 2001 and 2008, in addition to inclusion on Nuclear Blast compilation samplers.\n",
      "The band re-signed to Massacre Records in 2006 after a 10-year stint with Nuclear Blast; Massacre had been the band's first label. In 2013 they signed with Steamhammer/SPV to release their next album, Antiserum. In 2019 they moved to Napalm Records, and their 15th studio album, Unbroken, will be released under their label, on 6 March 2020.\n"
   ],
   "infobox": {
      "Origin": [
         "Westhofen, Germany"
      ],
      "Genres": [
         "Gothic metal",
         "Melodic death metal",
         "Industrial metal",
         "Neue Deutsche Härte",
         "Death metal (early)"
      ],
      "Years active": [
         "1991–2001, 2003–present"
      ],
      "Labels": [
         "Massacre (1993–1996, 2006–2013)",
         "Nuclear Blast (1996–2006)",
         "Steamhammer/SPV (2013–2019)",
         "Napalm Records (2019–present)"
      ],
      "Associated acts": [
         "Mystic Circle"
      ],
      "Website": [
         "http://www.crematory.de"
      ],
      "Members": [
         "Gerhard \"Felix\" Stass",
         "Markus Jüllich",
         "Katrin Goger",
         "Rolf Munkes",
         "Jason Matthias",
         "Connie Andreszka"
      ],
      "Past members": [
         "Lothar \"Lotte\" Först",
         "Marc Zimmer",
         "Heinz Steinhauser",
         "Harald Heine",
         "Matthias Hechler",
         "Tosse Basler"
      ]
   },
   "albums": [
      "Crematory"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band formed in Mannheim, Germany in [YEAR].\n",
      "The band received its earliest recognition in the mid-[YEAR]s by touring with My Dying Bride, Tiamat and Atrocity. Much like the latter two groups, the band had begun as traditional death metal, then evolved in an [GENRE] band received heavy rotation on MTV Germany, and made appearances at various extreme metal festivals, including Germany's Wacken Open Air in [YEAR], [YEAR], [YEAR], [YEAR] and [YEAR], in addition to inclusion on Nuclear Blast compilation samplers.\n",
      "The band re-signed to Massacre Records in [YEAR] after a [GENRE] band's first label. In [YEAR] they signed with Steamhammer/SPV to release their next album, Antiserum. In [YEAR] they moved to Napalm Records, and their 15th studio album, Unbroken, will be released under their label, on 6 [MONTH] [YEAR].\n"
   ]
}