{
   "Accusations of racism about design of 2014 album We Want Mohr": {
      "text": [
         "Knorkator were planning to go on tour in spring 2014 to present their new album We Want Mohr, which was released on 2014-01-17.[2] The album name is a pun, replacing “more” by the German word “Mohr”, which is a dated term for black people that today is only used in a historical or literary context. The tour was advertised with a poster showing the five (white) band members in a big pot on a fire and a black person with bones in their hair and a knife in their hand next to it. This is a reenactment of a scene in the 19th-century child’s book Struwwelpeter.[3]  The poster caused outrage in some German anti-racist blogs, and the Initiative Schwarze Menschen in Deutschland, an organisation representing black people in Germany, published a statement calling the poster racist, unreflected and degrading.[4] Knorkator singer Gero Ivers published a response in which he claims to be shocked and disappointed by the statement and argues that the intention of the poster had been misunderstood and not seen in context.[5] Subsequently, the band stopped using the advertising poster but refused ISD's demand to change the album cover as they viewed the content of the reenacted scene as \"profoundly anti-racist\".[6]\n"
      ]
   },
   "Bibliography": {},
   "Discography": {
      "CD": {},
      "CD (Live)": {},
      "DVD": {},
      "Singles / EP": {}
   },
   "External links": {},
   "Live performances": {
      "text": [
         "Knorkator's wild stage shows and appearance are analogously chaotic: half of Stumpen's body is tattooed black, and he usually performs in his goofy underpants; Buzz Dee's appearance is often cited as being a clone of Big Jim Martin.\n",
         "Knorkator are (in)famous for their wild stage shows. Alf Ator has been known to hit the audience with a large  foam club, throw toast slices and wet autumn foliage at the crowd. Sometimes a modified shredder was used to distribute shredded vegetables and fruit over the crowd, which was announced as \"vegetarian airway-catering\". Their live performances are also well known for extensive acts of instrument destruction where especially keyboarder Alf Ator used to deconstruct one or more electronic organs that he had been playing on with a toilet brush or similar before. Singer Stumpen is known for the frequent smashing of TV sets on stage, from which he suffered a glass splinter getting stuck in his thigh that had to be removed by surgery some years later and was then auctioned on the internet. In earlier shows, a lot of furniture pieces were placed on the stage which were then destroyed during the show by Alf or Stumpen, mostly with an axe or a baseball bat. Stumpen is also known for wearing almost nothing on stage except for a woman's bathing suit or underpants.\n",
         "Crowd surfing is another important element of Knorkator's shows, not only performed by the musicians themselves, but also directing the crowd to perform exceptional exercises, such as racing duels between spectators over the hands of the crowd, piggyback moshing, women throwing competitions, instructing the crowd to separate and then run into each other (known as the Wall of Death), or lifting and surfing the heavily overweight sound engineer from the mixing desk to the stage and back.\n"
      ]
   },
   "Members": {
      "Former members": {},
      "Touring members": {}
   },
   "References": {},
   "Sections": [
      "1 Style",
      "2 Live performances",
      "3 Members",
      "3.1 Former members",
      "3.2 Touring members",
      "4 Discography",
      "4.1 CD",
      "4.2 CD (Live)",
      "4.3 DVD",
      "4.4 Singles / EP",
      "5 Accusations of racism about design of 2014 album We Want Mohr",
      "6 Bibliography",
      "7 External links",
      "8 References"
   ],
   "Style": {
      "text": [
         "Knorkator's music can be largely classified as industrial metal, somewhat akin to White Zombie and Ministry. Knorkator, however, strongly features a comedic element. Most songs escalate into falsetto vocals and bombastic, over-the-top anthemic choruses, with crushing guitars and subtle samplers. Due to the amusing message, however, the band's considerable technical and artistic merit is sometimes overlooked.\n",
         "Knorkator's lyrics are somewhat explicit, but always very humorous:\n",
         "Most of Knorkator's lyrics are in German; however, some songs also feature English (\"beating around the bush\", \"Ma Baker\", etc.), Thai (\"Mai khao djai\", \"Khid tyng baan\"), Latin (\"Aeger sum\"), or French (\"Ma belle fêmme\", \"Franz Hose\") lyrics. Their famous song \"Wir werden alle sterben\" (\"We're all going to die\") has also been translated into the Arabic language. \nThe songs in English are often extreme covers of previously well-known hit songs.\n",
         "The song \"Buchstabe\" is featured as a music video in the 3rd episode of Adult Swim's Off the Air (2011).\n"
      ]
   },
   "Summary": {
      "text": [
         "Knorkator is a German band from Berlin that combines heavy metal with comical elements. They proclaim themselves to be \"Germany's most band in the world\" (German: \"Deutschlands meiste Band der Welt\"), as the title \"The best band in the world\" was already taken by Die Ärzte. The name \"Knorkator\" is a personification of \"knorke\", a dated adjective used in Berlin and the Ruhr basin meaning \"great\" or \"fabulous\" (similar to the English slang word \"swell\"). The band was founded in 1994, but only played in the Berlin/Brandenburg area until 1998.\n",
         "Knorkator gained further fame (and some notoriety) in 2000 with their performance of Ick wer zun Schwein (sic; literally, in Berlin dialect, \"I'm turning into a pig\") in the German national qualification for the Eurovision Song Contest. After the qualification show, German tabloid BILD notoriously headlined \"Wer ließ diese Irren ins Fernsehen?\" (\"Who let these lunatics on TV?\").[1]\n",
         "Knorkator announced the end of the band in a MySpace bulletin on June 14, 2008, the last concert was played on December 5 that year in Berlin. The official reason given for the band's breakup was that Alf Ator wanted to leave Germany to start a new life in Thailand. In autumn 2010 a bulletin by Stumpen announced the bands' reunion. A first \"small\" tour followed in April 2011 as well as some concerts at well-known festivals like Wacken Open Air. The tour was called the \"77 minutes tour\", as the setlist was planned to be exactly 77 minutes long. A digital clock that counted down the minutes was placed on stage to make sure the time limit was not exceeded. Their new album \"Es werde Nicht\" (translates to \"Let there be Not\" or \"Let Not Be\", a pun on \"Es werde Licht\" - \"Let there be Light\") has been released in September 2011, followed by a big tour with concerts of regular length. \n"
      ]
   },
   "Title": "Knorkator - Wikipedia"
}