{
   "Name": "Terminal Choice",
   "rawData": [
      "Terminal Choice was a German industrial rock band. It was formed by singer Chris Pohl (also of Blutengel, Tumor, Pain of Progress and owner of the Fear Section label) in 1993.\n",
      "Their lyrics are sung in German and English. The sound was originally primarily electronic music, but with the 1998 album Navigator, guitars were added.\n",
      "Besides Pohl, the original lineup included Jens Gärtner, who provided the drums and loops. In 1997, Manuel Selling was added as a guitar player.  He left in 2000 and Gordon Mocznay took over on guitar and bass guitar. A year later in 2001, Louis Manke joined the band as well, adding a second guitar to the band. Despite being involved with numerous bands, all members are still creating music with Terminal Choice and an album entitled \"New Born Enemies\" was released in 2006. They have released a video for \"Don't Go\".\n"
   ],
   "infobox": {
      "Origin": [
         "Germany"
      ],
      "Genres": [
         "Electronic rock, industrial metal, industrial rock, gothic rock, EBM, Neue Deutsche Härte"
      ],
      "Years active": [
         "1993–2010"
      ],
      "Associated acts": [
         "Seelenkrank, Blutengel, Tumor, Pain of Progress, Miss Construction, Staubkind"
      ],
      "Website": [
         "Terminal Choice"
      ],
      "Members": [
         "Chris Pohl ",
         " Jens Gärtner ",
         " Gordon Mocznay ",
         " Louis Manke"
      ],
      "Past members": [
         "Manuel Selling ",
         "Sten Nitschke"
      ]
   },
   "albums": [
      "Terminal Choice",
      "Desiderius",
      "Facets of Pain",
      "Desiderius",
      "Degernerated Inclinations"
   ],
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band. It was formed by singer [PERSON_NAME_FULL_0_MALE] (also of Blutengel, Tumor, Pain of Progress and owner of the Fear Section label) in [YEAR].\n",
      "Their lyrics are sung in German and English. The sound was originally primarily electronic music, but with the [YEAR] album Navigator, guitars were added.\n",
      "Besides Pohl, the original lineup included [PERSON_NAME_FULL_0_MALE], who provided the drums and loops. In [YEAR], Manuel Selling was added as a guitar player.  He left in [YEAR] and [PERSON_NAME_FULL_1_MALE] took over on guitar and bass guitar. A year later in [YEAR], Louis Manke joined the band as well, adding a second guitar to the band. Despite being involved with numerous bands, all members are still creating music with [BAND_NAME] and an album entitled [SONG_NAME].\n"
   ]
}