{
   "Name": "A Place to Bury Strangers",
   "rawData": [
      "A Place to Bury Strangers are an American, New York City-based noise rock band, composed of Oliver Ackermann (guitar/vocals, bass), Dion Lunadon (bass guitar, guitar) and Lia Simone Braswell (drums). The band, commonly known by the initials APTBS, play a heavy, atmospheric Wall of Sound–influenced blend of psychedelic rock, shoegaze and space rock. A likely source of inspiration for the band's name is the 1898 Aleister Crowley poem \"Aceldama\", subtitled: \"A place to bury strangers in\".\n",
      "A Place to Bury Strangers were formed in 2002 by David Goffan and Tim Gregorio. Current frontman and guitarist Ackermann had moved to New York following the disbanding of his previous group, Skywave, to join APTBS, and become the primary songwriter after the departure of Goffan. They played their first show at Luxx in Brooklyn in 2003. Jason \"Jay Space\" Weilmeister and Jonathan \"Jono Mofo\" Smith, both from the New York City-based band Mofo, joined the band when Gregorio left. In 2006, APTBS self-released three different EPs, handmade with different color schemes: Breathe, Missing You and Never Going Down.\n",
      "In 2006, APTBS gained acclaim following their Webster Hall performance with the Brian Jonestown Massacre. The band returned to Webster Hall in 2007 to play with one of their major influences, the Jesus and Mary Chain. Throughout these formative years, the band's live shows became increasingly chaotic, which earned them the title of New York City's \"loudest band\" from various indie reviewers and bloggers, as well as \"the most ear-shatteringly loud garage/shoegaze band you'll ever hear\" by The Washington Post. The New York Times applauded their revival of \"the ominous, feedback-drenched drones of the 1980s\".\n"
   ],
   "infobox": {
      "Origin": [
         "Brooklyn, New York, United States"
      ],
      "Genres": [
         "Noise rock",
         "post-punk revival",
         "shoegaze",
         "experimental rock",
         "psychedelic rock",
         "space rock"
      ],
      "Years active": [
         "2003–present"
      ],
      "Labels": [
         "Killer Pimp",
         "Rocket Girl",
         "Mute Records",
         "Dead Oceans"
      ],
      "Associated acts": [
         "Skywave",
         "MOFO",
         "My Best Fiend",
         "the D4",
         "Black Acid",
         "Ceremony"
      ],
      "Website": [
         "aplacetoburystrangers.bandcamp.com"
      ],
      "Members": [
         "Oliver Ackermann"
      ],
      "Past members": [
         "David Goffan",
         "Tim Gregorio",
         "Jonathan \"Jono Mofo\" Smith",
         "Jason \"Jay Space\" Weilmeister",
         "Justin Avery",
         "Robi Gonzalez",
         "John Fedowitz ",
         "Dion Lunadon",
         "Lia Simone Braswell"
      ]
   }
}