{
   "Name": "A Place to Bury Strangers",
   "Sections": [
      "1 History",
      "1.1 Early days",
      "1.2 First album and touring",
      "1.3 Exploding Head",
      "1.4 Worship",
      "1.5 Strange Moon and Transfixiation",
      "1.6 Pinned",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 EPs",
      "2.3 Compilations",
      "2.4 Singles",
      "2.5 Live albums",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "A Place to Bury Strangers are an American, New York City-based noise rock band, composed of Oliver Ackermann (guitar/vocals, bass), Dion Lunadon (bass guitar, guitar) and Lia Simone Braswell (drums). The band, commonly known by the initials APTBS, play a heavy, atmospheric Wall of Sound–influenced blend of psychedelic rock, shoegaze and space rock. A likely source of inspiration for the band's name is the 1898 Aleister Crowley poem \"Aceldama\", subtitled: \"A place to bury strangers in\".\n"
      ]
   },
   "History": {
      "Early days": {
         "text": [
            "A Place to Bury Strangers were formed in 2002 by David Goffan and Tim Gregorio. Current frontman and guitarist Ackermann had moved to New York following the disbanding of his previous group, Skywave, to join APTBS, and become the primary songwriter after the departure of Goffan. They played their first show at Luxx in Brooklyn in 2003. Jason \"Jay Space\" Weilmeister and Jonathan \"Jono Mofo\" Smith, both from the New York City-based band Mofo, joined the band when Gregorio left. In 2006, APTBS self-released three different EPs, handmade with different color schemes: Breathe, Missing You and Never Going Down.[1]\n",
            "In 2006, APTBS gained acclaim following their Webster Hall performance with the Brian Jonestown Massacre. The band returned to Webster Hall in 2007 to play with one of their major influences, the Jesus and Mary Chain. Throughout these formative years, the band's live shows became increasingly chaotic, which earned them the title of New York City's \"loudest band\" from various indie reviewers and bloggers,[2][3] as well as \"the most ear-shatteringly loud garage/shoegaze band you'll ever hear\" by The Washington Post.[4] The New York Times applauded their revival of \"the ominous, feedback-drenched drones of the 1980s\".[5]\n"
         ]
      },
      "First album and touring": {
         "text": [
            "In 2007, Jon Whitney from the Killer Pimp label wrote the contract for their first album, A Place to Bury Strangers, on a napkin. In August 2007, the band gained national attention after a favorable Pitchfork review of this album.\n",
            "In 2007, the band joined Black Rebel Motorcycle Club on the \"Holy Fuck\" tour.[6] In April 2008, it was announced that APTBS would open for Nine Inch Nails on several dates of the latter's US tour. Following several UK gigs, the first album was issued in the UK in October 2008 by Rocket Girl,[7] and they received strong praise from the British media including  NME and Kerrang!. In November 2008, the band returned to Europe and the UK on tour supporting MGMT.\n"
         ]
      },
      "Exploding Head": {
         "text": [
            "In early 2009, APTBS signed to Mute Records. The band also announced another European tour and appearances at the Coachella Valley Music and Arts Festival, Seaport Music Festival and Siren Music Festival.\n",
            "Their second album, Exploding Head, was released by Mute in October 2009.\n",
            "In spring 2010, Smith decided to leave APTBS for personal reasons rather than participate in their US tour supporting the Big Pink. He was replaced for that spring tour by Lunadon, formerly of the bands the D4 and the True Lovers. On July 5, 2010, APTBS visited Bogotá, Colombia for the first time, and played at Rock al Parque, the largest free rock festival in South America.\n"
         ]
      },
      "Worship": {
         "text": [
            "On February 14, 2011, Ackermann stated that the band had begun working on their third full-length album.[8] On January 10, 2012, A Place to Bury Strangers released an all-Hipstamatic video shot on an iPhone for the song \"So Far Away\" from the Onwards to the Wall EP. On February 12, 2012, the band announced that Robi Gonzalez had replaced Weilmeister as drummer.[9] On May 2, 2012, it was announced that the band's third album, Worship, was scheduled for release on the Dead Oceans label, on June 11 in the UK and Europe and on June 26, 2012 in the US.[10] The band announced plans to support the release with a full North American tour in October 2012.[11]\n"
         ]
      },
      "Strange Moon and Transfixiation": {
         "text": [
            "In early March 2013, APTBS announced that they had recorded covers of songs by Portland band Dead Moon for release on Record Store Day 2013 as an EP titled Strange Moon.[12] Gonzalez decided to retire from touring, and during the subsequent 2016 tour, John Fedowitz (Skywave, Ceremony) played drums for the band.[13]\n",
            "In March 2013, the band began recording their fourth studio album, Transfixiation. They recorded for several days at ABC Studios in Etne, Norway, with Emil Nikolaisen of Serena Maneesh.[14] The album was released on February 17, 2015 on Dead Oceans.\n"
         ]
      },
      "Pinned": {
         "text": [
            "In February 2018, the band announced that Lia Simone Braswell would be a permanent replacement for Gonzalez as the band's drummer.[15] Their fifth studio album, Pinned, was released on April 13.\n"
         ]
      }
   },
   "Discography": {
      "Studio albums": {},
      "EPs": {},
      "Compilations": {},
      "Singles": {},
      "Live albums": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "A Place to Bury Strangers are an American, New York City-based noise rock band, composed of Oliver Ackermann (guitar/vocals, bass), Dion Lunadon (bass guitar, guitar) and Lia Simone Braswell (drums). The band, commonly known by the initials APTBS, play a heavy, atmospheric Wall of Sound–influenced blend of psychedelic rock, shoegaze and space rock. A likely source of inspiration for the band's name is the 1898 Aleister Crowley poem \"Aceldama\", subtitled: \"A place to bury strangers in\".\n",
      "A Place to Bury Strangers were formed in 2002 by David Goffan and Tim Gregorio. Current frontman and guitarist Ackermann had moved to New York following the disbanding of his previous group, Skywave, to join APTBS, and become the primary songwriter after the departure of Goffan. They played their first show at Luxx in Brooklyn in 2003. Jason \"Jay Space\" Weilmeister and Jonathan \"Jono Mofo\" Smith, both from the New York City-based band Mofo, joined the band when Gregorio left. In 2006, APTBS self-released three different EPs, handmade with different color schemes: Breathe, Missing You and Never Going Down.[1]\n",
      "In 2006, APTBS gained acclaim following their Webster Hall performance with the Brian Jonestown Massacre. The band returned to Webster Hall in 2007 to play with one of their major influences, the Jesus and Mary Chain. Throughout these formative years, the band's live shows became increasingly chaotic, which earned them the title of New York City's \"loudest band\" from various indie reviewers and bloggers,[2][3] as well as \"the most ear-shatteringly loud garage/shoegaze band you'll ever hear\" by The Washington Post.[4] The New York Times applauded their revival of \"the ominous, feedback-drenched drones of the 1980s\".[5]\n",
      "In 2007, Jon Whitney from the Killer Pimp label wrote the contract for their first album, A Place to Bury Strangers, on a napkin. In August 2007, the band gained national attention after a favorable Pitchfork review of this album.\n"
   ]
}