{
   "Name": "Alice Donut",
   "rawData": [
      "Alice Donut is a punk rock band from New York City formed in 1986. The band released six albums before splitting up in 1996. They reformed in 2001.\n",
      "Alice Donut formed in 1986 after the demise of the Sea Beasts, a band at Columbia University, the name soon trimmed from the initial Alice Donut Liver Henry Moore, a play on \"Alice Doesn't Live Here Anymore\". Ted Houghton, Tomas Antona, Dave Giffen and Tom Meltzer recruited drummer Stephen Moses and quickly found a substantial audience at CBGB. Guitarist Michael Jung soon replaced Meltzer. The band's first commercial release was the Donut Comes Alive album, released in 1988 on Jello Biafra's Alternative Tentacles label, followed in 1989 with Bucketfulls of Sickness and Horror in an Otherwise Meaningless Life.\n",
      "In August 1990, the band's debut single, a cover version of \"My Boyfriend's Back\", preceded third album Mule, released the following month, and described by Trouser Press as \"challenging and invigorating\". Revenge Fantasies of the Impotent was released in May 1991 (and later included in Andrew Earles' Gimme Indie Rock: 500 Essential American Underground Rock Albums 1981-1996), and included an instrumental cover of Black Sabbath's \"War Pigs\". Austrian born Bassist Sissi Schulmeister joined the band before the end of the year, with Richard Marshall also joining on guitar.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, United States"
      ],
      "Genres": [
         "Grunge, punk rock, psychedelic rock"
      ],
      "Years active": [
         "1986–1996, 2001–present"
      ],
      "Labels": [
         "Alternative Tentacles,",
         "Howler Records"
      ],
      "Associated acts": [
         "Um"
      ],
      "Website": [
         "www.alicedonut.com"
      ],
      "Members": [
         "Tomas Antona",
         "Stephen Moses",
         "Michael Jung",
         "Sissi Schulmeister",
         "David Giffen"
      ],
      "Past members": [
         "Richard Marshall",
         "Ted Houghton",
         "Tom Meltzer"
      ]
   }
}