{
   "Discography": {
      "Albums": {
         "Compilations": {},
         "Live": {},
         "Studio": {}
      },
      "DVD": {},
      "Demos": {},
      "Singles and EPs": {},
      "VHS": {}
   },
   "External links": {},
   "Further reading": {},
   "History": {
      "1986–1996: Formation to split": {
         "text": [
            "Alice Donut formed in 1986 after the demise of the Sea Beasts, a band at Columbia University, the name soon trimmed from the initial Alice Donut Liver Henry Moore, a play on \"Alice Doesn't Live Here Anymore\".[2] Ted Houghton, Tomas Antona, Dave Giffen and Tom Meltzer recruited drummer Stephen Moses and quickly found a substantial audience at CBGB. Guitarist Michael Jung soon replaced Meltzer. The band's first commercial release was the Donut Comes Alive album, released in 1988 on Jello Biafra's Alternative Tentacles label,[3][4] followed in 1989 with Bucketfulls of Sickness and Horror in an Otherwise Meaningless Life.[5][6]\n",
            "In August 1990 the band's debut single, a cover version of \"My Boyfriend's Back\", preceded third album Mule, released the following month, and described by Trouser Press as \"challenging and invigorating\".[5][7][8] Revenge Fantasies of the Impotent was released in May 1991 (and later included in Andrew Earles' Gimme Indie Rock: 500 Essential American Underground Rock Albums 1981-1996),[9] and included an instrumental cover of Black Sabbath's \"War Pigs\".[5][10] Austrian born Bassist Sissi Schulmeister joined the band before the end of the year,[11] with Richard Marshall also joining on guitar.[5]\n",
            "The band's fifth album, The Untidy Suicides of Your Degenerate Children, was released in September 1992; It was described by CD Review as \"a peculiar mixture of ornate and wicked little bits about suicide, strippers, and a disgruntled ex-postal worker\".[12]  It would be over three years before the bands's next studio album, Pure Acid Park,[13] although a (mostly) live album, Dry-Humping the Cash Cow, came out in 1994.[5][14]\n",
            "The band decided to call it a day after playing their 1,000th show, in London on November 25, 1995, and confirmed the split in February 1996.[15] The band's many shows between 1988 and 1996 included tours of the United States, Europe, and Japan,[1] including a performance at the Reading Festival in 1993.\n",
            "Moses went on to briefly join Rasputina, while Antona and Schulmeister got married and relocated to Durham, North Carolina.[11][16]\n"
         ]
      },
      "Reunion": {
         "text": [
            "In 2001 Alice Donut started recording and writing again and in 2003 Three Sisters, their first release after their hiatus, was recorded as a four-piece with Tom Antona on vocals, Michael Jung on guitar, Stephen Moses on drums and Sissi Schulmeister on bass.[16][17]\n",
            "Guitarist Dave Giffen rejoined the group for Fuzz, which was recorded in Brooklyn's BC Studio with longtime co-producer Martin Bisi, mixed and engineered by Joel Hamilton, and released on September 5, 2006.[16]\n",
            "The band's tenth studio album followed, Ten Glorious Animals, released in September 2009, again on Alternative Tentacles.[16][18]\n",
            "In 2011, the band's 25th anniversary was marked with the documentary Freaks in Love.[16] In 2012 the Freaks in love compilation was released. Alice Donut still performs live on some occasions, like a show in 2014 in France and 2017 in Baltimore, MD at Ottobar.\n",
            "On November 11, 2016 Tomas Antona stated on Facebook that Alice Donut are writing a new album. No completion or release date was given.\n"
         ]
      }
   },
   "Members": {},
   "Musical style": {
      "text": [
         "The band has been described as \"punk...with elements of oddball country and funk\" by Allmusic writer John Bush,[16] and as \"abstract metal\" by Andrew Earles.[9] The New Yorker described the band as a \"dadaist punk ensemble\" playing \"oddball psychedelic noise-rock with a spiky sense of humor\".[2] Trouser Press described the band as \"a little bit Zappa, a little bit cacophonous punk\", calling it \"a belated East Coast response to the Dickies and Redd Kross\".[8] Critics also drew comparisons with artists such as Butthole Surfers, Frank Zappa, and G.G. Allin.[6][8][9][13]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 1986–1996: Formation to split",
      "1.2 Reunion",
      "2 Musical style",
      "3 Discography",
      "3.1 Demos",
      "3.2 Albums",
      "3.2.1 Studio",
      "3.2.2 Live",
      "3.2.3 Compilations",
      "3.3 Singles and EPs",
      "3.4 VHS",
      "3.5 DVD",
      "4 Members",
      "5 References",
      "6 Further reading",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Alice Donut is a punk rock band from New York City formed in 1986.[1] The band released six albums before splitting up in 1996. They reformed in 2001.\n"
      ]
   },
   "Title": "Alice Donut - Wikipedia"
}