{
   "Early career": {
      "text": [
         "The band’s first gig was on November 1, 2006 when they formed to play a set in conjunction with a lecture given by LeDoux about his research on fear and the brain.  They played a number of rock cover songs with mind and brain themes, including: \"Manic Depression\", \"19th Nervous Breakdown\", and \"Mother's Little Helper\".  They also performed several original songs about mind and brain and mental disorders.  With each gig during the following spring, they included more original material.\n",
         "In May, 2007, they played to 10,000 people in Madison Square Garden for NYU’s College of Arts and Science graduation.[2]  The audience of students and their families did “the wave” during their set which was captured on video and posted on YouTube, giving them a PR boost.\n"
      ]
   },
   "External links": {},
   "Other accomplishments": {
      "text": [
         "In 2012, The Amygdaloids performed at the Qualia Fest in New York City.[8]\n"
      ]
   },
   "Recording": {
      "text": [
         "The Amygdaloids recorded their debut CD in June 2007, Heavy Mental,[3] at Axis Sound in New York (Jeff Peretz, producer; Steve Rossiter, engineer).  The CD contained 8 original songs, 7 written by LeDoux and one by Volk. It was released in October 2007, around the same time as an article about LeDoux was published on Salon[4]   by rock interviewer, Jonathan Cott, (Rolling Stone, \"Essential Interviews\").[5]    The interview led to an invitation to play at the Kennedy Center in Washington DC.  Since then the group has had a steady flow of invitations to play in NYC clubs, art venues and museums.\n",
         "The Amygdaloids were offered a recording deal with the music production company, Knock Out Noise.  In June 2008 they did basic tracking for a new CD (producer, engineer, Stuart Chatwood; executive producer, Tim Sommer).  A pre-release version of the CD called Brainstorm was issued in March 2009.  It contains 17 songs, 14 by LeDoux and three by Volk.  Grammy Award Winner Rosanne Cash sings duets with LeDoux on two of the songs, \"Mind Over Matter\" and \"Crime of Passion\".  The official release was June, 2010 and is called Theory of My Mind.[6]   It includes an additional song, \"Theory of My Mind\", that was written by LeDoux and featuring Simon Baron-Cohen (autism researcher from Cambridge, UK) on bass.\n"
      ]
   },
   "References": {},
   "Rock-It Science Music Festival": {
      "text": [
         "On March 3, 2009, The Amygdaloids shared the stage with a star-studded cast of musicians for the Rock-It Science concert at the Highline Ballroom, New York,[7] an event organized by LeDoux, Knock-Out Noise, and the Sensation and Emotion Network.  Guest artists included Lenny Kaye (Patti Smith Band), Dee Snider (Twisted Sister), Rufus Wainwright, The Kennedys, Gary Lucas (Capitan Beefheart), Steve Wynn (Dream Syndicate), Stuart Chatwood (The Tea Party), Peter Holsapple (The dBs, REM), among others.\n",
         "The Amygdaliods included additional guest scientist musicians: Daniel Levitin (author of This Is Your Brain On Music, McGill neuropsychologist), Pardis Sabeti (Harvard Geneticist), and Dave Soldier (aka, David Sulzer, a Columbia Neuroscientist).  At Rock-It Science, The Amygdaloids were also joined by  Maura Kennedy (of The Kennedys) on vocals and Jeff Peretz (the producer of their first CD) on guitar.\n"
      ]
   },
   "Sections": [
      "1 Early career",
      "2 Recording",
      "3 Rock-It Science Music Festival",
      "4 Other accomplishments",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Amygdaloids, an American rock band from New York City,[1] are four New York University scientists: Joseph LeDoux, vocals and guitar, Tyler Volk, lead guitar and vocals, Nina Curley, Bass, and Daniela Schiller, drums.  LeDoux is a professor of neuroscience and Volk a professor of biology.  Curley is a graduate student and Schiller a postdoctoral researcher in cognitive neuroscience.  Their name is a reference to the amygdala in the brain.\n"
      ]
   },
   "Title": "The Amygdaloids - Wikipedia"
}