{
   "Name": "Bloody Panda",
   "rawData": [
      "Bloody Panda is a doom metal band based in New York City.\n",
      "The band was formed in 2003 by Yoshiko Ohara, an established visual artist based in Osaka, Japan, who \"decided to spend her savings on a trip to New York City, brand new recording equipment in tow, with the idea that she’d move to America to make music, this despite the unfortunate fact that she didn’t know how to play an instrument of any kind.\" Ohara then posted advertisements for band members that read, \"Seeking guitarist, bassist and drummer to form the biggest band in the world, as soon as possible. Must have dark personalities.\" One such ad posted in a local record store, caught the attention of trio Josh Rothenberger (guitar), Bryan Camphire (bass), and Blake McDowell (organ), who responded and subsequently joined Ohara's project, ultimately rounded out by \"respected jazz and world music drummer/percussion-ist/tabla-ist\" Dan Weiss.\n",
      "Between 2005 and 2006, the quintet played around New York City opening for such diverse acts as Akron/Family, Genghis Tron, and Mouth of the Architect. College Music Journal commented on Bloody Panda's live performances stating, \"Known for their daring stage shows, the band performs in executioner's hoods and robes to amplify their Yoko Ono-meets-Black Sabbath (or Sunn O)))-like) riff work.\" The band released—through Holy Roar—a split album with avant-garde metal group Kayo Dot in early 2007, and also recorded a cover of Eyehategod's \"Anxiety Hangover\" for the tribute album For the Sick. At this time, the debut album by the \"enigmatic metal band with the indie rock name\" had become one of the most anticipated full-lengths in 2007.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City"
      ],
      "Genres": [
         "Doom metal"
      ],
      "Years active": [
         "2003-present"
      ],
      "Labels": [
         "Holy Roar, Level Plane, Profound Lore"
      ],
      "Website": [
         "www.bloodypanda.com"
      ],
      "Members": [
         "Bryan Camphire",
         " Lev Weinstein",
         " Josh Rothenberger",
         " Yoshiko Ohara",
         " Blake McDowell",
         " Gerry Mak"
      ],
      "Past members": [
         "Michael Harriff",
         " Dan Weiss",
         " Richard Swartz"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band based in New York City.\n",
      "The band was formed in [YEAR] by [PERSON_NAME_FULL_0_FEMALE], an [GENRE] a trip to New York City, brand new recording equipment in tow, with the idea that she’d move to America to make music, this despite the unfortunate fact that she didn’t know how to play an instrument of any kind.\" [PERSON_NAME_LAST_0] then posted advertisements for band members that read, \"Seeking guitarist, bassist and drummer to form the biggest band in the world, as soon as possible. Must have dark personalities.\" One such ad posted in a local record store, caught the attention of trio Josh Rothenberger (guitar), [PERSON_NAME_FULL_2_MALE] (bass), and Blake McDowell (organ), who responded and subsequently joined [PERSON_NAME_LAST_0]'s project, ultimately rounded out by \"respected jazz and world music drummer/percussion-ist/tabla-ist\" [PERSON_NAME_FULL_1_MALE].\n",
      "Between [YEAR] and [YEAR], the quintet played around New York City opening for such diverse acts as Akron/Family, Genghis Tron, and Mouth of the Architect. College Music Journal commented on [BAND_NAME]'s live performances stating, \"Known for their daring stage shows, the band performs in executioner's hoods and robes to amplify their Yoko Ono-meets-Black Sabbath (or Sunn O)))-like) riff work.\" The band released—through Holy Roar—a split album with avant-garde metal group [PERSON_NAME_FULL_0_FEMALE] in early [YEAR], and also recorded a [GENRE] band with the indie rock name\" had become one of the most anticipated full-lengths in [YEAR].\n"
   ]
}