{
   "Name": "The Brandos",
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Releases",
      "2.2 Singles",
      "3 Timeline",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Brandos are an American rock band formed in 1985 in New York City by Dave Kincaid (vocals, guitar), Ernie Mendillo (bass, vocals), Ed Rupprecht (guitar, vocals) and Larry Mason (drums, vocals).\n",
         "The Brandos achieved commercial success in the United States in 1987 with the release of their first album, Honor Among Thieves and the single \"Gettysburg.\" They have also established a strong fan base in Europe, where they have done promotion and extensive touring since the late 1980s. They have occasionally made it high on the record charts in countries such as the Netherlands.\n",
         "In 2010 the recordings from the 2004 Irish Tour were mixed and the live album David Kincaid and The Brandos - Live in Europe was released on Dec. 1, 2010 and distributed in Europe by Blue Rose. The only current member of The Brandos is singer, guitarist and songwriter Dave Kincaid.\n"
      ]
   },
   "History": {
      "text": [
         "The passion, grit and power of New York's The Brandos has origins in the Seattle scene of the early eighties. In the fall of 1984, Dave Kincaid and Larry Mason were playing the Seattle club circuit as members of The Allies. With a local radio hit ('Emma Peel'), critically acclaimed recordings, and a video under their belts. At the same time, New Jersey based Soul Attack (with Ernie Mendillo and Ed Rupprecht) were playing gigs in and around their home state, with occasional jaunts into New York City. They had also made and released a local record in 1984. \n",
         "Frustrated with The Allies' lack of success, Kincaid decided to move to New York in 1985. Immediately upon arrival Kincaid began scouring the local music papers, namely the Village Voice, looking for a new band. Soul Attack had just lost their principal singer and songwriter, and had just placed an ad looking for a replacement. Kincaid joined the band and they eventually changed their name to The Brandos and performed their first show on February 14, 1986. Featuring Kincaid on vocals and guitar, Ernie Mendillo (bass, vocals), Ed Rupprecht (guitar), and Larry Mason (drums), the band began playing most of New York's most renowned clubs such as CBGB, Tramps, The Bitter End and Kenny's Castaways. The band also spent one month touring the Pacific Northwest. By October they had enough material for an album. While recording, the band continued to perform in the New York area, along with a brief tour of Germany in May 1987.\n",
         "The Brandos released their debut album, Honor Among Thieves, on Relativity Records in late August 1987. The album spent 19 weeks in the Billboard charts and peaked at No.108 in late October. During this period, the band began touring the U.S. and Europe, opening for well-known bands such as The Georgia Satellites, INXS, The Cars and The Alarm. Their first video was released and was placed in medium rotation on MTV. The favorable reviews began to pour in: the Gavin Report dubbed them \"Best new American band\", Rolling Stone magazine ran a full-page story describing them as \"Real contenders\", and Time magazine clinched it with their quote \"The Brandos' roots run deep and offer great nourishment\". In early 1988, the band won Best Album (Independent Label), and Kincaid was honored with Best Male Vocalist (Independent Label) at the New York Music Awards. The Brandos also left Relativity that year and signed with Geffen Records. Their relationship with Geffen was strained from the outset and the group ended up at RCA Records in 1989. After a massive corporate restructuring, RCA dropped The Brandos upon completion of their second LP, Trial by Fire (unreleased), in 1990. \n",
         "The better part of 1991 was spent writing and recording new material for a new album that would become Gunfire at Midnight, which would land a contract with SPV GmbH in Germany in the spring of 1992. Two singles from the album ('The Solution' and 'The Keeper') would reach the top 100 in the Netherlands. Extensive touring in Europe would follow, solidifying the band's fan base even further, however Rupprecht and Mason decided to leave the band in 1993. The Brandos recorded their next album The Light of Day with the help of a few friends, especially ex-Del Lords members Scott Kempner (guitar, vocals) and Frank Funaro (drums, vocals). They filled out the live band, and an extensive tour and live album, recorded in Amsterdam in December 1994, followed. In 1996, The Brandos returned  with Pass the Hat and Frank Giordano (guitar, vocals) replacing Kempner. The album marked a return to a more stripped-down guitar sound. Kincaid released a solo album, The Irish Volunteer, in 1997 but returned to The Brandos for another album (Nowhere Zone) in 1998 followed by two tours of Europe with the likes of Bryan Adams, Van Morrison, and Deep Purple. \n",
         "1999 saw the release of Contribution: The Best of 1985-1999. The band continued to tour Europe over the next few years. Following the 2003 release of “The Irish-American’s Song,” Kincaid’s second effort of songs of the Irish in the American Civil War, a European tour was organized in early 2004. Chris Layer (uilleann pipes, flute and whistle)accompanied Kincaid, Mendillo and Giordano for performances in Germany, Holland, Belgium and Denmark, with three of the shows being recorded. \n",
         "It would, however, be another seven years before the band would record any new material. Over the Border was released by Blue Rose Records in late 2006 to positive reviews. Kincaid and Mendillo were accompanied on the drums by Funaro once again along with Dennis Diken (The Smithereens) and Simon Kirke (Bad Company, Free). The band toured extensively with ex-From Good Homes member Patrick Fitzsimmons (drums, vocals) and Ziga Stanonik (guitar, vocals). The band also recorded a live CD and DVD (Town to Town, Sun to Sun) released on Blue Rose in early 2008. Another tour followed with ex-Del Lords and Joan Jett and the Blackhearts member Eric Ambel (guitar, vocals) and Phil Cimino (drums). Their lone 2008 appearance in New York City was their first in 10 years.\n",
         "In 2010 the recordings from the 2004 Irish Tour were mixed and the long-awaited live album David Kincaid and The Brandos - Live in Europe was released on Dec. 1, 2010 and distributed in Europe by Blue Rose.\n",
         "After more than nine years of silence, the Brandos returned in June, 2017 with a new album called \"Los Brandos\". It contained 10 new tracks, of which five are sung in English and the other five in Spanish. There are no Irish themes on this album, like there were on most of the earlier efforts.\nOriginal bassist Ernie Mendillo did not participate, as he had left the band in 2015, while guitarist Frank Giordano, who had left the group in 1999, returned just in time to help record the album. He stayed with the band for the following tour in Germany and the Netherlands which lasted from the end of May until the end of June.\nOn June, 9, 2017, The Brandos also made an appearance at the Sweden Rock Festival.\n",
         "\n",
         "Dave Kincaid\n",
         "Frank Giordano\n",
         "Tom Goss\n",
         "Sal Maida\n"
      ]
   },
   "Discography": {
      "Releases": {},
      "Singles": {}
   },
   "Timeline": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Brandos are an American rock band formed in 1985 in New York City by Dave Kincaid (vocals, guitar), Ernie Mendillo (bass, vocals), Ed Rupprecht (guitar, vocals) and Larry Mason (drums, vocals).\n",
      "The Brandos achieved commercial success in the United States in 1987 with the release of their first album, Honor Among Thieves and the single \"Gettysburg.\" They have also established a strong fan base in Europe, where they have done promotion and extensive touring since the late 1980s. They have occasionally made it high on the record charts in countries such as the Netherlands.\n",
      "In 2010 the recordings from the 2004 Irish Tour were mixed and the live album David Kincaid and The Brandos - Live in Europe was released on Dec. 1, 2010 and distributed in Europe by Blue Rose. The only current member of The Brandos is singer, guitarist and songwriter Dave Kincaid.\n",
      "The passion, grit and power of New York's The Brandos has origins in the Seattle scene of the early eighties. In the fall of 1984, Dave Kincaid and Larry Mason were playing the Seattle club circuit as members of The Allies. With a local radio hit ('Emma Peel'), critically acclaimed recordings, and a video under their belts. At the same time, New Jersey based Soul Attack (with Ernie Mendillo and Ed Rupprecht) were playing gigs in and around their home state, with occasional jaunts into New York City. They had also made and released a local record in 1984. \n"
   ]
}