{
   "Name": "The Brandos",
   "rawData": [
      "The Brandos are an American rock band formed in 1985 in New York City by Dave Kincaid (vocals, guitar), Ernie Mendillo (bass, vocals), Ed Rupprecht (guitar, vocals) and Larry Mason (drums, vocals).\n",
      "The Brandos achieved commercial success in the United States in 1987 with the release of their first album, Honor Among Thieves and the single \"Gettysburg.\" They have also established a strong fan base in Europe, where they have done promotion and extensive touring since the late 1980s. They have occasionally made it high on the record charts in countries such as the Netherlands.\n",
      "In 2010 the recordings from the 2004 Irish Tour were mixed and the live album David Kincaid and The Brandos - Live in Europe was released on Dec. 1, 2010 and distributed in Europe by Blue Rose. The only current member of The Brandos is singer, guitarist and songwriter Dave Kincaid.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, U.S."
      ],
      "Genres": [
         "Roots rock",
         "Rock"
      ],
      "Years active": [
         "1985 – present"
      ],
      "Labels": [
         "Relativity",
         "Geffen",
         "RCA",
         "SPV GmbH",
         "Blue Rose"
      ],
      "Members": [
         "Dave Kincaid"
      ],
      "Past members": [
         "Ernie Mendillo ",
         " Ed Rupprecht",
         "Larry Mason",
         "Scott Kempner",
         "Frank Funaro ",
         "Frank Giordano",
         "Tom Goss",
         "Tom Engels",
         "Christopher Layer",
         "Jim Mastro",
         "Patrick Fitzsimmons",
         "JF Vergel",
         "Ziga Stanonik",
         "Eric Ambel",
         "Phil Cimino"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band formed in [YEAR] in New York City by [PERSON_NAME_FULL_0_MALE] (vocals, guitar), [PERSON_NAME_FULL_1_MALE] (bass, vocals), Ed Rupprecht (guitar, vocals) and [PERSON_NAME_FULL_2_MALE] (drums, vocals).\n",
      "[BAND_NAME] achieved commercial success in the United States in [YEAR] with the release of their first album, Honor Among Thieves and the single [SONG_NAME] They have also established a strong fan base in Europe, where they have done promotion and extensive touring since the late [YEAR]s. They have occasionally made it high on the record charts in countries such as the Netherlands.\n",
      "In [YEAR] the recordings from the [YEAR] Irish Tour were mixed and the live album David [PERSON_NAME_LAST_0] and [BAND_NAME] - Live in Europe was released on [MONTH]. 1, [YEAR] and distributed in Europe by Blue Rose. The only current member of [BAND_NAME] is singer, guitarist and songwriter [PERSON_NAME_FULL_0_MALE].\n"
   ]
}