{
   "Band members": {
      "Timeline": {}
   },
   "Discography": {
      "DVDs": {},
      "Extended plays": {},
      "Other releases": {},
      "Splits": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Brutal Truth was formed in 1990 in New York City. The band was originally signed to Earache Records, on which they released two albums, Extreme Conditions Demand Extreme Responses and Need to Control, as well as an EP entitled Perpetual Conversion, and 7-inch singles for the songs \"Ill Neglect\" and \"Godplayer\". During this time, music videos were made for the songs \"Ill Neglect\", \"Collateral Damage\" and \"Godplayer\". Brutal Truth were frustrated with Earache Records and switched to Relapse Records, known for its roster of grindcore acts, with whom they stayed until the band's demise.\n",
         "With Relapse, they released the mini album Kill Trend Suicide, a full-length release entitled Sounds of the Animal Kingdom and a double CD live album called Goodbye Cruel World. The band has also released many split 7-inch singles on smaller labels, with most of these being out of print and difficult to find. The songs from these 7-inch singles were collected on the second disc of Goodbye Cruel World.\n",
         "The band disbanded around 1999 due to internal financial and management conflicts.[1]\n",
         "In 2001, the Guinness Book of Records awarded Brutal Truth the record for \"shortest music video\" for their video \"Collateral Damage\", which is 2.18 seconds long and consists of 48 still images in rapid succession followed by a clip of an explosion.[citation needed]\n",
         "Drummer Richard Hoak also provides vocals and drums for a project titled Total Fucking Destruction. Kevin Sharp released an album with Venomous Concept in 2004, a hardcore punk band featuring members from the Melvins and Napalm Death. He was also a member of Australian grind band Damaged for a little over a year in 1999. He is also currently involved with the Atlanta-based hardcore-metal, grindcore band, Primate, with guitarist Bill Kelliher from Mastodon. Dan Lilker now plays for a host of bands and is currently bassist for the re-united Nuclear Assault.\n",
         "Brutal Truth re-formed in 2006 with three-quarters of the final lineup returning (Lilker, Hoak and Sharp); Erik Burke (of Lethargy) replaced Brent McCarty on guitar.\n",
         "On July 8, 2008, four new Brutal Truth tracks were released on the This Comp Kills Fascists compilation.[2] This is the first new material from the band in almost ten years.\n",
         "On January 21, 2009, it was announced that Brutal Truth had finished recording a new album, entitled Evolution Through Revolution.[3] It was released on April 14 in North America, April 17 in Germany and on April 20 worldwide. The band have also made the entire album available via  streaming from their website.[4] A video for \"Sugardaddy/Branded\" was released on July 17, 2009.[5]\n",
         "On September 27, 2011, Brutal Truth released End Time on Relapse.[6] In 2012, the band participated in the Lausanne Underground Film and Music Festival, performing material composed by Robert Piotrowicz.[7] In October 2012, Dan O'Hare took over guitar duties.[8] Brutal Truth will release a split with Bastard Noise on November 11, 2013.[9]\n",
         "On January 10, 2014, Lilker announced that he would be retiring from being a full-time recording and touring musician on October 18, 2014, which was his 50th birthday. As a result, Brutal Truth disbanded on this day.[10]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Band members",
      "2.1 Timeline",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Extended plays",
      "3.3 DVDs",
      "3.4 Splits",
      "3.5 Other releases",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Brutal Truth was an American grindcore band from New York City, formed by ex-Anthrax, Nuclear Assault, and Stormtroopers of Death bass guitarist Dan Lilker in 1990. The group disbanded in 1999, but reformed in 2006 and continued to release music until 2014.\n"
      ]
   },
   "Title": "Brutal Truth - Wikipedia"
}