{
   "Name": "Brutal Truth",
   "rawData": [
      "Brutal Truth was an American grindcore band from New York City, formed by ex-Anthrax, Nuclear Assault, and Stormtroopers of Death bass guitarist Dan Lilker in 1990. The group disbanded in 1999, but reformed in 2006 and continued to release music until 2014.\n",
      "Brutal Truth was formed in 1990 in New York City. The band was originally signed to Earache Records, on which they released two albums, Extreme Conditions Demand Extreme Responses and Need to Control, as well as an EP entitled Perpetual Conversion, and 7-inch singles for the songs \"Ill Neglect\" and \"Godplayer\". During this time, music videos were made for the songs \"Ill Neglect\", \"Collateral Damage\" and \"Godplayer\". Brutal Truth were frustrated with Earache Records and switched to Relapse Records, known for its roster of grindcore acts, with whom they stayed until the band's demise.\n",
      "With Relapse, they released the mini album Kill Trend Suicide, a full-length release entitled Sounds of the Animal Kingdom and a double CD live album called Goodbye Cruel World. The band has also released many split 7-inch singles on smaller labels, with most of these being out of print and difficult to find. The songs from these 7-inch singles were collected on the second disc of Goodbye Cruel World.\n"
   ],
   "infobox": {
      "Origin": [
         "Rochester, New York, United States"
      ],
      "Genres": [
         "Grindcore, death metal"
      ],
      "Years active": [
         "1990–1999, 2006–2014"
      ],
      "Labels": [
         "Earache, Relapse, Deaf American, Relativity"
      ],
      "Associated acts": [
         "Lethargy, Nuclear Assault, Total Fucking Destruction, Exit-13, Venomous Concept, United Forces, S.O.D."
      ],
      "Website": [
         "Brutaltruth.bandcamp.com"
      ],
      "Past members": [
         "Kevin Sharp",
         "Dan Lilker",
         "Brent \"Gurn\" McCarty",
         "Scott Lewis",
         "Richard Hoak",
         "Jody Roberts",
         "Erik Burke",
         "Dan O'Hare"
      ]
   }
}