{
   "Name": "Dance Hall Crashers",
   "rawData": [
      "Dance Hall Crashers (often abbreviated to DHC) is an American ska punk band formed in 1989 in Berkeley, California.\n",
      "The original incarnation of the Dance Hall Crashers (named after the Alton Ellis song \"Dance Crasher\") was formed in 1989 by Matt Freeman and Tim Armstrong, formerly of the seminal Bay Area ska-punk band Operation Ivy, after both musicians expressed an interest in starting a band rooted in more traditional ska and rocksteady than what they had been playing with Operation Ivy. The first line-up featured Armstrong on vocals and Freeman on guitar, as well as drummer Erik Larsen (whom they specifically lured away from a rocksteady band called \"The Liquidators\").  The band also featured keyboardist Joey Schaaf, vocalists Ingrid Jonsson and Andrew Champion, guitarist Grant McIntire, and bassist Joel Wing.\n",
      "The band experimented with various songs and styles until they played their first show at 924 Gilman Street in Berkeley in 1989. Shortly after their debut, however, Freeman and Armstrong left to pursue other interests, mainly another punk-based ska project called Downfall.\n"
   ],
   "infobox": {
      "Also known as": [
         "DHC"
      ],
      "Origin": [
         "Berkeley, California, United States"
      ],
      "Genres": [
         "Ska punk, pop punk"
      ],
      "Years active": [
         "1989–1990; 1992–2004 (on hiatus)"
      ],
      "Labels": [
         "Moon Ska, MCA, Pink and Black"
      ],
      "Associated acts": [
         "Operation Ivy, Rancid, Screw 32, Limp, NOFX"
      ],
      "Members": [
         "Elyse Rogers",
         "Karina Deniké",
         "Jason Hammon",
         "Mikey Weiss",
         "Gavin Hammon"
      ],
      "Past members": [
         "Andrew Champion",
         "Scott Goodell",
         "Ingrid Jonsson",
         "Leland McNeely",
         "Tim Armstrong",
         "Matt Freeman",
         "Joel Wing",
         "Erik Larsen aka Erik Kolacek",
         "Joey Schaaf",
         "J. Grant Mcintire",
         "Alex Baker"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (often abbreviated to DHC) is an [GENRE] band formed in [YEAR] in Berkeley, California.\n",
      "The original incarnation of the [BAND_NAME] (named after the Alton Ellis song \"Dance Crasher\") was formed in [YEAR] by [PERSON_NAME_FULL_2_MALE] and Tim Armstrong, formerly of the seminal Bay Area ska-punk band Operation Ivy, after both musicians expressed an [GENRE] a band rooted in more traditional ska and rocksteady than what they had been playing with Operation Ivy. The first line-up featured Armstrong on vocals and [PERSON_NAME_LAST_2] on guitar, as well as drummer [PERSON_NAME_FULL_1_MALE] (whom they specifically lured away from a rocksteady band called \"The Liquidators\").  The band also featured keyboardist [PERSON_NAME_FULL_0_MALE], vocalists [PERSON_NAME_FULL_3_FEMALE] and Andrew Champion, guitarist [PERSON_NAME_FULL_4_MALE], and bassist Joel Wing.\n",
      "The band experimented with various songs and styles until they played their first show at 924 Gilman Street in Berkeley in [YEAR]. Shortly after their debut, however, Freeman and Armstrong left to pursue other interests, mainly another punk-based ska project called Downfall.\n"
   ]
}