{
   "Name": "Dance Hall Crashers",
   "Sections": [
      "1 Biography",
      "1.1 Early years",
      "1.2 Breakthrough",
      "1.3 Hiatus and reunions",
      "2 References in popular culture",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 EPs",
      "3.3 Live albums",
      "3.4 Compilations",
      "3.5 Demos",
      "4 Members",
      "4.1 Current",
      "4.2 Former",
      "5 References",
      "6 External links",
      "6.1 Reviews"
   ],
   "Summary": {
      "text": [
         "Dance Hall Crashers (often abbreviated to DHC) is an American ska punk band formed in 1989 in Berkeley, California.\n"
      ]
   },
   "Biography": {
      "Early years": {
         "text": [
            "The original incarnation of the Dance Hall Crashers (named after the Alton Ellis song \"Dance Crasher\") was formed in 1989 by Matt Freeman and Tim Armstrong, formerly of the seminal Bay Area ska-punk band Operation Ivy,[1] after both musicians expressed an interest in starting a band rooted in more traditional ska and rocksteady than what they had been playing with Operation Ivy. The first line-up featured Armstrong on vocals and Freeman on guitar, as well as drummer Erik Larsen (whom they specifically lured away from a rocksteady band called \"The Liquidators\").  The band also featured keyboardist Joey Schaaf, vocalists Ingrid Jonsson and Andrew Champion, guitarist Grant McIntire, and bassist Joel Wing.\n",
            "The band experimented with various songs and styles until they played their first show at 924 Gilman Street in Berkeley in 1989. Shortly after their debut, however, Freeman and Armstrong left to pursue other interests, mainly another punk-based ska project called Downfall.\n",
            "After numerous membership changes which eventually left only the original drummer Larsen and bassist Wing, DHC solidified a line-up with dual vocalists Karina Deniké Schwarz and Elyse Rogers, guitarists Jason Hammon and Jaime McCormick, and drummer Gavin Hammon (Jason's brother). Following a period of steady gigging, DHC finally caught a break after being booked at an all-ska Earth Day festival at Berkeley's Greek Theatre in 1990, opening for Bad Manners. That year, the band recorded their debut album for Moon Ska Records, though trouble within the band led to a break-up soon after.[2]\n"
         ]
      },
      "Breakthrough": {
         "text": [
            "Their debut album became a word-of-mouth underground hit even with the band disbanded, and the group reunited in 1991 at Slim's for a sold-out performance.[2] In 1992, bowing to fan pressure, DHC reunited for a one-off series of gigs, but after the positive response to their performance, the band chose to reform on a permanent basis. In 1993, to commemorate their reunion, Moon Records released a CD compilation of the band's entire body of work from 1989 to 1992, appropriately titled 1989-1992.[3]\n",
            "As the band began touring nationally by the mid-1990s, the line-up changed once again, now featuring Rogers, Denike, Hammon, his brother Gavin Hammon on drums, guitarist Scott Goodell and bassist Mikey Weiss.[2] In 1995, DHC were the very first group signed to MCA Records subsidiary 510 records, and issued their second LP Lockjaw the same year.[3] Lockjaw was the first DHC release without a horn section, and had a harder, guitar-driven pop punk sound than the band's prior recordings.[2] The album's single, \"Enough\", was featured on the soundtrack to the film Angus, and the accompanying music video received moderate airplay on MTV's 120 Minutes. Weiss recalls that he was working in a record store when Lockjaw was released; curious customers would ask about the band or their sound, and the other employees would point him out as the bass player.[4]\n",
            "A re-issue of 1989-1992 was released as The Old Record in late 1996 on Fat Wreck Chords' Honest Don's label.  DHC's second MCA record, Honey, I'm Homely!, was released in 1997. This proved to be the band's breakthrough album, peaking at No. 22 on Billboard's Top Heatseekers. The leading singles \"Lost Again\" and \"Mr. Blue\" enjoyed steady rotation on local and college radio stations across the United States, and music videos were filmed for both tracks.\n",
            "The band toured extensively throughout the mid to late 1990s, both as a headliner and opening for bands such as The Mighty Mighty Bosstones[3] and Bad Religion. In addition, the band played festivals such as the Warped Tour and Lilith Fair. Due to the heavy touring schedule, Scott Goodell bowed out from his guitar duties in 1996; the band asked Phil Ensor from Limp and later, Billy Bouchard to stand in for live shows until the need for a second guitarist was nixed and Hammon handled all guitar parts himself.\n"
         ]
      },
      "Hiatus and reunions": {
         "text": [
            "In 1998, DHC released their last release with MCA, the EP Blue Plate Special. The EP contained a short collection of songs recorded for other compilations/soundtracks, unreleased and remixed material, and a CD-ROM of photos and the band's four music videos. In 1999, the band signed with independent label Pink and Black Records, releasing their fourth LP Purr in 1999[5] and the live album The Live Record: Witless Banter and 25 Mildly Antagonistic Songs About Love in 2000.[6]\n",
            "DHC started playing less frequently in the early 2000s, limiting their performances to West Coast shows and occasional appearances at events such as the 2002 Winter Olympics in Salt Lake City. In November 2004, the band recorded a show at the Hollywood House of Blues which was later released on DVD by Kung Fu Records as part of their The Show Must Go Off! series. Although the performance included an unreleased song and made mention of the band working on a new studio album, the show proved to be DHC's last performance to date as the band has since gone on hiatus. Although they have not explicitly stated having broken up, there has been no announcement of any future plans to resume touring or recording.\n"
         ]
      }
   },
   "References in popular culture": {
      "text": [
         "The band is referenced (alongside Unwritten Law) in the lyric \"Yeah my girlfriend likes UL and DHC\" from Blink-182's 1998 single \"Josie\".\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "EPs": {},
      "Live albums": {},
      "Compilations": {},
      "Demos": {}
   },
   "Members": {
      "Current": {},
      "Former": {}
   },
   "References": {},
   "External links": {
      "Reviews": {}
   },
   "coreData": [
      "Dance Hall Crashers (often abbreviated to DHC) is an American ska punk band formed in 1989 in Berkeley, California.\n",
      "The original incarnation of the Dance Hall Crashers (named after the Alton Ellis song \"Dance Crasher\") was formed in 1989 by Matt Freeman and Tim Armstrong, formerly of the seminal Bay Area ska-punk band Operation Ivy,[1] after both musicians expressed an interest in starting a band rooted in more traditional ska and rocksteady than what they had been playing with Operation Ivy. The first line-up featured Armstrong on vocals and Freeman on guitar, as well as drummer Erik Larsen (whom they specifically lured away from a rocksteady band called \"The Liquidators\").  The band also featured keyboardist Joey Schaaf, vocalists Ingrid Jonsson and Andrew Champion, guitarist Grant McIntire, and bassist Joel Wing.\n",
      "The band experimented with various songs and styles until they played their first show at 924 Gilman Street in Berkeley in 1989. Shortly after their debut, however, Freeman and Armstrong left to pursue other interests, mainly another punk-based ska project called Downfall.\n",
      "After numerous membership changes which eventually left only the original drummer Larsen and bassist Wing, DHC solidified a line-up with dual vocalists Karina Deniké Schwarz and Elyse Rogers, guitarists Jason Hammon and Jaime McCormick, and drummer Gavin Hammon (Jason's brother). Following a period of steady gigging, DHC finally caught a break after being booked at an all-ska Earth Day festival at Berkeley's Greek Theatre in 1990, opening for Bad Manners. That year, the band recorded their debut album for Moon Ska Records, though trouble within the band led to a break-up soon after.[2]\n"
   ],
   "infobox": {
      "Also known as": [
         "DHC"
      ],
      "Origin": [
         "Berkeley, California, United States"
      ],
      "Genres": [
         "Ska punk, pop punk"
      ],
      "Years active": [
         "1989–1990; 1992–2004 (on hiatus)"
      ],
      "Labels": [
         "Moon Ska, MCA, Pink and Black"
      ],
      "Associated acts": [
         "Operation Ivy, Rancid, Screw 32, Limp, NOFX"
      ],
      "Members": [
         "Elyse Rogers",
         "Karina Deniké",
         "Jason Hammon",
         "Mikey Weiss",
         "Gavin Hammon"
      ],
      "Past members": [
         "Andrew Champion",
         "Scott Goodell",
         "Ingrid Jonsson",
         "Leland McNeely",
         "Tim Armstrong",
         "Matt Freeman",
         "Joel Wing",
         "Erik Larsen aka Erik Kolacek",
         "Joey Schaaf",
         "J. Grant Mcintire",
         "Alex Baker"
      ]
   }
}