{
   "Name": "Castevet",
   "Sections": [
      "1 History",
      "1.1 Breakup",
      "1.2 Other projects",
      "2 Musical style",
      "3 Band members",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Castevet was an American black metal band formed in 2006 in New York City, New York. The band announced their breakup on July 21, 2014. The last line-up of the band featured Andrew Hock on vocals and guitar, Ian Jacyszyn on drums and Krallice member Nicolas McMaster on bass guitar.\n"
      ]
   },
   "History": {
      "Breakup": {
         "text": [
            "On July 21, 2014, a message was posted on the band's official website announcing their breakup:\n",
            "Castevet is no more. There is no single reason or event driving this decision; it is based on the need of each individual involved to continue to develop their vision within new and existing projects. To put it simply, it is time to move on.\nThank you to all who have supported Castevet since our inception in 2006.[5]"
         ]
      },
      "Other projects": {
         "text": [
            "Hock went on to form Psalm Zero with former Extra Life singer Charlie Looker although he is no longer with that group. He has also put out a solo guitar record. McMaster's current projects include Krallice and Geryon.\n"
         ]
      },
      "text": [
         "The band was formed by guitarist Andrew Hock, bassist Daniel Olivencia and drummer Ian Jacyszyn. Jacyszyn performed with the death metal act Copremesis. Hock and Olivencia were a member of the extreme metal acts Biolich and Ehnahre while attending New England Conservatory. After releasing Stones/Salts in 2009, the band signed to Profound Lore Records and released their debut album, Mounds of Ash in 2010,[1] gaining a critical acclaim.[2][3] After parting ways with two previous bassists, the band recruited Krallice bassist Nicholas McMaster and released their sophomore album, Obsian in 2013.[1]\n",
         "In 2014, the band embarked a North American tour with Canadian black metal band Thantifaxath and performed at Maryland Deathfest.[4]\n"
      ]
   },
   "Musical style": {
      "text": [
         "The band's musical style has been described as \"proggy black metal\"[2] and \"math-metal\".[6] The band's debut album featured a fusion of \"black metal and noisecore.\"[7] Phil Freeman of Allmusic also stated that the album \"takes the tremolo guitar picking and thundering-hooves drumming of black metal and weds them to complex, interlocking riff structures more akin to progressive thrash.\"[8] The band's second album, Obsian, was described as \"metal built on math-rock foundations\" by Grayson Currin of Pitchfork Media.[6] It incorporated influences ranging from punk rock,[2] ambient music, post-hardcore[9] and death metal.[10]\n",
         "The music of the band features \"death growls akin to hardcore and death metal, unusual chord voicings and polyrhythmic drumming.\"[1][6][7] The basslines of the latest bassist were compared to jazz-fusion music and the works of King Crimson.[6]\n"
      ]
   },
   "Band members": {},
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Castevet was an American black metal band formed in 2006 in New York City, New York. The band announced their breakup on July 21, 2014. The last line-up of the band featured Andrew Hock on vocals and guitar, Ian Jacyszyn on drums and Krallice member Nicolas McMaster on bass guitar.\n",
      "The band was formed by guitarist Andrew Hock, bassist Daniel Olivencia and drummer Ian Jacyszyn. Jacyszyn performed with the death metal act Copremesis. Hock and Olivencia were a member of the extreme metal acts Biolich and Ehnahre while attending New England Conservatory. After releasing Stones/Salts in 2009, the band signed to Profound Lore Records and released their debut album, Mounds of Ash in 2010,[1] gaining a critical acclaim.[2][3] After parting ways with two previous bassists, the band recruited Krallice bassist Nicholas McMaster and released their sophomore album, Obsian in 2013.[1]\n",
      "In 2014, the band embarked a North American tour with Canadian black metal band Thantifaxath and performed at Maryland Deathfest.[4]\n",
      "On July 21, 2014, a message was posted on the band's official website announcing their breakup:\n"
   ]
}