{
   "Name": "Castevet",
   "rawData": [
      "Castevet was an American black metal band formed in 2006 in New York City, New York. The band announced their breakup on July 21, 2014. The last line-up of the band featured Andrew Hock on vocals and guitar, Ian Jacyszyn on drums and Krallice member Nicolas McMaster on bass guitar.\n",
      "The band was formed by guitarist Andrew Hock, bassist Daniel Olivencia and drummer Ian Jacyszyn. Jacyszyn performed with the death metal act Copremesis. Hock and Olivencia were a member of the extreme metal acts Biolich and Ehnahre while attending New England Conservatory. After releasing Stones/Salts in 2009, the band signed to Profound Lore Records and released their debut album, Mounds of Ash in 2010, gaining a critical acclaim. After parting ways with two previous bassists, the band recruited Krallice bassist Nicholas McMaster and released their sophomore album, Obsian in 2013.\n",
      "In 2014, the band embarked a North American tour with Canadian black metal band Thantifaxath and performed at Maryland Deathfest.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, United States"
      ],
      "Genres": [
         "Black metal, progressive metal,  mathcore, post-hardcore"
      ],
      "Years active": [
         "2006 (2006)–2014"
      ],
      "Labels": [
         "Profound Lore, Paragon"
      ],
      "Associated acts": [
         "Copremesis, Biolich, Krallice, Bloody Panda, Pillory, Ehnahre, Psalm Zero, Geryon, Astomatous, Solecism, Ash & Elm"
      ],
      "Website": [
         "www.castevet.com"
      ],
      "Members": [
         "Ian Jacyszyn",
         "Andrew Hock",
         "Nicholas McMaster"
      ],
      "Past members": [
         "Daniel Olivencia",
         "Joshua Scott"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band formed in [YEAR] in New York City, New York. The band announced their breakup on [MONTH] 21, [YEAR]. The last line-up of the band featured Andrew Hock on vocals and guitar, [PERSON_NAME_FULL_0_MALE] on drums and Krallice member Nicolas McMaster on bass guitar.\n",
      "The band was formed by guitarist Andrew Hock, bassist [PERSON_NAME_FULL_1_MALE] and drummer [PERSON_NAME_FULL_0_MALE]. [PERSON_NAME_LAST_0] performed with the death metal act Copremesis. Hock and [PERSON_NAME_LAST_1] were a member of the extreme metal acts Biolich and Ehnahre while attending New England Conservatory. After releasing Stones/Salts in [YEAR], the band signed to Profound Lore Records and released their debut album, Mounds of Ash in [YEAR], gaining a critical acclaim. After parting ways with two previous bassists, the band recruited Krallice bassist Nicholas McMaster and released their sophomore album, Obsian in [YEAR].\n",
      "In [YEAR], the band embarked a [GENRE] band Thantifaxath and performed at [MONTH]yland Deathfest.\n"
   ]
}