{
   "Name": "Cro-Mags",
   "rawData": [
      "Cro-Mags are an American hardcore punk band from New York City. The band, which has a strong cult following, has released six studio albums, with the first two considered the most influential. With a Hare Krishna background, they were among the first bands to fuse hardcore punk with thrash metal and were associated with the birth of a tougher attitude within the hardcore scene in the late 1980s, related to the world of martial arts. Harley Flanagan (former drummer for the Stimulators) and John Joseph are practitioners of Brazilian jiu-jitsu and boxing, respectively.\n",
      "Cro-Mags have gone through many line-up changes since the band's beginnings. Flanagan has been the sole trademark owner of the group's name since the early 1990s, the primary songwriter, and only member featured on every album, while Joseph and Jayson continued to tour with other musicians using the Cro-Mags name, against the wishes of Flanagan. In April 2019, Flanagan reached a settlement with Joseph and Mackie Jayson in which Flanagan would retain exclusive rights to the Cro-Mags name while Joseph and Jayson would move forward under the name, Cro-Mags \"JM.\"\n",
      "The band's early years were spent living in burnt out buildings, squats, and on the streets. By 1982-1983, Flanagan had recorded the very first Cro-Mags demo consisting of four songs that would become the blueprint for their debut album, The Age of Quarrel (1986). Flanagan wrote all of the music, played each instrument, and performed vocals. Before long, he connected with Parris Mayhew and the two started writing music and auditioning band members. Singer John Joseph parted ways with the band for the first time after Age of Quarrel, leaving bass player Harley Flanagan to sing on the following Cro-Mags release, Best Wishes (1989), which had a more heavy metal-influenced sound. The next record Alpha Omega saw the return of Joseph singing along with Flanagan. According to guitarist and songwriter Parris Mayhew, he wrote most of the album with guitarist Rob Buckley. However, neither Mayhew or Buckley played on the actual recording, and the writing has been disputed by Flanagan and others. Cro-Mags disbanded but later recorded the album with the return of Doug Holland and a new rhythm guitarist: Gabby Abularach.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, U.S."
      ],
      "Genres": [
         "Hardcore punk",
         "crossover thrash"
      ],
      "Years active": [
         "1981–2002, 2008–present"
      ],
      "Labels": [
         "Victory",
         "Arising Empire",
         "Century Media",
         "Mightier Than Sword"
      ],
      "Associated acts": [
         "The Stimulators",
         "Murphy's Law",
         "White Devil",
         "Sămsära",
         "Police Beat",
         "Urban Blight",
         "The Icemen",
         "Bad Brains",
         "Suicidal Tendencies",
         "Bloodclot!",
         "MOI",
         "Both Worlds",
         "Kraut",
         "Shelter"
      ],
      "Website": [
         "realcromags.com"
      ],
      "Members": [
         "Harley Flanagan",
         "Gabby Abularach",
         "Garry Sullivan",
         "Rocky George"
      ],
      "Past members": [
         "John Joseph",
         "Mackie Jayson",
         "A.J. Novello",
         "Craig Setari",
         "Parris Mayhew",
         "Eric Casanova",
         "Doug Holland",
         "Pete Hines",
         "Dave di Censo",
         "Rob Buckley"
      ]
   },
   "albums": [
      "The Age of Quarrel",
      "Best Wishes",
      "Alpha Omega",
      "Near Death Experience",
      "Revenge",
      "In the Beginning"
   ]
}