{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "The band's early years were spent living in burnt out buildings, squats, and on the streets.[6] By 1982-1983, Flanagan had recorded the very first Cro-Mags demo consisting of four songs that would become the blueprint for their debut album, The Age of Quarrel (1986). Flanagan wrote all of the music, played each instrument, and performed vocals. Before long, he connected with Parris Mayhew and the two started writing music and auditioning band members. Singer John Joseph parted ways with the band for the first time after Age of Quarrel, leaving bass player Harley Flanagan to sing on the following Cro-Mags release, Best Wishes (1989), which had a more heavy metal-influenced sound. The next record Alpha Omega saw the return of Joseph singing along with Flanagan. According to guitarist and songwriter Parris Mayhew, he wrote most of the album with guitarist Rob Buckley. However, neither Mayhew or Buckley played on the actual recording, and the writing has been disputed by Flanagan and others. Cro-Mags disbanded but later recorded the album with the return of Doug Holland and a new rhythm guitarist: Gabby Abularach.[7]\n",
         "The album, Near Death Experience was released in 1993, after which the group disbanded for several years. They began touring again in the late 1990s with Flanagan on vocals and bass and Mayhew returning to the fold. Eventually, the band released Revenge in 2000. For many fans, this album signified a return to Cro-Mags' early hardcore roots. Many songs were comparable to those on The Age of Quarrel, although some featured a more melodic/punk rock style. The release of Revenge and its subsequent tour resulted in yet another break up, which caused lasting resentment between Mayhew and Flanagan. In 2001 Flanagan asked Joseph to join him once again, but the short-lived reunion ended in 2002.\n",
         "In 2008, John Joseph and Jayson began playing shows under the Cro-Mags name with other established hardcore musicians such as Craig Setari from Sick of It All on bass and A.J. Novello from Leeway on guitar. In an October 2010 interview, Joseph revealed that they were planning to release a new album in 2011,[8] though, ultimately, this did not happen. Flanagan released his solo debut album, Cro-Mags, in 2016, featuring Cro-Mags alumnus, Gabby Abularach, on guitar.[9]\n",
         "In 2018, Flanagan filed a federal trademark infringement against John Joseph and Mackie Jayson. In April 2019, Flanagan announced a settlement wherein he would own exclusive rights to the name Cro-Mags; simultaneously, Joseph announced his recognition of the settlement, and that he and his band would perform as Cro-Mags JM, beginning in August 2019.[10][11]\n",
         "On June 28, 2019, Cro-Mags released their first new music in nineteen years, sharing three new songs \"Don't Give In,\" \"Drag You Under,\" and \"No One's Victim,\"[12] while revealing they were preparing a new album with producer Arthur Rizk for a planned early 2020 release date. They were the opening act for four shows with the Original Misfits: June 29 in Los Angeles, September 7 in Denver, September 11 in Oakland, and September 14 in Seattle. This was followed by a ten-date European tour to commemorate the thirtieth anniversary of the Best Wishes album.[13]\n",
         "Following the European tour, Cro-Mags released the digital single, \"From the Grave\" that featured former Motörhead guitarist Phil Campbell on lead and slide guitar.[14] A three-song 7\" EP of the same name was released on December 6, 2019 in various colors and have the tracks \"PTSD\" and \"Between Wars\" included. The band was set to perform with Body Count in New York City on March 15 at Webster Hall. The show was postponed due to the COVID-19 virus. The band decided to live stream a free performance from SIR studios,[15] one of the first bands to do so during the pandemic.[16] On March 31, 2020, the band offered a free download of the track, \"The Final Test\" and announced the June 19 release date of their first studio album in twenty years, In the Beginning.[17][18]\n",
         "On September 2, the band premiered the video for \"Between Wars,\"[19] which features footage from the upcoming independent film of the same name starring Flanagan and The Sopranos star, Michael Imperioli, due to be released in 2020.\n"
      ]
   },
   "Members": {
      "Current": {},
      "Former": {
         "text": [
            "At various times during the 1990s and 2000s, Flanagan and Joseph simultaneously led separate versions of the Cro-Mags with completely different lineups. The groups billed themselves as Cro-Mag Jam, Street Justice, Age of Quarrel, FVK (Fearless Vampire Killers) or Cholo-Mags.[citation needed]\n"
         ]
      },
      "Timeline": {}
   },
   "References": {},
   "Related bands": {},
   "Sections": [
      "1 History",
      "2 Members",
      "2.1 Current",
      "2.2 Former",
      "2.3 Timeline",
      "3 Discography",
      "4 Related bands",
      "5 See also",
      "6 References",
      "7 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "Cro-Mags are an American hardcore punk band from New York City. The band, which has a strong cult following, has released six studio albums, with the first two considered the most influential. With a Hare Krishna background,[1] they were among the first bands to fuse hardcore punk with thrash metal and were associated with the birth of a tougher attitude within the hardcore scene in the late 1980s, related to the world of martial arts. Harley Flanagan (former drummer for the Stimulators) and John Joseph are practitioners of Brazilian jiu-jitsu and boxing, respectively.[2][3]\n",
         "Cro-Mags have gone through many line-up changes since the band's beginnings. Flanagan has been the sole trademark owner of the group's name since the early 1990s[citation needed], the primary songwriter, and only member featured on every album, while Joseph and Jayson continued to tour with other musicians using the Cro-Mags name, against the wishes of Flanagan. In April 2019, Flanagan reached a settlement with Joseph and Mackie Jayson in which Flanagan would retain exclusive rights to the Cro-Mags name while Joseph and Jayson would move forward under the name, Cro-Mags \"JM.\"[4][5]\n"
      ]
   },
   "Title": "Cro-Mags - Wikipedia"
}