{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "After performing with Fountains of Wayne co-founder Chris Collingwood in the band “Smalltown Criers,[2]” Scott Klass formed The Davenports.  In 2000 the band released their first album Speaking of The Davenports to positive reviews.  Allmusic described the album as having “taken subtle college power pop to an infinitely pleasing level.[3]”  MTV licensed music from the record for the shows “Undressed” and “The Sausage Factory.[4]”\n",
         "The band’s follow-up recording Hi-Tech Lowlife was released in 2005 again to positive reviews.  Popmatters described the record as “subtle power pop at its most pleasant,[5]” while AllMusic critic Jason Damas cited the band as “[offering] some of the most lyrically and musically rich modern guitar-pop.[6]”\n",
         "In an April 2008 interview with The Deli Magazine, Klass described the band's next record as being about \"this couple and a handful of particularly crappy situations that they don’t navigate so effectively.\"[7]  The band issued a three song EP on December 16, 2008.  The EP featured the single \"Thinking About You, Maryann\" as well as \"Don't Cry Mary\" from the upcoming album, and a remake of \"Whore For the Holidays\" which originally appeared on Hi-Tech Lowlife.  On January 11, 2011, Why The Great Gallop? was released.\n",
         "On June 1, 2018, the band announced a new album titled \"Don't Be Mad at Me\" to be released on July 13, 2018. Concurrent with that announcement was a release of the album's first single \"Where Shall We Hang Elena.\"\n"
      ]
   },
   "Members": {},
   "References": {},
   "Sections": [
      "1 Members",
      "2 History",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Davenports are an American rock band.  Formed in 2000 in Brooklyn, New York, the band is a project of Scott Klass and has issued four albums on Mother West records.  The song “Five Steps” from the album Speaking of The Davenports is the theme song to the A&E television series Intervention.[1]\n"
      ]
   },
   "Title": "The Davenports - Wikipedia"
}