{
   "Name": "The Dictators",
   "rawData": [
      "The Dictators are an American punk rock band formed in New York City in 1973. Critic John Dougan said that they were \"one of the finest and most influential proto-punk bands to walk the earth.\"\n",
      "The band was formed in 1972 by Andy \"Adny\" Shernoff  who was attending The State University of New York at New Paltz and Ross \"The Boss\" Friedman who was playing in the local band  Total Crudd. Scott \"Top Ten\" Kempner was asked to join  and the trio rented a house in Kerhonkson, NY where they lived and rehearsed with various drummers.  The original recording line-up consisted of vocalist/bassist/songwriter Andy Shernoff, lead guitarist Ross Friedman (aka Ross Funicello), rhythm guitarist Scott Kempner, and drummer Stu Boy King. It was this line-up–along with roadie/occasional vocalist and \"Secret Weapon\" Handsome Dick Manitoba–which recorded the band's 1975 debut album, The Dictators Go Girl Crazy! for Epic Records, produced by Sandy Pearlman and Murray Krugman (best known for their work with Blue Öyster Cult). The album sold poorly at the time but is now considered to be the starting point for American punk rock . Entertainment Weekly wrote \"Go Girl Crazy's junk-generation culture and smart-aleck sensibility did provide an essential blueprint for '70s punk. With its TV references and homely vocals, this ground-breaking and long-unavailable album continues to inspire underground groups everywhere.\" \n",
      "Frustrated by the lack of sales, the band broke up for a few months in late 1975, but reconvened in early 1976, with bassist Mark \"The Animal\" Mendoza replacing Shernoff and Ritchie Teeter replacing King. After a few months Shernoff was persuaded to return to the group as the group's keyboardist. This line-up soon secured a contract with Asylum Records (at least partly due to the notoriety the group had developed following a well-publicized brawl between Manitoba and Wayne County) and released their second album, Manifest Destiny, in 1977. The album was produced by Pearlman and Krugman with songs written by Shernoff.\n"
   ],
   "infobox": {
      "Also known as": [
         "Manitoba's Wild Kingdom"
      ],
      "Origin": [
         "New York City, New York, U.S."
      ],
      "Genres": [
         "Punk rock",
         "hard rock",
         "proto-punk"
      ],
      "Years active": [
         "1973 (1973)–1978, 1996–present"
      ],
      "Labels": [
         "Epic",
         "Asylum",
         "Norton"
      ],
      "Associated acts": [
         "Manowar"
      ],
      "Website": [
         "thedictators.com"
      ],
      "Members": [
         "Ross \"The Boss\" Friedman",
         "Scott \"Top Ten\" Kempner",
         "Andy Shernoff",
         "Albert Bouchard"
      ],
      "Past members": [
         "Richard Manitoba",
         "J.P. Patterson",
         "Stu Boy King",
         "Ritchie Teeter",
         "Mark Mendoza",
         "Mel Anderson",
         "Frank Funaro"
      ]
   }
}