{
   "1980s": {
      "text": [
         "After the break-up, Manitoba drove a taxi cab, Shernoff worked as a record producer and songwriter and Friedman worked first with the French hard-rock band Shakin' Street, then became a founding member of Manowar in 1982 (with whom he recorded the band's first six albums, leaving the band after the 1988 album Kings of Metal), and producing the first demo for Anthrax.\n",
         "The members of the band began reuniting occasionally and in 1981, ROIR released the cassette-only Fuck 'Em If They Can't Take a Joke produced by Andy Shernoff, which featured numbers from all three of the group's studio albums, covers of the Velvet Underground's \"What Goes On\" and Mott the Hoople's \"Moon Upstairs,\" plus two new Shernoff numbers: \"Loyola\" and \"New York New York\".\n",
         "Other than occasional reunion shows, little was heard from The Dictators during the next five years.  However, in late 1986 Shernoff and Manitoba (along with guitarist Daniel Rey) formed Wild Kingdom, releasing a version of \"New York New York\" on the 1988 soundtrack to Mondo New York.\n"
      ]
   },
   "1990s": {
      "text": [
         "In 1990 MCA Records released the Wild Kingdom debut, ...And You? written and produced by Andy Shernoff, though they were now billed as Manitoba's Wild Kingdom to avoid a lawsuit from the TV show Wild Kingdom. By this time Rey had left the group and had been replaced by Friedman (the group was rounded out by drummer J.P. Patterson).  ...And You? - a brief 25 minutes in length - received excellent reviews, with Rolling Stone calling it \"the first great punk rock album of the '90s.\"\n",
         "The ...And You? album cover was a source of some controversy, since it was lifted from a World War II Nazi recruiting poster.  It was not the first time members of the band (most of whom were Jewish) had been associated with charges of this sort since Go Girl Crazy had featured the songs \"Master Race Rock\" and \"Back to Africa.\"\n",
         "By the 1990s, much about the lives of the band's members had changed markedly.\n",
         "Shernoff recorded and toured with The Fleshtones in 1989 and 1990, wrote and recorded with The Ramones, became a successful record producer and worked as a sommelier.\nManitoba opened an East-Village bar called Manitoba's in 1999.\nKempner had developed a certain degree of respect from roots-rock audiences due to his 1980s work with The Del-Lords. In 1992 he released his highly acclaimed solo album Tenement Angels and joined The Brandos in 1993.\nFriedman's work with Manowar and Brain Surgeons had given him a certain cachet with heavy metal audiences.\n",
         "However, the group - first with Frank Funaro on drums, then again with Patterson - began recording a new Dictators album written and produced by Andy Shernoff in the late 1990s, which was eventually released as D.F.F.D. in 2001. Allmusic called the album a \"non-stop barrage of spitfire precision rock. The material is, unbelievably, their best and most consistent ever for an album\".[6]\n"
      ]
   },
   "2000s": {
      "text": [
         "The Dictators continued to perform to a devoted audience releasing a live album, Viva Dictators in 2005, produced by Shernoff.  In 2007, they compiled an album of demos, rarities, and unreleased songs which were recorded at various times over their thirty-plus year career called Every Day Is Saturday on Norton Records. The title was a line in the song \"Weekend\" from the band's first album The Dictators Go Girl Crazy.\n",
         "Shernoff formed The Master Plan releasing Colossus of Destiny on Alive-Total Energy Records in 2003 and Maximum Respect on Green Mist Records in 2011.\n",
         "Manitoba sang with the surviving members of the MC5 and worked as a DJ in Little Steven's Underground Garage on Sirius XM Radio, till he was fired, then re-hired to work on Steven's station, which did not work out, January, 2018.[7]\n",
         "In October 2006, the band (Manitoba, Shernoff, Friedman, Patterson, Kempner) headlined the second and third to last shows ever at the legendary NYC club CBGB. The 2nd to last show featured Blondie on the bill as well, and during the Dictators final song on the CBGB stage, they were joined by Tommy Ramone, the last surviving original member of The Ramones for a rendition of the Ramones song \"Blitzkrieg Bop\".\n",
         "In November 2007, Manitoba, along with author Amy Wallace, put out The Official Punk Rock Book of Lists on BackBeat Books, a small book company owned by Hal Leonard Publishing.\n",
         "Manitoba's Wild Kingdom reunited in May 2008 to play at the Joey Ramone Birthday Bash at The Fillmore New York at Irving Plaza, with a lineup featuring Manitoba, Shernoff, Friedman and Patterson.[8]\n",
         "In July 2008, Kempner released his well-received second solo album Saving Grace . In October 2008, The Dictators reunited for a series of four concerts in Spain.\n",
         "Ross The Boss released his debut solo album, New Metal Leader, in August 2008. He and his band have released their second album Hailstorm in 2010.\n",
         "Patterson released his second album, entitled The LP Is Dead, in November 2009 via No Fun Records.\n"
      ]
   },
   "2010s": {
      "text": [
         "Kempner and the rest of The Del-Lords re-united in early 2010 for a successful tour of Spain.  They are currently working on an album of all new material. Kempner's first solo album, Tenement Angels, was released on March 1, 2011 on GB Music. The release is on CD (remastered with a bonus track) and on vinyl. The LP is a limited edition on 500, and comes with a digital download and a hand signed poster by Kempner.\n",
         "Shernoff released his first solo EP \"Don't Fade Away\" on Yazoo Squelch Records in 2012. Critic Mark Deming wrote \"the man is still writing excellent songs and singing them straight from the heart, which is what his best work has always been about, and it's great news that well over three decades into his career, he's still got fresh and worthwhile things to say.\"[9] He released his second  EP \"On The First Day, Man Created God\" in 2013 again on Yazoo Squelch records. In August 2015 he released a video collaboration with  Lydia Lunch for the song \"A Good Night To Say Goodbye\".[10] Another video to celebrate Joey Ramone's 65th birthday was released on May 15, 2016.[11]\n",
         "\nFormer member Richard Teeter, who played drums for The Dictators between 1976 and 1979, died on April 10, 2012, due to complications from esophageal cancer.[12] He was 61.[13]\n",
         "In November 2015, Go Girl Crazy! received an expanded and remastered CD reissue, featuring several unreleased selections and remixes of three tunes by Andrew W.K.[14]\n",
         "On May 1, 2018, the Dictators original drummer, Stuart 'Stu Boy' King, died from pancreatic cancer.[15]\n"
      ]
   },
   "2020s": {
      "text": [
         "On May 28, 2020, Andy Shernoff announced that the Dictators were reforming to record some new material and possibly play live, with a line-up comprised by Shernoff on bass and vocals, Ross The Boss and Kempner on guitars and Albert Bouchard (formerly of Blue Oyster Cult) on drums.[16] On January 8, 2021, Shernoff announced on Facebook that a new Dictators song and video would be released on January 15th.\n"
      ]
   },
   "Discography": {
      "Compilations": {},
      "Live albums": {},
      "Studio albums": {}
   },
   "External links": {},
   "Members": {},
   "Origins": {
      "text": [
         "The band was formed in 1972 by Andy \"Adny\" Shernoff  who was attending The State University of New York at New Paltz and Ross \"The Boss\" Friedman who was playing in the local band  Total Crudd. Scott \"Top Ten\" Kempner was asked to join  and the trio rented a house in Kerhonkson, NY where they lived and rehearsed with various drummers.  The original recording line-up consisted of vocalist/bassist/songwriter Andy Shernoff, lead guitarist Ross Friedman (aka Ross Funicello), rhythm guitarist Scott Kempner, and drummer Stu Boy King. It was this line-up–along with roadie/occasional vocalist and \"Secret Weapon\" Handsome Dick Manitoba–which recorded the band's 1975 debut album, The Dictators Go Girl Crazy! for Epic Records, produced by Sandy Pearlman and Murray Krugman (best known for their work with Blue Öyster Cult).[3] The album sold poorly at the time but is now considered to be the starting point for American punk rock . Entertainment Weekly wrote \"Go Girl Crazy's junk-generation culture and smart-aleck sensibility did provide an essential blueprint for '70s punk. With its TV references and homely vocals, this ground-breaking and long-unavailable album continues to inspire underground groups everywhere.\" [4]\n",
         "Frustrated by the lack of sales, the band broke up for a few months in late 1975, but reconvened in early 1976, with bassist Mark \"The Animal\" Mendoza replacing Shernoff and Ritchie Teeter replacing King. After a few months Shernoff was persuaded to return to the group as the group's keyboardist. This line-up soon secured a contract with Asylum Records (at least partly due to the notoriety the group had developed following a well-publicized brawl between Manitoba and Wayne County)[5] and released their second album, Manifest Destiny, in 1977. The album was produced by Pearlman and Krugman with songs written by Shernoff.\n",
         "Early in 1978 Mendoza had left the band (he soon joined Twisted Sister), and Shernoff had returned to his original position on bass guitar.  It was this line-up of Manitoba, Shernoff, Friedman, Kempner, and Teeter which recorded Bloodbrothers (yet again produced by Pearlman and Krugman with songs written by Shernoff).  It was the first album to feature Manitoba as the group's vocalist on all the songs, though Bruce Springsteen–a big fan of the group to this day–can be heard counting \"1-2-1-2-3-4\" during the album's opening track, \"Faster and Louder.\"  The album's \"Baby, Let's Twist\" was a minor hit on a number of East Coast radio stations, but the lack of mainstream success caused the band to split again the following year. Shortly before the split, drummer Mel Anderson had left Twisted Sister and joined The Dictators, replacing Teeter.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Origins",
      "2 1980s",
      "3 1990s",
      "4 2000s",
      "5 2010s",
      "6 2020s",
      "7 Members",
      "8 Discography",
      "8.1 Studio albums",
      "8.2 Live albums",
      "8.3 Compilations",
      "9 References",
      "10 External links"
   ],
   "Summary": {
      "text": [
         "The Dictators are an American punk rock band formed in New York City in 1973.[1] Critic John Dougan said that they were \"one of the finest and most influential proto-punk bands to walk the earth.\"[2]\n"
      ]
   },
   "Title": "The Dictators - Wikipedia"
}