{
   "Name": "DIIV",
   "Sections": [
      "1 History",
      "1.1 2011–2013: Oshin",
      "1.2 2014–2017: Is the Is Are",
      "1.3 2018–present: Deceiver",
      "2 Band members",
      "2.1 Current members",
      "2.2 Former members",
      "2.3 Timeline",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Singles",
      "4 Music videos",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "DIIV is an American rock band from Brooklyn, New York City, formed in 2011. The band consists of Zachary Cole Smith (vocals, guitar), Andrew Bailey (guitar), Colin Caulfield (bass, keyboards, guitar, vocals) and Ben Newman (drums).\n",
         "Initially called Dive, the band started as Smith's solo recording project. After releasing three singles—\"Sometime\", \"Human\" and \"Geist\"—on Captured Tracks, DIIV released its debut studio album, Oshin, on June 26, 2012.\n",
         "In 2016, the band released its second studio album, Is the Is Are, after a lengthy and troubled gestation period.[1] On October 4, 2019, DIIV's third album, Deceiver, was released on Captured Tracks.[2]\n"
      ]
   },
   "History": {
      "2011–2013: Oshin": {
         "text": [
            "After a few years playing guitar with the psych-rock band Soft Black and playing drums for Beach Fossils, Zachary Cole Smith formed DIIV in 2011 as a forum for his own songs. He enlisted childhood friend Andrew Bailey (like Smith, from Connecticut) on guitar, bassist Devin Ruben Perez (from New York City), and ex-Smith Westerns drummer Colby Hewitt (from California) as his live band.[3] Smith, who originally named the project \"Dive\" after the Nirvana song of the same name,[4] \nexplained to Pitchfork that \"everybody in the band is a water sign, that's kind of why the name Dive really spoke to us all.\"[5]\nSmith would eventually change the spelling of the band's name after learning of the early 1990s Belgian industrial act by that name.\n",
            "Captured Tracks signed the band and released two singles, \"Sometime\" and \"Human\", which were recorded solely by Smith and had acted as demos.[6] \nIn May 2012, the band changed their name to DIIV, according to Smith, \"out of respect for Dirk Ivens and the original Dive,\" a 1990s Belgian industrial group.[7] \n\"We’ve not been contacted by Dirk Ivens or his lawyers,\" Smith said in a press release, \"but the short of it is that I don’t really give a fuck what the band is called.\" He continued, \"I originated this project in a bedroom with no internet and didn’t know if it would ever leave the bedroom. 'DIVE', the word, was an element of what inspired the project in its genesis, but we’ve outgrown the name and its associations. The band is the same, the music is the same, the future will always be the same. A name is nothing.\"[4][8]\n",
            "DIIV's debut album, Oshin, was released on June 26, 2012.[9][10] \nIt was preceded by the single \"Geist\" in April 2012 and the music video for \"How Long Have You Known\" in May 2012.[11][12][13] \nThe songs on Oshin were influenced by krautrock, C86 bands, Nirvana and world music. \"People didn’t seem to pick up on the influence of these Malian guitar players, especially Baba Salah whose record I got at the library,\" Smith said. \"He's a huge star in Mali, but he has this one record called Borey and it was huge for me and influenced the way I experimented with melody.\"[14]\n",
            "DIIV supported English band The Vaccines on their UK tour during November 2012. DIIV also supported the Canadian duo Japandroids on their East Coast US tour in November–December 2012.\n",
            "On lists of the top 50 albums of 2012, Oshin was listed 22nd by Stereogum and 40th by Pitchfork.[15]\n",
            "In July 2013, multi-instrumentalist Colin Caulfield joined the band. Caulfield played keyboard and guitar for live shows, until late 2017, when he replaced Devin Ruben Perez on bass guitar.\n"
         ]
      },
      "2014–2017: Is the Is Are": {
         "text": [
            "While touring in support of Oshin, DIIV played several unreleased songs live, including \"Dust\", \"Loose Ends\", and \"Under the Sun\".[16] As of July 2014, Smith had written over 150 new songs since the release of Oshin.[17]\n",
            "On March 9, 2015, DIIV began recording their second album, Is the Is Are, at Strange Weather Recording Studio in Brooklyn.\n",
            "Drummer Colby Hewitt left the band in spring 2015 due to his rumored drug addiction.[18] Ben Newman, (from North Carolina, formerly of Banda Suki) who played on several \"Oshin\" tracks including \"Doused\" (credited as Ben Wolf) was added as the group's drummer in April 2015, and played on the bulk of Is the Is Are.\n",
            "On September 16, 2015, DIIV released the first single from Is the Is Are, \"Dopamine\".[19][20] They shared a second song from the album, \"Bent (Roi's Song)\", on November 4, 2015,[21] followed by \"Mire (Grant's Song)\" on November 25.[22] \"Under the Sun\" was released as a single on December 13.[23]\n",
            "Is the Is Are was released on February 5, 2016. The album debuted at number 81 on the US Billboard 200.[24] The release was followed by a February tour in Australia as part of St Jerome's Laneway Festival.[25] However, just two days prior to the release, on February 3, Smith announced he was checking in for \"long-haul\" inpatient treatment.[26] On March 26, 2016, the Liverpool venue Arts Club, which DIIV was scheduled to perform at on March 27, announced that the remainder of DIIV's European tour was canceled \"due to an urgent health issue\", which was later confirmed by DIIV's representatives.[27]\n",
            "In an interview with NME in October 2019, bassist Colin Caulfield commented on this period in the band's career, \"It definitely felt like an end point... I had tried really hard to be as supportive as possible for a long time. It was a hands up moment, it was the type of realization Cole had to come to himself. And he did, which is great.\"[28]\n",
            "This period also saw the band take part in very occasional interviews with the media, with the band remaining relatively out of the public eye more than ever. Throughout 2016-2018 DIIV released a vast selection of cover songs, with the group performing songs by Elliott Smith, Cat Power, Sparklehorse and (Sandy) Alex G and My Bloody Valentine. Later in 2017, DIIV also parted ways with bassist Devin Ruben Perez after earlier controversy arose from the revelation that Perez had posted anti-Semitic, racist, homophobic, and sexist comments on 4chan.[29]\n"
         ]
      },
      "2018–present: Deceiver": {
         "text": [
            "In the aftermath of Cole’s personal struggles, he \"finally accepted what it means to go through treatment and committed,\" emerging with a renewed focus and perspective. Getting back together with the band in Los Angeles would result in a series of firsts. This would be the first time DIIV wrote and recorded a record as a band with bassist Colin Caulfield bringing in demos, writing alongside Cole, and the entire band contributing to the songwriting process of every song.[30] In an interview, Colin explained the writing process, \"Cole and I approached writing vocal melodies the same way the band approached the instrumentals,\" says Colin. \"We threw ideas at the wall for months on end, slowly making sense of everything. It was a constant conversation about the parts we liked best versus which of them served the album best.\"[31]\n",
            "DIIV, now a four piece without Devin Ruben Perez, premiered new songs[32][33][34] while touring with Deafheaven in the fall of 2018.[35]\n",
            "Produced primarily by the band themselves along with producer Sonny Diperri (My Bloody Valentine, Nine Inch Nails), the album was recorded in Los Angeles in March 2019.[36]\n",
            "On April 26, 2019, DIIV announced that their upcoming third album would be released this year via their Instagram account.[37] On the same day, Pitchfork reported their announcement on the new album, and confirmed through a representative of DIIV, that Devin Ruben Perez had been dismissed from the band at the end of 2017.[38]\n",
            "On July 24, 2019, DIIV released their first single in over three years, \"Skin Game\"[39] and announced that their new album, Deceiver, will be released on October 4, 2019.[40] On August 22, 2019, DIIV released their second single from Deceiver, titled, \"Taker\".[41] On September 18, 2019, DIIV released their third single from Deceiver, entitled, \"Blankenship\".[42]\n",
            "Upon release, Deceiver reached number 177 on the US Billboard 200 and received critical acclaim as a drastic departure from DIIV's earlier work.[43] Many critics commented on its darker and heavier sound and lyrical themes. In his review for Q, Dave Everley praised the album, calling it \"a success as both an artistic statement and a mea culpa.\"[44] In a positive review, Jordan Bassett of NME wrote, \"Where its predecessor was airy and spaced-out, Deceiver packs some seriously heavy riffs, sliding between monster rockers and moon-eyed grunge ballads that wouldn't sound too out of place on an early Smashing Pumpkins record.\"[45]\n"
         ]
      }
   },
   "Band members": {
      "Current members": {},
      "Former members": {},
      "Timeline": {}
   },
   "Discography": {
      "Studio albums": {},
      "Singles": {
         "text": [
            "Limited singles\n"
         ]
      }
   },
   "Music videos": {},
   "References": {},
   "External links": {},
   "coreData": [
      "DIIV is an American rock band from Brooklyn, New York City, formed in 2011. The band consists of Zachary Cole Smith (vocals, guitar), Andrew Bailey (guitar), Colin Caulfield (bass, keyboards, guitar, vocals) and Ben Newman (drums).\n",
      "Initially called Dive, the band started as Smith's solo recording project. After releasing three singles—\"Sometime\", \"Human\" and \"Geist\"—on Captured Tracks, DIIV released its debut studio album, Oshin, on June 26, 2012.\n",
      "In 2016, the band released its second studio album, Is the Is Are, after a lengthy and troubled gestation period.[1] On October 4, 2019, DIIV's third album, Deceiver, was released on Captured Tracks.[2]\n",
      "After a few years playing guitar with the psych-rock band Soft Black and playing drums for Beach Fossils, Zachary Cole Smith formed DIIV in 2011 as a forum for his own songs. He enlisted childhood friend Andrew Bailey (like Smith, from Connecticut) on guitar, bassist Devin Ruben Perez (from New York City), and ex-Smith Westerns drummer Colby Hewitt (from California) as his live band.[3] Smith, who originally named the project \"Dive\" after the Nirvana song of the same name,[4] \nexplained to Pitchfork that \"everybody in the band is a water sign, that's kind of why the name Dive really spoke to us all.\"[5]\nSmith would eventually change the spelling of the band's name after learning of the early 1990s Belgian industrial act by that name.\n"
   ]
}