{
   "Name": "Envy on the Coast",
   "Sections": [
      "1 History",
      "1.1 2003–2005: Formation",
      "1.2 2006-2008: Self-titled EP and Lucy Gray",
      "1.3 2009–2010: Lowcountry",
      "1.4 2010–2014: Breakup, hiatus and new projects",
      "1.5 2016-2020: Reincarnation",
      "2 Band members",
      "2.1 Timeline",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Envy on the Coast are a post-hardcore band from Long Island, New York.[3] They released their second full length, Lowcountry, in March 2010.\n"
      ]
   },
   "History": {
      "2003–2005: Formation": {
         "text": [
            "The members of Envy on the Coast began playing together in 2003, though not under that name. Initially, Ryan Hunter replaced Brian Byrne after Brian left New York to study at Berklee College of Music. In 2005, the band recruited drummer Dan Gluszak, and played their first official show in July 2005.\n"
         ]
      },
      "2006-2008: Self-titled EP and Lucy Gray": {
         "text": [
            "The band caught the ear of producer Bryan Russell, who recorded a five-song, self-titled EP with Envy on the Coast, which was officially released on September 19, 2006, on Photo Finish Records.[4]\n",
            "Envy on the Coast spent 2006 supporting their EP on tour with Saosin, 30 Seconds to Mars,[5] and Angels and Airwaves, before retreating to Windham, NY to begin writing their first full-length record.\n",
            "Envy on the Coast's first full-length, Lucy Gray, was released in August 2007,[6] and was produced by Bryan Russell. The artwork was done by dredg bassist, Drew Roulette. The song title \"I'm Breathing...Are You Breathing Too?\" is taking from a line of Robert Bolt's play A Man For All Seasons. The song title \"...Because All Suffering Is Sweet to Me\" is taken from the last words of Saint Therese. The album title itself is from the poem \"Lucy Gray\" by William Wordsworth. Envy on the Coast released two music videos from the album for the songs \"Sugar Skulls\" and \"Mirrors\", both directed by Travis Kopach.\n",
            "In the spring of 2007, Envy on the Coast took part in the first Alternative Press Tour,[7] supporting Circa Survive and As Tall as Lions.\n",
            "The band was featured in Kerrang! Magazine's July 2007 \"Your 10 New Favourite Bands\" issue. \"Lucy Gray\" was reviewed in Spin Magazine's September 2007 issue.[8]\n",
            "In November 2007, Envy on the Coast was forced to cancel their tour with From First To Last, and several college dates after lead singer Ryan Hunter's vocal problems worsened, and he needed time for treatment. However, instead of cancelling their hometown show on Long Island, the band took the stage without Ryan, and had the audience sing their set for them. The band quickly resumed touring once Ryan was healed, with a 5-date holiday tour at the end of December 2007 with Anthony Green.[9]\n",
            "On May 2, 2008, Envy On the Coast, supported one of the last The Receiving End Of Sirens shows.[10]\n"
         ]
      },
      "2009–2010: Lowcountry": {
         "text": [
            "In February 2009, Envy on the Coast announced that they parted ways with their drummer, Dan Gluszak.[11] The band enlisted Sean Beavan (Nine Inch Nails, Marilyn Manson, David Bowie) to produce their follow up to Lucy Gray, which they recorded at Red Bull Studios in Santa Monica. The band returned to NY to record a few more songs for the record, one of which was the bonus track, “Clean of You”, which was produced by Mike Sapone. In preparation for the release of their record, the band toured throughout 2009, doing scattered dates as well as multiple tours with Taking Back Sunday.[12] The band received help on the drums from an array of players like Joe Zizzo (Sky Ferreria, Bob Moses, The Sleeping) and Matt Fazzi (Taking Back Sunday, Happy Body Slow Brain) before eventually finding a permanent fixture in Doug Rogells, via a YouTube audition.[13] Justin Beck (Glassjaw) designed the cover art for Lowcountry. In March 2010, they toured alongside The Fall of Troy and Twin Atlantic on the \"Marked Men of 2010\" tour.[14]\n",
            "Released in January 2009, a photography book, Southern Comfort, authored and published by Emily Driskill, a Gold Record winning photographer, illustrated tour life with Envy on the Coast.[15]\n"
         ]
      },
      "2010–2014: Breakup, hiatus and new projects": {
         "text": [
            "On July 12, 2010, the band announced via their Facebook page that they would no longer be playing together and continuing Envy on the Coast in its current form.[16] Bossio and Velardi stated that they were no longer happy being a part of the band and left for other pursuits. Hunter and Byrne decided to move on to other endeavors rather than find musicians to replace Bossio and Velardi.\n",
            "Envy on the Coast played three farewell shows on August 25, 2010 in Boston, MA at The Middle East, August 27, 2010 in Philadelphia, PA at The First Unitarian Church, and August 29, 2010 in New York, NY at Irving Plaza.\n",
            "On April 4, 2011 Brian Byrne and Ryan Hunter released “Basement Tapes #1”, their first EP with their new project, North Korea, which featured Billy Rymer (Dillinger Escape Plan) on drums. They followed up with “Basement Tapes #2” on February 21, 2012.[17] Both EPs were offered as free downloads.\n",
            "On August 10, 2012 Ryan Hunter released a 5-song EP entitled “Rough Drafts” under the name Quiett Dog, his first solo endeavor.[18]\n",
            "In 2013, North Korea (now going by the name NK), released their first full length, “Nothing to be Gained Here” via Triple Crown Records on May 21, 2013.[19] The album was produced by Mike Sapone and Ryan Hunter.\n",
            "Sal Bossio and Dan Gluszak went on to form Heavy English, and released their first single “21 Flights” on July 30, 2013.[20]\n",
            "In December 2015, Ryan Hunter released a new project, 1ST VOWS. The Red EP was released on April 7, 2015, which was followed by The Green EP on December 11, 2015.[21]\n",
            "On July 28, 2016 Brian Byrne released his new project, “The Hand that Wields It”, with a 4-song self-titled EP which he produced. One of the songs, \"Inertia\", features a guest vocal from Hunter.\n"
         ]
      },
      "2016-2020: Reincarnation": {
         "text": [
            "On April 4, 2016, Ryan and Brian performed \"Gift of Paralysis\" and \"Like I Do\" as an encore at a 1ST VOWS show at Webster Hall, marking the first time they performed EOTC songs in over six years.\n",
            "On May 17, 2016, Envy on the Coast officially announced a reincarnation tour via Facebook.[22]\n",
            "Following the announcement, a statement from Salvatore Bossio was posted on Sal's personal Facebook page, which revealed that he and Jeremy Velardi would not be a part of the shows, nor would original drummer, Dan Gluszak. The post claimed that there was a discussion to reunite with all original members, but \"reuniting to do shows was collectively discussed at length, though we were unable to reach a unanimous decision about how exactly we would move forward, if at all.\"[23] Hunter and Byrne responded to Bossio's statement via an interview with Alternative Press,[24] verifying that it was conversations over songs that the other members wanted to omit, as well as other disagreements over the capacity in which they were to reunite that ultimately left Byrne and Hunter with the decision to move forward without them.\n",
            "For the shows, the band enlisted Doug Rogells who played drums on the brief Lowcountry tour cycle and farewell shows, Gray Robertson, and Dan Ellis.\n",
            "On January 20, 2017, Envy On the Coast announced their first headlining tour of 2017, including a performance at So What? Music Festival, celebrating the 10 year anniversary of Lucy Gray and alluded to an upcoming release within the year.[25]\n",
            "In June 2017, Envy on the Coast released the 'Ritual' EP, their first release in seven years.\n",
            "In May 2019, Envy on the Coast released \"Alive After All\", a 26-song live record which contains performances of Lucy Gray and Lowcountry in their entirety. The album was recorded and mixed by Ryan John.\n",
            "In June 2019, Brian Byrne and Ryan Hunter announced their new project, Violent Joy, and released \"Indian Summer\", their first single. Their EP featuring \"Indian Summer\" was released January 2020.\n",
            "On February 17, 2020 the official Twitter page announced a tour with The Receiving End of Sirens.[26]\n"
         ]
      }
   },
   "Band members": {
      "Timeline": {}
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Envy on the Coast are a post-hardcore band from Long Island, New York.[3] They released their second full length, Lowcountry, in March 2010.\n",
      "The members of Envy on the Coast began playing together in 2003, though not under that name. Initially, Ryan Hunter replaced Brian Byrne after Brian left New York to study at Berklee College of Music. In 2005, the band recruited drummer Dan Gluszak, and played their first official show in July 2005.\n",
      "The band caught the ear of producer Bryan Russell, who recorded a five-song, self-titled EP with Envy on the Coast, which was officially released on September 19, 2006, on Photo Finish Records.[4]\n",
      "Envy on the Coast spent 2006 supporting their EP on tour with Saosin, 30 Seconds to Mars,[5] and Angels and Airwaves, before retreating to Windham, NY to begin writing their first full-length record.\n"
   ]
}