{
   "Discography": {
      "EPs": {},
      "Miscellaneous": {
         "text": [
            "9. Full Blown Chaos - No Others\n",
            "8. Full Blown Chaos - Solemn Promise\n",
            "6. Full Blown Chaos - Sentenced\n",
            "30. Full Blown Chaos - Solemn Promise\n",
            "3. Full Blown Chaos - Chopping Block\n"
         ]
      },
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Full Blown Chaos self-released their first EP in 2001, with the lineup of Joe White (vocals), Mike Facci (guitar), Ed Conroy (bass), and Jeff Facci (drums), on Conroy's Jailhouse Records label. It is considered one of their best releases by the underground hardcore community. With White on vocals, the EP represented the band in their prime and set the foundation for the band's style. By the time they released their second EP, Prophet of Hostility, on Hatebreed frontman Jamey Jasta's Stillborn Records, White was replaced by new vocalist Ray Mazzola who was the co-vocalist for 36 Deadly Fists, a hardcore outfit out of Queens, New York.\n",
         "On October 19, 2004, Full Blown Chaos released Wake the Demons and have since toured with such acts as Hatebreed,[1] Terror, Sick of It All, Madball, Himsa, Napalm Death and many others. Wake the Demons was described as \"songs of inner-strength, backed with riffage that hug hairpin turns and a dynamite-triggering rhythm section.\"\n",
         "In 2006, Full Blown Chaos released their follow up, Within the Grasp of Titans with Eric Rachel on producer/engineer duties. The theme of songs of inner-strength was present on this album as well. They also joined the Ozzfest 2006 tour during the summer.\n",
         "On June 8, 2007, Full Blown Chaos announced a new deal with Ferret Music, and their first offering with the label, Heavy Lies the Crown, was released August 21, 2007.\n",
         "Full blown Chaos has played the New England Metal and Hardcore Festival in 2003, 2004, 2005, 2006, and 2008. They have also released several compilation albums with bands such as Agnostic Front, Dog Eat Dog and Son of Skam.[1]\n"
      ]
   },
   "Members": {},
   "References": {},
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 EPs",
      "3.3 Miscellaneous",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Full Blown Chaos is a metalcore band from Floral Park, Queens, New York. According to the band, their whole direction \"is to keep a wide range of music, not to necessarily pigeonhole ourselves into metal or hardcore\".[citation needed] They are well respected in the New York scene, and are generally considered to be a part of the New York Hardcore movement.\n"
      ]
   },
   "Title": "Full Blown Chaos - Wikipedia"
}