{
   "Name": "Fun Lovin' Criminals",
   "rawData": [
      "Fun Lovin' Criminals are a band from New York City. Their musical style is eclectic, covering styles such as hip hop, rock, blues, jazz, R&B, punk, and funk. They are best known for their hit \"Scooby Snacks\", which features samples from films by Quentin Tarantino, and the song \"Love Unlimited\", which recalls Barry White's backing vocal group. Their songs often focus on life in New York City, as well as urban life in general. Their lyrics can be gritty or existentialist in nature, touching on topics such as organized crime and urban violence, but they are just as often humorous or satirical. The band gained a large following internationally, notably in north-west Europe, around the release of their first two albums in the late 1990s.\n",
      "The band was formed in 1993 by Huey Morgan, Brian \"Fast\" Leiser and Steve Borgovini after Leiser, who was already friends with Borgovini, met Morgan at the club where they both worked. They started playing together and would provide the entertainment for the club when a booked act failed to show up. It was during one of these stand-in gigs that they came to the attention of EMI and they were offered a record deal.\n",
      "Come Find Yourself, the band's first album, was released in the summer of 1996 by Chrysalis Records and followed their single \"The Grave And The Constant\" (UK No. 72), which was released a month earlier, into the UK charts. The album also featured the UK Top 40 hits, \"Scooby Snacks\" (UK No. 22), \"The Fun Lovin' Criminal\" (UK No. 26) and \"King Of New York\" (UK No. 28). The subject of latter touched on the imprisonment of Italian-American mafioso John Gotti, the wannabe gangsters emulating his style, and his fans and followers in his community that maintained his innocence. The biggest hit, \"Scooby Snacks\", features samples from films by Quentin Tarantino and a guitar sample from Tones On Tail song \"Movement of Fear\", interspersed with rap verses and a sung, anthemic, chorus. Come Find Yourself had a slow rise up the UK Albums Chart, finally peaking at No. 7 and spending well over a year in the chart, however it failed to make any impact in the US. The success of the album prompted the re-release of \"Scooby Snacks\" as a single, alongside a cover of the 10cc classic \"I'm Not In Love\", which this time reached UK No. 12.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, United States"
      ],
      "Genres": [
         "Alternative rock[1]",
         "hip hop[1]",
         "jazz rap",
         "punk rock[2]",
         "funk[3]",
         "blues[3][4]",
         "mafioso rap[5][6][7][8][9][10]"
      ],
      "Years active": [
         "1993–present"
      ],
      "Labels": [
         "Silver Spotlight, EMI USA, Chrysalis, Virgin, Capitol, DiFontaine, Sanctuary"
      ],
      "Associated acts": [
         "Huey and the New Yorkers, Radio Riddler, Cro-Mags"
      ],
      "Website": [
         "http://www.funlovincriminals.co"
      ],
      "Members": [
         "Huey Morgan",
         "Brian Leiser",
         "Frank Benbini"
      ],
      "Past members": [
         "Steve Borgovini",
         "Maxwell Jayson"
      ]
   },
   "albums": [
      "Come Find Yourself",
      "100% Colombian",
      "Loco",
      "Welcome to Poppy's",
      "Livin' in the City",
      "Classic Fantastic"
   ],
   "prunedData": [
      "[BAND_NAME] are a band from New York City. Their musical style is eclectic, covering styles such as hip hop, rock, blues, jazz, R&B, punk, and funk. They are best known for their hit [SONG_NAME], which recalls [PERSON_NAME_FULL_1_MALE]'s backing vocal group. Their songs often focus on life in New York City, as well as urban life in general. Their lyrics can be gritty or existentialist in nature, touching on topics such as organized crime and urban violence, but they are just as often humorous or satirical. The band gained a large following internationally, notably in north-west Europe, around the release of their first two albums in the late [YEAR]s.\n",
      "The band was formed in [YEAR] by Huey Morgan, Brian [SONG_NAME] Leiser and [PERSON_NAME_FULL_0_MALE] after Leiser, who was already friends with [PERSON_NAME_LAST_0], met Morgan at the club where they both worked. They started playing together and would provide the entertainment for the club when a [GENRE] a record deal.\n",
      "Come Find Yourself, the band's first album, was released in the summer of [YEAR] by Chrysalis Records and followed their single [SONG_NAME], which this time reached UK No. 12.\n"
   ]
}