{
   "Name": "The Ghost of a Saber Tooth Tiger",
   "Sections": [
      "1 History",
      "1.1 Jardin Du Luxembourg",
      "1.2 Acoustic Sessions",
      "1.2.1 Reception",
      "1.3 La Carotte Bleue",
      "1.4 Midnight Sun",
      "1.4.1 Composition",
      "1.4.2 Production",
      "1.4.3 Additional notes",
      "1.4.4 Midnight Sun Tour",
      "2 Charity",
      "3 Discography",
      "4 Media response",
      "5 Interviews",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "The Ghost of a Saber Tooth Tiger is an American band formed in 2008 by Sean Lennon and Charlotte Kemp Muhl. The couple have stated that they started the band as a way to spend more time together, and while they released a number of recordings and went on tours as a duo, they consider Midnight Sun, released in April 2014, their first real record. Their tour to support the release of the album in May and June 2014 included opening for Beck as he started the East Coast leg of his tour that year.\n"
      ]
   },
   "History": {
      "Jardin Du Luxembourg": {
         "text": [
            "Grammy Award winning record producer Mark Ronson collaborated with The Ghost of a Saber Tooth Tiger to produce a single in 2010: Jardin Du Luxembourg backed with Comic Strip.[citation needed]\n"
         ]
      },
      "Acoustic Sessions": {
         "Reception": {
            "text": [
               "Acoustic Sessions was released to generally positive reviews: In October 2010, the Canadian publication The Globe and Mail rated Acoustic Sessions  its Disc of the Week: \"The album charms like a countryside circus. You wonder if the Hendersons will all be there, late of Pablo Fanque’s fair – what a scene, you bet.\"[5] In the November 2010 issue of Rolling Stone a reviewer described their sound as \"sunny\" and psychedelic, and gave it a rating of 3.5 stars out of 5.[6] A reviewer for NPR had the following to say about Acoustic Sessions: \"Listening to Acoustic Sessions is like stepping into a magical world where a smiling sun shines on fields of dancing flowers while winged creatures flit about in the fragrant air.\"[7]\n"
            ]
         },
         "text": [
            "Acoustic Sessions, was released in late October 2010 through their own label, Chimera Music, and was recorded in their own home studio.[4]' Lennon told Spinner that it's supposed to convey to listeners the idea of hearing them alone in a living room: \"It's almost rough sounding, but hopefully in a charming way. It's mostly acoustic guitar, some piano, some vibraphone.\"[4]\n"
         ]
      },
      "La Carotte Bleue": {
         "text": [
            "La Carotte Bleue was available at  live shows and on their website. It featured a more electronic sound than their previous album and included many re-workings of songs from Acoustic Sessions. Both tracks from the Jardin Du Luxembourg single were also included on this release.\n"
         ]
      },
      "Midnight Sun": {
         "Composition": {
            "text": [
               "A substantially more electrified album than their previous efforts but with a wide range of styles within its dozen songs, Midnight Sun is a unique, diverse album that is both retro and forward leaning, with clear psychedelic rock and neo-psychedelia influences that fans and critics have pointed to including the Beatles during their pre and post Sgt. Pepper's Lonely Hearts Club Band period, the Rolling Stones'  Their Satanic Majesties Request, as well as Pink Floyd, Led Zeppelin, and, because of their harmonies, the Beach Boys, as well as contemporary artists such as Beck, Flaming Lips and Tame Impala. In a 2014 interview, Kemp Muhl cited Jimi Hendrix, Syd Barrett and Bach as influences.[17] In an interview with the Boston Herald in June 2014, Lennon stated \"It’s easy to hear influences like the Beatles and Pink Floyd, but honestly we’re inspired by more than what you’d expect,” Lennon said. “Miles Davis, Stravinsky, film and narrative play a role. A lot of people hear that it’s a psychedelic record and think it sounds like ’67 to ’70. To some degree, that’s true, but there’s more to it.\"[18]\n"
            ]
         },
         "Production": {
            "text": [
               "Recorded at The Farm in Delaware County, New York by Matthew Cullen and Andris Balins, Kemp Muhl stated in an interview[19] to support the album: “Midnight Sun we consider our first real record, it's the one we spent the most time on. We brought in Dave Fridmann (Tame Impala, Flaming Lips, Mercury Rev, MGMT) to mix it and that made a huge difference. Everything else we did ourselves.”\n",
               "Eleven of the twelve songs on the album were produced by The GOASTT, with the exception of Johanessburg, which was produced by Mark Ronson. Kemp Muhl indicated in the  same interview with the Vancouver Courier,[19] that she and Lennon played the majority of the instruments and she played the bass, keyboards and some guitar, but they brought the new band members in for some overdubs.\n",
               "All vocals on the album are by Lennon and Kemp Muhl and all songs written by them except Golden Earring, which was written by Evans, Livingston, and Young.\n"
            ]
         },
         "Additional notes": {},
         "Midnight Sun Tour": {
            "text": [
               "Just after the release of the album, The GOASTT embarked on a tour[26] of twenty-seven venues in the U.S. and Canada beginning May 2 and running to the Mountain Jam Festival in Hunter, NY on June 8, 2014.  This would be followed by an additional nine dates in the eastern U.S. and Canada, seven of which opened for Beck.  They continued to tour in 2015, headlining venues and eventually opening for Primus as well as Florence and the Machine\n",
               "In addition to Lennon and Kemp Muhl, The GOASTT road band includes members of the Brooklyn-based Invisible Familiars,[27] with drummer Tim Kuhl, Jared Samuel on keyboards, and Robbie Mangano on guitars.\n",
               "Review of the Denver Concert: [28]\n“Teetering between a darkly groovy psych vibe to ’70s funk to Brian Wilson-inspired vocal harmonies, the band covered a wide range of sonic territory...Lennon closed with a gorgeous rendition of the Hendrix classic “Little Wing” that sent the exuberant crowd out into warm summer night with big smiles.\"\n",
               "GOASTT often finished their sets with the Syd Barrett tune \"Long Gone\"[29] S. Victor Aaron in Something Else Reviews[30] wrote: \"The Ghost of A Saber Tooth Tiger brings the full band to bear on the song, busting out of the tune’s seams with heavy tones from guitars, Muhl’s organ and Tim Kuhl’s discriminating drums as the song descends into the metal bombast waiting at the end the chorus.\"\n"
            ]
         },
         "text": [
            "Years in development and previewed first on NPR's First Listen,[8] Midnight Sun was released on April 29, 2014 on Chimera Music and received strong critical response. A departure from their previous more acoustic efforts, critics were almost universally positive about the album, with Metacritic giving it a composite 82 rating.[9]\n",
            "“Midnight Sun positively slays,” NME's Jeremy Allen opined[10] in his 8/10 review, summarizing: “Midnight scorchio, more like.” Gregory Heaney’s four out of five star review in Allmusic[11] wrote: “With its eclectic instrumentation and crunchy production (mixed by the master himself, Dave Fridmann), Lennon and Muhl create a musical landscape where seemingly anything can happen.”  And Luke O'Neil in the Boston Globe[12] described Midnight Sun as “an accomplished, enjoyable record from start to finish, regardless of references or lineage.”\n",
            "Other reviews include:\n"
         ]
      },
      "text": [
         "The Ghost of a Saber Tooth Tiger was formed in 2008 by musician Sean Lennon and his girlfriend, musician/model Charlotte Kemp Muhl. The name of the band is from a short story written by Muhl.[1] Kemp and Lennon met in 2004 at the Coachella Music Festival. In an interview with the UK publication The Daily Telegraph, Lennon commented on their relationship: \"Charlotte hadn’t even heard \"Strawberry Fields Forever\" when I met her,\" Lennon said. \"And she knew nothing about my mum. Her parents thought I was just a delinquent, by virtue of association with the famous hippie delinquents. So it was nice because it was like a bridging of gaps and a collision of galaxies.\"[1]\n",
         "Both Lennon and Muhl are multi-instrumentalists. Among the instruments the band uses, are the guitar, drums, and also the bayan. Muhl, also a successful model,[2] has been featured in Maybelline campaigns, as well as  Jennifer Lopez's clothing brand J Lo.[3] She uses funds from her modeling work to fund her musical endeavours.[1]\n"
      ]
   },
   "Charity": {
      "text": [
         "The Ghost of a Saber Tooth Tiger played a benefit concert in August 2010, with all the proceeds going to support the Woodstock Animal Sanctuary in New York.[31]\n"
      ]
   },
   "Discography": {},
   "Media response": {
      "text": [
         "With the release of Midnight Sun in April 2014, The Ghost of a Saber Tooth Tiger received substantial media coverage in a variety of publications and online media, exploring the nature of their music, relationship and how the band connects to Lennon's musical heritage. Prior to that GOASTT appeared in a two-page spread in Vanity Fair, where they were photographed by famed French photographer Patrick Demarchelier.[32] In the article Lennon described the musical relationship with Kemp as having parallels to the relationship between his father John Lennon and writing partner Paul McCartney, and said his writing relationship with Kemp is like \"intellectual tennis\".[32]\n",
         "In Italian Vogue, a reviewer described their sound as \"soft and dreamy and evokes 60s French Pop and Folk Pops' Bohemian Gypsie atmosphere.\"[33] For the fall 2010 issue of Purple, Lennon and Kemp recreated the iconic picture of John Lennon and Yoko Ono taken by famous photographer Annie Leibovitz for the cover of Rolling Stone in 1981.[34] The picture of Kemp and Lennon was taken by photographer Terry Richardson. In Rolling Stone magazine, Lennon told interviewer Austin Scaggs about the musical dynamics of his relationship with Kemp, juxtaposed with that of John Lennon and Yoko Ono: \"They were unified as a message and a movement, but she didn't want to write songs with my dad. ... [Kemp and I] love to collaborate. We just have a chemistry.\"[35] They have also performed on Late Night with Jimmy Fallon[36] and Conan.[37]\n"
      ]
   },
   "Interviews": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Ghost of a Saber Tooth Tiger is an American band formed in 2008 by Sean Lennon and Charlotte Kemp Muhl. The couple have stated that they started the band as a way to spend more time together, and while they released a number of recordings and went on tours as a duo, they consider Midnight Sun, released in April 2014, their first real record. Their tour to support the release of the album in May and June 2014 included opening for Beck as he started the East Coast leg of his tour that year.\n",
      "The Ghost of a Saber Tooth Tiger was formed in 2008 by musician Sean Lennon and his girlfriend, musician/model Charlotte Kemp Muhl. The name of the band is from a short story written by Muhl.[1] Kemp and Lennon met in 2004 at the Coachella Music Festival. In an interview with the UK publication The Daily Telegraph, Lennon commented on their relationship: \"Charlotte hadn’t even heard \"Strawberry Fields Forever\" when I met her,\" Lennon said. \"And she knew nothing about my mum. Her parents thought I was just a delinquent, by virtue of association with the famous hippie delinquents. So it was nice because it was like a bridging of gaps and a collision of galaxies.\"[1]\n",
      "Both Lennon and Muhl are multi-instrumentalists. Among the instruments the band uses, are the guitar, drums, and also the bayan. Muhl, also a successful model,[2] has been featured in Maybelline campaigns, as well as  Jennifer Lopez's clothing brand J Lo.[3] She uses funds from her modeling work to fund her musical endeavours.[1]\n",
      "Grammy Award winning record producer Mark Ronson collaborated with The Ghost of a Saber Tooth Tiger to produce a single in 2010: Jardin Du Luxembourg backed with Comic Strip.[citation needed]\n"
   ],
   "infobox": {
      "Also known as": [
         "GOASTT"
      ],
      "Origin": [
         "New York City, United States"
      ],
      "Genres": [
         "Folk, avant-garde, psychedelic pop"
      ],
      "Years active": [
         "2008–present"
      ],
      "Labels": [
         "Chimera Music"
      ],
      "Associated acts": [
         "Mark Ronson, Plastic Ono Band, Jordan Galland, Cibo Matto, Beck"
      ],
      "Website": [
         "theghostofasabertoothtiger.com"
      ],
      "Members": [
         "Sean Lennon",
         "Charlotte Kemp Muhl"
      ]
   }
}