{
   "Name": "The Ghost of a Saber Tooth Tiger",
   "rawData": [
      "The Ghost of a Saber Tooth Tiger is an American band formed in 2008 by Sean Lennon and Charlotte Kemp Muhl. The couple have stated that they started the band as a way to spend more time together, and while they released a number of recordings and went on tours as a duo, they consider Midnight Sun, released in April 2014, their first real record. Their tour to support the release of the album in May and June 2014 included opening for Beck as he started the East Coast leg of his tour that year.\n",
      "The Ghost of a Saber Tooth Tiger was formed in 2008 by musician Sean Lennon and his girlfriend, musician/model Charlotte Kemp Muhl. The name of the band is from a short story written by Muhl. Kemp and Lennon met in 2004 at the Coachella Music Festival. In an interview with the UK publication The Daily Telegraph, Lennon commented on their relationship: \"Charlotte hadn’t even heard \"Strawberry Fields Forever\" when I met her,\" Lennon said. \"And she knew nothing about my mum. Her parents thought I was just a delinquent, by virtue of association with the famous hippie delinquents. So it was nice because it was like a bridging of gaps and a collision of galaxies.\"\n",
      "Both Lennon and Muhl are multi-instrumentalists. Among the instruments the band uses, are the guitar, drums, and also the bayan. Muhl, also a successful model, has been featured in Maybelline campaigns, as well as  Jennifer Lopez's clothing brand J Lo. She uses funds from her modeling work to fund her musical endeavours.\n"
   ],
   "infobox": {
      "Also known as": [
         "GOASTT"
      ],
      "Origin": [
         "New York City, United States"
      ],
      "Genres": [
         "Folk, avant-garde, psychedelic pop"
      ],
      "Years active": [
         "2008–present"
      ],
      "Labels": [
         "Chimera Music"
      ],
      "Associated acts": [
         "Mark Ronson, Plastic Ono Band, Jordan Galland, Cibo Matto, Beck"
      ],
      "Website": [
         "theghostofasabertoothtiger.com"
      ],
      "Members": [
         "Sean Lennon",
         "Charlotte Kemp Muhl"
      ]
   }
}