{
   "Name": "Death Angel",
   "rawData": [
      "Death Angel is an American thrash metal band from Daly City, California, initially active from 1982 to 1991 and again since 2001. Death Angel has released nine studio albums, two demo tapes, one box set and two live albums. The band has gone through several line-up changes, leaving guitarist Rob Cavestany as the only constant member; he and vocalist Mark Osegueda (who joined the group in 1984) are the only members of Death Angel to appear on all of their studio albums.\n",
      "Death Angel is often referred to as one of the key bands in the Bay Area thrash metal movement of the 1980s, and secured opening slots at club venues that decade, including opening for their peers Megadeth, Metallica, Slayer, Exodus, Testament, Overkill, D.R.I., Mercyful Fate and Possessed. They are also often credited as one of the leaders of the second wave of thrash metal movement from the 1980s, and considered to be one of the \"big eight\" of the genre (along with Metallica, Megadeth, Slayer, Anthrax, Testament, Exodus and Overkill). Following the underground success of their first two studio albums, The Ultra-Violence (1987) and Frolic Through the Park (1988), Death Angel signed to Geffen Records in 1989, and released their only album for the label, Act III, the following year. While they were touring in support of Act III, then-drummer Andy Galeon was injured in a tour bus accident and needed more than a year to fully recover. This resulted in the band's break up in 1991. However, Death Angel reformed in 2001 (without original rhythm guitarist Gus Pepa) at the Thrash of the Titans benefit concert for Testament singer Chuck Billy. The band has since released six more albums, including Humanicide (2019), to which the title track gave Death Angel their first-ever Grammy Award nomination.\n",
      "Death Angel was formed in the San Francisco Bay Area, California, in 1982 by cousins Rob Cavestany (lead guitar, backing vocals), Dennis Pepa (lead vocals, bass), Gus Pepa (rhythm guitar), and Andy Galeon (drums) -- all of Filipino descent. After considering a number of different names for the band, including Dark Fury, Cavestany and D. Pepa settled on the name Death Angel after coming across a book by that title in a book store. In 1983, the band released their first demo, Heavy Metal Insanity, with Matt Wallace serving as producer. According to Mark Osegueda, the group was then \"more like a metal band, more like Iron Maiden, Tygers of Pan Tang and stuff like that\", as the so-called Bay Area thrash movement was only just beginning to rise to prominence at the time and make its influence felt.  Osegueda, a second cousin of the other four members who had been working as their roadie, became the group's lead vocalist in 1984 and performed his first show with the band on a bill with Megadeth in April of that year (at one of the four Megadeth gigs to feature Kerry King on guitars).\n"
   ],
   "infobox": {
      "Also known as": [
         "Dark Theory (1982)"
      ],
      "Origin": [
         "San Francisco Bay Area, California, U.S."
      ],
      "Genres": [
         "Thrash metal[1]",
         "funk metal[2]"
      ],
      "Years active": [
         "1982–1991",
         "2001–present"
      ],
      "Labels": [
         "Enigma",
         "Geffen",
         "Nuclear Blast"
      ],
      "Associated acts": [
         "Big Shrimp",
         "The Organization",
         "Swarm"
      ],
      "Website": [
         "Official site"
      ],
      "Members": [
         "Rob Cavestany",
         "Mark Osegueda",
         "Ted Aguilar",
         "Will Carroll",
         "Damien Sisson"
      ],
      "Past members": [
         "Dennis Pepa",
         "Gus Pepa",
         "Andy Galeon",
         "Chris Kontos",
         "Sammy Diosdado"
      ]
   },
   "albums": [
      "The Ultra-Violence",
      "Frolic Through the Park",
      "Act III",
      "The Art of Dying",
      "Killing Season",
      "Relentless Retribution",
      "The Dream Calls for Blood",
      "The Evil Divide",
      "Humanicide"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Daly City, California, initially active from [YEAR] to [YEAR] and again since [YEAR]. [BAND_NAME] has released nine studio albums, two demo tapes, one box set and two live albums. The band has gone through several line-up changes, leaving guitarist [PERSON_NAME_FULL_0_MALE] as the only constant member; he and vocalist [MONTH]k Osegueda (who joined the group in [YEAR]) are the only members of [BAND_NAME] to appear on all of their studio albums.\n",
      "[BAND_NAME] is often referred to as one of the key bands in the Bay Area thrash metal movement of the [YEAR]s, and secured opening slots at club venues that decade, including opening for their peers Megadeth, Metallica, Slayer, Exodus, Testament, Overkill, D.R.I., Mercyful Fate and Possessed. They are also often credited as one of the leaders of the second wave of thrash metal movement from the [YEAR]s, and considered to be one of the [SONG_NAME] of the genre (along with Metallica, Megadeth, Slayer, Anthrax, Testament, Exodus and Overkill). Following the underground success of their first two studio albums, The Ultra-Violence ([YEAR]) and Frolic Through the Park ([YEAR]), [BAND_NAME] signed to Geffen Records in [YEAR], and released their only album for the label, Act III, the following year. While they were touring in support of Act III, then-drummer [PERSON_NAME_FULL_0_MALE] was injured in a [GENRE] a year to fully recover. This resulted in the band's break up in [YEAR]. However, [BAND_NAME] reformed in [YEAR] (without original rhythm guitarist Gus Pepa) at the Thrash of the Titans benefit concert for Testament singer [PERSON_NAME_FULL_1_MALE]. The band has since released six more albums, including Humanicide ([YEAR]), to which the title track gave [BAND_NAME] their first-ever Grammy Award nomination.\n",
      "[BAND_NAME] was formed in the San Francisco Bay Area, California, in [YEAR] by cousins Rob Cavestany (lead guitar, backing vocals), [PERSON_NAME_FULL_2_MALE] (lead vocals, bass), Gus [PERSON_NAME_LAST_2] (rhythm guitar), and [PERSON_NAME_FULL_0_MALE] (drums) -- all of Filipino descent. After considering a [GENRE] band, including Dark Fury, Cavestany and D. [PERSON_NAME_LAST_2] settled on the name [BAND_NAME] after coming across a book by that title in a book store. In [YEAR], the band released their first demo, Heavy Metal Insanity, with Matt Wallace serving as producer. According to [MONTH]k Osegueda, the group was then [SONG_NAME], as the so-called Bay Area thrash movement was only just beginning to rise to prominence at the time and make its influence felt.  Osegueda, a second cousin of the other four members who had been working as their roadie, became the group's lead vocalist in [YEAR] and performed his first show with the band on a bill with Megadeth in [MONTH] of that year (at one of the four Megadeth gigs to feature [PERSON_NAME_FULL_1_FEMALE] on guitars).\n"
   ]
}