{
   "Name": "Glassjaw",
   "rawData": [
      "Glassjaw is an American post-hardcore band from Hempstead, New York. The band is fronted by vocalist Daryl Palumbo and guitarist Justin Beck, and was a major part of the Long Island music scene in the early 2000s. The band has been influential in the progression of the underground music scene in the eastern United States and United Kingdom and on the post-hardcore genre, and are known for their intense live shows and frequent line-up changes.\n",
      "The band formed in the summer of 1993 after Palumbo and Beck met each other at camp. Of the band name, Beck has said: \"We had a list of names, and we were just like, let's pick one of these band names which ones the coolest. At the time there were a bunch of bands coming out with two names in one like that, like mouthpiece, curbjaw, stuff like that. We were going down the list, and the first name that I liked was Swiftkick. I'm all like, that’s a sick name. But for some reason Glassjaw stuck. There's really no reason behind it; it just sounded cool.\" The band played their first show in 1994 in Oceanside, NY. In the early days, Beck and Weinstock were also playing with Jewish straight edge metalcore band, Sons of Abraham. Sons of Abraham constitute an important influence on Glassjaw, songs such as \"Hurting and Shoving (She Should Have Let Me Sleep)\" by Glassjaw drawing particularly on earlier Sons of Abraham releases. Palumbo was in his own straight-edge band called XbustedX. The group's line-up changed constantly in their early years while they played in the local New York hardcore scene. Beck's primary instrument throughout this time was drums, but switched to bass guitar when Ariel Telford left the band in 1998, and then switched to lead guitar when Kris Baldwin left and Manuel Carrero joined the band in 1999. From 1994-1999 the band did several demo recordings of some songs that would eventually appear on their official releases, as well as several other compositions that would not see official release. The band recorded the five-song Kiss Kiss Bang Bang EP in 1997. The record was released independently on the label 2 Cents a Pop, and saw a re-release in 2001 without label affiliation.  The line-up on this record was Daryl Palumbo, Justin Beck, Todd Weinstock, Kris Baldwin and Ariel Telford. \"Star Above My Bed\", from the EP, is still in the band's set lists to this day. A significant recording came in 1999 working with Don Fury (Quicksand, Snapcase, Orange 9mm, The Hearing Aides), showcasing songs that appeared on their debut LP Everything You Ever Wanted to Know About Silence.\n",
      "In 1999, the band entered the studio at Indigo Ranch in Malibu, California, with producer Ross Robinson (At the Drive-In, Korn, Limp Bizkit, Slipknot, among others) to record their first full-length album titled Everything You Ever Wanted to Know About Silence, which saw release in 2000 through Roadrunner Records. On being signed, guitarist Justin Beck said: \"Ross showed up at a practice, we start a song; 5-4-3-2-1. Ross stands up, waving his hands and he's like, 'It's over, it's done. I want to do this, you've got a deal!' The line-up on this record was Palumbo, Beck, Todd Weinstock, Manuel Carrero & Sammy Siegler (who left the band prior to the subsequent tour). Robinson has said of it: \"Our goal at the time of that record was to destroy Adidas rock\", a self-deprecating reference to the Adidas-sponsored bands (Korn, Limp Bizkit) Robinson had produced and championed as part of the nu-metal movement. The music was aggressive and unrelenting, but also included spacious songs like \"When One Eight Becomes Two Zeros\", \"Her Middle Name is Boom\", \"Piano\" and the epic \"Everything You Ever Wanted to Know About Silence\", the latter of which deals with Palumbo's problems with Crohn's disease. The music, accompanied with Palumbo's lyrics—which were often bitter and resentful towards particular characters he was discussing—and his singing style in itself—powerful and aggressive guttural screaming along with a melodic touch—created a unique dynamic. Although Everything You Ever Wanted to Know About Silence is often cited as a milestone post-hardcore album, it saw little push from Roadrunner, causing the band to garner an ill-will towards the label. Matters were somewhat worsened when Palumbo started to have bouts with his Crohn's disease on tour, as his aggressive performance style sometimes triggers a relapse, which has the potential to be fatal. It is alleged that Roadrunner would not allow Palumbo to leave the tour to rest.\n"
   ],
   "infobox": {
      "Origin": [
         "Hempstead, Long Island, New York, U.S."
      ],
      "Genres": [
         "Post-hardcore",
         "alternative metal",
         "nu metal"
      ],
      "Years active": [
         "1993 (1993)–2004, 2005–present"
      ],
      "Labels": [
         "Warner Bros., Roadrunner, Century Media"
      ],
      "Associated acts": [
         "Sons of Abraham, Stillsuit, Head Automatica, Color Film, The Dillinger Escape Plan, Every Time I Die, Saves the Day, United Nations, Quicksand, Orange 9mm, Men, Women & Children"
      ],
      "Website": [
         "glassjaw.com"
      ],
      "Members": [
         "Daryl Palumbo",
         "Justin Beck",
         "Chad Hasty"
      ]
   },
   "albums": [
      "Everything You Ever Wanted to Know About Silence",
      "Worship and Tribute",
      "Material Control"
   ]
}