{
   "Name": "The Heartbreakers",
   "rawData": [
      "The Heartbreakers, also known as Johnny Thunders and the Heartbreakers, were an American punk rock band, formed in New York City in 1975. The band spearheaded the first wave of punk rock.\n",
      "Johnny Thunders (vocals/guitar) and Jerry Nolan (drums) gained fame in the pioneering proto-punk band the New York Dolls. By early 1975, the Dolls were disintegrating amid poor record sales and tensions within the band, and Thunders and Nolan quit during a tour of Florida in March 1975. Coincidentally, that same week that Richard Hell (vocals/bass) left Television. After returning to New York, Thunders and Nolan invited Hell to join their new band, and Hell agreed. As Hell said, \"I was fed up with Television because it was getting so pretentious...so I thought, this is perfect - we'll make a really good rock & roll band that's dealing with interesting subjects.\" The three dubbed their new band the Heartbreakers. Their first gig was on May 30 of that year, at the Coventry, a rock club in Queens. (Tom Petty's backing band was also named the Heartbreakers, but they did not begin gigging until 1976.) The trio auditioned several candidates for a second guitarist, and soon added Walter Lure to the lineup. Lure, who had previously played with a glam-punk band called the Demons, played his first show with the Heartbreakers on July 4, 1975 at CBGB.\n",
      "The band quickly became one of the most popular and well-known underground bands in New York City, headlining shows at CBGB, Mother's (located across from the Chelsea Hotel), and Max's Kansas City. In the band's early days, each member took turns on vocals, with Hell bringing in songs (such as \"Blank Generation\") originally written for Television, and Thunders contributing new material as well. Lure began singing lead on some songs and co-writing with Nolan. The combination of the style-conscious Nolan and Thunders with the beatnik Hell and gangly Lure made for a visually arresting and musically powerful group. As Blondie's Clem Burke said, \"You could call them the punk rock Beatles. Each person really stood out.\" Although popular, the early lineup could not get a recording contract, in no small part due to the band's well-known heroin use - as vividly described in their best-known song, \"Chinese Rocks\" (which was actually written by Dee Dee Ramone with contributions from Hell). Live recordings of the Thunders/Hell/Nolan/Lure lineup were eventually released on the LP Live at Mother's, and studio demos were released in 2019.\n"
   ],
   "infobox": {
      "Also known as": [
         "Johnny Thunders and the Heartbreakers"
      ],
      "Origin": [
         "New York City, United States"
      ],
      "Genres": [
         "Rock and roll",
         "punk rock"
      ],
      "Years active": [
         "1975–1980, 1984, 1990"
      ],
      "Labels": [
         "Track; Jungle"
      ],
      "Associated acts": [
         "New York Dolls",
         "Ramones",
         "Richard Hell and the Voidoids"
      ],
      "Past members": [
         "Johnny Thunders",
         "Jerry Nolan",
         "Richard Hell",
         "Walter Lure",
         "Billy Rath",
         "Ty Stix",
         "Tony Coiro"
      ]
   },
   "albums": [
      "L.A.M.F.",
      "L.A.M.F. Revisited",
      "L.A.M.F. The Lost '77 Mixes"
   ],
   "prunedData": [
      "[BAND_NAME], also known as Johnny Thunders and the Heartbreakers, were an [GENRE] band, formed in New York City in [YEAR]. The band spearheaded the first wave of punk rock.\n",
      "Johnny Thunders (vocals/guitar) and [PERSON_NAME_FULL_1_MALE] (drums) gained fame in the pioneering proto-punk band the New York Dolls. By early [YEAR], the Dolls were disintegrating amid poor record sales and tensions within the band, and Thunders and [PERSON_NAME_LAST_1] quit during a tour of Florida in [MONTH] [YEAR]. Coincidentally, that same week that Richard Hell (vocals/bass) left Television. After returning to New York, Thunders and [PERSON_NAME_LAST_1] invited Hell to join their new band, and Hell agreed. As Hell said, [SONG_NAME] The three dubbed their new band the Heartbreakers. Their first gig was on [MONTH] 30 of that year, at the Coventry, a rock club in Queens. ([PERSON_NAME_FULL_0_MALE]'s backing band was also named the Heartbreakers, but they did not begin gigging until [YEAR].) The trio auditioned several candidates for a second guitarist, and soon added Walter Lure to the lineup. Lure, who had previously played with a glam-punk band called the Demons, played his first show with the Heartbreakers on [MONTH] 4, [YEAR] at CBGB.\n",
      "The band quickly became one of the most popular and well-known underground bands in New York City, headlining shows at CBGB, Mother's (located across from the Chelsea Hotel), and Max's Kansas City. In the band's early days, each member took turns on vocals, with Hell bringing in songs (such as [SONG_NAME] (which was actually written by [PERSON_NAME_FULL_0_FEMALE] with contributions from Hell). Live recordings of the Thunders/Hell/Nolan/Lure lineup were eventually released on the LP Live at Mother's, and studio demos were released in [YEAR].\n"
   ]
}