{
   "Name": "The Heartbreakers",
   "Sections": [
      "1 History",
      "2 Post-Heartbreakers",
      "3 Band members",
      "4 Timeline",
      "5 Discography",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "The Heartbreakers, also known as Johnny Thunders and the Heartbreakers, were an American punk rock band, formed in New York City in 1975.[1] The band spearheaded the first wave of punk rock.\n"
      ]
   },
   "History": {
      "text": [
         "Johnny Thunders (vocals/guitar) and Jerry Nolan (drums) gained fame in the pioneering proto-punk band the New York Dolls. By early 1975, the Dolls were disintegrating amid poor record sales and tensions within the band, and Thunders and Nolan quit during a tour of Florida in March 1975. Coincidentally, that same week that Richard Hell (vocals/bass) left Television. After returning to New York, Thunders and Nolan invited Hell to join their new band, and Hell agreed.[1] As Hell said, \"I was fed up with Television because it was getting so pretentious...so I thought, this is perfect - we'll make a really good rock & roll band that's dealing with interesting subjects.\"[2] The three dubbed their new band the Heartbreakers. Their first gig was on May 30 of that year, at the Coventry, a rock club in Queens.[3] (Tom Petty's backing band was also named the Heartbreakers, but they did not begin gigging until 1976.) The trio auditioned several candidates for a second guitarist, and soon added Walter Lure to the lineup. Lure, who had previously played with a glam-punk band called the Demons, played his first show with the Heartbreakers on July 4, 1975 at CBGB.[4]\n",
         "The band quickly became one of the most popular and well-known underground bands in New York City, headlining shows at CBGB, Mother's (located across from the Chelsea Hotel), and Max's Kansas City. In the band's early days, each member took turns on vocals, with Hell bringing in songs (such as \"Blank Generation\") originally written for Television, and Thunders contributing new material as well. Lure began singing lead on some songs and co-writing with Nolan. The combination of the style-conscious Nolan and Thunders with the beatnik Hell and gangly Lure made for a visually arresting and musically powerful group. As Blondie's Clem Burke said, \"You could call them the punk rock Beatles. Each person really stood out.\"[3] Although popular, the early lineup could not get a recording contract, in no small part due to the band's well-known heroin use - as vividly described in their best-known song, \"Chinese Rocks\" (which was actually written by Dee Dee Ramone with contributions from Hell). Live recordings of the Thunders/Hell/Nolan/Lure lineup were eventually released on the LP Live at Mother's,[5] and studio demos[6] were released in 2019.\n",
         "Although initially the band members shared songwriting and singing, Hell increasingly attempted to impose his will on the band. At a rehearsal in early 1976, Hell laid down an ultimatum - he would sing most of the songs in the set, with Thunders relegated to one or two songs per set. Thunders walked out, and Nolan and Lure followed; with all three united against him, Hell wound up leaving the band. His final show was on May 14, 1976 at the Rathskeller in Boston. After auditioning several bass players, the band settled on Boston transplant Billy Rath. Hell  went on to form his own band, Richard Hell and the Voidoids.[1]\n",
         "Replacing Hell with Rath solidified the Heartbreakers sound, firmly rooted in 1950's rock and rhythm 'n' blues, but with the energy, volume, and attitude of punk. Rath was a better bassist than Hell, meshing with Nolan to form a formidable rhythm section, and was also content with playing a supporting role in the band without seeking the spotlight. Now managed by Leee Black Childers, the band also consciously emphasized their New York street-tough image, abandoning the glam rock look Thunders and Nolan had flaunted in the New York Dolls in favor of short hair and '50's style suits. The first gigs with the new lineup took place on July 23 and 24, 1976 at Max's Kansas City and earned rave reviews. The band continued to gig regularly in New York City throughout the summer and fall, and played several shows in Boston in September. Despite Childers' efforts and a reputation as a must-see live act, no recording contract was forthcoming, a situation that became increasingly frustrating. Lure wrote that \"the kind of deals being offered were laughable, sleazy 50-50 splits that the bands could never, ever hope to profit from.\"[4] Although the band regularly drew packed crowds at Max's and other venues, by this point Thunders, Nolan, and Lure were heroin addicts (Rath preferred methamphetamine), so money was tight.\n",
         "The band got what seemed like a break when the Sex Pistols invited the band to open for them on the ill-fated Anarchy Tour (the Sex Pistols at this time were managed by Malcolm McLaren, who had previously managed The New York Dolls). Arriving for the tour just as the UK punk scene was building momentum, the Heartbreakers quickly developed a following in and around London despite most of the shows on the tour being cancelled. As Childers said, \"The Heartbreakers blew everyone away, for no more reason than they were just more experienced - they had their roots in rhythm and blues and rock 'n' roll...no matter how anarchic an audience thinks it is, if the bass player can actually play, and the drummer is Jerry Nolan, suddenly they're going 'this is GREAT'!\"[2] At Childers' behest, the band stayed in London after the conclusion of the tour in order to play more gigs and earn a recording contract. Sold-out gigs at London clubs Dingwalls and the Roxy established the band as one of the top groups in the nascent punk scene, and eventually they signed a contract with Track Records in the spring of 1977, earning a substantial advance and beginning work on their debut album.\n",
         "By this point, the band members' addictions were out of control, despite being enrolled in the British methadone program. Nolan later acknowledged that \"everything we did revolved around drugs.\"[3] Recording sessions for the new album were derailed by drug use - on the part of band members as well as producer Speedy Keen - leading to innumerable attempts at recording and mixing at different studios. The first release from the sessions was the single \"Chinese Rocks\" b/w \"Born To Lose\",[7] released in May 1977, which sold well despite being criticized for its poor sound.  Nolan admitted \"I think it's okay, but not great,\"[8] and Lure added \"The record wasn't really up to par production wise.\"[8] Band members continued to attempt to remix the album at various studios in London throughout the summer of 1977, but the problems persisted. In the studio, the band could not seem to capture the power of their live shows - the recordings sounded muddy and lifeless, especially Nolan's drums.\n",
         "As a live act, at this point the Heartbreakers were second to none - a summer tour of the UK was very successful, with a New Musical Express review describing one gig as \"the nearest thing I ever saw to Beatlemania.\"[3] In August, the band returned to New York City to play three nights at the Village Gate, their first shows in their hometown in nearly a year. Recalled Lure, \"It was probably the best shows we ever played in New York, only because we were so tight from touring for six months. These now-legendary shows - which one observer called some of the best rock shows ever[9] - were eventually released as a live album[10] in 2015.\n",
         "After the Village Gate shows, the band returned to England to attempt to finalize the album, entitled L.A.M.F. (New York gang slang for \"like a motherfucker\".) Nolan was most vocal about his dissatisfaction with the recordings, and attempted to remix the album himself - but with no better results. Track Records pressured the band to release the album by October 1977 in order to get it in stores for the holiday season; Nolan threatened to quit if the album was released as is, and when the other three members agreed to Track's demands, Nolan followed through and left the band. Upon its release, the album received excellent reviews, but still drew criticism for its poor sound - especially compared to the Clash and the Sex Pistols albums released the same year. Much of the blame went to Keen, who was not a trained recording engineer, but problems with the mastering process likely affected the record as well. L.A.M.F. would ultimately be remixed and rereleased multiple times to try to extract the band's raw power from the master tapes. As Childers said, the album's failure to capture the Heartbreakers' live sound was \"the biggest, hugest fuck-up in the history of rock 'n' roll.\"[3]\n",
         "With Nolan out of the band, Thunders, Lure, and Rath recruited the Sex Pistols' Paul Cook to play drums on a fall tour of the U.K., but soon asked Nolan to rejoin as a hired musician. Nolan finished the tour, but then left again to start a new band, the Idols. The Heartbreakers did a short European tour in November and December with Terry Chimes on drums, after which Lure and Rath returned to New York to attempt to recruit a permanent replacement on drums. The band again found themselves without a recording contract when Track Records went bankrupt - fortunately, due to a provision Childers had inserted in their contract, they were able to recover the master tapes for L.A.M.F. as well as other live recordings. But without a new recording contract, Thunders decided to attempt a solo career, and the band ultimately broke up in early 1978.\n",
         "Thunders remained in London, playing shows with various musicians, and recording his solo debut So Alone (which featured Lure and Rath on a few tracks.) That summer, the three found themselves in New York and decided to play some \"farewell\" shows - as Lure acknowledged, \"we were all strung out, we were all in town, and we all needed money.\"[4] Minus Nolan, the band booked a series of shows at Max's Kansas City with drummer Ty Styx sitting in.[1] Realizing that the band would not last much longer, Max's booker Peter Crowley arranged for the shows on September 16, 1978 to be recorded for a live album, The eventual release, Live at Max's Kansas City '79, would become an immediate classic, capturing the band's live energy as L.A.M.F.  had conspicuously failed to do. \n",
         "Nolan eventually rejoined the band in March 1979, and the reunited quartet continued to play regularly in New York throughout 1979 and 1980. But there was no attempt to write new songs or record new material - the gigs were purely \"rent parties\" to help the members stay afloat financially (and pay for their addictions.) In 1984, the band was able to rerelease a remixed version of L.A.M.F., and did a reunion tour of Europe in 1984 that led to a live album.[1] Billy Rath left the band and the music business after the reunion tour, and was replaced by Tony Coiro. Thunders and Nolan continued their careers solo and (in Nolan's case) with other bands; they toured together in 1986 and 1987. Lure formed his own band, the Waldos, as well as occasionally playing with Thunders at New York gigs.\n",
         "The Heartbreakers' final show was on November 30, 1990 at the Marquee in New York City, with Coiro on bass. Although both Thunders and Nolan were in deteriorating health by this point, the show went well.\n"
      ]
   },
   "Post-Heartbreakers": {
      "text": [
         "Johnny Thunders died in April 1991.[1] His body was found in a hotel room in New Orleans. While Thunders' death may have been drug-related, there is some controversy surrounding the facts of his death as the level of methadone in Thunders' body may not have constituted a fatal dose. Thunders also suffered from various health problems, with his autopsy showing evidence of advanced leukemia. In June 1991, a memorial concert was held for Thunders' family, at which Lure, Jerry Nolan, Coiro, and Joey Pinter played a set of Heartbreakers songs.\n",
         "Jerry Nolan died in 1992 following a stroke he suffered in hospital, while being treated for meningitis and pneumonia. He had been diagnosed with HIV several years prior to his death.\n",
         "Richard Hell played with the Voidoids until the early 1980's, but subsequently focused on writing and spoken word performances.\n",
         "Walter Lure had an unconventional post-Heartbreakers career, working as a stock broker on Wall Street.  However, music continued to remain a big part of his life.  He still performed in New York City a few weekends out of the year, and would do an international tour once or twice a year. Lure was diagnosed in July 2020 with liver and lung cancer, which spread rapidly, and he died from complications related to the cancer on August 21, 2020, at the age of 71.\n",
         "Billy Rath disappeared from the music scene after leaving the Heartbreakers in the mid-1980s, and he undertook a period of rehabilitation to recover from the effects of sustained abuse of drugs and alcohol. Rath then went on to study for a degree in psychology and a postgraduate qualification in theology, working as a substance use disorder counselor. After being persuaded to attend the Max's Kansas City reunion gig in September 2010, Rath reentered the music world and briefly fronted a new band, the Street Pirates. He died on August 16, 2014, aged 66.[11]\n",
         "L.A.M.F. is now considered one of the most influential albums of the first wave of punk.[12] The album has been remixed multiple times; a 4-CD \"Definitive Edition\"[13] was released in 2012, which included two remixes of the original LP along with demos and rare tracks. Multiple live recordings have been released as well, from both the early lineup with Hell and the L.A.M.F. lineup.\n"
      ]
   },
   "Band members": {},
   "Timeline": {},
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Heartbreakers, also known as Johnny Thunders and the Heartbreakers, were an American punk rock band, formed in New York City in 1975.[1] The band spearheaded the first wave of punk rock.\n",
      "Johnny Thunders (vocals/guitar) and Jerry Nolan (drums) gained fame in the pioneering proto-punk band the New York Dolls. By early 1975, the Dolls were disintegrating amid poor record sales and tensions within the band, and Thunders and Nolan quit during a tour of Florida in March 1975. Coincidentally, that same week that Richard Hell (vocals/bass) left Television. After returning to New York, Thunders and Nolan invited Hell to join their new band, and Hell agreed.[1] As Hell said, \"I was fed up with Television because it was getting so pretentious...so I thought, this is perfect - we'll make a really good rock & roll band that's dealing with interesting subjects.\"[2] The three dubbed their new band the Heartbreakers. Their first gig was on May 30 of that year, at the Coventry, a rock club in Queens.[3] (Tom Petty's backing band was also named the Heartbreakers, but they did not begin gigging until 1976.) The trio auditioned several candidates for a second guitarist, and soon added Walter Lure to the lineup. Lure, who had previously played with a glam-punk band called the Demons, played his first show with the Heartbreakers on July 4, 1975 at CBGB.[4]\n",
      "The band quickly became one of the most popular and well-known underground bands in New York City, headlining shows at CBGB, Mother's (located across from the Chelsea Hotel), and Max's Kansas City. In the band's early days, each member took turns on vocals, with Hell bringing in songs (such as \"Blank Generation\") originally written for Television, and Thunders contributing new material as well. Lure began singing lead on some songs and co-writing with Nolan. The combination of the style-conscious Nolan and Thunders with the beatnik Hell and gangly Lure made for a visually arresting and musically powerful group. As Blondie's Clem Burke said, \"You could call them the punk rock Beatles. Each person really stood out.\"[3] Although popular, the early lineup could not get a recording contract, in no small part due to the band's well-known heroin use - as vividly described in their best-known song, \"Chinese Rocks\" (which was actually written by Dee Dee Ramone with contributions from Hell). Live recordings of the Thunders/Hell/Nolan/Lure lineup were eventually released on the LP Live at Mother's,[5] and studio demos[6] were released in 2019.\n",
      "Although initially the band members shared songwriting and singing, Hell increasingly attempted to impose his will on the band. At a rehearsal in early 1976, Hell laid down an ultimatum - he would sing most of the songs in the set, with Thunders relegated to one or two songs per set. Thunders walked out, and Nolan and Lure followed; with all three united against him, Hell wound up leaving the band. His final show was on May 14, 1976 at the Rathskeller in Boston. After auditioning several bass players, the band settled on Boston transplant Billy Rath. Hell  went on to form his own band, Richard Hell and the Voidoids.[1]\n"
   ]
}