{
   "Name": "Richard Hell and the Voidoids",
   "rawData": [
      "Richard Hell and the Voidoids were an American punk rock band, formed in New York City in 1976 and fronted by Richard Hell, a former member of the Neon Boys, Television and the Heartbreakers.\n",
      "Kentucky-born Richard Meyers moved to New York City after dropping out of high school in 1966, aspiring to become a poet. He and his best friend from high school, Tom Miller, founded the rock band the Neon Boys which became Television in 1973. The pair adopted stage names; Miller called himself Verlaine after Paul Verlaine, a French poet he admired, and Meyers became Richard Hell because, as he has said, it described his condition.\n",
      "The group was the first rock band to play the club CBGB, which soon became a breeding ground for the early punk rock scene in New York. Hell had an energetic stage presence and wore torn clothing held together with safety pins and his hair spiked, which was to be influential in punk fashion - in 1975, after a failed management deal with the New York Dolls, impresario Malcolm McLaren claimed to have brought these ideas back with him to England and eventually incorporated them into the Sex Pistols' image, a claim which Sex Pistols' front man John Lydon/Johnny Rotten disputes, citing his own existing use of safety pins and spiked hair (dyed green) prior to joining the Pistols.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, United States"
      ],
      "Genres": [
         "Punk rock",
         "art punk"
      ],
      "Years active": [
         "1976–1979, 1982–1984, 1990 (Japanese tour only), 2000 (recording only)"
      ],
      "Labels": [
         "Sire",
         "Radar",
         "Red Star",
         "ROIR",
         "Shake"
      ],
      "Associated acts": [
         "Neon Boys",
         "Television",
         "The Heartbreakers",
         "Dim Stars",
         "Ramones",
         "Misfits",
         "Lou Reed",
         "Matthew Sweet",
         "Sonic Youth"
      ],
      "Past members": [
         "See below"
      ]
   }
}