{
   "Name": "The Hold Steady",
   "rawData": [
      "The Hold Steady is an American rock band from Brooklyn, New York, formed in 2003. The band consists of Craig Finn (vocals, guitar), Tad Kubler (guitar), Galen Polivka (bass), Bobby Drake (drums), Franz Nicolay (keyboards) and Steve Selvidge (guitar). Noted for their \"lyrically dense storytelling,\" and classic rock influences, the band's narrative-based songs frequently address themes such as drug addiction, religion and redemption, and often feature recurring characters based within the city of Minneapolis.\n",
      "Formed four years following the break-up of Finn and Kubler's former band, Lifter Puller, The Hold Steady released the debut album Almost Killed Me in 2004. They came to prominence with the release of their third studio album, Boys and Girls in America, in 2006. In 2010, keyboardist and multi-instrumentalist Franz Nicolay left the band prior to the recording of their fifth studio album, Heaven Is Whenever (2010). During the band's subsequent tour, the band became a five piece, once more, with the addition of guitarist Steve Selvidge. The band released their sixth LP, Teeth Dreams, on March 25, 2014. \n",
      "Nicolay re-joined the band on May 4, 2016, and the band has since embarked on several concert residencies in the US and the UK. To coincide with each new event, The Hold Steady releases stand-alone singles, marking the first recorded material of the six-piece line-up. The band's seventh LP, Thrashing Thru the Passion, was released in August 2019.\n"
   ],
   "infobox": {
      "Origin": [
         "Brooklyn, New York, U.S."
      ],
      "Genres": [
         "Alternative rock, indie rock, heartland rock, post-punk revival"
      ],
      "Years active": [
         "2003–present"
      ],
      "Labels": [
         "Frenchkiss Records, Vagrant Records, Full Time Hobby, Washington Square/Razor & Tie"
      ],
      "Associated acts": [
         "Lifter Puller, The World/Inferno Friendship Society, Lucero, Against Me!, Bash & Pop"
      ],
      "Website": [
         "https://theholdsteady.net/"
      ],
      "Members": [
         "Craig Finn",
         "Tad Kubler",
         "Galen Polivka",
         "Bobby Drake",
         "Franz Nicolay",
         "Steve Selvidge"
      ],
      "Past members": [
         "Judd Counsell"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Brooklyn, New York, formed in [YEAR]. The band consists of Craig Finn (vocals, guitar), [PERSON_NAME_FULL_1_MALE] (guitar), Galen Polivka (bass), [PERSON_NAME_FULL_3_MALE] (drums), [PERSON_NAME_FULL_2_MALE] (keyboards) and [PERSON_NAME_FULL_0_MALE] (guitar). Noted for their \"lyrically dense storytelling,\" and classic rock influences, the band's narrative-based songs frequently address themes such as drug addiction, religion and redemption, and often feature recurring characters based within the city of Minneapolis.\n",
      "Formed four years following the break-up of Finn and Kubler's former band, Lifter Puller, [BAND_NAME] released the debut album Almost Killed Me in [YEAR]. They came to prominence with the release of their third studio album, Boys and Girls in America, in [YEAR]. In [YEAR], keyboardist and multi-instrumentalist [PERSON_NAME_FULL_1_MALE] left the band prior to the recording of their fifth studio album, Heaven Is Whenever ([YEAR]). During the band's subsequent tour, the band became a five piece, once more, with the addition of guitarist [PERSON_NAME_FULL_0_MALE]. The band released their sixth LP, Teeth Dreams, on [MONTH] 25, [YEAR]. \n",
      "Nicolay re-joined the band on [MONTH] 4, [YEAR], and the band has since embarked on several concert residencies in the US and the UK. To coincide with each new event, [BAND_NAME] releases stand-alone singles, marking the first recorded material of the six-piece line-up. The band's seventh LP, Thrashing Thru the Passion, was released in [MONTH] [YEAR].\n"
   ]
}