{
   "Name": "Kiss (band)",
   "rawData": [
      "Kiss (often stylized as KIϟϟ) is an American rock band formed in New York City in January 1973 by Paul Stanley, Gene Simmons, Ace Frehley, and Peter Criss. Well known for its members' face paint and stage outfits, the group rose to prominence in the mid–late 1970s with its shocking live performances, which featured fire breathing, blood-spitting, smoking guitars, shooting rockets, levitating drum kits, and pyrotechnics. The band has gone through several lineup changes, with Stanley and Simmons being the only members to feature in every lineup. The original and best-known lineup consists of Stanley (vocals and rhythm guitar), Simmons (vocals and bass), Frehley (lead guitar and vocals), and Criss (drums and vocals).\n",
      "With their make-up and costumes, the band members took on the personae of comic book-style characters: the Starchild (Stanley), the Demon (Simmons), the Spaceman or Space Ace (Frehley), and the Catman (Criss). Due to creative differences, both Criss and Frehley had departed the group by 1982.\n",
      "In 1983, Kiss began performing without makeup and costumes, thus marking the beginning of the band's \"unmasked\" era that would last for over a decade. The band experienced a commercial resurgence during this era, with the Platinum-certified album Lick It Up successfully introducing them to a new generation of fans, and its music videos received regular airplay on MTV. Eric Carr, who had replaced Criss in 1980, died in 1991 of heart cancer and was replaced by Eric Singer. In response to a wave of Kiss nostalgia in the mid-1990s, the original lineup re-united in 1996, which also saw the return of its makeup and stage costumes. The resulting Alive/Worldwide Tour was highly successful, grossing $143.7 million, making it the band's most successful tour to date. Criss and Frehley subsequently left the band again, and have been replaced by Singer and Tommy Thayer. The band has continued with its original stage makeup, with Singer and Thayer using the original Catman and Spaceman makeup, respectively. In September 2018, Kiss announced that, after 45 years of recording and performing, it would be embarking on its ongoing final tour, the End of the Road World Tour, which started in January 2019 and is currently set to conclude in 2022.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, U.S."
      ],
      "Genres": [
         "Hard rock",
         "heavy metal",
         "shock rock",
         "glam metal"
      ],
      "Years active": [
         "1973–present"
      ],
      "Labels": [
         "Casablanca",
         "Mercury",
         "Roadrunner",
         "Kiss",
         "Universal"
      ],
      "Associated acts": [
         "Wicked Lester",
         "Frehley's Comet",
         "Eric Singer Project"
      ],
      "Website": [
         "kissonline.com"
      ],
      "Members": [
         "Paul Stanley",
         "Gene Simmons",
         "Tommy Thayer",
         "Eric Singer"
      ],
      "Past members": [
         "Ace Frehley",
         "Peter Criss",
         "Eric Carr",
         "Vinnie Vincent",
         "Mark St. John",
         "Bruce Kulick"
      ]
   },
   "albums": []
}