{
   "Discography": {
      "Bootlegs": {},
      "Compilation album contributions": {},
      "Compilation albums": {},
      "EPs": {},
      "Film": {},
      "Full lengths": {},
      "Live": {},
      "Music videos": {},
      "Split albums": {}
   },
   "External links": {},
   "History": {
      "Beginnings": {
         "text": [
            "Formed around the same time as the breakup of Choking Victim, Leftöver Crack was initially an outlet for Choking Victim frontman Scott Sturgeon a.k.a. Stza to release songs that, for one reason or another, were never recorded by Choking Victim and which he claims are the \"Leftover songs\" - hence the name.  For almost two years following the band's formation, the band consisted almost solely of Stza, who recorded many of the songs that would feature on later releases onto a four-track recorder whilst searching for band members. The band eventually solidified (albeit temporarily) around a line-up of Scott \"Stza\" Sturgeon (vocals, additional guitars), Brad Logan of F-Minus (guitar), Alec Baillie (bass, previously of Choking Victim), Mike Trujillo of Blindsided (guitar) and Amery \"AWOL\" Smith (drums, previously of Suicidal Tendencies and the Beastie Boys).\n",
            "Now a complete band, Leftöver Crack proceeded to record several songs with the full line-up, including songs such as \"Rock The 40 Oz.\", \"Crack City Rockers\" and \"The Good, The Bad And The Leftover Crack\" - effectively the band's 'theme song'. Five of these songs were later included on the band's first release - the \"Rock the 40 Oz.\" 7\" EP, which was released by Bankshot! Records on March 8, 2000.\n"
         ]
      },
      "Constructs of the State": {
         "text": [
            "On July 20, 2015 Scott Sturgeon confirmed Leftover Crack had finished their third album, Constructs of the State. It was released on November 27, 2015 through Fat Wreck Chords,[3] and featured guest appearances from Days N' Daze, Mischief Brew, The Bouncing Souls, Intro5pect, Blackbird Raum, Penny Rimbaud and Jesse Michaels.\n",
            "On May 25, 2016, the band released a music video for the song Bedbugs & Beyond courtesy of Shibby Pictures. [4]\n"
         ]
      },
      "Departure of Ezra and tour of Australia": {
         "text": [
            "Following the release and subsequent touring in support of \"Deadline\", Leftöver Crack gradually became less prominent as members (namely Stza and Ezra) focused on other musical projects - such as Star Fucking Hipsters and Morning Glory, respectively. Although still regularly playing shows, the band effectively took a backseat, especially when Star Fucking Hipsters released each of their first two albums, \"Until We're Dead\" and \"Never Rest in Peace\".\n",
            "Towards the end of 2009, it was announced that longtime guitarist and backing vocalist Ezra had left the band. Although initially appearing to be an amicable departure, this later escalated when Stza effectively began an online 'feud' with Ezra, accusing him of being a liar and drug addict.\n",
            "In November 2009, Leftöver Crack toured Australia and New Zealand for the first time in their career. However, the line-up for all of the shows consisted of Stza, guitarist Frank Piegaro (of Star Fucking Hipsters/Degenerics) and two Australians filling in - Alex Flamsteed (Hereafter) & Chris Cox (Phalanx).\n",
            "Following the Australian tour, Stza stated at a house show in West Auckland that Leftöver Crack would most probably be inactive in the future, much like Choking Victim before them. This coincided with the increased rate of activity from Star Fucking Hipsters, which has become his main creative outlet as of late.\n",
            "In December 2010, Leftöver Crack announced that they were playing three shows.  Returning to the line-up was Ezra, implying that the feud between him and Stza may have been resolved.\n",
            "In January 2011, it was announced through their Facebook page that Leftöver Crack would be doing a West Coast tour in February and an East Coast tour in March. They will also be playing a small UK tour in August 2011, including the Reading and Leeds festivals.\n"
         ]
      },
      "Fuck World Trade": {
         "text": [
            "On August 30, 2004, Leftover Crack released their second album - Fuck World Trade on Alternative Tentacles (Household Name Records in the UK).\n",
            "The album has been banned in multiple chain-stores such as Wal-Mart, Best Buy and Music Land due to the album's controversial name and subject matter - as well as the front cover, which features George W. Bush, Dick Cheney, and Rudy Giuliani (Tony Blair on the UK release) causing the World Trade Center attacks.\n",
            "The album also displayed a greater degree of artistic freedom from the band, featuring longer songs, a wider range of instrumentation (such as strings, synthesizers and double-bass drumming) and a larger amount of genre experimentation - featuring elements of death metal, classical music and folk music along with the band's trademark combination of anarcho punk and ska. The album also included several guest appearances, including Chris Head, Justin Sane, and Chris No. 2 of Anti-Flag, as well as a collaboration with The World/Inferno Friendship Society.\n"
         ]
      },
      "Hiatus": {
         "text": [
            "The band took an indefinite hiatus after the death of drummer Brandon Possible at the end of 2004. Stza spent the interim playing Leftöver Crack and Choking Victims songs by himself at a few solo acoustic shows. Ezra spent time writing songs for his band Morning Glory. Leftöver Crack began touring again in the summer of 2005, including some dates with  Citizen Fish and The World/Inferno Friendship Society, as well as playing dates in October 2005 in California after the Wasted Fest was canceled. The so-called Crack Rock Steady 7 also embarked on a small European tour in November; however, this incarnation consisted of only Stza and The Infested, in some cases billed as the \"Crack Steady Rockers\".\n"
         ]
      },
      "Leaving Hellcat - recording the second album": {
         "text": [
            "As a result of legal disputes with Hellcat Records, the band were effectively left in limbo for approximately two years, unable to leave their current label, yet also unable to sign to another - as well as being unable to release any new material under the name of Leftöver Crack. However, the band did manage to bend the rules of their contract slightly, releasing a split EP with F-Minus as \"The Crack Rock Steady 7\" - effectively Leftover Crack working under aliases with additional musicians. The EP was titled \"Baby Jesus Sliced Up In The Manger\" and was released on November 27, 2003.\n",
            "In February 2003, the band began to record the songs that they had written and developed over the last three years with esteemed engineer Steve Albini, a majority of which would see a release on their second album. After recording two final songs that winter, and having finally been dropped from Hellcat Records' roster, the band opted to release the song the following the year as the \"Fuck World Trade\" demo for the consideration of independent punk record labels. Around the same time, the band were approached by renowned underground punk rock figure and ex-Dead Kennedys frontman Jello Biafra, and as a result signed to his Alternative Tentacles record label.\n"
         ]
      },
      "Return and split with Citizen Fish": {
         "text": [
            "Blacknoise Records released a four-way split entitled The Kids Are Gonna Pay in March 2006 with Leftöver Crack contributing 1 new song, \"Look Who's Talking Now\". Other bands on the split included Morning Glory, F-Minus, and Bent Outta Shape. The 7\" was limited to 1000 copies on white vinyl and is now sold out. The first 100 included limited edition patches designed by Brad Logan's wife Kristen, and some included an insert.\n",
            "On October 31, 2006, Fat Wreck Chords released a 7\" split single with UK ska punk band Citizen Fish, to which Leftöver Crack contributed the new song \"Baby Punchers\". To support the release, the 2 bands joined with other Fat Wreck bands, The Sainte Catherines and Dead to Me, and went on a U.S. tour. The full length split with Citizen Fish, entitled Deadline was released on March 6, 2007 with Fat Wreck Chords releasing the CD version and Alternative Tentacles releasing the vinyl version. The album featured seven songs from each band (plus an intro for Leftöver Crack's side), as well as featuring three songs originally intended to be released by Stza's newer band, Star Fucking Hipsters. 1103 copies were released on white vinyl.\n"
         ]
      },
      "Signing to Hellcat Records": {
         "text": [
            "After contributing the song \"Crack City Rockers\" to the second installment of Hellcat Records' Give 'Em The Boot compilation series, the band were signed to the label, initially being contracted to produce three albums for Hellcat. The band agreed, and promptly began recording songs for their first full-length - tentatively titled \"Shoot The Kids At School\".\n",
            "Unfortunately for the band, Hellcat Records refused to release the album, due to concerns over the album's controversial title, artwork and subject matter (especially in regards to the recent Columbine shootings). The band eventually relented and changed the album's title, art and track listing, under the promise that they would be released from their contract afterward as a result. The album was eventually released under the title of Mediocre Generica, a sly attack at Hellcat Records, who Stza claimed wanted a \"mediocre, generic\" album in comparison to the original. The album was released on September 11, 2001.\n",
            "At this point, the band now consisted of Stza (vocals, additional guitars), Alec (bass), Ezra and Ara Babajian from NYC ska band Agent 99, and later The Slackers, on drums.\n"
         ]
      }
   },
   "Members": {},
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Beginnings",
      "1.2 Signing to Hellcat Records",
      "1.3 Leaving Hellcat - recording the second album",
      "1.4 Fuck World Trade",
      "1.5 Hiatus",
      "1.6 Return and split with Citizen Fish",
      "1.7 Departure of Ezra and tour of Australia",
      "1.8 Constructs of the State",
      "2 Venue bans, criminal records and visa restriction",
      "3 Members",
      "4 Discography",
      "4.1 Full lengths",
      "4.2 EPs",
      "4.3 Compilation albums",
      "4.4 Split albums",
      "4.5 Music videos",
      "4.6 Compilation album contributions",
      "4.7 Live",
      "4.8 Bootlegs",
      "4.9 Film",
      "5 See also",
      "6 References",
      "7 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "Leftöver Crack is an American punk rock band formed in 1998, following the breakup of Choking Victim. The band is currently signed to Fat Wreck Chords for CD releases, and Alternative Tentacles for vinyl releases. The band consists of Scott Sturgeon (vocals), Brad Logan (guitar), Alec Baillie (bass guitar), Donny Morris (drums) Chris Mann (guitar). Leftöver Crack spans several different music genres including hardcore punk, ska, and crust punk. They write mostly political lyrics of a radical leftist nature, opposing religion, capitalism, and authority. Members of Leftöver Crack reside in the C-Squat on 155 Avenue C in the Lower East Side of Manhattan, New York City. Natives of New York City, band members have a well-documented history of back-and-forth conflict with the NYPD which precedes the band's formation.[2] The name \"Leftöver Crack\" is explained by Stza as being \"an oxymoron\", based on the idea that crack cocaine addicts are known for vigorous use, and are unlikely to have any \"leftover\" crack.\n"
      ]
   },
   "Title": "Leftöver Crack - Wikipedia",
   "Venue bans, criminal records and visa restriction": {
      "text": [
         "Leftöver Crack has been banned from performing in many venues in New York City, such as ABC No Rio and the Knitting Factory. However, they still play at banned venues under a different name, Crack Rock Steady 7 or individually as solo acts. They repeatedly have trouble touring in certain countries, especially Canada, due to members having prior criminal records. They were denied entry into Canada for a tour scheduled at the end of 2007. At a show in Boston, MA in August 2008, Stza angrily stated Leftöver Crack would never return to Boston;[citation needed] however, they played just outside of Boston on June 18, 2016.[5] In 2006, after their show in Boise, Stza announced to a group of fans that they would never return, Boise was subsequently skipped in '07 and Star Fucking Hipsters' 2010 Boise date was cancelled a week or so after being posted, though they returned to Boise in March 2011. In June 2016 Leftover Crack was allowed entry into Canada and played Amnesia Rockfest in Montebello, Quebec, but had many members denied again in 2018. [6]\n"
      ]
   }
}