{
   "Name": "Leftöver Crack",
   "rawData": [
      "Leftöver Crack is an American punk rock band formed in 1998, following the breakup of Choking Victim. The band is currently signed to Fat Wreck Chords for CD releases, and Alternative Tentacles for vinyl releases. The band currently consists of Scott Sturgeon (vocals), Brad Logan (guitar), Alec Baillie (bass guitar), Donny Morris (drums), and Al Rosenberg (guitar). Leftöver Crack spans several different music genres including hardcore punk, ska, and crust punk. They write mostly political lyrics of a radical leftist nature, opposing religion, capitalism, and authority. Members of Leftöver Crack reside in the C-Squat on 155 Avenue C in the Lower East Side of Manhattan, New York City. Natives of New York City, band members have a well-documented history of back-and-forth conflict with the NYPD which precedes the band's formation. The name \"Leftöver Crack\" is explained by Stza as being \"an oxymoron\", based on the idea that crack cocaine addicts are known for vigorous use, and are unlikely to have any \"leftover\" crack.\n",
      "Formed around the same time as the breakup of Choking Victim, Leftöver Crack was initially an outlet for Choking Victim frontman Scott Sturgeon a.k.a. Stza to release songs that, for one reason or another, were never recorded by Choking Victim and which he claims are the \"Leftover songs\" - hence the name.  For almost two years following the band's formation, the band consisted almost solely of Stza, who recorded many of the songs that would feature on later releases onto a four-track recorder whilst searching for band members. The band eventually solidified (albeit temporarily) around a line-up of Scott \"Stza\" Sturgeon (vocals, additional guitars), Brad Logan of F-Minus (guitar), Alec Baillie (bass, previously of Choking Victim), Mike Trujillo of Blindsided (guitar) and Amery \"AWOL\" Smith (drums, previously of Suicidal Tendencies and the Beastie Boys).\n",
      "Now a complete band, Leftöver Crack proceeded to record several songs with the full line-up, including songs such as \"Rock The 40 Oz.\", \"Crack City Rockers\" and \"The Good, The Bad And The Leftover Crack\" - effectively the band's 'theme song'. Five of these songs were later included on the band's first release - the \"Rock the 40 Oz.\" 7\" EP, which was released by Bankshot! Records on March 8, 2000.\n"
   ],
   "infobox": {
      "Also known as": [
         "Crack Rock Steady 7"
      ],
      "Origin": [
         "Alphabet City, Manhattan, New York City, NY, USA"
      ],
      "Genres": [
         "Crust punk",
         "hardcore punk",
         "ska punk",
         "crack rock steady[1]"
      ],
      "Years active": [
         "1998–present"
      ],
      "Labels": [
         "Fat Wreck Chords, Alternative Tentacles, Household Name Records, Hellcat, BANKSHOT! Records"
      ],
      "Associated acts": [
         "Choking Victim, F-Minus, Morning Glory, INDK, Rats in the Wall, The Slackers, MDC, Nino Zombi, Intro5pect, No Commercial Value, Star Fucking Hipsters, Citizen Fish, Subhumans, Aus-Rotten, El Jefe David, Days N Daze, Cop/Out"
      ],
      "Members": [
         "Stza",
         "Brad Logan",
         "Donny Morris (Intro5pect)",
         "Al Rosenberg (Cop/Out)",
         "Kate Coysh"
      ],
      "Past members": [
         "Alec Baillie",
         "Ezra Kire",
         "Ara Babajian",
         "Chris Mann (Intro5pect)",
         "Amery Smith",
         "Tom \"Jangles\" Knox",
         "Joey \"Gunner\" Hunt",
         "Brandon Chevalier-Kolling",
         "Austin Hotchkiss",
         "JP Otto",
         "Ian McDougall ",
         " Lance Michael"
      ]
   },
   "albums": [
      "Mediocre Generica",
      "Fuck World Trade",
      "Constructs of the State"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in [YEAR], following the breakup of Choking Victim. The band is currently signed to Fat Wreck Chords for CD releases, and [PERSON_NAME_FIRST_0]ternative Tentacles for vinyl releases. The band currently consists of Scott Sturgeon (vocals), [PERSON_NAME_FULL_1_MALE] (guitar), [PERSON_NAME_FIRST_0]ec [PERSON_NAME_LAST_2] (bass guitar), Donny Morris (drums), and [PERSON_NAME_FULL_0_MALE] (guitar). [BAND_NAME] spans several different music genres including hardcore punk, ska, and crust punk. They write mostly political lyrics of a radical leftist nature, opposing religion, capitalism, and authority. Members of [BAND_NAME] reside in the C-Squat on 155 Avenue C in the Lower East Side of Manhattan, New York City. Natives of New York City, band members have a well-documented history of back-and-forth conflict with the NYPD which precedes the band's formation. The name [SONG_NAME] crack.\n",
      "Formed around the same time as the breakup of Choking Victim, [BAND_NAME] was initially an outlet for Choking Victim frontman Scott Sturgeon a.k.a. Stza to release songs that, for one reason or another, were never recorded by Choking Victim and which he claims are the [SONG_NAME] Smith (drums, previously of Suicidal Tendencies and the Beastie Boys).\n",
      "Now a [GENRE] band, [BAND_NAME] proceeded to record several songs with the full line-up, including songs such as [SONG_NAME] EP, which was released by Bankshot! Records on [MONTH] 8, [YEAR].\n"
   ]
}