{
   "Name": "Lotion (band)",
   "rawData": [
      "Lotion was an American, Manhattan-based indie rock band, formed in 1991 by brothers Bill and Jim Ferguson (bass guitar and guitar respectively), drummer Rob Youngberg, and vocalist/guitarist Tony Zajkowski.\n",
      "Lotion formed in New York City's East Village and released two seven-inch singles \"Head\" and \"Tear\" on Kokopop before releasing their debut album, full Isaac, through spinArt Records in 1994.\n",
      "To promote the release of full Isaac, Lotion toured America and Europe with Pavement, Throwing Muses, and Mercury Rev.  In 1995, the band released a self-titled EP on Big Cat Records, with a second EP, The Agnew Funeral E.P., recorded the next year. In 1996, Lotion released their second album, Nobody's Cool, with liner notes by Thomas Pynchon.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, United States"
      ],
      "Genres": [
         "Indie rock"
      ],
      "Years active": [
         "1991–2001"
      ],
      "Labels": [
         "Kokopop",
         "spinArt",
         "Big Cat"
      ],
      "Associated acts": [
         "Honeycomb, Schizo Fun Addict"
      ],
      "Past members": [
         "Bill Ferguson",
         "Jim Ferguson",
         "Rob Youngberg",
         "Tony Zajkowski"
      ]
   },
   "albums": [
      "full Isaac",
      "Nobody's Cool",
      "The Telephone Album"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band, formed in [YEAR] by brothers Bill and [PERSON_NAME_FULL_0_MALE] (bass guitar and guitar respectively), drummer Rob Youngberg, and vocalist/guitarist [PERSON_NAME_FULL_1_MALE].\n",
      "[BAND_NAME] formed in New York City's East Village and released two seven-inch singles [SONG_NAME] on Kokopop before releasing their debut album, full Isaac, through spinArt Records in [YEAR].\n",
      "To promote the release of full Isaac, [BAND_NAME] toured America and Europe with Pavement, Throwing Muses, and Mercury Rev.  In [YEAR], the band released a [GENRE] a second EP, The Agnew Funeral E.P., recorded the next year. In [YEAR], [BAND_NAME] released their second album, Nobody's Cool, with liner notes by Thomas Pynchon.\n"
   ]
}