{
   "Name": "Defiance (metal band)",
   "Sections": [
      "1 Biography",
      "1.1 Early career (1985–1988)",
      "1.2 Product of Society and Void Terra Firma (1989–1990)",
      "1.3 Beyond Recognition (1991–1992)",
      "1.4 Rotating members, breakup and aftermath (1993–2004)",
      "1.5 Reunion and second breakup (2005–2012)",
      "1.6 Second reunion (2019–present)",
      "2 Line-up",
      "2.1 Current members",
      "2.2 Former members",
      "2.3 Timeline",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Demos",
      "3.3 Compilation albums",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Defiance is an American thrash metal band from Oakland, California. They played a decidedly technical style of thrash originally evoking bands like Testament, though they would later move on to playing in their own unique, more progressive thrash style. After dissolving in 1995, they reformed in 2005 and released their fourth studio album The Prophecy in late 2009. They broke up once again in 2012, but announced yet another reunion in September 2019.\n"
      ]
   },
   "Biography": {
      "Early career (1985–1988)": {
         "text": [
            "Defiance was formed in 1985 by guitarist Brad Bowers, drummer Matt Vander Ende, and bassist Mike Kaufmann. Doug Harrington joined later but left the band not long after due to conflicts with Bowers, and was replaced by Jim Adams. Eventually the band ousted Bowers and replaced him with Harrington. In 1987 the band recruited a vocalist in Mitch Mayes.\n",
            "Now with a stable and complete lineup, Defiance began playing shows in the Bay Area. With the local thrash scene gaining momentum, the band attained local notoriety. Their first demo was released in 1987. Shortly afterwards Mayes left the band and was replaced by Ken Elkington. With Elkington the band issued their Hypothermia demo in 1988. This demo caught the attention of the independent metal label Roadracer Records, who signed the band that year. At Roadracer's insistence, the band traveled to Vancouver, British Columbia, Canada to record their debut album with Annihilator guitarist Jeff Waters.\n"
         ]
      },
      "Product of Society and Void Terra Firma (1989–1990)": {
         "text": [
            "The band's debut, Product of Society was released in 1989. The band was very much unsatisfied with Waters' production job, as he told the band to turn down the volume pots on their guitars, resulting in a very thin riff sound, and the members also claim Waters was acting unprofessionally during the recording. Nonetheless the album managed to attract attention in the thrash community despite the frequent label as a Testament knock-off. After playing a few dates in the Bay Area, Elkington was fired due to lack of commitment and former Laughing Dead vocalist Steev Esquivel was added to the group and finished the band's tours for the album.\n",
            "With Esquivel on board, Defiance released their second album, Void Terra Firma in 1990. Produced by John Cuniberti (best known for producing Joe Satriani's Surfing With the Alien), the production was slightly better but still a bit sketchy. The band's overall sound became a little more progressive but stuck to the Bay Area thrash ideals, though many compared Esquivel's singing style to Chuck Billy of Testament. This was the band's biggest commercial success, featuring a metal hit in its cover of Iron Maiden's \"Killers\". The band toured with Vio-lence in support of the album that year.\n"
         ]
      },
      "Beyond Recognition (1991–1992)": {
         "text": [
            "The band went into the studio with Rob Beaton to record their third album in 1991, but problems arose when Steev Esquivel's drug addictions became over the top and he left the group. He was briefly replaced by former Militia vocalist Matt Ulrickson, but the band was dissatisfied with the results and fired him. The now cleaner Esquivel returned to the band, but this led to the delay of the recording of the album.\n",
            "Defiance's third release Beyond Recognition was finally released in 1992. Straying away from the band's original thrash trappings, the band explores extremely technical songs with odd time signatures and off the wall song structures, even experimenting with jazz fusion elements, but while remaining true to the thrash metal formula. This coupled with the much improved production made for it to be considered Defiance's best work by many fans. It was by far the band's most critically acclaimed album, but due to a lack of support from Roadracer and a shifting musical atmosphere, it suffered in sales especially in America (though sales in Europe and Japan were still substantial). The personal management for the artist, Defiance, during the period including the albums, Void Terra Firma and Beyond Recognition, was Greg Burnham of FTC Entertainment Group. [Source: Beyond Recognition album cover]\n",
            "Around this time Roadracer began to apparently treat the band poorly. The band was denied a tour of Europe with Sepultura, where the band still had a substantial audience. Jim Adams and Matt Vander Ende left the band after the album's tentative single, \"Inside Looking Out\" (featuring guest vocals from David White of Heathen), was denied single or video release. They were replaced by Brian Wenzel and Mike Bennet respectively. Matt Vander Ende briefly joined Laaz Rocket, and later in 2004 he moved to New York City to become the drummer for the Broadway show Wicked. Jim Adams returned to the band shortly after he left and Mike Bennet was replaced by Tyson Leeper. The band did a short American tour, with Leeper leaving and being replaced by Paul Palmer in the process.\n"
         ]
      },
      "Rotating members, breakup and aftermath (1993–2004)": {
         "text": [
            "In 1993 Steev Esquivel left the band and was replaced by vocalist Dave White. In late 1993 with Dave and Paul in the lineup, Defiance wrote and recorded new material including \"Safe\" (Kaufmann,  Harrington, White), \"Don't Play God\" (Harrington, Palmer, White) \"Wasting Creation\" (Harrington, White, Adams, Palmer), songs which were recorded and mastered with this lineup in 1994 by producer/engineer Rob Beaton (\"Beyond Recognition\" album). Several supporting performances ensued including a co-headline appearance at a large festival in Santa Barbara (Spring 1994). Although he played drums through the show, Palmer experienced a serious ankle injury when approaching the stage immediately prior. Due to surgery he was incapacitated for several months thereafter, ultimately retiring the drummer from the band.  Around 1995, Defiance dissolved.[1] White, Harrington, Adams, and Kaufmann and new drummer then created the groove metal band Inner Threshold, which later evolved into Under. Meanwhile, Steev Esquivel achieved considerable success in the late 1990s with the groove metal group Skinlab, who released three albums before splitting up in 2003, although they have reunited occasionally since 2007.\n"
         ]
      },
      "Reunion and second breakup (2005–2012)": {
         "text": [
            "In 2005 after over a decade since their disbandment, Defiance reunited with Esquivel, Harrington, Adams, and Kaufmann along with new drummer James Raymond. This incarnation of the band began working on new material, now signed to Metal Mind Productions. Metal Mind reissued the first three of the band's LPs via the Insomnia box set in 2006. James Raymond departed the band and was replaced by former Vio-lence drummer Mark Hernandez.\n",
            "In November 2006 tragedy struck Defiance when guitarist Doug Harrington died of cancer, which he had been battling secretly for years. However, the band continued working on the new release in his honor and the new album features guitar work recorded by Harrington just days before his passing. It is said to be true to the band's thrash roots, but with progressive touches similar to their third offering Beyond Recognition.\n",
            "A new song titled \"The Voice\" was posted on the band's Myspace page. The lineup was Esquivel on vocals, Adams on guitar, Kaufmann on bass, and Hernandez on drums.\n",
            "In late 2008, Defiance announced on its Myspace page and website that it had signed with Candlelight Records to release its new album. As of mid-2009, the recording of the album (titled The Prophecy) was completed and given a release date of October 19, 2009.\n",
            "Following the release, Esquivel once again quit the band, claiming he only intended to record some material with Defiance because that was what Doug Harrington had wanted him to do before he died. The band now has a new singer Keven Albert and a new guitarist Shawn Bozarth.[2]\n",
            "After trying out different drummers for the new line up, Defiance recruited Burton Ortega ex-member of KAOS to support the new album The Prophecy.\n"
         ]
      },
      "Second reunion (2019–present)": {
         "text": [
            "On September 26, 2019, Defiance announced on their Facebook page that they were going to reunite for an appearance in April 2020 at the Blades of Steel Metal festival in Milwaukee.[3]\n",
            "To coincide with the reunion, Vic Records released a two-disc compilation, Checkmate: The Demo Collection, November 27, 2020; it contains Defiance's demos between 1986 and 1994 in their entirety.[4] The band also has a new album in the works.[4]\n"
         ]
      }
   },
   "Line-up": {
      "Current members": {},
      "Former members": {
         "text": [
            "Vocals\n",
            "Guitars\n",
            "Drums\n"
         ]
      },
      "Timeline": {}
   },
   "Discography": {
      "Studio albums": {},
      "Demos": {},
      "Compilation albums": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Defiance is an American thrash metal band from Oakland, California. They played a decidedly technical style of thrash originally evoking bands like Testament, though they would later move on to playing in their own unique, more progressive thrash style. After dissolving in 1995, they reformed in 2005 and released their fourth studio album The Prophecy in late 2009. They broke up once again in 2012, but announced yet another reunion in September 2019.\n",
      "Defiance was formed in 1985 by guitarist Brad Bowers, drummer Matt Vander Ende, and bassist Mike Kaufmann. Doug Harrington joined later but left the band not long after due to conflicts with Bowers, and was replaced by Jim Adams. Eventually the band ousted Bowers and replaced him with Harrington. In 1987 the band recruited a vocalist in Mitch Mayes.\n",
      "Now with a stable and complete lineup, Defiance began playing shows in the Bay Area. With the local thrash scene gaining momentum, the band attained local notoriety. Their first demo was released in 1987. Shortly afterwards Mayes left the band and was replaced by Ken Elkington. With Elkington the band issued their Hypothermia demo in 1988. This demo caught the attention of the independent metal label Roadracer Records, who signed the band that year. At Roadracer's insistence, the band traveled to Vancouver, British Columbia, Canada to record their debut album with Annihilator guitarist Jeff Waters.\n",
      "The band's debut, Product of Society was released in 1989. The band was very much unsatisfied with Waters' production job, as he told the band to turn down the volume pots on their guitars, resulting in a very thin riff sound, and the members also claim Waters was acting unprofessionally during the recording. Nonetheless the album managed to attract attention in the thrash community despite the frequent label as a Testament knock-off. After playing a few dates in the Bay Area, Elkington was fired due to lack of commitment and former Laughing Dead vocalist Steev Esquivel was added to the group and finished the band's tours for the album.\n"
   ]
}