{
   "Name": "Defiance (metal band)",
   "rawData": [
      "Defiance is an American thrash metal band from Oakland, California. They played a decidedly technical style of thrash originally evoking bands like Testament, though they would later move on to playing in their own unique, more progressive thrash style. After dissolving in 1995, they reformed in 2005 and released their fourth studio album The Prophecy in late 2009. They broke up once again in 2012, but announced yet another reunion in September 2019.\n",
      "Defiance was formed in 1985 by guitarist Brad Bowers, drummer Matt Vander Ende, and bassist Mike Kaufmann. Doug Harrington joined later but left the band not long after due to conflicts with Bowers, and was replaced by Jim Adams. Eventually the band ousted Bowers and replaced him with Harrington. In 1987 the band recruited a vocalist in Mitch Mayes.\n",
      "Now with a stable and complete lineup, Defiance began playing shows in the Bay Area. With the local thrash scene gaining momentum, the band attained local notoriety. Their first demo was released in 1987. Shortly afterwards Mayes left the band and was replaced by Ken Elkington. With Elkington the band issued their Hypothermia demo in 1988. This demo caught the attention of the independent metal label Roadracer Records, who signed the band that year. At Roadracer's insistence, the band traveled to Vancouver, British Columbia, Canada to record their debut album with Annihilator guitarist Jeff Waters.\n"
   ],
   "infobox": {
      "Origin": [
         "Oakland, California, U.S."
      ],
      "Genres": [
         "Thrash metal, progressive metal"
      ],
      "Years active": [
         "1985–1995, 2005–2012, 2019–present"
      ],
      "Labels": [
         "Candlelight, Roadrunner, Metal Mind Productions"
      ],
      "Associated acts": [
         "Skinlab, Heathen, Severed Fifth, Inner Threshold, Under. Monster God"
      ],
      "Website": [
         "defiance1.com"
      ],
      "Members": [
         "Steev Esquivel ",
         " Jim Adams ",
         " Mike Kaufmann ",
         " Matt Vander Ende ",
         " Billy Garoutte"
      ],
      "Past members": [
         "Doug Harrington",
         " Matt Vander Ende ",
         " Ken Elkington ",
         " Paul Palmer ",
         "Dave White",
         " Mark Hernandez"
      ]
   },
   "albums": [
      "Product of Society",
      "Void Terra Firma",
      "Beyond Recognition",
      "The Prophecy"
   ]
}