{
   "Name": "MisterWives",
   "Sections": [
      "1 History",
      "1.1 Formation",
      "1.2 Early career",
      "1.3 Reflections EP",
      "1.4 Our Own House",
      "1.5 Connect the Dots and Superbloom",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Extended plays",
      "2.3 Singles",
      "2.3.1 Notes",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "MisterWives is an American indie pop band based in New York City, consisting of lead singer Mandy Lee (Amanda Lee Duffy), percussionist Etienne Bowler, bass guitarist  William Hehir, guitarist Marc Campbell, multi-instrumentalist Jesse Blum, and saxophonist Mike Murphy. MisterWives have opened for acts such as Panic! at the Disco, Twenty One Pilots, Half Moon Run, Bleachers, The Mowgli's, Walk the Moon, Foster the People, Paramore, American Authors, and X Ambassadors. The band is currently signed to Fueled By Ramen. The band's debut album Our Own House was released in January 2015, and subsequently met with critical acclaim.\n"
      ]
   },
   "History": {
      "Formation": {
         "text": [
            "The band was formed in late 2012 when lead singer Mandy Lee wanted an 80s cover band for her birthday party. She partnered with fellow musicians Etienne Bowler and William Hehir. Lee met Hehir through a mutual friend, and was introduced to Bowler a short time later.[5] At the time, the two had been working at restaurants just a block apart in Manhattan.[6] Eventually the band would expand to its current set-up of five members by bringing Bowler's friends Blum and Campbell (not including the band's saxophonist Mike Murphy), and play its first show as 'MisterWives' (a gender-flipped play on the term for the practice of polygamy, sister wives[7]) on February 1, 2013 at the Canal Room in New York City.\n"
         ]
      },
      "Early career": {
         "text": [
            "The day after playing the Canal Room, the band was signed to Photo Finish Records. The band would spend the better part of that year touring and working on their first EP. The group began touring with Half Moon Run in October 2013 that ended with a performance at the 2013 CMJ Music Marathon. This would be shortly followed by a six-week tour with American Authors and The Royal Concept.[8] All the while, the group had been preparing songs for their debut EP, Reflections.\n",
            "On December 24, 2013, MisterWives released a trap remix of \"Coffins\" with the Pegboard Nerds under Monstercat.\n"
         ]
      },
      "Reflections EP": {
         "text": [
            "The band released Reflections on January 7, 2014. The EP included 6 songs, including the title track, which was iTunes' free Single of the Week for the week of January 6. Music Engineer Neal Avron was brought in to mix the EP while producer Frequency produced \"Reflections\".[9] The EP was met with rave reviews and has sold over 20,000 copies. Alter the Press' Victoria Mier gave the album a 5/5 saying \"Simply put, MisterWives is quite incredible and certainly has both the capacity and the talent to take over the indie-pop world.\"[10]  Nick Krenn of EarBuddy.net wrote \"All listeners hunting for more depth from current pop music will want to hear Reflections.\"[11] The music blog Pigeons and Planes said about one of the tracks from the EP: \"MisterWives has only been in existence since 2012, but you would never know that by listening to the expertly written and masterfully produced “Coffins.”[5] Reflections has sold over 6,000 copies since its initial release.[12]\n",
            "In July 2014, \"Vagabond\" was made the opening theme of the MTV Teen Drama Finding Carter. Most recently, the band opened for Twenty One Pilots as part of the Banditø world tour.\nThe band has seen more notoriety in the media, being boasted by MTV Buzzworthy as the \"next golden children of pop\".[2] The band has also performed on VH1's Big Morning Buzz and ABC's Jimmy Kimmel Live.[13][14]\n"
         ]
      },
      "Our Own House": {
         "text": [
            "In January 2015, the group announced a February 24, 2015 release date for their debut album, Our Own House. The reveal coincided with the announcement of their 2015 tour of the same name.[15] In February of that year, the band was featured in Kia Motors' web series Rediscovered, as they covered the Hall & Oates song \"Out of Touch\" before John Oates made a surprise visit in the studio.[16] Misterwives performed at the 2015 edition of Boston Calling Music Festival,[17] as well as many other major music festivals including Lollapalooza, Outside Lands, Hangout Fest, LouFest, and Austin City Limits. They then embarked on their \"Scrapbook Tour\", to critical acclaim, with one critic going as far as calling them the \"best live band in America\".\n"
         ]
      },
      "Connect the Dots and Superbloom": {
         "text": [
            "From February 24 to April 15, 2017, MisterWives toured with Panic! At the Disco on their Death of a Bachelor Tour.[18] On December 17, the band posted on its official Facebook page to announce: \"our second record is finally complete\".[19] On February 14, MisterWives announced via their official Facebook page that their new single, \"Machine\", of their new album, would be available on February 17.[20] On February 24, MisterWives announced via their Twitter page that the album, entitled Connect the Dots, would be released on May 19.[21] They had a summer \"Misterwives Band Camp Tour\" through June and ended July 1 in Denver. They also released two new singles, \"Oh Love\" on March 30, 2017 and \"Drummer Boy\" on April 20, 2017, via their YouTube channel in accordance with Vevo.[22] As of September 21, they began their 'Connect the Dots' tour with bands Vinyl Theatre and Smallpools.\n",
            "On July 30, 2019, the band posted the video for their single \"whywhywhy\"[23] which is a track on their third album Superbloom. This is their first single and first album released after being signed to Fueled By Ramen.[24] The band announced their \"No Place Like Home Tour\" which began in November 2019. On November 8, 2019, the band released an EP titled Mini Bloom, which included 5 new songs. The full 19-song album Superbloom was released on July 24, 2020.\n",
            "On May 18, 2020, the band posted on their Instagram profile that Lee and Bowler have decided to separate, but that the band would stay together and continue to make music and tour.[25]\n",
            "On December 12, 2020 the band gave a special performance of their Superbloom album presented on Moment House entitled SUPERBLOOM: The Live Dream.[26]\n"
         ]
      }
   },
   "Discography": {
      "Studio albums": {},
      "Extended plays": {},
      "Singles": {
         "Notes": {}
      }
   },
   "References": {},
   "External links": {},
   "coreData": [
      "MisterWives is an American indie pop band based in New York City, consisting of lead singer Mandy Lee (Amanda Lee Duffy), percussionist Etienne Bowler, bass guitarist  William Hehir, guitarist Marc Campbell, multi-instrumentalist Jesse Blum, and saxophonist Mike Murphy. MisterWives have opened for acts such as Panic! at the Disco, Twenty One Pilots, Half Moon Run, Bleachers, The Mowgli's, Walk the Moon, Foster the People, Paramore, American Authors, and X Ambassadors. The band is currently signed to Fueled By Ramen. The band's debut album Our Own House was released in January 2015, and subsequently met with critical acclaim.\n",
      "The band was formed in late 2012 when lead singer Mandy Lee wanted an 80s cover band for her birthday party. She partnered with fellow musicians Etienne Bowler and William Hehir. Lee met Hehir through a mutual friend, and was introduced to Bowler a short time later.[5] At the time, the two had been working at restaurants just a block apart in Manhattan.[6] Eventually the band would expand to its current set-up of five members by bringing Bowler's friends Blum and Campbell (not including the band's saxophonist Mike Murphy), and play its first show as 'MisterWives' (a gender-flipped play on the term for the practice of polygamy, sister wives[7]) on February 1, 2013 at the Canal Room in New York City.\n",
      "The day after playing the Canal Room, the band was signed to Photo Finish Records. The band would spend the better part of that year touring and working on their first EP. The group began touring with Half Moon Run in October 2013 that ended with a performance at the 2013 CMJ Music Marathon. This would be shortly followed by a six-week tour with American Authors and The Royal Concept.[8] All the while, the group had been preparing songs for their debut EP, Reflections.\n",
      "On December 24, 2013, MisterWives released a trap remix of \"Coffins\" with the Pegboard Nerds under Monstercat.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, U.S."
      ],
      "Genres": [
         "Indie pop[1]",
         "pop[2]",
         "alternative dance[3]",
         "pop rock[4]"
      ],
      "Years active": [
         "2012 (2012)–present"
      ],
      "Labels": [
         "Fueled By Ramen"
      ],
      "Website": [
         "misterwives.com"
      ],
      "Members": [
         "Mandy Lee",
         "William Hehir",
         "Etienne Bowler",
         "Marc Campbell",
         "Jesse Blum",
         "Mike Murphy"
      ]
   }
}