{
   "Name": "MisterWives",
   "rawData": [
      "MisterWives is an American indie pop band based in New York City, consisting of lead singer Mandy Lee (Amanda Lee Duffy), percussionist Etienne Bowler, bass guitarist  William Hehir, guitarist Marc Campbell, multi-instrumentalist Jesse Blum, and saxophonist Mike Murphy. MisterWives have opened for acts such as Panic! at the Disco, Twenty One Pilots, Half Moon Run, Bleachers, The Mowgli's, Walk the Moon, Foster the People, Paramore, American Authors, and X Ambassadors. The band is currently signed to Fueled By Ramen. The band's debut album Our Own House was released in January 2015, and subsequently met with critical acclaim.\n",
      "The band was formed in late 2012 when lead singer Mandy Lee wanted an 80s cover band for her birthday party. She partnered with fellow musicians Etienne Bowler and William Hehir. Lee met Hehir through a mutual friend, and was introduced to Bowler a short time later. At the time, the two had been working at restaurants just a block apart in Manhattan. Eventually the band would expand to its current set-up of five members by bringing Bowler's friends Blum and Campbell (not including the band's saxophonist Mike Murphy), and play its first show as 'MisterWives' (a gender-flipped play on the term for the practice of polygamy, sister wives) on February 1, 2013 at the Canal Room in New York City.\n",
      "The day after playing the Canal Room, the band was signed to Photo Finish Records. The band would spend the better part of that year touring and working on their first EP. The group began touring with Half Moon Run in October 2013 that ended with a performance at the 2013 CMJ Music Marathon. This would be shortly followed by a six-week tour with American Authors and The Royal Concept. All the while, the group had been preparing songs for their debut EP, Reflections.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, U.S."
      ],
      "Genres": [
         "Indie pop[1]",
         "pop[2]",
         "alternative dance[3]",
         "pop rock[4]"
      ],
      "Years active": [
         "2012 (2012)–present"
      ],
      "Labels": [
         "Fueled By Ramen"
      ],
      "Website": [
         "misterwives.com"
      ],
      "Members": [
         "Mandy Lee",
         "William Hehir",
         "Etienne Bowler",
         "Marc Campbell",
         "Jesse Blum",
         "Mike Murphy"
      ]
   },
   "albums": []
}