{
   "Name": "Mod Fun",
   "Sections": [
      "1 Career",
      "2 Discography",
      "2.1 Singles and EPs",
      "2.2 Albums",
      "3 Members",
      "4 Notes",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Mod Fun are an American power pop/garage punk band from the New York City area. Mod Fun were originally active in the early to mid-1980s, and played an integral part in New York City's burgeoning garage rock revival scene at the time.[1]  By mid 1986 they were widely regarded as one of the best known indie rock bands in NYC and New Jersey. After disbanding at the height of their career in the late 1980s to pursue other projects, the three original members reunited in 2004 and have been active since.\n"
      ]
   },
   "Career": {
      "text": [
         "The members of Mod Fun started playing music together as childhood friends in early 1979, and initially called their band Rage. They counted a lot of FM radio rock and early punk among their influences, before their approach to music was revitalized when they discovered The Jam in 1982. Mod Fun wrote and recorded their first original songs in 1982-83 and released them only on cassette; beginning with a 4-track recording of four songs entitled \"If You Are New\" and subsequently, a collection called Release For The Mates. The first collection, \"If You Are New\", was produced by Steve Peer of the New York/New Jersey act TV Toy.[2] During this time, Mod Fun also started performing frequently in the New York/New Jersey area.  Their first club date was on January 12, 1983 at the infamous Dirt Club in Bloomfield, New Jersey.  During the band's introduction that night, the club's owner, Johnny Dirt, made it a point to tell the crowd that the band members were only 16 years old.\n",
         "In 1984 Mod Fun released their first single, \"I Am With You\" b/w \"Happy Feeling\" on their own label, New Records.  Playing frequently at such New York City clubs as CBGB, The Dive and R.T. Firefly, they signed a record deal with NYC's Midnight Records.  They released their first album, 90 Wardour Street in 1985.[3]  Their live shows were high energy (sometimes reckless) spectacles, which have been said to have influenced many people who saw them to start bands of their own.[4]\n",
         "On the strength of their first releases, Mod Fun set out on their first United States tour in spring 1985, playing concerts from New York City to Los Angeles to San Francisco. With the bulk of their performances taking place in California, the band carved a niche in the \"Paisley Underground\" scene popularized by bands such as The Bangles, The Rain Parade and The Three O'Clock.  After returning from the tour, the band had a falling out with Midnight Records and released a three-song EP on their own Makin' Tyme label entitled \"Hangin' Round\".  Shortly after the release of \"Hangin' Round\" they signed with New York City's Cryptovision Records. They recorded material for a single (Mary Goes 'Round b/w Grounded) and a second album, Dorothy's Dream.\n",
         "In spring 1986, after a number of \"mini tours\" which took them to places such as Rochester, Vermont and Washington D.C., Mod Fun (who had taken to referring to themselves as The Mod Fun) set out for their second full scale US tour, which brought them to many more cities than their previous tour.  It was during that second tour that Dorothy's Dream was released.[5]  After returning from the second tour, Mod Fun continued to appear in their local area, including a sold-out show at Maxwell's and an outdoor performance for the \"Liberty Weekend\" celebration, both in Hoboken, New Jersey.  However, these were supposed to be their final shows as Mod Fun as the band members had decided to take an extended hiatus.   Yet, during this time  (summer 1986) they were featured in numerous local, national and international articles, and began talking with well-known local musicians/producers such as Richard Barone of The Bongos and Peter Zaremba of The Fleshtones about producing future recordings. Thurston Moore of Sonic Youth and Jello Biafra of Dead Kennedys were fans of the band and interested in working with them as well.[6]\n",
         "After several months of doing very little with the group, the members decided to try a more conventional pop approach, adding keyboards and additional backing vocals to round out their sound.  They changed the name of the band to Paintbox and, after having written several new songs, they played a number of local shows in the NYC area.  Though the new sound was well received, it never lived up to the energy and spark generated by Mod Fun.  Paintbox recorded a demo tape produced by (future \"Rolling Stone\" Editor,) Jim DeRogatis which was never released, and, later, one track which ultimately appeared on Mod Fun's retrospective CD \"Past...Forward\".[7]\n",
         "In early 1987 a German concert promoter contacted the band and, based upon the solid sales of their LPs in Europe, suggested they appear on a European tour.  After a visit to the US by the promoter to meet the members and see them perform in their current configuration as Paintbox, the tour details were worked out.  The group set out for Luxembourg in April 1987.  It was only after their arrival in Europe that it became apparent that the 4-piece pop group then known as Paintbox would not fit the bill. Tour posters and other promo materials featured the name \"Mod Fun\" and were accompanied by 3 year old photos from the band's \"90 Wardour St.\" LP.[8]  Tensions over this disparity rose throughout the tour and even though the group played successful shows in huge venues in Bern, Switzerland; Vienna, Austria; Rimini and San Marino, Italy; and Hamburg and Berlin, Germany, the band acrimoniously broke up after their final show in Berlin.  Soon thereafter, Mick and Bobby formed Crocodile Shop.\n",
         "In 1995, Get Hip Records released a retrospective of most of the band's recorded output (omitting the Midnight Records recordings because of legal issues), called Past Forward.[9] In 2004, Get Hip reissued the CD, and Mod Fun played a reunion show at The Saint in Asbury Park, New Jersey. The positive reception and renewed friendship among the members inspired Mod Fun to continue on where they had left off.  Since then, Mod Fun has played extensively in the New York/New Jersey area, as well as having performed in Philadelphia, Nashville, Baltimore, Annapolis, and Chicago.\n",
         "In 2007 Mod Fun released a new CD called Now...and Again on their Makin' Tyme label.[10] A double-length CD with ten new original songs and ten re-recorded classics from their 1980s catalog, it also includes a live version of \"I Believe\" recorded at their highly successful July 2006 CBGB show.  Continuing to play locally over the next few years, in 2009 Mod Fun began writing and recording material for another new album, entitled 'FuturePresent\",.\n",
         "2010 saw the release of the new 15 song CD, \"Futurepresent\".  The majority of the songs were written by Mick Hale but, for the first time, Bob Strete and Chris Collins contributed original songs for the new CD as well.  After doing a few in-store appearances during early 2010 to promote the new disc, Mod Fun took the opportunity in July to appear live at Asbury Lanes in Asbury Park, New Jersey as part of the very successful \"Modsbury Park IV - Mods vs. Rockers\" show.  This would turn out to be the group's final performance, a result of bassist Bob Strete moving to Cincinnati. Chris Collins and Mick Hale continued to record together, releasing a video of the Paul McCartney Wings track \"Band on the Run\" on Mod Fun's YouTube channel, as well as an unreleased version of Badfinger's \"Day After Day.\" In September of 2020 the albums \"90 Wardour Street\" and \"Dorothys Dream\" were remastered and digitally released along with several demos and live material.\n"
      ]
   },
   "Discography": {
      "Singles and EPs": {},
      "Albums": {}
   },
   "Members": {},
   "Notes": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Mod Fun are an American power pop/garage punk band from the New York City area. Mod Fun were originally active in the early to mid-1980s, and played an integral part in New York City's burgeoning garage rock revival scene at the time.[1]  By mid 1986 they were widely regarded as one of the best known indie rock bands in NYC and New Jersey. After disbanding at the height of their career in the late 1980s to pursue other projects, the three original members reunited in 2004 and have been active since.\n",
      "The members of Mod Fun started playing music together as childhood friends in early 1979, and initially called their band Rage. They counted a lot of FM radio rock and early punk among their influences, before their approach to music was revitalized when they discovered The Jam in 1982. Mod Fun wrote and recorded their first original songs in 1982-83 and released them only on cassette; beginning with a 4-track recording of four songs entitled \"If You Are New\" and subsequently, a collection called Release For The Mates. The first collection, \"If You Are New\", was produced by Steve Peer of the New York/New Jersey act TV Toy.[2] During this time, Mod Fun also started performing frequently in the New York/New Jersey area.  Their first club date was on January 12, 1983 at the infamous Dirt Club in Bloomfield, New Jersey.  During the band's introduction that night, the club's owner, Johnny Dirt, made it a point to tell the crowd that the band members were only 16 years old.\n",
      "In 1984 Mod Fun released their first single, \"I Am With You\" b/w \"Happy Feeling\" on their own label, New Records.  Playing frequently at such New York City clubs as CBGB, The Dive and R.T. Firefly, they signed a record deal with NYC's Midnight Records.  They released their first album, 90 Wardour Street in 1985.[3]  Their live shows were high energy (sometimes reckless) spectacles, which have been said to have influenced many people who saw them to start bands of their own.[4]\n",
      "On the strength of their first releases, Mod Fun set out on their first United States tour in spring 1985, playing concerts from New York City to Los Angeles to San Francisco. With the bulk of their performances taking place in California, the band carved a niche in the \"Paisley Underground\" scene popularized by bands such as The Bangles, The Rain Parade and The Three O'Clock.  After returning from the tour, the band had a falling out with Midnight Records and released a three-song EP on their own Makin' Tyme label entitled \"Hangin' Round\".  Shortly after the release of \"Hangin' Round\" they signed with New York City's Cryptovision Records. They recorded material for a single (Mary Goes 'Round b/w Grounded) and a second album, Dorothy's Dream.\n"
   ],
   "infobox": {
      "Genres": [
         "Power pop, garage punk"
      ],
      "Years active": [
         "1982-present"
      ],
      "Labels": [
         "New Records, Midnight, Cryptovision Records, Get Hip, Making Tyme!"
      ],
      "Associated acts": [
         "Crocodile Shop"
      ],
      "Website": [
         "http://www.modfun.com/"
      ],
      "Members": [
         "Mick \"London\" Hale (vocals/guitar)",
         "Bobby \"Werner\" Strete (bass/vocals)",
         "Chris Collins (drums/vocals)"
      ]
   }
}