{
   "Name": "Nuclear Assault",
   "rawData": [
      "Nuclear Assault is an American thrash metal band formed in New York City in 1984. Part of the mid-to-late 1980s thrash metal movement, they were one of the main bands of the genre to emerge from the East Coast along with Overkill, Whiplash, Toxik, Carnivore, and Anthrax; the latter was co-founded by Nuclear Assault bassist Dan Lilker, who left Anthrax shortly after the release of their first album. Nuclear Assault released five full-length albums and toured relentlessly throughout the 1980s and early 1990s, and broke up in 1995. The band reunited briefly in 1997 and then permanently in 2002.\n",
      "Nuclear Assault has released six studio albums to date, the latest being Third World Genocide (2005). Their most successful records are Survive (1988) and Handle with Care (1989), which peaked at #145 and #126 on the Billboard 200 chart respectively.\n",
      "After the release of Anthrax's debut album Fistful of Metal, bassist Dan Lilker, a founding member of the group, was fired by the band. He decided to pursue a more aggressive style of music and formed Nuclear Assault with guitarist/vocalist John Connelly, who had been involved in an early version of Anthrax. They were joined by guitarist Mike Bogush and drummer Scott Duboys (later of Cities, Cycle Sluts From Hell and Warrior Soul). They then recorded the first of two demos, which included the songs \"Stranded in Hell\", \"The Plague\", and \"Hang the Pope\".\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, U.S."
      ],
      "Genres": [
         "Thrash metal",
         "crossover thrash"
      ],
      "Years active": [
         "1984–1995",
         "1997",
         "2002–present"
      ],
      "Labels": [
         "I.R.S.",
         "Combat",
         "In-Effect",
         "Receiver Records",
         "SPV"
      ],
      "Associated acts": [
         "Anthrax",
         "Brutal Truth",
         "ShocktaleZ",
         "S.O.D.",
         "Cycle Sluts From Hell",
         "Warrior Soul",
         "Holy Moses",
         "Tails Of Blood",
         "TT Quick"
      ],
      "Members": [
         "Dan Lilker",
         "John Connelly",
         "Glenn Evans",
         "Erik Burke"
      ],
      "Past members": [
         "Scott Duboys",
         "Mike Bogush",
         "Anthony Bramante",
         "Dave DiPietro",
         "Scott Metaxas",
         "Scott Harrington"
      ]
   },
   "albums": [
      "Game Over",
      "Survive",
      "Handle With Care",
      "Out of Order",
      "Something Wicked",
      "Third World Genocide"
   ]
}