{
   "Name": "Paperdoll (band)",
   "rawData": [
      "PaperDoll is an American indie rock band from New York City, consisting of Teresa Lee (vocals), Patrick Moloney (guitar), Jack Koch (bass guitar), and Will Haywood Smith (drums).  \n",
      "The band gained international attention when they played at the Shanghai World Expo August 2010 on their first tour of China.\n",
      "On their second tour, in October 2010, they once again attracted TV headlines with record-breaking crowds during the closing of the Shanghai World Expo. They also made history as the final guests on EXPO 360, a show highlighting the best of the World Expo. Making headlines in the fashion world, lead singer Teresa Lee wore a dress by Flora Zeta. Chinese press, including People's Daily, praised the US band for their action-packed live performances.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, United States"
      ],
      "Genres": [
         "Indie rock, alternative rock"
      ],
      "Years active": [
         "2006 – present[when?]"
      ],
      "Website": [
         "www.paperdollband.com"
      ],
      "Members": [
         "Teresa Lee (vocals, keyboard)",
         "Patrick Moloney (guitar, vocals)",
         "Jack Koch(bass guitar)",
         "Will Haywood Smith (drums)"
      ]
   },
   "prunedData": [
      "PaperDoll is an [GENRE] band from New York City, consisting of Teresa Lee (vocals), [PERSON_NAME_FULL_0_MALE] (guitar), Jack Koch (bass guitar), and [PERSON_NAME_FULL_1_MALE] (drums).  \n",
      "The band gained international attention when they played at the Shanghai World Expo [MONTH] [YEAR] on their first tour of China.\n",
      "On their second tour, in [MONTH] [YEAR], they once again attracted TV headlines with record-breaking crowds during the closing of the Shanghai World Expo. They also made history as the final guests on EXPO 360, a [GENRE] a dress by [PERSON_NAME_FULL_0_FEMALE]. Chinese press, including People's Daily, praised the US band for their action-packed live performances.\n"
   ]
}