{
   "Name": "Parts & Labor",
   "rawData": [
      "Parts & Labor was an American rock band formed in 2002 by B. J. Warshaw and Dan Friel in Brooklyn, New York. Drummer Joe Wong joined the band in 2007. Parts & Labor released five albums, two EPs, one split album (with Tyondai Braxton), and numerous 7\"s and compilation tracks. Their music is influenced by DIY punk, experimental/psychedelic rock, and lo-fi electronic music.\n",
      "Drummer Christopher Weingarten left the band in 2008 but they quickly recruited new drummer Joe Wong and added guitarist Sarah Lipstate, turning them into a four-piece band. This lineup recorded Receivers, the band's fourth album, which was released on October 21, 2008 in North America and November 3, 2008 in the UK through Jagjaguwar. Also released in 2008 was Escapers Two, a record which featured 51 songs in around 29 minutes. On July 10, 2009, Lipstate announced via her website she had left the band.\n",
      "The band played their 10th anniversary and final show on Friday, February 24, 2012.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, U.S."
      ],
      "Genres": [
         "Noise rock",
         "noise pop",
         "experimental rock"
      ],
      "Years active": [
         "2002–2012"
      ],
      "Labels": [
         "Jagjaguwar"
      ],
      "Associated acts": [
         "Shooting Spires",
         "Noveller",
         "Tyondai Braxton"
      ],
      "Website": [
         "www.partsandlabor.net"
      ],
      "Past members": [
         "B. J. Warshaw",
         "Joe Wong",
         "Tom Martin",
         "Christopher R. Weingarten",
         "Jim Sykes",
         "Joel Saladino",
         "Sarah Lipstate"
      ]
   },
   "albums": [
      "Groundswell",
      "Stay Afraid",
      "Mapmaker",
      "Receivers",
      "Constant Future"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band formed in [YEAR] by B. J. Warshaw and [PERSON_NAME_FULL_0_MALE] in Brooklyn, New York. Drummer Joe Wong joined the band in [YEAR]. [BAND_NAME] released five albums, two EPs, one split album (with Tyondai Braxton), and numerous 7\"s and compilation tracks. Their music is influenced by DIY punk, experimental/psychedelic rock, and lo-fi electronic music.\n",
      "Drummer Christopher Weingarten left the band in [YEAR] but they quickly recruited new drummer [PERSON_NAME_FULL_0_MALE] and added guitarist Sarah Lipstate, turning them into a [GENRE] band. This lineup recorded Receivers, the band's fourth album, which was released on [MONTH] 21, [YEAR] in North America and [MONTH] 3, [YEAR] in the UK through Jagjaguwar. Also released in [YEAR] was Escapers Two, a record which featured 51 songs in around 29 minutes. On [MONTH] 10, [YEAR], Lipstate announced via her website she had left the band.\n",
      "The band played their 10th anniversary and final show on Friday, [MONTH] 24, [YEAR].\n"
   ]
}