{
   "Name": "Pretendo",
   "rawData": [
      "Pretendo is a New York City-based indie rock band formed in 2004 of ex-/present members of Enon, Skeleton Key, Creedle, The Rugburns, Mono Puff, Morricone Youth, Little Jack Melody and The DaoSon For.  Guitarist/vocalist Devon E. Levins and bassist/vocalist John Castro were childhood friends playing in the Las Vegas hardcore punk band Abeyance in the 1980s.  E. Levins met drummer Stephen Calhoon in 1997 when their respective bands Creedle and Skeleton Key had played together. Pretendo recorded its debut eponymous album with Wharton Tiers in New York City at Fun City Studio, which was released on April 5, 2005 by Country Club Records.  Pretendo's second album entitled ] in Brooklyn, New York and includes artwork and lyrics contributed by contemporary pop artist Ron English. ]|[\", with new members Kenny Shaw replacing Stephen Calhoon on drums and Dan Kessler on keyboards.\n",
      "Stephen Calhoon has been a sideman for Yoko Ono, Daniel Johnston, Brave Combo, Shudder to Think and Vic Chesnutt.\n",
      "John Castro is the son of Atlantic Records recording artist, jazz musician Joe Castro.\n"
   ],
   "infobox": {},
   "albums": [
      "Pretendo",
      "Pretendo ]["
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band formed in [YEAR] of ex-/present members of Enon, Skeleton Key, Creedle, The Rugburns, Mono Puff, Morricone Youth, Little Jack Melody and The DaoSon For.  Guitarist/vocalist Devon E. Levins and bassist/vocalist [PERSON_NAME_FULL_1_MALE] were childhood friends playing in the Las Vegas hardcore punk band Abeyance in the [YEAR]s.  E. Levins met drummer Stephen Calhoon in [YEAR] when their respective bands Creedle and Skeleton Key had played together. [BAND_NAME] recorded its debut eponymous album with Wharton Tiers in New York City at Fun City Studio, which was released on [MONTH] 5, [YEAR] by Country Club Records.  [BAND_NAME]'s second album entitled ] in Brooklyn, New York and includes artwork and lyrics contributed by contemporary pop artist [PERSON_NAME_FULL_0_MALE]. ]|[\", with new members Kenny Shaw replacing Stephen Calhoon on drums and [PERSON_NAME_FULL_2_MALE] on keyboards.\n",
      "Stephen Calhoon has been a sideman for Yoko Ono, [PERSON_NAME_FULL_0_MALE], Brave Combo, Shudder to Think and [PERSON_NAME_FULL_1_MALE].\n",
      "John Castro is the son of Atlantic Records recording artist, jazz musician Joe Castro.\n"
   ]
}