{
   "Name": "School of Seven Bells",
   "Sections": [
      "1 History",
      "2 Music style",
      "3 Touring",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Extended plays",
      "4.3 Singles",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "School of Seven Bells (often stylized as SVIIB) was an American indie rock band from New York City, formed in 2007. It originally consisted of Alejandra Deheza (vocals, guitar), her sister Claudia Deheza (keyboards, vocals) and Benjamin Curtis (guitar, synthesizers, vocals). Claudia left the group in 2010, and Curtis died of lymphoma in 2013. Using demos of songs Curtis had written prior to and during his illness, the band's fourth and final album, SVIIB, was completed posthumously and released in February 2016.[1]\n",
         "The band took its name from an alleged South American pickpocket training academy. Alejandra told the Sydney Morning Herald that \"I was up really late watching TV one night...There was this show on about shoplifting rings in the '90s that were extremely organised. The police said that they thought these people were trained in this South American school for pickpockets called the School Of Seven Bells.\"[2]\n"
      ]
   },
   "History": {
      "text": [
         "Benjamin Curtis (formerly of Secret Machines) met identical twin sisters Alejandra and Claudia Deheza (both formerly of On!Air!Library!) while opening on an Interpol tour.[3] The three decided to end their commitments to their old bands, move into a shared space and create a home recording studio together.[4]\n",
         "The band had an unorthodox songwriting process that began with recording vocals, which were then supplemented by the music.[4] Curtis said that this process was the most important part of the band, with \"everything else [being] accompaniment\". A before-and-after example was hosted by NPR's program Day to Day.[5]\n",
         "Their debut single \"My Cabal\" was released in May 2007 on the UK label Sonic Cathedral. A 12-inch/digital EP, \"Face to Face on High Places,\" was released in September 2007 on the Table of the Elements label, in addition to a single from producer Prefuse 73 called \"Class of 73 Bells\" that featured the band.[3] They then toured with Blonde Redhead as well as with Prefuse 73.[3] School of Seven Bells' debut album, Alpinisms, was released one year later in 2008. They then went on tour with Bat for Lashes on her UK Two Suns tour. The Alpinisms track \"Chain\" was featured on an Adult Swim and Ghostly International compilation album, Ghostly Swim, promoted by Adult Swim and available for free download.[6]\n",
         "The band's second album, Disconnect from Desire was released in July 2010. It was hailed by Pitchfork.[7] During the accompanying tour, they covered the Siouxsie and the Banshees song \"Kiss Them for Me\".[8] The band was awarded International Bet of the Year (Aposta Internacional) at the 2010 MTV Video Music Brasil, and in October, Claudia Deheza left the band for \"personal reasons\".[9] On February 28, 2012, they released Ghostory, their third studio album and first as a duo. It included the singles \"The Night\", \"Lafaye\" and \"Scavenger\". On November 13, 2012, the EP Put Your Sad Down was released.[10]\n",
         "In February 2013, Curtis was diagnosed with T-cell lymphoblastic lymphoma after several weeks of displaying symptoms.[11] Curtis did not recover and died on December 29, 2013 at Memorial Sloan–Kettering Cancer Center in New York City.[12]\n",
         "The last piece of music produced by Curtis before his death, a cover of Joey Ramone's \"I Got Knocked Down (But I’ll Get Up)\", was made available in June 2014.[13] The group's fourth album, SVIIB, completed after Curtis's death, was released in February 2016,[14][15] preceded by a single, \"Open Your Eyes\".[16]\n"
      ]
   },
   "Music style": {
      "text": [
         "School of Seven Bells' music was usually described as indie rock, dream pop, shoegaze and electronic. Their sound was described as dreamy and ethereal, and the lyrics as abstract.\n",
         "According to Benjamin Curtis, SVIIB was inspired by \"everything from Kraftwerk, Wire, Beyoncé, New Order, Blonde Redhead, to Section 25 comes to mind, along with singers like Joni Mitchell and Robert Wyatt. We're huge fans of pop, too, mainly because we're huge fans of smart songwriting\".[17]\n"
      ]
   },
   "Touring": {
      "text": [
         "When touring, SVIIB utilized additional members including bassists James Elliott and Daniel Duemer; drummers Zachary Shigeto Saginaw (now more widely known for his work as the electronic musician Shigeto), Joe Stickney (Bear in Heaven) and Christopher Colley; and keyboardist/backing vocalist Allie Alvarado.[18]\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Extended plays": {},
      "Singles": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "School of Seven Bells (often stylized as SVIIB) was an American indie rock band from New York City, formed in 2007. It originally consisted of Alejandra Deheza (vocals, guitar), her sister Claudia Deheza (keyboards, vocals) and Benjamin Curtis (guitar, synthesizers, vocals). Claudia left the group in 2010, and Curtis died of lymphoma in 2013. Using demos of songs Curtis had written prior to and during his illness, the band's fourth and final album, SVIIB, was completed posthumously and released in February 2016.[1]\n",
      "The band took its name from an alleged South American pickpocket training academy. Alejandra told the Sydney Morning Herald that \"I was up really late watching TV one night...There was this show on about shoplifting rings in the '90s that were extremely organised. The police said that they thought these people were trained in this South American school for pickpockets called the School Of Seven Bells.\"[2]\n",
      "Benjamin Curtis (formerly of Secret Machines) met identical twin sisters Alejandra and Claudia Deheza (both formerly of On!Air!Library!) while opening on an Interpol tour.[3] The three decided to end their commitments to their old bands, move into a shared space and create a home recording studio together.[4]\n",
      "The band had an unorthodox songwriting process that began with recording vocals, which were then supplemented by the music.[4] Curtis said that this process was the most important part of the band, with \"everything else [being] accompaniment\". A before-and-after example was hosted by NPR's program Day to Day.[5]\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, US"
      ],
      "Genres": [
         "Indie rock",
         "dream pop",
         "shoegaze",
         "electronic"
      ],
      "Years active": [
         "2007–2016"
      ],
      "Labels": [
         "Vagrant",
         "Ghostly International",
         "Full Time Hobby"
      ],
      "Associated acts": [
         "The Secret Machines",
         "On!Air!Library!",
         "Prefuse 73",
         "Tripping Daisy"
      ],
      "Website": [
         "www.sviib.com"
      ],
      "Past members": [
         "Alejandra Deheza",
         "Claudia Deheza",
         "Benjamin Curtis"
      ]
   }
}