{
   "Name": "School of Seven Bells",
   "rawData": [
      "School of Seven Bells (often stylized as SVIIB) was an American indie rock band from New York City, formed in 2007. It originally consisted of Alejandra Deheza (vocals, guitar), her sister Claudia Deheza (keyboards, vocals) and Benjamin Curtis (guitar, synthesizers, vocals). Claudia left the group in 2010, and Curtis died of lymphoma in 2013. Using demos of songs Curtis had written prior to and during his illness, the band's fourth and final album, SVIIB, was completed posthumously and released in February 2016.\n",
      "The band took its name from an alleged South American pickpocket training academy. Alejandra told the Sydney Morning Herald that \"I was up really late watching TV one night...There was this show on about shoplifting rings in the '90s that were extremely organised. The police said that they thought these people were trained in this South American school for pickpockets called the School Of Seven Bells.\"\n",
      "Benjamin Curtis (formerly of Secret Machines) met identical twin sisters Alejandra and Claudia Deheza (both formerly of On!Air!Library!) while opening on an Interpol tour. The three decided to end their commitments to their old bands, move into a shared space and create a home recording studio together.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, US"
      ],
      "Genres": [
         "Indie rock",
         "dream pop",
         "shoegaze",
         "electronic"
      ],
      "Years active": [
         "2007–2016"
      ],
      "Labels": [
         "Vagrant",
         "Ghostly International",
         "Full Time Hobby"
      ],
      "Associated acts": [
         "The Secret Machines",
         "On!Air!Library!",
         "Prefuse 73",
         "Tripping Daisy"
      ],
      "Website": [
         "www.sviib.com"
      ],
      "Past members": [
         "Alejandra Deheza",
         "Claudia Deheza",
         "Benjamin Curtis"
      ]
   },
   "albums": [
      "Alpinisms",
      "Disconnect from Desire",
      "Ghostory",
      "SVIIB"
   ],
   "prunedData": [
      "[BAND_NAME] (often stylized as SVIIB) was an [GENRE] band from New York City, formed in [YEAR]. It originally consisted of [PERSON_NAME_FULL_0_FEMALE] (vocals, guitar), her sister [PERSON_NAME_FIRST_1] [PERSON_NAME_LAST_0] (keyboards, vocals) and Benjamin Curtis (guitar, synthesizers, vocals). [PERSON_NAME_FIRST_1] left the group in [YEAR], and Curtis died of lymphoma in [YEAR]. Using demos of songs Curtis had written prior to and during his illness, the band's fourth and final album, SVIIB, was completed posthumously and released in [MONTH] [YEAR].\n",
      "The band took its name from an alleged South American pickpocket training academy. Alejandra told the Sydney Morning Herald that [SONG_NAME]\n",
      "Benjamin Curtis (formerly of Secret Machines) met identical twin sisters Alejandra and [PERSON_NAME_FULL_0_FEMALE] (both formerly of On!Air!Library!) while opening on an [GENRE] bands, move into a shared space and create a home recording studio together.\n"
   ]
}