{
   "Name": "The Shondes",
   "rawData": [
      "The Shondes are a rock band from Brooklyn, NY, best known for their combination of feminist punk, rock, pop, and Jewish influences, and ties to political activism. The Shondes formed in 2006 and have released two demos and five full-length studio albums. The band was started by violinist Elijah Oberman and bassist Louisa Rachel Solomon after their former band, The Syndicate, broke up. They recruited guitarist Ian Brannigan, a friend they had made through student activism at The New School in Greenwich Village, and drummer Temim Fruchter, whom the three got to know through protesting the Republican National Convention in 2004.\n",
      "After national tours in summer 2006, spring 2007, and late 2007, The Shondes self-released their debut LP, The Red Sea, on January 8, 2008, and held a record release party at Brooklyn's Luna Lounge. The album was recorded at Studio G in Brooklyn, NY and produced by Tony Maimone of Pere Ubu and They Might Be Giants, and features Brian Dewan on keyboards. Critics reviewing the album often noted the improbability of combining the band's influences and political intentions, and generally praised their success. In the Chicago Tribune, Jessica Hopper said: \"The Red Sea', is a visceral work...their moody songs are redolent of a time in the early '80s when punk fractured into something more tuneful and complex...a political band whose music is as strong as its message is a rare treat.' Venus Zine said: \"On paper, this band sounds like a train wreck, but in real life they are completely arresting....Old-world romance elegantly intertwined with riot grrrl piss and vinegar onstage...A lot of valid arguments have been made against overtly mixing politics and music — it takes the focus off important things like rhythm or, worse, excuses a band’s lack of talent or imagination. But those arguments don’t apply to bands whose politics become inseparable from the emotive quality of their sound.\" They toured again in Fall 2008 in support of The Red Sea.\n",
      "Following that tour, guitarist Ian Brannigan (who was also Solomon's boyfriend at the time) left the band and was replaced by Fureigh. The new lineup made its debut at JDub Records' annual \"Jewltide\" Christmas Eve party at Southpaw in Brooklyn, NY (a venue the band spoke of as their home base until its closure in 2011). In May 2010, the Shondes released their second album My Dear One on Fanatic Records, which has been referred to as their \"break-up album,\" in the aftermath of Brannigan's departure.They toured nationally to support it that year, beginning at South By Southwest in March throughout the Spring, receiving favorable critical response along the way, again particularly for the emotive quality of their live performance.\n"
   ],
   "infobox": {
      "Origin": [
         "Brooklyn, New York, United States"
      ],
      "Genres": [
         "Punk rock, riot grrrl, indie rock, pop rock, Jewish rock"
      ],
      "Years active": [
         "2006 (2006)–present"
      ],
      "Labels": [
         "Exotic Fever"
      ],
      "Associated acts": [
         "The Syndicate"
      ],
      "Website": [
         "www.shondes.com"
      ],
      "Members": [
         "Louisa Rachel Solomon",
         "Elijah Oberman",
         "Courtney Robbins",
         "Alex Smith"
      ],
      "Past members": [
         "Ian Brannigan",
         "Temim Fruchter",
         "Fureigh",
         "Allison Miller",
         "Fen Ikner",
         "Zachary Toporek",
         "Jim Hefferman"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band from Brooklyn, NY, best known for their combination of feminist punk, [GENRE], pop, and Jewish influences, and ties to political activism. [BAND_NAME] formed in [YEAR] and have released two demos and five full-length studio albums. The band was started by violinist Elijah Oberman and bassist [PERSON_NAME_FULL_1_FEMALE] after their former band, The Syndicate, broke up. They recruited guitarist [PERSON_NAME_FULL_0_MALE], a friend they had made through student activism at The New School in Greenwich Village, and drummer Temim Fruchter, whom the three got to know through protesting the Republican National Convention in [YEAR].\n",
      "After national tours in summer [YEAR], spring [YEAR], and late [YEAR], [BAND_NAME] self-released their debut LP, The Red Sea, on [MONTH] 8, [YEAR], and held a record release party at Brooklyn's Luna Lounge. The album was recorded at Studio G in Brooklyn, NY and produced by [PERSON_NAME_FULL_0_MALE] of [PERSON_NAME_FULL_3_MALE] and They Might Be Giants, and features [PERSON_NAME_FULL_2_MALE] on keyboards. Critics reviewing the album often noted the improbability of combining the band's influences and political intentions, and generally praised their success. In the Chicago Tribune, Jessica Hopper said: \"The Red Sea', is a visceral work...their moody songs are redolent of a time in the early '80s when punk fractured into something more tuneful and complex...a political band whose music is as strong as its message is a rare treat.' [PERSON_NAME_FULL_1_FEMALE] said: \"On paper, this band sounds like a train wreck, but in real life they are completely arresting....Old-world romance elegantly intertwined with riot grrrl piss and vinegar onstage...A lot of valid arguments have been made against overtly mixing politics and music — it takes the focus off important things like rhythm or, worse, excuses a band’s lack of talent or imagination. But those arguments don’t apply to bands whose politics become inseparable from the emotive quality of their sound.\" They toured again in Fall [YEAR] in support of The Red Sea.\n",
      "Following that tour, guitarist [PERSON_NAME_FULL_0_MALE] (who was also Solomon's boyfriend at the time) left the band and was replaced by Fureigh. The new lineup made its debut at JDub Records' annual \"Jewltide\" Christmas Eve party at Southpaw in Brooklyn, NY (a venue the band spoke of as their home base until its closure in [YEAR]). In [MONTH] [YEAR], the Shondes released their second album My Dear One on Fanatic Records, which has been referred to as their \"break-up album,\" in the aftermath of [PERSON_NAME_LAST_0]'s departure.They toured nationally to support it that year, beginning at South By Southwest in [MONTH] throughout the Spring, receiving favorable critical response along the way, again particularly for the emotive quality of their live performance.\n"
   ]
}