{
   "Name": "The Silos",
   "rawData": [
      "The Silos is an American rock band formed by Walter Salas-Humara and Bob Rupe in New York City, United States in 1985.\n",
      "Prior to starting the Silos, Salas-Humara had been a member of The Vulgar Boatmen, and Rupe was in Florida bands, The Roll N Pinz, The Cichlids, Crank and The Bobs. The Silos put out the independently released album About Her Steps in 1986, which received a warm critical reception.  The band's 1987 follow-up album, Cuba, also independently released, received even more recognition.  The Silos were named Best New Artist in the Rolling Stone magazine critics' poll. Cuba continues to be cited as highly influential among alternative country artists. The band subsequently signed to RCA Records and released their self-titled third album, produced by Salas-Humara and Rupe along with Peter Moore. Commonly referred to as \"the bird album\" or \"The One With The Bird On The Cover,\" The Silos led to the band's network TV debut appearance on Late Night with David Letterman.\n",
      "Salas-Humara quit the band following the release of The Silos, and purchased the rights to The Silos name from Rupe in 1991, thus dissolving the partnership.  Subsequent albums included Hasta La Victoria (1992), Susan Across The Ocean (1994), Heater and its remix companion Cooler (both 1998).  After Heater was recorded, Salas-Humara turned the band into a three piece with Drew Glackin on bass and lap steel guitar and Konrad Meissner on drum and backing vocals. The subsequent records were Laser Beam Next Door (2001), When The Telephone Rings (2004), and the live This Highway Is A Circle followed. Bloodshot Records released the Silos' 2007 offering, Come On Like The Fast Lane. In 2008, Glackin died. Salas-Humara and Meissner continue to perform with other players. In 2011, the band released Florizona with Rod Hohl playing bass, Bruce Martin on keyboards and Jason Victor on guitar.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, U.S."
      ],
      "Genres": [
         "Rock",
         "Alternative rock",
         "Roots rock"
      ],
      "Years active": [
         "1985–present"
      ],
      "Labels": [
         "Record Collect",
         "RCA",
         "Normal",
         "Watermelon",
         "Checkered Past",
         "Dualtone",
         "Blue Rose",
         "Bloodshot",
         "Sonic Pyramid"
      ],
      "Associated acts": [
         "The Vulgar Boatmen",
         " The Setters",
         "Cracker"
      ],
      "Website": [
         "http://www.thesilos.net"
      ],
      "Members": [
         "Walter Salas-Humara",
         "Konrad Meissner",
         "Rod Hohl",
         "Jason Victor",
         "Bruce Martin"
      ],
      "Past members": [
         "Bob Rupe",
         "Mary Rowell",
         "John Galway",
         "John Ross",
         "Brian Doherty",
         "Graham Maby",
         "Kenny Margolis",
         "J.D. Foster",
         "Darren Hess",
         "Tom Freund",
         "Scott Garber",
         "Manny Verzosa",
         "R. Walt Vincent",
         "Gary Sunshine",
         "Jon Tessler",
         "Josema X",
         "Angel Cubero",
         "Drew Glackin",
         "Jeff Muendel"
      ]
   }
}