{
   "Name": "Spread Eagle (band)",
   "Sections": [
      "1 Biography",
      "1.1 Early years",
      "1.2 Spread Eagle",
      "1.3 Open To The Public",
      "1.4 Post Spread Eagle",
      "1.5 2006 Reunion",
      "1.6 Recent",
      "2 Band members",
      "2.1 Current",
      "2.2 Former",
      "2.3 Session",
      "2.4 Tour members",
      "2.5 Classic line up",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Spread Eagle  is an American hard rock band from New York City, New York, United States. After only a few months of formation they were signed by MCA/Universal Records. They've released three albums: Spread Eagle (1990),  Open To The Public (1993) and Subway To The Stars (2019).[1][2]\n",
         "Spread Eagle's bassist Rob De Luca is also a member of British rock band UFO.\n"
      ]
   },
   "Biography": {
      "Early years": {
         "text": [
            "In the late 1980s, founding members Paul DiBartolo, Rob De Luca and Tommi Gallo were playing in the Boston-based hard rock band Bang. In September 1986, Bang won the MTV Basement Tapes competition with the video for their song \"Summertime\".\n",
            "In 1989 guitarist Paul Di Bartolo (a.k.a. Salvadore Poe) traveled to New York City where he met singer Ray West. Paul was so impressed by his voice, that he immediately convinced bassist Rob De Luca and drummer Tommi Gallo to follow him to New York and start a new band with Ray, which became Spread Eagle.[3]\n",
            "After only a few months of rehearsing they signed with MCA/Universal Records.\n"
         ]
      },
      "Spread Eagle": {
         "text": [
            "As they were signed while still rehearsing for their first gig, they wrote most songs for their 1990 debut album Spread Eagle in the recording studio. Receiving little promotion from MCA the band produced the video for \"Scratch Like A Cat\" using their own money and with the help of friends.[1][4]\n"
         ]
      },
      "Open To The Public": {
         "text": [
            "The band spent a lot of time on the road before recording their follow-up album and began burning out. First to leave was drummer Tommi Gallo. He was replaced by Kirke Blankenship who did not stay for long and played drums on one track (High Horses) of the second album Open To The Public. That album was then recorded with session drummers John Macaluso from TNT and Thommy Price from Joan Jett and the Blackhearts.[1] Open to the Public was released in 1993. Dave Femia played the drums on the following tour.[5] The new record did not meet the expectations of their fans and Grunge took over the music scene. So in 1995 Spread Eagle resigned and split up.\n"
         ]
      },
      "Post Spread Eagle": {
         "text": [
            "Ray West turned his back on the music business for a while. He is also singing in a band called Weapons Of Anew.\n",
            "Paul DiBartolo changed his name to Salvadore Poe and wrote/recorded songs for Swedish singer Lisa Ekdahl who was his wife at that time. He is fascinated by Indian culture and spends much of his time there.[3]\n",
            "Rob De Luca started new bands called Ouijipig,[6] and OF EARTH.[7] He's also worked as studio bassist and touring bassist for many bands including UFO, Sebastian Bach, Joan Jett and the Blackhearts, Helmet, George Lynch[8] and Vinnie Moore [9]\n",
            "Tommi Gallo is a member of the band Iron Rage and formerly of Bang.[10] Tommi is a talented artist who created the artwork for the Spread Eagle debut album cover. He lives, plays and paints in Worcester, MA.[11]\n"
         ]
      },
      "2006 Reunion": {
         "text": [
            "In 2006 Rob De Luca and Ray West reformed Spread Eagle.[12] Their debut album which had been out of print for over 10 years was remastered and re-released by the independent label Lovember Records. They started touring in 2006 with Chris Caffery on guitar and John Macaluso on drums.[13] There were only a few shows.\n"
         ]
      },
      "Recent": {
         "text": [
            "They found new guitarist Dennis Kimak and Rob De Luca returned to New York from touring with Sebastian Bach and UFO. In December 2010 Rik De Luca drummer and cousin of Rob De Luca joined the band and they toured throughout the northeast United States. Their debut album was voted as one of the top 20 glam albums of all time (along with Guns N' Roses, Mötley Crüe, Hanoi Rocks and Skid Row):[14] In 2012 guitarist Dennis Kimak quit and was replaced by Ziv Shalev who played the first 2 shows with Spread Eagle in December 2012. In 2017 Spread Eagle confirmed several tour dates in Europe, including the Hull Metal Heaven and HRH Sleaze festivals.[15]\nIn January 2018 Spread Eagle signed to Frontiers SRL Records for a 2019 studio album release.[16]\nIn May 2019 Spread Eagle announce their new studio album will be released on August 9 via Frontiers SRL Records.[17]\nOn May 23, 2019 Frontiers Music SRL released the new Spread Eagle video \"Sound Of Speed\" from the upcoming album Subway To The Stars.[18]\n"
         ]
      }
   },
   "Band members": {
      "Current": {},
      "Former": {},
      "Session": {},
      "Tour members": {},
      "Classic line up": {}
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Spread Eagle  is an American hard rock band from New York City, New York, United States. After only a few months of formation they were signed by MCA/Universal Records. They've released three albums: Spread Eagle (1990),  Open To The Public (1993) and Subway To The Stars (2019).[1][2]\n",
      "Spread Eagle's bassist Rob De Luca is also a member of British rock band UFO.\n",
      "In the late 1980s, founding members Paul DiBartolo, Rob De Luca and Tommi Gallo were playing in the Boston-based hard rock band Bang. In September 1986, Bang won the MTV Basement Tapes competition with the video for their song \"Summertime\".\n",
      "In 1989 guitarist Paul Di Bartolo (a.k.a. Salvadore Poe) traveled to New York City where he met singer Ray West. Paul was so impressed by his voice, that he immediately convinced bassist Rob De Luca and drummer Tommi Gallo to follow him to New York and start a new band with Ray, which became Spread Eagle.[3]\n"
   ]
}