{
   "Name": "Startisan",
   "Sections": [
      "Summary",
      "History"
   ],
   "Summary": {
      "text": [
         "Startisan, formerly known as Streamline, is an American rock band originally from Rochester, New York. They have released two independent EPs. The band consists of Mike Hogan, Jon Scholl, Andrew Gaultier, Chris Jones, and Buck Langston. Brian Ireland, John Viavattine, Derek DeBlieux, and Brad Ourso are former members. After a stint in Los Angeles, California, Startisan now officially operates from Baton Rouge, Louisiana.\n",
         "Startisan has played with bands including Switchfoot, Daughtry, Theory Of A Deadman, Seether, and Gavin DeGraw.\n"
      ]
   },
   "History": {
      "text": [
         "Streamline began in Rochester in 2003 with vocalist/guitarist Mike Hogan and keyboardist Jon Scholl. The two were later joined by bassist John Viavattine and the group eventually moved to Los Angeles.\n",
         "It was in Los Angeles that Streamline met veteran drummer Brian Ireland of Something Corporate. Ireland was arriving at the studio for the first day of recording drum tracks for former Something Corporate guitarist William Tell's 2007 debut album, You Can Hold Me Down, when he ran into Hogan and Scholl, who were leaving the same studio. In a 2008 interview, Ireland said, \"They knew who I was. Later they phoned me at the studio and asked if I would sit in and do a drumming session ... It was for 'All I Need.' I was so impressed with them. They are great players and have a real sensibility for music.\"[1] Ireland recorded the track with the group and in December 2006, it was announced that he would be joining the band's official line-up.\n",
         "Meanwhile, guitarist Brad Ourso moved from Baton Rouge to Los Angeles. Ourso joined a pop-rock band called On The Surface, which features Ireland's then-girlfriend Heather Fogarty as vocalist. Through this connection, Ourso met Hogan and the two hit it off. In 2007, Ourso left On The Surface to join Streamline.[2] \"He left their band maybe two weeks after I broke up with her,\" Ireland said. \"He came over and jammed with us one day, which was supposed to be an innocent jam session, and it ended up in him calling my ex-girlfriend to tell her he was leaving the band.\"[3]\n",
         "Streamline's self-titled EP was named Best EP of 2007 by The Album Project[4] and featured as part of AbsolutePunk's Unsigned Showcase.[5]\n",
         "In 2008, Streamline moved their base of operations to Baton Rouge.[6] The band has cited the desire to increase the ease of touring both the east and west coasts among the reasons for the move.\n",
         "In April 2009, Streamline released their second EP, The Alchemist and the Arsonist.\n",
         "In Nov. 2009, Ireland and Ourso left Streamline.\n",
         "In 2010, Streamline announced that they would be playing three shows as part of the South by Southwest (SXSW) music festival in Austin, Texas.\n",
         "As of January 5, 2011 Streamline has changed their name to Startisan and is planning on releasing a full-length album.\n"
      ]
   },
   "coreData": [
      "Startisan, formerly known as Streamline, is an American rock band originally from Rochester, New York. They have released two independent EPs. The band consists of Mike Hogan, Jon Scholl, Andrew Gaultier, Chris Jones, and Buck Langston. Brian Ireland, John Viavattine, Derek DeBlieux, and Brad Ourso are former members. After a stint in Los Angeles, California, Startisan now officially operates from Baton Rouge, Louisiana.\n",
      "Startisan has played with bands including Switchfoot, Daughtry, Theory Of A Deadman, Seether, and Gavin DeGraw.\n",
      "Streamline began in Rochester in 2003 with vocalist/guitarist Mike Hogan and keyboardist Jon Scholl. The two were later joined by bassist John Viavattine and the group eventually moved to Los Angeles.\n",
      "It was in Los Angeles that Streamline met veteran drummer Brian Ireland of Something Corporate. Ireland was arriving at the studio for the first day of recording drum tracks for former Something Corporate guitarist William Tell's 2007 debut album, You Can Hold Me Down, when he ran into Hogan and Scholl, who were leaving the same studio. In a 2008 interview, Ireland said, \"They knew who I was. Later they phoned me at the studio and asked if I would sit in and do a drumming session ... It was for 'All I Need.' I was so impressed with them. They are great players and have a real sensibility for music.\"[1] Ireland recorded the track with the group and in December 2006, it was announced that he would be joining the band's official line-up.\n"
   ],
   "infobox": {
      "Also known as": [
         "Streamline (2003 - Jan. 2011)"
      ],
      "Origin": [
         "Rochester, New York, United States"
      ],
      "Genres": [
         "Indie rock, Alternative rock"
      ],
      "Years active": [
         "2003 - present"
      ],
      "Associated acts": [
         "Startisan, Something Corporate, William Tell, On The Surface"
      ],
      "Website": [
         "[1]",
         "StreamlineWorld.com"
      ],
      "Members": [
         "Mike Hogan",
         "Jon Scholl",
         "Andrew Gaultier",
         "Buck Langston",
         "Chris Jones"
      ],
      "Past members": [
         "Brian Ireland",
         "Derek DeBlieux",
         "Brad Ourso",
         "John Viavattine"
      ]
   }
}