{
   "Name": "Steely Dan",
   "rawData": [
      "Steely Dan is an American rock band founded in 1971 by core members Walter Becker (guitars, bass, backing vocals) and Donald Fagen (keyboards, lead vocals). Blending elements of rock, jazz, latin music, R&B, blues and sophisticated studio production with cryptic and ironic lyrics, the band enjoyed critical and commercial success starting from the early 1970s until breaking up in 1981. Initially the band had a core lineup, but in 1974, Becker and Fagen retired the band from live performances altogether to become a studio-only band, opting to record with a revolving cast of session musicians. Rolling Stone has called them \"the perfect musical antiheroes for the Seventies\".\n",
      "After the group disbanded in 1981, Becker and Fagen were less active throughout most of the next decade, though a cult following remained devoted to the group. Since reuniting in 1993, Steely Dan has toured steadily and released two albums of new material, the first of which, Two Against Nature, earned a Grammy Award for Album of the Year.  They have sold more than 40 million albums worldwide and were inducted into the Rock and Roll Hall of Fame in March 2001. VH1 ranked Steely Dan at No. 82 on their list of the 100 Greatest Musical Artists of All Time. Rolling Stone ranked them No. 15 on its list of the 20 Greatest Duos of All Time. Founding member Walter Becker died on September 3, 2017, leaving Fagen as the sole official member.\n",
      "Becker and Fagen met in 1967 at Bard College, in Annandale-on-Hudson, New York. As Fagen passed by a café, The Red Balloon, he heard Becker practicing the electric guitar. In an interview, Fagen recounted the experience: \"I hear this guy practicing, and it sounded very professional and contemporary. It sounded like, you know, like one of them colored people, really.\" He introduced himself to Becker and asked, \"Do you like jazz?\" Discovering that they enjoyed similar music, the two began writing songs together.\n"
   ],
   "infobox": {
      "Origin": [
         "Annandale-on-Hudson, New York, United States"
      ],
      "Genres": [
         "Jazz rock",
         "soft rock[1]",
         "pop rock[2]"
      ],
      "Years active": [
         "1971–1981, 1993–present"
      ],
      "Labels": [
         "ABC",
         "MCA",
         "Giant",
         "Reprise",
         "Warner Bros."
      ],
      "Associated acts": [
         "Jay and the Americans",
         "Doobie Brothers",
         "New York Rock and Soul Revue",
         "Dukes of September Rhythm Revue",
         "Toto[3]",
         "Larry Carlton"
      ],
      "Website": [
         "steelydan.com"
      ],
      "Members": [
         "Donald Fagen"
      ],
      "Past members": [
         "Walter Becker (deceased)",
         "Jeff \"Skunk\" Baxter",
         "Denny Dias",
         "Jim Hodder (deceased)",
         "David Palmer",
         "Royce Jones",
         "Michael McDonald",
         "Jeff Porcaro (deceased)"
      ]
   },
   "albums": []
}