{
   "Name": "Teenage Jesus and the Jerks",
   "Sections": [
      "1 Background",
      "2 Musical style and philosophy",
      "3 Discography",
      "3.1 Singles and EPs",
      "3.2 Compilations",
      "3.3 Appearances",
      "4 Notes",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Teenage Jesus and the Jerks were an influential American no wave band, based in New York City, who formed part of the city's no wave movement.[1]\n"
      ]
   },
   "Background": {
      "text": [
         "Lydia Lunch met saxophonist James Chance at CBGB and moved into his two-room apartment. She started to combine her poetry with acoustic guitar and was spurred to start a band after seeing one of Mars' earlier performances.[2] Lunch found guitarist Reck at CBGB and recruited him as a drummer, later moving him to bass. They formed a band called the Scabs and briefly added Jody Harris to their lineup. Lunch knew Bradley Field through Miriam Linna and convinced him to join in early 1977.[3]\n",
         "The band put together a ten-minute set of very short songs.[4] It released only a handful of singles.\n",
         "Featured on the seminal No New York LP, a showcase of the early no wave scene, compiled and produced by Brian Eno, the group left behind little more than a dozen complete recorded songs. Most of the surviving titles were collected on the eighteen-minute career retrospective compilation Everything, released in 1995 through Atavistic Records. However, other studio versions of several songs exist, alongside a few live recordings.\n",
         "The group disbanded at the end of 1979, only reuniting briefly in 2008 for a small number of performances with former bassist Jim Sclavunos on drums and Thurston Moore on bass guitar.[5]\n"
      ]
   },
   "Musical style and philosophy": {
      "text": [
         "In his book Rip It Up and Start Again: Postpunk 1978–1984, Simon Reynolds identifies Teenage Jesus and the Jerks as an exercise in rock sacrilege:\n",
         "Teenage Jesus and the Jerks, and their comrade bands Mars, Contortions and DNA, defined radicalism not as a return to roots but as deracination. Curiously, the no wave groups staged their revolt against rock tradition by using the standard rock format of guitars, bass and drums. It was as if they felt the easy electronic route to making post-rock noise was too easy. Instead, they used rock's tools against itself. Which is why no wave music irresistibly invites metaphors of dismemberment, desecration, defiling rock's corpse.[6]",
         "Lydia Lunch has voiced her disdain for punk rock, claiming in Rip It Up: \"I hated almost the entirety of punk rock. I don't think that no wave had anything to do with it. Who wanted chords, all these progressions that had been used to death in rock? To play slide guitar I'd use a knife, a beer bottle... glass gave the best sound. To this day I still don't know a single chord on the guitar.\"[6]\n"
      ]
   },
   "Discography": {
      "Singles and EPs": {},
      "Compilations": {},
      "Appearances": {}
   },
   "Notes": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Teenage Jesus and the Jerks were an influential American no wave band, based in New York City, who formed part of the city's no wave movement.[1]\n",
      "Lydia Lunch met saxophonist James Chance at CBGB and moved into his two-room apartment. She started to combine her poetry with acoustic guitar and was spurred to start a band after seeing one of Mars' earlier performances.[2] Lunch found guitarist Reck at CBGB and recruited him as a drummer, later moving him to bass. They formed a band called the Scabs and briefly added Jody Harris to their lineup. Lunch knew Bradley Field through Miriam Linna and convinced him to join in early 1977.[3]\n",
      "The band put together a ten-minute set of very short songs.[4] It released only a handful of singles.\n",
      "Featured on the seminal No New York LP, a showcase of the early no wave scene, compiled and produced by Brian Eno, the group left behind little more than a dozen complete recorded songs. Most of the surviving titles were collected on the eighteen-minute career retrospective compilation Everything, released in 1995 through Atavistic Records. However, other studio versions of several songs exist, alongside a few live recordings.\n"
   ],
   "infobox": {
      "Also known as": [
         "Teenage Jesus & the Jerks"
      ],
      "Origin": [
         "New York, United States"
      ],
      "Genres": [
         "No wave"
      ],
      "Years active": [
         "1976–1979, 2008"
      ],
      "Labels": [
         "Migraine, ZE, Celluloid"
      ],
      "Associated acts": [
         "8 Eyed Spy, Beirut Slump, Lydia Lunch, James Chance and the Contortions, Friction"
      ],
      "Past members": [
         "Lydia Lunch",
         "James Chance",
         "Reck",
         "Bradley Field",
         "Gordon Stevenson",
         "Jim Sclavunos"
      ]
   }
}