{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "The Toilet Böys formed in 1995 and their first show was as opening act for Deborah Harry, who performed with her own band at the rock club Don Hill's in New York City.[7] They were not formed as a backing band for Deborah Harry as has been published and believed. \n",
         "Toilet Böys lead singer Miss Guy (who was house-DJ at the club)[2] formed the band to fulfill a dream of playing a show with Harry, one of his idols, just for one night. He put together a band specifically for this occasion, and it was only intended to be a one-time performance. The response was overwhelmingly positive, with the result being the booking of Toilet Böys for several additional gigs. Within a year and a half, the Toilet Böys line-up had solidified.[8]\n",
         "After their break up in 2003, Sean and Rocket formed the group Afterparty. Sean, under the name Chopper,[9] performed his normal guitar duties as well as being the band's lead singer.\n",
         "On May  8th and 9th, 2021, the Toilet Boys will once again reunite at the Webster Hall playing With The Lunachicks on those dates.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Toilet Böys are an American rock and roll band from New York City, United States. The band's original line-up is made up of Miss Guy, Sean Pierce, Electric Eddie, Rocket, and Adam Vomit. Toilet Böys have toured world-wide supporting musical acts such as Red Hot Chili Peppers, Nashville Pussy,[1] Orgy,[2] The Damned, Dee Dee Ramone & Deborah Harry. They were known for a highly energetic stage show that included spark-showers, smoke, lasers, strobes, synchronized flame-columns, cheerleaders, confetti cannons, burning guitars and fire breathing performed by lead guitarist Sean during the finale. \n",
         "An album of unreleased material, demos, and remixes titled Sex Music was released in 2007.[3]\n",
         "Toilet Böys reunited and played on June 14, 2010 at Le Poisson Rouge in New York City.[4] Most of the band is back including Miss Guy, Sean, Eddie and Adam with the addition of Shane on guitar.[5] They played the Azkena Rock festival in Spain in June 2010.[6]\n"
      ]
   },
   "Title": "Toilet Böys - Wikipedia"
}