{
   "Name": "Trachtenburg Family Slideshow Players",
   "Sections": [
      "1 Overview",
      "2 History",
      "3 Discography",
      "4 DVD releases",
      "5 Unreleased songs",
      "6 References"
   ],
   "Summary": {
      "text": [
         "The Trachtenburg Family Slideshow Players were an American indie-rock/art pop family band. It consisted of main vocalist Jason Trachtenburg, his wife Tina, and their only child, Rachel.\n"
      ]
   },
   "Overview": {
      "text": [
         "The band's members consisted of father, Jason Trachtenburg, who played guitar and piano and sang; mother, Tina Piña, who ran the slide projector and was a backup vocalist; and daughter, Rachel, who played the drums and sang backup.[1] Born on December 10, 1993, Rachel was only six years old when she began performing publicly.\n",
         "Their trademark was the slideshow itself: slides collected from \"estate sales, garage sales, thrift stores, etc.\" were constantly shown in order to \"turn the lives of annonymous  [sic] strangers into pop-rock musical expos[é]s based on the contents of these slide collections\". The band sings about things that occurred in the places shown in the slides, such as public execution (Mountain Trip to Japan, 1959) and McDonald's' competitors (Wendy's, Sambo's and Long John Silver's) \"using network television to take advantage of efficiency\".[2]\n"
      ]
   },
   "History": {
      "text": [
         "Jason first met Tina at a Greenwich Village open-mic in New York City around 1989. They soon moved to Seattle, Washington, where their daughter, Rachel, was born in 1993. The family ran a dog-walking business called the Dog Squad by day while Jason was an open-mic performer by night. However, his music act, the Terriers, failed to find audiences.\n",
         "While dog-walking with Rachel, Tina found an old slide projector and a box of slides at an estate sale from a 1959 family trip to Japan. When Tina suggested that Jason use the slides in his music, he wrote a song to accompany the slides, \"Mountain Trip To Japan, 1959\". The song was later released on the debut album Vintage Slide Collections From Seattle, Vol 1. Eventually, the Trachtenburgs formed together, with Jason playing keyboards and guitar and providing vocals, Tina operating the slide projector and Rachel playing harmonica (later playing drums). The trio performed their act at a local talent show and won first place and a $500 prize. They continued their act and later moved to New York City. The Trachtenburgs disbanded in 2008 after Rachel formed her own girl band, Supercute! in 2009, and Jason formed his band, The Pendulum Swings, also in 2009. Tina continues her artistic endeavors in the parks of Manhattan, where she is known as the performance artist Mother Pigeon.[3]\n"
      ]
   },
   "Discography": {},
   "DVD releases": {},
   "Unreleased songs": {},
   "References": {},
   "coreData": [
      "The Trachtenburg Family Slideshow Players were an American indie-rock/art pop family band. It consisted of main vocalist Jason Trachtenburg, his wife Tina, and their only child, Rachel.\n",
      "The band's members consisted of father, Jason Trachtenburg, who played guitar and piano and sang; mother, Tina Piña, who ran the slide projector and was a backup vocalist; and daughter, Rachel, who played the drums and sang backup.[1] Born on December 10, 1993, Rachel was only six years old when she began performing publicly.\n",
      "Their trademark was the slideshow itself: slides collected from \"estate sales, garage sales, thrift stores, etc.\" were constantly shown in order to \"turn the lives of annonymous  [sic] strangers into pop-rock musical expos[é]s based on the contents of these slide collections\". The band sings about things that occurred in the places shown in the slides, such as public execution (Mountain Trip to Japan, 1959) and McDonald's' competitors (Wendy's, Sambo's and Long John Silver's) \"using network television to take advantage of efficiency\".[2]\n",
      "Jason first met Tina at a Greenwich Village open-mic in New York City around 1989. They soon moved to Seattle, Washington, where their daughter, Rachel, was born in 1993. The family ran a dog-walking business called the Dog Squad by day while Jason was an open-mic performer by night. However, his music act, the Terriers, failed to find audiences.\n"
   ],
   "infobox": {
      "Genres": [
         "Anti-folk"
      ],
      "Years active": [
         "2000–2011"
      ],
      "Labels": [
         "Bar-None, Tired and Lonesome, Cass, Sarathan, Tummy Touch"
      ],
      "Past members": [
         "Jason Trachtenburg",
         "Tina Piña Trachtenburg",
         "Rachel Piña Trachtenburg"
      ]
   }
}