{
   "Name": "White Zombie (band)",
   "rawData": [
      "White Zombie was an American heavy metal band that formed in 1985. Based in New York City, White Zombie was originally a noise rock band, and was known for its later heavy metal-oriented sound. Their best-known songs include \"Thunder Kiss '65\", \"Black Sunshine\" and \"More Human than Human\". The group officially disbanded in 1998. In 2000, White Zombie was included on VH1's 100 Greatest Artists of Hard Rock, ranking at No. 56.\n",
      "White Zombie was co-founded by Rob Zombie, after coming up with the band idea in 1985 while attending Parsons School of Design in his junior year. Zombie's girlfriend at the time, Sean Yseult, was the other co-founder. She had been playing the Farfisa keyboard in the band LIFE with Ivan de Prume, but the band soon broke up. Ena Kostabi owned a recording studio, which he would rent out to different bands. When he met Yseult, she asked if he could teach her to play bass. They then recruited Peter Landau to play drums and began to write and record songs. White Zombie's first release, Gods on Voodoo Moon, was an EP and was recorded on October 18, 1985. It was released under the band's own label Silent Explosion, under which they would release most of their early work. Only 300 copies were pressed, of which only 100 were sold; the band members still retain possession of the remaining 200.\n",
      "In 1986, Zombie hired Tim Jeffs, his Parsons School of Design roommate, to play guitar to replace Ena Kostabi, and Yseult brought in de Prume from their days in the band LIFE as the replacement for Landau. It was at this time the band started touring, making their live performance debut at CBGB on April 28, 1986. White Zombie released their second EP, Pig Heaven, that year. The release contained two songs, \"Pig Heaven\" and \"Slaughter the Grey\". The EP was recorded at 6/8 Studios in NoHo in New York City. Other songs that were recorded during the session but never released were titled \"Follow Wild\", \"Rain Insane\", \"Paradise Fireball\", and \"Red River Flow\". After touring for a year in the band, Tim Jeffs left and was replaced by Tom Guay, often known as Tom Five. The band released a second pressing of Pig Heaven with different cover art, but retained the same recording with Jeffs on guitar. Only 500 copies of each pressing were released on vinyl.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, U.S."
      ],
      "Genres": [
         "Heavy metal",
         "groove metal",
         "industrial metal",
         "alternative metal",
         "noise rock (early)"
      ],
      "Years active": [
         "1985–1998"
      ],
      "Labels": [
         "Silent Explosion",
         "Caroline",
         "Geffen"
      ],
      "Website": [
         "whitezombieofficial.com"
      ],
      "Past members": [
         "Rob Zombie",
         "Sean Yseult",
         "Ena Kostabi",
         "Peter Landau",
         "Ivan de Prume",
         "Tim Jeffs",
         "Tom Five",
         "John Ricci",
         "Jay Yuenger",
         "Phil Buerstatte",
         "John Tempesta"
      ]
   },
   "albums": [
      "Soul-Crusher",
      "Make Them Die Slowly",
      "La Sexorcisto: Devil Music Volume One",
      "Astro-Creep: 2000"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band that formed in [YEAR]. Based in New York City, [BAND_NAME] was originally a noise rock band, and was known for its later heavy metal-oriented sound. Their best-known songs include [SONG_NAME]. The group officially disbanded in [YEAR]. In [YEAR], [BAND_NAME] was included on VH1's 100 Greatest Artists of Hard Rock, ranking at No. 56.\n",
      "[BAND_NAME] was co-founded by Rob Zombie, after coming up with the band idea in [YEAR] while attending Parsons School of Design in his junior year. Zombie's girlfriend at the time, [PERSON_NAME_FULL_0_MALE], was the other co-founder. She had been playing the Farfisa keyboard in the band LIFE with Ivan de Prume, but the band soon broke up. [PERSON_NAME_FULL_1_FEMALE] owned a [GENRE] bands. When he met [PERSON_NAME_LAST_0], she asked if he could teach her to play bass. They then recruited Peter Landau to play drums and began to write and record songs. [BAND_NAME]'s first release, Gods on Voodoo Moon, was an EP and was recorded on [MONTH] 18, [YEAR]. It was released under the band's own label Silent Explosion, under which they would release most of their early work. Only 300 copies were pressed, of which only 100 were sold; the band members still retain possession of the remaining 200.\n",
      "In [YEAR], Zombie hired [PERSON_NAME_FULL_2_MALE], his Parsons School of Design roommate, to play guitar to replace [PERSON_NAME_FULL_1_FEMALE], and Yseult brought in de Prume from their days in the band LIFE as the replacement for Landau. It was at this time the band started touring, making their live performance debut at CBGB on [MONTH] 28, [YEAR]. [BAND_NAME] released their second EP, Pig Heaven, that year. The release contained two songs, [SONG_NAME]. After touring for a [GENRE] band, [PERSON_NAME_FULL_2_MALE] left and was replaced by [PERSON_NAME_FULL_0_MALE], often known as [PERSON_NAME_FIRST_0] Five. The band released a second pressing of Pig Heaven with different cover art, but retained the same recording with [PERSON_NAME_LAST_2] on guitar. Only 500 copies of each pressing were released on vinyl.\n"
   ]
}