{
   "Name": "Fifteen (band)",
   "rawData": [
      "Fifteen was a punk rock band formed by Jeff Ott and Jack Curran. According to Ott, the band's only consistent member in its 11-year history, Fifteen had a revolving door total of fifteen members by the time the group disbanded in 2000: Jack Curran, Mikey Mischief, Mark Moreno, Jean Repetto, Lucky Dog, Chris Flanagan, John Ogle, Jesse Wickman, Joe Cable, John Quintos, Scott Pierce, Jim Prior, Lisa D., Vanessa Bain and Ott himself.\n",
      "Fifteen formed in 1988 during the tail end of the Crimpshrine tour while Ott and Curran were writing songs together. After Crimpshrine broke up, Fifteen embarked on their first tour, in the summer of 1989. During this time, Jean Repetto played drums. Although the band drove across the country, they only played a handful of shows on this first tour. Upon returning from tour, Mike Goshert took over drums. Fifteen recorded their debut EP in April 1990 for Lookout! Records. Fifteen went on a more substantial tour in the summer of 1990 with Filth and Econochrist. Mark Moreno took over on drums and they recorded their first full-length album, Swain's First Bike Ride, in December 1990. In 1991, Rich \"Lucky Dog\" Gargano joined the band on bass. Curran switched over to second guitar briefly, before leaving the band in 1992. In summer of 1992, the band toured the US and Canada, and recorded their second album, The Choice of a New Generation. Afterwards, Lucky Dog and Mark Moreno left the band and Curran returned, joined by Jesse Wickman on drums. The band released their second EP and third album with Chris Flanagan on drums, and went on three more US tours before their first and only European tour in fall of 1994. Afterwards, Curran left for good. \n",
      "Fifteen released their 1995 album Extra Medium Kick Ball Star on their own Cool Guy Records label with John Ogle on bass, followed by their fifth album, Surprise!, after which the band broke up. Their final show on June 14 of 1996 was later released as the live record Allegra. The group reformed in late 1997 with former members Ott, Mark Moreno, and Jean Repetto, along with Scott Pierce. In 1999 they released Lucky on Subcity Records and participated in that label's first Take Action Tour. Most of the Lucky album, are song first done by a band that attempted to not have a name, but was named by others, Jeff, Tim, and Adam. This line-up dissolved following the departure of Jean during the album's recording, and then Scott leaving just after the Take Action Tour. A new line-up existed briefly, recording the Hush EP and the album Survivor, but this version of Fifteen did not tour. Fifteen broke up again in 2000.\n"
   ],
   "infobox": {
      "Origin": [
         "United States"
      ],
      "Genres": [
         "Punk"
      ],
      "Years active": [
         "1988–1996",
         "1998–2000"
      ],
      "Labels": [
         "Lookout Records, Grass Records, Sub City"
      ],
      "Associated acts": [
         "Crimpshrine, Monsula, East Bay Mud, No Dogs"
      ],
      "Past members": [
         "Jeff Ott",
         "Jack Curran",
         "Mikey Mischief",
         "Mark Moreno",
         "Jean Repetto",
         "Lucky Dog",
         "Chris Flanagan",
         "John Ogle",
         "Jesse Wickman",
         "Joe Cable",
         "John Quintos",
         "Scott Pierce",
         "Jim Prior",
         "Lisa D.",
         "Vanessa Bain"
      ]
   }
}