{
   "Discography": {
      "Albums": {},
      "CDRs": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "text": [
         "The musicians who have played in X27 include Oran Canfield (son of Jack Canfield of the Chicken Soup for the Soul franchise, drummer for:Child Abuse (band), Dig that body up it's alive, Caroliner and  author of Long Past Stopping), Sean Greathead (artist for:Garbage Pail Kids and Wacky Pack, member of: Nights), Massey, Terry Klawth (Mary Prankster, Jodie Foster's Army, Mighty Sphincter), among others.\n",
         "X27 has played shows with[2] The Fall (band), The Kills, Gossip, Métal Urbain, Xiu Xiu, Erase Errata, Roger Sisters, Tracy + the Plastics, Guitar Wolf, Deerhoof, 400 Blows, Les Georges Leningrad, Foetus, Grizzly Bear (band), Easy Action, Ex Models, and Bobby Conn to name a few.  X27 have toured with Coachwhips, Hawnay Troof, Numbers (band), The Flying Luttenbachers, The King Cobra (Rachel Carns) and Pink and Brown.\n",
         "They have played clubs such as the Knitting Factory NY, Bowery Ballroom, North Six (currently known as Music Hall of Williamsburg) in Brooklyn, Beachland Ballroom in Cleveland, Empty Bottle in Chicago, and Magicstick in Detroit.\n",
         "X27 has played SXSW and CMJ music festivals.  They have done live radio shows at Chicago's WNUR and WHPK and New York's WFMU.  X27 played the Mission Creek festival and the opening party for the Chicago Underground Film Festival which was also the premier of the MC5 documentary.\n",
         "X27 toured Europe, hitting France, Germany, Switzerland, and Italy.  X27 also hit the UK, playing an Artrocker Show, Unpeeled Party and Club Motherfucker.  In October 2006 they performed live in London for the fashion world at Nick Knight's Bal Masque, a party given in tribute to his career in photography by Moët & Chandon.\n",
         "Their 2005 album antilove was record by Steve Albini best known for his recording of Nirvana's In Utero and The Pixies' Surfer Rosa.\n",
         "\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Albums",
      "2.2 Singles",
      "2.3 CDRs",
      "3 Video",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "X27 is an American alternative rock band, formed in Chicago in 2000. They are known for their live shows and stripped-down noisy punk rock.  X27 is Carmen X and Rikkeh Suhtn (formerly of Duotron). They are currently based in Brooklyn, New York.\n",
         "The name X27 comes from the film Dishonored, where Marlene Dietrich plays Agent X27 who hides code in her music; it is not related to the X27 bus route in Brooklyn, where they are based. X27 are influenced by punk, experimental, contemporary classical, Music of North Africa, grunge, and 60's pop.[1] Rikkeh recently said, \"I want to make music for people who think AC/DC and Led Zeppelin are great American rock bands.\"[citation needed]\n"
      ]
   },
   "Title": "X27 - Wikipedia",
   "Video": {}
}