{
   "Name": "X27",
   "rawData": [
      "X27 is an American alternative rock band, formed in Chicago in 2000. They are known for their live shows and stripped-down noisy punk rock.  X27 is Carmen X and Rikkeh Suhtn (formerly of Duotron). They are currently based in Brooklyn, New York.\n",
      "The name X27 comes from the film Dishonored, where Marlene Dietrich plays Agent X27 who hides code in her music; it is not related to the X27 bus route in Brooklyn, where they are based. X27 are influenced by punk, experimental, contemporary classical, Music of North Africa, grunge, and 60's pop. Rikkeh recently said, \"I want to make music for people who think AC/DC and Led Zeppelin are great American rock bands.\"\n",
      "The musicians who have played in X27 include Oran Canfield (son of Jack Canfield of the Chicken Soup for the Soul franchise, drummer for:Child Abuse (band), Dig that body up it's alive, Caroliner and  author of Long Past Stopping), Sean Greathead (artist for:Garbage Pail Kids and Wacky Pack, member of: Nights), Massey, Terry Klawth (Mary Prankster, Jodie Foster's Army, Mighty Sphincter), among others.\n"
   ],
   "infobox": {
      "Origin": [
         "Brooklyn, New York, United States"
      ],
      "Genres": [
         "Alternative rock",
         "noise rock",
         "garage rock"
      ],
      "Years active": [
         "2001–present"
      ],
      "Labels": [
         "Narnack Records",
         "Show & Tell Recordings"
      ],
      "Website": [
         "www.x27labs.com"
      ],
      "Members": [
         "Carmen X",
         "Rikkeh Suhtn"
      ],
      "Past members": [
         "Massey",
         "Terry Klawth",
         "Sean Greathead",
         "Oran Canfield"
      ]
   },
   "albums": [
      "Your Neu Favourite Band",
      "Antilove"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band, formed in Chicago in [YEAR]. They are known for their live shows and stripped-down noisy punk rock.  [BAND_NAME] is Carmen X and Rikkeh Suhtn (formerly of Duotron). They are currently based in Brooklyn, New York.\n",
      "The name [BAND_NAME] comes from the film Dishonored, where [MONTH]lene Dietrich plays Agent [BAND_NAME] who hides code in her music; it is not related to the [BAND_NAME] bus route in Brooklyn, where they are based. [BAND_NAME] are influenced by punk, experimental, contemporary classical, Music of North Africa, grunge, and 60's pop. Rikkeh recently said, [SONG_NAME]\n",
      "The musicians who have played in [BAND_NAME] include Oran [PERSON_NAME_LAST_0] (son of [PERSON_NAME_FULL_0_MALE] of the Chicken Soup for the Soul franchise, drummer for:Child Abuse (band), Dig that body up it's alive, Caroliner and  author of Long Past Stopping), [PERSON_NAME_FULL_1_MALE] (artist for:Garbage Pail Kids and Wacky Pack, member of: Nights), Massey, Terry Klawth ([MONTH]y Prankster, [PERSON_NAME_FULL_2_FEMALE]'s Army, Mighty Sphincter), among others.\n"
   ]
}