{
   "Band members": {
      "Timeline": {}
   },
   "Discography": {},
   "External links": {},
   "History": {
      "Andholan (2014-Current)": {
         "text": [
            "Mekaal Hasan Band's latest album featuring the all new lineup was released September 2014 in Pakistan and India across iTunes, Taazi, Amazon Music and other platforms.[5] Mekaal Hasan Band released just one video from a live performance of the track 'Ghunghat', despite being a live performance it won song of the year in Express Tribune's Critics Choice and in the reader polls[6] and also won song of the year by Dawn News.[7] The album was removed from GIMA Awards for having \"foreign roots\", although the album featured Indian vocalist Sharmistha Chatterjee in all the songs.[8]\n"
         ]
      },
      "Early years (1995-2004)": {
         "text": [
            "Songwriter Mekaal Hasan, born in Lahore, Pakistan, was surrounded by music since childhood. His father, Masood Hasan, passionate for jazz music influenced him throughout his early years. After graduating from Government College, Lahore, Mekaal studied music at the Berklee College of Music, Boston and his stay there exposed him to a wide variety of music and musicians, many of whom are influences to this day.[2]\n",
            "In March 2001, Mekaal collaborated with Pete Lockett in a series of concerts countrywide featuring music written for Pete and classical artists by Mekaal.\n"
         ]
      },
      "Pepsi Battle of the Bands": {
         "text": [
            "The band entered the first season of Pepsi Battle of the Bands, in an effort to win the competition and earn a lucrative album deal from Pepsi. The band finished 3rd, behind Aaroh and Entity Paradigm who finished 1st and 2nd respectively.\n"
         ]
      },
      "Sampooran (2004-2008)": {
         "text": [
            "Mekaal Hasan Band released their debut album, \"Sampooran\", in 2004 by EMI/Virgin Records.\n"
         ]
      },
      "Saptak (2009-2010)": {
         "text": [
            "Mekaal Hasan Band, released their second album in October, 2009. They also released their video of a single \"Chal Bulleya\" on 2 October 2009.\nOn 3 February 2010, the band's vocalist Javed Bashir decided to part ways after working along with the band for 8 years. On 26 December, in an online poll by Dawn News the band's video for their single, \"Chal Bulleya\", was voted as the best music video of 2010.[4]\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Early years (1995-2004)",
      "1.2 Pepsi Battle of the Bands",
      "1.3 Sampooran (2004-2008)",
      "1.4 Saptak (2009-2010)",
      "1.5 Andholan (2014-Current)",
      "2 Discography",
      "3 Band members",
      "3.1 Timeline",
      "4 See also",
      "5 References",
      "6 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "Mekaal Hasan Band (Urdu: میکال حسن بینڈ‎, sometimes shortened to MHB) is an international sufi rock band formed in Lahore, Pakistan in 2000 by composer, singer-songwriter and guitarist Meekal Hasan.[1]\n",
         "The band members have roots in different genres, including pop, rock music, soul music, and black rock, the combination of each member has created a sound which has earned them fans from a variety of quarters.[2][3]\n"
      ]
   },
   "Title": "Mekaal Hasan Band - Wikipedia"
}