{
   "Name": "Furqan and Imran",
   "rawData": [
      "Furqan and Imran (Urdu: فرقان اور عمران‎),  commonly known as F&I) is the Pakistani musical band from Karachi which originated in 2013. The band mainly covers genres like Rock, Pop and Classical. The founding members of the band are Imran Butt as vocalist and Furqan Tunio as guitarist/lyricist/composer\n",
      "The band released its first song \"Main Jeeliya\" on SoundCloud in 2013, after some time it was selected for the soundtrack of the drama serial Ru Baru produced under the banner of Moomal Productions on Hum TV.\n",
      "The band released their second track \"Piya Re\" in 2014 by featuring Pakistani actress Mathira on it, by paying the tribute to Adnan Sami Khan's song \"Bheegi Bheegi Raaton Mein\". The band also produced a mashup cover track by combining two famous songs from India and Pakistan, \"Teri Deewani\" by Kailash Kher and \"Awari\" by the band Soch.\n"
   ],
   "infobox": {
      "Origin": [
         "Karachi, Pakistan"
      ],
      "Genres": [
         "Pop",
         "Rock",
         "Classical"
      ],
      "Years active": [
         "2013 (2013)–Present"
      ],
      "Labels": [
         "Flash and Bang Productions"
      ],
      "Website": [
         "www.reverbnation.com/fnimusic"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (Urdu: فرقان اور عمران‎),  commonly known as F&I) is the Pakistani musical band from Karachi which originated in [YEAR]. The band mainly covers genres like Rock, Pop and Classical. The founding members of the band are Imran Butt as vocalist and Furqan Tunio as guitarist/lyricist/composer\n",
      "The band released its first song \"Main Jeeliya\" on SoundCloud in [YEAR], after some time it was selected for the soundtrack of the drama serial Ru Baru produced under the banner of Moomal Productions on Hum TV.\n",
      "The band released their second track \"Piya Re\" in [YEAR] by featuring Pakistani actress Mathira on it, by paying the tribute to Adnan Sami Khan's song \"Bheegi Bheegi Raaton Mein\". The band also produced a mashup cover track by combining two famous songs from India and Pakistan, \"[PERSON_NAME_FULL_1_FEMALE]\" by [PERSON_NAME_FULL_0_FEMALE] and \"Awari\" by the band Soch.\n"
   ]
}