{
   "Name": "Ismail and Junaid",
   "Sections": [
      "1 Career",
      "2 Recognition",
      "3 See also",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Ismail and Junaid (Pashto: اسماعیل او جنید‎) is a Pashto musical band originating from Peshawar, Khyber Pakhtunkhwa[1] The band consists of two members - Ismail Khan, the lead vocalist, poet and composer and Junaid Javed, a guitarist, composer and supporting vocalist.\n"
      ]
   },
   "Career": {
      "text": [
         "Ismail was born in Peshawar in a family of political background hailing from Charsadda. Junaid is described as hailing from a \"multicultural background\".[2]\n",
         "Ismail and Junaid, both university students and college friends, were originally amateur artists who performed in front of friends and social circles. After receiving wide exposure and appreciation of their musical talent, the duo decided to take their music to the next level and formed a professional band.[3] Ismail and Junaid achieved first position in the All Pakistan Battle of the Bands contest at the Lahore University of Management Sciences (LUMS) in 2010. After forming their band, they debuted by soon releasing their first official song Qarar, a Pashto single. The song has been their most successful release till date and the duo achieved overnight fame following its release; the official music video of the song has acquired hundreds and thousands of views on YouTube[4] and was ranked as the second best Pashto song of all times by the Pashto Cultural Society.[1] It was able to achieve popularity even outside the country[5] and in the non-Pashtun Pakistani mainstream music audiences. The track hit radio and T.V channels all over the country and Goher Mumtaz, the lead guitarist of the pop rock band Jal, personally approached the duo to express his liking of the song.\nIn 2011, they released yet another song, Ranra (meaning \"light\"), an alternative folk single which is also in Pashto[6][7] and is breaking the records of Qarar as the fastest shared Pashto song on social websites.[8]\n",
         "As a musical group, Ismail and Junaid are praised for their ability of fusing eastern (Pashtun music) and western music and are regarded as one of the emerging bands in the Pashto and Pakistani musical scene. Much of their music employs the traditional use of the rubab instrument accompanied with rhythmic Pashto vocals, drawing influences from Sufi music and northern Pakistani folk music  as well as modernised western genres.[2]\n",
         "They have been interviewed by various media organisations, including the Voice of America and the American radio channel National Public Radio (NPR). The band has said that through its music, it aims to promote Pashtun culture on a larger platform and challenge stereotypes associated with it.[1] Among the band's future plans include releasing a full album which would contain songs in Pashto, Urdu and English.\n",
         "In May 2013, the band released a new single, \"Pakhwa\". The lyrics of the song are based on poetry by the famous Pashtun poet, Ameer Hamza Khan Shinwari.[9]\n"
      ]
   },
   "Recognition": {
      "text": [
         "In February 2012, Dawn News reported that the duo received the Young Achievers Award in music by the Tourism Corporation of Khyber Pakhtunkhwa.[10]\n",
         "From the new wave of pop music in the province of Khyber Pakhtunkhwa, the band Ismail and Junaid have recently been given a Young Achievers Award in music by the Tourism Corporation of Khyber Pakhtunkhwa (TCKP). Having only released two songs so far, Qarar (peace) and Ranra (light), they’ve managed to make a name for themselves within Pakistan and in Pakhtun communities abroad.",
         "The Express Tribune has described Ismail and Junaid as having \"shaken up the Pashto musical scene\" and a band whose raw and refreshing approach to Pashto music makes it \"crucial to the future of Pakistani pop music.\"[1]\n"
      ]
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Ismail and Junaid (Pashto: اسماعیل او جنید‎) is a Pashto musical band originating from Peshawar, Khyber Pakhtunkhwa[1] The band consists of two members - Ismail Khan, the lead vocalist, poet and composer and Junaid Javed, a guitarist, composer and supporting vocalist.\n",
      "Ismail was born in Peshawar in a family of political background hailing from Charsadda. Junaid is described as hailing from a \"multicultural background\".[2]\n",
      "Ismail and Junaid, both university students and college friends, were originally amateur artists who performed in front of friends and social circles. After receiving wide exposure and appreciation of their musical talent, the duo decided to take their music to the next level and formed a professional band.[3] Ismail and Junaid achieved first position in the All Pakistan Battle of the Bands contest at the Lahore University of Management Sciences (LUMS) in 2010. After forming their band, they debuted by soon releasing their first official song Qarar, a Pashto single. The song has been their most successful release till date and the duo achieved overnight fame following its release; the official music video of the song has acquired hundreds and thousands of views on YouTube[4] and was ranked as the second best Pashto song of all times by the Pashto Cultural Society.[1] It was able to achieve popularity even outside the country[5] and in the non-Pashtun Pakistani mainstream music audiences. The track hit radio and T.V channels all over the country and Goher Mumtaz, the lead guitarist of the pop rock band Jal, personally approached the duo to express his liking of the song.\nIn 2011, they released yet another song, Ranra (meaning \"light\"), an alternative folk single which is also in Pashto[6][7] and is breaking the records of Qarar as the fastest shared Pashto song on social websites.[8]\n",
      "As a musical group, Ismail and Junaid are praised for their ability of fusing eastern (Pashtun music) and western music and are regarded as one of the emerging bands in the Pashto and Pakistani musical scene. Much of their music employs the traditional use of the rubab instrument accompanied with rhythmic Pashto vocals, drawing influences from Sufi music and northern Pakistani folk music  as well as modernised western genres.[2]\n"
   ],
   "infobox": {
      "Origin": [
         "Peshawar, Khyber Pakhtunkhwa, Pakistan."
      ],
      "Genres": [
         "Pashto, alternative folk, Sufi"
      ],
      "Years active": [
         "2010-present"
      ],
      "Members": [
         "Ismail Khan",
         "Junaid Javed"
      ]
   }
}