{
   "Name": "Mekaal Hasan Band",
   "rawData": [
      "Mekaal Hasan Band (Urdu: میکال حسن بینڈ‎, sometimes shortened to MHB) is an international sufi rock band formed in Lahore, Pakistan in 2000 by composer, singer-songwriter and guitarist Meekal Hasan.\n",
      "The band members have roots in different genres, including pop, rock music, soul music, and black rock, the combination of each member has created a sound which has earned them fans from a variety of quarters.\n",
      "Songwriter Mekaal Hasan, born in Lahore, Pakistan, was surrounded by music since childhood. His father, Masood Hasan, passionate for jazz music influenced him throughout his early years. After graduating from Government College, Lahore, Mekaal studied music at the Berklee College of Music, Boston and his stay there exposed him to a wide variety of music and musicians, many of whom are influences to this day.\n"
   ],
   "infobox": {
      "Origin": [
         "Lahore, Punjab, Pakistan"
      ],
      "Genres": [
         "Alternative rock, Sufi rock, Jazz"
      ],
      "Years active": [
         "2000–present"
      ],
      "Labels": [
         "EMI, MHB Music, Sadaf Stereo, The Musik Records"
      ],
      "Associated acts": [
         "Junoon, Zeb and Haniya, Noori, Entity Paradigm, Jal, Rubberband"
      ],
      "Website": [
         "www.mekaalhasanband.com"
      ],
      "Members": [
         "Mekaal Hasan",
         "Mohammad Ahsan Papu",
         "Sharmistha Chatterjee",
         "Sheldon D'Silva",
         "Gino Banks",
         "Agha Ibrahim Akram",
         "Amir Azhar"
      ],
      "Past members": [
         "Asad Abbas",
         "Riaz Ali Khan",
         "Sameer Ahmed",
         "Javed Bashir",
         "Kami Paul"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (Urdu: میکال حسن بینڈ‎, sometimes shortened to MHB) is an [GENRE] band formed in Lahore, Pakistan in [YEAR] by composer, singer-songwriter and guitarist Meekal Hasan.\n",
      "The band members have roots in different genres, including pop, rock music, soul music, and black rock, the combination of each member has created a [GENRE] a variety of quarters.\n",
      "Songwriter Mekaal [PERSON_NAME_LAST_0], born in Lahore, Pakistan, was surrounded by music since childhood. His father, [PERSON_NAME_FULL_0_MALE], passionate for jazz music influenced him throughout his early years. After graduating from Government College, Lahore, Mekaal studied music at the Berklee College of Music, Boston and his stay there exposed him to a [GENRE]"
   ]
}