{
   "Name": "The Sketches",
   "Sections": [
      "1 Saif Samejo",
      "1.1 Lahooti Live Sessions",
      "1.2 Lahooti Music Aashram",
      "2 Music",
      "2.1 Albums",
      "2.2 Dastkari",
      "2.3 YOتون",
      "2.4 Language",
      "2.5 Singles",
      "3 Band Members",
      "3.1 Timeline",
      "4 See also",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Sketches (Urdu: دی سکیچز‎) is a Sufi folk rock band from Jamshoro, Sindh, Pakistan, created by young musician Saif Samejo. \"Sindhi melody is very charming; there is enormous flexibility of words\" says Saif Samejo.[1] Their motherland has always been a major inspiration which is portrayed in their work. The love for their language and culture is aimed to bring back the departed old identity and to produce quality work in order to sensitize the world in general and the youth in specific about the grace of Sindhi language.[2][3]\n"
      ]
   },
   "Saif Samejo": {
      "Lahooti Live Sessions": {
         "text": [
            "[8] Lahooti Live Sessions launched by Saif Samejo in June 2013, is a weekly activity where different musicians from Sindh gather at Samejo's place to play live music.The audio and video of the performances is recorded and released on social media. Samejo himself is the front man of the Jamshoro-based rock band The Sketches, and the Lahooti Sessions are in the vein of something that he has wanted to do for a long time; cultural preservation in its most unadulterated form. Lahooti live sessions appears as a dream come true for him.[9]\n",
            "\"The aim was not only to record these musicians, but to do so in the highest possible audio-visual quality so that they can be presented in an equally good manner on social media,\" Samejo adds.[10]\n",
            "Around 50 different folk musicians have been recorded and released as part of the Lahooti live sessions and most of them have never been exposed to the camera or the recording equipment before. Some prominent names include Mai Dhai, Zulfiqar Fakir, Arieb Azhar, band Bell, two Changg players from Thatta – Ali Mohammad and Feroz Roonjho, Manjhi Faqeer, Talib Talari, Mai Hanjoo and Mohammad Hassan.[11]\n"
         ]
      },
      "Lahooti Music Aashram": {
         "text": [
            "[12] The Lahooti School of music is an extension of the Lahooti Live Sessions that Saif started a year ago, with the intent of preserving indigenous instruments and instrumentalists. Lahooti music School named as Lahooti Music Aashram is the first proper music School in Hyderabad/Jamshoro inaugurated in May 2014.\n",
            "The school offers a thirty-six-hour learning module in keyboards, guitars, bass guitars and drums amongst western instruments and chung, boreendo, shehnai, danbooro, sarangi, narr, sitar, flute and dholak/tabla,[13] along with other percussion instruments closer to home. Later on the students who show interest in the field of music production will also be provided with studio facilities to harness their skills.[14]\n"
         ]
      },
      "text": [
         "Saif Samejo is founder and lead vocalist of the Pakistani Sufi/Folk/Rock band The Sketches.\n",
         "In May 2014 he has opened the first music Aashram (School) in Hyderabad, Sindh named as \"Lahooti Music Aashram\".[4]\nWith a consistency The Sketches climbed up the ladder of success in not just parts of Sindh but the entire Pakistan with popular hits; Nind Nashe Vich, Rano, Raat, Main Sufi Hoon, Meena.\nRecently a new music album YOU (Sindhi: تون‎) [5] and a new song Jogi was launched.[6]\n",
         "Saif collaborated with Mai Dhai to present the original Rajasthani flavor of music besides this he also intended to collaborate with other artist through Lahooti Music Ashram.[7]\n"
      ]
   },
   "Music": {
      "Albums": {},
      "Dastkari": {
         "text": [
            "Their first album ‘Dastkari’ meaning ‘one’s own creation’ was released in 2010 with the Folk/Sufi/Rock songs in Sindhi, Saraiki and Urdu bearing a wide range of messages promoting peace, a rich cultural heritage, freedom of expression and love. The music created by The Sketches has proved the fact that \"Music has no language\", despite the fact that different languages have been used in their songs listeners from different age groups and backgrounds have appreciated each flavor that come out. The music blends so perfectly, creating novel symphonies that capture the soul.[15]\n"
         ]
      },
      "YOتون": {
         "text": [
            "The Band released their second full-length album YOU (Sindhi: تون‎) in 2016. Since 2015, the band was busy working on their second album – this album. Saif says this album doesn't just reflect their musical journey but the spiritual growth of the artistes as well.\n",
            "\"These were the years of reflection, of contemplation, of growth,\" says Saif. \"The world was only getting more divided, more isolated. If we were to find meaning of life we were find it here, in our everyday reality no matter how harsh that be. We couldn't wait for the world to get better. But once this realization struck us, we were suddenly able to appreciate the small joys of life with more gratitude. We were able to celebrate the brief moments of love and cherish them as long as they last. YOU, album is an effort to celebrate those moments, the moments of love and beatitude, that float by unnoticed in our everyday lives. YOU, is the celebration of everything that makes life, with all its brutality and transience, so precious.\"[16]\n"
         ]
      },
      "Language": {
         "text": [
            "The main language is Sindhi but some songs are also in  English and Urdu.\n"
         ]
      },
      "Singles": {}
   },
   "Band Members": {
      "Timeline": {}
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Sketches (Urdu: دی سکیچز‎) is a Sufi folk rock band from Jamshoro, Sindh, Pakistan, created by young musician Saif Samejo. \"Sindhi melody is very charming; there is enormous flexibility of words\" says Saif Samejo.[1] Their motherland has always been a major inspiration which is portrayed in their work. The love for their language and culture is aimed to bring back the departed old identity and to produce quality work in order to sensitize the world in general and the youth in specific about the grace of Sindhi language.[2][3]\n",
      "Saif Samejo is founder and lead vocalist of the Pakistani Sufi/Folk/Rock band The Sketches.\n",
      "In May 2014 he has opened the first music Aashram (School) in Hyderabad, Sindh named as \"Lahooti Music Aashram\".[4]\nWith a consistency The Sketches climbed up the ladder of success in not just parts of Sindh but the entire Pakistan with popular hits; Nind Nashe Vich, Rano, Raat, Main Sufi Hoon, Meena.\nRecently a new music album YOU (Sindhi: تون‎) [5] and a new song Jogi was launched.[6]\n",
      "Saif collaborated with Mai Dhai to present the original Rajasthani flavor of music besides this he also intended to collaborate with other artist through Lahooti Music Ashram.[7]\n"
   ]
}