{
   "Name": "Rizwan-ul-Haq",
   "Sections": [
      "1 Early life and education",
      "2 Vital Signs",
      "3 1995–present: Teri Gali and Gemini Studios",
      "4 References"
   ],
   "Summary": {
      "text": [
         "Rizwan–ul–Haq is a Pakistani guitarist, music composer, and backing vocalist, earning fame as lead guitarist for the acclaimed band, Vital Signs.[1]\n"
      ]
   },
   "Early life and education": {
      "text": [
         "Rizwan–ul–Haq grew up in Karachi and later Rawalpindi, Pakistan, and achieved his early education from Convent of Jesus and Mary, Karachi and higher education from St. Mary’s Academy, Rawalpindi. Before embarking on his career in music, he did his BSC degree in business management from University of Essex, England.\n",
         "He cites Carlos Santana, Bee Gees, ABBA and Nazia and Zoheb as his major influences during the youth.[2]\n"
      ]
   },
   "Vital Signs": {
      "text": [
         "After the departure of Salman Ahmad, Rohail Hyatt's childhood friend Rizwan–ul–Haq was asked to join the band as lead guitarist. Back in 1991, Rizwan had just returned from the UK. Eagerly looking for a job, he ran into Rohail Hyatt – the founding member and producer of Pakistan’s biggest pop band, Vital Signs. Rizwan left Islamabad for Karachi to join the band and the Signs began work on their third album in Rohail Hyatt's studios, Pyramid Studios, in 1993.[3] The third album Aitebar, which soon outsold its predecessor, Vital Signs 2, was an ultimate success. The Signs then started their nationwide tour and collaborated with Shoaib Mansoor who directed \"Guitar '93, a compilation of videos of Vital Signs' biggest hits thus far. It shot across the four provinces and was financed by Pepsi Pakistan Inc. Made for PTV, Guitar '93 was an entertaining document of the band's progress as one of the best pop/rock acts in Pakistan.\n",
         "With the release of Guitar'93, it was Rizwan who gained a lot of publicity and notability, and Signs also played their highest number of concerts in 1993. The biggest took place at the KMC Stadium in Karachi, a mega-concert headlined by the Signs and also consisting of performances from The Milestones, Awaz and the newly formed rock band, Arsh. Former member Salman Ahmad was present in the audience. It was after this concert Rohail first started to show signs of agitation regarding his growing dissatisfaction with Rizwan–ul–Haq's playing and his expenses. The success of Aetibar and Guitar'93 marked a great opportunity for Signs. The Signs marked its very first international tour to US in 1993, becoming the first Pakistan musical act to do so.[4]\n",
         "In 1994, the band did not extend the contract for its guitarist, Rizwan–ul–Haq, despite his urgings.[5] Rizwan was relieved and, according to Rohail Hyatt, \"shown the door\" after which Hyatt chose technical guitar whiz Aamir Zaki to become the band's new lead guitarist.[5] When asked about his journey in Vital Signs, Rizwan–ul–Haq said: “I have beautiful memories of my time with the Signs. In fact, I met the love of my life, my wife for the past 27 years, while on a tour with the Signs.”[6]\n",
         "Though the band's demise was never officially announced, by 1998 when the Signs were offered a deal by Pepsi Pakistan Inc. for another album, Rohail declined, signaling the end of Vital Signs.[3]\n"
      ]
   },
   "1995–present: Teri Gali and Gemini Studios": {
      "text": [
         "After recording the last album for Vital Signs in 1995, Rizwan–ul–Haq left the band and briefly worked as a music composer and recording producer for the PTV.[1] He soon went solo after the departure from Vital Signs and his solo debut single, Teri Gali, became a hit on MTV India.\n",
         "Following few moderately received covers, he went on to make tunes for television commercials and sound tracks for the movies. He also found passion in collecting music memorabilias and guitars — a total of 30 vintage Gibson Les Pauls.\n",
         "In an interview with Alyan Khan, he said:\n",
         "\"Being in Vital Signs was educational in itself; I think I learned more from being in Vital Signs and traveling around the world as a musician than I did spending three years in the university. Life's been good to me and I've no complaints. Allah has been really kind to me and still is very kind to me.\""
      ]
   },
   "References": {},
   "coreData": [
      "Rizwan–ul–Haq is a Pakistani guitarist, music composer, and backing vocalist, earning fame as lead guitarist for the acclaimed band, Vital Signs.[1]\n",
      "Rizwan–ul–Haq grew up in Karachi and later Rawalpindi, Pakistan, and achieved his early education from Convent of Jesus and Mary, Karachi and higher education from St. Mary’s Academy, Rawalpindi. Before embarking on his career in music, he did his BSC degree in business management from University of Essex, England.\n",
      "He cites Carlos Santana, Bee Gees, ABBA and Nazia and Zoheb as his major influences during the youth.[2]\n",
      "After the departure of Salman Ahmad, Rohail Hyatt's childhood friend Rizwan–ul–Haq was asked to join the band as lead guitarist. Back in 1991, Rizwan had just returned from the UK. Eagerly looking for a job, he ran into Rohail Hyatt – the founding member and producer of Pakistan’s biggest pop band, Vital Signs. Rizwan left Islamabad for Karachi to join the band and the Signs began work on their third album in Rohail Hyatt's studios, Pyramid Studios, in 1993.[3] The third album Aitebar, which soon outsold its predecessor, Vital Signs 2, was an ultimate success. The Signs then started their nationwide tour and collaborated with Shoaib Mansoor who directed \"Guitar '93, a compilation of videos of Vital Signs' biggest hits thus far. It shot across the four provinces and was financed by Pepsi Pakistan Inc. Made for PTV, Guitar '93 was an entertaining document of the band's progress as one of the best pop/rock acts in Pakistan.\n"
   ],
   "infobox": {
      "Birth name": [
         "Rizwan–ul–Haq"
      ],
      "Born": [
         "(1965-02-04)February 4, 1965",
         "South Kensington, London"
      ],
      "Genres": [
         "Rock music"
      ],
      "Occupation(s)": [
         "Guitarist"
      ],
      "Instruments": [
         "Electric guitar, Acoustic guitar"
      ],
      "Years active": [
         "1991–1995"
      ],
      "Labels": [
         "EMI Pakistan, Pepsi Pakistan Inc., Coke Studio"
      ],
      "Associated acts": [
         "Vital Signs"
      ]
   }
}