{
   "Name": "Forbidden (band)",
   "rawData": [
      "Forbidden was a thrash metal band from the San Francisco Bay Area, California. Formed in 1985 as Forbidden Evil, the group was founded by Jim Pittman and guitarist Robb Flynn. Since their formation, Forbidden have broken up and reformed twice with numerous line-up changes. The most recent line-up of the band was Russ Anderson (vocals), Craig Locicero (guitar), Matt Camacho (bass), Steve Smyth (guitar) and Sasha Horn (drums). After breaking up for the first time in 1997 and briefly returning in 2001, Forbidden reunited once again in 2007 but has been on an indefinite hiatus since 2012.\n",
      "Along with Death Angel, Vio-lence, Defiance, Testament and Exodus (the latter of the two had featured original Forbidden drummer Paul Bostaph), they were one of the most successful Bay Area thrash metal bands and earned a loyal fanbase in the underground music community and critical acclaim, with their debut album Forbidden Evil (1988) regarded by critics as a classic thrash metal album and the follow-up, Twisted into Form (1990), as something of a masterpiece within the “tech-thrash” genre. Their earlier style was technical thrash metal, but the band later experimented with alternative and groove metal elements on their fourth album Green (1997).\n",
      "Forbidden Evil was formed in early 1985 by drummer Jim Pittman and guitarist Robb Flynn (later of Vio-lence and Machine Head), with the original lineup being completed by Craig Locicero (guitar), Russ Anderson (vocals) and John Tegio (bass). Flynn named the band after a song by the Chicago band War Cry that was featured on the Metal Massacre 4 compilation.  They recorded demo tapes and appeared on the now-out-of-print live album The Eastern Front – Live At Ruthie's Inn. By 1986, Jim Pittman, John Tegio, and Robb Flynn left the band and were replaced by Paul Bostaph (drums), Matt Camacho (bass) and Glen Alvelais (guitar). The band's name was shortened to Forbidden in order to prevent the band from being mistakenly perceived as a black metal band.\n"
   ],
   "infobox": {
      "Also known as": [
         "Forbidden Evil (1985–1987)"
      ],
      "Origin": [
         "San Francisco Bay Area, California, United States"
      ],
      "Genres": [
         "Thrash metal"
      ],
      "Years active": [
         "1985–1997",
         "2001",
         "2007–2012"
      ],
      "Labels": [
         "Combat",
         "Relativity",
         "Fierce",
         "G.U.N.",
         "Nuclear Blast"
      ],
      "Associated acts": [
         "Testament, Slayer, Exodus, Nevermore, Machine Head, Vio-lence, Manmade God"
      ],
      "Website": [
         "Official website"
      ],
      "Past members": [
         "Lineups"
      ]
   },
   "albums": []
}