{
   "Name": "Forbidden (band)",
   "Sections": [
      "1 History",
      "1.1 Initial career (1985–1997)",
      "1.2 Reunions and Omega Wave (2001–2010)",
      "1.3 Switching drummers and hiatus (2011–present)",
      "2 Band members",
      "2.1 Timeline",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Forbidden was a thrash metal band from the San Francisco Bay Area, California. Formed in 1985 as Forbidden Evil, the group was founded by Jim Pittman and guitarist Robb Flynn. Since their formation, Forbidden have broken up and reformed twice with numerous line-up changes. The most recent line-up of the band was Russ Anderson (vocals), Craig Locicero (guitar), Matt Camacho (bass), Steve Smyth (guitar) and Sasha Horn (drums). After breaking up for the first time in 1997 and briefly returning in 2001, Forbidden reunited once again in 2007 but has been on an indefinite hiatus since 2012.\n",
         "Along with Death Angel, Vio-lence, Defiance, Testament and Exodus (the latter of the two had featured original Forbidden drummer Paul Bostaph), they were one of the most successful Bay Area thrash metal bands and earned a loyal fanbase in the underground music community and critical acclaim, with their debut album Forbidden Evil (1988) regarded by critics as a classic thrash metal album and the follow-up, Twisted into Form (1990), as something of a masterpiece within the “tech-thrash” genre. Their earlier style was technical thrash metal, but the band later experimented with alternative and groove metal elements on their fourth album Green (1997).\n"
      ]
   },
   "History": {
      "Initial career (1985–1997)": {
         "text": [
            "Forbidden Evil was formed in early 1985 by drummer Jim Pittman and guitarist Robb Flynn (later of Vio-lence and Machine Head), with the original lineup being completed by Craig Locicero (guitar), Russ Anderson (vocals) and John Tegio (bass). Flynn named the band after a song by the Chicago band War Cry that was featured on the Metal Massacre 4 compilation.[1]  They recorded demo tapes and appeared on the now-out-of-print live album The Eastern Front – Live At Ruthie's Inn. By 1986, Jim Pittman, John Tegio, and Robb Flynn left the band and were replaced by Paul Bostaph (drums), Matt Camacho (bass) and Glen Alvelais (guitar). The band's name was shortened to Forbidden in order to prevent the band from being mistakenly perceived as a black metal band.[2]\n",
            "After considering offers from several record labels, the band signed with Combat Records in 1988 and released their debut album Forbidden Evil in September of that year.[2] The album included three songs written by former guitarist Robb Flynn (\"Chalice Of Blood\", \"Forbidden Evil\", and \"As Good As Dead\"). The album was promoted by touring the U.S. and Europe for the remainder of 1988 and into 1989, sharing the stage with the likes of Testament, Exodus, Holy Moses, Sepultura, Death Angel, Sacred Reich, Voivod, Savatage, Vio-lence, Dark Angel and Pestilence (not to be confused with the Dutch death metal band of the same name).[2] When the Forbidden Evil tour ended, Alvelais left the band and was replaced by guitarist Tim Calvert. The bands only live album Raw Evil - Live at the Dynamo EP, was also released in 1989.[2]\n",
            "Forbidden's second studio album, Twisted Into Form, was released in 1990,[2] which saw the band showcase a more melodic and progressive sound with many acoustic interludes and clearer production, and less of a raw edge than its predecessor. In support of this album, they opened for Death Angel on their Act III tour in Europe and North America, and also played with bands such as Exodus, Sepultura, Vicious Rumors, Sanctuary, Fates Warning, Sacred Reich, Obituary, Morbid Angel, Realm, Defiance and Forced Entry.\n",
            "Internal and managerial problems led to the band leaving Combat Records in 1991. This was followed by another line-up change when drummer Paul Bostaph left to replace Dave Lombardo in Slayer. Bostaph was replaced by drummer Steve Jacobs.[2] In 1993 amidst writing and rehearsing material for Forbidden's third studio album, Craig Locicero filled the guitar slot for Death during a three week European tour.\n",
            "The band signed to GUN Records in 1994 and released their third album Distortion in November. They toured Europe with Gorefest to promote the album into 1995 and followed that with U.S. dates with Testament and Malevolent Creation. They spent 1996 writing and recording darker, angrier material for their fourth album Green which was released in early 1997. Lack of support for the album from GUN Records and no tour scheduled to promote it, as well as Locicero wanting to go in a different creative direction, led to Forbidden breaking up in 1997. He along with Matt Camacho and Steve Jacobs would soon form the first incarnation of Manmade God the same year.[3]\n"
         ]
      },
      "Reunions and Omega Wave (2001–2010)": {
         "text": [
            "In August 2001, Anderson, Bostaph, Alvelais and Camacho reformed for a one-time, six song performance for Chuck Billy's Thrash of the Titans benefit concert, using their original name Forbidden Evil. Guitarist Steve Smyth stood in for Craig Locicero who was unable to join the event due to his commitment to recording with Manmade God. Former guitarist Tim Calvert also performed for the final three songs of the set. \n",
            "In 2007 Forbidden reformed again for reunion shows to take place in 2008 both in the US and in Europe.[4] The reunion initially featured the Forbidden Evil line-up from 2001, this time including Craig Locicero but without Paul Bostaph, who had prior commitments with Testament. Gene Hoglan (of Dark Angel, Death and Strapping Young Lad fame) played drums for the band's first few reunion shows. After Hoglan, Mark Hernandez (ex-Vio-lence, Heathen, Defiance) took over on the drums for the band's European tour, which included an appearance on the main stage at Belgium's Graspop festival. They also played some Japanese dates later in the year. After the tour, Glen Alvelais quit the group, stating that he felt he \"could no longer take all the accusations and distrust that came with our so-called chemistry.\" Guitarist Steve Smyth stepped in as Alvelais' replacement.[5] In the summer of 2009 they toured Europe and the U.S. once more, performing their second album Twisted Into Form in its entirety.\n",
            "In 2009 Forbidden began talks with Nuclear Blast Records about recording a fifth studio album for the label. The new album, Omega Wave,[6] was released in 2010.[7] The band toured extensively in the U.S., Europe and South America to promote the album.\n"
         ]
      },
      "Switching drummers and hiatus (2011–present)": {
         "text": [
            "In August 2011, drummer Mark Hernandez left Forbidden, citing personal reasons. Gene Hoglan replaced him for a few shows, including Alcatraz Festival.[8] In November of that year, the band announced their new drummer was Sasha Horn.[9] However, in July 2012 when Matt Camacho announced he was leaving the band to pursue his legal career and Russ Anderson stated his intention to \"take a break\" from the music business, Forbidden was effectively over once more, with Locicero stating in 2013: \"Unfortunately, I think Russ is finished, and by the time he would want to step up and do it again, it would be too late. It became painfully obvious to me that Russ really wasn't cut out for the road anymore and that's why Forbidden broke up the first time. I ended up doing too much work and I needed everyone to step up and help me out, and the same thing started happening again; when the original members aren't really motivated, it's just not fun anymore. So I don't think I ever want to go backwards again.\"[10]\n",
            "Although Forbidden has not performed live since 2012 nor been active since the split with Camacho and Anderson, Locicero reported in April 2016 that the band is still under contract with Nuclear Blast. Despite not ruling out the possibility of a reunion, he stated, \"The schematics are very confusing here. When we ended, there was two members from out of state (one out of the country) plus Matt and Russ retired from music until further notice. All of this presents a large hurdle if we just 'wanna get together to jam.' So you must understand that it is simply not likely. But as I stated, never say never.\"[11]\n"
         ]
      }
   },
   "Band members": {
      "Timeline": {}
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Forbidden was a thrash metal band from the San Francisco Bay Area, California. Formed in 1985 as Forbidden Evil, the group was founded by Jim Pittman and guitarist Robb Flynn. Since their formation, Forbidden have broken up and reformed twice with numerous line-up changes. The most recent line-up of the band was Russ Anderson (vocals), Craig Locicero (guitar), Matt Camacho (bass), Steve Smyth (guitar) and Sasha Horn (drums). After breaking up for the first time in 1997 and briefly returning in 2001, Forbidden reunited once again in 2007 but has been on an indefinite hiatus since 2012.\n",
      "Along with Death Angel, Vio-lence, Defiance, Testament and Exodus (the latter of the two had featured original Forbidden drummer Paul Bostaph), they were one of the most successful Bay Area thrash metal bands and earned a loyal fanbase in the underground music community and critical acclaim, with their debut album Forbidden Evil (1988) regarded by critics as a classic thrash metal album and the follow-up, Twisted into Form (1990), as something of a masterpiece within the “tech-thrash” genre. Their earlier style was technical thrash metal, but the band later experimented with alternative and groove metal elements on their fourth album Green (1997).\n",
      "Forbidden Evil was formed in early 1985 by drummer Jim Pittman and guitarist Robb Flynn (later of Vio-lence and Machine Head), with the original lineup being completed by Craig Locicero (guitar), Russ Anderson (vocals) and John Tegio (bass). Flynn named the band after a song by the Chicago band War Cry that was featured on the Metal Massacre 4 compilation.[1]  They recorded demo tapes and appeared on the now-out-of-print live album The Eastern Front – Live At Ruthie's Inn. By 1986, Jim Pittman, John Tegio, and Robb Flynn left the band and were replaced by Paul Bostaph (drums), Matt Camacho (bass) and Glen Alvelais (guitar). The band's name was shortened to Forbidden in order to prevent the band from being mistakenly perceived as a black metal band.[2]\n",
      "After considering offers from several record labels, the band signed with Combat Records in 1988 and released their debut album Forbidden Evil in September of that year.[2] The album included three songs written by former guitarist Robb Flynn (\"Chalice Of Blood\", \"Forbidden Evil\", and \"As Good As Dead\"). The album was promoted by touring the U.S. and Europe for the remainder of 1988 and into 1989, sharing the stage with the likes of Testament, Exodus, Holy Moses, Sepultura, Death Angel, Sacred Reich, Voivod, Savatage, Vio-lence, Dark Angel and Pestilence (not to be confused with the Dutch death metal band of the same name).[2] When the Forbidden Evil tour ended, Alvelais left the band and was replaced by guitarist Tim Calvert. The bands only live album Raw Evil - Live at the Dynamo EP, was also released in 1989.[2]\n"
   ]
}