{
   "Name": "Dysart and Dundonald Pipe Band",
   "rawData": [
      "The Dysart and Dundonald Pipe Band is a currently disbanded pipe band located in Fife, Scotland.\n",
      "The band was founded in 1929 as the Dundonald Juvenile Pipe Band, with Bob Mackay as pipe major. Alex Smart became pipe major in 1935, and after disbanding during the Second World War, the band reformed in 1945 with Hunter Wylie as pipe major. In 1950, Robert MacKay became pipe major and the name of the band was changed to the Dundonald Colliery Pipe Band. With sponsorship from the colliery, the band won the Juvenile Championship at Cowal in 1952. The band went on to win the Grade 3 World Championships in 1953, and after promotion, the Grade 2 World Championships in 1958.  After this point the band went into decline, and in 1965 the Dundonald Colliery closed and both the band and the village lost their primary means of support. The Frances Colliery in Dysart adopted the band at this time, resulting in the addition of Dysart to the band's name.\n",
      "In 1966 Robert Shepherd replaced Robert MacKay as pipe major, and a year later the band began to train young players, marking the start of the \"Youth Policy\". A Novice Juvenile band  was formed in 1969 won the World Championships in its grade that year. In 1970, after winning the Champion of Champions in Grade 3, the senior band was promoted to Grade 2, and the juvenile band changed its name to Ballingry High School. The senior band reached Grade 1 in 1973, after winning eight out of ten competitions in Grade 2, and coming second in the others.\n"
   ],
   "infobox": {
      "Established": [
         "1929"
      ],
      "Disbanded": [
         "2013"
      ],
      "Location": [
         "Fife, Scotland"
      ],
      "Grade": [
         "2 (disbanded)"
      ],
      "Tartan": [
         "Ancient Red McPherson"
      ],
      "Notable honours": [
         "Winner, World Pipe Band Championships: 1977, 1978"
      ],
      "Website": [
         "www.ddpb.net"
      ]
   }
}