{
   "Name": "Red Hackle Pipe Band",
   "rawData": [
      "Red Hackle Pipe & Drums, sometimes known as the Hackle, was a grade 1 pipe band based in Glasgow, Scotland.\n",
      "The Red Hackle Pipes & Drums was formed at the end of World War II by a group of Black Watch ex-servicemen in the Govan area of Glasgow, Scotland. In the early 1950s, the band began a long relationship with Hepburn & Ross Distillers who marketed a brand of whisky known as Red Hackle. Charles A. Hepburn, himself an ex-Black Watch officer, was a keen supporter of the band, as well as the College of Piping. With Mr. Hepburn's support, the band would soon move their practice facility to Otago Street, directly across from the College.\n",
      "The Red Hackle, under pipe major Angus McLeod and leading drummer Alex Ross, finished 2nd in the World Championships in 1954, winning the World drum corps title in 1954 and 1955. John Weatherston took over as pipe major in 1963, having led the 277 Battalion Argyll and Sutherland Highlanders Pipe Band to victory at the Worlds the previous year. Although \"The Hackle\" never won a World Pipe Band Championship, the band is regarded as one of the finest bands of its era. The band won every Major Championship expect the Worlds, and would finish 2nd at the World Championships a total of 3 times. At the 1968 World Championships at Perth, Scotland, the band ended up in a 3 way tie for 1st place on points, finishing 3rd overall on ensemble preference. 1972 saw the band named RSPBA Champion of Champions. The following year, 1973, the Hackle won the prestigious 25 band Inter-Continental Pipe Band Championships at the Canadian National Exhibition (CNE) at Toronto, Canada.\n"
   ],
   "infobox": {
      "Established": [
         "mid 1940s"
      ],
      "Disbanded": [
         "late 1980s"
      ],
      "Location": [
         "Glasgow"
      ],
      "Grade": [
         "1 (former)"
      ],
      "Tartan": [
         "Royal Stewart (as Red Hackle), Ancient Campbell of Cawdor (as Clan Campbell, Britoil)"
      ],
      "Sponsor": [
         "Hepburn & Ross Ltd."
      ]
   },
   "albums": [
      "The Pride o’ Scotland",
      "The Spirit of Scotland",
      "Red Hackle in Concert",
      "The Blend of Red Hackle"
   ],
   "prunedData": [
      "Red Hackle Pipe & Drums, sometimes known as the Hackle, was a [GENRE] band based in Glasgow, Scotland.\n",
      "The Red Hackle Pipes & Drums was formed at the end of World War II by a group of Black Watch ex-servicemen in the Govan area of Glasgow, Scotland. In the early [YEAR]s, the band began a long relationship with Hepburn & Ross Distillers who marketed a brand of whisky known as Red Hackle. Charles A. Hepburn, himself an ex-Black Watch officer, was a keen supporter of the band, as well as the College of Piping. With Mr. Hepburn's support, the band would soon move their practice facility to Otago Street, directly across from the College.\n",
      "The Red Hackle, under pipe major Angus McLeod and leading drummer [PERSON_NAME_FULL_0_MALE], finished 2nd in the World Championships in [YEAR], winning the World drum corps title in [YEAR] and [YEAR]. John Weatherston took over as pipe major in [YEAR], having led the 277 Battalion Argyll and Sutherland Highlanders Pipe Band to victory at the Worlds the previous year. Although [SONG_NAME] never won a [GENRE] band is regarded as one of the finest bands of its era. The band won every Major Championship expect the Worlds, and would finish 2nd at the World Championships a total of 3 times. At the [YEAR] World Championships at Perth, Scotland, the band ended up in a 3 way tie for 1st place on points, finishing 3rd overall on ensemble preference. [YEAR] saw the band named RSPBA Champion of Champions. The following year, [YEAR], the Hackle won the prestigious 25 band Inter-Continental Pipe Band Championships at the Canadian National Exhibition (CNE) at Toronto, Canada.\n"
   ]
}