{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "The band was formed in 1982 by members of the disbanded General Motors Pipe Band[1] with support from a 78th Fraser Highlanders re-enactment group, but the band was allowed to keep the name after support from the group ceased.[2]\n",
         "The 78th Frasers became the first non-Scottish band to win the World Pipe Band Championships, in the summer of 1987, breaking Strathclyde Police Pipe Band's (now Greater Glasgow Police Scotland Pipe Band) run of six consecutive wins.[3][4]\n",
         "Founding pipe major Bill Livingstone stepped down from the role in 2010 after 29 years.[5] Livingstone has detailed the acrimonious circumstances around his departure in his 2017 memoir Preposterous.[6]\n",
         "The band is currently led by pipe major Doug MacRae and drum sergeant Drew Duthart.[3] The band has won both the North American Pipe Band Championships (held in Maxville, Ontario) and the Canadian Pipe Band Championships (held in Cambridge, Ontario) a total of twelve times each.[3] The Frasers travel to Scotland each summer to compete at the World's, and have finished in the prize list eleven times.\n",
         "The band wears the 78th Fraser Highlanders Pipe Band tartan, designed for the band in 1998.[7]\n"
      ]
   },
   "Leading Drummers": {
      "text": [
         "In September 2017, Sean Allan was made the new bass drummer, replacing long-time member Johnny Rowe, who was dismissed without notice on August 28th after 14 competitive seasons.  \n",
         "Allan joined his brother-in-law, Lead-Drummer Drew Duthart. Allan followed in the footsteps of his late father, Luke Allan, who played with the band during its most successful years in the 1980s and, coincidentally, left the 78th Frasers to play with the Toronto Police with his son-in-law, Drew Duthart, who was then the lead-drummer.\n",
         "As of January 2018, the band made another change at bass drum, with Sean Allan leaving before playing in a competition. Pipe-Major Doug MacRae confirmed that Allan had left and that Christina Hanks was the band’s new bass drummer. The band made yet another change after the 2018 season, replacing Hanks with Colin McKail, previously of Hamilton Police. [8]\n"
      ]
   },
   "Pipe Majors": {},
   "References": {
      "text": [
         "6.  https://www.pipesdrums.com/article/78th-frasers-make-a-bass-change/\n"
      ]
   },
   "Sections": [
      "1 History",
      "2 Pipe Majors",
      "3 Leading Drummers",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The 78th Fraser Highlanders Pipe Band, is a grade 1 competitive pipe band from Campbellville, Ontario, Canada. \n"
      ]
   },
   "Title": "78th Fraser Highlanders Pipe Band - Wikipedia"
}