{
   "Name": "78th Fraser Highlanders Pipe Band",
   "rawData": [
      "The 78th Fraser Highlanders Pipe Band, is a grade 1 competitive pipe band from Campbellville, Ontario, Canada. \n",
      "The band was formed in 1982 by members of the disbanded General Motors Pipe Band with support from a 78th Fraser Highlanders re-enactment group, but the band was allowed to keep the name after support from the group ceased.\n",
      "The 78th Frasers became the first non-Scottish band to win the World Pipe Band Championships, in the summer of 1987, breaking Strathclyde Police Pipe Band's (now Greater Glasgow Police Scotland Pipe Band) run of six consecutive wins.\n"
   ],
   "infobox": {
      "Established": [
         "1982"
      ],
      "Location": [
         "Campbellville, Ontario"
      ],
      "Grade": [
         "1"
      ],
      "Pipe major": [
         "Doug MacRae"
      ],
      "Drum sergeant": [
         "Drew Duthart"
      ],
      "Tartan": [
         "78th Fraser Highlanders"
      ],
      "Notable honours": [
         "Winner, World Pipe Band Championships: 1987. Winner, World Drum Corps Champions 1987, 2007, World Bass Section Champions 2007"
      ],
      "Website": [
         "www.78thfrasers.net"
      ]
   },
   "albums": [
      "78th Fraser Highlanders (Faces album)",
      "Up to the Line",
      "Live In Ireland",
      "The Immigrant's Suite",
      "Live in Canada - The Megantic Outlaw Concert",
      "Live in Scotland",
      "Flame of Wrath",
      "Cascade"
   ],
   "prunedData": [
      "The [BAND_NAME], is a [GENRE] band from Campbellville, Ontario, Canada. \n",
      "The band was formed in [YEAR] by members of the disbanded General Motors Pipe Band with support from a [GENRE] band was allowed to keep the name after support from the group ceased.\n",
      "The 78th Frasers became the first non-Scottish band to win the World Pipe Band Championships, in the summer of [YEAR], breaking Strathclyde Police Pipe Band's (now Greater Glasgow Police Scotland Pipe Band) run of six consecutive wins.\n"
   ]
}