{
   "Name": "Hamilton Police Pipe Band",
   "Sections": [
      "1 History",
      "2 Achievements",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "The Hamilton Police Pipe Band is a competitive pipe band based in Hamilton, Ontario, Canada.  Currently, the Hamilton Police Pipe Band consists of a competing grade 4 band, a developing grade 5 band, and a teaching program. The Hamilton Police Pipe Band has had many successful seasons under its most recent leadership of drum sergeant Sandy McKail and pipe major Trish Kirkwood. Over the last 15 years the two have led HPPB to many local and North American prizes and titles such as North American champions, Canadian champions, Transatlantic champions, Nova Scotia champions, and 1st placings in many PPBSO Highland games across Ontario.\n",
         "Pipe major Trish Kirkwood is the current pipe major and over the last 15+ years has had major success taking a grade 5 band up to grade 2. Kirkwood passed the band to John Elliot after the 2017 World Pipe Band Championship, stepping down to pipe sergeant while still being part of the management team. Under the direction of Elliot, the band competed in grade 2 until its folding in 2018. Kirkwood resumed the pipe major position after the folding of the grade 2 band in 2018, now competing in grade 4.\n",
         "Sandy Mckail was a huge part of the HPPB restructuring after the band's second grade two band folded almost 15 years ago. McKail had been the leading drummer and drumming instruction for all levels, up to grade 2, building winning drum scores for snare and midsection, McKail would tie the band together, providing a complementary ensemble perspective that seemed to always elevate the musical feeling and expression of the band.  His drum score arrangements dominated the junior grades for almost a decade.\n",
         "The midsection was instructed by drum sergeant Sandy Mckail and lead tenor Stacey McKail. In past years HPPB has had names such as Cameron McKail (2018) and James Kirkwood (2019) listed as the lead tip, under the direction of Sandy Mckail, both long time students of his. After a successful 2019 season Sandy Mckail decided to step down from management. Sandy and Stacey Mckail departed the band to play with Peel regional police pipe band grade 2 as players. Long time students James Kirkwood (2020) and Cameron Mckail (2019) departed, both now snare drummers in the 78th Fraser Highlanders (Ontario) Grade 1 band.\n",
         "Colin McKail (2020) departed and is now the bass drummer for the 78Th Fraser Highlanders Gr1. The current drum sergeant is Graham Kirkwood formerly drum sergeant of Peel Regional Police Pipe Band, the current bass drummer/lead tenor for the bass section is Ryan Robertson, formerly lead tenor of the 78th Fraser Highlanders (Ontario).\nPPBSO.[1]\n"
      ]
   },
   "History": {
      "text": [
         "The Hamilton Police Pipe Band was formed in 1961. In the past, the band has competed as high as the grade 2 level, but not since 2009, when the band participated in the Kincardine Scottish Festival.[2][3]  In 2010, the resignation of its pipe major and lead drummer created a setback.[4]  Since then, with Trish Kirkwood as pipe major and Sandy McKail as the drumming instructor, the band eventually dominated its way to the grade 3 level in 2013. This band, after a strong performance in the 2017 season, upgraded to the grade 2 level, and its grade 5 band, in winning Champion Supreme was upgraded to the grade 4 level.\n",
         "In the 2018 season, John Elliot took over as senior pipe major and led the grade 2 band to a respectable finish.  During the off-season, with John Elliot leaving, the grade 2 band was disbanded and the band then focused their efforts on the grade 4 band.  Trish Kirkwood then took over the grade 4 band, with her son James Kirkwood as lead drummer.\n",
         "The band did provide a youth bagpipe instruction program, but this has become dormant because of lack of facilities.\n",
         "The band performs at ceremonies[5][6] and in parades.[7][8] The band took part in the funeral of former Governor General Lincoln Alexander.[9]\n"
      ]
   },
   "Achievements": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Hamilton Police Pipe Band is a competitive pipe band based in Hamilton, Ontario, Canada.  Currently, the Hamilton Police Pipe Band consists of a competing grade 4 band, a developing grade 5 band, and a teaching program. The Hamilton Police Pipe Band has had many successful seasons under its most recent leadership of drum sergeant Sandy McKail and pipe major Trish Kirkwood. Over the last 15 years the two have led HPPB to many local and North American prizes and titles such as North American champions, Canadian champions, Transatlantic champions, Nova Scotia champions, and 1st placings in many PPBSO Highland games across Ontario.\n",
      "Pipe major Trish Kirkwood is the current pipe major and over the last 15+ years has had major success taking a grade 5 band up to grade 2. Kirkwood passed the band to John Elliot after the 2017 World Pipe Band Championship, stepping down to pipe sergeant while still being part of the management team. Under the direction of Elliot, the band competed in grade 2 until its folding in 2018. Kirkwood resumed the pipe major position after the folding of the grade 2 band in 2018, now competing in grade 4.\n",
      "Sandy Mckail was a huge part of the HPPB restructuring after the band's second grade two band folded almost 15 years ago. McKail had been the leading drummer and drumming instruction for all levels, up to grade 2, building winning drum scores for snare and midsection, McKail would tie the band together, providing a complementary ensemble perspective that seemed to always elevate the musical feeling and expression of the band.  His drum score arrangements dominated the junior grades for almost a decade.\n",
      "The midsection was instructed by drum sergeant Sandy Mckail and lead tenor Stacey McKail. In past years HPPB has had names such as Cameron McKail (2018) and James Kirkwood (2019) listed as the lead tip, under the direction of Sandy Mckail, both long time students of his. After a successful 2019 season Sandy Mckail decided to step down from management. Sandy and Stacey Mckail departed the band to play with Peel regional police pipe band grade 2 as players. Long time students James Kirkwood (2020) and Cameron Mckail (2019) departed, both now snare drummers in the 78th Fraser Highlanders (Ontario) Grade 1 band.\n"
   ]
}