{
   "Name": "Simon Fraser University Pipe Band",
   "rawData": [
      "The Simon Fraser University Pipe Band is a grade one pipe band affiliated with Simon Fraser University in Burnaby, British Columbia, Canada. It is led by pipe major Alan Bevan and leading drummer J. Reid Maxwell.\n",
      "The Simon Fraser University Pipe Band was originally formed by a group of students at Simon Fraser University in 1966.\n",
      "Brothers Terry and Jack Lee joined the Simon Fraser University band in 1981 after being approached by then-president of the University George Pedersen through Scottish soccer coach John Buchanan, who wanted to have a better quality band than the one that would form as necessary for events. The next year, the band won the North American Championships, and in 1983 came 10th at the World Championships. In 1985, the band came second at the Worlds.\n"
   ],
   "infobox": {
      "Established": [
         "originally 1966, re-established 1981"
      ],
      "Location": [
         "Burnaby, British Columbia"
      ],
      "Grade": [
         "1"
      ],
      "Pipe major": [
         "Alan Bevan"
      ],
      "Drum sergeant": [
         "J. Reid Maxwell"
      ],
      "Tartan": [
         "Simon Fraser University"
      ],
      "Notable honours": [
         "World Champions: 1995, 1996, 1999, 2001, 2008, 2009"
      ],
      "Website": [
         "www.sfupb.com"
      ]
   },
   "prunedData": [
      "The [BAND_NAME] is a [GENRE] band affiliated with Simon Fraser University in Burnaby, British Columbia, Canada. It is led by pipe major [PERSON_NAME_FULL_0_MALE] and leading drummer J. Reid Maxwell.\n",
      "The [BAND_NAME] was originally formed by a group of students at Simon Fraser University in [YEAR].\n",
      "Brothers Terry and Jack Lee joined the Simon Fraser University band in [YEAR] after being approached by then-president of the University George Pedersen through Scottish soccer coach [PERSON_NAME_FULL_0_MALE], who wanted to have a [GENRE] band than the one that would form as necessary for events. The next year, the band won the North American Championships, and in [YEAR] came 10th at the World Championships. In [YEAR], the band came second at the Worlds.\n"
   ]
}