{
   "Name": "Triumph Street Pipe Band",
   "rawData": [
      "The Dowco Triumph Street Pipe Band is a Grade 1 competitive and concert pipe band based in Greater Vancouver, B.C., Canada, established in 1971 by former pupils of Pipe Major Malcolm Nicholson, C.M. of the Vancouver Police Pipe Band. The band was dissolved on September 16, 2018 by Pipe Major David Hilder.\n",
      "In the 1970s and early 80s, the band ranked among the best in the world, and under the leadership of Pipe Major Hal Senyk and Lead Drummer William McErlean, Triumph Street placed 5th in Grade 1 at the 1979 World Pipe Band Championships. This achievement was the first time that a band from outside Scotland had won a major prize at the Worlds, in this case 'The Sash' for best drum corps. The band placed 6th in the Medley contest at the 2011 World's, finishing 9th overall.\n",
      "The Dowco Triumph Street Pipe Band, sponsored by The Dowco Group of Companies, and wearing the MacLean of Duart Weathered Tartan, is a Grade One competitive and concert pipe band based in Greater Vancouver, British Columbia, Canada. Originally established in 1971, Dowco Triumph Street holds the honour of being the first band outside of Scotland to win a major World Championship prize, winning \"The Sash\" in 1979 under Lead Drummer Willie McErlean.\n"
   ],
   "infobox": {
      "Established": [
         "1971"
      ],
      "Disbanded": [
         "September 16, 2018"
      ],
      "Location": [
         "Vancouver, British Columbia"
      ],
      "Grade": [
         "1"
      ],
      "Pipe major": [
         "David Hilder"
      ],
      "Drum sergeant": [
         "Gary Corkin"
      ],
      "Tartan": [
         "MacLean of Duart Weathered"
      ],
      "Website": [
         "www.triumphstreetpipeband.com"
      ]
   },
   "albums": [
      "The Bagpipe In Canada",
      "A Dram Before Ya Go!",
      "With Purpose"
   ],
   "prunedData": [
      "The Dowco [BAND_NAME] is a [GENRE] band based in Greater Vancouver, B.C., Canada, established in [YEAR] by former pupils of Pipe Major Malcolm Nicholson, C.M. of the Vancouver Police Pipe Band. The band was dissolved on [MONTH] 16, [YEAR] by Pipe Major [PERSON_NAME_FULL_0_MALE].\n",
      "In the [YEAR]s and early 80s, the band ranked among the best in the world, and under the leadership of Pipe Major Hal Senyk and Lead Drummer [PERSON_NAME_FULL_0_MALE], Triumph Street placed 5th in Grade 1 at the [YEAR] World Pipe Band Championships. This achievement was the first time that a [GENRE] a major prize at the Worlds, in this case 'The Sash' for best drum corps. The band placed 6th in the Medley contest at the [YEAR] World's, finishing 9th overall.\n",
      "The Dowco [BAND_NAME], sponsored by The Dowco Group of Companies, and wearing the MacLean of Duart Weathered Tartan, is a [GENRE] band based in Greater Vancouver, British Columbia, Canada. Originally established in [YEAR], Dowco Triumph Street holds the honour of being the first band outside of Scotland to win a major World Championship prize, winning [SONG_NAME] in [YEAR] under Lead Drummer Willie McErlean.\n"
   ]
}