{
   "Name": "Heathen (band)",
   "rawData": [
      "Heathen is an American thrash metal band originating from the San Francisco Bay Area, active from 1984 to 1993 and again from 2001 onwards. Despite never achieving commercial success, the band is often credited – alongside Exodus, Testament, Forbidden, Death Angel and Vio-lence – as one of the leaders of the Bay Area thrash metal scene of the mid-to-late 1980s, and they have gone through several line-up changes, leaving guitarist Lee Altus as the only constant member. To date, Heathen has released four studio albums: Breaking the Silence (1987),  Victims of Deception (1991), The Evolution of Chaos (2009) and Empire of the Blind (2020).\n",
      "Heathen was formed in 1984 by guitarist Lee Altus and drummer Carl Sacco (formerly of Metal Church), who later recruited lead vocalist Sam Kress and guitarist Jim Sanguinetti (Who went on to found the band Mordred). Shortly after their first gig in 1985, Kress and Sanguinetti left the group and were replaced by vocalist David Godfrey (formerly of Blind Illusion) and guitarist Doug Piercy (formerly of Anvil Chorus and Control). The band also recruited bassist Eric Wong around this time. This lineup debuted in early 1986 and soon became prolific around the Bay Area. Their early style could be described as the aggression of thrash metal combined with NWOBHM-style vocals and arrangements, acoustic intros or outros, and fast-paced melodic shred solos.\n",
      "Heathen's break came when they released their Pray For Death demo, which in 1987 resulted in their signing by Combat Records. Shortly after their signing Eric Wong left the band to join Piranha, and was replaced on bass by former Griffin guitarist Mike \"Yaz\" Jastremski.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Thrash metal, speed metal, progressive metal"
      ],
      "Years active": [
         "1984–1993",
         "2001–present"
      ],
      "Labels": [
         "Combat",
         "Roadrunner",
         "Mascot Records",
         "Nuclear Blast"
      ],
      "Associated acts": [
         "Exodus",
         "Blind Illusion",
         "Die Krupps",
         "Prototype",
         "Ulysses Siren",
         "Lȧȧz Rockit",
         "Angel Witch",
         "Hatriot"
      ],
      "Website": [
         "www.heathenmetal.com"
      ],
      "Members": [
         "Dave White",
         "Lee Altus",
         "Kragen Lum",
         "Jason Mirza",
         "Jim DeMaria"
      ],
      "Past members": [
         "Doug Piercy",
         "Mike \"Yaz\" Jastremski",
         "Rick WeaverCarl Sacco",
         "Marc Biedermann",
         "Jon Torre",
         "Jason Viebrooks",
         "Ira Black",
         "Terry Lauderdale",
         "Sam Kress",
         "Darren Minter",
         "Jon Dette"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band originating from the San Francisco Bay Area, active from [YEAR] to [YEAR] and again from [YEAR] onwards. Despite never achieving commercial success, the band is often credited – alongside Exodus, Testament, Forbidden, Death Angel and Vio-lence – as one of the leaders of the Bay Area thrash metal scene of the mid-to-late [YEAR]s, and they have gone through several line-up changes, leaving guitarist [PERSON_NAME_FULL_0_MALE] as the only constant member. To date, [BAND_NAME] has released four studio albums: Breaking the Silence ([YEAR]),  Victims of [MONTH]eption ([YEAR]), The Evolution of Chaos ([YEAR]) and Empire of the Blind ([YEAR]).\n",
      "[BAND_NAME] was formed in [YEAR] by guitarist Lee Altus and drummer [PERSON_NAME_FULL_3_MALE] (formerly of Metal Church), who later recruited lead vocalist Sam Kress and guitarist [PERSON_NAME_FULL_0_MALE] (Who went on to found the band Mordred). Shortly after their first gig in [YEAR], Kress and [PERSON_NAME_LAST_0] left the group and were replaced by vocalist David Godfrey (formerly of Blind Illusion) and guitarist [PERSON_NAME_FULL_2_MALE] (formerly of Anvil Chorus and Control). The band also recruited bassist [PERSON_NAME_FULL_1_MALE] around this time. This lineup debuted in early [YEAR] and soon became prolific around the Bay Area. Their early style could be described as the aggression of thrash metal combined with NWOBHM-style vocals and arrangements, acoustic intros or outros, and fast-paced melodic shred solos.\n",
      "[BAND_NAME]'s break came when they released their Pray For Death demo, which in [YEAR] resulted in their signing by Combat Records. Shortly after their signing [PERSON_NAME_FULL_0_MALE] left the band to join Piranha, and was replaced on bass by former Griffin guitarist Mike \"Yaz\" Jastremski.\n"
   ]
}