{
   "Name": "Los Angeles Scottish Pipe Band",
   "rawData": [
      "The Los Angeles Scottish Pipe Band, or, more commonly, the LA Scots, is a pipe band located in Orange County, California.  The LA Scots have competed at the grade one level since 1998.  In February 2018, the Western United States Pipe Band Association granted a request by the LA Scots to move to Grade 2.\n",
      "During their time in Grade 1, the band placed ninth in the qualification round at the 2008 World Pipe Band Championships, and placed 14th in the qualification round of 2009.  In 2007, the band qualified for the Grade 1 competition and placed 11th.\n",
      "This article on a United States band or other musical ensemble is a stub. You can help Wikipedia by expanding it."
   ],
   "infobox": {
      "Location": [
         "Orange County, CA"
      ],
      "Grade": [
         "2"
      ],
      "Pipe major": [
         "Scott MacDonald"
      ],
      "Drum sergeant": [
         "Carl Lenny"
      ],
      "Tartan": [
         "Drummond of Perth"
      ],
      "Notable honours": [
         "Grade 2 World Championships:1st place 1997, Best Drums 1997, Best Bass 1997, 3rd place 1996, 2nd place 1995",
         "Grade 1 World Championships Final:11th place 2007 & 2002, Best Bass 1998",
         "Grade 1 World Championships Qualifier:4th place 2007, Best Drums 2007 & 2002",
         "North Berwick Highland Games:2nd place 2007, Best Drums 2007"
      ],
      "Website": [
         "www.lascots.org"
      ]
   },
   "albums": [
      "At the Beach"
   ],
   "prunedData": [
      "The [BAND_NAME], or, more commonly, the LA Scots, is a [GENRE] band located in Orange County, California.  The LA Scots have competed at the grade one level since [YEAR].  In [MONTH] [YEAR], the Western United States Pipe Band Association granted a request by the LA Scots to move to Grade 2.\n",
      "During their time in Grade 1, the band placed ninth in the qualification round at the [YEAR] World Pipe Band Championships, and placed 14th in the qualification round of [YEAR].  In [YEAR], the band qualified for the Grade 1 competition and placed 11th.\n",
      "This article on a [GENRE] band or other musical ensemble is a stub. You can help Wikipedia by expanding it."
   ]
}