{
   "Name": "Victoria Police Pipe Band",
   "Sections": [
      "Summary",
      "History",
      "Recordings"
   ],
   "Summary": {
      "text": [
         "The Victoria Police Pipe Band is a former Grade One World Pipe Band Championship-winning pipe band based in Melbourne, Australia. The band still operates today, though with reduced numbers and not competitively, after a controversial decision in 2000 to reshape it.\n",
         "As of today, the Victoria Police Pipe Band is the only Australian band in history to have attained the title of Grade One World Pipe Band Champion. It is Australia's most successful pipe band, having obtained three third-place results at the Worlds in years directly prior to its win in 1998. The band has also released a number of recordings, which are internationally popular.\n"
      ]
   },
   "History": {
      "text": [
         "The band was started in 1936, with generous funding from Mr W.E. McPherson (hence the McPherson tartan), by a small group of full-time police officers. For some fifty years following this, there is little noted in the history of the band and it is assumed that it continued on much in the way it had, filling its ranks with police who performed part-time.\n",
         "However, in 1987, the band formally began its pursuit of the Worlds title.  It recruited Pipe Major Nat Russell from the Royal Ulster Constabulary of Northern Ireland and received funding from the state government, with which it competed in Grade Two Australian competitions. One year later, the band attained the title of Australian Grade Two Champions and achieved third place in the August World Pipe Band Championships for the same grade. This earned the band's regrading to Grade One.\n",
         "Buoyed by its success, Victoria Police Pipe Band spent the next decade dominating Australian competition, claiming six consecutive grade one titles locally whilst continuing to compete internationally. In 1992, 1994 and 1997 the band claimed third places at the Worlds, this time in Grade One.\n",
         "After some minor adjustments by then Drum Sergeant Harold Gillespie and Pipe Major Nat Russell, the Victoria Police Pipe Band was crowned World Champions at Glasgow in 1998.\n",
         "In October 2000, the band's competing days were over as it reformed. It now mostly performs at official functions, as well as for charities and schools.\n"
      ]
   },
   "Recordings": {
      "text": [
         "During the course of their years as a competition pipe band, the band released a number of recordings which included: \n",
         "The band has also been featured on the following recordings:\n"
      ]
   },
   "coreData": [
      "The Victoria Police Pipe Band is a former Grade One World Pipe Band Championship-winning pipe band based in Melbourne, Australia. The band still operates today, though with reduced numbers and not competitively, after a controversial decision in 2000 to reshape it.\n",
      "As of today, the Victoria Police Pipe Band is the only Australian band in history to have attained the title of Grade One World Pipe Band Champion. It is Australia's most successful pipe band, having obtained three third-place results at the Worlds in years directly prior to its win in 1998. The band has also released a number of recordings, which are internationally popular.\n",
      "The band was started in 1936, with generous funding from Mr W.E. McPherson (hence the McPherson tartan), by a small group of full-time police officers. For some fifty years following this, there is little noted in the history of the band and it is assumed that it continued on much in the way it had, filling its ranks with police who performed part-time.\n",
      "However, in 1987, the band formally began its pursuit of the Worlds title.  It recruited Pipe Major Nat Russell from the Royal Ulster Constabulary of Northern Ireland and received funding from the state government, with which it competed in Grade Two Australian competitions. One year later, the band attained the title of Australian Grade Two Champions and achieved third place in the August World Pipe Band Championships for the same grade. This earned the band's regrading to Grade One.\n"
   ],
   "infobox": {
      "Established": [
         "1936"
      ],
      "Location": [
         "30 Green Street, Northcote, VIC 3070, Australia"
      ],
      "Grade": [
         "1 (formerly)"
      ],
      "Tartan": [
         "McPherson"
      ],
      "Notable honours": [
         "Winner, World Pipe Band Championship: 1998"
      ],
      "Website": [
         "Victoria Police Pipe Band"
      ]
   }
}