{
   "Name": "High on Fire",
   "rawData": [
      "High on Fire is an American heavy metal band from Oakland, California, that was formed in 1998. Matt Pike, the band's frontman and founder, also plays guitar for doom metal band Sleep. High on Fire won the 2019 Grammy Award for Best Metal Performance with their song \"Electric Messiah\".\n",
      "High on Fire was founded in 1998 by Sleep guitarist Matt Pike, drummer Des Kensel, and bassist George Rice (from Dear Deceased, who originally auditioned to be the band's vocalist). The band's first full-length album The Art of Self Defense was released on 12th Records, and released later on Man's Ruin Records. (The album would later be re-released by Tee Pee Records, with two bonus tracks, as Man's Ruin Records had become defunct.)\n",
      "In 2001, High on Fire signed a record deal with Relapse Records and recorded the album Surrounded by Thieves. The album was released on May 28, 2002. After the tours promoting Surrounded by Thieves, bassist George Rice left the band and was replaced by ex-Melvins/Thrones bassist Joe Preston.\n"
   ],
   "infobox": {
      "Origin": [
         "Oakland, California, U.S."
      ],
      "Genres": [
         "Doom metal, stoner metal,[1] sludge metal[2][3]"
      ],
      "Years active": [
         "1998–present"
      ],
      "Labels": [
         "Relapse, Man's Ruin, Koch"
      ],
      "Website": [
         "highonfire.net"
      ],
      "Members": [
         "Matt Pike",
         "Jeff Matz"
      ],
      "Past members": [
         "Des Kensel",
         "George Rice",
         "Joe Preston"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Oakland, California, that was formed in [YEAR]. Matt Pike, the band's frontman and founder, also plays guitar for doom metal band Sleep. [BAND_NAME] won the [YEAR] Grammy Award for Best Metal Performance with their song \"Electric Messiah\".\n",
      "[BAND_NAME] was founded in [YEAR] by Sleep guitarist Matt Pike, drummer Des Kensel, and bassist [PERSON_NAME_FULL_0_MALE] (from Dear [MONTH]eased, who originally auditioned to be the band's vocalist). The band's first full-length album The Art of Self Defense was released on 12th Records, and released later on Man's Ruin Records. (The album would later be re-released by Tee Pee Records, with two bonus tracks, as Man's Ruin Records had become defunct.)\n",
      "In [YEAR], [BAND_NAME] signed a record deal with Relapse Records and recorded the album Surrounded by Thieves. The album was released on [MONTH] 28, [YEAR]. After the tours promoting Surrounded by Thieves, bassist [PERSON_NAME_FULL_0_MALE] left the band and was replaced by ex-Melvins/Thrones bassist [PERSON_NAME_FULL_1_MALE].\n"
   ]
}