{
   "Name": "Bush Tetras",
   "rawData": [
      "Bush Tetras are an American post-punk band from New York City, formed in 1979. They are best known for the 1980 song \"Too Many Creeps\", which exemplified the band's sound of \"jagged rhythms, slicing guitars, and sniping vocals\". Although they did not achieve mainstream success, the Bush Tetras were influential and popular in the Manhattan club scene and college radio in the early 1980s. New York's post-punk revival of the 2000s was accompanied by a resurgence of interest in the genre, with the Tetras' influence heard in many of that scene's bands.\n",
      "The Bush Tetras formed in 1979, and soon solidified with a lineup of Cynthia Sley (vocals), Pat Place (guitar), Laura Kennedy (bass) and Dee Pop (drums); vocalist Adele Bertei and guitarist Jimmy Joe Uliana were brief early members. Place had previously been the original guitarist and a founding member of the no wave band the Contortions, though the Tetras sound was less frantic and disjointed, and she had also appeared in some of Vivienne Dick's movies.\n",
      "The band's debut 7\" EP, \"Too Many Creeps\", was released in 1980 on 99 Records. It reached No. 57 on the Billboard club play chart. The follow-up, \"Things That Go Boom in the Night\", was issued in 1981 by Fetish Records, hitting No. 43 on the UK Indie Chart. The Rituals 12\" EP, produced by Topper Headon of the Clash and including the popular \"Can't Be Funky\", was released in 1981 by Fetish in the UK and by Stiff Records in the U.S. It reached No. 32 on the Billboard club chart.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, United States"
      ],
      "Genres": [
         "Post-punk, no wave, dance-punk"
      ],
      "Years active": [
         "1979–1983, 1995–1998, 2005–present"
      ],
      "Labels": [
         "99 Records, Fetish Records, Stiff Records, ROIR, Thirsty Ear, Tim/Kerr Records, Polygram Records"
      ],
      "Associated acts": [
         "The Contortions, Lovelies, Command V"
      ],
      "Members": [
         "Pat Place",
         "Dee Pop (Dimitri Papadopoulos)",
         "Cynthia Sley",
         "Val Opielski"
      ],
      "Past members": [
         "Jimmy Joe Uliana",
         "Adele Bertei",
         "Laura Kennedy",
         "Bob Albertson",
         "Don Christenson",
         "Julia Murphy",
         "Cindy Rickmond"
      ]
   }
}