{
   "Name": "Capital Inicial",
   "rawData": [
      "Capital Inicial is a Brazilian rock band that flourished in the 1980s, saw a resurgence in the late 1990s, and extended into the 2000s.\n",
      "Capital Inicial has recorded seven albums from 1982 to 1996. They were a huge success in the early and mid-2000s, being one of the most popular bands in Brazil with the albums Acústico MTV, Rosas e Vinho Tinto, Gigante, and MTV Especial: Aborto Elétrico. The album Eu Nunca Disse Adeus was expected to be released in early 2007.\n",
      "Former members of Renato Russo's pioneering post-punk band Aborto Elétrico teamed up to form the Capital Inicial, continuing to perform the same type of music. Brothers Felipe Lemos (drums) and Flávio Lemos (bass) joined guitarist Loro Jones (former Blitz 64) and vocalist Dinho Ouro Preto. All of them are based in Brasília, a city that, with its particular situation as Brazil's capital, revolves around politicians who abandon it on the weekends. The city's coldness was a choice culture for the fermentation of the aggressiveness of dispossessed youngsters, creating an ideal situation for the arousal of punk bands. With similar songs as Aborto Elétrico's repertoire, the Capital Inicial followed in their path. The first time that Capital (and their sister band, Legião Urbana, also erected upon the ashes of Aborto Elétrico) played in Rio was on July 23, 1983, opening a Lobão show at the Circo Voador. In 1984, they released their first single, \"Descendo o Rio Nilo\" (Going Down the Nile) and \"Leve Desespero\" (Slight Despair) (Epic), with good repercussions. The latter song was included in the film Areias Escaldantes. In April 1985, Capital Inicial succeeded in having their Descendo o Rio Nilo included on the compilation Os Intocáveis (CBS). In the next year, the group recorded their first LP, Capital Inicial (Polygram), which had the hits \"Psicopata\" (Psychopath), \"Música Urbana\" (Urban Music) and \"Fátima\" selling 200,000 copies. This was followed by a period of many live shows.\n"
   ],
   "infobox": {
      "Origin": [
         "Brasília, DF, Brazil"
      ],
      "Genres": [
         "Post-punk",
         "new wave[1]"
      ],
      "Years active": [
         "1982–present"
      ],
      "Labels": [
         "Sony BMG"
      ],
      "Website": [
         "www.capitalinicial.com.br"
      ],
      "Members": [
         "Dinho Ouro Preto",
         "Flávio Lemos",
         "Fê Lemos",
         "Yves Passarel"
      ],
      "Past members": [
         "Loro Jones",
         "Bozo Barretti",
         "Murilo Lima"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band that flourished in the [YEAR]s, saw a resurgence in the late [YEAR]s, and extended into the [YEAR]s.\n",
      "[BAND_NAME] has recorded seven albums from [YEAR] to [YEAR]. They were a huge success in the early and mid-[YEAR]s, being one of the most popular bands in Brazil with the albums Acústico MTV, Rosas e Vinho Tinto, Gigante, and MTV Especial: Aborto Elétrico. The album Eu Nunca Disse Adeus was expected to be released in early [YEAR].\n",
      "Former members of [PERSON_NAME_FULL_1_MALE]'s pioneering post-punk band Aborto Elétrico teamed up to form the [BAND_NAME], continuing to perform the same type of music. Brothers Felipe [PERSON_NAME_LAST_0] (drums) and [PERSON_NAME_FULL_0_MALE] (bass) joined guitarist Loro Jones (former Blitz 64) and vocalist Dinho Ouro Preto. All of them are based in Brasília, a [GENRE] a choice culture for the fermentation of the aggressiveness of dispossessed youngsters, creating an ideal situation for the arousal of punk bands. With similar songs as Aborto Elétrico's repertoire, the [BAND_NAME] followed in their path. The first time that Capital (and their sister band, Legião [PERSON_NAME_FIRST_2]a, also erected upon the ashes of Aborto Elétrico) played in [PERSON_NAME_FIRST_3] was on [MONTH] 23, [YEAR], opening a Lobão show at the Circo Voador. In [YEAR], they released their first single, \"Descendo o [PERSON_NAME_FULL_3_FEMALE]\" (Going Down the Nile) and \"Leve Desespero\" (Slight Despair) (Epic), with good repercussions. The latter song was included in the film Areias Escaldantes. In [MONTH] [YEAR], [BAND_NAME] succeeded in having their Descendo o [PERSON_NAME_FULL_3_FEMALE] included on the compilation Os Intocáveis (CBS). In the next year, the group recorded their first LP, [BAND_NAME] (Polygram), which had the hits \"Psicopata\" (Psychopath), \"Música [PERSON_NAME_FIRST_2]a\" ([PERSON_NAME_FULL_2_MALE]) and \"Fátima\" selling 200,000 copies. This was followed by a period of many live shows.\n"
   ]
}