{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "The first members of Circus Mort included Don Christensen on bass guitar. Before adopting the name Circus Mort the band was called Metal Envelope. Twin brothers Josh and Dan Braun joined in September 1979 on the recommendation of Christensen, followed by Pudignano who answered an advertisement in the Village Voice. The band recorded two songs at Sorcerer Sound Studios in late 1979, \"Require Require\" and \"Working for Pleasure\", which led to the interest of promoter Jim Fouratt. He hired the band to play at the rock disco Hurrah in February 1980, opening for Snatch.\n",
         "Pudignano left the band, and was replaced by Mike Pedulla. The band gigged around New York throughout 1980 playing at various clubs. In late 1980, Pedulla announced that he was leaving the band, and Jonathan Kane took his place. Shortly after, the band landed a recording contract with the newly formed Labor Records. The band recorded demos of two songs, \"Children Remember\" and \"Yellow Light\" at Sorcerer Sound to prepare for a forthcoming EP. Producer Peter Ivers oversaw the recording of further tracks at Minot Sound in White Plains, New York.\n",
         "Their first concert after the recording was supporting Bauhaus in early 1981. The band's final performance was in Boston, with The Neats, before disbanding thereafter.\n",
         "Gira with Kane later went on to form Swans. Dan Braun also joined Swans for a short period, and recorded live with them at CBGB, which was released as Body to Body, Job to Job. Kane went on to play with Rhys Chatham and La Monte Young. Gira later formed The Angels of Light, and was the founder of Young God Records.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Circus Mort was an American post-punk band from New York City, United States. Formed in 1979, the band included future Swans singer Michael Gira on vocals, guitarist Rick Oller, bassist Dan Braun, Josh Braun on keyboards and Angelo Pudignano on drums. Jonathan Kane, also of Swans, would become the third drummer for the group. The group recorded only one EP, a self-titled effort on Labor Records, before disbanding in 1981.[1]\n"
      ]
   },
   "Title": "Circus Mort - Wikipedia"
}