{
   "Name": "Circus Mort",
   "rawData": [
      "Circus Mort was an American post-punk band from New York City, United States. Formed in 1979, the band included future Swans singer Michael Gira on vocals, guitarist Rick Oller, bassist Dan Braun, Josh Braun on keyboards and Angelo Pudignano on drums. Jonathan Kane, also of Swans, would become the third drummer for the group. The group recorded only one EP, a self-titled effort on Labor Records, before disbanding in 1981.\n",
      "The first members of Circus Mort included Don Christensen on bass guitar. Before adopting the name Circus Mort the band was called Metal Envelope. Twin brothers Josh and Dan Braun joined in September 1979 on the recommendation of Christensen, followed by Pudignano who answered an advertisement in the Village Voice. The band recorded two songs at Sorcerer Sound Studios in late 1979, \"Require Require\" and \"Working for Pleasure\", which led to the interest of promoter Jim Fouratt. He hired the band to play at the rock disco Hurrah in February 1980, opening for Snatch.\n",
      "Pudignano left the band, and was replaced by Mike Pedulla. The band gigged around New York throughout 1980 playing at various clubs. In late 1980, Pedulla announced that he was leaving the band, and Jonathan Kane took his place. Shortly after, the band landed a recording contract with the newly formed Labor Records. The band recorded demos of two songs, \"Children Remember\" and \"Yellow Light\" at Sorcerer Sound to prepare for a forthcoming EP. Producer Peter Ivers oversaw the recording of further tracks at Minot Sound in White Plains, New York.\n"
   ],
   "infobox": {
      "Also known as": [
         "Metal Envelope"
      ],
      "Genres": [
         "Post-punk"
      ],
      "Years active": [
         "1979 (1979)–1981 (1981)"
      ],
      "Labels": [
         "Labor"
      ],
      "Associated acts": [
         "Swans, The Del-Byzanteens"
      ],
      "Past members": [
         "Michael Gira",
         "Rick Oller",
         "Dan Braun",
         "Josh Braun",
         "Angelo Pudignano",
         "Mike Pedulla",
         "Jonathan Kane"
      ]
   },
   "albums": [
      "Circus Mort"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from New York City, United States. Formed in [YEAR], the band included future Swans singer Michael Gira on vocals, guitarist [PERSON_NAME_FULL_2_MALE], bassist Dan [PERSON_NAME_LAST_0], [PERSON_NAME_FULL_0_MALE] on keyboards and [PERSON_NAME_FULL_1_MALE] on drums. Jonathan Kane, also of Swans, would become the third drummer for the group. The group recorded only one EP, a self-titled effort on Labor Records, before disbanding in [YEAR].\n",
      "The first members of [BAND_NAME] included Don Christensen on bass guitar. Before adopting the name [BAND_NAME] the band was called Metal Envelope. Twin brothers Josh and [PERSON_NAME_FULL_0_MALE] joined in [MONTH] [YEAR] on the recommendation of Christensen, followed by Pudignano who answered an [GENRE] band recorded two songs at Sorcerer Sound Studios in late [YEAR], [SONG_NAME], which led to the interest of promoter [PERSON_NAME_FULL_1_MALE]. He hired the band to play at the rock disco Hurrah in [MONTH] [YEAR], opening for Snatch.\n",
      "Pudignano left the band, and was replaced by Mike Pedulla. The band gigged around New York throughout [YEAR] playing at various clubs. In late [YEAR], Pedulla announced that he was leaving the band, and [PERSON_NAME_FULL_0_MALE] took his place. Shortly after, the band landed a [GENRE] band recorded demos of two songs, [SONG_NAME] at Sorcerer Sound to prepare for a forthcoming EP. Producer [PERSON_NAME_FULL_1_MALE] oversaw the recording of further tracks at Minot Sound in White Plains, New York.\n"
   ]
}