{
   "Name": "DA! (band)",
   "rawData": [
      "DA! was a Chicago-based post-punk band of the early 1980s, known for their songs \"Dark Rooms\" and \"Time Will Be Kind\".  Their sound was influenced by artists such as the Cure, Gang of Four, Bauhaus and Siouxsie and the Banshees.\n",
      "DA! was formed in 1977 by a 17-year-old singer and bass guitarist, Lorna Donley, along with the guitarist and keyboard player Evelyn Marquis and the drummer Dawn Fisher. This line-up performed only once, and the guitarist Gaylene Goudreau (who had previously played with the all-girl punk band Lois Layne) was added in late 1979.\n",
      "By early 1980, DA! had replaced Marquis with the guitarist David Thomas (who had previously played in St. Louis punk bands, The Singapores and Cool Jerk). By that summer, the band had become a fixture on Chicago's early punk music scene, performing regularly at area clubs like Exit, Oz, O'Banion's, Tuts, Waves and Space Place and opening for visiting groups including the Fall, DNA, Bauhaus and Mission of Burma.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, IL,  United States"
      ],
      "Genres": [
         "Post-punk"
      ],
      "Years active": [
         "1978–1982",
         "2010"
      ],
      "Labels": [
         "Autumn Records, Factory 25 Records"
      ],
      "Associated acts": [
         "Lois Layne, the Singapores, Cool Jerk, Strike Under"
      ],
      "Past members": [
         "Lorna Donley",
         "Evelyn Marquis",
         "Dawn Fisher",
         "Gaylene Goudreau",
         "David Thomas",
         "Bob Furem",
         "Jason Batchko"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band of the early [YEAR]s, known for their songs \"Dark Rooms\" and \"Time Will Be Kind\".  Their sound was influenced by artists such as the Cure, Gang of Four, Bauhaus and Siouxsie and the Banshees.\n",
      "[BAND_NAME] was formed in [YEAR] by a 17-year-old singer and bass guitarist, [PERSON_NAME_FULL_1_FEMALE], along with the guitarist and keyboard player Evelyn [MONTH]quis and the drummer Dawn Fisher. This line-up performed only once, and the guitarist [PERSON_NAME_FULL_2_FEMALE] (who had previously played with the all-girl punk band [PERSON_NAME_FULL_0_FEMALE]) was added in late [YEAR].\n",
      "By early [YEAR], [BAND_NAME] had replaced [MONTH]quis with the guitarist David Thomas (who had previously played in St. Louis punk bands, The Singapores and Cool Jerk). By that summer, the band had become a [GENRE]"
   ]
}