{
   "Name": "DA! (band)",
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Singles/EPs",
      "2.2 Compilation albums",
      "2.3 Compilation appearances",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "DA! was a Chicago-based post-punk band of the early 1980s, known for their songs \"Dark Rooms\" and \"Time Will Be Kind\".[1][2]  Their sound was influenced by artists such as the Cure, Gang of Four, Bauhaus and Siouxsie and the Banshees.[3]\n"
      ]
   },
   "History": {
      "text": [
         "DA! was formed in 1977 by a 17-year-old singer and bass guitarist, Lorna Donley, along with the guitarist and keyboard player Evelyn Marquis and the drummer Dawn Fisher. This line-up performed only once, and the guitarist Gaylene Goudreau (who had previously played with the all-girl punk band Lois Layne) was added in late 1979.\n",
         "By early 1980, DA! had replaced Marquis with the guitarist David Thomas (who had previously played in St. Louis punk bands, The Singapores and Cool Jerk). By that summer, the band had become a fixture on Chicago's early punk music scene, performing regularly at area clubs like Exit, Oz,[1] O'Banion's, Tuts, Waves and Space Place and opening for visiting groups including the Fall, DNA, Bauhaus and Mission of Burma.[4]\n",
         "DA!'s manager, Terry Nelson, a local punk radio DJ, formed Autumn Records with the producer George Kapoulas. DA! began to record demos in late summer 1980 with Timothy Powell and Metro Mobile. The first single, \"Dark Rooms\"/\"White Castles\",[2] was produced at Acme Studios by Kapoulas and Mike Rasfeld. With the spring 1981 release of the single, DA! attracted attention from outside Chicago, and performed in Milwaukee with the Ama-Dots, in Minneapolis with Hüsker Dü, and in Madison with X. Kapoulas, an engineer at WGN-TV, produced a music video for the single and \"Dark Rooms\" went into heavy rotation on \"Rock America\", a pre-MTV video cable service available in music clubs. \"Dark Rooms\" was the \"music video of the day\" at Chicagoist on March 22, 2013.[5]\n",
         "DA! appeared on the next Autumn Records release, a 1981 compilation LP titled Busted at Oz.[2] Recorded over three nights, it had live recordings by DA! and other Chicago punk bands including Strike Under, Naked Raygun, Silver Abuse, The Subverts and The Effigies.\n",
         "Following the release of the Busted at Oz LP, Fisher was briefly replaced by the Strike Under drummer, Bob Furem. DA! recorded the Time Will Be Kind EP with Powell at Sound Impressions in late 1981,[2] but by the time of its 1982 release, the group had disbanded.\n",
         "DA! and Donley appeared in You Weren’t There, a 2007 film about the Chicago punk scene from 1977 to 1984.[4] In 2010, Factory 25 Records released Exclamation Point, a vinyl LP compiling the band's previously released and unreleased material. DA! played two Chicago shows in 2010 to support the LP, the first with Furem on drums, the second with a new drummer, Jason Batchko. Their reunion concert at the Abbey Pub was documented in Robert Beshara's DA! Concert Film (2012), which was screened at the Chicago International Movies and Music Festival.[6]\n",
         "Donley, later a librarian in the Chicago Public Library system, died on December 1, 2013, due to a ruptured aorta.[1][3]\n",
         "The music historian Joel Whitburn once speculated that the band had recorded \"Ready 'N Steady\", a lost song credited to D.A. that appeared on the Billboard Bubbling Under Hot 100 Singles chart for three weeks in 1979.[7] The band insisted that they had not recorded it, and Whitburn has withdrawn his speculation regarding DA!'s involvement with the song. The song was found in 2016, at which point the D.A. who recorded that song was revealed to be the amateur singer/songwriter Dennis A. Lucchesi of California.[8]\n"
      ]
   },
   "Discography": {
      "Singles/EPs": {},
      "Compilation albums": {},
      "Compilation appearances": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "DA! was a Chicago-based post-punk band of the early 1980s, known for their songs \"Dark Rooms\" and \"Time Will Be Kind\".[1][2]  Their sound was influenced by artists such as the Cure, Gang of Four, Bauhaus and Siouxsie and the Banshees.[3]\n",
      "DA! was formed in 1977 by a 17-year-old singer and bass guitarist, Lorna Donley, along with the guitarist and keyboard player Evelyn Marquis and the drummer Dawn Fisher. This line-up performed only once, and the guitarist Gaylene Goudreau (who had previously played with the all-girl punk band Lois Layne) was added in late 1979.\n",
      "By early 1980, DA! had replaced Marquis with the guitarist David Thomas (who had previously played in St. Louis punk bands, The Singapores and Cool Jerk). By that summer, the band had become a fixture on Chicago's early punk music scene, performing regularly at area clubs like Exit, Oz,[1] O'Banion's, Tuts, Waves and Space Place and opening for visiting groups including the Fall, DNA, Bauhaus and Mission of Burma.[4]\n",
      "DA!'s manager, Terry Nelson, a local punk radio DJ, formed Autumn Records with the producer George Kapoulas. DA! began to record demos in late summer 1980 with Timothy Powell and Metro Mobile. The first single, \"Dark Rooms\"/\"White Castles\",[2] was produced at Acme Studios by Kapoulas and Mike Rasfeld. With the spring 1981 release of the single, DA! attracted attention from outside Chicago, and performed in Milwaukee with the Ama-Dots, in Minneapolis with Hüsker Dü, and in Madison with X. Kapoulas, an engineer at WGN-TV, produced a music video for the single and \"Dark Rooms\" went into heavy rotation on \"Rock America\", a pre-MTV video cable service available in music clubs. \"Dark Rooms\" was the \"music video of the day\" at Chicagoist on March 22, 2013.[5]\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, IL,  United States"
      ],
      "Genres": [
         "Post-punk"
      ],
      "Years active": [
         "1978–1982",
         "2010"
      ],
      "Labels": [
         "Autumn Records, Factory 25 Records"
      ],
      "Associated acts": [
         "Lois Layne, the Singapores, Cool Jerk, Strike Under"
      ],
      "Past members": [
         "Lorna Donley",
         "Evelyn Marquis",
         "Dawn Fisher",
         "Gaylene Goudreau",
         "David Thomas",
         "Bob Furem",
         "Jason Batchko"
      ]
   }
}