{
   "Name": "Delta 5",
   "rawData": [
      "Delta 5 was an English post-punk band from Leeds, West Yorkshire, England.\n",
      "The original members of Delta 5, Julz Sale (vocals/guitar), Ros Allen (bass) and Bethan Peters (bass), formed the band \"on a lark\", but soon became a part of the thriving Leeds post-punk scene, and later added Kelvin Knight on drums and Alan Riggs on guitar. Combining feminist politics with a two-bass funk-punk sound (much in the style of another, more famous Leeds band, Gang of Four), they released their debut single in 1979, \"Mind Your Own Business\". This song was later covered by Chicks on Speed, Le Shok, R. Stevie Moore, Pigface and Dum Dum Girls. Bethan Peters went on to play on Fun Boy Three's second album, Waiting. \n",
      "The members of Delta 5 were also important figures in the Rock Against Racism movement, and were the subject of a highly publicized assault at the hands of a right-wing group affiliated with rival movement Rock Against Communism.\n"
   ],
   "infobox": {
      "Origin": [
         "Leeds, West Yorkshire, England"
      ],
      "Genres": [
         "Post-punk, new wave"
      ],
      "Years active": [
         "1979–1981"
      ],
      "Labels": [
         "Rough Trade",
         "Pre",
         "Charisma"
      ],
      "Past members": [
         "Julz Sale",
         "Ros Allen",
         "Bethan Peters",
         "Kelvin Knight",
         "Alan Riggs",
         "Graeme High"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Leeds, West Yorkshire, England.\n",
      "The original members of [BAND_NAME], [MONTH]z Sale (vocals/guitar), Ros Allen (bass) and [PERSON_NAME_FULL_2_FEMALE] (bass), formed the band \"on a [GENRE] a part of the thriving Leeds post-punk scene, and later added Kelvin Knight on drums and [PERSON_NAME_FULL_0_MALE] on guitar. Combining feminist politics with a two-bass funk-punk sound (much in the style of another, more famous Leeds band, Gang of Four), they released their debut single in [YEAR], \"Mind Your Own Business\". This song was later covered by Chicks on Speed, Le Shok, R. [PERSON_NAME_FULL_1_MALE], Pigface and Dum Dum Girls. [PERSON_NAME_FULL_2_FEMALE] went on to play on Fun Boy Three's second album, Waiting. \n",
      "The members of [BAND_NAME] were also important figures in the Rock Against Racism movement, and were the subject of a [GENRE] a right-wing group affiliated with rival movement Rock Against Communism.\n"
   ]
}