{
   "Name": "ESG (band)",
   "rawData": [
      "ESG (Emerald Sapphire & Gold) is an American funk rock band formed in the South Bronx in 1978. Trouser Press called it \"one of the most dynamic bands that New York could offer at the top of the '80s.\" ESG has been influential across a wide range of musical genres, including hip hop, and dance-punk. The band's track \"UFO\" is one of the most sampled songs in history.\n",
      "The band originally consisted of the Scroggins sisters, Renee (vocals), Valerie (drums), Deborah (bass) and Marie (congas, vocals) and friend Tito Libran (congas, vocals). The band's name stands for emerald, sapphire, and gold. Emerald and sapphire are Valerie and Renee Scroggins' birthstones, and gold refers to the record certification. Ed Bahlman discovered ESG while serving as the judge for a talent show and became the band's unofficial manager.\n",
      "Tony Wilson from Factory Records approached the band after a performance at Hurrah in the Upper West Side of Manhattan, and three days later they began recording with Martin Hannett in Manchester, England. They recorded \"Moody\" and \"You're No Good\" in the first take. Hannett had three minutes left on the master tape, so he had the band record \"UFO\". The recordings helped bring Bahlman's focus to the band. On December 3, 1980, he recorded ESG's performance at Hurrah, which became the B-side for ESG. Bahlman formed a partnership with Factory so that his 99 Records label could release the EP in 1981. By July, they made a second pressing of the record. It was received positively by music critics. Robert Palmer called it one of 1981's \"freshest records\". The New York Times placed ESG second on its list of the best EPs and cassettes of 1981, and The Village Voice placed the EP third on its Pazz & Jop critics' poll.\n"
   ],
   "infobox": {
      "Origin": [
         "The Bronx, New York City, New York, U.S."
      ],
      "Genres": [
         "Avant-funk, post-punk, no wave, dance-punk"
      ],
      "Years active": [
         "1978–1985",
         "1991–2007",
         "2008–present"
      ],
      "Labels": [
         "99, Factory, Soul Jazz, Fire, Universal Sound, ESG Records"
      ],
      "Past members": [
         "Renee Scroggins",
         "Marie Scroggins",
         "Valerie Scroggins",
         "Deborah Scroggins",
         "Nicole Nicholas",
         "Nicholas Nicholas",
         "Chistelle Polite",
         "Leroy Glover",
         "Tito Libran",
         "David Miles"
      ]
   },
   "albums": [
      "Come Away with ESG",
      "Step Off",
      "Keep on Moving",
      "Closure",
      "What More Can You Take?"
   ],
   "prunedData": [
      "[BAND_NAME] (Emerald Sapphire & Gold) is an [GENRE] band formed in the South Bronx in [YEAR]. Trouser Press called it [SONG_NAME] is one of the most sampled songs in history.\n",
      "The band originally consisted of the [PERSON_NAME_LAST_0] sisters, [PERSON_NAME_FIRST_0] (vocals), Valerie (drums), Deborah (bass) and [MONTH]ie (congas, vocals) and friend Tito Libran (congas, vocals). The band's name stands for emerald, sapphire, and gold. Emerald and sapphire are Valerie and [PERSON_NAME_FULL_0_FEMALE]' birthstones, and gold refers to the record certification. Ed Bahlman discovered [BAND_NAME] while serving as the judge for a [GENRE] band's unofficial manager.\n",
      "Tony Wilson from Factory Records approached the band after a performance at Hurrah in the Upper West Side of Manhattan, and three days later they began recording with [MONTH]tin Hannett in Manchester, England. They recorded [SONG_NAME]. The New York Times placed [BAND_NAME] second on its list of the best EPs and cassettes of [YEAR], and The Village Voice placed the EP third on its Pazz & Jop critics' poll.\n"
   ]
}