{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "They formed in 1978 with Logic fresh out of art school. Their first 7\" was released on their own record label, Cells. They released a self-titled EP on Virgin Records in 1979, before signing to Rough Trade. Their debut studio album, Beat Rhythm News, was released in 1979, followed by several 7\"s before the band split in 1980.\n",
         "In 1978–1981 Logic also performed as a member of Red Crayola, as well as playing on recordings by The Stranglers, The Raincoats and Swell Maps.\n",
         "Lora Logic released a solo LP, Pedigree Charm, in 1982 on the Rough Trade label. Soon afterwards she gave up recording and performing when she turned to the Hare Krishna religion, though she did record and perform under the X-Ray Spex name again when they reformed in 1995.\n",
         "She resumed with Essential Logic in 2001, and released a four-track EP of new material. The new line-up included ex-members of the ska group Bad Manners and guitarist Gary Valentine of Blondie. A year later, a further four tracks from a recording session in 1998 were made available from the website, Vitaminic.\n",
         "In 2003, an anthology of Essential Logic recordings was issued, entitled Fanfare in the Garden, on the Kill Rock Stars record label.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Essential Logic are an English post-punk band formed in 1978 by saxophonist Lora Logic after leaving X-Ray Spex. The band initially consisted of Lora on vocals, Phil Legg on guitar and vocals, William Bennett (later of Whitehouse) on guitar, Mark Turner on bass guitar, Rich Tea (Richard Thompson) on drums and Dave Wright on saxophone. Turner was later replaced by Jon Oliver on bass. The band split in 1981 and reformed in 2001.\n"
      ]
   },
   "Title": "Essential Logic - Wikipedia"
}