{
   "Name": "Essential Logic",
   "rawData": [
      "Essential Logic are an English post-punk band formed in 1978 by saxophonist Lora Logic after leaving X-Ray Spex. The band initially consisted of Lora on vocals, Phil Legg on guitar and vocals, William Bennett (later of Whitehouse) on guitar, Mark Turner on bass guitar, Rich Tea (Richard Thompson) on drums and Dave Wright on saxophone. Turner was later replaced by Jon Oliver on bass. The band split in 1981 and reformed in 2001.\n",
      "They formed in 1978 with Logic fresh out of art school. Their first 7\" was released on their own record label, Cells. They released a self-titled EP on Virgin Records in 1979, before signing to Rough Trade. Their debut studio album, Beat Rhythm News, was released in 1979, followed by several 7\"s before the band split in 1980.\n",
      "In 1978–1981 Logic also performed as a member of Red Crayola, as well as playing on recordings by The Stranglers, The Raincoats and Swell Maps.\n"
   ],
   "infobox": {
      "Origin": [
         "England"
      ],
      "Genres": [
         "Post-punk"
      ],
      "Years active": [
         "1978–1981, 2001–present"
      ],
      "Past members": [
         "William Bennett",
         "David Wright",
         "Lora Logic",
         "Rich Tea"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band formed in [YEAR] by saxophonist Lora Logic after leaving X-Ray Spex. The band initially consisted of Lora on vocals, [PERSON_NAME_FULL_0_MALE] on guitar and vocals, William Bennett (later of Whitehouse) on guitar, [MONTH]k Turner on bass guitar, [PERSON_NAME_FULL_2_MALE] ([PERSON_NAME_FIRST_2]ard Thompson) on drums and [PERSON_NAME_FULL_1_MALE] on saxophone. Turner was later replaced by Jon Oliver on bass. The band split in [YEAR] and reformed in [YEAR].\n",
      "They formed in [YEAR] with Logic fresh out of art school. Their first 7[SONG_NAME]s before the band split in [YEAR].\n",
      "In [YEAR]–[YEAR] Logic also performed as a [GENRE]"
   ]
}