{
   "Name": "The Jesus Lizard",
   "rawData": [
      "The Jesus Lizard is an American rock band formed in 1987 in Austin, Texas and based in Chicago, Illinois.  They were \"a leading noise rock band in the American independent underground… turned out a series of independent records filled with scathing, disembowelling, guitar-driven pseudo-industrial noise, all of which received positive reviews in underground music publications and heavy college-radio play.\"\n",
      "After a brief run as a recording-only project based in Austin, founding vocalist David Yow, bassist David Wm. Sims, and guitarist Duane Denison relocated to Chicago, Illinois in 1989, where they found kindred spirits in recording engineer Steve Albini and Touch and Go Records.  With the addition of drummer Mac McNeilly, they began performing live, eventually attracting an international audience with their powerful live show. Drummer Jim Kimball replaced McNeilly late in 1996, and was himself replaced by Brendan Murphy two years later, with McNeilly returning to drums for their reunion shows years later.\n",
      "Despite releasing a split single with leading alt-rockers Nirvana and signing to Capitol Records, the band failed to find commercial success amid the alternative rock explosion of the 1990s and disbanded in 1999. Their reunion tour ten years later garnered positive responses from audiences and critics. The Jesus Lizard performed another reunion tour in 2017 and 2019.\n"
   ],
   "infobox": {
      "Origin": [
         "Austin, Texas, United States"
      ],
      "Genres": [
         "Noise rock, post-hardcore, alternative rock"
      ],
      "Years active": [
         "1987–1999, 2008–2010, 2017–present"
      ],
      "Labels": [
         "Touch and Go, Capitol"
      ],
      "Associated acts": [
         "The Denison/Kimball Trio, Scratch Acid, Rapeman, Phantom 309, Tomahawk, Qui, Legendary Shack Shakers, U.S.S.A., unFact"
      ],
      "Members": [
         "David Yow",
         "David Wm. Sims",
         "Duane Denison",
         "Mac McNeilly"
      ],
      "Past members": [
         "Jim Kimball",
         "Brendan Murphy"
      ]
   },
   "albums": [
      "Head",
      "Goat",
      "Liar",
      "Down",
      "Shot",
      "Blue"
   ]
}