{
   "Name": "Idiot Flesh",
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Idiot Flesh was an American experimental rock band formed in Oakland, California in 1985, initially working under the name Acid Rain.  Their work was characterized by its \"rock against rock\" slogan, and defied classification with its incorporation of marching band routines, puppet shows, and the playing of household items as tuned instruments.[1]\n",
         "Adopting the Idiot Flesh moniker in 1987, they went on to release three full-length albums before disbanding in 1998.  Founding members Nils Frykdahl and Dan Rathbun later played in Sleepytime Gorilla Museum, while Gene Jun later joined the Sun and Moon Ensemble.\n"
      ]
   },
   "History": {
      "text": [
         "The group formed in Barrington Hall,[2] a student co-op at the University of California at Berkeley, in 1985 as Acid Rain. Guitarist and composer Frykdahl (\"Pin\"), bassist Rathbun (\"The Improver\"), and guitarist and violinist Jun (\"Captain Dragon\") formed the group's core lineup, along with early drummers David Shamrock and Daniel Roth. Their demo album We Were All Very Worried was released as a cassette-only edition in 1987. They changed their name to Idiot Flesh prior to the release of their first vinyl album, Tales of Instant Knowledge and Sure Death, in 1990, which also featured drummer/artist Chuck Squier.\n",
         "The band was known to tour the US in a converted city bus with Rathbun as the driver/mechanic, with the windshield destination banner set for \"HELL.\"  Their live set incorporated stage performers and characters known as the Filthy Rotten Excuse Chickens, \"a motley bunch that enhances the Idiot Flesh experience with a variety of acrobatics, dancing and pantomime\".[3] These characters used such stage names as The Minotaurs of Baal, Beefra The Cook, Helpy The Hamburger Bee, Mr. Punch, Hatcha & Datcha: the Siamese Twins, Ming Tsao: Professor of Black Math, Uro Butoh, El Evil, Ward C. Picnic, The Queen of Oakland, and Mumble.\n",
         "The Nothing Show, their second album, appeared in 1993, and drummer Wes Anderson (\"Hyena Boy\") replaced Squier.  Extensive touring followed, including several runs with the Czech avant-punk band Už Jsme Doma.  They also appeared in the movie Oakland Underground, which has around three minutes of a secret Idiot Flesh show, and in which Frykdahl and Jun both had bit parts.\n",
         "The followup, 1997's Fancy, was released on four different formats: digipak, digipak re-press, standard jewel case and hand-made metal slipcase, the latter in very limited quantity. Although work began on an unnamed fourth album, it has yet to surface. Their final show was held on Friday, March 13, 1998, at the Transmission Theater in San Francisco. The group disbanded shortly thereafter.\n",
         "Frykdahl, Rathbun and Shamrock went on to form Sleepytime Gorilla Museum with Carla Kihlstedt, with whom they and Anderson had worked in Charming Hostess.  Frykdahl also became a core member of the group Faun Fables with Dawn McCarthy.  Jun later formed the jam band BARGOOMA!! and joined the Sun and Moon Ensemble.  Anderson went on to work with Les Claypool, Cirque du Soleil, The Fuxedos, Casino Royale, Kehoe Nation, and Schloss.\n"
      ]
   },
   "Members": {},
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Idiot Flesh was an American experimental rock band formed in Oakland, California in 1985, initially working under the name Acid Rain.  Their work was characterized by its \"rock against rock\" slogan, and defied classification with its incorporation of marching band routines, puppet shows, and the playing of household items as tuned instruments.[1]\n",
      "Adopting the Idiot Flesh moniker in 1987, they went on to release three full-length albums before disbanding in 1998.  Founding members Nils Frykdahl and Dan Rathbun later played in Sleepytime Gorilla Museum, while Gene Jun later joined the Sun and Moon Ensemble.\n",
      "The group formed in Barrington Hall,[2] a student co-op at the University of California at Berkeley, in 1985 as Acid Rain. Guitarist and composer Frykdahl (\"Pin\"), bassist Rathbun (\"The Improver\"), and guitarist and violinist Jun (\"Captain Dragon\") formed the group's core lineup, along with early drummers David Shamrock and Daniel Roth. Their demo album We Were All Very Worried was released as a cassette-only edition in 1987. They changed their name to Idiot Flesh prior to the release of their first vinyl album, Tales of Instant Knowledge and Sure Death, in 1990, which also featured drummer/artist Chuck Squier.\n",
      "The band was known to tour the US in a converted city bus with Rathbun as the driver/mechanic, with the windshield destination banner set for \"HELL.\"  Their live set incorporated stage performers and characters known as the Filthy Rotten Excuse Chickens, \"a motley bunch that enhances the Idiot Flesh experience with a variety of acrobatics, dancing and pantomime\".[3] These characters used such stage names as The Minotaurs of Baal, Beefra The Cook, Helpy The Hamburger Bee, Mr. Punch, Hatcha & Datcha: the Siamese Twins, Ming Tsao: Professor of Black Math, Uro Butoh, El Evil, Ward C. Picnic, The Queen of Oakland, and Mumble.\n"
   ]
}