{
   "Name": "Ludus (band)",
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Albums",
      "2.2 Singles and EPs",
      "2.3 Compilations and reissues",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Ludus was a British post-punk band formed in Manchester in 1978, which featured artist, designer and singer Linder Sterling.[1] It played jazz-, avant-garde- and punk- oriented material. The band influenced singer Morrissey, later of The Smiths and a solo artist, who remains one of the group's most vocal fans.\n"
      ]
   },
   "History": {
      "text": [
         "The band was founded by Linder Sterling, who in the arts and music scene is credited as Linder, having designed the cover of Buzzcocks' single \"Orgasm Addict\" and Magazine's debut album Real Life; and Arthur Kadmon, formerly of Manicured Noise. Shortly after the formation, ex-Nosebleeds drummer Philip \"Toby\" Tomanov and bassist Willie Trotter joined to complete the band. It debuted live at the Factory Club, supporting The Pop Group, in October 1978, recording a studio demo the same month. The following month, Ludus played shows at well-known 'punk' venues like Eric's Club in Liverpool and, travelling with Magazine, The Venue in London.\n",
         "Since its live debut at The Factory, Ludus was favourably reviewed in the press. In January 1979, Paul Morley, writing for NME, remarked: \n",
         "In February 1979, Ludus returned to the studio to record another demo, produced by Howard Devoto, Linder's boyfriend at the time.[1] Shortly after a brief UK tour supporting Buzzcocks in March 1979, Kadmon and Trotter quit the band.[1] Kadmon later joined The Distractions and Trotter moved onto working in the television industry. Ian Devine replaced them, after which the group began recording for New Hormones and pursued more abstract directions,[1] including jazz, improvisation, and (after moving on to Les Disques du Crepuscule) even French pop. A provocative live performance at The Haçienda club in Manchester on 5 November 1982 saw Linder take the stage dressed in a dress fashioned from raw meat. After a spell in exile in Brussels, the group disbanded in 1983.\n",
         "In October 1985 Morrissey wrote sleevenotes for an (unissued) Crepuscule compilation, and offered this closing eulogy: \"Ludus lay on us the decorative impulses of their music, and nowhere more significantly than on the volume which now lies before you. People who know real genius will love this record... Her singing leaves me out of breath... Linder went to Brussels and I remained stuck in Manchester, battling with the tides of fortune. Our shrill spirits still slide through the ugly streets of Manchester, always wet through, always caught out, always spectating, our hearts damaged by too many air-raids.\"[2]\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Singles and EPs": {},
      "Compilations and reissues": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Ludus was a British post-punk band formed in Manchester in 1978, which featured artist, designer and singer Linder Sterling.[1] It played jazz-, avant-garde- and punk- oriented material. The band influenced singer Morrissey, later of The Smiths and a solo artist, who remains one of the group's most vocal fans.\n",
      "The band was founded by Linder Sterling, who in the arts and music scene is credited as Linder, having designed the cover of Buzzcocks' single \"Orgasm Addict\" and Magazine's debut album Real Life; and Arthur Kadmon, formerly of Manicured Noise. Shortly after the formation, ex-Nosebleeds drummer Philip \"Toby\" Tomanov and bassist Willie Trotter joined to complete the band. It debuted live at the Factory Club, supporting The Pop Group, in October 1978, recording a studio demo the same month. The following month, Ludus played shows at well-known 'punk' venues like Eric's Club in Liverpool and, travelling with Magazine, The Venue in London.\n",
      "Since its live debut at The Factory, Ludus was favourably reviewed in the press. In January 1979, Paul Morley, writing for NME, remarked: \n",
      "In February 1979, Ludus returned to the studio to record another demo, produced by Howard Devoto, Linder's boyfriend at the time.[1] Shortly after a brief UK tour supporting Buzzcocks in March 1979, Kadmon and Trotter quit the band.[1] Kadmon later joined The Distractions and Trotter moved onto working in the television industry. Ian Devine replaced them, after which the group began recording for New Hormones and pursued more abstract directions,[1] including jazz, improvisation, and (after moving on to Les Disques du Crepuscule) even French pop. A provocative live performance at The Haçienda club in Manchester on 5 November 1982 saw Linder take the stage dressed in a dress fashioned from raw meat. After a spell in exile in Brussels, the group disbanded in 1983.\n"
   ]
}