{
   "Name": "Minimal Compact",
   "rawData": [
      "Minimal Compact is an Israeli rock band associated with the post-punk and indie rock movement of the 1980s.\n",
      "Between its foundation in 1980 and its dissolution seven years later, Minimal Compact  played an important role in the European rock scene. Malka Spigel (bass, vocals), Samy Birnbach (vocals, lyrics) and Berry Sakharof (guitars, keyboards, vocals) left their native Tel Aviv in 1981 for Amsterdam in search of an escape from the provincial attitudes of their own city. Of the trio, only Berry was a \"real\" musician. Malka was \"learning to play the bass\", while Samy was better known as a DJ (Morpheus) and a music fan who dabbled in poetry. They recorded a 2-song demo at home, and became one of the first artists signed to the Belgian Crammed label.\n",
      "During the recording for a speculative 7\" in a little studio in the Belgian countryside, it became quickly evident that the trio had hit upon something worthy of development and their first, self-titled, mini album Minimal Compact was the fruit of this. Their burgeoning style was a heavily Middle-Eastern coloured brand of post-new wave, based on driving rhythms, scratchy guitars and their own very un- \"Anglo-American\" style of vocalisation. In this way they both prefigured alternative dance and later fascinations with so called world music.\nThis mini-album (now re-released on CD along with its successor \"One by One\") features \"Statik Dancin' \" which remained a live staple throughout the band's career, and \"Creation Is Perfect\", based on a text by the beat poet Bob Kaufman.\n"
   ],
   "infobox": {
      "Origin": [
         "Tel Aviv, Israel; Brussels, Belgium"
      ],
      "Genres": [
         "New wave, alternative rock, post-punk, experimental rock"
      ],
      "Years active": [
         "1980–1988, 1991, 2003, 2008, 2012, 2016, 2019"
      ],
      "Labels": [
         "Crammed Discs, Wax Trax!"
      ],
      "Associated acts": [
         "Githead, Fortisakharof, Oracle, Foreign Affair, Gruesome Twosome, the Creatures, Skin, Wire"
      ],
      "Members": [
         "Malka Spigel ",
         " Samy Birnbach ",
         " Berry Sakharof ",
         " Max Franken ",
         " Rami Fortis"
      ]
   }
}