{
   "Name": "Mission of Burma",
   "rawData": [
      "Mission of Burma was an American post-punk band formed in Boston, Massachusetts in 1979. The band was formed by Roger Miller (guitar), Clint Conley (bass), Peter Prescott (drums) and Martin Swope (tape manipulator/sound engineer). Miller, Conley and Prescott share singing and songwriting duties.\n",
      "In early years the band's recordings were all released on the small Boston-based record label Ace of Hearts. Despite initial success, Mission of Burma disbanded in 1983 due to Miller's development of tinnitus caused by the volume of the band's live performances. In its original lineup, the band released only two singles, an EP, and one LP, Vs. Mission of Burma reformed in 2002, with Bob Weston replacing Swope, and has since recorded four more albums, ONoffON, The Obliterati, The Sound The Speed The Light and Unsound.\n",
      "Mission of Burma's history began with a short-lived Boston rock group called Moving Parts. The band included Roger Miller, who had moved to Boston from Ann Arbor, Michigan, and Clint Conley, who came from Darien, Connecticut. When Moving Parts broke up amicably in December 1978, Miller and Conley began practicing. Auditioning new drummers was accomplished, as Michael Azzerad puts it, \"by playing 'out' music, such as Sun Ra and James Brown, until the applicant left.\" They eventually recruited ex-Molls drummer Peter Prescott, who had admired the music of Moving Parts.\n"
   ],
   "infobox": {
      "Origin": [
         "Boston, Massachusetts, United States"
      ],
      "Genres": [
         "Post-punk, indie rock"
      ],
      "Years active": [
         "1979–1983, 2002–2016[1]"
      ],
      "Labels": [
         "Ace of Hearts, Taang! Records, Matador, Fire"
      ],
      "Associated acts": [
         "Moving Parts, Birdsongs Of The Mesozoic, Volcano Suns, Kustomized, Peer Group, Consonant, Shellac, Trinary System"
      ],
      "Website": [
         "www.missionofburma.com"
      ],
      "Members": [
         "Roger Miller",
         "Clint Conley",
         "Peter Prescott",
         "Bob Weston"
      ],
      "Past members": [
         "Martin Swope"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band formed in Boston, Massachusetts in [YEAR]. The band was formed by Roger Miller (guitar), [PERSON_NAME_FULL_0_MALE] (bass), Peter Prescott (drums) and [MONTH]tin Swope (tape manipulator/sound engineer). Miller, [PERSON_NAME_LAST_0] and Prescott share singing and songwriting duties.\n",
      "In early years the band's recordings were all released on the small Boston-based record label Ace of Hearts. Despite initial success, [BAND_NAME] disbanded in [YEAR] due to Miller's development of tinnitus caused by the volume of the band's live performances. In its original lineup, the band released only two singles, an EP, and one LP, Vs. [BAND_NAME] reformed in [YEAR], with Bob Weston replacing Swope, and has since recorded four more albums, ONoffON, The Obliterati, The Sound The Speed The Light and Unsound.\n",
      "[BAND_NAME]'s history began with a [GENRE] band included [PERSON_NAME_FULL_0_MALE], who had moved to Boston from Ann Arbor, Michigan, and [PERSON_NAME_FULL_1_MALE], who came from Darien, Connecticut. When Moving Parts broke up amicably in [MONTH] [YEAR], [PERSON_NAME_LAST_0] and [PERSON_NAME_LAST_1] began practicing. Auditioning new drummers was accomplished, as Michael Azzerad puts it, \"by playing 'out' music, such as Sun Ra and [PERSON_NAME_FULL_2_MALE], until the applicant left.\" They eventually recruited ex-Molls drummer Peter Prescott, who had admired the music of Moving Parts.\n"
   ]
}