{
   "Name": "The Names (band)",
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Live albums",
      "2.3 Compilation albums",
      "2.4 Singles and EPs",
      "2.5 Compilation appearances",
      "2.6 as Jazz",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "The Names are a Belgian post-punk band from Brussels, Belgium, formed in 1978 around bassist, vocalist and songwriter Michel Sordinia.\n"
      ]
   },
   "History": {
      "text": [
         "The early lineup of the band featured Sordinia, guitarist Marc Deprez and drummer/keyboard player Christophe Den Tandt; Robert Frankson and singer Isabelle Hanrez were briefly also members.[1][2] After local gigs as The Passengers, they changed their name in time for their debut single, \"Spectators of Life\", released by WEA in 1979 to test the market for homegrown new wave music.\n",
         "The band were keen to sign to a British label, and connected with Factory Records at a Joy Division gig at the Plan K venue in Brussels.[2] The Names, augmented by new drummer Luc Capelle, recorded \"Nightshift\" in Manchester in August 1980 with producer Martin Hannett.[1] The single was representative of their overall sound: dark, controlled modern rock in the mould of Magazine, Comsat Angels and Joy Division/early New Order. It peaked at No. 35 on the UK Indie Chart.[3] In February 1982, the band recorded a session for John Peel's BBC Radio 1 show,[4] later released in 2009 as the Radio Session 1982 digital EP.\n",
         "The Names enjoyed a long and rewarding relationship with mercurial producer Hannett, who also oversaw their next single, \"Calcutta\" (Factory Benelux, 1981) and debut album Swimming (Les Disques du Crepuscule, 1982).[2]\n",
         "Capelle was involved in a motorcycle accident, and Michel Silverstein replaced him while he recovered.[2] Meanwhile, Sordinia sang on the single \"Soul Kitchen\" by side project By Chance, released in 1981 on Crammed Discs.\n",
         "The Names mostly played live in the Benelux countries and France, including the ambitious Les Disques du Crepuscule multimedia package Dialogue North-South in February 1982. The group had also been booked to appear in Manchester in July 1980 as support to A Certain Ratio at the Beach Club. When The Names were delayed, New Order stepped in for their first live performance after the end of Joy Division.\n",
         "A final Names single, \"The Astronaut\", appeared in 1982 on the Les Disques du Crépuscule label,[1] again produced by Hannett, who had by then parted from Factory Records amidst some acrimony. However, the post-punk era was ending, and the band split.[1]\n",
         "In 1985, LTM Recordings issued an album (on cassette only) titled Postcard Views, consisting of studio material on one side and compiling live tracks on the second side.\n",
         "Expanded editions of Swimming, retitled Swimming + Singles, were issued in 1991 by Factory Benelux and in 2000 by LTM Recordings.[5][6] Factory Benelux reissued the expanded album again in 2013, simply as Swimming; this 2013 edition included their 1982 John Peel radio session.[7]\n",
         "In 1995, the original core trio of Sordinia, Deprez and Den Tandt reunited under the name Jazz, recording one self-released album, Nightvision.[2]\n",
         "A Names archive compilation titled Spectators of Life, including B-sides and live material from 1979-1982 (as well as two further Jazz tracks from 1994-1995), was released by LTM in 2001.\n",
         "In December 2007 The Names reunited for live event A Factory Night, once again at the Plan K in Brussels. In April 2009, the band released a new album, Monsters Next Door, via French label Str8line.[8] Den Tandt left the band in December 2009 and was replaced by Christophe Boulenger.\n",
         "Compilation album In Time was issued by Factory Benelux in 2014, gathering the best tracks from Nightvision and Monsters Next Door.\n",
         "On May 18, 2015, as a quartet with new drummer Laurent Loddewyckx, The Names released their third album, Stranger Than You, on Factory Benelux.[9]\n",
         "Another compilation, In Mutation, was issued in 2016 by Les Disques du Crépuscule, including a 1981 solo cassette single by Deprez and a 1982 live set.[10]\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Live albums": {},
      "Compilation albums": {},
      "Singles and EPs": {},
      "Compilation appearances": {},
      "as Jazz": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Names are a Belgian post-punk band from Brussels, Belgium, formed in 1978 around bassist, vocalist and songwriter Michel Sordinia.\n",
      "The early lineup of the band featured Sordinia, guitarist Marc Deprez and drummer/keyboard player Christophe Den Tandt; Robert Frankson and singer Isabelle Hanrez were briefly also members.[1][2] After local gigs as The Passengers, they changed their name in time for their debut single, \"Spectators of Life\", released by WEA in 1979 to test the market for homegrown new wave music.\n",
      "The band were keen to sign to a British label, and connected with Factory Records at a Joy Division gig at the Plan K venue in Brussels.[2] The Names, augmented by new drummer Luc Capelle, recorded \"Nightshift\" in Manchester in August 1980 with producer Martin Hannett.[1] The single was representative of their overall sound: dark, controlled modern rock in the mould of Magazine, Comsat Angels and Joy Division/early New Order. It peaked at No. 35 on the UK Indie Chart.[3] In February 1982, the band recorded a session for John Peel's BBC Radio 1 show,[4] later released in 2009 as the Radio Session 1982 digital EP.\n",
      "The Names enjoyed a long and rewarding relationship with mercurial producer Hannett, who also oversaw their next single, \"Calcutta\" (Factory Benelux, 1981) and debut album Swimming (Les Disques du Crepuscule, 1982).[2]\n"
   ],
   "infobox": {
      "Also known as": [
         "The Passengers"
      ],
      "Origin": [
         "Brussels, Belgium"
      ],
      "Genres": [
         "Post-punk"
      ],
      "Years active": [
         "1978 (1978)–c.1984, 2007–present"
      ],
      "Labels": [
         "WEA",
         "Factory",
         "Les Disques du Crépuscule",
         "Factory Benelux",
         "LTM Recordings",
         "Str8line"
      ],
      "Associated acts": [
         "By Chance, Jazz"
      ],
      "Website": [
         "thenames.be"
      ],
      "Members": [
         "Michel Sordinia",
         "Marc Deprez",
         "Luc Capelle",
         "Vincent Lesceux",
         "Christophe Boulenger"
      ],
      "Past members": [
         "Christophe Den Tandt",
         "Robert Frankson",
         "Isabelle Hanrez",
         "Laurent Loddewyckx",
         "Michel Silverstein"
      ]
   }
}