{
   "Name": "The Names (band)",
   "rawData": [
      "The Names are a Belgian post-punk band from Brussels, Belgium, formed in 1978 around bassist, vocalist and songwriter Michel Sordinia.\n",
      "The early lineup of the band featured Sordinia, guitarist Marc Deprez and drummer/keyboard player Christophe Den Tandt; Robert Frankson and singer Isabelle Hanrez were briefly also members. After local gigs as The Passengers, they changed their name in time for their debut single, \"Spectators of Life\", released by WEA in 1979 to test the market for homegrown new wave music.\n",
      "The band were keen to sign to a British label, and connected with Factory Records at a Joy Division gig at the Plan K venue in Brussels. The Names, augmented by new drummer Luc Capelle, recorded \"Nightshift\" in Manchester in August 1980 with producer Martin Hannett. The single was representative of their overall sound: dark, controlled modern rock in the mould of Magazine, Comsat Angels and Joy Division/early New Order. It peaked at No. 35 on the UK Indie Chart. In February 1982, the band recorded a session for John Peel's BBC Radio 1 show, later released in 2009 as the Radio Session 1982 digital EP.\n"
   ],
   "infobox": {
      "Also known as": [
         "The Passengers"
      ],
      "Origin": [
         "Brussels, Belgium"
      ],
      "Genres": [
         "Post-punk"
      ],
      "Years active": [
         "1978 (1978)–c.1984, 2007–present"
      ],
      "Labels": [
         "WEA",
         "Factory",
         "Les Disques du Crépuscule",
         "Factory Benelux",
         "LTM Recordings",
         "Str8line"
      ],
      "Associated acts": [
         "By Chance, Jazz"
      ],
      "Website": [
         "thenames.be"
      ],
      "Members": [
         "Michel Sordinia",
         "Marc Deprez",
         "Luc Capelle",
         "Vincent Lesceux",
         "Christophe Boulenger"
      ],
      "Past members": [
         "Christophe Den Tandt",
         "Robert Frankson",
         "Isabelle Hanrez",
         "Laurent Loddewyckx",
         "Michel Silverstein"
      ]
   }
}