{
   "Name": "The Jars",
   "rawData": [
      "The Jars were a new wave band from Berkeley, California active from 1978 to 1982.  According to Subterranean Records founder Steven Tupper, the Jars were one of the first bands to successfully combine 60s garage and 70s punk. They recorded two singles and were known for opening for many top punk and new wave bands that appeared in San Francisco during this period.\n",
      "Marc Time (b. Marc Gunther), Mik McDow (b. Mikkel McDow) and Armin Hammer (b. Gary Hobish) formed The Jars in 1978 with JD Buhl and Gary Nervo (b. Gary Mollica) (ex Pagans Road Manager).  The Jars helped spearhead the Berkeley punk/new wave scene by playing at the International Café, Aitos Club, Keystone Berkeley, Berkeley High School and various pizza parlors and frat parties.  By 1979 the Jars were playing all over the Bay Area at the Mabuhay Gardens, the Deaf Club, the Temple and the Old Waldorf opening for Roky Erickson, The Angry Samoans, Horslips, The Dickies, The Flaming Groovies, Psycotic Pineapple, the Dead Kennedys, The Suspects, The Mutants, and MX-80 to name but a few.  JD Buhl left the band in 1979.\n",
      "Despite its ubiquity in San Francisco's early punk scene, the band's recording history was brief. A 7\" EP was recorded in 1979 for Subterranean Records, “Start Rite Now”, a cover of The Sonics' “Psycho”, and “Electric 3rd Rail.\"  In 1980, a second 7\" 45, “Time of the Assassins/Jar Wars,” was recorded and released on a label run by Universal Records, a Telegraph Avenue record store. It featured a pic sleeve designed by Grammy-winning artist Hugh Brown showing Jack Ruby shooting Lee Harvey Oswald outside Berkeley's Elmwood Theater. Both songs received airplay on local college stations like KALX and performed strongly on the Mabuhay Gardens Rotten Record Chart. Mike Montalto (ex Special Guests, later with Red Meat) then joined on guitar. Sessions at Fantasy Studios for an EP \"Teenage Rebellion\" took place in 1981, but were never released.\n"
   ],
   "infobox": {
      "Genres": [
         "Garage rock, new wave"
      ],
      "Years active": [
         "1979 (1979)–1982 (1982)"
      ],
      "Labels": [
         "Subterranean Records, Universal Records (Berkeley, CA)"
      ],
      "Associated acts": [
         "Art Faggots, Bo, JD Buhl, The Beauty Killers, Red Meat, True Margrit"
      ],
      "Past members": [
         "Mik McDow, Gary Nervo, Armin Hammer, Rev. Marc Time, JD Buhl, Michael Montalto"
      ]
   },
   "albums": []
}