{
   "Name": "Primitive Calculators",
   "rawData": [
      "The Primitive Calculators are an Australian post-punk band, formed in Melbourne, Victoria in 1978. Described by British critic Everett True as sounding like \"a very aggressive Suicide\", the band is known for its mix of harsh guitar noise, fast and repetitive drum machine beats, and abrasive synthesizers. Along with fellow Melbourne act Whirlywirld, the Primitive Calculators played a leading role in founding the experimental Little Band Scene in the late 1970s, wherein both bands and numerous other acts formed large numbers of short-lived bands by frequently swapping members and inviting non-musicians to join in at live shows.\n",
      "They met as teenagers in Springvale, a working-class outer suburb of Melbourne, and moved together in 1977 to St Kilda, then the centre of the punk rock scene. The band in its initial form was Denise Rosenberg, Dave Light, Frank Lovece and Stuart Grant. Despite socialising with the likes of Nick Cave from The Boys Next Door they remained outsiders to this scene (most of which consisted of people from middle-class backgrounds with private-school educations), and in 1978 moved to Fitzroy.\n",
      "In Fitzroy, they settled on a four-piece lineup for recording and found like-minded friends, such as Ollie Olsen and John Murphy of Whirlywirld. They drew influence from proto-punk acts like The Godz and The Velvet Underground, Texan 1960s psychedelic punk, James Brown, and The Silver Apples, as well as Australian bands like Billy Thorpe and the Aztecs.\n"
   ],
   "infobox": {
      "Origin": [
         "Melbourne, Australia"
      ],
      "Genres": [
         "Post-punk, synth punk, noise rock"
      ],
      "Years active": [
         "1978–1980, 2009 to present"
      ],
      "Labels": [
         "Chapter Music"
      ],
      "Associated acts": [
         "Numerous Little Bands, Dee Rays, The Egg, Use No Hooks, The Bum Steers, Mr. Bum and Ruby."
      ]
   },
   "prunedData": [
      "The [BAND_NAME] are an [GENRE] band, formed in Melbourne, Victoria in [YEAR]. Described by British critic Everett True as sounding like \"a very aggressive Suicide\", the band is known for its mix of harsh guitar noise, fast and repetitive drum machine beats, and abrasive synthesizers. Along with fellow Melbourne act Whirlywirld, the [BAND_NAME] played a leading role in founding the experimental Little Band Scene in the late [YEAR]s, wherein both bands and numerous other acts formed large numbers of short-lived bands by frequently swapping members and inviting non-musicians to join in at live shows.\n",
      "They met as teenagers in Springvale, a working-class outer suburb of Melbourne, and moved together in [YEAR] to St Kilda, then the centre of the punk rock scene. The band in its initial form was [PERSON_NAME_FULL_0_FEMALE], Dave Light, [PERSON_NAME_FULL_2_MALE] and Stuart Grant. Despite socialising with the likes of [PERSON_NAME_FULL_1_MALE] from The Boys Next Door they remained outsiders to this scene (most of which consisted of people from middle-class backgrounds with private-school educations), and in [YEAR] moved to Fitzroy.\n",
      "In Fitzroy, they settled on a four-piece lineup for recording and found like-minded friends, such as [PERSON_NAME_FULL_0_FEMALE] and John Murphy of Whirlywirld. They drew influence from proto-punk acts like The Godz and The Velvet Underground, Texan [YEAR]s psychedelic punk, [PERSON_NAME_FULL_1_MALE], and The Silver Apples, as well as Australian bands like Billy Thorpe and the Aztecs.\n"
   ]
}