{
   "Citations": {
      "text": [
         "McFarlane, Ian (1999). The Encyclopedia of Australian rock and pop. St Leonards, N.S.W: Allen & Unwin.\n",
         "Spencer, Chris (1989). Who’s who of Australian rock. Fitzroy, Vic.: Five Mile Press.\n",
         "Walker, Clinton (1996). Stranded: The Secret History of Australian Independent Music 1977–1991. Sydney: Pan Macmillan.\n"
      ]
   },
   "External links": {},
   "History": {
      "First era": {
         "text": [
            "They met as teenagers in Springvale, a working-class outer suburb of Melbourne,[2] and moved together in 1977 to St Kilda, then the centre of the punk rock scene. The band in its initial form was Denise Rosenberg, Dave Light, Frank Lovece and Stuart Grant. Despite socialising with the likes of Nick Cave from The Boys Next Door they remained outsiders to this scene (most of which consisted of people from middle-class backgrounds with private-school educations), and in 1978 moved to Fitzroy.\n",
            "In Fitzroy, they settled on a four-piece lineup for recording and found like-minded friends, such as Ollie Olsen and John Murphy of Whirlywirld. They drew influence from proto-punk acts like The Godz and The Velvet Underground, Texan 1960s psychedelic punk, James Brown, and The Silver Apples, as well as Australian bands like Billy Thorpe and the Aztecs.\n",
            "The band were instrumental in organising a series of gigs named \"Little Band nights\", where hastily formed bands would play for 15 minutes each; this led to the recording of a compilation EP. They became known for their use of a screeching Mosrite Ventures model guitar, primitive synthesizers (a Wasp and Roland SH2), an electronic organ played through effects pedals and an extra fast drum machine (Roland CR-78).\n",
            "The Primitive Calculators played their last gig in March 1980, though their self-titled live album came out in the early 1980s. The band reformed briefly in 1986 to perform a live version of their song \"Pumping Ugly Muscle\" in the Richard Lowenstein film Dogs In Space (they later appeared in Lowenstein's 2009 documentary \"We're Livin' on Dog Food\").[2]\n"
         ]
      },
      "Second era": {
         "text": [
            "In 2001, a 1979 live recording of \"Pumping Ugly Muscle\" was included in \"Can't Stop It\", a compilation of Australian post-punk bands from 1978 to 1982, released by Chapter Music. The title of the CD was taken from the Calculators' only studio recording, made in December 1979, which was a 7\" single of the songs \"I Can't Stop It\" and \"Do That Dance\". This led to a renewed interest in the band that led to the 2003 release of the Glitter Kids EP, which featured three live recordings from 1979, by Meeuw Muzik in the Netherlands.\n",
            "The Primitive Calculators' album was reissued on CD by Chapter Music in 2004, with the inclusion of extra tracks from related projects (their first band The Moths from 1978 and other live recordings from 1979). In March 2007, Chapter Music released \"Primitive Calculators and Friends, 1979 to 1982\", a CD that contained the only studio recordings of the band (the 7\" single from 1979), the \"Little Band\" single, also from 1979, and live tracks from Little Band nights. It also contained other recordings from bands the members formed after 1980, such as a song called \"Zye Ye Ye\" (recorded in London in 1981 with Olsen and Murphy), and bands formed after the return of some of the band members to Australia from Europe, in 1982.\n",
            "In January 2009, the band reformed for the inaugural Australian All Tomorrow's Parties music festival, curated by Nick Cave and the Bad Seeds and held at Mount Buller in Victoria.[2] The band subsequently commenced the recording of a new album, called The World Is Fucked, released in 2013. Stuart Grant explained the album title in a December 2013 interview:\n",
            "\nThe album is called The World is F---ed because that's what we believe. The world's not any better now – in fact, it's worse. I can remember when the hippopotamus and rhinoceros weren't endangered species. I can remember when there was opposition, and when Chicago School economics wasn't a naturalised reality of life. And the anger in our music is because it doesn't need to be like that – and we don't need to be this nasty society.[2]",
            "Grant revealed that the band intends to record another album and stated: \"I want to make a psychedelic-space-folk record about taking hallucinogenic drugs.\"[2]\n",
            "Midway through recording their third LP Primitive Calculators were invited by Genjing Records and Split Works to play Jue Festival 2015 in Beijing and Shanghai. The band toured China also playing Xi’an, Yiwu and Wuhan and released a tour edition split 7\" with activist noise artist Torturing Nurse.\n",
            "In 2016, it Records released 'On Drugs', a single from Primitive Calculators forthcoming album by the same name. On Drugs, a boogie-rock soul inspired track, focused around the central character, Stuart Grant, signalled a change in the band's direction. The album is set for release in 2018.\n"
         ]
      }
   },
   "Personal lives": {
      "text": [
         "Grant stated in 2013 that he enjoys reading, drinking coffee and tea, and \"being of use in other people's lives\".[2]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 First era",
      "1.2 Second era",
      "2 Personal lives",
      "3 References",
      "4 Citations",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Primitive Calculators are an Australian post-punk band, formed in Melbourne, Victoria in 1978. Described by British critic Everett True as sounding like \"a very aggressive Suicide\",[1] the band is known for its mix of harsh guitar noise, fast and repetitive drum machine beats, and abrasive synthesizers. Along with fellow Melbourne act Whirlywirld, the Primitive Calculators played a leading role in founding the experimental Little Band Scene in the late 1970s, wherein both bands and numerous other acts formed large numbers of short-lived bands by frequently swapping members and inviting non-musicians to join in at live shows.\n"
      ]
   },
   "Title": "Primitive Calculators - Wikipedia"
}