{
   "Name": "Pylon (band)",
   "rawData": [
      "Pylon was an American new wave/post-punk band from Athens, Georgia, United States. The band's danceable sound, a blend of new wave, post-punk, jangle pop, alternative rock and funk rock, influenced the Athens music scene and the 1980s American pop underground. AllMusic wrote that Pylon's \"role as elder statesmen of the alternative rock explosion is unassailable\".\n",
      "The four members of Pylon were art students at the University of Georgia in Athens. Guitarist Randall Bewley and bass guitarist Michael Lachowski began playing music and attempting to form a band in 1978. Neither had any musical experience: as Lachowski later recalled, \"A lot of us in the art school were trying out different media with a punk rock message, which is just go in there and do it. You don’t need training, or authority or legitimacy. Just figure it out\". They originally formed the band with the intention of securing live appearances in New York City, along with press attention, before splitting up.\n",
      "They practiced in a studio in downtown Athens that Lachowski rented from Curtis Crowe, upstairs from the later location of the Grill on College Avenue. The room was lit by a single 40-watt light bulb, so the band referred to it as the \"40 Watt Club\". Crowe, who lived above the studio, recalled hearing Lachowski and Bewley's early rehearsals through the floor: \"a never-ending series of hooks—no bridges or chorus, just hooks\". He soon joined the band as a drummer, stating that he \"had every song memorized\" before he approached them to join. Bewley then approached Vanessa Briscoe (now Vanessa Briscoe Hay) about joining the band on vocals, on the basis that the band were fans of her art work: although she was initially reluctant as she also lacked musical experience, she auditioned for the band on February 14, 1979 and joined the lineup.\n"
   ],
   "infobox": {
      "Origin": [
         "Athens, Georgia, United States"
      ],
      "Genres": [
         "New wave, post-punk, alternative rock, funk rock"
      ],
      "Years active": [
         "1978–1983, 1989–1991, 2004–2009"
      ],
      "Labels": [
         "DB Records, Armageddon Records, Sky Records, DFA Records, Chunklet Industries"
      ],
      "Associated acts": [
         "Supercluster",
         "Pylon Reenactment Society"
      ],
      "Past members": [
         "Randall Bewley",
         "Curtis Crowe",
         "Vanessa Briscoe Hay",
         "Michael Lachowski"
      ]
   }
}