{
   "Name": "Pylon (band)",
   "Sections": [
      "1 History",
      "1.1 1979–1983: Formation, early years and breakup",
      "1.2 Legacy and influence",
      "1.3 1989–2009: Reunions",
      "1.4 Subsequent developments",
      "2 In popular culture",
      "3 Other projects",
      "4 Members",
      "5 Discography",
      "5.1 Studio albums",
      "5.2 Singles and EPs",
      "5.3 Live albums",
      "5.4 Box set",
      "5.5 Compilation albums",
      "6 Filmography",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Pylon was an American new wave/post-punk band from Athens, Georgia, United States.[1] The band's danceable sound, a blend of new wave, post-punk, jangle pop, alternative rock and funk rock,[2] influenced the Athens music scene and the 1980s American pop underground. AllMusic wrote that Pylon's \"role as elder statesmen of the alternative rock explosion is unassailable\".[3]\n"
      ]
   },
   "History": {
      "1979–1983: Formation, early years and breakup": {
         "text": [
            "The four members of Pylon were art students at the University of Georgia in Athens.[4] Guitarist Randall Bewley and bass guitarist Michael Lachowski began playing music and attempting to form a band in 1978. Neither had any musical experience: as Lachowski later recalled, \"A lot of us in the art school were trying out different media with a punk rock message, which is just go in there and do it. You don’t need training, or authority or legitimacy. Just figure it out\". They originally formed the band with the intention of securing live appearances in New York City, along with press attention, before splitting up.[5]\n",
            "They practiced in a studio in downtown Athens that Lachowski rented from Curtis Crowe, upstairs from the later location of the Grill on College Avenue. The room was lit by a single 40-watt light bulb, so the band referred to it as the \"40 Watt Club\". Crowe, who lived above the studio, recalled hearing Lachowski and Bewley's early rehearsals through the floor: \"a never-ending series of hooks—no bridges or chorus, just hooks\". He soon joined the band as a drummer, stating that he \"had every song memorized\" before he approached them to join.[5] Bewley then approached Vanessa Briscoe (now Vanessa Briscoe Hay) about joining the band on vocals, on the basis that the band were fans of her art work: although she was initially reluctant as she also lacked musical experience, she auditioned for the band on February 14, 1979 and joined the lineup.[3][5]\n",
            "Contrary to some accounts, Pylon did not name themselves after William Faulkner's 1935 novel of the same name. As Hay later explained to Nashville Scene writer Edd Hurt, the band was unaware of the Faulkner novel when they began playing, and instead were inspired by traffic cones.[6] According to Lachowski, \"we chose Pylon because it is severe, industrial, monolithic, functional\".[5] Their musical influences included Cabaret Voltaire, Suicide, the No New York compilation and the soundtrack to Eraserhead.[7]\n",
            "Pylon played their first live show at a party on March 9, 1979.[8] Despite receiving a relatively cool reception at their first two concerts, members of the B-52's attended Pylon's third show, where \"they started dancing and running around like crazy and everybody else did too\", according to Briscoe Hay.[5] Fred Schneider and Kate Pierson of the B-52's were particularly supportive and helped promote Pylon's music in New York City, getting them a gig at Hurrah.[9] After Schneider passed Hurrah's manager Jim Fouratt a Pylon demo tape, Fouratt called the band and offered them their choice of opening slots for a number of upcoming headlining bands: they chose to support the Gang of Four. Their performance was well received by the audience and was the subject of a positive review by Glenn O'Brien in Interview magazine.[5]\n",
            "Pylon's debut single, \"Cool\", backed by \"Dub\", was released on DB Records in 1979,[10] and received many positive critical reviews. It was followed by their first full-length album, Gyrate, in 1980.[11] That year they also opened for the B-52s at Central Park.[5]\n",
            "The !! 10\" EP, released in 1980 on the UK label Armageddon Records, included both sides of the debut single plus \"Driving School\" and \"Danger!!\" from the album.[12] Two further singles followed, \"Crazy\" (1981),[13] which charted at No. 61 for club play in Billboard,[14] and \"Beep\" (1982).[15]\n",
            "From 1980 to 1983, Pylon toured parts of the U.S., Canada and the UK, playing with groups such as the B-52's, Gang of Four, Mission of Burma, Love Tractor, R.E.M., Talking Heads and U2.\n",
            "Their second album, Chomp, was released in 1983.[16] By that time, the members of Pylon were beginning to feel that playing together was becoming less fun and more like a business, and after being poorly received by audiences when opening for U2 on the US leg of their War Tour, they decided to break up the band in late 1983,[1][7][5] their final show being at Athens' Mad Hatter club on December 1. Hay later said, \"For whatever reason it was our decision. We were like, 'Let's just quit while we're having fun.' That was kind of the idea in the first place. We were just going to perform as long as it was fun. So we broke up and it was a decision we all made together\".[7] Lachowski explained: \"we accomplished what we set out to do... It’s not that we are miserable, it’s just that we’ve seen all we’re going to see and don’t want to put any more time into it\".[5]\n"
         ]
      },
      "Legacy and influence": {
         "text": [
            "With some help from the members of R.E.M., Pylon's reputation as one of the great underground bands of the new wave era was solidified in 1987. Numerous musicians from the Athens rock scene publicly attested to their deep reverence for Pylon in the film Athens, GA: Inside/Out, released in February 1987.[17] In April, R.E.M. released the compilation album Dead Letter Office, which opened with a cover version of Pylon's \"Crazy\", previously issued as the B-side of their 1985 single \"Driver 8\".[4]\n",
            "When Rolling Stone named R.E.M. \"America's Best Band\" in December 1987, R.E.M. drummer Bill Berry said, \"We're not the best rock 'n' roll band in America\", declaring that Pylon was instead the best.[18] \"That was (R.E.M.) just being gracious and honoring the scene that they came out of and the scene that they obviously contributed to,\" said Lachowski in a 2016 interview in New York Observer. \"R.E.M. became so successful and successful in a different way. They were true musicians and had all kinds of historical knowledge about musical forms and different kinds of music. They were just very adept and confident and had so much more range. We were truly just art students assembling things with sound and instruments\".[7]\n"
         ]
      },
      "1989–2009: Reunions": {
         "text": [
            "After a six-year hiatus punctuated with a smattering of reunion shows, Pylon officially reformed in 1989,[19] coinciding with the release of a compilation of the band's work from 1979–83, Hits (1989).[20]\nThey opened for the final leg of R.E.M.'s Green tour.\n",
            "In 1990, the group released a new album, Chain, on Sky Records.[4] They played several more shows, including the South by Southwest Festival in 1990 and 1991, but when guitarist Bewley decided to leave in 1991, the band broke up again.[19]\n",
            "Pylon came out of retirement again in 2004, and played their first set in more than a decade in August 2004 at the then-fledgling Little King's Shuffle Club in Athens. They played the 2004 New Year's Eve show[19] at the 40 Watt Club, headlined the first night of the Athens music festival AthFest in June 2005, and recorded an untelevised segment for Pancake Mountain in 2006.\n",
            "On April 4, 2007, Pylon performed an impromptu show at Little King's to announce the reissue of Gyrate on DFA Records. Expanded with extra tracks and retitled Gyrate Plus, it was released on October 16, 2007. They performed several key shows in 2008, including the Part Time Punks Festival in Los Angeles,[21] a show taped for Georgia Public Broadcasting in Athens, and the Revolve Film and Music Festival in Winston-Salem, North Carolina.[22]\n",
            "On February 25, 2009, Bewley died, two days after suffering a heart attack while driving his van.[23]\n",
            "Bewley's death brought the band's career to a close; Hay said, \"Pylon died when Randy died\".[7]\n"
         ]
      },
      "Subsequent developments": {
         "text": [
            "DFA reissued the band's second album in expanded form as Chomp More in 2009.[3]\n",
            "In October 2011, DFA issued a two-track 7\" split single called Cover + Remix. The A-side featured a cover of Pylon's \"Cool\" by Deerhunter, while the B-side consisted of a remix of \"Yo-Yo\" by Calvinist.[24]\n",
            "On July 25, 2016, Chunklet Industries released the double album Pylon Live, which had been recorded at Athens club The Mad Hatter on December 1, 1983, before they disbanded for the first time.[25] Pitchfork called it \"an all-business, no-banter set that sees them streamroll through 20 songs in 70 minutes with assembly-line precision: bassist Michael Lachowski and drummer Curtis Crowe lay the foundation, Bewley sculpts it into strange shapes with his surgical guitar lines, and singer Vanessa Briscoe-Hay splatters her mantric messaging on the walls like a spraycan-wielding prophet\"\n.[26] It was previewed by Chunklet's April 20 release of a 7\" single, \"Gravity\", taken from the live album.[27][28]\n",
            "New West Records reissued the \"Cool\"/\"Dub\" single as a special edition for Record Store Day in 2019. On August 28, 2020, the label announced the November 6, 2020 release of Pylon Box, a vinyl box set that contains remastered editions of Gyrate and Chomp, and two exclusive albums, Extra (containing various non-album tracks and five previously unissued recordings) and Razz Tape, containing the band's first-ever studio recordings, preceding the \"Cool\"/\"Dub\" single. The box also includes a 200-page hardcover book with new interviews with the surviving members of the band and testimonies from members of R.E.M., The B-52's, Gang of Four, The Bongos, Mission of Burma, Sleater-Kinney, Beat Happening, and Sonic Youth, amongst others.[29]\n"
         ]
      }
   },
   "In popular culture": {
      "text": [
         "Pylon's 1979 song \"Cool\" was used in a TV commercial for the 2016 Lexus RX.[30]\n"
      ]
   },
   "Other projects": {
      "text": [
         "Hay is a member of the Athens band Supercluster, formed in 2007, as was Bewley prior to his death.[31]\n",
         "Since 2014, Hay has fronted the Pylon Reenactment Society, a Pylon tribute act featuring members of more recent Athens bands like the Glands and Casper & the Cookies.[32] In a 2016 Portland Mercury interview, Hay said, \"It's been inspirational, if that's the right word, to be able to play this music again. I really don't want people to forget Pylon. These are different people and we are re-enacting this experience, so it's not exactly Pylon, but it's fresh and done in the same spirit\". In October 2017, Pylon Reenactment Society self-released an EP initially recorded on December 11, 2016 for broadcast in Los Angeles, California for DJ Michael Stock's Part Time Punks KXLU show, titled Part Time Punks Session.[33][34]\n"
      ]
   },
   "Members": {},
   "Discography": {
      "Studio albums": {},
      "Singles and EPs": {},
      "Live albums": {},
      "Box set": {},
      "Compilation albums": {}
   },
   "Filmography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Pylon was an American new wave/post-punk band from Athens, Georgia, United States.[1] The band's danceable sound, a blend of new wave, post-punk, jangle pop, alternative rock and funk rock,[2] influenced the Athens music scene and the 1980s American pop underground. AllMusic wrote that Pylon's \"role as elder statesmen of the alternative rock explosion is unassailable\".[3]\n",
      "The four members of Pylon were art students at the University of Georgia in Athens.[4] Guitarist Randall Bewley and bass guitarist Michael Lachowski began playing music and attempting to form a band in 1978. Neither had any musical experience: as Lachowski later recalled, \"A lot of us in the art school were trying out different media with a punk rock message, which is just go in there and do it. You don’t need training, or authority or legitimacy. Just figure it out\". They originally formed the band with the intention of securing live appearances in New York City, along with press attention, before splitting up.[5]\n",
      "They practiced in a studio in downtown Athens that Lachowski rented from Curtis Crowe, upstairs from the later location of the Grill on College Avenue. The room was lit by a single 40-watt light bulb, so the band referred to it as the \"40 Watt Club\". Crowe, who lived above the studio, recalled hearing Lachowski and Bewley's early rehearsals through the floor: \"a never-ending series of hooks—no bridges or chorus, just hooks\". He soon joined the band as a drummer, stating that he \"had every song memorized\" before he approached them to join.[5] Bewley then approached Vanessa Briscoe (now Vanessa Briscoe Hay) about joining the band on vocals, on the basis that the band were fans of her art work: although she was initially reluctant as she also lacked musical experience, she auditioned for the band on February 14, 1979 and joined the lineup.[3][5]\n",
      "Contrary to some accounts, Pylon did not name themselves after William Faulkner's 1935 novel of the same name. As Hay later explained to Nashville Scene writer Edd Hurt, the band was unaware of the Faulkner novel when they began playing, and instead were inspired by traffic cones.[6] According to Lachowski, \"we chose Pylon because it is severe, industrial, monolithic, functional\".[5] Their musical influences included Cabaret Voltaire, Suicide, the No New York compilation and the soundtrack to Eraserhead.[7]\n"
   ]
}