{
   "Name": "Savage Republic",
   "Sections": [
      "1 History",
      "2 Musical style",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Singles and EPs",
      "3.3 Live albums",
      "3.4 Compilation albums",
      "3.5 Home videos",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Savage Republic (originally named Africa Corps) is an American, Los Angeles-based post-punk band, formed in the early 1980s. The group reformed in 2002 and remains active with a different lineup.\n",
         "They are known for lengthy songs with an emphasis on percussion and droning guitars. \n"
      ]
   },
   "History": {
      "text": [
         "The band was originally named Africa Corps, and was formed by UCLA students Bruce Licher (guitar) and Mark Erskine (drums/percussion).[1] They were joined by Philip Drucker (aka Jackson Del Rey), Robert Loveless, and Jeff Long.[1][2] Shortly before the release of debut album Tragic Figures in 1982 (on Licher's own Independent Project label) they changed their name to Savage Republic.[3] Licher was also responsible for the group's sleeve designs, which were hand-letterpressed and numbered by him.[3]\n",
         "In early 1983, they issued a single, \"Film Noir\", backed with a version of \"O Andonis\" by Greek composer Mikis Theodorakis (from the Costa-Gavras film Z), which garnered international attention.[4]\n",
         "The group split up towards the end of 1983 with a second album partially completed; Loveless and Drucker completed it and it was released as an album (Jedda by the Sea) by their side project 17 Pygmies.[2] Tragic Figures was issued in Europe in 1984 on the Sordide Sentimental label.[1] A 7\" EP of material recorded in 1981, Tragic Figure, was also issued that year.\n",
         "The band returned in 1985 with the album Ceremonial, followed in 1986 with the Trudge EP.[1] A live double album was released in 1987.[1] Brad Laner joined prior to the 1988 album Jamahiriya Democratique et Populaire de Sauvage, and a further studio album (Customs) was released prior to the band splitting up in 1990.[1]\n",
         "Licher continued to run his label, and received a Grammy nomination for the artwork for For Against's debut album.[3] He formed Scenic in the mid-1990s, a group that also featured Loveless and former Shiva Burlesque member James Brenner.[1] Laner went on to form Medicine.[1]\n",
         "Savage Republic reformed in 2002 with original member Licher and members from the mid-1980s including Greg Grunke, Thom Fuhrmann and Ethan Port, although Licher left after a first tour. The remaining members recorded the album 1938, released by Neurot Recordings in 2007.[3]\n"
      ]
   },
   "Musical style": {
      "text": [
         "The band's music has been called industrial, with AllMusic's Richie Unterberger describing it as music that \"grafted tribal percussion, industrial drones, and raga-like guitar lines together\".[3] Unusual percussion was a large part of their sound, incorporating oil cans and metal pipes.[3] Trouser Press described the debut album as \"a combination of industrial drone with deep machine-like swaths of dragging bass, Halloween horror-movie screams and some of the most delightfully tribal and tropical percussion found on disc\".[2] When the band reformed in 1985 they incorporated more Arabic influences.[2] Later work also incorporated Greek influences.[2] The band's music was described in Music USA: The Rough Guide as \"hypnotic post-modern raga-rock instrumentals\" and \"clattering noise-rock jams\".[5]\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Singles and EPs": {},
      "Live albums": {},
      "Compilation albums": {},
      "Home videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Savage Republic (originally named Africa Corps) is an American, Los Angeles-based post-punk band, formed in the early 1980s. The group reformed in 2002 and remains active with a different lineup.\n",
      "They are known for lengthy songs with an emphasis on percussion and droning guitars. \n",
      "The band was originally named Africa Corps, and was formed by UCLA students Bruce Licher (guitar) and Mark Erskine (drums/percussion).[1] They were joined by Philip Drucker (aka Jackson Del Rey), Robert Loveless, and Jeff Long.[1][2] Shortly before the release of debut album Tragic Figures in 1982 (on Licher's own Independent Project label) they changed their name to Savage Republic.[3] Licher was also responsible for the group's sleeve designs, which were hand-letterpressed and numbered by him.[3]\n",
      "In early 1983, they issued a single, \"Film Noir\", backed with a version of \"O Andonis\" by Greek composer Mikis Theodorakis (from the Costa-Gavras film Z), which garnered international attention.[4]\n"
   ],
   "infobox": {
      "Also known as": [
         "Africa Corps"
      ],
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Post-punk, art punk, industrial"
      ],
      "Years active": [
         "Early 1980s–1990 (1990), 2002–present"
      ],
      "Labels": [
         "Independent Project Records, Sordide Sentimental, Fundamental, PIAS Recordings, Nate Starkman & Son, Mobilization Records, Staalplaat, A Silent Place, LTM Recordings"
      ],
      "Associated acts": [
         "Bridge, Project 197, Wasted Youth, 17 Pygmies, Scenic, Brad Laner, Medicine, For Against, Fourwaycross, Del Rey & the Sun Kings, Them Rhythm Ants, Autumnfair, Lusk, Death Ride 69, F-Space"
      ],
      "Members": [
         "Thom Fuhrmann ",
         "Ethan Port",
         "Alan Waddington",
         "Kerry Dowling"
      ],
      "Past members": [
         "Bruce Licher",
         "Mark Erskine",
         "Philip Drucker (Jackson Del Rey)",
         "Robert Loveless",
         "Jeff Long",
         "Brad Laner",
         "Greg Grunke",
         "Joel Connell",
         "Val Haller"
      ]
   }
}