{
   "Name": "Savage Republic",
   "rawData": [
      "Savage Republic (originally named Africa Corps) is an American, Los Angeles-based post-punk band, formed in the early 1980s. The group reformed in 2002 and remains active with a different lineup.\n",
      "They are known for lengthy songs with an emphasis on percussion and droning guitars. \n",
      "The band was originally named Africa Corps, and was formed by UCLA students Bruce Licher (guitar) and Mark Erskine (drums/percussion). They were joined by Philip Drucker (aka Jackson Del Rey), Robert Loveless, and Jeff Long. Shortly before the release of debut album Tragic Figures in 1982 (on Licher's own Independent Project label) they changed their name to Savage Republic. Licher was also responsible for the group's sleeve designs, which were hand-letterpressed and numbered by him.\n"
   ],
   "infobox": {
      "Also known as": [
         "Africa Corps"
      ],
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Post-punk, art punk, industrial"
      ],
      "Years active": [
         "Early 1980s–1990 (1990), 2002–present"
      ],
      "Labels": [
         "Independent Project Records, Sordide Sentimental, Fundamental, PIAS Recordings, Nate Starkman & Son, Mobilization Records, Staalplaat, A Silent Place, LTM Recordings"
      ],
      "Associated acts": [
         "Bridge, Project 197, Wasted Youth, 17 Pygmies, Scenic, Brad Laner, Medicine, For Against, Fourwaycross, Del Rey & the Sun Kings, Them Rhythm Ants, Autumnfair, Lusk, Death Ride 69, F-Space"
      ],
      "Members": [
         "Thom Fuhrmann ",
         "Ethan Port",
         "Alan Waddington",
         "Kerry Dowling"
      ],
      "Past members": [
         "Bruce Licher",
         "Mark Erskine",
         "Philip Drucker (Jackson Del Rey)",
         "Robert Loveless",
         "Jeff Long",
         "Brad Laner",
         "Greg Grunke",
         "Joel Connell",
         "Val Haller"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] (originally named Africa Corps) is an [GENRE] band, formed in the early [YEAR]s. The group reformed in [YEAR] and remains active with a different lineup.\n",
      "They are known for lengthy songs with an [GENRE]",
      "The band was originally named Africa Corps, and was formed by UCLA students [PERSON_NAME_FULL_1_MALE] (guitar) and [MONTH]k Erskine (drums/percussion). They were joined by Philip Drucker (aka [PERSON_NAME_FULL_0_MALE]), Robert Loveless, and [PERSON_NAME_FULL_2_MALE]. Shortly before the release of debut album Tragic Figures in [YEAR] (on [PERSON_NAME_LAST_1]'s own Independent Project label) they changed their name to [BAND_NAME]. [PERSON_NAME_LAST_1] was also responsible for the group's sleeve designs, which were hand-letterpressed and numbered by him.\n"
   ]
}