{
   "Current line-up of Tin Huey": {},
   "Discography": {},
   "External links": {},
   "Former members of the Rags/Tin Huey": {},
   "History": {
      "Career": {
         "text": [
            "Inspired by Captain Beefheart, Frank Zappa, The Stooges and the Soft Machine, Tin Huey signed with Warner Bros. Records, recorded, and then released their debut album Contents Dislodged During Shipment in 1979 (later issued for the first time on CD by Collector's Choice Music in 2003).[3] It wasn't a commercial success, however. Ralph Legnini (a.k.a. Ralph E.) played with the band for several early '80s shows before they went their separate ways. It would be two decades before they released any new material.\n",
            "Their follow-up second album, Disinformation, was released in 1999 by Butler's Future Fossil Records. Since then, they have played shows both in Ohio and in the greater New York City area. Most recently, they assembled recordings from the mid-70s for their third album, Before Obscurity: The Bushflow Tapes.[1] The album is a combination of studio recordings and live performances from JB's in Kent, Ohio, where they regularly played. They've also been gathering new material for their fourth album, New Stuff: Obscure Deluxe. Perversity was released on November 17, 2009, on the Smog Veil label, becoming their first new album in over a decade. New Stuff's exact release date is yet to be substantiated.\n",
            "In 2003, Tin Huey were among the Midwestern/Akronite bands that were featured in the PBS documentary It's Everything, And Then It's Gone, which covered the mostly overlooked stories about the bands who hailed from the Ohio music scene and developed the \"Akron Sound\".\n",
            "That same year, Tin Huey played at the Rock and Roll Hall of Fame in Cleveland.\n",
            "Tin Huey briefly became a septet after adding newcomer Bob Ethington, formerly of Unit 5. Price died after a four-year battle with colon cancer on November 6, 2008 at the age of 56. Following his death, Tin Huey as a band stopped performing. A spin-off band, Half Cleveland, was formed in 2007 featuring Gold, Butler, Ethington, and former Chi-Pig bassist Debbie Smith.[4] They have played occasional shows in the Akron/Cleveland area, including opening a show at the Akron Civic Theater for Chrissie Hynde of the Pretenders.\n",
            "Since Price's death, there have been a couple live 'events', one a jam loosely dedicated to Mark involving all the surviving members of the Hueys, bass handled by Gold, Smith, and Kristoffer Carter (The KC Show). The second was an Arts Program benefit billed as \"A Gaggle of Hueys and a Houseguest\" featuring original Hueys Gold, Aylward and Austin, along with Dave Rich of Houseguest. Recently, Gold and Aylward have also been playing improvisational guitar duets at local art galleries.\n"
         ]
      },
      "Original lineups": {
         "text": [
            "The band was originally known as Rags and started out with three members: Mark Price, Michael Aylward, and Stuart Austin.[1] Later, the band decided to rename themselves after Aylward's younger brother. When the trio were Rags, Price (then known as Wesley the Stash) played guitar, Aylward played bass, and Austin (then known as Napoleon Lemens) played drums. Harvey Gold became the fourth member to join on organ.[2]\n",
            "When Price left the band, the remaining members switched to acoustic music before hiring electric guitarist Arthur Baranoff and bassist Wayne Swickley.\n",
            "When they left, Price rejoined and became the bassist, while Aylward took on electric guitar, and Gold alternated between electric guitar and keyboards; they briefly added saxophonist Lochi MacIntosh to the lineup before replacing him with Ralph Carney. Chris Butler (who was the bassist for 15-60-75 (The Numbers Band), was the last to join, also on guitar. Tin Huey was part of the influx of bands emerging from the Akron/Cleveland music scene, others including Devo, Pere Ubu, Chi-Pig, the Electric Eels, the Bizarros and the Rubber City Rebels.\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Original lineups",
      "1.2 Career",
      "2 Current line-up of Tin Huey",
      "3 Former members of the Rags/Tin Huey",
      "4 Discography",
      "5 See also",
      "6 References",
      "7 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "Tin Huey is an American experimental rock and new wave band from Akron, Ohio, United States, that formed in the mid/late 1970s.\n"
      ]
   },
   "Title": "Tin Huey - Wikipedia"
}