{
   "Name": "Tuxedomoon",
   "rawData": [
      "Tuxedomoon is an experimental, post-punk, new wave band from San Francisco, California, United States. The band formed in the late 1970s at the beginning of the punk rock movement. Pulling influence from punk and electronic music, the group, originally consisting of Steven Brown (born Steven Allan Brown on August 23, 1952, in Chicago, Illinois) and Blaine L. Reininger, used electronic violins, guitars, screaming vocals and synthesizers to develop a unique \"cabaret no-wave\" sound. Bassist Peter Principle (Peter Dachert, 1954–2017) joined the band and in 1979 they released the single \"No Tears\", which remains a post-punk cult classic. That year they signed to Ralph Records and released their first album, Half-Mute. Eventually, Reininger left the group, and Tuxedomoon relocated to Europe, signing to Crammed Discs and releasing Holy Wars in 1985. The band separated in the early 1990s, only to reunite later that decade. They all have remained together since releasing the album Cabin in the Sky in 2004.\n",
      "In 1977, Tuxedomoon formed out of The Angels of Light, an artist collective and commune, a group in which Steven Brown was involved. He met Blaine L. Reininger in an electronic music class at San Francisco City College. Brown worked with Tommy Tadlock, of the Angels of Light, to create the final project of the class. Tadlock would go on to be Tuxedomoon's manager. Reininger and Brown started playing music together at Tadlock's house. Reininger played electronic violin and guitar. Tadlock assisted with the sound and audio. He also created tools for the band, including a \"Treatment Mountain\" –  a pyramid made of plywood, which held all of Reininger's effects pedals.\n",
      "They started playing music together in the mid-1970s, when punk rock became popular in the underground music scene. \"The only rule was the tacit understanding that anything that sounded like anyone else was taboo\", stated Brown on the band aiming to create music that sounded unlike anything else before. The vocals were screaming and inspired by punk rock, and the band used any instruments they had around, including saxophones and a polymoog synthesizer. The band had no drummer. Bassist Peter Principle, performance artist Winston Tong and Bruce Geduldig, a filmmaker, joined the band during concerts. The band created new performances for each concert, creating theatrical performances and being described as \"theatrical electronic cabaret\". The band performed frequently with Pere Ubu, The Residents, Devo, and Cabaret Voltaire.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Experimental",
         "post-punk",
         "new wave",
         "synth-punk"
      ],
      "Years active": [
         "1977 (1977)–present"
      ],
      "Labels": [
         "Ralph, Crammed Discs"
      ],
      "Website": [
         "www.tuxedomoon.co"
      ],
      "Members": [
         "Blaine L. Reininger",
         "Steven Brown",
         "Luc Van Lieshout",
         "David Haneke"
      ],
      "Past members": [
         "Peter Dachert",
         "Bruce Geduldig",
         "Winston Tong",
         "Gregory Cruikshank",
         "Victoria Lowe",
         "Michael Belfer",
         "Paul Zahl",
         "Ivan Georgiev",
         "Nikolas Klau",
         "George Kakanakis",
         "Marcia Barcellos"
      ]
   },
   "albums": [
      "Half-Mute",
      "Desire",
      "Divine",
      "Holy Wars",
      "Ship of Fools",
      "You",
      "The Ghost Sonata",
      "Joeboy in Mexico",
      "Cabin in the Sky",
      "Vapour Trails",
      "Pink Narcissus"
   ]
}