{
   "Name": "Ultravox",
   "Sections": [
      "1 History",
      "1.1 Early years – Tiger Lily: 1974–1976",
      "1.2 Experimental years: 1976–1979",
      "1.2.1 Ultravox!",
      "1.2.2 Becoming Ultravox",
      "1.3 The Midge Ure years: 1979–1987",
      "1.4 Currie's own Ultravox in the Nineties: 1992–1996",
      "1.5 Reunion: 2008–2013",
      "1.6 Legacy",
      "2 Discography",
      "2.1 Studio albums",
      "3 Band members",
      "3.1 Lineups",
      "3.2 Timeline",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Ultravox (earlier stylized as Ultravox!) were a British new wave band, formed in London in April 1974 as Tiger Lily. Between 1980 and 1986, they scored seven Top Ten albums and seventeen Top 40 singles in the UK, the most successful of which was their 1981 hit \"Vienna\".\n",
         "From 1974 until 1979, singer John Foxx was frontman and the main driving force behind Ultravox. Foxx left the band in March 1979 to embark on a solo career and, following his departure, Midge Ure took over as lead singer, guitarist and frontman in October 1979 after he and keyboardist Billy Currie worked in the studio project Visage. Ure revitalised the band and steered it to commercial chart success lasting until 1987, at which time the group disbanded.\n",
         "A new line-up, led by Currie, was formed in 1992, but achieved limited success, with two albums failing to chart and one solitary single reaching 90 in the UK Singles Chart.\n",
         "The band's best-known line-up of Currie, Ure, bassist Chris Cross and drummer Warren Cann reformed in 2008 and performed a series of reunion shows in 2009 and 2010 before releasing a new studio album, Brill!ant, in May 2012 which reached 21 in the British Album Charts. In November 2013, Ultravox performed as special guests on a four date UK arena tour with Simple Minds. These shows proved to be Ultravox's last, as in 2017 both Currie and Ure indicated that Ultravox had run its course.\n"
      ]
   },
   "History": {
      "Early years – Tiger Lily: 1974–1976": {
         "text": [
            "The band was formed in April 1974 on the initiative of vocalist and songwriter Dennis Leigh, a then Royal College of Art student, and was originally known as Tiger Lily. An initial but incomplete line-up comprised Leigh plus Chris Allen who was then billed as Chris St. John (bass guitar) and Stevie Shears (guitar),[1] with Warren Cann (drums) and Billy Currie (violin) joining in May and October 1974 respectively.[2] The group released one single in 1975, \"Ain't Misbehavin'\", a cover of the Fats Waller song which featured in a soft porn film. Later, the band went through a series of name changes including The Zips, Fire of London, London Soundtrack, and The Damned, using this last name for a few weeks before discovering that another band had already taken it.[2]\n"
         ]
      },
      "Experimental years: 1976–1979": {
         "Ultravox!": {
            "text": [
               "On the strength of their live act, the band signed to Island Records in 1976. The group had still not finalised their band name, wanting to make a good and lasting choice. In July 1976, while working on the late stages of their debut album, the band conceived the name Ultravox! (the exclamation mark was a reference to krautrock band Neu!, produced by Conny Plank, who later produced three Ultravox albums). At the same time, Leigh chose John Foxx and Allen chose Chris Cross as their respective stage names.[2] In February 1977, Island released their eponymous debut album, Ultravox!.\n",
               "Like many other bands that formed Britain's punk and new wave movements, Ultravox! drew inspiration from the art-school side of glam rock. Musically, Ultravox were heavily influenced by Roxy Music, the New York Dolls, David Bowie and Kraftwerk.[3] Their debut was co-produced by Steve Lillywhite and Brian Eno (who next co-wrote and performed with Bowie on Low). Ultravox!'s sales were disappointing, and neither the album nor the associated single \"Dangerous Rhythm\" managed to enter the UK charts. Relations within the band were on an occasionally tenuous footing during this time as Foxx declared that he intended to live without emotions, a sentiment he wrote into the début album track \"I Want to Be a Machine\".\n",
               "Ultravox returned later in 1977 with the punkier Ha!-Ha!-Ha!. Sales of both the album and its lead single, \"ROckWrok\", were poor, both failing to register on the UK charts. \"ROckWrok\" had a punk-lyric chorus, with the words \"Come on, let's tangle in the dark/Fuck like a dog, bite like a shark\". (Despite this, it got airplay on BBC Radio 1.) Although Ha!-Ha!-Ha! was dominated by guitars and electric violin, the final track, \"Hiroshima Mon Amour\", was a prototypical synthpop song. One of the first tracks by a British band to feature a drum machine (a Roland Rhythm 77 with preset patterns) and a tenor saxophone solo played by \"cc\" of the band Gloria Mundi. Hiroshima Mon Amour signalled a new direction for Ultravox. The energy, anger and popular appeal of punk was fading in 1978,[4] and the more creative UK punk genre talent sought new directions—calling themselves British new wave instead of punk rock artists. \"Hiroshima Mon Amour\" remains a critics' and fans' favourite from the group's initial period. Ultravox! also performed it on The Old Grey Whistle Test later in 1978.\n"
            ]
         },
         "Becoming Ultravox": {
            "text": [
               "In early March 1978, Stevie Shears, whose style of guitar playing was considered a limiting factor, was sacked from the band after they toured England[5] and joined Cowboys International in 1980. He was replaced by Robert Simon (ex-member of Ian North's Neo), who during his first days with the band changed his performance-name to Robin Simon.[6] Some time in 1978, the group also dropped the exclamation mark, becoming simply \"Ultravox\". The new line-up performed live at the Reading Festival along with Radio Stars, Penetration, Sham 69, The Pirates and The Jam, playing early versions of \"Slow Motion\" and \"Quiet Men\" on 27 August 1978.[7]\n",
               "Their third album, 1978's Systems of Romance, was recorded with producer Conny Plank (the producer of German electronic outfit Kraftwerk) and engineer Dave Hutchins at Plank's Studio in rural Germany. Musically, the album was markedly different from Ultravox's earlier work, bringing synthesisers to the forefront of the group's sound. Despite praise from some critics, the album was a commercial failure. Since none of the albums to date had generated much income, tensions within the band—particularly between Currie and Foxx—threatened the band's viability.\n",
               "Island dropped the band on 31 December 1978 after an attempt to market the album in the United States failed to generate sales. That appeared to be the final nail in their coffin, but Ultravox undertook a self-financed US tour in early 1979. Splitting after their final gig near San Francisco in March 1979, Foxx declared his intention to go solo. Simon remained in the US and briefly joined The Futants, an American punk band from New York. He later returned to England and teamed up with Howard Devoto to replace guitarist John McGeoch in the band Magazine. The remaining members made their way back to a Britain in the midst of the Winter of Discontent. Island dropped the three Ultravox albums from its catalogue, and released a compilation of highlights from the group's first three albums in 1980, called Three into One.\n",
               "Foxx subsequently signed to Virgin Records and released his album Metamatic in January 1980. By this time, Billy Currie had been recruited by the rising star Gary Numan in 1979 to do a performance at the Old Grey Whistle Test show with his band Tubeway Army. Numan had been a fan of Ultravox and Currie was also asked to play on Numan's début solo album, The Pleasure Principle, and its subsequent tour. Warren Cann went to work for Zaine Griff, while Chris Cross did some shows with James Honeyman-Scott (of The Pretenders) and Barrie Masters (from Eddie and the Hot Rods).\n"
            ]
         }
      },
      "The Midge Ure years: 1979–1987": {
         "text": [
            "With the band seemingly over, Ultravox were then revitalised by Midge Ure, who joined the band as vocalist, guitarist and keyboardist. He had already achieved minor success with semi-glam outfit Slik and Glen Matlock's The Rich Kids, and in 1979 he was temporarily playing with hard rock band Thin Lizzy on their american tour, replacing Gary Moore. \n",
            "Ure and Billy Currie had met while collaborating on Visage, a studio-based band fronted by New Romantic icon and nightclub impresario Steve Strange. Ure and Currie were part of the Visage ensemble on a part-time basis while simultaneously being in Ultravox. During Ure and Currie's tenure, Visage had released two successful albums and had a string of hit singles (the most notable being \"Fade to Grey\"), but Ure decided to leave in 1982 to concentrate solely on Ultravox. Currie remained with Visage for a while longer, but he too had left them by 1984.\n",
            "Encouraged by Visage drummer and mutual friend Rusty Egan, Currie asked Ure to join Ultravox. The first material for a prospective new Ultravox record came together quickly and the group decided to tour the US again at the end of 1979. They did so in the hope of being picked up by an American label. Ure knew of Ultravox's past, being a fan of Systems to the point where the new four-piece outfit (Ultravox mk. III) played songs from that album with Ure singing Foxx's lyrics. \n",
            "Most of the album that would become ‘Vienna’ was ready to record by the time Ultravox signed a new record deal with Chrysalis Records. Vienna, heralded a major change of direction and would become their most successful to date, far surpassing any of the previous Ultravox (or Foxx's) albums. As with Systems of Romance, it was produced by Conny Plank.\n",
            "Released in June 1980, the Vienna album produced the band's first UK Top 40 hit with \"Sleepwalk\" reaching No. 29, while the album itself initially peaked at No. 14. A second single, \"Passing Strangers\", failed to reach the Top 40, only reaching No. 57, but the band achieved a substantial hit with the third single, the album's title track. Accompanied by a highly distinctive video (inspired by Carol Reed's 1949 film The Third Man), the single became Ultravox's biggest ever hit, released in January 1981 and peaking at Number 2 (kept off the top spot by John Lennon's \"Woman\" and then Joe Dolce's \"Shaddap You Face\"). On the strength of the single, the album then re-entered the chart and reached No. 3 in early 1981. A fourth single from the album, \"All Stood Still\", peaked at No. 8. in 1981, and \"Slow Motion\" from Systems of Romance was also re-issued, reaching No. 33 the same year.\n",
            "This was soon followed by Rage in Eden (1981), with the band returning to Plank's studio in Cologne for what turned out to be a difficult recording session. Whereas the Vienna material had been performed live a great deal prior to a three-week recording process, Rage in Eden took over three months. The album featured a long track in three parts on the second side. The album peaked at No. 4 in the UK, while two singles from the album, \"The Thin Wall\" and \"The Voice\", both made the UK Top 20, reaching No. 14 and No. 16 respectively. \n",
            "Ultravox teamed up with producer George Martin for 1982's Quartet, which peaked at No. 6 in the UK and contained four Top 20 hit singles; \"Reap the Wild Wind\" reaching No. 12 and \"Hymn\" No. 11 both in 1982, and \"Visions in Blue\" and in 1983 \"We Came to Dance\" charting at No. 15 and No. 18 respectively. It was their most successful album in the US, peaking at No. 61.\n",
            "The band undertook a major world tour, the Monument Tour, which was recorded and released as a live LP and video in 1983, which also reached the UK top ten.\n",
            "Ultravox then decided to produce their next album themselves. 1984's Lament continued the band's run of top ten albums and produced three top 40 hit singles, including the international hit \"Dancing with Tears in My Eyes\" (UK No. 3), \"Lament\" (No. 22) and \"One Small Day\" peaking at No. 27.\n",
            "In November 1984, a \"greatest hits\" compilation spanning the band's 1980s output was released entitled The Collection. It was preceded by a new single, \"Love's Great Adventure\", which enjoyed massive radio airplay that autumn and eventually peaked at No. 12 in the UK, accompanied by a popular Indiana Jones-style spoof video. The Collection went triple Platinum and reached No. 2 in the UK album chart, the band's highest ever peak.\n",
            "At this time, Ure also co-wrote and helped produce the 1984 Band Aid single \"Do They Know It's Christmas?\". The group also appeared at Live Aid the following year and played four of their hit singles (\"Reap the Wild Wind\", \"Dancing with Tears in My Eyes\", \"One Small Day\" and \"Vienna\"). Later in 1985, Ure scored a No. 1 solo hit with \"If I Was\" and his solo album The Gift reached No. 2 in the UK.\n",
            "During the time Midge was away working with his solo album and tour, Cann, Currie and Cross recorded demos to a forthcoming album. Ure later said that when he came back they were all working in different directions.[8][9]In a band meeting before the new recording began in 1986, Warren Cann was sacked from the band due to musical differences. Ure said 1986: \"After the two year break the differences that might have been very small two years ago, had magnified during that time, we had grown apart. It seemed like we could not work with him.\"[10]\n",
            "Ultravox recorded the U-Vox album with Big Country's Mark Brzezicki on drums in Plank's studio in Germany. The U-Vox album, released in October 1986, was later described by Ure as \"unfocused\". Although it continued their string of top ten albums in the UK, its singles showed declining chart results: \"Same Old Story\" peaking at No. 31, and \"All Fall Down\" at No. 30 in 1986, with \"All in One Day\" reaching only No. 88 in 1987. In 1987 Ultravox decided not to continue after the U-Vox tour and split up.[11][12]\n",
            "Currie said 2017: \"It was just a very Ultravox thing where no one was saying or doing anything and I started doing a solo album as soon as I got off the U-Vox tour in 87. I was still fully signed up to Ultravox. It was my life and I was passionate about it. I felt that the band would stay together but I wanted to be busy during any Ultravox downtime so I signed a deal with IRS, Miles Copeland’s record label.\"[13] Cross retired from the music business and returned to his former career as a psychotherapist. Cann later moved to Los Angeles to work in the movie business. Currie and Robin Simon reunited in 1989 as the short-lived Humania, performing live shows, but never making a release until 2006, the album Sinews of the Soul. \n"
         ]
      },
      "Currie's own Ultravox in the Nineties: 1992–1996": {
         "text": [
            "Without any other original members, Currie reformed Ultravox again in 1992 with vocalist Tony Fenelle to record Revelation, and later Sam Blue replaced Fenelle in a new five-piece Ultravox line-up, lending his voice to another release, Ingenuity released November 1994. This lineup also released the live album Future Picture recorded in Italy 1993. \n",
            "These albums had little commercial success and the band dissolved again in 1996. Currie said 2006 about the attempt to continue Ultravox: “It wasn’t a good idea but, in retrospect, it’s always easy to say that.”[14]\n"
         ]
      },
      "Reunion: 2008–2013": {
         "text": [
            "\nIn September 2008, both Vienna and Rage in Eden were released in digitally remastered two-disc format with the second disc containing previously unreleased material. \n",
            "On 2 October 2008 Midge Ure and Billy Currie met again and played an acoustic \"Vienna\" together, on Geoff Lloyd Show on Absolute Radio in Abbey Road Studios. After this they got an offer from Live Nation, who their former manager Chris O’Donnell was now working for.\n",
            "On 6 November 2008 the official announcement came: Warren Cann, Chris Cross, Billy Currie and Midge Ure reformed Ultravox again, for a 15 dates UK tour in April 2009, entitled \"Return to Eden\".[15] This would be the first time the classic line-up of the band have performed together since Live Aid in 1985. The first show was played at Edinburgh Playhouse 10 April 2009.\n",
            "On Jonathan Ross's show on BBC's Radio 2 on 21 February 2009, Ure discussed the tour, with all four members of the most successful incarnation of the band on board. He mentioned that this reunion was not planned in light of the previously mentioned events, but rather was spontaneous and happened very quickly with the band members talking and communicating online (using email and Skype). The interview did not reveal whether or not new material would be recorded as a result of the reunion tour. Speaking to the Sunday Mail, Ure stated that the reunion was only a one-off, and there would be no new material from the group. He said: \"We're not trying to recapture our youth and won't be writing new songs or recording another album. This is about celebrating our music and our anniversary.\"[16]\n",
            "Quartet and Monument were released in February 2009, also in two-disc editions. The second disc in the Monument package is a DVD containing the concert video that was previously only available on VHS tape. The other Chrysalis-era releases were planned for similar future releases.   \n",
            "Since success from touring the UK they have extended the tour to Germany and Belgium. A live CD and DVD of Ultravox's sell-out Roundhouse show was released on 5 April 2010. The DVD features a documentary filmed on the buildup to and during the reunion tour, parts of it filmed by Midge Ure.[17]\n",
            "Ultravox returned to performing live with their Return to Eden II tour in Europe during 2010. In August they played four shows in Sweden together with Howard Jones and Alphaville. It was on this tour the band members decided that they should record some new material again. \n",
            "On 20 January 2011, via their official website, Ultravox.org.uk, the band announced that a new studio album was nearing completion.[18] The band released a fan store exclusive superdeluxe EP called Moments from Eden, featured four new live tracks in May 2012.[18]\n",
            "Ultravox's 11th studio album, Brill!ant, was released on 28 May 2012.[19] Following this release the band embarked on the 'Brilliant Tour' performing shows across the UK and Europe in late 2012. \n",
            "30 November 2013 Ultravox performed their last show at The O2 Arena in London, as special guests on a four date UK arena tour with Simple Minds.\n",
            "On 4 January 2017 Billy Currie announced on his official website that he had decided that his time as a member of Ultravox had come to an end after 43 years. In December 2017 Midge Ure revealed in an interview with the Daily Express that a further reformation by the band was unlikely.[20]\n"
         ]
      },
      "Legacy": {
         "text": [
            "Gary Numan has stated that the original 1970s-era Ultravox was the most important influence on his music.[21]\n",
            "Along with acts like Visage and Gary Numan, Ultravox was one of the early influences on techno. In his book Energy Flash, Simon Reynolds quotes Adam Lee Miller of Adult: \"I always get a kick when people say the first 'techno' record was Cybotron's 'Alleys of Your Mind'... To me, it was just a new wave record. It sounds particularly close to 'Mr X' by Ultravox.\"[22]\n"
         ]
      }
   },
   "Discography": {
      "Studio albums": {}
   },
   "Band members": {
      "Lineups": {
         "text": [
            "Disbanded\n",
            "Disbanded\n"
         ]
      },
      "Timeline": {},
      "text": [
         "\n",
         "\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Ultravox (earlier stylized as Ultravox!) were a British new wave band, formed in London in April 1974 as Tiger Lily. Between 1980 and 1986, they scored seven Top Ten albums and seventeen Top 40 singles in the UK, the most successful of which was their 1981 hit \"Vienna\".\n",
      "From 1974 until 1979, singer John Foxx was frontman and the main driving force behind Ultravox. Foxx left the band in March 1979 to embark on a solo career and, following his departure, Midge Ure took over as lead singer, guitarist and frontman in October 1979 after he and keyboardist Billy Currie worked in the studio project Visage. Ure revitalised the band and steered it to commercial chart success lasting until 1987, at which time the group disbanded.\n",
      "A new line-up, led by Currie, was formed in 1992, but achieved limited success, with two albums failing to chart and one solitary single reaching 90 in the UK Singles Chart.\n",
      "The band's best-known line-up of Currie, Ure, bassist Chris Cross and drummer Warren Cann reformed in 2008 and performed a series of reunion shows in 2009 and 2010 before releasing a new studio album, Brill!ant, in May 2012 which reached 21 in the British Album Charts. In November 2013, Ultravox performed as special guests on a four date UK arena tour with Simple Minds. These shows proved to be Ultravox's last, as in 2017 both Currie and Ure indicated that Ultravox had run its course.\n"
   ],
   "infobox": {
      "Also known as": [
         "Tiger Lily (1974–1975)",
         "various other names (1975–1976)",
         "Ultravox! (1976–1978)"
      ],
      "Origin": [
         "London, United Kingdom"
      ],
      "Genres": [
         "Synth-pop",
         "new wave",
         "post-punk (early)"
      ],
      "Years active": [
         "1974–1987",
         "1992–1996",
         "2008–2013"
      ],
      "Labels": [
         "Island",
         "Chrysalis",
         "EMI",
         "PolyGram"
      ],
      "Associated acts": [
         "Visage"
      ],
      "Website": [
         "www.ultravox.org.uk"
      ],
      "Past members": [
         "Chris Cross",
         "John Foxx",
         "Stevie Shears",
         "Warren Cann",
         "Billy Currie",
         "Robin Simon",
         "Midge Ure",
         "Tony Fenelle",
         "Sam Blue",
         "Vinny Burns",
         "Tony Holmes",
         "Gary Williams"
      ]
   }
}