{
   "Name": "Voigt/465",
   "rawData": [
      "\nVoigt/465 were an Australian post-punk band based in Sydney, Australia.  They were a feature of the Sydney inner-city music-scene during the late 1970s and their music was critically acclaimed. Their sound was influenced by Krautrock and has been described by a band-member as an \"unsettling mixture of song-driven rock elements and free-noise experimentation\". Voigt/465 recorded an album, Slights Unspoken, before they disbanded in late 1979. With their self-funded recordings and determinedly uncompromising music Voigt/465 epitomised the do-it-yourself ethic of the alternative music scene of the late 1970s.\n",
      "Voigt/465 was formed in 1976 from a group of school-friends.  The band was composed of Rod Pobestek (guitar), Lindsay O’Meara (bass), Phil Turnbull (synthesiser, organ and vocals), Rae Macron Cru (vocals) and Bruce Stalder (drums). They rehearsed and played sporadically during 1977.  In 1978 Voigt/465 recorded four songs at Axent Studios at Kogarah, in Sydney's southern suburbs.\n",
      "During 1978 the band performed more regularly and began to attract a following.  In mid-1978 the drummer left the group and was replaced by Mark Boswell.  Later that year Voigt/645 released a self-funded single made up of two of the songs they had recorded earlier that year – \"State\" and \"A Secret West\". The band had a mid-week residency at the Sussex Hotel and regularly performed at other inner-city venues in Sydney.  Voigt/465 also travelled to Melbourne to perform a series of gigs.\n"
   ],
   "infobox": {},
   "albums": [],
   "prunedData": [
      "\n[BAND_NAME] were an [GENRE] band based in Sydney, Australia.  They were a feature of the Sydney inner-city music-scene during the late [YEAR]s and their music was critically acclaimed. Their sound was influenced by Krautrock and has been described by a band-member as an [SONG_NAME]. [BAND_NAME] recorded an album, Slights Unspoken, before they disbanded in late [YEAR]. With their self-funded recordings and determinedly uncompromising music [BAND_NAME] epitomised the do-it-yourself ethic of the alternative music scene of the late [YEAR]s.\n",
      "[BAND_NAME] was formed in [YEAR] from a [GENRE] band was composed of Rod Pobestek (guitar), Lindsay O’Meara (bass), [PERSON_NAME_FULL_1_MALE] (synthesiser, organ and vocals), Rae Macron Cru (vocals) and [PERSON_NAME_FULL_0_MALE] (drums). They rehearsed and played sporadically during [YEAR].  In [YEAR] [BAND_NAME] recorded four songs at Axent Studios at Kogarah, in Sydney's southern suburbs.\n",
      "During [YEAR] the band performed more regularly and began to attract a following.  In mid-[YEAR] the drummer left the group and was replaced by [MONTH]k Boswell.  Later that year Voigt/645 released a self-funded single made up of two of the songs they had recorded earlier that year – [SONG_NAME]. The band had a mid-week residency at the Sussex Hotel and regularly performed at other inner-city venues in Sydney.  [BAND_NAME] also travelled to Melbourne to perform a series of gigs.\n"
   ]
}