{
   "Name": "Volcano Suns",
   "rawData": [
      "Volcano Suns was an American alternative rock band from Boston, Massachusetts formed by Mission of Burma drummer Peter Prescott in 1984.\n",
      "The band was founded in Spring 1984 by former Mission of Burma and Molls drummer Peter Prescott, the only founding member of the Suns to remain until their break-up in 1991. Prescott had auditioned for the position of drummer with Disneyland, but took two of that band's members to form Volcano Suns; The other original members were Gary Waleik and Steve Michener who would leave after a few months, before the release of the first Suns album, to form Big Dipper. Prescott then added Jeff Weigand on bass guitar and Jon Williams on guitar. This second line-up created the band's debut album The Bright Orange Years (1985),  as well as its follow-up, All-Night Lotus Party (1986), both released on the now-defunct Homestead Records. In 1987, Bob Weston and Chuck Hahn replaced Weigand and Williams respectively for Bumper Crop, the band's final release on Homestead. Other contributors included Roger Miller on piano and Gary Waleik on sitar.\n",
      "In 1988, the band moved to Greg Ginn's SST Records for their 4th release, Farced. The line-up however was the same as on Bumper Crop, including Miller on piano and Waleik on sitar. 1989 brought their most experimental release, Thing of Beauty, also on SST, on which David Kleiler (formerly from the band Sorry) replaced Chuck Hahn on guitar. This would be the Volcano Suns' final line up. The band moved to Chicago-based indie label Quarterstick Records for their final release, Career in Rock in 1991. The album was engineered by Steve Albini, who would later work with Bob Weston in their band Shellac.\n"
   ],
   "infobox": {
      "Origin": [
         "Boston, Massachusetts, United States"
      ],
      "Genres": [
         "Alternative rock"
      ],
      "Years active": [
         "1984–1991, 2005"
      ],
      "Labels": [
         "SST Records, Homestead",
         "Quarterstick"
      ],
      "Associated acts": [
         "Mission of Burma, Big Dipper, Shellac, Dredd Foole and the Din, Kustomized"
      ],
      "Website": [
         "Official website"
      ],
      "Past members": [
         "Peter Prescott",
         "Bob Weston",
         "David Kleiler",
         "Gary Waleik",
         "Steve Michener",
         "Jeff Weigand",
         "Jon Williams",
         "Chuck Hahn"
      ]
   }
}