{
   "Band members": {
      "Final lineup": {},
      "Former members": {}
   },
   "Discography": {
      "Bootlegs": {},
      "Compilations": {},
      "EPs": {},
      "Singles": {},
      "Studio Albums": {}
   },
   "External links": {},
   "History": {
      "1977–1983": {
         "text": [
            "Wall of Voodoo released a self-titled EP in 1980 which featured a synthesizer-driven cover of \"Ring of Fire.\" The second half of \"Ring of Fire\" features a dissonant guitar solo covering the theme to the 1966 film Our Man Flint. The band's first full-length album, Dark Continent, followed in 1981.[1] Much of the material from this record would feature in live shows over the next few years, such as \"Red Light\", \"Animal Day\" and fan favorite \"Back In Flesh\". Bruce Moreland left the band for the first time soon after this, and Chas Gray performed both bass and synthesizers during this time. The band recorded their biggest-selling album, Call of the West, in 1982. A single, \"Mexican Radio,\" about border blaster radio stations, became an international hit, peaking at #18 in Canada, #21 in New Zealand and #33 in Australia.[5] It also reached #64 in the UK,[6] and was their only Top 100 hit in the United States.  As well, the video received considerable exposure on the newly formed MTV.\n",
            "Bill Noland was added as a keyboardist soon after the release of Call of the West.[3] That same year, Wall of Voodoo opened for the Residents on the cult band's inaugural tour, \"the Mole Show,\" at Perkins Palace in Pasadena, Halloween 1982, and for Devo's ill-fated televised 3-DEVO Concert in October.\n",
            "Wall of Voodoo opened for Oingo Boingo on their Nothing to Fear tour at the Arlington Theater in Santa Barbara in March 1983. Stan Ridgway claims that the situation around the band was increasingly chaotic during this era, with a great deal of drug use and out-of-control behavior on the part of the band members, as well as shady behavior by the band's management and record label. Wall of Voodoo appeared at the second US Festival on May 28, 1983 (the largest concert the band had performed), immediately after which Ridgway, Nanini, and Noland all left the band.[2] Stan Ridgway soon went on to a successful solo career. He appeared as a guest vocalist on a track on the Rumble Fish score and released his critically acclaimed debut solo album The Big Heat, which included the single \"Camouflage\", a top ten hit across Europe, in 1986. Joe Nanini soon resurfaced in the country rock band Lonesome Strangers.\n"
         ]
      },
      "1983–1988": {
         "text": [
            "The remainder of the band, Marc Moreland, Chas T. Gray and a returning Bruce Moreland, carried on under the name Wall of Voodoo. Soon after, Andy Prieboy, formerly of the San Francisco new wave band Eye Protection, joined as singer and Ned Leukhardt was added as drummer.[1] They issued a UK-only single \"Big City\" in 1984, and contributed a track to the film Weird Science in 1985.  Later that year, they released Seven Days in Sammystown. The first single, \"Far Side of Crazy\", did well in Australia, reaching number 23 on the ARIA charts. The song is still heard today on the Austereo Triple M network.\n",
            "In 1987, the band released their fourth studio album, Happy Planet. The album, their second with Andy Prieboy as frontman, saw Call of the West's Richard Mazda returning as producer. Happy Planet spawned another hit in Australia: a cover of the Beach Boys' \"Do It Again,\" which charted at #40 there. The video for the song featured the Beach Boys' own Brian Wilson. Bruce Moreland left the band prior to the subsequent tour.  In 1988, Wall of Voodoo split up and Andy Prieboy and Marc Moreland went on to solo careers.\n"
         ]
      },
      "After 1988": {
         "text": [
            "In 1989, a post-breakup live album entitled The Ugly Americans in Australia was issued, which documented their 1987 tour of Melbourne, Australia. (Additional performances from a date in Bullhead City, Arizona, were also included.) Stan Ridgway, Andy Prieboy and Marc Moreland all embarked on solo careers throughout the 1990s and 2000s. Joe Nanini released an EP under the name Sienna Nanini in 1996.\n",
            "Two former members died in the early 2000s; Joe Nanini died of a brain hemorrhage on December 4, 2000, and Marc Moreland died of kidney and liver failure on March 13, 2002.[7]\n",
            "On July 18, 2006 a Stan Ridgway-fronted Wall of Voodoo performed at the Pacific Amphitheatre in Orange County as an opening band for Cyndi Lauper.[8] However, other than Ridgway, none of the surviving Wall of Voodoo members were included in this lineup; Joe Berardi and Voodoo producer Richard Mazda were in this lineup.  Ridgway's album Snakebite: Blacktop Ballads and Fugitive Songs (2005), features the narrative song, \"Talkin' Wall of Voodoo Blues Pt. 1,\" a history of the band in song.\n",
            "A remastered coupling of Dark Continent and Call of the West was released by Raven Records on November 10, 2009.[9][10] On October 2, 2012, Raven issued a companion two-disc set containing all three albums from the Andy Prieboy era (Seven Days in Sammystown, Happy Planet and Ugly Americans in Australia), all remastered, including three bonus tracks.[11]\n"
         ]
      },
      "Formation": {
         "text": [
            "Wall of Voodoo had its roots in Acme Soundtracks, a film score business started by Stan Ridgway, later the vocalist and harmonica player for Wall of Voodoo. Acme Soundtracks' office was across the street from the Hollywood punk club The Masque and Ridgway was soon drawn into the emerging punk/new wave scene. Marc Moreland, guitarist for the Skulls, began jamming with Ridgway at the Acme Soundtracks office and the soundtrack company morphed into a new wave band.[2] In 1977, with the addition of Skulls members Bruce Moreland (Marc Moreland's brother) as bassist and Chas T. Gray as keyboardist, along with Joe Nanini, who had been the drummer for the Bags, the Eyes, and Black Randy and the Metrosquad, the first lineup of Wall of Voodoo was born.[3]\n",
            "The band was named Wall of Voodoo before their first gig in reference to a comment made by Joe Berardi, a friend of Ridgway's and member of the Fibonaccis.[4] Berardi was listening to some of the Acme Soundtracks music Ridgway and Moreland had created in their studio. When Ridgway jokingly compared the multiple-drum-machine- and Farfisa-organ-laden recordings to Phil Spector's Wall of Sound, Berardi commented it sounded more like a \"wall of voodoo\" and the name stuck.[citation needed]\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation",
      "1.2 1977–1983",
      "1.3 1983–1988",
      "1.4 After 1988",
      "2 Band members",
      "2.1 Final lineup",
      "2.2 Former members",
      "3 Discography",
      "3.1 Studio Albums",
      "3.2 Compilations",
      "3.3 Singles",
      "3.4 EPs",
      "3.5 Bootlegs",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Wall of Voodoo was an American rock band from Los Angeles, California, United States,[1] best known for its 1983 hit \"Mexican Radio\". The band had a sound that was a fusion of synthesizer-based new wave music with the spaghetti Western soundtrack style of Ennio Morricone.\n"
      ]
   },
   "Title": "Wall of Voodoo - Wikipedia"
}