{
   "Name": "Whirlywirld",
   "Sections": [
      "1 Biography",
      "2 Members",
      "3 Discography",
      "3.1 Albums/EPs",
      "3.2 Singles",
      "4 References"
   ],
   "Summary": {
      "text": [
         "Whirlywirld was an Australian post-punk band led by Ollie Olsen in the late 1970s and early 1980s, and the first of his musical collaborations with drummer John Murphy. They played in Melbourne and Sydney and were supporters of the Melbourne little band scene.\n"
      ]
   },
   "Biography": {
      "text": [
         "In 1976, as a guitarist, Ollie Olsen formed The Reals, who on occasion shared the bill at suburban dance halls with The Boys Next Door.[1]  The Reals would eventually evolve into The Negatives, but before that Olsen had become dissatisfied with the group, and left. Olsen went on to form The Young Charlatans. The Young Charlatans' four members would all go on to distinguish themselves in long music careers: they included Olsen, guitarist Rowland Howard (later of The Boys Next Door/The Birthday Party, as well as These Immortal Souls), drummer Jeffrey Wegener (Laughing Clowns) and bassist Janine Hall (later of The Saints).[1] The group was short lived and after a brief, stormy existence, the band broke up. By then Olsen had met John Murphy, the drummer for another early Melbourne punk band, NEWS.\n",
         "The pair formed Whirlywirld in 1978[1] with their stated priority, from the outset, to use synthesisers and other non-'rock' instruments, departing from a guitar-based format. Whirlywirld was completed by two keyboardists, credited with 'electronics', Andrew Duffield and Simon Smith (Olsen, by this point, had abandoned guitar in favour of 'electronics') together with guitarist Dean Richards. Whirlywirld only played live very infrequently but they did rehearse on a rigid schedule.\n",
         "In June 1979, the band released a self-titled debut EP.  Whirlywirld made their live debut at The Crystal Ballroom later that year, by which time Duffield left to join The Models and had been replaced by Philip Jackson.\n",
         "Whirlywirld would go on to play only fourteen performances in their entire career. Gradually, the personnel within the band changed, in accordance with a change in direction, Richards, Jackson and Smith departed. Richards went on to two popular local 'underground' bands in Melbourne, Equal Local and Hot Half Hour, and more recently records and performs as Disturbed Earth. Arnie Hanna came in on guitar and Greg Sun on bass. During this period Murphy played an array of percussion devices, natural, electronic or otherwise and Olsen even played saxophone, clarinet, tape loops as well as keyboards. This incarnation of the band recorded at York St. Studios in December, 1979. Four of these tracks came out on a 12\" EP, again titled Whirlywirld in February 1980.\n",
         "After the band split, Olsen and Murphy went on to form firstly The Beast Apparel, and then Hugo Klang,[1] which performed a handful of gigs in England, and recorded a single, \"Beat Up The Old Shack\", released in Australia on Prince Melon Records.  Olsen and Murphy then went on to form Orchestra of Skin and Bone, before their musical partnership ended with Olsen going to form NO in the late 1980s.\n",
         "Hanna and Murphy later played with Olsen and Michael Hutchence in the band Max Q. \n",
         "A version of one of Whirlywirld's songs, \"Win/Lose\", was re-recorded by Olsen in 1986 for inclusion in the film Dogs in Space. Hutchence sang the early Whirlywirld song, \"Rooms for the Memory\" on the soundtrack, and the song became a hit on the mainstream Australian charts in 1987. The remixed version of \"Win/Lose\" was also released as a single by Olsen.\n"
      ]
   },
   "Members": {},
   "Discography": {
      "Albums/EPs": {},
      "Singles": {}
   },
   "References": {},
   "coreData": [
      "Whirlywirld was an Australian post-punk band led by Ollie Olsen in the late 1970s and early 1980s, and the first of his musical collaborations with drummer John Murphy. They played in Melbourne and Sydney and were supporters of the Melbourne little band scene.\n",
      "In 1976, as a guitarist, Ollie Olsen formed The Reals, who on occasion shared the bill at suburban dance halls with The Boys Next Door.[1]  The Reals would eventually evolve into The Negatives, but before that Olsen had become dissatisfied with the group, and left. Olsen went on to form The Young Charlatans. The Young Charlatans' four members would all go on to distinguish themselves in long music careers: they included Olsen, guitarist Rowland Howard (later of The Boys Next Door/The Birthday Party, as well as These Immortal Souls), drummer Jeffrey Wegener (Laughing Clowns) and bassist Janine Hall (later of The Saints).[1] The group was short lived and after a brief, stormy existence, the band broke up. By then Olsen had met John Murphy, the drummer for another early Melbourne punk band, NEWS.\n",
      "The pair formed Whirlywirld in 1978[1] with their stated priority, from the outset, to use synthesisers and other non-'rock' instruments, departing from a guitar-based format. Whirlywirld was completed by two keyboardists, credited with 'electronics', Andrew Duffield and Simon Smith (Olsen, by this point, had abandoned guitar in favour of 'electronics') together with guitarist Dean Richards. Whirlywirld only played live very infrequently but they did rehearse on a rigid schedule.\n",
      "In June 1979, the band released a self-titled debut EP.  Whirlywirld made their live debut at The Crystal Ballroom later that year, by which time Duffield left to join The Models and had been replaced by Philip Jackson.\n"
   ],
   "infobox": {
      "Origin": [
         "Melbourne, Victoria, Australia"
      ],
      "Genres": [
         "Post-punk, Electronic"
      ],
      "Years active": [
         "1978–1980"
      ],
      "Labels": [
         "Missing Link"
      ],
      "Associated acts": [
         "Equal Local, Hugo Klang, Orchestra of Skin and Bone, NO, Max Q, The Models"
      ],
      "Past members": [
         "see Members section below"
      ]
   }
}