{
   "Name": "Ellegarden",
   "rawData": [
      "Ellegarden (stylized as ELLEGARDEN) is a Japanese rock band formed in December 1998 in Chiba, Japan. Ellegarden consists of drummer Hirotaka Takahashi, vocalist/guitarist Takeshi Hosomi, guitarist Shinichi Ubukata, and bassist Yuichi Takada. In 2008, Ellegarden announced an indefinite hiatus, which lasted almost 10 years. In May 2018, Ellegarden announced a reunion with their first national tour since the hiatus.\n",
      "The English lyrics of the band's songs, which are mostly written by Hosomi, are usually grammatically sound and well pronounced. In the Summer 2006 issue of the American Japanese rock magazine Purple Sky, Hosomi accredited this to the time he spent working as a computer engineer in Oakland, California and later in Japan, where he had English-speaking co-workers.\n",
      "Ellegarden generated a tight, punchy but muscular sound reminiscent of North American bands such as Blink-182, Sum 41 and Good Charlotte, while also displaying the influence of Hosomi's favorites, Weezer. In the fall of 2001, Ellegarden signed with the Japanese Dynamord label, and released their first EP, Bare Foot, with a full-length album, Don't Trust Anyone But Us, following in the spring of 2002. The album was a hit, and Ellegarden followed with a new LP every year. In 2004, they took part in the Synchronized Rockers tribute album to The Pillows. 2006's Eleven Fire Crackers became the band's first North American release when it was issued by Nettwerk in the summer of 2007. Accustomed to playing major shows in Japan, where they've shared stages with the Foo Fighters and Sum 41, Ellegarden made their American live debut in 2006 with a seven-city tour as part of Japan Nite, which included a stop at the South by Southwest Music Conference.\n"
   ],
   "infobox": {
      "Origin": [
         "Chiba, Japan"
      ],
      "Genres": [
         "Pop punk[1][2]",
         "punk rock",
         "alternative rock[1]"
      ],
      "Years active": [
         "1998–2008, 2018-present"
      ],
      "Labels": [
         "Dynamord/Growing Up Inc.",
         "Denka Secca",
         "Nettwerk (NA)"
      ],
      "Associated acts": [
         "The Hiatus ",
         " Nothing's Carved in Stone ",
         " MONOEYES"
      ],
      "Website": [
         "http://www.ellegarden.jp"
      ],
      "Members": [
         "Takeshi Hosomi",
         "Shinichi Ubukata",
         "Yuichi Takada",
         "Hirotaka Takahashi"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (stylized as ELLEGARDEN) is a [GENRE] band formed in [MONTH] [YEAR] in Chiba, Japan. [BAND_NAME] consists of drummer [PERSON_NAME_FULL_2_MALE], vocalist/guitarist [PERSON_NAME_FULL_1_MALE], guitarist [PERSON_NAME_FULL_3_MALE], and bassist [PERSON_NAME_FULL_0_MALE]. In [YEAR], [BAND_NAME] announced an indefinite hiatus, which lasted almost 10 years. In [MONTH] [YEAR], [BAND_NAME] announced a reunion with their first national tour since the hiatus.\n",
      "The English lyrics of the band's songs, which are mostly written by Hosomi, are usually grammatically sound and well pronounced. In the Summer [YEAR] issue of the American Japanese rock magazine Purple Sky, Hosomi accredited this to the time he spent working as a [GENRE]",
      "[BAND_NAME] generated a [GENRE] bands such as Blink-182, Sum 41 and Good Charlotte, while also displaying the influence of Hosomi's favorites, Weezer. In the fall of [YEAR], [BAND_NAME] signed with the Japanese Dynamord label, and released their first EP, Bare Foot, with a full-length album, Don't Trust Anyone But Us, following in the spring of [YEAR]. The album was a hit, and [BAND_NAME] followed with a new LP every year. In [YEAR], they took part in the Synchronized Rockers tribute album to The Pillows. [YEAR]'s Eleven Fire Crackers became the band's first North American release when it was issued by Nettwerk in the summer of [YEAR]. Accustomed to playing major shows in Japan, where they've shared stages with the Foo Fighters and Sum 41, [BAND_NAME] made their American live debut in [YEAR] with a seven-city tour as part of Japan Nite, which included a stop at the South by Southwest Music Conference.\n"
   ]
}