{
   "Name": "Ellegarden",
   "Sections": [
      "1 Background",
      "2 History",
      "3 Band members",
      "4 Equipment",
      "5 Discography",
      "6 Tours",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Ellegarden (stylized as ELLEGARDEN) is a Japanese rock band formed in December 1998 in Chiba, Japan.[2] Ellegarden consists of drummer Hirotaka Takahashi, vocalist/guitarist Takeshi Hosomi, guitarist Shinichi Ubukata, and bassist Yuichi Takada. In 2008, Ellegarden announced an indefinite hiatus, which lasted almost 10 years. In May 2018, Ellegarden announced a reunion with their first national tour since the hiatus.[3]\n"
      ]
   },
   "Background": {
      "text": [
         "The English lyrics of the band's songs, which are mostly written by Hosomi, are usually grammatically sound and well pronounced. In the Summer 2006 issue of the American Japanese rock magazine Purple Sky, Hosomi accredited this to the time he spent working as a computer engineer in Oakland, California and later in Japan, where he had English-speaking co-workers.[1]\n"
      ]
   },
   "History": {
      "text": [
         "Ellegarden generated a tight, punchy but muscular sound reminiscent of North American bands such as Blink-182, Sum 41 and Good Charlotte, while also displaying the influence of Hosomi's favorites, Weezer.[1] In the fall[when?] of 2001, Ellegarden signed with the Japanese Dynamord label, and released their first EP, Bare Foot, with a full-length album, Don't Trust Anyone But Us, following in the spring of 2002. The album was a hit, and Ellegarden followed with a new LP every year. In 2004, they took part in the Synchronized Rockers tribute album to The Pillows. 2006's Eleven Fire Crackers became the band's first North American release when it was issued by Nettwerk in the summer[when?] of 2007. Accustomed to playing major shows in Japan, where they've shared stages with the Foo Fighters and Sum 41,[1][2] Ellegarden made their American live debut in 2006 with a seven-city tour as part of Japan Nite, which included a stop at the South by Southwest Music Conference.\n",
         "In 2006, Ellegarden performed in numerous Japanese Summer Music Festivals, such as Fuji Rock, Summer Sonic, Nano Mugen Festival and Rising Sun Rock Festival.[2] Their final tour of the year featured the American band Allister, who they became acquainted with during SXSW 2006. In addition, they supported Foo Fighters in their concert at Osaka Castle Hall.\n",
         "On May 2, 2008, it was announced that the band would be going on hiatus when the following message was posted on the band's official website:[4]\n",
         "\"Ellegarden has been in the process of creating a new album since last year, however, during the band’s activities, there arose a difference in opinion regarding the motivation for creating a new album. We no longer feel we are able to create an album that we would be satisfied with, and after much discussion we arrived at the conclusion to end the creation of the album and suspend the band’s activities indefinitely. All previously decided shows (including shows not yet announced) up until early September 2008 will still be performed.We want to thank everyone who has supported Ellegarden from the bottom of our hearts. In order to once again create new music as Ellegarden, each of us wants to work on our own personal growth and development. Thank you for everything.\" – Ellegarden leader, Shinichi Ubukata",
         "Following the recording hiatus announcement, the band has continued to perform live and announced a greatest hits album entitled Ellegarden Best (1999-2008).[4] The album consists of 21 songs and was released on July 2, 2008.  After appearances at several high-profile festivals (including Rock in Japan Fest, Sky Jamboree, Nano Mugen Fes, and Treasure 05x: The Greatest Riot Returns), the band performed four one-man shows in early September to give its fans a send-off before the hiatus; two performances at Zepp Osaka followed by two performances at Shinkiba Studio Coast in Tokyo.\n",
         "In 2018, Ellegarden announced their first tour in 10 years, ending their hiatus. The tour, titled \"THE BOYS ARE BACK IN TOWN\", kicked off in August 2018 at Shinkiba Studio Coast, the same venue as their send-off concert. In 2020, the group had announced scheduled performances at several music festivals in Japan, but most of them had been cancelled or postponed due to effects of the Covid-19 pandemic.\n"
      ]
   },
   "Band members": {},
   "Equipment": {},
   "Discography": {},
   "Tours": {
      "text": [
         "Dates shown are announcement dates\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Ellegarden (stylized as ELLEGARDEN) is a Japanese rock band formed in December 1998 in Chiba, Japan.[2] Ellegarden consists of drummer Hirotaka Takahashi, vocalist/guitarist Takeshi Hosomi, guitarist Shinichi Ubukata, and bassist Yuichi Takada. In 2008, Ellegarden announced an indefinite hiatus, which lasted almost 10 years. In May 2018, Ellegarden announced a reunion with their first national tour since the hiatus.[3]\n",
      "The English lyrics of the band's songs, which are mostly written by Hosomi, are usually grammatically sound and well pronounced. In the Summer 2006 issue of the American Japanese rock magazine Purple Sky, Hosomi accredited this to the time he spent working as a computer engineer in Oakland, California and later in Japan, where he had English-speaking co-workers.[1]\n",
      "Ellegarden generated a tight, punchy but muscular sound reminiscent of North American bands such as Blink-182, Sum 41 and Good Charlotte, while also displaying the influence of Hosomi's favorites, Weezer.[1] In the fall[when?] of 2001, Ellegarden signed with the Japanese Dynamord label, and released their first EP, Bare Foot, with a full-length album, Don't Trust Anyone But Us, following in the spring of 2002. The album was a hit, and Ellegarden followed with a new LP every year. In 2004, they took part in the Synchronized Rockers tribute album to The Pillows. 2006's Eleven Fire Crackers became the band's first North American release when it was issued by Nettwerk in the summer[when?] of 2007. Accustomed to playing major shows in Japan, where they've shared stages with the Foo Fighters and Sum 41,[1][2] Ellegarden made their American live debut in 2006 with a seven-city tour as part of Japan Nite, which included a stop at the South by Southwest Music Conference.\n",
      "In 2006, Ellegarden performed in numerous Japanese Summer Music Festivals, such as Fuji Rock, Summer Sonic, Nano Mugen Festival and Rising Sun Rock Festival.[2] Their final tour of the year featured the American band Allister, who they became acquainted with during SXSW 2006. In addition, they supported Foo Fighters in their concert at Osaka Castle Hall.\n"
   ],
   "infobox": {
      "Origin": [
         "Chiba, Japan"
      ],
      "Genres": [
         "Pop punk[1][2]",
         "punk rock",
         "alternative rock[1]"
      ],
      "Years active": [
         "1998–2008, 2018-present"
      ],
      "Labels": [
         "Dynamord/Growing Up Inc.",
         "Denka Secca",
         "Nettwerk (NA)"
      ],
      "Associated acts": [
         "The Hiatus ",
         " Nothing's Carved in Stone ",
         " MONOEYES"
      ],
      "Website": [
         "http://www.ellegarden.jp"
      ],
      "Members": [
         "Takeshi Hosomi",
         "Shinichi Ubukata",
         "Yuichi Takada",
         "Hirotaka Takahashi"
      ]
   }
}