{
   "Name": "Nothing's Carved in Stone",
   "rawData": [
      "Nothing's Carved in Stone is a Japanese rock band formed in January 2009. After Ellegarden decided to go into hiatus in 2008, the group's guitarist Shinichi Ubukata created Nothing's Carved in Stone as his solo project. Their debut album Parallel Lives was released on May 6, 2009, debuting at No. 11 on the Japanese Oricon weekly album charts.\n",
      "In 2008, the popular pop punk group Ellegarden announced that they would enter an indefinite hiatus. Guitarist Shinichi Ubukata used the break as an opportunity to start a new band called Nothing's Carved In Stone. He quickly recruited Hidekazu Hinata of Straightener to be his new bassist and Takanori \"Oniy\" Ohkita from FULLARMOR to join on drums, and they began holding sessions together. However, the band struggled to find a vocalist for nearly half a year. They eventually settled on Taku Muramatsu, the singer of an indie rock band called ABSTRACT MASH, who Ubukata discovered through his band's Myspace. After showing his bandmates a few videos, Ubukata and Ohkita attended one of ABSTRACT MASH's lives and, charmed by Muramatsu's performance, convinced him to join the band.\n",
      "Nothing's Carved In Stone moved quickly after their line-up was complete, playing their first live on February 27 at Daikanyama UNIT. Their debut album, Parallel Lives, was released on May 6, 2009 and was followed by two nationwide tours. The album went on to reach the eleventh spot on the Oricon charts. Nothing's Carved In Stone also firmly announced their presence on the Japanese rock scene that year with performances at high-profile events like the SWEET LOVE SHOWER, SUMMER SONIC and the ROCK IN JAPAN FESTIVAL.\n"
   ],
   "infobox": {
      "Also known as": [
         "NCIS"
      ],
      "Origin": [
         "Japan"
      ],
      "Genres": [
         "Punk rock",
         "alternative rock[1]"
      ],
      "Years active": [
         "2009–present"
      ],
      "Labels": [
         "Dynamord Label (2009–2012)",
         " Epic Records Japan (2012–2015) ",
         " Dynamord Label (2015–2018) ",
         " Silver Sun Records (2018–present)"
      ],
      "Associated acts": [
         "Ellegarden"
      ],
      "Website": [
         "NCIS.jp"
      ],
      "Members": [
         "Shinichi Ubukata",
         "Takanori Ohkita",
         "Hidekazu Hinata",
         "Taku Muramatsu"
      ]
   }
}