{
   "Name": "Nothing's Carved in Stone",
   "Sections": [
      "1 History",
      "2 Band members",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Live albums",
      "3.3 Singles",
      "3.4 DVDs",
      "4 See also",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Nothing's Carved in Stone is a Japanese rock band formed in January 2009. After Ellegarden decided to go into hiatus in 2008, the group's guitarist Shinichi Ubukata created Nothing's Carved in Stone as his solo project.[1] Their debut album Parallel Lives was released on May 6, 2009, debuting at No. 11 on the Japanese Oricon weekly album charts.[2]\n"
      ]
   },
   "History": {
      "text": [
         "In 2008, the popular pop punk group Ellegarden announced that they would enter an indefinite hiatus. Guitarist Shinichi Ubukata used the break as an opportunity to start a new band called Nothing's Carved In Stone. He quickly recruited Hidekazu Hinata of Straightener to be his new bassist and Takanori \"Oniy\" Ohkita from FULLARMOR to join on drums, and they began holding sessions together.[3] However, the band struggled to find a vocalist for nearly half a year. They eventually settled on Taku Muramatsu, the singer of an indie rock band called ABSTRACT MASH, who Ubukata discovered through his band's Myspace. After showing his bandmates a few videos, Ubukata and Ohkita attended one of ABSTRACT MASH's lives and, charmed by Muramatsu's performance, convinced him to join the band.[3]\n",
         "Nothing's Carved In Stone moved quickly after their line-up was complete, playing their first live on February 27 at Daikanyama UNIT. Their debut album, Parallel Lives, was released on May 6, 2009 and was followed by two nationwide tours.[3] The album went on to reach the eleventh spot on the Oricon charts. Nothing's Carved In Stone also firmly announced their presence on the Japanese rock scene that year with performances at high-profile events like the SWEET LOVE SHOWER, SUMMER SONIC and the ROCK IN JAPAN FESTIVAL.[1]\n",
         "Not even waiting for their debut year to end, the band released their first single, \"Around The Clock\", in December 2009. Their first concert DVD, Initial Lives arrived on the same day, documenting the band's powerful live performances and strong camaraderie between its members.\n",
         "2010 brought the album Sands of Time, a similarly-named tour and several festival appearances. The tour was likewise documented with a DVD entitled Time of Justice, which was released in December like its predecessor.\n",
         "Continuing this trend of intense productivity, the band's third album, Echo, was released on June 8, 2011 and followed by a twenty-one date one-man tour. They also performed at more festivals, including the RISING SUN ROCK FESTIVAL and ARABAKI ROCK FEST, and opened shows for artists such as Miyavi and J.[1] Also, after the 2011 Tōhoku earthquake and tsunami, Ubukata joined up with several other musicians from the Japanese alternative rock scene, under the leadership of AA= frontman Takeshi Ueda, to form the temporary unit AA= AiD. Together, they recorded the charity song \"We're not alone\", which was made available for free download for a year to help encourage fans to act to support the reconstruction efforts.\n",
         "2012 was a breakthrough year for Nothing's Carved In Stone. July saw the band release their second single Pride, which was used as the theme to the anime series Kingdom. They also inked a deal with the major label Epic Records Japan, and their major debut Silver Sun was released on August 15, 2012. Their third single \"Spirit Inspiration\" was also selected to be the opening theme the anime Zetsuen no Tempest, earning the band more international exposure.[1]\n",
         "The next year saw the band continue their string of successful tie-up songs, as their single \"Out of Control\" was selected to be the second opening theme of the hit anime Psycho-Pass. Following the release of their fifth album, Revolt, in June 2013, Nothing's Carved In Stone released a new single in December.[3]\n"
      ]
   },
   "Band members": {},
   "Discography": {
      "Studio albums": {},
      "Live albums": {},
      "Singles": {},
      "DVDs": {}
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Nothing's Carved in Stone is a Japanese rock band formed in January 2009. After Ellegarden decided to go into hiatus in 2008, the group's guitarist Shinichi Ubukata created Nothing's Carved in Stone as his solo project.[1] Their debut album Parallel Lives was released on May 6, 2009, debuting at No. 11 on the Japanese Oricon weekly album charts.[2]\n",
      "In 2008, the popular pop punk group Ellegarden announced that they would enter an indefinite hiatus. Guitarist Shinichi Ubukata used the break as an opportunity to start a new band called Nothing's Carved In Stone. He quickly recruited Hidekazu Hinata of Straightener to be his new bassist and Takanori \"Oniy\" Ohkita from FULLARMOR to join on drums, and they began holding sessions together.[3] However, the band struggled to find a vocalist for nearly half a year. They eventually settled on Taku Muramatsu, the singer of an indie rock band called ABSTRACT MASH, who Ubukata discovered through his band's Myspace. After showing his bandmates a few videos, Ubukata and Ohkita attended one of ABSTRACT MASH's lives and, charmed by Muramatsu's performance, convinced him to join the band.[3]\n",
      "Nothing's Carved In Stone moved quickly after their line-up was complete, playing their first live on February 27 at Daikanyama UNIT. Their debut album, Parallel Lives, was released on May 6, 2009 and was followed by two nationwide tours.[3] The album went on to reach the eleventh spot on the Oricon charts. Nothing's Carved In Stone also firmly announced their presence on the Japanese rock scene that year with performances at high-profile events like the SWEET LOVE SHOWER, SUMMER SONIC and the ROCK IN JAPAN FESTIVAL.[1]\n",
      "Not even waiting for their debut year to end, the band released their first single, \"Around The Clock\", in December 2009. Their first concert DVD, Initial Lives arrived on the same day, documenting the band's powerful live performances and strong camaraderie between its members.\n"
   ]
}