{
   "Name": "DMBQ",
   "rawData": [
      "DMBQ is a Japanese rock band from Tokyo, whose name stands for Dynamite Masters Blues Quartet.  They are influenced by British and American rock music of the early 1970s, especially bands such as The Jimi Hendrix Experience, Deep Purple, and Led Zeppelin.\n",
      "Shinji Masuko is a well-known journalist in Japan who has regular columns in several music, pornography and subculture magazines. He is a younger brother of Naozumi Masuko, who is a member of Dohatsuten.\n",
      "Yuka Yoshimura belonged to OOIOO under the name \"Yoshico\" at the same time as DMBQ until 2003, and participated in Hatsuiku Status which was temporarily formed by Shiina Ringo, and now a member of Catsuomaticdeath and Metalchicks.\n"
   ],
   "infobox": {
      "Origin": [
         "Tokyo, Japan"
      ],
      "Genres": [
         "Hard rock",
         "rock and roll"
      ],
      "Years active": [
         "1989 – present"
      ],
      "Labels": [
         "God?/Drag City"
      ],
      "Associated acts": [
         "Boredoms, Moan, 巨人ゆえにデカイ(Kyozin Yueni Dekai)"
      ],
      "Website": [
         "http://www.dmbq.net/"
      ],
      "Members": [
         "Shinji Masuko",
         "Shinji Wada",
         "Maki"
      ],
      "Past members": [
         "Yuka Yoshimura",
         "Mana Nishiura",
         "Toru Mastui",
         "Ryuichi Watanabe"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Tokyo, whose name stands for Dynamite Masters Blues Quartet.  They are influenced by British and American rock music of the early [YEAR]s, especially bands such as The Jimi Hendrix Experience, Deep Purple, and Led Zeppelin.\n",
      "Shinji Masuko is a [GENRE] a younger brother of Naozumi Masuko, who is a member of Dohatsuten.\n",
      "Yuka Yoshimura belonged to OOIOO under the name [SONG_NAME] at the same time as [BAND_NAME] until [YEAR], and participated in Hatsuiku Status which was temporarily formed by Shiina Ringo, and now a [GENRE]"
   ]
}