{
   "Name": "DMBQ",
   "Sections": [
      "1 History",
      "2 Personnel",
      "2.1 Current members",
      "2.2 Former members",
      "3 Other works",
      "3.1 Tompei & Bishop",
      "3.2 Hydro-Guru",
      "3.3 Masuko's work with Boredoms",
      "3.4 Moan",
      "4 Partial discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "DMBQ is a Japanese rock band from Tokyo, whose name stands for Dynamite Masters Blues Quartet.[1]  They are influenced by British and American rock music of the early 1970s, especially bands such as The Jimi Hendrix Experience, Deep Purple, and Led Zeppelin.\n",
         "Shinji Masuko is a well-known journalist in Japan who has regular columns in several music, pornography and subculture magazines. He is a younger brother of Naozumi Masuko, who is a member of Dohatsuten.\n",
         "Yuka Yoshimura belonged to OOIOO under the name \"Yoshico\" at the same time as DMBQ until 2003, and participated in Hatsuiku Status which was temporarily formed by Shiina Ringo, and now a member of Catsuomaticdeath and Metalchicks.\n"
      ]
   },
   "History": {
      "text": [
         "DMBQ was formed in Hokkaido in 1989. The founding members were Shinji Masuko (vocals/guitar), Ryuuichi Watanabe (bass), and Yuka Yoshimura (drums). They began performing in Tokyo in early 1990 and quickly gained notoriety for their psychedelic live performances.  \n",
         "In 1995, their debut album Dynamite Masters Blues Quartet was released.\n",
         "In 1997, Toru Matsui (guitar) became a member of the band.\n",
         "In 1999, they contracted with PARCO/Colomubia and made their major label debut.\n",
         "In 2002, they contracted with avex trax.\n",
         "In June of 2004, they were supposed to start their first American tour, but Yoshimura left the band just before embarking, and Mana Nishiura (a.k.a. China, formerly of Shonen Knife  became her replacement behind the kit.\n",
         "In 2005, they contracted with the American label Estrus/Touch and Go, and toured in the United States.\n",
         "On November 4, 2005, while driving to a show at New York City's Club Exit, Mana Nishiura died when another vehicle crossed lanes and struck the band's van in southern New Jersey.[2]\n",
         "After recovering from their injuries, DMBQ decided to go back to the US (west coast only) for another mini-tour.\n",
         "In February, 2006, Shinji Wada formally assumed DMBQ's drummer duties.\n",
         "Sometime between 2012 and 2014, Toru Matsui and Ryuichi Watanabe left DMBQ and Maki (formerly of OOIOO) assumed bass duties. They have continued as a three-piece since then. \n",
         "In February of 2018, they released their first new album in 13 years, Keeenly, on CD in Japan. After a Japan tour in March of 2018 with Ty Segall and the Freedom band, Ty released Keeenly as a double LP on his label God? with the help of Drag City in the US. The double LP was released in November 2018. \n",
         "Ty Segall said, \"There is no band like DMBQ. They are unique destroyers of sound, and lovers of sonic beauty, existing in the places between. Masters of harsh tone and psychotic rhythm. Keeenly is an alien planet type record, evoking images of landscapes and weather patterns found in other galaxies. Purple wind and green fire.” [3]\n"
      ]
   },
   "Personnel": {
      "Current members": {},
      "Former members": {}
   },
   "Other works": {
      "Tompei & Bishop": {
         "text": [
            "Tompei & Bishop is the rock band which Tompei (Masuko) and Bishop (Matsui) formed.\n"
         ]
      },
      "Hydro-Guru": {
         "text": [
            "Hydro-Guru is the garage blues unit which Masuko and Yoshimura formed.\n"
         ]
      },
      "Masuko's work with Boredoms": {
         "text": [
            "In 2004 Masuko became a member of Boredoms, in which he assumes live tuning and maintenance duties of the seven neck guitar instruments Sevena, which he built to Yamantaka Eye's specifications. Shinji has built two versions of this instrument, the first being made of seven Fender Telecaster guitars connected together, and the second being made of seven custom steel guitars. The instrument is played as a percussion instrument by Eye, who either strikes the individual necks of the instrument with drum sticks or strikes many of them at once with a staff. The instruments are connected to a mixing console and are played through a Marshall guitar amp. Due to the ferocity with which Eye plays the instruments, Masuko can be seen behind the Sevenas constantly replacing and tuning broken strings throughout a Boredoms live performance.\n"
         ]
      },
      "Moan": {
         "text": [
            "Moan is the solo project of Japanese rock legend Shinji Masuko, best known as founding member and guitarist/vocalist of rock gods DMBQ and principal guitarist and integral member of noise art prophets the Boredoms. Shinji’s creative contributions in the Boredoms extends far beyond the guitar, though, including the design and production of their notorious seven-necked guitars (Sevena I & II), as well as track production and systems design for the Boredoms large scale Boadrum projects. Moan originally grew out of this when Kid Millions heard some Boredoms backing tracks on Shinji’s iPod while staying at his house during Boadrum rehearsals.[4]\n"
         ]
      }
   },
   "Partial discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "DMBQ is a Japanese rock band from Tokyo, whose name stands for Dynamite Masters Blues Quartet.[1]  They are influenced by British and American rock music of the early 1970s, especially bands such as The Jimi Hendrix Experience, Deep Purple, and Led Zeppelin.\n",
      "Shinji Masuko is a well-known journalist in Japan who has regular columns in several music, pornography and subculture magazines. He is a younger brother of Naozumi Masuko, who is a member of Dohatsuten.\n",
      "Yuka Yoshimura belonged to OOIOO under the name \"Yoshico\" at the same time as DMBQ until 2003, and participated in Hatsuiku Status which was temporarily formed by Shiina Ringo, and now a member of Catsuomaticdeath and Metalchicks.\n",
      "DMBQ was formed in Hokkaido in 1989. The founding members were Shinji Masuko (vocals/guitar), Ryuuichi Watanabe (bass), and Yuka Yoshimura (drums). They began performing in Tokyo in early 1990 and quickly gained notoriety for their psychedelic live performances.  \n"
   ]
}