{
   "Name": "Number Girl",
   "rawData": [
      "Number Girl (ナンバーガール) is a rock band formed in Fukuoka, Japan in August, 1995 by guitarist and vocalist Shutoku Mukai. They disbanded in 2002 following bassist Kentaro Nakao's departure from the band.\n",
      "Number Girl played fast, guitar-driven rock similar to the Pixies, Sonic Youth, and Hüsker Dü.  Over the course of seven years their sound evolved greatly, serving as a basis for Mukai's post-Number Girl project, Zazen Boys.\n",
      "In February 2019, it was announced that the band would be reuniting to perform at Rising Sun Rock Festival 2019 in Ezo. Although the first day of the festival was cancelled and Number Girl did not perform, they had already announced a four-date Japanese tour by this time, beginning at Hibiya Open-Air Concert Hall on August 18. The day after the Hibiya concert, they announced a further twelve Japanese tour dates, set to span over December 2019 to February 2020.\n"
   ],
   "infobox": {
      "Origin": [
         "Fukuoka, Japan"
      ],
      "Genres": [
         "Alternative rock, post-hardcore, indie rock, noise rock, experimental rock"
      ],
      "Years active": [
         "1995–2002, 2019–present"
      ],
      "Labels": [
         "Toshiba EMI"
      ],
      "Associated acts": [
         "Zazen Boys, Vola and the Oriental Machine, Bloodthirsty Butchers, Lama, Seagull Screaming Kiss Her Kiss Her, Toddle, Spiral Chord, Sloth Love Chunks, Crypt City, younGSounds"
      ],
      "Website": [
         "numbergirl.com"
      ]
   },
   "albums": [
      "School Girl Bye Bye",
      "School Girl Distortional Addict",
      "Sappukei",
      "Num-Heavymetallic"
   ],
   "prunedData": [
      "[BAND_NAME] (ナンバーガール) is a [GENRE] band formed in Fukuoka, Japan in [MONTH], [YEAR] by guitarist and vocalist Shutoku Mukai. They disbanded in [YEAR] following bassist [PERSON_NAME_FULL_0_MALE]'s departure from the band.\n",
      "[BAND_NAME] played fast, guitar-driven rock similar to the Pixies, Sonic Youth, and Hüsker Dü.  Over the course of seven years their sound evolved greatly, serving as a basis for Mukai's post-[BAND_NAME] project, Zazen Boys.\n",
      "In [MONTH] [YEAR], it was announced that the band would be reuniting to perform at Rising Sun Rock Festival [YEAR] in Ezo. Although the first day of the festival was cancelled and [BAND_NAME] did not perform, they had already announced a four-date Japanese tour by this time, beginning at Hibiya Open-Air Concert Hall on [MONTH] 18. The day after the Hibiya concert, they announced a further twelve Japanese tour dates, set to span over [MONTH] [YEAR] to [MONTH] [YEAR].\n"
   ]
}