{
   "Name": "Onna no Ko wa Dare Demo",
   "Sections": [
      "1 Background and development",
      "2 Writing and production",
      "3 Promotion and release",
      "4 Music video",
      "5 Critical reception",
      "6 Track listing",
      "7 Personnel",
      "8 Chart rankings",
      "8.1 Sales and certifications",
      "9 Release history",
      "10 References"
   ],
   "Summary": {
      "text": [
         "\"Onna no Ko wa Dare Demo\" (女の子は誰でも, \"All Girls\"), also known by its English name \"Fly Me to Heaven\",[1] is one of the A-sides of the single \"Sora ga Natteiru/Onna no Ko wa Dare Demo\" by Japanese rock band Tokyo Jihen, led by musician Ringo Sheena. It was released digitally in April 2011, and physically on May 11, 2011, after being postponed since February. The song was featured in a national campaign for Shiseido's Maquillage range of cosmetics in 2011, which featured Sheena as the spokesperson.\n"
      ]
   },
   "Background and development": {
      "text": [
         "In July 2010, Tokyo Jihen released two digital singles: \"Tengoku e Yōkoso\", the theme song for the drama Atami no Sōsakan, and \"Dopa-mint!\", Tokyo Jihen's third song used Ezaki Glico's Watering Kissmint range of gum.[2][3] The band performed at the EMI Rocks festival on November 6, 2010, celebrating 50 years of the EMI label.[4]\n",
         "The band produced the single \"Oishii Kisetsu\" / \"Ketteiteki Sanpunkan\" for entertainer Chiaki Kuriyama, which was released on March 2, 2011.[5] After the 2011 Tōhoku earthquake and tsunami occurred on March 11, the band released a cover of Tokiko Iwatani's 1964 song \"Yoake no Uta\" to YouTube.[6]\n",
         "The single was first announced on December 10, 2010, with a preliminary release date of February 23, 2010.[7] The single's other A-side, \"Sora ga Natteiru\" was released as a cellphone download on February 8, 2011.[8]\n"
      ]
   },
   "Writing and production": {
      "text": [
         "Sheena wanted to experiment in the song, by having a third person outside of the band arrange a song that they happened to play in.[9] Hence, the song was performed by a special unit of Tokyo Jihen called the Tokyo Magical Big Band (東京マジカルビッグバンド, Tōkyō Majikaru Biggu Bando), featuring 13 additional musicians.[10][11] Instead of the song being arranged by the members of Tokyo Jihen as usual, it was arranged by Takayuki Hattori, who had previously collaborated with Sheena in 2001, with the song \"Sid to Hakuchūmu\" on her single \"Mayonaka wa Junketsu\".[12][13]\n",
         "\"Onna no Ko wa Dare Demo\" was a song that Sheena had mostly already thought up before being asked to create music for Shiseido. The company only had one request, that the song needed to contain the word \"virgin\".[14]\n"
      ]
   },
   "Promotion and release": {
      "text": [
         "The song was used in a high-profile campaign for Shiseido's Maquillage range of cosmetics, the first time Sheena had acted as a cosmetics spokesperson. The first commercials began airing on February 20, 2011,[12] with a second series of commercials airing from April 20.[15]\n",
         "On February 12, band drummer Toshiki Hata was charged with interfering with a public servant, after hitting a police officer during an incident on February 10, when the officer had been called to a residence to investigate broken glass.[16] As a result, the single was postponed, and all promotional activities involving Hata were ceased.[17] All mention of the single's release date were removed from Tokyo Jihen's website.[18] The original version of the song was intended to be used from February 20 for the Shiseido Maquillage campaign, however due to the incident a new version, the \"Sugao-hen\" (素顔編, \"Make-up-less Version\") aired, featuring a piano arrangement without Hata's involvement.[19] The band eventually resumed activities together on April 5, 2011, and the single was given the new release date of May 11.[20][21]\n",
         "The song was intended to be performed on Music Station on February 25, after performing on the previous week to perform \"Sora ga Natteiru\".[22] This was however cancelled, but on May 20 Sheena performed the song billed as a solo artist at Music Station.[23] At the 62nd NHK Kōhaku Uta Gassen on December 31, 2011, Sheena performed \"Onna no Ko wa Dare Demo\" in a medley with Sheena's solo song \"Carnation\",[24] alongside the other members of Tokyo Jihen.\n",
         "The song was eventually released as a digital download to cellphones on April 20, before the physical single's release on May 11.[25]\n",
         "The song was first performed at the Terebi Asahi Dream Music Festival on September 24, 2011. It was additionally performed during the band's Discovery (2011) and Bon Voyage (2012) tours. These performances can be found on the tours' respective DVDs.[26][27] Sheena performed the song during her solo Tōtaikai concerts in 2013.\n"
      ]
   },
   "Music video": {
      "text": [
         "The music video was unveiled on April 20, 2011.[28] It was directed by Yuichi Kodama, who also took charge of the video for \"Sora ga Natteiru\", as well as the commercials for Shiseido's Maquillage, and Ezaki Glico's Watering Kissmint commercials featuring \"Sora ga Natteiru\".[29][30][31]\n",
         "The video begins by Sheena walking down the draws of a wardrobe, and singing the song in an extensive dressing room, as well as a stage. The video depicts her wearing eight different early 20th Century costumes, usually in scenes involving dressing mirrors. During the instrumental section of the song, Sheena performs a dance with her bandmates serving as back-dancers. Additional scenes involve Sheena playing golf, and sitting on a bed of sand. During the final English section of the song, Sheena walks down a long flight of wardrobe draws\n"
      ]
   },
   "Critical reception": {
      "text": [
         "CDJournal reviewers praised the song's \"light swing big band sound\", and felt that the \"cute dazzling sound\" was enjoyable.[32][33] Hot Express reviewer Haruna Takakawa felt the song was \"overflowing with everything that makes a 'girl'\". Though she initially felt this was rare in a Sheena song, she realised the song reminded her of Sheena's previous works \n-reminded her of her songs \"Kofukuron\" (1998), \"Koko de Kiss Shite.\" (1999) and \"Futari Bocchi Jikan\" (2009).[34]\n"
      ]
   },
   "Track listing": {},
   "Personnel": {
      "text": [
         "Personnel details were sourced from Dai Hakken's liner notes booklet.[10]\n",
         "Musicians and personnel\n",
         "\n",
         "\n"
      ]
   },
   "Chart rankings": {
      "Sales and certifications": {}
   },
   "Release history": {},
   "References": {},
   "coreData": [
      "\"Onna no Ko wa Dare Demo\" (女の子は誰でも, \"All Girls\"), also known by its English name \"Fly Me to Heaven\",[1] is one of the A-sides of the single \"Sora ga Natteiru/Onna no Ko wa Dare Demo\" by Japanese rock band Tokyo Jihen, led by musician Ringo Sheena. It was released digitally in April 2011, and physically on May 11, 2011, after being postponed since February. The song was featured in a national campaign for Shiseido's Maquillage range of cosmetics in 2011, which featured Sheena as the spokesperson.\n",
      "In July 2010, Tokyo Jihen released two digital singles: \"Tengoku e Yōkoso\", the theme song for the drama Atami no Sōsakan, and \"Dopa-mint!\", Tokyo Jihen's third song used Ezaki Glico's Watering Kissmint range of gum.[2][3] The band performed at the EMI Rocks festival on November 6, 2010, celebrating 50 years of the EMI label.[4]\n",
      "The band produced the single \"Oishii Kisetsu\" / \"Ketteiteki Sanpunkan\" for entertainer Chiaki Kuriyama, which was released on March 2, 2011.[5] After the 2011 Tōhoku earthquake and tsunami occurred on March 11, the band released a cover of Tokiko Iwatani's 1964 song \"Yoake no Uta\" to YouTube.[6]\n",
      "The single was first announced on December 10, 2010, with a preliminary release date of February 23, 2010.[7] The single's other A-side, \"Sora ga Natteiru\" was released as a cellphone download on February 8, 2011.[8]\n"
   ]
}