{
   "Name": "Lȧȧz Rockit",
   "rawData": [
      "Lȧȧz Rockit was an American thrash metal band formed in San Francisco, California, United States, in 1982. \n",
      "Lȧȧz Rockit was formed in the hills of Berkeley, California by vocalist Michael Coons and guitarist Aaron Jellum. Coons was 17, just about to graduate high school, and Jellum was 18, busy attending college and riding motorcycles, and they knew what musical direction they wanted to pursue. After performing with various members, Coons and Jellum came across guitarist Phil Kettner and drummer Victor Agnello in late 1982 and early 1983. Bassist Willy Lange joined soon after in 1983 to complete the line-up of the band. Their first recording was the Prelude to Death demo, which was released that year. They later signed with Target Records to release their debut album City's Gonna Burn in 1984, followed by No Stranger to Danger in 1985. This period saw Lȧȧz Rockit play with a wide variety of bands, such as the \"big four\" (Metallica, Slayer, Megadeth and Anthrax), Exodus, Ratt, W.A.S.P., Girlschool, Y&T, Leatherwolf, Kix, Dark Angel, Suicidal Tendencies, Stryper and Armored Saint, and they made their first appearances in Europe in 1986, supporting Motörhead. Their presence helped forge a new, heavier musical direction for the band and formed a unique relationship with European fans.\n",
      "Lȧȧz Rockit released the next two albums, Know Your Enemy in 1987 and Annihilation Principle in 1989, under their new label Roadrunner Records/Enigma Records, with both albums being well received by fans and critics, and seeing them share the stage with the likes of Metallica, Megadeth, Exodus, Anthrax, Overkill, Testament, M.O.D., Celtic Frost, Kreator, Voivod, Nuclear Assault, Vio-lence, Forbidden, Metal Church, D.B.C., Suicidal Tendencies, the Cro-Mags, Faith No More and L.A. Guns. Later in 1989, Lange, Kettner and Agnello left the band for various reasons, leaving Coons and Jellum as the only remaining members left. The two soon recruited guitarist Scott Sargeant, bassist Scott Dominguez and drummer Dave Chavarri. In 1991, the album Nothing's Sacred was released. After touring in the United States and Europe from 1991 to 1992, and making an appearance in Japan in 1992, the band split-up. Most of the members then formed the short-lived groove-oriented thrash metal band Gack, Replacing Chavarri with Defiance drummer Matt Vander Ende.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Thrash metal",
         "glam metal (early)"
      ],
      "Years active": [
         "1982–1992",
         "2005–2011 (on hiatus)"
      ],
      "Labels": [
         "OSM Records",
         "Massacre"
      ],
      "Members": [
         "Michael Coons",
         "Aaron Jellum",
         "Phil Kettner",
         "Sky Harris"
      ],
      "Past members": [
         "Victor Agnello ",
         "Willy Lange ",
         "Dave Starr",
         "Scott Dominguez",
         "Dave Chavarri",
         "Ken Savich",
         "Jon Torres",
         "Scott Sargeant",
         "Sven Soderlund",
         "Matt Vander Ende"
      ]
   },
   "albums": [
      "City's Gonna Burn",
      "No Stranger to Danger",
      "Know Your Enemy",
      "Annihilation Principle",
      "Nothing's Sacred",
      "Left for Dead"
   ]
}