{
   "Discography": {},
   "External links": {},
   "History": {
      "Early years and split (1982-1992)": {
         "text": [
            "Lȧȧz Rockit was formed in the hills of Berkeley, California by vocalist Michael Coons and guitarist Aaron Jellum. Coons was 17, just about to graduate high school, and Jellum was 18, busy attending college and riding motorcycles, and they knew what musical direction they wanted to pursue. After performing with various members, Coons and Jellum came across guitarist Phil Kettner and drummer Victor Agnello in late 1982 and early 1983. Bassist Willy Lange joined soon after in 1983 to complete the line-up of the band. Their first recording was the Prelude to Death demo, which was released that year. They later signed with Target Records to release their debut album City's Gonna Burn in 1984, followed by No Stranger to Danger in 1985. This period saw Lȧȧz Rockit play with a wide variety of bands, such as the \"big four\" (Metallica, Slayer, Megadeth and Anthrax), Exodus, Ratt, W.A.S.P., Girlschool, Y&T, Leatherwolf, Kix, Dark Angel, Suicidal Tendencies, Stryper and Armored Saint, and they made their first appearances in Europe in 1986, supporting Motörhead.[1] Their presence helped forge a new, heavier musical direction for the band and formed a unique relationship with European fans.\n",
            "Lȧȧz Rockit released the next two albums, Know Your Enemy in 1987 and Annihilation Principle in 1989, under their new label Roadrunner Records/Enigma Records, with both albums being well received by fans and critics, and seeing them share the stage with the likes of Metallica, Megadeth, Exodus, Anthrax, Overkill, Testament, M.O.D., Celtic Frost, Kreator, Voivod, Nuclear Assault, Vio-lence, Forbidden, Metal Church, D.B.C., Suicidal Tendencies, the Cro-Mags, Faith No More and L.A. Guns.[1] Later in 1989, Lange, Kettner and Agnello left the band for various reasons, leaving Coons and Jellum as the only remaining members left. The two soon recruited guitarist Scott Sargeant, bassist Scott Dominguez and drummer Dave Chavarri. In 1991, the album Nothing's Sacred was released. After touring in the United States and Europe from 1991 to 1992, and making an appearance in Japan in 1992, the band split-up. Most of the members then formed the short-lived groove-oriented thrash metal band Gack, Replacing Chavarri with Defiance drummer Matt Vander Ende.[2]\n"
         ]
      },
      "Reunion (2005-present)": {
         "text": [
            "In 2005, Lȧȧz Rockit reformed with the original line-up, performing their return show at the Dynamo Open Air in May 2005. On July 9, 2005, they teamed up with other bands to perform in San Francisco for the benefit concert dubbed Thrash Against Cancer. In September 2005, the band made their return to Japan. Later, Lȧȧz Rockit announced that they would not record a new album. However, following the response to their shows in April 2007 and the sales of their Live Untold DVD, released in 2006, they announced that they would undertake a project that was intended to result in a new album for release in 2007 or early 2008. In 2007, new drummer Sky Harris joined the band. On May 27, 2008, Lȧȧz Rockit posted two new songs from their then-upcoming release Left for Dead on their official Myspace page. The album was released on July 25, 2008 on the German label Massacre Records. They also announced that their back catalogue would be re-released and remastered, however Nothing's Sacred was not mentioned for a re-release.\n",
            "On December 9, 2011, the band opened for Metallica on the third concert of their 30th anniversary party at The Fillmore.\n",
            "On June 1, 2014, drummer Victor Agnello died at the age of 50 after battling Leukemia for over a year.[3] On October 23, 2018, bassist Willy Lange died at the age of 57 from injuries sustained in a motorcycle accident.[4]\n",
            "The current status of the band is unknown. Although a break-up or hiatus had not been announced, they have been inactive since opening for Metallica in 2011. In addition to confusion of their current status, their official website had ceased to exist by March 2017. Despite this, there had been reports of the band writing a follow-up to 2008's Left for Dead.[5]\n"
         ]
      }
   },
   "Members": {
      "Timeline": {}
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Early years and split (1982-1992)",
      "1.2 Reunion (2005-present)",
      "2 Members",
      "2.1 Timeline",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Lȧȧz Rockit was an American thrash metal band formed in San Francisco, California, United States, in 1982. \n"
      ]
   },
   "Title": "Lȧȧz Rockit - Wikipedia"
}