{
   "Name": "Tengoku e Yōkoso",
   "Sections": [
      "1 Background and development",
      "2 Writing and production",
      "3 Promotion and release",
      "4 Critical reception",
      "5 Track listing",
      "6 Chart rankings",
      "7 Release history",
      "8 References"
   ],
   "Summary": {
      "text": [
         "\"Tengoku e Yōkoso\" (天国へようこそ, \"Welcome to Heaven\"), also known by its English name \"Where's Heaven\",[1] is a single by Japanese rock band Tokyo Jihen, led by musician Ringo Sheena. It was released on October 17, 2010, and served as the Joe Odagiri and Chiaki Kuriyama-starring drama Atami no Sōsakan's theme song.\n"
      ]
   },
   "Background and development": {
      "text": [
         "Ringo Sheena had written several songs for Japanese dramas before \"Tengoku e Yōkoso\". Her first was in 2005, when Tokyo Jihen's single \"Shuraba\" was used for the period drama Ōoku: Hana no Ran.[2] In 2008, Sheena wrote the song \"Amagasa\" for the Johnny & Associates band Tokio, which was used for the drama Yasuko to Kenji, starring Tokio member Masahiro Matsuoka.[3] In 2009, Sheena's solo single \"Ariamaru Tomi\" was used for the drama Smile, which starred Jun Matsumoto and Yui Aragaki.\n",
         "Drama producer Ikuei Yokochi needed a song that would match the \"strange atmosphere\" of the drama, and thought of Tokyo Jihen when considering a band that could \"project a unique atmosphere, where you're not sure if it's Japanese or Western music\". Sheena, being a fan of screenwriter Satoshi Miki's works accepted the offer, and met with Miki to discuss the song. The drama's team requested a song \"unlike today's chart toppers, but a jazz standard-like song that could be sung on forever.\"[4]\n"
      ]
   },
   "Writing and production": {
      "text": [
         "Three versions of the song exist. The original, added to the band's studio album Dai Hakken as a bonus track and dubbed the \"For the Tube\" edition, features English lyrics, while the studio \"For the Disc\" version is sung in Japanese. In 2011, a samba instrumental version dubbed the \"Tokyo Bay Ver.\" was released as a digital download in 2001, as well as on the DVD CS Channel.[5][6]\n",
         "Sheena wrote the song wrote especially for the drama, after reading Satoshi Miki's script during the Ultra C tour.[4][7] After noticing a notation on her copy that said \"a samba melody plays from the radio\" for a certain scene, Sheena was inspired to write the theme song so that it could also work as a samba melody.[6] It was recorded in June 2010 after the band finished their Ultra C tour.[8] The song uses instruments such as the glockenspiel and the vibraphone to create a \"suspicious atmosphere\".[9]\n",
         "The song was rearranged for Dai Hakken, as it was an album where the band considered the album's arrangement more carefully. Hata was credited on Dai Hakken as an \"afrogrammer\" for the \"For the Disc\" version of the song, after introducing African-style primal beats. The band made use of non-standard items such as boxes and wooden planks for percussion.[8]\n",
         "The Tokyo Bay Ver. was performed by a special unit called the Tokyo Samba Paradise Band (東京サンバパラダイスバンド, Tōkyō Sanba Paradaisu Bando), which featured Tokyo Jihen members, as well as flautist Hideyo Takakuwa and vibraphone performer Midori Takada. Drummer Toshiki Hata performed a variety of Latin instruments on the piece: the agogô, the tamborim, the shaker, the timbales and the surdo.[10]\n"
      ]
   },
   "Promotion and release": {
      "text": [
         "As the theme song for Atami no Sōsakan, the song was played during the ending sequences of each episode, and was utilised in promotional commercials and trailers for the drama. The band performed the song at Music Station on August 27, 2010.[11] Tokyo Jihen were featured in issues of Rockin' On Japan and Switch to promote the release, as well as the NHK program The Star airing an interview with Sheena.[12]\n",
         "The song was first performed at the EMI Rocks festival on November 6, 2010. The \"For the Disc\" version of the song was performed in Tokyo Jihen's Discovery tour (2011), while the single version during their farewell tour Bon Voyage (2012).[13][14] Sheena also performed a version during her Chotto Shita Reco-hatsu mini-tour as a solo artist in 2014.[15]\n",
         "A music video for the \"Tokyo Bay Ver.\" was created for the CS Channel DVD's credits, directed by Yuichi Kodama.[10]\n"
      ]
   },
   "Critical reception": {
      "text": [
         "CDJournal reviewers praised the song's \"troubling atmosphere\", noting that it fit well with the drama. They were especially impressed by both Sheena's vocals, and with the song's finale, when it develops into a \"violent\" band sound. For the Dai Hakken album version, they praised the Sheena's songwriting abilities in making a \"melody that moves in half-tones\", as well as member Ukigumo's guitar techniques.[16]\n"
      ]
   },
   "Track listing": {},
   "Chart rankings": {},
   "Release history": {},
   "References": {},
   "coreData": [
      "\"Tengoku e Yōkoso\" (天国へようこそ, \"Welcome to Heaven\"), also known by its English name \"Where's Heaven\",[1] is a single by Japanese rock band Tokyo Jihen, led by musician Ringo Sheena. It was released on October 17, 2010, and served as the Joe Odagiri and Chiaki Kuriyama-starring drama Atami no Sōsakan's theme song.\n",
      "Ringo Sheena had written several songs for Japanese dramas before \"Tengoku e Yōkoso\". Her first was in 2005, when Tokyo Jihen's single \"Shuraba\" was used for the period drama Ōoku: Hana no Ran.[2] In 2008, Sheena wrote the song \"Amagasa\" for the Johnny & Associates band Tokio, which was used for the drama Yasuko to Kenji, starring Tokio member Masahiro Matsuoka.[3] In 2009, Sheena's solo single \"Ariamaru Tomi\" was used for the drama Smile, which starred Jun Matsumoto and Yui Aragaki.\n",
      "Drama producer Ikuei Yokochi needed a song that would match the \"strange atmosphere\" of the drama, and thought of Tokyo Jihen when considering a band that could \"project a unique atmosphere, where you're not sure if it's Japanese or Western music\". Sheena, being a fan of screenwriter Satoshi Miki's works accepted the offer, and met with Miki to discuss the song. The drama's team requested a song \"unlike today's chart toppers, but a jazz standard-like song that could be sung on forever.\"[4]\n",
      "Three versions of the song exist. The original, added to the band's studio album Dai Hakken as a bonus track and dubbed the \"For the Tube\" edition, features English lyrics, while the studio \"For the Disc\" version is sung in Japanese. In 2011, a samba instrumental version dubbed the \"Tokyo Bay Ver.\" was released as a digital download in 2001, as well as on the DVD CS Channel.[5][6]\n"
   ]
}