{
   "Name": "Diamond Head (Japanese band)",
   "Sections": [
      "1 History",
      "2 Band members",
      "2.1 Kataoka Daishi",
      "2.2 Murata Akira",
      "2.3 Susumu Nishikawa",
      "2.4 Kiyohide Ura",
      "2.5 Katsumi Usui",
      "2.6 Fire",
      "2.7 Shinichi Tanabe",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Diamond Head was a Japanese band formed of session musicians and producers. They first gained notability as the backing and touring band for Hitomi Yaida.\n"
      ]
   },
   "History": {
      "text": [
         "Working as a band in their own right they wrote and performed the song \"le vent brulant\" in 2001, which was used for some of the Japanese television coverage of the 2004 Formula-1 season. This track, an instrumental, was included on both Yaida's single \"Look Back Again/Over The Distance\" and the compilation album Grand Prix: Super Collection 2004\n",
         "Working around a core of four experienced producers with high experience and expertise with their chosen instruments, they expanded the group to include other specialists to achieve a polished sound on all.\n",
         "Formed by solo musician and producer Kataoka Daishi along with instrumentalist Murata Akira they were joined by guitarist Susumu Nishikawa and keyboardist Ura Kiyohide (who had previously been a member of the band North Wind Knights with Daishi.)[1]\n",
         "As a group, they are credited as producers and session musicians on every Hitomi Yaida release until 2005 when Diamond Head was dissolved and each individual artist received their own credits from then on, with Murata Akira taking over the bulk of her sound production from Katoaka who left Aozora in 2005.\n"
      ]
   },
   "Band members": {
      "Kataoka Daishi": {
         "text": [
            "(see also ja:片岡大志 on the Japanese Wikipedia)\n",
            "Katoaka Daishi (片岡大志, Daishi Katoaka) is a left-handed guitarist, producer and lyricist.  \nBorn in 1971 in Mitaka, Tokyo, he has 4 siblings.[2] His father is a teacher and his mother is an English Translator.\nA singer/songwriter in his own right, His professional career started in 1992 when a demo-tape sent to recording companies led to a contract from Sony BMG Japan, with the subsequent album being recorded in Los Angeles.\nSince then he has released more than 5 albums and 11 singles, the latest being the 2003 single Slapstick Blues and produced Aozora artists such as SATOMI' and CAN'NO whilst also acting as the Japanese A&R Producer for Mary Lou Lord and Imogen Heap (for the Aozora re-release of iMegaphone and Music Pool 2002 recording).[2]\nHe parted ways with Aozora in 2005, and now acts as a freelance producer,[2] with Murata Akira taking over the sound production of Hitomi Yaida's releases.\n"
         ]
      },
      "Murata Akira": {
         "text": [
            "Murata Akira (村田昭, Akira Murata) is an Instrumentalist (mainly using Keyboards), composer and sound producer. Born 29 March 1972 in Tokyo, Japan he formed the R&B band Tiptory in August 1996, signing to Avex Records.[3] Following the group disbanding in 1999, he undertook the Sound Production for Hitomi Yaida's independent release Howling.\n",
            "Since then he has worked with other notable acts such as Melody. Murata also composed the score for the 1999 Anime film A.LI.CE as well as producing numerous remixes and provided material for the Sega Saturn game Sega Rally 2 under an alias.[4]\n",
            "He is currently acting as Hitomi Yaida's sound producer and arranger.\n"
         ]
      },
      "Susumu Nishikawa": {
         "text": [
            "(see also ja:西川進 on the Japanese Wikipedia)\n",
            "Susumu Nishikawa (西川進, Nishikawa Susumu) (also known as Shin Nishikawa) born July 9 1962 in Yawata, Kyoto, is a professional guitarist, an arranger, a composer, and record producer.\n",
            "Gibson SG and the mop-top haircut dyed red are his trademarks.\n",
            "As a guitarist, he works with many musicians: Yuki Isoya (ex-Judy and Mary), Shiina Ringo, Yano Maki, Ayumi Hamasaki, Do As Infinity, Mika Nakashima, Tanpopo (appearing on the single Motto), Elephant Kashimashi, Ikimono-gakari, Chara, Puffy AmiYumi, Kaela Kimura, Maaya Sakamoto, Ayaka, Do As Infinity, Hitomi Shimatani, Yuki Kajiura and so on.[5]\nEspecially about Shina Ringo, he played almost all the songs in her early single and two first albums on the guitar. \nFurthermore, he was a tour guitarist of her early days before Diamond Head.\n",
            "As a producer, he has worked with The Turtles, Kokia, Olivia Lufkin, and so on.[6]\nHe currently contributes songs for Nana Kitade as a composer and a producer.\n",
            "In The Melancholy of Haruhi Suzumiya (anime), he played a guitar in place of the character, and his guitar play serves as a model of the performance in the anime.\n",
            "He also owns the 'Smash Room School', a distance learning Guitar School company.[7] \nStudents of which have the ability to send compositions to Nishikawa for criticism as well as being able to phone the artist direct.[8]\n"
         ]
      },
      "Kiyohide Ura": {
         "text": [
            "Kiyohide Ura (浦清英, Ura Kiyohide) born May 26, 1970 in Kurayoshi, Tottori is a session saxophonist, keyboardist and sound producer.\nFormerly a support member of the band Mr. Children he has worked with numerous acts such as Joelle and Ataru Nakamura.\n"
         ]
      },
      "Katsumi Usui": {
         "text": [
            "Katsumi Usui (臼井かつみ, Usui Katsumi) born December 20, 1971 in Yuki, Ibaraki is a professional drummer and percussionist. \nShe is both a session musician and Drum tutor (providing Drum Clinics to local schools and organisations during touring), also having an endorsement contract with tama drums[9] and Paiste Cymbals since 1997.[10] She toured with Sowelu for much of 2006.\n"
         ]
      },
      "Fire": {
         "text": [
            "Takumi Matsuda (松田卓己, Matsuda Takumi), known as \"Fire\" professionally, is a Bass guitarist.\n",
            "Born May 25, 1970 in Hirakata, Japan.[11] His professional career began in 1997 with the band Super Trapp, with whom he released two albums and five singles via Sony BMG. He has since recorded and toured with many acts including Dragon Ash.\n",
            "He plays both electric and acoustic bass guitars, appearing on stage playing a double bass on some occasions, as well as being proficient with the electric upright bass. Aria has also produced an electric bass in his honour.[12] He also contributes to the 'Smash Room School' distance learning project.\n"
         ]
      },
      "Shinichi Tanabe": {
         "text": [
            "Shinichi Tanabe (田邊晋一, Tanabe Shinichi) is a percussionist. He has performed with acts such as Banda de la Noche and Ando Yuko on her Sari EP.\n"
         ]
      }
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Diamond Head was a Japanese band formed of session musicians and producers. They first gained notability as the backing and touring band for Hitomi Yaida.\n",
      "Working as a band in their own right they wrote and performed the song \"le vent brulant\" in 2001, which was used for some of the Japanese television coverage of the 2004 Formula-1 season. This track, an instrumental, was included on both Yaida's single \"Look Back Again/Over The Distance\" and the compilation album Grand Prix: Super Collection 2004\n",
      "Working around a core of four experienced producers with high experience and expertise with their chosen instruments, they expanded the group to include other specialists to achieve a polished sound on all.\n",
      "Formed by solo musician and producer Kataoka Daishi along with instrumentalist Murata Akira they were joined by guitarist Susumu Nishikawa and keyboardist Ura Kiyohide (who had previously been a member of the band North Wind Knights with Daishi.)[1]\n"
   ]
}