{
   "Biography": {
      "text": [
         "He was born and raised in public housing in Chiba Prefecture. The first instrument he learned during his childhood was the piano, which he started learning at age 9.[1] He was introduced to bluegrass music at an early age, as his father was an amateur bluegrass musician. He started playing the guitar as a junior in high school, and joined a country band. He is an avid motorcycle and French car aficionado.\n",
         "Nagaoka is an old friend of Shiina Ringo's, and he had played in a band with her elder brother Shiina Junpei, Evil Vibrations. He also participated in the recording of her third solo album, Kalk, Samen, Chestnut Flower, on which he played guitar on the songs \"Camouflage\" (迷彩, Meisai), \"Consciously\" (意識, Ishiki) and the vinyl record bonus track \"Fig Flower\" (映日紅の花, Ichijiku no Hana, which he also arranged and composed), as well as being credited on vacuum cleaner and \"vocal percussion\" on two more songs. After the departure of Mikio Hirama from Sheena's band, Tokyo Jihen, he became the band's guitarist and background vocalist in 2005 after writing the song \"Fig Flower,\" which was only released on vinyl.[1] Upon joining the band's \"Phase 2\", he was given the pseudonym Ukigumo by Sheena. With them, he released four albums and a mini-album, and he remained with the band until its 2012 breakup. He has penned numerous songs as a member of the band, including the single \"OSCA\", and was also the lead arranger for the single \"Shuraba\".\n",
         "Since 2005, he is also the guitar player and singer for his own band, Petrolz (ペトロールズ, Petorōruzu), alongside bassist Jungo Miura (三浦 淳悟, Miura Jungo) aka \"Jumbo\" (who has also played with Shiina in the past), and drummer Toshihide Kawamura (河村 俊秀, Kawamura Toshihide) a.k.a. \"Bob\". The band has released three albums and two mini-albums to date.\n",
         "Ukigumo's cover of Pizzicato Five's \"The Night Is Still Young\" (東京は夜の七時, Tōkyō wa Yoru no Shichiji, \"Tokyo at 7 in the evening\"), with new lyrics by Shiina Ringo and renamed \"Tōkyō wa Yoru no Shichiji (Rio wa Asa no Shichiji)\" (東京は夜の七時〜リオは朝の七時〜, \"Tokyo at 7 in the evening (Rio at 7 in the morning)\"), was played during the flag handover portion of the 2016 Summer Paralympics closing ceremony.\n"
      ]
   },
   "Discography": {
      "With Petrolz": {
         "Extended plays": {},
         "Live albums": {},
         "Singles": {},
         "Studio albums": {}
      },
      "With Tokyo Jihen": {}
   },
   "External links": {},
   "References": {},
   "Sections": [
      "1 Biography",
      "2 Discography",
      "2.1 With Tokyo Jihen",
      "2.2 With Petrolz",
      "2.2.1 Studio albums",
      "2.2.2 Live albums",
      "2.2.3 Extended plays",
      "2.2.4 Singles",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Ryosuke Nagaoka (長岡 亮介, Nagaoka Ryōsuke, born October 7, 1978), is a Japanese musician, and singer and guitar player for the band Petrolz. Under the stage name Ukigmo (浮雲, Ukigumo, \"drifting cloud\"), he was the second guitarist for Ringo Sheena's band Tokyo Jihen from 2005 until 2012. In 2013, Nagoka joined the band Gokumontō Ikka, a new project for Queen Bee leader Avu-chan.\n"
      ]
   },
   "Title": "Ryosuke Nagaoka - Wikipedia"
}