{
   "Name": "Sōnan",
   "Sections": [
      "1 Background and development",
      "2 Writing and production",
      "3 Promotion and release",
      "4 Music video",
      "5 Critical reception",
      "6 Track listing",
      "7 Chart rankings",
      "7.1 Sales and certifications",
      "8 Release history",
      "9 References"
   ],
   "Summary": {
      "text": [
         "\"Sōnan\" (遭難, \"A Distress\"[1]), is the second single by Japanese rock band Tokyo Jihen, led by musician Ringo Sheena. It was released on October 20, 2004, a month after their debut single \"Gunjō Biyori\", and a month before their debut album Kyōiku.\n"
      ]
   },
   "Background and development": {
      "text": [
         "Tokyo Jihen was first formed in 2003, after Ringo Sheena decided on members for her backing band for her Sugoroku Ecstasy tour.[2] The band was officially announced as Sheena's main musical unit on May 31, 2004, and first performed at a series of summer music festivals: Meet the World Beat 2004 on July 25, 2004 at the Expo Commemoration Park in Osaka, July 30, 2004 at the Fuji Rock Festival in Niigata, and September 3, 2004 at the Fukuoka Sunset Live festival.[3][4] The group released their debut single \"Gunjō Biyori\" in September 2004, to commercial success: it reached number two on Oricon's single chart, and was certified gold by the RIAJ.[5][6]\n"
      ]
   },
   "Writing and production": {
      "text": [
         "All 17 of the songs for the Kyōiku era were recorded over a period of four days.[7] \"Sōnan\" was written entirely by Sheena. The song \"Dynamite\" was originally performed by American singer Brenda Lee in 1957. Much like the songs on Sheena's cover album Utaite Myōri: Sono Ichi, it was a song that Sheena's parents owned at their home. Her father had wondered why she had not recorded it for Utaite Myōri: Sono Ichi.[8] The liner notes for \"Kokoro\" list a date, November 25, 2003.[9] This is the date of Sheena's 25th birthday, and was the release date for her solo single \"Ringo no Uta\". The song's concept was record a song in a single day as a present for others on her birthday.[8] The song was given the figurative translation \"Spiritual\" in English.[1]\n",
         "The songs for Kyōiku were inspired by the image of the Sugoroku Tour, and \"Sōnan\" was the first she wrote of these in 2003. The arpeggio guitar introduction was thought up by Ryosuke Nagaoka (who would later become Tokyo Jihen's second guitarist, Ukigumo), as he recorded the song's demos with Sheena. It was originally just a joke, however band guitarist Hirama played it in the studio session in the same style as was on the original demo.[8] The song's lyrics were written at the same time as she composed the music, and were not revised much from their original state. Sheena wrote the song as a love song, but unlike her previous songs about love, she felt that both the man and the woman could be felt in the piece.[8] Sheena did not consider this song as a single when she originally wrote it.[8] The title \"Sōnan\" does not refer to a disaster, but to distress in a woman's heart.[10]\n",
         "The single package and track list are created in the same pattern as the band's previous single \"Gunjō Biyori\". Both releases feature an English language cover of an American song popular in the 1950s, and a B-side with a single kanji title. All song lengths on both singles are palindromic numbers.  Both releases' Japanese catalogue codes are also palindromic: TOCT-4884 and TOCT-4994 respectively. Both singles' covers are from the same photoshoot, both featuring a white gradient.\n"
      ]
   },
   "Promotion and release": {
      "text": [
         "Tokyo Jihen performed the song at Music Station on October 29, 2004, the first time the band had performed there.[11] The song was performed during the band's 2004 festival appearances at Yamabikari, Fuji Rock Festival and SunSet Live 2004, as well as their Dynamite! (2005) and Ultra C (2010) tours. It was also performed at the Dai Ikkai Ringohan Taikai events in December 2005, however not released on the DVD.[12] The B-side \"Dynamite\" was also performed at all four of Tokyo Jihen's 2004 festival performances, as well as on the Dynamite tour and the Domestic! Just Can't Help It. (2006) tour. \"Kokoro\" was performed during the Dynamite tour, however was not performed after 2005.[12]\n"
      ]
   },
   "Music video": {
      "text": [
         "A music video was filmed for the song, directed by Masaaki Uchino.[13] It links directly into an additional video shot for the B-side \"Dynamite\", which were occasionally shown together on music video channels.[14] Both videos were made available on October 20, 2004, on Tokyo Jihen's official website.[15] Tokyo Jihen's previous single \"Gunjō Biyori\" also featured a music video for the song's B-side that was a continuation of the leading song's video, also directed by Uchino.[16] The video features the band's members in formal attire, performing the song in a theatre. The film has been digitally altered, with scenes of each member stitched together causing multiple exposure, meaning that multiple band members can be seen in each scene. The video for \"Dynamite\" features Sheena performing the song cabaret style, with a troupe of backing dancers.\n"
      ]
   },
   "Critical reception": {
      "text": [
         "Listenmusic reviewer Kiyohiko Koike praised the single, saying the melody had a \"good old sepia Shōwa Kayō taste\", likening it to her earlier songs \"Kabukichō no Joō\" and \"Marunouchi Sadistic\". He noted that Sheena's lyric style was much like her previous songs, written in an old, literary style.[17] CDJournal reviewers felt the song was as if the solo era image of Sheena had been taken and bulked up by the band in the song.[18]  Reviewer Kyosuke Tsuchiya noted the song's \"jazz-style approach\", and was impressed by the \"wild power\" of Sheena's vocals and the \"suspicious melody\" created by the guitar.[19]\n"
      ]
   },
   "Track listing": {},
   "Chart rankings": {
      "Sales and certifications": {}
   },
   "Release history": {},
   "References": {},
   "coreData": [
      "\"Sōnan\" (遭難, \"A Distress\"[1]), is the second single by Japanese rock band Tokyo Jihen, led by musician Ringo Sheena. It was released on October 20, 2004, a month after their debut single \"Gunjō Biyori\", and a month before their debut album Kyōiku.\n",
      "Tokyo Jihen was first formed in 2003, after Ringo Sheena decided on members for her backing band for her Sugoroku Ecstasy tour.[2] The band was officially announced as Sheena's main musical unit on May 31, 2004, and first performed at a series of summer music festivals: Meet the World Beat 2004 on July 25, 2004 at the Expo Commemoration Park in Osaka, July 30, 2004 at the Fuji Rock Festival in Niigata, and September 3, 2004 at the Fukuoka Sunset Live festival.[3][4] The group released their debut single \"Gunjō Biyori\" in September 2004, to commercial success: it reached number two on Oricon's single chart, and was certified gold by the RIAJ.[5][6]\n",
      "All 17 of the songs for the Kyōiku era were recorded over a period of four days.[7] \"Sōnan\" was written entirely by Sheena. The song \"Dynamite\" was originally performed by American singer Brenda Lee in 1957. Much like the songs on Sheena's cover album Utaite Myōri: Sono Ichi, it was a song that Sheena's parents owned at their home. Her father had wondered why she had not recorded it for Utaite Myōri: Sono Ichi.[8] The liner notes for \"Kokoro\" list a date, November 25, 2003.[9] This is the date of Sheena's 25th birthday, and was the release date for her solo single \"Ringo no Uta\". The song's concept was record a song in a single day as a present for others on her birthday.[8] The song was given the figurative translation \"Spiritual\" in English.[1]\n",
      "The songs for Kyōiku were inspired by the image of the Sugoroku Tour, and \"Sōnan\" was the first she wrote of these in 2003. The arpeggio guitar introduction was thought up by Ryosuke Nagaoka (who would later become Tokyo Jihen's second guitarist, Ukigumo), as he recorded the song's demos with Sheena. It was originally just a joke, however band guitarist Hirama played it in the studio session in the same style as was on the original demo.[8] The song's lyrics were written at the same time as she composed the music, and were not revised much from their original state. Sheena wrote the song as a love song, but unlike her previous songs about love, she felt that both the man and the woman could be felt in the piece.[8] Sheena did not consider this song as a single when she originally wrote it.[8] The title \"Sōnan\" does not refer to a disaster, but to distress in a woman's heart.[10]\n"
   ]
}