{
   "Name": "Shuraba",
   "Sections": [
      "1 Background and development",
      "2 Writing and production",
      "3 Promotion and release",
      "4 Music video",
      "5 Critical reception",
      "6 Track listing",
      "7 Personnel",
      "8 Chart rankings",
      "8.1 Sales and certifications",
      "9 Release history",
      "10 References"
   ],
   "Summary": {
      "text": [
         "\"Shuraba\" (修羅場, \"Scene of Carnage\"), also known by its English title \"The Rat's-Nest\"[1] is the third single by Japanese rock band Tokyo Jihen, led by musician Ringo Sheena, released on November 2, 2005. It was the band's first release with their new members Ukigumo and Ichiyo Izawa, who replaced Mikio Hirama and Masayuki Hiizumi. The song was used as the theme song for the historical drama Ōoku: Hana no Ran.\n"
      ]
   },
   "Background and development": {
      "text": [
         "Tokyo Jihen was first formed in 2003, after Ringo Sheena decided on members for her backing band for her Sugoroku Ecstasy tour.[2] The band was officially announced as Sheena's main musical unit on May 31, 2004, and first performed at a series of summer music festivals in July and September.[3][4] The group released two singles in September and October 2004, \"Gunjō Biyori\" and \"Sōnan\", both of which were certified gold by the RIAJ.[5][6] This was followed by their debut album Kyōiku in November 2004, and a Japan-wide tour entitled Dynamite, a 14 date tour stopping in Matsuyama, Ehime, Hiroshima, Kanazawa, Ishikawa, Kyoto, Sapporo, Sendai, Osaka, Fukuoka, Nagoya and Tokyo.\n[7]\n",
         "After the Dynamite tour, two of the original members of the band made decisions to leave. Hiizumi left to focus on his activities with jazz ensemble Pe'z, while Hirama left to focus on his activities as a solo musician.[8] Sheena sought new members to replace Hiizumi and Hirama. She had known pianist Ichiyo Izawa since attending a solo concert of his in early 2004, though the pair had not talked together often since meeting. She wanted Izawa to join the band for both his piano and songwriting abilities.[9] Sheena contacted Izawa on February 17, 2005, a day after the final date of the Dynamite tour, however Izawa finally agreed in late April.[9] Sheena met Ukigumo through her brother Junpei Shiina, and the pair first collaborated in 2002 as a part of Yokoshima, a band formed to cover the Toto song \"Georgy Porgy\".[10] Ukigumo collaborated with Sheena during the sessions for her album Kalk Samen Kuri no Hana (2003) and Tokyo Jihen's debut album Kyōiku (2004), in which he played the guitars for Sheena's original demos.[9][11] Sheena liked Ukigumo's guitar playing so much that she left it in for the studio versions of \"Meisai\" and \"Ishiki\", and collaborated on the bonus track \"Ichijiku no Hana\", which was written by him.[9] Ukigumo did not want to join the band at first, however the band found that Ukigumo was the best fitting of all the potential guitarists. He agreed two to three days before Adult's recording sessions began in July 2005.[9] Hiizumi and Hirama's leaving was officially announced on July 1, 2005.[8]  Two months later, the \"Shuraba\" single was announced, and on September 16, 2005, the two new band members, Ichiyo Izawa and Ukigumo were announced officially.[12][13]\n"
      ]
   },
   "Writing and production": {
      "text": [
         "The single is composed of two original songs written by Sheena, plus a cover of American singer Ned Doheny's song \"Get It Up for Love\" from his 1976 album Hard Candy. The single was mostly arranged by Izawa, created from scratch after listening to Sheena's demos of the songs.[9] Working with Izawa and Ukigumo was the first time in Sheena's career where she clashed on opinions for what was best musically for the songs. Izawa felt that \"Shuraba\" needed a classical guitar, however Sheena did not want instruments with a lot of reverberation, preferred Ukigumo's original guitar accompaniment from the demo. They compromised by Sheena purchasing a classical guitar especially for the single, and asked Ukigumo to perform with it.[9]\n",
         "\"Shuraba\" was the last song recorded during the sessions for Adult. Sheena had wanted to use the single since creating the demo.[9] She wrote the lyrics after watching previous seasons of Ōoku, and was inspired by its depiction of women.[9] For the B-side \"Koi wa Maboroshi (Get It Up for Love)\", Sheena asked Ukigumo to perform the guitar in the style of Southern All Stars' 1983 song \"Sonna Hiroshi ni Damasare\". The remaining B-side, \"Rakujtsu\", dealt with more personal themes than \"Shuraba\". It was meant to be the final song on Adult, however Sheena felt that Izawa's composition \"Tegami\" suited it much better, after getting used to his style. The original demo was guitar-backed, however the band felt that Izawa's piano accompaniment suited the song better.[9]\n",
         "A different version of the song appears on the album, entitled \"Shuraba (Adult Ver.)\", featuring a different arrangement.\n"
      ]
   },
   "Promotion and release": {
      "text": [
         "As the theme song of Ōoku: Hana no Ran, \"Shuraba\" was played during the drama's credits, as well as during promotional commercials for the drama. Tokyo Jihen performed the song at Music Station twice. First on November 4, 2005, and the second time on December 23, 2005 for their Christmas special broadcast.[14][15] The band also performed the song on Count Down TV on November 12, and made extensive appearances on radio shows between October 26 and November 14.[16][17]\n",
         "The song was performed during the band's Domestic! Virgin Line (2006), Domestic! Just Can't Help It. (2006), Spa & Treatment (2007), Ultra C (2010) and Bon Voyage (2012) tours.[18][19] It was also performed at the Dai Ikkai Ringohan Taikai events in December 2005, however not released on the DVD. The B-sides were both performed during the 2005 Ringo-han events, with \"Rakujitsu\" being the only Tokyo Jihen performance featured on the DVD. Both songs were performed during  Domestic! Virgin Line, with \"Rakujitsu\" also performed at Domestic! Just Can't Help It..[18]\n"
      ]
   },
   "Music video": {
      "text": [
         "A music video was first unveiled on October 12, 2005, and was directed by Shuichi Banba.[20][21] The video features the band performing the song in an entirely white set, with all the band members wearing exclusively white clothing. During the video, red droplets begin to stain the white set. The final scene features a high-heeled shoe filling up with red. The video was nominated for the Best Group Video award at the 2006 MTV Video Music Awards Japan,[22] however lost to reggae group Def Tech's \"Konomama\".\n",
         "In March 2006, a video was released for the song's B-side \"Koi wa Maboroshi (Get It Up for Love)\", much like how videos were created for past singles' B-sides. This was an edited version of the song entitled \"Koi wa Maboroshi for Musician\".\n"
      ]
   },
   "Critical reception": {
      "text": [
         "Listenmusic reviewer Yoshiki Aoyuki called the song a masterpiece, praising the \"varied rhythm changing into a fat hip-hop beat\" caused by the mix of processed and live drums, Kameda's bass-work, and the \"stylish keyboards and classical guitar\". He felt the new members acted like a \"chemical reaction\" on the band's music.[23] CDJournal reviewers called it \"a funky pop song that fully realises [Sheena's] unwavering nature as a melody maker\". They felt the version that appeared on Adult was more refined than the \"hard\" rock flavour of the single version. They praised the \"solid rhythm and eccentric guitar\".[24][25]\n"
      ]
   },
   "Track listing": {},
   "Personnel": {
      "text": [
         "Personnel details were sourced from \"Shuraba\"'s liner notes booklet.[26]\n",
         "Visuals and imagery\n",
         "\n",
         "\n",
         "Tokyo Jihen\n",
         "\n",
         "\n",
         "Technical, production and other performers\n",
         "\n",
         "\n"
      ]
   },
   "Chart rankings": {
      "Sales and certifications": {}
   },
   "Release history": {},
   "References": {},
   "coreData": [
      "\"Shuraba\" (修羅場, \"Scene of Carnage\"), also known by its English title \"The Rat's-Nest\"[1] is the third single by Japanese rock band Tokyo Jihen, led by musician Ringo Sheena, released on November 2, 2005. It was the band's first release with their new members Ukigumo and Ichiyo Izawa, who replaced Mikio Hirama and Masayuki Hiizumi. The song was used as the theme song for the historical drama Ōoku: Hana no Ran.\n",
      "Tokyo Jihen was first formed in 2003, after Ringo Sheena decided on members for her backing band for her Sugoroku Ecstasy tour.[2] The band was officially announced as Sheena's main musical unit on May 31, 2004, and first performed at a series of summer music festivals in July and September.[3][4] The group released two singles in September and October 2004, \"Gunjō Biyori\" and \"Sōnan\", both of which were certified gold by the RIAJ.[5][6] This was followed by their debut album Kyōiku in November 2004, and a Japan-wide tour entitled Dynamite, a 14 date tour stopping in Matsuyama, Ehime, Hiroshima, Kanazawa, Ishikawa, Kyoto, Sapporo, Sendai, Osaka, Fukuoka, Nagoya and Tokyo.\n[7]\n",
      "After the Dynamite tour, two of the original members of the band made decisions to leave. Hiizumi left to focus on his activities with jazz ensemble Pe'z, while Hirama left to focus on his activities as a solo musician.[8] Sheena sought new members to replace Hiizumi and Hirama. She had known pianist Ichiyo Izawa since attending a solo concert of his in early 2004, though the pair had not talked together often since meeting. She wanted Izawa to join the band for both his piano and songwriting abilities.[9] Sheena contacted Izawa on February 17, 2005, a day after the final date of the Dynamite tour, however Izawa finally agreed in late April.[9] Sheena met Ukigumo through her brother Junpei Shiina, and the pair first collaborated in 2002 as a part of Yokoshima, a band formed to cover the Toto song \"Georgy Porgy\".[10] Ukigumo collaborated with Sheena during the sessions for her album Kalk Samen Kuri no Hana (2003) and Tokyo Jihen's debut album Kyōiku (2004), in which he played the guitars for Sheena's original demos.[9][11] Sheena liked Ukigumo's guitar playing so much that she left it in for the studio versions of \"Meisai\" and \"Ishiki\", and collaborated on the bonus track \"Ichijiku no Hana\", which was written by him.[9] Ukigumo did not want to join the band at first, however the band found that Ukigumo was the best fitting of all the potential guitarists. He agreed two to three days before Adult's recording sessions began in July 2005.[9] Hiizumi and Hirama's leaving was officially announced on July 1, 2005.[8]  Two months later, the \"Shuraba\" single was announced, and on September 16, 2005, the two new band members, Ichiyo Izawa and Ukigumo were announced officially.[12][13]\n",
      "The single is composed of two original songs written by Sheena, plus a cover of American singer Ned Doheny's song \"Get It Up for Love\" from his 1976 album Hard Candy. The single was mostly arranged by Izawa, created from scratch after listening to Sheena's demos of the songs.[9] Working with Izawa and Ukigumo was the first time in Sheena's career where she clashed on opinions for what was best musically for the songs. Izawa felt that \"Shuraba\" needed a classical guitar, however Sheena did not want instruments with a lot of reverberation, preferred Ukigumo's original guitar accompaniment from the demo. They compromised by Sheena purchasing a classical guitar especially for the single, and asked Ukigumo to perform with it.[9]\n"
   ]
}