{
   "Name": "Shuraba",
   "rawData": [
      "\"Shuraba\" (修羅場, \"Scene of Carnage\"), also known by its English title \"The Rat's-Nest\" is the third single by Japanese rock band Tokyo Jihen, led by musician Ringo Sheena, released on November 2, 2005. It was the band's first release with their new members Ukigumo and Ichiyo Izawa, who replaced Mikio Hirama and Masayuki Hiizumi. The song was used as the theme song for the historical drama Ōoku: Hana no Ran.\n",
      "Tokyo Jihen was first formed in 2003, after Ringo Sheena decided on members for her backing band for her Sugoroku Ecstasy tour. The band was officially announced as Sheena's main musical unit on May 31, 2004, and first performed at a series of summer music festivals in July and September. The group released two singles in September and October 2004, \"Gunjō Biyori\" and \"Sōnan\", both of which were certified gold by the RIAJ. This was followed by their debut album Kyōiku in November 2004, and a Japan-wide tour entitled Dynamite, a 14 date tour stopping in Matsuyama, Ehime, Hiroshima, Kanazawa, Ishikawa, Kyoto, Sapporo, Sendai, Osaka, Fukuoka, Nagoya and Tokyo.\n\n",
      "After the Dynamite tour, two of the original members of the band made decisions to leave. Hiizumi left to focus on his activities with jazz ensemble Pe'z, while Hirama left to focus on his activities as a solo musician. Sheena sought new members to replace Hiizumi and Hirama. She had known pianist Ichiyo Izawa since attending a solo concert of his in early 2004, though the pair had not talked together often since meeting. She wanted Izawa to join the band for both his piano and songwriting abilities. Sheena contacted Izawa on February 17, 2005, a day after the final date of the Dynamite tour, however Izawa finally agreed in late April. Sheena met Ukigumo through her brother Junpei Shiina, and the pair first collaborated in 2002 as a part of Yokoshima, a band formed to cover the Toto song \"Georgy Porgy\". Ukigumo collaborated with Sheena during the sessions for her album Kalk Samen Kuri no Hana (2003) and Tokyo Jihen's debut album Kyōiku (2004), in which he played the guitars for Sheena's original demos. Sheena liked Ukigumo's guitar playing so much that she left it in for the studio versions of \"Meisai\" and \"Ishiki\", and collaborated on the bonus track \"Ichijiku no Hana\", which was written by him. Ukigumo did not want to join the band at first, however the band found that Ukigumo was the best fitting of all the potential guitarists. He agreed two to three days before Adult's recording sessions began in July 2005. Hiizumi and Hirama's leaving was officially announced on July 1, 2005.  Two months later, the \"Shuraba\" single was announced, and on September 16, 2005, the two new band members, Ichiyo Izawa and Ukigumo were announced officially.\n"
   ],
   "infobox": {
      "B-side": [
         "\"Koi wa Maboroshi (Get It Up for Love)\"",
         "\"Rakujitsu\""
      ],
      "Released": [
         "November 2, 2005 (2005-11-02)"
      ],
      "Recorded": [
         "2005"
      ],
      "Genre": [
         "Alternative rock, pop-rock"
      ],
      "Length": [
         "4:10"
      ],
      "Label": [
         "Toshiba EMI"
      ],
      "Songwriter(s)": [
         "Ringo Sheena"
      ]
   }
}