{
   "Background and development": {
      "text": [
         "Vocalist Ringo Sheena originally debuted as a solo musician in 1998, however decided to become a member of a band instead for her main musical activities, and debuted Tokyo Jihen in 2004.[2] After their debut album Kyōiku, two of the original members of the band made decisions to leave, and were replaced by pianist Ichiyo Izawa and guitarist Ukigumo.[3] The new line-up released the single \"Shuraba\", a song used as the theme song for the drama Ōoku: Hana no Ran., and the band's second album, Adult (2006). Adult, while featuring lyrics entirely written by Sheena and the band collaborating to arrange the songs, also featured \"Himitsu\", which was arranged solely by Izawa, and \"Tegami\", which was composed by Izawa and arranged by Sheena.[4]\n",
         "In late 2006 and 2007, Sheena briefly resumed solo activities in collaboration with Neko Saito, on Heisei Fūzoku (2007), a soundtrack album for the Mika Ninagawa film Sakuran. The \"OSCA\" single was first announced on May 17, 2007.[5]\n",
         "The Variety project for the band involved the band members other than Sheena amassing demo tapes, and the band making careful selections. For the project, Sheena worked as a vocalist and a lyricist.[5] After the band's tour for Adult, Domestic! Just Can't Help It, finished on May 30, 2006, Sheena requested band members Ukigumo and Ichiyo Izawa write songs for the band's next studio album. While Sheena is the primary songwriter for her solo career and for Tokyo Jihen's first two albums, she occasionally goes through periods of not being able to write music.[6]\n",
         "During the single's release schedule, the Toshiba stake of Tokyo Jihen's label Toshiba EMI was bought out by the EMI group. The label was renamed EMI Music Japan on June 30, 2007.[7]\n"
      ]
   },
   "Chart rankings": {
      "Sales": {}
   },
   "Critical reception": {
      "text": [
         "Kiyohiko Koike for Listenmusic felt the song was an \"aggressive number erupting all the band member's fervour\" created by aspects such as the \"quick beat, growling bass line and Ringo's freaky passionate voice\". He felt the song was not a song you could call a single feeling it had an \"eccentric spirit of adventure\", but praised Sheena being used as a resource by her bandmates in the production of a song, and felt that the \"mental aspects\" of the band had evolved.[20][21] Hot Express reviewer Tetsuo Hiraga praised Sheena's \"charming\" vocals in the song, and felt as if the song were exploding from every direction. He believed that this \"broken\" Sheena had not been seen in her previous works before.[22] CDJournal reviewers noted the song's structure, describing it as \"developing into a constantly changing song, as if many songs were in a single song.\"[23] Reviewer Naoko Saito was very positive on the song, praising the \"exploding tricky band sound\", calling the song \"full of thrills and excitement, like looking at something you shouldn't be\".[24] What's In? reviewers called the song a \"wild rock tune\", noting its \"bewildering structure\".[25]\n",
         "What's In? reviewers noted how varied the musical styles of the three songs on the single were.[25] Of the B-sides, reviewers praised the sentimentality in \"Pinocchio\", with Hiraga likening it to \"Gamble\" from Sheena's soundtrack album Heisei Fūzoku (2007).[22][24] CDJournal reviewers praised the mix of \"a self-backed piano style with a country taste\" in the song.[23] Saito felt that \"Kaban no Nakami\" had a \"slightly '60s taste\", while CDJournal called \"Kaban no Nakami\" an \"old taste pop tune,\" and a honky-tonk piano and guitar song \"as if [Sheena] were performing it in the corner of a southern US bar\", and praised Sheena's lyrics as \"cute\".[23][24]\n"
      ]
   },
   "Music video": {
      "text": [
         "A music video was first unveiled on June 18, 2007. It was directed by Yuichi Kodama, the first time Sheena or the band has worked with him, and also featured a collaboration with dance troupe Idevian Crew.[17][18] The video focuses on four female dancers, as well as the members of Tokyo Jihen in police uniforms. Sheena sings the song into a megaphone, while wearing a white dress and occasionally a police-style peaked cap. The video was nominated for the Best Video of the Year award at the 2008 MTV Video Music Awards Japan,[19] however lost to Exile's \"I Believe\".\n",
         "Three edits of the video exist. In addition to the original version, a version centring on the band, as well as a version centred on Idevian Crew dancers exist. These three versions were compiled on the Senkō Shōjo music video DVD, released on November 21, 2007.\n"
      ]
   },
   "Personnel": {
      "text": [
         "Personnel details were sourced from \"OSCA\"'s liner notes booklet.[26]\n",
         "\n",
         "\n"
      ]
   },
   "Promotion and release": {
      "text": [
         "The band appeared in magazines Musica, Rockin' On Japan, Oricon Style, Barfout! and GyaO Magazine to promote the release, as well as having special features on websites such as MSN Music, Listenjapan, What's In? Web, Excite, Yahoo! and Amazon.co.jp.[14] The song was performed during the band's Spa & Treatment (2007), Ultra C (2010), Discovery (2011) and Bon Voyage (2012) tours, with the band also performing the song during their festival/event performances at the Rising Sun Rock Festival (2008), Society of the Citizens Vol. 2 (2008), Countdown Japan (2009), EMI Rocks (2010) and the Terebi Asahi Dream Music Festival (2011).[15][16] Additionally, the two B-sides \"Pinnochio\" and \"Kaban no Nakami\" were performed during the Spa & Treatment tour, with \"Pinocchio\" also making the set-list for the band's Rising Sun Rock Festival performance.[15]\n",
         "Soon after the release of the single, the band began promotions for \"Killer-tune\", which was released as a single a month after, and the Variety album, which was released on September 26, 2007.\n"
      ]
   },
   "References": {},
   "Release history": {},
   "Sections": [
      "1 Background and development",
      "2 Writing and production",
      "3 Promotion and release",
      "4 Music video",
      "5 Critical reception",
      "6 Track listing",
      "7 Personnel",
      "8 Chart rankings",
      "8.1 Sales",
      "9 Release history",
      "10 References"
   ],
   "Summary": {
      "text": [
         "\"OSCA\" is a song by Japanese rock band Tokyo Jihen, led by musician Ringo Sheena. It was released as the band's fourth single on July 11, 2007, as one of the two singles before the band's third album Variety (2007).[1] It was the first and only single released by the band that did not feature writing by vocalist Sheena, instead created by the band's second guitarist, Ukigumo.\n"
      ]
   },
   "Title": "OSCA (song) - Wikipedia",
   "Track listing": {},
   "Writing and production": {
      "text": [
         "\"OSCA\" was written in spring/autumn 2006, by band guitarist Ukigumo. Unlike previous songs written by band members such as \"Gunjō Biyori\" or \"Tōmei Ningen\", the song did not have lyrical input by Sheena. Ukigumo wanted to pull out new sides of Sheena not seen before in her musical releases.[6] The title stems from the Italian O.S.C.A. brand of sports cars, as Ukigumo, a big fan of cars, wanted a song titled after one.[6] He was further inspired by the character Oscar François de Jarjayes from the 1970s manga Rose of Versailles, liking the dramatic image linked to the name Oscar. Ukigumo wrote the lyrics about a womanizer.[6] Unlike \"Oiran\" from Sheena's Heisei Fūzoku or \"Mirror-ball\" from Variety, \"OSCA\" did not change much conceptually since Ukigumo wrote the song. Ukigumo also did not think that the sound would become a single, however it was popular with the other band members, who voted on which of the Variety songs would become singles.[6]\n",
         "While written for Tokyo Jihen, the song was originally performed by Ukigumo as a member of his band Petrolz. It appears on Petrolz' extended play Karimen, released in April 2007 at live events.[8]\n[9] The band continued to perform \"OSCA\", as well as \"Mirror-ball\", at live events even after Tokyo Jihen's disbandment in 2012.[10][11][12]\n",
         "The Variety sessions was in pre-production while Sheena was promoting Heisei Fūzoku in February 2007. She felt that the recording session reminded her of recording her debut album Muzai Moratorium (1998), in that she was free from considering the commercial music market when producing the songs.[6]\n",
         "The two B-sides are both Izawa compositions, chosen from a collection of his demos. \"Kaban no Nakami\" was written after the band finished their Domestic! Just Can't Help It. tour in mid 2006, while \"Pinocchio\" was recorded in the last half of that year.[6] \"Pinocchio\" was written and composed entirely by Izawa, while \"Kaban no Nakami\" featured lyrics written by Sheena, translated into English by Robbie Clark.\n",
         "The single is stylistically similar to their next single \"Killer-tune\", released a month later. \"OSCA\" features an A-side written by Ukigumo and two Izawa compositions, while \"Killer-tune\" was written by Izawa and featured two Ukigumo compisitons as B-sides. In both cases, the final track is a song where Sheena collaborated with Robbie Clark to create a song with English lyrics. Neither release featured a cover song, unlike Tokyo Jihen's first three singles. The official English title for the song was stylised differently as \"O.S.C.A.\", a style also found on the Petrolz extended play Karimen.[1] The B-side \"Kaban no Nakami\" was given an entirely new title unrelated to the original title, \"Crosswalk\".[1]\n",
         "According to the musical score of \"OSCA\", it is written in the key of E major in common time with a tempo of 130 beats per minute. The track follows the chord progression of E7–A7 in the introduction, which changes to A7–C♯7–D7–C7–F7 at the end of the second verse.[13]\n"
      ]
   }
}