{
   "Band history": {
      "17 Reasons": {
         "text": [
            "Recorded in 1996, Link 80 had released their first full-length album titled 17 Reasons, in early 1997. The album consisted of 17 fast and energetic punk rock and skacore songs (and one hidden track, a cover of \"Who Killed Marilyn?\" by Misfits). It was also the first album recorded for Asian Man Records (AMR1-AMR4 were originally released on Dill Records). \n",
            "The album title and a song title (\"Turn It Around\") come from two of the band's favorite local Bay Area punk rock compilations: Turn It Around! and 17 Reasons: The Mission District. Their only official music video was off this album for the song \"Verbal Kint.\" The video was partially filmed at 924 Gilman Street and directed by Scott Pourroy. \n",
            "In 1996, with all the members still in high school, the band left for their first U.S. tour. On this tour, the band created their own \"crew,\" known as ATRC, or Against the Rest Crew.\n",
            "The core line-up for these definitive years was Nick Traina (vocals), Joey Bustos (drums), Matt Bettinelli-Olpin (guitar, vocals), Adam Pereira (bass, vocals) and Aaron Nagel (trumpet). Though he was not present on the recording of 17 Reasons, Jason Lechner (saxophone) joined the band in time to support it at shows and on tour.  This line-up would release the first and second of their three albums.\n",
            "Unlike many bands, each member of Link 80 were an integral part of the songwriting team. With Aaron in charge of the horn lines, Joey, Adam and Matt were behind most songs' core-music, while Nick and Matt were responsible for the lyrics. In addition, everyone participated in background vocals, occasionally even singing lead. For example, Adam sings a majority of \"Termination\" and \"Slap,\" while Matt provides the lead vocals on \"Turn It Around.\"\n",
            "The following year Link 80 was on to its second US tour. Beginning in Oregon on June 14, the tour was cut short after a show at the Globe in Milwaukee, Wisconsin on August 1. The following morning the band went their separate ways, with some members flying home, some driving, and some taking a train.[3]\n"
         ]
      },
      "Killing Katie": {
         "text": [
            "Link 80's last album with Nick, Matt and Seth Blankenship, Killing Katie, was released August 26, 1997, less than one month before Nick's death. The album contains 8 studio tracks and 3 hidden live songs, including the long-time crowd pleaser \"Blank Mind\" (of which there is no studio version). Of the four hidden tracks, the first is a cover of Buffalo Springfield's \"For What It's Worth,\" referred to as \"Everybody Look What's Going Down\" by the band.\n",
            "After Link 80, Nick started a new band,  Knowledge, and immediately began playing shows and recording. Shortly thereafter, on September 20, 1997, Nick, who suffered from bipolar disorder, overdosed on his fourth suicide attempt, and was found dead by his caretaker at his home.[4]\n"
         ]
      },
      "Reunion": {
         "text": [
            "After a few partial reunions over the years, the band's first official reunion was for the Asian Man Records 20th Anniversary shows on June 17 and 18, 2016. Both shows (at the San Francisco's Bottom of the Hill) were sold out.\n",
            "The lineup included singer Ryan Noble, guitarists Matt Bettinelli-Olpin and Adam Davis, drummer Joey Bustos, bassists Adam Pereria and Barry Krippene, and horn players Aaron Nagel, Steve Borth and Jason Lechner. Many of the band members brought their kids to the truly epic show.[5]\n",
            "Prior to the shows, a video tribute to Nick Traina was shown with Social Distortion's \"When the Angels Sing\" playing over the video. The band released the video online on June 20, 2016. [6]\n"
         ]
      },
      "The Struggle Continues": {
         "text": [
            "With Nick gone, Link 80 needed someone to fill in on vocals.\n",
            "After recruiting a man named Stoney Moak to fill in for vocals temporarily for their shows, Ryan Noble from the Blast Bandits was chosen to pick up permanently where Nick had left off. Along with Ryan and Adam Davis, who took over for Matt, came a new sound and lyrics, while still maintaining the \"against the rest\" attitude. Link 80 began to lead more towards a hardcore/ska sound rather than a punk/ska sound. With Ryan, Link 80 recorded the album The Struggle Continues as well as some b-sides that appeared on various compilations in 1999 and toured numerous times with such bands as Capdown and MU330.\n",
            "The last track on The Struggle Continues, \"Unbroken\", was written by ex-guitarist Matt for Nick after his death.\n"
         ]
      },
      "text": [
         "Link 80 started in the summer 1993 in the East Bay of California. In the beginning, original members (guitarist Matt Bettinelli-Olpin, drummer Joey Bustos, bassist Adam Pereira and singer Jeff Acree) played around town as Drano and The Rag-Tags before settling on Link 80.[1]\n",
         "The name came from the interstate highway I-80 which they used to get to the drummer's garage for band practice and connected the band members' homes: members lived in Oakland, Berkeley and Richmond.\n",
         "In May 1995, Nick Traina joined the band after meeting Adam at a show in San Francisco's Mission District. Nick's passion and voice combined with the rest of the band to make them different from most ska bands and gave Link 80 the \"against the rest\" attitude they display throughout their lyrics. Far more punk than ska and with an energy and a sense of immediacy lacking in pop-oriented ska bands, Link 80 was able to avoid the clichés of ska-punk characterized by their peers. As Asian Man Records describes them, they are an energetic blend of ska, punk rock, and hardcore.\n",
         "The band's lyrics, audio samples and album artwork are notable for their diverse use of film and television references including The Twilight Zone, The Usual Suspects, American Me, Happy Gilmore, Stand by Me, Pretty In Pink and I Walked with a Zombie.[2]\n"
      ]
   },
   "Discography": {
      "Compilations": {},
      "EPs": {},
      "LPs": {}
   },
   "External links": {},
   "Members": {
      "text": [
         "\n",
         "\n",
         "Timeline\n"
      ]
   },
   "References": {},
   "Related bands and projects": {
      "text": [
         "In 2002, the band consisting of Seth Blankenship, Adam Davis, Aaron Nagel, Steve Borth, Joey Bustos, Barry Krippene, and singer Ryan Noble went on hiatus. Steve Borth would join Rx Bandits, before forming his own band Satori in 2006.  The remaining Link 80 members would form DESA. They have since maintained that Link 80 would return, but for now they are focused on their respective projects.\n",
         "Joey and Ryan are currently in The Soft White Sixties (playing drums and bass, respectively). Matt formed a band called Dolores (with Nick's brother Todd Traina) that released on 7\" on Johann's Face Records, founded the filmmaking collectives Chad, Matt & Rob and Radio Silence and directed the films V/H/S, Southbound, and Ready or Not (all of which feature Link 80 and other Asian Man Records artists including Alkaline Trio, MU330, Laura Stevenson and the Cans and The Atom Age). Aaron is now a successful artist who runs Two Twenty Two Design Studio and whose work has been feature in galleries around the world and can be seen on the covers of The Resignation and ...And the Battle Begun. Adam Davis is currently in Gnarboots which has released their album A.L.B.U.M. on Asian man Records.  Barry is in a band called Terrible Timing with a former member of the Blast Bandits. Adam Pereria played with Thought Crime after leaving Link 80. Nick Traina started Knowledge before his death in 1997. Their album, A Gift Before I Go, was subsequently released by Asian Man Records. As of 2019, Steve Borth and Adam Davis are a part of a new ska/punk project, Omnigone and will be releasing an album on Bad Time Records this year. The band also features current and former members of RX Bandits, Link 80, Skatune Network and We Are The Union. Adam Davis stated: \"The idea behind OMNIGONE: I want to play ska, punk & hardcore. Playing with Link 80 in 2016 was bittersweet. I miss playing music with my ex-bandmates, but there was too much involved to expect us to play shows again. This allows different configurations of my close friends to come together & play the music we grew up playing.\" [7]\n"
      ]
   },
   "Sections": [
      "1 Band history",
      "1.1 17 Reasons",
      "1.2 Killing Katie",
      "1.3 The Struggle Continues",
      "1.4 Reunion",
      "2 Related bands and projects",
      "3 Members",
      "4 Discography",
      "4.1 LPs",
      "4.2 EPs",
      "4.3 Compilations",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Link 80 was an American punk rock/ska punk band from San Francisco's East Bay, United States.\n"
      ]
   },
   "Title": "Link 80 - Wikipedia"
}