{
   "Name": "Season Sayonara",
   "rawData": [
      "\"Season Sayonara\" (シーズンサヨナラ, Shīzun Sayonara, \"Season Farewell\"), stylised in English as \"Season SAYONARA\", is a song by Japanese rock band Tokyo Jihen, led by musician Ringo Sheena. It was one of the promotional songs for the band's fourth album Sports, released on February 24, 2010.\n",
      "In 2009, Tokyo Jihen released the single \"Nōdōteki Sanpunkan\", which was their first song to feature in commercials for Ezaki Glico's \nWatering Kissmint brand of gum. The Sports album was first announced on December 15, 2009. The first promotional song from the album was \"Kachi Ikusa\", released on January 16, 2010, and used in Watering Kissmint commercials.\n",
      "Guitarist Ukigumo had previously written songs for the band's Variety album in 2007, most notably the single \"OSCA\". While vocalist Ringo Sheena typically either composed or wrote lyrics for Tokyo Jihen songs, \"Season Sayonara\" is an example of a song written entirely by Ukigumo.\n"
   ],
   "infobox": {
      "Released": [
         "February 8, 2010 (2010-02-08)"
      ],
      "Recorded": [
         "2009"
      ],
      "Genre": [
         "Alternative rock"
      ],
      "Length": [
         "3:38"
      ],
      "Label": [
         "EMI Music Japan"
      ],
      "Songwriter(s)": [
         "Ukigumo"
      ]
   },
   "prunedData": [
      "\"[BAND_NAME]\" (シーズンサヨナラ, Shīzun Sayonara, \"Season Farewell\"), stylised in English as \"Season SAYONARA\", is a [GENRE] band Tokyo Jihen, led by musician Ringo Sheena. It was one of the promotional songs for the band's fourth album Sports, released on [MONTH] 24, [YEAR].\n",
      "In [YEAR], Tokyo Jihen released the single \"Nōdōteki Sanpunkan\", which was their first song to feature in commercials for Ezaki Glico's \nWatering Kissmint brand of gum. The Sports album was first announced on [MONTH] 15, [YEAR]. The first promotional song from the album was \"Kachi Ikusa\", released on [MONTH] 16, [YEAR], and used in Watering Kissmint commercials.\n",
      "Guitarist Ukigumo had previously written songs for the band's Variety album in [YEAR], most notably the single \"OSCA\". While vocalist Ringo Sheena typically either composed or wrote lyrics for Tokyo Jihen songs, \"[BAND_NAME]\" is an [GENRE] a song written entirely by Ukigumo.\n"
   ]
}