{
   "Name": "Live Tour 2005 \"Dynamite!\"",
   "rawData": [
      "Live Tour 2005 \"Dynamite!\" is the first concert tour by Japanese band Tokyo Jihen. The tour supported the band's debut studio album, Kyōiku (2004). It was the only tour to feature the band's original members Mikio Hirama and H Zetto M. The concert was released in the form of two video albums, a documentary, Dynamite In, on July 13, 2005, and a concert video, Dynamite Out, released on August 17, 2005.\n",
      "After the release of vocalist Ringo Sheena's third album, Kalk Samen Kuri no Hana in 2003, Sheena embarked on a nationwide tour entitled Sugoroku Ecstasy. Sheena asked the backing members well in advance to perform for the tour, so that her first choices would not be double-booked. These members were dubbed Tokyo Jihen, a name that was publicised during the tour. During the tour, the song \"Ringo no Uta\" was briefly performed, which was released as a single by Sheena on November 25, 2003. Tokyo Jihen was officially announced as Sheena's main musical unit on May 31, 2004, and first performed at a series of summer music festivals: 0724 Yamabikari at Kobe Chicken George on July 24, Meet the World Beat on July 25, 2004 in Suita, Osaka, the Fuji Rock Festival in Niigata Prefecture on July 30 and the SunSet Live 2004 festival in Fukuoka Prefecture on September 3.\n",
      "The concert tour was first announced in September 2004, before the release of the band's first single, \"Gunjō Biyori\". The band released a second single in October, \"Sōnan\", followed by their full-length album Kyōiku in December.\n"
   ],
   "infobox": {
      "Associated album": [
         "Kyōiku"
      ],
      "Start date": [
         "January 17, 2005"
      ],
      "End date": [
         "February 16, 2005"
      ],
      "Legs": [
         "1"
      ],
      "No. of shows": [
         "14"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is the first concert tour by Japanese band Tokyo Jihen. The tour supported the band's debut studio album, Kyōiku ([YEAR]). It was the only tour to feature the band's original members [PERSON_NAME_FULL_0_MALE] and H Zetto M. The concert was released in the form of two video albums, a documentary, Dynamite In, on [MONTH] 13, [YEAR], and a concert video, Dynamite Out, released on [MONTH] 17, [YEAR].\n",
      "After the release of vocalist [PERSON_NAME_FULL_0_MALE]'s third album, Kalk Samen Kuri no Hana in [YEAR], [PERSON_NAME_LAST_0] embarked on a nationwide tour entitled Sugoroku Ecstasy. [PERSON_NAME_LAST_0] asked the backing members well in advance to perform for the tour, so that her first choices would not be double-booked. These members were dubbed Tokyo Jihen, a name that was publicised during the tour. During the tour, the song [SONG_NAME] was briefly performed, which was released as a single by [PERSON_NAME_LAST_0] on [MONTH] 25, [YEAR]. Tokyo Jihen was officially announced as [PERSON_NAME_LAST_0]'s main musical unit on [MONTH] 31, [YEAR], and first performed at a series of summer music festivals: [YEAR] Yamabikari at Kobe Chicken George on [MONTH] 24, Meet the World Beat on [MONTH] 25, [YEAR] in Suita, Osaka, the Fuji Rock Festival in Niigata Prefecture on [MONTH] 30 and the SunSet Live [YEAR] festival in Fukuoka Prefecture on [MONTH] 3.\n",
      "The concert tour was first announced in [MONTH] [YEAR], before the release of the band's first single, [SONG_NAME], followed by their full-length album Kyōiku in [MONTH].\n"
   ]
}