{
   "Name": "Domestic! Virgin Line",
   "Sections": [
      "1 Background",
      "2 Concert synopsis",
      "3 Recordings",
      "4 Promotion",
      "5 Set list",
      "6 Tour dates",
      "7 Personnel",
      "8 Notes"
   ],
   "Summary": {
      "text": [
         "Domestic! Virgin Line (stylised as DOMESTIC! Virgin LINE) is a brief concert tour by Japanese band Tokyo Jihen. The tour was the first of two to support their second album, Adult (2006). Unlike most of the band's tours, a video album was never produced, however a Fuji Television program called Tokyo Jihen Live in Nippon Budokan was produced to showcase the performance.\n"
      ]
   },
   "Background": {
      "text": [
         "Tokyo Jihen was first formed in 2003, after Ringo Sheena decided on members for her backing band for her Sugoroku Ecstasy tour.[1] The band was officially announced as Sheena's main musical unit on May 31, 2004.[2][3] This was followed by their debut album Kyōiku in November 2004, and a 14 date Japan-wide tour entitled Dynamite!.[4]\n",
         "After the Dynamite! tour, two of the original members of the band made decisions to leave. Pianist H Zetto M left to focus on his activities with jazz ensemble Pe'z, while guitarist Mikio Hirama left to focus on his activities as a solo musician.[5] Sheena sought new members to replace them, and asked pianist Ichiyo Izawa, who she had known since 2004, and Ryosuke Nagaoka, a guitarist Sheena had met through her brother Junpei Shiina who often collaborated on her demo takes.[6] The band began to record their second album Adult in July 2005.[6]\n",
         "The Domestic! Virgin Line concerts were first announced on September 27, 2005.[7] The first release with the new line-up was a single in November 2005, \"Shuraba\", followed by the release of Adult on January 25, 2006. The new line-up was featured on an episode of Music Station on November 2 to perform \"Shuraba\".[8] They performed at a series of fan-club events in December 2005, entitled Dai Ikkai Ringo-han Taikai: Adults Only. Domestic! Virgin Line was organised to test how the audience would respond to the two new members, and to introduce them properly.[9] A month and a half later, the band performed a full-length tour to promote Adult called Domestic! Just Can't Help It., where the band performed 21 dates in April and May 2006.\n"
      ]
   },
   "Concert synopsis": {
      "text": [
         "The concerts began with \"Sōretsu\", the final song from Sheena's third album Kalk Samen Kuri no Hana, backed with a 60 member chorus of elementary school age girls, Suginami Junior Chorus, wearing sailor suits and rabbit ears. The choir stay for the second song, \"Gunjō Biyori\", which was performed in a slow tempo, laid-back style. For the performance of \"Kabuki\", Sheena sung it into a megaphone, while the lyrics were displayed in a light show behind the band. For \"Service\", all members stood at the front of the stage with megaphones, while performing a dance routine. The members picked up hand-held instruments for \"Bokoku Jōcho\", including a marching drum for Hata and a melodica for Izawa, and walked in file around the stage, close to the audience. An instrumental section of the song included the melody of Sheena's debut song \"Kōfukuron\".[9][10]\n"
      ]
   },
   "Recordings": {
      "text": [
         "The February 19 performance at the Nippon Budokan was recorded, broadcast on a Fuji Television program Tokyo Jihen Live in Nippon Budokan on March 25, 2006. The program featured a selection of 12 of the 18 performed songs, interspersed with interviews with the band members and rehearsal footage.[9] The songs cut from the broadcast were \"Bokoku Jōcho\", \"Kyogen-shō\", \"Marunouchi Sadistic\", \"Rakujitsu\", \"Shuraba\" and \"Super Star\".[9]\n",
         "On August 29, 2012, a live history video album was released called Chin Play Kō Play, featuring performances from throughout the band's career. Four recordings from Domestic! Virgin Line were present: the opening number \"Sōretsu\" as well as the previously unbroadcast \"Kyogen-shō\", \"Bokoku Jōcho\" and \"Rakujitsu\".[11]\n"
      ]
   },
   "Promotion": {
      "text": [
         "A vast number of music journalists were invited to the Tokyo concert to publish reviews. Concert reports were featured in 13 print magazines and three websites, including Oricon Style, CD Data, What's In and Pia.[12] After the initial broadcast of Tokyo Jihen Live in Nippon Budokan on March 25, Fuji Television rebroadcast the program on April 11 and 23.[13]\n"
      ]
   },
   "Set list": {},
   "Tour dates": {},
   "Personnel": {
      "text": [
         "Personnel details were sourced from the Tokyo Jihen Live in Nippon Budokan television program credits.[9]\n"
      ]
   },
   "Notes": {},
   "coreData": [
      "Domestic! Virgin Line (stylised as DOMESTIC! Virgin LINE) is a brief concert tour by Japanese band Tokyo Jihen. The tour was the first of two to support their second album, Adult (2006). Unlike most of the band's tours, a video album was never produced, however a Fuji Television program called Tokyo Jihen Live in Nippon Budokan was produced to showcase the performance.\n",
      "Tokyo Jihen was first formed in 2003, after Ringo Sheena decided on members for her backing band for her Sugoroku Ecstasy tour.[1] The band was officially announced as Sheena's main musical unit on May 31, 2004.[2][3] This was followed by their debut album Kyōiku in November 2004, and a 14 date Japan-wide tour entitled Dynamite!.[4]\n",
      "After the Dynamite! tour, two of the original members of the band made decisions to leave. Pianist H Zetto M left to focus on his activities with jazz ensemble Pe'z, while guitarist Mikio Hirama left to focus on his activities as a solo musician.[5] Sheena sought new members to replace them, and asked pianist Ichiyo Izawa, who she had known since 2004, and Ryosuke Nagaoka, a guitarist Sheena had met through her brother Junpei Shiina who often collaborated on her demo takes.[6] The band began to record their second album Adult in July 2005.[6]\n",
      "The Domestic! Virgin Line concerts were first announced on September 27, 2005.[7] The first release with the new line-up was a single in November 2005, \"Shuraba\", followed by the release of Adult on January 25, 2006. The new line-up was featured on an episode of Music Station on November 2 to perform \"Shuraba\".[8] They performed at a series of fan-club events in December 2005, entitled Dai Ikkai Ringo-han Taikai: Adults Only. Domestic! Virgin Line was organised to test how the audience would respond to the two new members, and to introduce them properly.[9] A month and a half later, the band performed a full-length tour to promote Adult called Domestic! Just Can't Help It., where the band performed 21 dates in April and May 2006.\n"
   ],
   "infobox": {
      "Associated album": [
         "Adult"
      ],
      "Start date": [
         "February 19, 2006"
      ],
      "End date": [
         "February 21, 2006"
      ],
      "Legs": [
         "1"
      ],
      "No. of shows": [
         "2"
      ]
   }
}