{
   "Name": "List of songs recorded by Tokyo Jihen",
   "rawData": [
      "Japanese band Tokyo Jihen (2004–2012) recorded material for five studio albums and one extended play, including songs for several compilation albums and singles. The band formed after Japanese singer-songwriter Ringo Sheena formed a band in 2004, but first collaborated with the members in 2003, performing with her on her Sugoroku Ecstasy tour. The original line-up included bassist and producer Seiji Kameda, drummer Toshiki Hata, Jazz band Pe'z pianist Masayuki Hiizumi and guitarist Mikio Hirama.\n",
      "After the band's debut album Kyōiku (2004), Hiizumi and Hirama left the band's line-up, and in 2005 were replaced by Appa pianist Ichiyo Izawa and guitarist Ukigumo, previous Sheena collaborator and member of the band Petrolz. This line-up remained consistent until Tokyo Jihen's break-up in 2012.\n",
      "While Sheena acted as the primary songwriter, the band performed songs written by all the band members. Variety (2007) was an album that primarily featured songs composed by Izawa and Ukigumo, and Color Bars (2012) featured five songs, one written by each band member.\n"
   ],
   "infobox": {},
   "albums": [],
   "prunedData": [
      "Japanese band Tokyo Jihen ([YEAR]–[YEAR]) recorded material for five studio albums and one extended play, including songs for several compilation albums and singles. The band formed after Japanese singer-songwriter Ringo Sheena formed a band in [YEAR], but first collaborated with the members in [YEAR], performing with her on her Sugoroku Ecstasy tour. The original line-up included bassist and producer [PERSON_NAME_FULL_2_MALE], drummer [PERSON_NAME_FULL_3_MALE], Jazz band Pe'z pianist [PERSON_NAME_FULL_1_MALE] and guitarist [PERSON_NAME_FULL_0_MALE].\n",
      "After the band's debut album Kyōiku ([YEAR]), Hiizumi and Hirama left the band's line-up, and in [YEAR] were replaced by Appa pianist Ichiyo Izawa and guitarist Ukigumo, previous Sheena collaborator and member of the band Petrolz. This line-up remained consistent until Tokyo Jihen's break-up in [YEAR].\n",
      "While Sheena acted as the primary songwriter, the band performed songs written by all the band members. Variety ([YEAR]) was an album that primarily featured songs composed by Izawa and Ukigumo, and Color Bars ([YEAR]) featured five songs, one written by each band member.\n"
   ]
}