{
   "Name": "The Loading Zone",
   "Sections": [
      "1 Career",
      "2 Discography",
      "2.1 Albums",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "\nThe Loading Zone[1] was an American rock band of the late 1960s and early 1970s.  They issued two albums worth of material, with differing band lineups, before disbanding in 1971.\n"
      ]
   },
   "Career": {
      "text": [
         "They were formed in Berkeley, California in 1966 by singer-keyboardist Paul Fauerso, following the dissolution of his jazz group The Tom Paul Trio. The original lineup was Fauerso, bassist Bob Kridle, drummer Ted Kozlowski (replaced by George Newcom), and guitarists Peter Shapiro and Steve Dowler,[2] both formerly of Berkeley psychedelic rock band The Marbles, who had supported Jefferson Airplane at the historic \"Tribute to Dr. Strange\", the inaugural Family Dog promotion concert held at San Francisco's Longshoreman's Hall in October 1965.\n",
         "The Loading Zone's first major concert was the Trips Festival at the Longshoreman's Hall in January 1966.[3] Although primarily an R&B band, The Loading Zone added contemporary psychedelic influences and soon became a popular attraction on the burgeoning Bay Area music scene. The Loading Zone was based at the Berkeley venue The New Orleans House, but performed numerous times at major venues including the Fillmore West.\n",
         "Although The Loading Zone occasionally headlined, the group is better known for supporting some of the biggest acts of the period including Cream, The Who, The Byrds, Big Brother & the Holding Company, Grateful Dead, Howlin' Wolf, Sam & Dave, Chuck Berry and Buddy Miles.[4][3]\n",
         "In 1967 the band placed an advertisement in the San Francisco Chronicle seeking a new lead vocalist, which led to the recruitment of Linda Tillery, who joined just prior to the band's signing with RCA Records. Despite their live popularity, the group lacked a strong base of original material; their self-titled debut album was poorly received, and was criticised for its excessive production and its reliance on cover versions. The Loading Zone was unable to garner support from radio, and eventually split in 1969.[5]\n",
         "In 1969, Fauerso  re-formed the group with new members- guitarist Steve Busfield, bassist Mike Eggleston, and drummer George Marsh, and initially with previous horn players Todd Anderson (tenor sax) and Patrick O'Hara (trombone). Anderson was replaced after a few months by Ron Taormina. The new Zone also recruited old friend and drummer Frank Davis to play with the group for a while. During this brief period, the band performed with two drummers at the same time - Davis and Marsh - with some exciting results. The band recorded their second LP One for All for their own label, Umbrella, before disbanding in 1971.\n",
         "Tillery released her solo debut album Sweet Linda Divine on CBS Records in 1970. It was produced by Al Kooper of Blood, Sweat and Tears fame. Fauerso went on to produce the unreleased Mike Love solo album First Love and more recently, a second entitled Only One Earth. Fauerso went on to make recordings of new-age music and also to compose and produce award-winning commercials for radio and TV. Tillery resurfaced with the jazz fusion group Cesar 830 before embarking on a solo career.\n",
         "In 2005, Fauerso reconnected with Eggleston and Marsh to record a new Loading Zone CD entitled Blue Flame. The album contained five new tracks and three cuts from the second Zone album, One For All.\n",
         "George Newcom died from a heart attack on July 1, 2010, in Red Bluff, California. He was 63 years old.[6] Trombonist Pat O'Hara later worked with Buddy Miles on Cold Blood and others, and died in the late 1970s or early 1980s.\n"
      ]
   },
   "Discography": {
      "Albums": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "\nThe Loading Zone[1] was an American rock band of the late 1960s and early 1970s.  They issued two albums worth of material, with differing band lineups, before disbanding in 1971.\n",
      "They were formed in Berkeley, California in 1966 by singer-keyboardist Paul Fauerso, following the dissolution of his jazz group The Tom Paul Trio. The original lineup was Fauerso, bassist Bob Kridle, drummer Ted Kozlowski (replaced by George Newcom), and guitarists Peter Shapiro and Steve Dowler,[2] both formerly of Berkeley psychedelic rock band The Marbles, who had supported Jefferson Airplane at the historic \"Tribute to Dr. Strange\", the inaugural Family Dog promotion concert held at San Francisco's Longshoreman's Hall in October 1965.\n",
      "The Loading Zone's first major concert was the Trips Festival at the Longshoreman's Hall in January 1966.[3] Although primarily an R&B band, The Loading Zone added contemporary psychedelic influences and soon became a popular attraction on the burgeoning Bay Area music scene. The Loading Zone was based at the Berkeley venue The New Orleans House, but performed numerous times at major venues including the Fillmore West.\n",
      "Although The Loading Zone occasionally headlined, the group is better known for supporting some of the biggest acts of the period including Cream, The Who, The Byrds, Big Brother & the Holding Company, Grateful Dead, Howlin' Wolf, Sam & Dave, Chuck Berry and Buddy Miles.[4][3]\n"
   ]
}