{
   "Name": "The Loading Zone",
   "rawData": [
      "\nThe Loading Zone was an American rock band of the late 1960s and early 1970s.  They issued two albums worth of material, with differing band lineups, before disbanding in 1971.\n",
      "They were formed in Berkeley, California in 1966 by singer-keyboardist Paul Fauerso, following the dissolution of his jazz group The Tom Paul Trio. The original lineup was Fauerso, bassist Bob Kridle, drummer Ted Kozlowski (replaced by George Newcom), and guitarists Peter Shapiro and Steve Dowler, both formerly of Berkeley psychedelic rock band The Marbles, who had supported Jefferson Airplane at the historic \"Tribute to Dr. Strange\", the inaugural Family Dog promotion concert held at San Francisco's Longshoreman's Hall in October 1965.\n",
      "The Loading Zone's first major concert was the Trips Festival at the Longshoreman's Hall in January 1966. Although primarily an R&B band, The Loading Zone added contemporary psychedelic influences and soon became a popular attraction on the burgeoning Bay Area music scene. The Loading Zone was based at the Berkeley venue The New Orleans House, but performed numerous times at major venues including the Fillmore West.\n"
   ],
   "infobox": {},
   "albums": [
      "The Loading Zone",
      " One for All"
   ],
   "prunedData": [
      "\n[BAND_NAME] was an [GENRE] band of the late [YEAR]s and early [YEAR]s.  They issued two albums worth of material, with differing band lineups, before disbanding in [YEAR].\n",
      "They were formed in Berkeley, California in [YEAR] by singer-keyboardist Paul Fauerso, following the dissolution of his jazz group The Tom Paul Trio. The original lineup was Fauerso, bassist [PERSON_NAME_FULL_0_MALE], drummer Ted Kozlowski (replaced by [PERSON_NAME_FULL_1_MALE]), and guitarists Peter Shapiro and [PERSON_NAME_FULL_2_MALE], both formerly of Berkeley psychedelic rock band The [MONTH]bles, who had supported Jefferson Airplane at the historic [SONG_NAME], the inaugural Family Dog promotion concert held at San Francisco's Longshoreman's Hall in [MONTH] [YEAR].\n",
      "[BAND_NAME]'s first major concert was the Trips Festival at the Longshoreman's Hall in [MONTH] [YEAR]. Although primarily an [GENRE] band, [BAND_NAME] added contemporary psychedelic influences and soon became a popular attraction on the burgeoning Bay Area music scene. [BAND_NAME] was based at the Berkeley venue The New Orleans House, but performed numerous times at major venues including the Fillmore West.\n"
   ]
}