{
   "Name": "Antònia Font",
   "rawData": [
      "Antònia Font (Catalan pronunciation: ) was a Majorcan band, formed in 1997. They are characterized by their festive music and their humorous and fantastic lyrics. The group's creative universe includes elements such as outer space and astronautics, combined with themes from everyday life. Their lyrics are written in the Catalan variant spoken in Mallorca. \nThey are generally classified as a pop group, though they have stated that they do not have any \"stylistic prejudices\" when composing songs.\n",
      "Joan Miquel Oliver, the group's guitarist, composed the songs. Oliver has also recorded solo albums and written for other groups, including Fora des Sembrat.\n",
      "On 28 November 2013, the band announced that they officially retired, leaving behind 16 years of musical career.\n"
   ],
   "infobox": {
      "Origin": [
         "Majorca"
      ],
      "Genres": [
         "Pop"
      ],
      "Years active": [
         "1997–2013 [1]"
      ],
      "Website": [
         "antoniafont.com/"
      ],
      "Members": [
         "Jaume Manresa (keyboards)",
         "Joan Miquel Oliver (guitar)",
         "Joan Roca (bass)",
         "Pau Debon (vocals)",
         "Pere Debon (drums)"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (Catalan pronunciation: ) was a [GENRE] band, formed in [YEAR]. They are characterized by their festive music and their humorous and fantastic lyrics. The group's creative universe includes elements such as outer space and astronautics, combined with themes from everyday life. Their lyrics are written in the Catalan variant spoken in Mallorca. \nThey are generally classified as a pop group, though they have stated that they do not have any \"stylistic prejudices\" when composing songs.\n",
      "Joan Miquel Oliver, the group's guitarist, composed the songs. Oliver has also recorded solo albums and written for other groups, including Fora des Sembrat.\n",
      "On 28 [MONTH] [YEAR], the band announced that they officially retired, leaving behind 16 years of musical career.\n"
   ]
}