{
   "Name": "Betagarri",
   "Sections": [
      "Summary"
   ],
   "Summary": {
      "text": [
         "Betagarri is a Spanish ska band from Vitoria-Gasteiz in the Basque Autonomous Community. It was formed in 1993, but it was not until February 1997 that they recorded their first album, Betagarri, with the Vitoria record company 'Mil A Gritos', who also produced their second work, Arren Erro Zaharra, a year later.\n",
         "The history of this group from Vitoria is a bit unlikely. Gontzo, Iñaki and Aitor colleagues were already accustomed to partying with the nom de guerre of Betagarri, but never imagined they would end up forming a group with this name. It all started when Gontzo won an electric guitar in a television contest. As Iñaki sang in a choir and Aitor used to play a Spanish guitar, they started playing some stuff and got to know more people.\n",
         "Two years after their first album in 1999, the band released the album Arren Erro Zaharra with 'Mil A Gritos' Records that was confirmation. Songs like Arren Erro Zaharra or Verde became hits. A year later the group published 80/00, a disc with versions of songs from other Basque groups between 1980 and 2000, in honor of those groups.\n",
         "After the disks Freaky Festa, Remix and RNase Hartu in 2004 released the live album with songs Zuzenena all previous records in CD + DVD.\nLater published discs and Bizitzari Txistuka Hamaika Gara, the latter being the slowest of the band.\n",
         "Whilst the band usually tour around Europe, they have also visited Japan, USA and Argentina.\n",
         "In 2007 they composed the song Araba Euskaraz of La Puebla de Arganzón called \"Garenaren Jostun\". And in 2009, they composed the official song of the Korrika whose motto was \"Ongi Etorri\".\n",
         "The line up has changed gradually over the years. During the recording of Arren Erro Zaharra Iker Uriarte entered as a drummer. Later, in 2004, Gonzalo left the band and was replaced by Aitor Aguirre, in the live album appears playing two songs as a farewell. For the recording Hamaika Iosu Gara joined on bass, participating with Paul, former bassist. In 2007 Aitor Ruiz de Arbulo announced his retirement at a concert in Arenal, Bilbao and playing the song goodbye sad Eskorbuto History.\n"
      ]
   },
   "coreData": [
      "Betagarri is a Spanish ska band from Vitoria-Gasteiz in the Basque Autonomous Community. It was formed in 1993, but it was not until February 1997 that they recorded their first album, Betagarri, with the Vitoria record company 'Mil A Gritos', who also produced their second work, Arren Erro Zaharra, a year later.\n",
      "The history of this group from Vitoria is a bit unlikely. Gontzo, Iñaki and Aitor colleagues were already accustomed to partying with the nom de guerre of Betagarri, but never imagined they would end up forming a group with this name. It all started when Gontzo won an electric guitar in a television contest. As Iñaki sang in a choir and Aitor used to play a Spanish guitar, they started playing some stuff and got to know more people.\n",
      "Two years after their first album in 1999, the band released the album Arren Erro Zaharra with 'Mil A Gritos' Records that was confirmation. Songs like Arren Erro Zaharra or Verde became hits. A year later the group published 80/00, a disc with versions of songs from other Basque groups between 1980 and 2000, in honor of those groups.\n",
      "After the disks Freaky Festa, Remix and RNase Hartu in 2004 released the live album with songs Zuzenena all previous records in CD + DVD.\nLater published discs and Bizitzari Txistuka Hamaika Gara, the latter being the slowest of the band.\n"
   ]
}