{
   "Name": "Betagarri",
   "rawData": [
      "Betagarri is a Spanish ska band from Vitoria-Gasteiz in the Basque Autonomous Community. It was formed in 1993, but it was not until February 1997 that they recorded their first album, Betagarri, with the Vitoria record company 'Mil A Gritos', who also produced their second work, Arren Erro Zaharra, a year later.\n",
      "The history of this group from Vitoria is a bit unlikely. Gontzo, Iñaki and Aitor colleagues were already accustomed to partying with the nom de guerre of Betagarri, but never imagined they would end up forming a group with this name. It all started when Gontzo won an electric guitar in a television contest. As Iñaki sang in a choir and Aitor used to play a Spanish guitar, they started playing some stuff and got to know more people.\n",
      "Two years after their first album in 1999, the band released the album Arren Erro Zaharra with 'Mil A Gritos' Records that was confirmation. Songs like Arren Erro Zaharra or Verde became hits. A year later the group published 80/00, a disc with versions of songs from other Basque groups between 1980 and 2000, in honor of those groups.\n"
   ],
   "infobox": {
      "Origin": [
         "Donostia,  Basque Autonomous Community, Spain"
      ],
      "Genres": [
         "Ska",
         "2 Tone",
         "Ska punk"
      ],
      "Years active": [
         "1993-2017"
      ],
      "Website": [
         "www.betagarri.com"
      ],
      "Members": [
         "Iñaki (voice)",
         "David (saxo)",
         "Aitor Agirre (guitar)",
         "Iker (drums)",
         "Mikel (trombone)",
         "Unai (trumpet)",
         "Iosu (bass)"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Vitoria-Gasteiz in the Basque Autonomous Community. It was formed in [YEAR], but it was not until [MONTH] [YEAR] that they recorded their first album, [BAND_NAME], with the Vitoria record company 'Mil A Gritos', who also produced their second work, Arren Erro Zaharra, a year later.\n",
      "The history of this group from Vitoria is a bit unlikely. Gontzo, Iñaki and Aitor colleagues were already accustomed to partying with the nom de guerre of [BAND_NAME], but never imagined they would end up forming a group with this name. It all started when Gontzo won an electric guitar in a television contest. As Iñaki sang in a choir and Aitor used to play a Spanish guitar, they started playing some stuff and got to know more people.\n",
      "Two years after their first album in [YEAR], the band released the album Arren Erro Zaharra with 'Mil A Gritos' Records that was confirmation. Songs like Arren Erro Zaharra or Verde became hits. A year later the group published 80/00, a disc with versions of songs from other Basque groups between [YEAR] and [YEAR], in honor of those groups.\n"
   ]
}