{
   "Name": "The Lookouts",
   "rawData": [
      "The Lookouts were an American punk rock band that existed from 1985 to 1990 on Iron Peak, a remote rural mountain community outside Laytonville, California, United States.  The members were Larry Livermore on guitar and vocals, Kain Kong (Kain Hanschke) on bass and vocals, and Tré Cool on drums and vocals.  All three contributed on songwriting.\n",
      "The band is most famous for being Tré Cool's first band before joining Green Day.\n",
      "Looking to start a punk band, Livermore had trouble finding members, citing the majority of the local musicians being hippies and \"completely uninterested in the music we wanted to make.\"  Eventually, Livermore recruited  14-year-old Kain Hanschke on bass and 12-year-old  Frank Edwin \"Tré\" Wright III on drums.  Although he had never before played drums, young Tré showed an instant affinity for them, likely because, as Livermore said, \"he loved making a lot of noise and getting everyone to look at him.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Iron Peak, California, U.S."
      ],
      "Genres": [
         "Punk rock"
      ],
      "Years active": [
         "1985–1990"
      ],
      "Labels": [
         "Lookout, Don Giovanni"
      ],
      "Associated acts": [
         "Green Day, The Potatomen"
      ],
      "Past members": [
         "Larry Livermore",
         "Kain Kong",
         "Tré Cool"
      ]
   },
   "albums": [
      "One Planet One People",
      "Spy Rock Road"
   ],
   "prunedData": [
      "[BAND_NAME] were an [GENRE] band that existed from [YEAR] to [YEAR] on Iron Peak, a remote rural mountain community outside Laytonville, California, United States.  The members were [PERSON_NAME_FULL_0_MALE] on guitar and vocals, Kain Kong (Kain Hanschke) on bass and vocals, and Tré Cool on drums and vocals.  All three contributed on songwriting.\n",
      "The band is most famous for being Tré Cool's first band before joining Green Day.\n",
      "Looking to start a [GENRE] band, Livermore had trouble finding members, citing the majority of the local musicians being hippies and [SONG_NAME]\n"
   ]
}