{
   "Name": "Chambao",
   "rawData": [
      "Chambao were a flamenco-electronic band originally from Málaga, Spain, known for a Flamenco Chill sound that fuses flamenco sounds and palos with electronic music. The name of the band is taken from an improvised form of beach tent that is constructed as a means of sheltering from the wind and sun.\n",
      "The three original members of Chambao were María del Mar Rodriguez Carnero (La Mari), Eduardo Casañ (El Edi) and Daniel Casañ (Dani). They made waves in the world music scene with their new brand of flamenco, called flamenco chill, which combined the passion and vocal style of traditional Andalusian flamenco with elements of electronica, specifically chillout. Formed in the early morning hours of the 2001 summer solstice in Malaga, Spain, Chambao first appeared to the greater public on the 2002 Sony compilation Flamenco Chill, to which they contributed eight songs, featuring Mari on vocals and the others on the instrumentation. Two years later their first solo full-length, Endorfinas en la Mente, produced by Italian electronica expert Bob Benozzo, was released, followed the next year by Pokito a Poko, a record on which Dani contributed very little, as he left the group before it was finished. After touring for Pokito a Poko, Edi also decided to depart from the band, leaving Mari alone as the last remaining member. After successfully battling breast cancer, the singer returned to the stage and studio with Chambao, this time with a new seven-piece backing band. In 2007 the band released their fourth studio album Con Otro Aire. Frontwoman La Mari took the helm of composing, arranging and production duties and her African and Mexican influences are clearly audible throughout the record. Chambao returned five years later with their self-titled fifth release. They enlisted Carlos Raya (Fito & Fitipaldis, M-Clan) on production duties whose sleek skills complement the band’s ambient mixture of flamenco and electronic music. ~ Marisa Brown\nDiscovered by the Dutch musician Henrik Takkenberg. In 2005 El Edi and Dani departed the band. In 2003, they were winners of the Premios Ondas musical award for their debut album, Endorfinas en la mente (Endorphins in the Mind).\n",
      "This article about a Spanish band or other musical ensemble is a stub. You can help Wikipedia by expanding it."
   ],
   "infobox": {},
   "prunedData": [
      "[BAND_NAME] were a [GENRE] band originally from Málaga, Spain, known for a Flamenco Chill sound that fuses flamenco sounds and palos with electronic music. The name of the band is taken from an improvised form of beach tent that is constructed as a means of sheltering from the wind and sun.\n",
      "The three original members of [BAND_NAME] were [MONTH]ía del [MONTH] Rodriguez Carnero (La [MONTH]i), [PERSON_NAME_FULL_1_MALE] (El Edi) and Daniel [PERSON_NAME_LAST_1] (Dani). They made waves in the world music scene with their new brand of flamenco, called flamenco chill, which combined the passion and vocal style of traditional Andalusian flamenco with elements of electronica, specifically chillout. Formed in the early morning hours of the [YEAR] summer solstice in Malaga, Spain, [BAND_NAME] first appeared to the greater public on the [YEAR] Sony compilation Flamenco Chill, to which they contributed eight songs, featuring [MONTH]i on vocals and the others on the instrumentation. Two years later their first solo full-length, Endorfinas en la Mente, produced by Italian electronica expert Bob Benozzo, was released, followed the next year by Pokito a [GENRE] a record on which Dani contributed very little, as he left the group before it was finished. After touring for Pokito a [GENRE] Edi also decided to depart from the band, leaving [MONTH]i alone as the last remaining member. After successfully battling breast cancer, the singer returned to the stage and studio with [BAND_NAME], this time with a new seven-piece backing band. In [YEAR] the band released their fourth studio album Con Otro Aire. Frontwoman La [MONTH]i took the helm of composing, arranging and production duties and her African and Mexican influences are clearly audible throughout the record. [BAND_NAME] returned five years later with their self-titled fifth release. They enlisted Carlos Raya (Fito & Fitipaldis, M-Clan) on production duties whose sleek skills complement the band’s ambient mixture of flamenco and electronic music. ~ [MONTH]isa Brown\nDiscovered by the Dutch musician [PERSON_NAME_FULL_0_MALE]. In [YEAR] El Edi and Dani departed the band. In [YEAR], they were winners of the Premios Ondas musical award for their debut album, Endorfinas en la mente (Endorphins in the Mind).\n",
      "This article about a [GENRE] band or other musical ensemble is a stub. You can help Wikipedia by expanding it."
   ]
}