{
   "Name": "DarkSun",
   "rawData": [
      "DarkSun is a Spanish power metal band from Asturias, Spain. Formed in 2002 after the split of Nörthwind, the band has since released six studio albums. DarkSun has often cited Blind Guardian, Helloween, Angra, and Rage as their biggest and most important influences.\n",
      "After the split of power metal band Nörthwind, three of the members formed heavy metal band Vendaval. The rest of the members, guitarists Tino Hevia and Daniel Gonzalez, and keyboardist Helena Pinto, formed DarkSun. The band recruited bassist Pedro Junquera and drummer Daniel Cabal, who had also worked with Relative Silence along with Helena Pinto. They decided to record an album after recruiting all the members to have a stable lineup.\n",
      "In the middle of 2003, DarkSun went to Germany to record what would become their debut album. It was recorded at VPS Studios, produced by Ingo Cjavkoski (better known as Rage's producer), and mixed at House of Music Studios by Achim Köhler (mixer who had worked for bands like Primal Fear and Sinner). El Legado was the debut album by the band, released in July 2004. Professional reviews were incredibly good, stating that El Legado, was \"one of the best Spanish metal albums of the year  from an excellent band\". DarkSun toured Spain for a whole year to support the album, and had \"tickets-sold-out\" posters in most of the venues. The critics and live-reviews about this new band were incredibly good. In the middle of the tour, drummer Daniel Cabal left the band. The rest of the members had to cancel some concerts before introducing Cabal's replacement, drummer Rafael Yugueros who was at that time known for his work on power metal band Darna, on their first and second album and left after the band's breakup in 2004. Keyboardist Helena Pinto left the band at the end of 2004.\n"
   ],
   "infobox": {
      "Origin": [
         "Asturias, Spain"
      ],
      "Genres": [
         "Heavy metal",
         "Power metal",
         "Progressive metal",
         "Symphonic metal"
      ],
      "Years active": [
         "2002–present"
      ],
      "Labels": [
         "FC Metal"
      ],
      "Associated acts": [
         "WarCry, Darna, Relative Silence, Last Days Of Eden"
      ],
      "Website": [
         "www.darksunweb.com"
      ],
      "Members": [
         "Dani González",
         "Tino Hevia",
         "David Figueiras",
         "Adrian Huelga",
         "Dani Cabal"
      ],
      "Past members": [
         "Rafael Yugueros",
         "Dani Cabal",
         "Helena Pinto",
         "Víctor Fernández",
         "Pedro Junquera",
         "Ana Fernández"
      ]
   },
   "albums": [
      "El Legado",
      "El Lado Oscuro",
      "The Dark Side",
      "Libera Me",
      "Tocar El Sol",
      "Memento Mori",
      "Crónicas de Araván",
      "Chronicles of Aravan"
   ]
}