{
   "Name": "Darna (band)",
   "rawData": [
      "Darna was a Spanish power metal band from Oviedo, Asturias, Spain. Formed in 1998, they released two successful albums before the drummer's departure in 2004 led the remaining band members to decide to disband the group and focus on separate projects.\n",
      "On September, 1998, Dani and Ruth began to develop a musical project and invited Álvaro Jardón (bass) and Rafael Yugueros (drums) to join them, they accepted and started working on the songs that had been composed and the ones that were still on writing. Silvia was the last member to join the band and with her guitar gave power and a solid rhythmic base. They entered the studio on the middle of 2000 and started the recording of what would become their debut album with the songs composed, most of them contained a conceptual story. The band made their first live presentation on December 2000, on the anniversary celebration of the heavy metal radio program Morgana. Self-titled debut album, Darna was released on June, 2002 after a year of recording. An intense promotion generated great anticipation to see this new band.\n",
      "Bassist Álvaro Jardón, left the group on 2002 to form part of power metal band WarCry, where he worked on their second and third studio albums and left at the end of 2003 stating that was all due to personal and musical issues, hoping to return to music on upcoming years. On September 2002 Darna made the official presentation of Jardón's replacement, Fonso a well-known Asturian bassist. Then started their tour to support the debut album, playing on many concerts throughout Spain, where they received very good critics, and showed that Darna was mostly a 'live band'. The band's last concert for the tour was in June, 2003, at that time they started the recording process of what would be their second studio album. The album was scheduled to be released on September 2003, but due to technical problems on the recording sessions they couldn't release it until December, 2003. II was their second album filled with strong rhythms and melodies, where they received even better critics than with the debut album. Second studio album had a great reception on the Spanish heavy metal, but on early 2004 Rafael Yugueros decided to leave the band to form part of DarkSun, where he worked on their second and third studio albums, before joining WarCry on September, 2007 to replace former drummer Alberto Ardines. All the members agreed on breaking up the band and continue on their own. On the middle of 2004 Darna was officially disbanded and all of the members started new projects.\n"
   ],
   "infobox": {
      "Origin": [
         "Asturias, Spain"
      ],
      "Genres": [
         "Heavy metal, power metal"
      ],
      "Years active": [
         "1998–2004"
      ],
      "Labels": [
         "Avispa"
      ],
      "Associated acts": [
         "WarCry, DarkSun"
      ],
      "Website": [
         "www.darnametal.com"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band from Oviedo, Asturias, Spain. Formed in [YEAR], they released two successful albums before the drummer's departure in [YEAR] led the remaining band members to decide to disband the group and focus on separate projects.\n",
      "On [MONTH], [YEAR], Dani and Ruth began to develop a musical project and invited [PERSON_NAME_FULL_1_MALE] (bass) and [PERSON_NAME_FULL_0_MALE] (drums) to join them, they accepted and started working on the songs that had been composed and the ones that were still on writing. Silvia was the last member to join the band and with her guitar gave power and a solid rhythmic base. They entered the studio on the middle of [YEAR] and started the recording of what would become their debut album with the songs composed, most of them contained a conceptual story. The band made their first live presentation on [MONTH] [YEAR], on the anniversary celebration of the heavy metal radio program Morgana. Self-titled debut album, [BAND_NAME] was released on [MONTH], [YEAR] after a year of recording. An intense promotion generated great anticipation to see this new band.\n",
      "Bassist [PERSON_NAME_FULL_2_MALE], left the group on [YEAR] to form part of power metal band WarCry, where he worked on their second and third studio albums and left at the end of [YEAR] stating that was all due to personal and musical issues, hoping to return to music on upcoming years. On [MONTH] [YEAR] [BAND_NAME] made the official presentation of [PERSON_NAME_LAST_2]'s replacement, Fonso a well-known Asturian bassist. Then started their tour to support the debut album, playing on many concerts throughout Spain, where they received very good critics, and showed that [BAND_NAME] was mostly a 'live band'. The band's last concert for the tour was in [MONTH], [YEAR], at that time they started the recording process of what would be their second studio album. The album was scheduled to be released on [MONTH] [YEAR], but due to technical problems on the recording sessions they couldn't release it until [MONTH], [YEAR]. II was their second album filled with strong rhythms and melodies, where they received even better critics than with the debut album. Second studio album had a great reception on the Spanish heavy metal, but on early [YEAR] [PERSON_NAME_FULL_0_MALE] decided to leave the band to form part of DarkSun, where he worked on their second and third studio albums, before joining WarCry on [MONTH], [YEAR] to replace former drummer [PERSON_NAME_FULL_1_MALE]. All the members agreed on breaking up the band and continue on their own. On the middle of [YEAR] [BAND_NAME] was officially disbanded and all of the members started new projects.\n"
   ]
}