{
   "Name": "Décima Víctima",
   "Sections": [
      "1 History",
      "1.1 Early Years",
      "1.2 Quartet",
      "1.3 The End",
      "2 Discography",
      "3 Band members",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Decima Victima (English: Tenth Victim) was a band formed by two Swedes and two Spaniards. During their short career between 1981 and 1984 they released two LPs, a maxisingle, two EPs and three singles.\n"
      ]
   },
   "History": {
      "Early Years": {
         "text": [
            "In 1981, brothers Lars and Per Mertanen formed the instrumental duo Cláusula Tenebrosa. After a show they started talking about the possibility of rehearsing with Carlos Entrena, a friend at the time and ex-singer of the recently split Ejecutivos Agresivos.\n",
            "In 1981, with some friends, they started the independent label Grabaciones Accidentales (GASA), so they could release their own records.\n"
         ]
      },
      "Quartet": {
         "text": [
            "In 1982, they decided to replace the drum machine by real drums and Jose Brena joined the band.\n",
            "'Tan Lejos' was so well received by the radio that months later Décima Víctima won The Maqueta de Oro (Golden Demo), an award voted by the listeners of Radio 3 (Radio Nacional de España, Spain's National Public Broadcaster), as one of the favourite tracks of 1982.\n",
            "The sound, in spite of being played with only three instruments and voice, was as enveloping live as it was on record, thanks to the Mertanen Brothers' personal way of playing and to having, most of the times, Paco Trinidad as their sound engineer.\n",
            "Most of their live shows were in Madrid, but they also played in Barcelona, Vigo, Valencia, Puertollano and Molina de Aragón.\n"
         ]
      },
      "The End": {
         "text": [
            "The band ended mainly for work reasons beyond their control. There were no musical or personal differences. They always were, above all, very good friends.\n",
            "Their last show was at Madrid's Rock-Ola on December 3, 1983.\n",
            "In the winter of 1983 Décima Víctima recorded live, on a 4-track, a demo for their second Lp, 'Un Hombre Solo'. A few months later, already disbanded, they recorded it in the studio.\n"
         ]
      }
   },
   "Discography": {},
   "Band members": {},
   "External links": {},
   "coreData": [
      "Decima Victima (English: Tenth Victim) was a band formed by two Swedes and two Spaniards. During their short career between 1981 and 1984 they released two LPs, a maxisingle, two EPs and three singles.\n",
      "In 1981, brothers Lars and Per Mertanen formed the instrumental duo Cláusula Tenebrosa. After a show they started talking about the possibility of rehearsing with Carlos Entrena, a friend at the time and ex-singer of the recently split Ejecutivos Agresivos.\n",
      "In 1981, with some friends, they started the independent label Grabaciones Accidentales (GASA), so they could release their own records.\n",
      "In 1982, they decided to replace the drum machine by real drums and Jose Brena joined the band.\n"
   ]
}