{
   "Name": "Def Con Dos",
   "rawData": [
      "Def Con Dos (meaning DEFense CONdition TWO) is a rap rock band from Madrid, Spain.\n",
      "Greatly influenced by hip hop bands Beastie Boys, Public Enemy, and Run D.M.C., and rock band Siniestro Total, they started rapping over hip hop bases created by producer Julián Hernández (musician and singer of Siniestro Total). In their Segundo Asalto tape (1989), the sound still was basically hip hop, but they started using rock guitars.\n",
      "Texts in their lyrics and in the manifestos enclosed with their records are highly offensive and complex, with many references to pop culture: pop music, Spanish folklore, news, publicity, cinema, literature and Spanish and American comics. Armas pal pueblo (1994) was probably the first album made in Spain with a Spanish version of the Parental advisory: Explicit lyrics label on the cover.\n"
   ],
   "infobox": {
      "Origin": [
         "Vigo and Madrid, Spain"
      ],
      "Genres": [
         "Rap rock, political hip hop, rap metal"
      ],
      "Years active": [
         "1989-1999, 2004-present"
      ],
      "Associated acts": [
         "Strawberry Hardcore"
      ],
      "Website": [
         "defcondos.com"
      ],
      "Members": [
         "Alberto Marín",
         "Samuel Barranco",
         "Sagan Ummo",
         "Kiki Tornado",
         "J. Al Ándalus",
         "Cesar Strawberry"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (meaning DEFense CONdition TWO) is a [GENRE] band from Madrid, Spain.\n",
      "Greatly influenced by hip hop bands Beastie Boys, Public Enemy, and Run D.M.C., and rock band Siniestro Total, they started rapping over hip hop bases created by producer [MONTH]ián Hernández (musician and singer of Siniestro Total). In their Segundo Asalto tape ([YEAR]), the sound still was basically hip hop, but they started using rock guitars.\n",
      "Texts in their lyrics and in the manifestos enclosed with their records are highly offensive and complex, with many references to pop culture: pop music, Spanish folklore, news, publicity, cinema, literature and Spanish and American comics. Armas pal pueblo ([YEAR]) was probably the first album made in Spain with a [GENRE]"
   ]
}