{
   "Name": "Delorean (band)",
   "Sections": [
      "1 Career",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Delorean were a Spanish alternative dance band formed in 2000 in Zarautz, a Basque town. The band was originally composed of vocalist and bassist Ekhi Lopetegi, guitarist Tomas Palomo, keyboardist Unai Lazcano and drummer Igor Escudeo; they created the band to explore their mutual interests, from the local punk rock scene to electronic music. Palomo was replaced in 2008 by Guillermo Astrain.\n",
         "Delorean are named after the time machine featured in the Back to the Future series, which was a DeLorean car.\n"
      ]
   },
   "Career": {
      "text": [
         "The quartet released an EP and two studio albums between 2004 and 2006 to little mainstream success.[citation needed] In 2008, Palomo left the band and was replaced by Guillermo Astrain. Delorean subsequently relocated to Barcelona, veering towards more computer-based composition and production. Tiring of the relative low quality of the local dance music scene, the band members created their own eclectic club night, Desparrame, in which they continued the evolution of their music. Remixes for the likes of The xx, Cold Cave, and Franz Ferdinand gave Delorean exposure in the music press.\n",
         "Following their successful visit to the 2007 SXSW festival in Austin, Texas, the band released Transatlantic KK, a variation of the second studio album Into the Plateau, on the New York-based Simple Social Graces label. The Ayrton Senna EP was released in 2009 to positive reviews from critics.[1][2] The band subsequently toured with Swedish groups jj and Miike Snow. In 2010, Delorean released their third album, Subiza, and secured a worldwide distribution deal with New York label True Panther Sounds.\n",
         "In October 2013, the band members, while on tour in Mexico City, were taken hostage as part of a \"virtual kidnapping\", by criminals posing as security officers, who moved them to another hotel, then called their family members attempting to extort money from them. The ordeal lasted 30 hours before police rescued them. The band cancelled several of their subsequent tour dates as a result.[3]\n",
         "In October 17, 2018, the band announced its break-up on its official Facebook page. They played a final set of tour dates in early 2019, with the last being in Mallorca on 15 March 2019.\n"
      ]
   },
   "Discography": {
      "text": [
         "Studio albums\n",
         "EPs\n",
         "Singles\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Delorean were a Spanish alternative dance band formed in 2000 in Zarautz, a Basque town. The band was originally composed of vocalist and bassist Ekhi Lopetegi, guitarist Tomas Palomo, keyboardist Unai Lazcano and drummer Igor Escudeo; they created the band to explore their mutual interests, from the local punk rock scene to electronic music. Palomo was replaced in 2008 by Guillermo Astrain.\n",
      "Delorean are named after the time machine featured in the Back to the Future series, which was a DeLorean car.\n",
      "The quartet released an EP and two studio albums between 2004 and 2006 to little mainstream success.[citation needed] In 2008, Palomo left the band and was replaced by Guillermo Astrain. Delorean subsequently relocated to Barcelona, veering towards more computer-based composition and production. Tiring of the relative low quality of the local dance music scene, the band members created their own eclectic club night, Desparrame, in which they continued the evolution of their music. Remixes for the likes of The xx, Cold Cave, and Franz Ferdinand gave Delorean exposure in the music press.\n",
      "Following their successful visit to the 2007 SXSW festival in Austin, Texas, the band released Transatlantic KK, a variation of the second studio album Into the Plateau, on the New York-based Simple Social Graces label. The Ayrton Senna EP was released in 2009 to positive reviews from critics.[1][2] The band subsequently toured with Swedish groups jj and Miike Snow. In 2010, Delorean released their third album, Subiza, and secured a worldwide distribution deal with New York label True Panther Sounds.\n"
   ]
}