{
   "Awards and nominations": {},
   "Band Influences": {
      "text": [
         "Despite Dover being a Spanish band, most of their songs are written in English (except for \"Noche Tras Noche\", a cover a song by the band Solera which was included as a bonus track on the reissue of their album Sister in 2001) and are composed by the Llanos sisters. Amparo composing and Cristina writing the lyrics.\n",
         "According to the group, the reason that the lyrics are in English is because their rock influences have always been primarily English bands and they do not feel comfortable using Spanish lyrics for their songs[citation needed].\n",
         "Both sisters insist they were strongly influenced by The Beatles and grunge music, especially Nirvana. These influences are evident in the music. Thus, referring to Paul McCartney in \"King George\" (\"I need to McCartney's song\"). In \"27 Years\", they make reference to a famous album of his: Band on the Run, and in their album Follow The City Lights, one of the songs which is called \"Dear McCartney\". In this album, they have said that their influences have been artists like Madonna and Peaches. Also, their song \"The Weak Hour of the Rooster\" quotes the last sentence from the suicide note of Kurt Cobain, lead singer of Nirvana: \"It's better to burn out than to fade away\".\n",
         "As for the album I Ka Kené, they were influenced by African artists like Boubacar Traore, Korchach, Coumba Sidibe, John Chivadura, Nahawa Dumbia, Oliver Mtukudzi, Habib Koite, Sekouba Traore, Bembeya Jazz Orchestra, Sekouba Bambino, etc. In addition to the incorporation of lyrics in Bambara, a national language of Mali, the album features lyrics in French, which is widely spoken in Africa.\n",
         "As for the album Complications, Cristina commented that the biggest influence for the album was The Cars and Joan Jett.[3]\n"
      ]
   },
   "Band history": {
      "2012: What goes around comes around": {
         "text": [
            "During the first quarter of 2012, Dover announced the release of a single with two songs, an unreleased track and a cover of a popular song of the eighties; the unreleased track was mixed by Veronica Ferraro in France and the cover by Jesús Antúnez in Madrid. On March 8, 2012, a fan revealed the title of the new song \"What Goes Around Comes Around\" on the internet. The b-side to \"What Goes Around Comes Around\" was a cover of \"Need You Tonight\", which was a hit for INXS in 1987.[1]\n",
            "Dover took part in the Trina promotional campaign \"Al natural\", performing three songs: \"Loli Jackson\", \"King George\" and \"Junnete\", playing three acoustic versions. They were also involved in the introduction of a Givenchy perfume, giving them the opportunity to make their first online live performance, performing \"The Hitter\", \"The Morning After\", \"King George\", \"Do Ya\" and a new version of \"DJ\" accompanied only by an electric guitar.\n",
            "The release of \"What Goes Around Comes Around\" was delayed for fifteen days, and was only sold in digital form at the end of June 2012. The promotion was limited to a single appearance on the program \"El Número Uno\". The single entered the list of Los 40 Principales and spent five weeks on the chart. They began their tour in 2012 reviewing their greatest hits, such as the original versions of \"Devil Came to Me\", \"King George\" and \"Serenade\", in addition to an acoustic version of \"Loli Jackson\".\n"
         ]
      },
      "2013 - 2016: The return to rock: Dover Came to Me tour, Complications and split": {
         "text": [
            "In 2014, Dover announced that, to commemorate the twentieth anniversary of foundation of the band, they would tour and re-release their Devil Came to Me album (as they also were celebrating the 15th anniversary of the album's release). The tour started on March 8 in the Sala Sol in Madrid. Tickets sold out more than three months before the concert. From that date, they began to perform in multiple venues in Spain, selling out most performances.[citation needed]. They also reissued their album Devil Came to Me, called Dover Came to Me, in different formats. The Deluxe format contains a CD with a remastered album version plus bonus tracks, a second CD with their live songs and a DVD with one of the concerts of this tour, plus a 1997 live performance in the Palacio de los Deportes. Also the DVD includes interviews with the band members, plus two video clips: \"Serenade\" and \"Loli Jackson\".\n",
            "After filling more than thirty-five concert halls throughout Spain during 2013, they embarked on a final tour that winter, which would come to an end in the legendary hall La Riviera on January 10, 2014. The rest of the year, they only performed on a couple occasions, one of which was holding Subterfuge in the Music Day in June, where they presented a new untitled song, later to be called \"Crash\". Their social networks were updated with news about recording a new album, indicating that it would be closer to rock.\n",
            "In September they premiered \"Too Late\" during a concert in La Rioja. In December, Complications, their eighth studio album, was announced; it was released on February 9. Produced by drummer Jesús Antúnez and recorded in Madrid, Complications returned to the melodic rock that characterized Dover's early albums.\n",
            "On November 2016, Amparo Llanos announced on Radio 3 that the band was breaking up, with herself and bassist Samuel Titos starting another band named New Day, while drummer Jesús Antúnez would focus on his DJ career.[2]\n"
         ]
      },
      "African Rhythms: I Ka Kené": {
         "text": [
            "On 31 July 2010, Dover released the first single from their upcoming album I Ka Kené on YouTube, \"Dannayá\". It is sung in the African language Bambara and English. According to the band's Facebook page, the single is inspired by a Malian immigrant they met. The album I Ka Kené was later released on October 4, 2010 and it shows the multilingual side of Dover as the entire album was sung in French, Bambara and English\n"
         ]
      },
      "Beginnings and Sister": {
         "text": [
            "Dover originated outside Madrid, in the town of Boadilla del Monte, in the early 90s when Cristina Llanos, then 17, decided to form a rock band encouraged by the alternative scene from Seattle. The group's name was inspired by a brand of a clothing store that her mother owned in Majadahonda. Her sister Amparo, 10 years her senior, joined the project. In 1994, drummer Jesús Antúnez and bassist Álvaro Gómez joined the band. One of the demo tapes of the group went to the radio show Disco Grande on RNE Radio 3. The band then signed a one-year contract with the small independent label Everlasting-Caroline. Their debut album Sister, was released in 1995 and sold poorly, due to the lack of promotion as well as the inexperienced label. Nevertheless, the Spanish music fanzine Mondo Sonoro included the album among their national Top 10 of the Year. Despite the limited success in terms of album sales, this helped Dover manage to gain a foothold in the music scene in Madrid; they even recorded their first music video \"Come With Me\" by Juan Bullón, but this song was not released as a single properly, though it was the most demanded for at concerts by fans.\n"
         ]
      },
      "Breakthrough: Devil Came to Me": {
         "text": [
            "The contract with Everlasting-Caroline only lasted a year and afterwards the band signed with the independent label Subterfuge Records. Their first involvement with the label was to include a demo version of their song \"Loli Jackson\" in the multi-band compilation album Stereoparty 2. This success motivated the label to produce their second album  and so they entered the Infinity Studios in Madrid in 1997 to record the album Devil Came to Me on a tight budget of 80,000 pesetas and in just 20 days. The album was released on April 21, 1997, a fragment of the album's title track (specifically the chorus with the phrase \"I lied for you, I lied for you...\") was included in a popular television commercial by Radical Fruit Company which increased their notoriety and the band was launched to national fame. During the promotion of this album, Álvaro Gómez was replaced by Álvaro Díez in 1997. The album sold over 500,000 copies and gained them fans abroad in Europe and America. They released their official first single from the album, Serenade, a song that, thanks to its strong chorus and catchy melody, managed to become their first number one in Spain. Juan Bullón again directed their next music video. The song \"Loli Jackson\" is featured by director Daniel Calparsoro in the 1997 movie Blinded.\n"
         ]
      },
      "Late at Night, I Was Dead for 7 Weeks in the City of Angels and The Flame": {
         "text": [
            "The relationship with Subterfuge Records deteriorated and they signed with Chrysalis Records label owned by EMI Music. In 1998 they quickly created their own label Loli Jackson Records. With their newly created label, Dover soon signed up several independent groups. The following year they released their third album Late at Night, recorded in Seattle with Barret Jones. It was released on 28 June of that year with great expectations created by its first single DJ that quickly became number one in Spain; something totally new for a rock band. This success soon propelled them to their first international tour that took them to Germany, England, the Netherlands, Mexico, the United States among others. By February 2000, the album was already triple platinum with 300,000 thousand copies sold in Spain alone.\n",
            "In 2000, Dover received an award from  MTV Europe for Best Spanish Artist. In 2001, Chrysalis reissued their first album Sister including the unreleased song \"Noche Tras Noche\", a cover of a song by the Spanish band Solera. In May of that year they soon entered Grandmasters Studies Recorder to record their new album, again accompanied by Barrett Jones. Their first single, released on September 3 of the year, was \"King George\". The album itself, titled I Was Dead for 7 Weeks in the City of Angels, was released on September 17, 2001 and in just ten days had sold 125,000 copies.\n",
            "In 2003, the musical crisis[clarification needed] forced them to close their record company and sign with EMI Music. On 27 October of that year, their fifth album The Flame, was quickly released. This time the album was co-produced by Rick Will and recorded entirely in Spain. Sales were not in their favor this time and struggled to reach 60,000 copies.\nIn May 2005, bassist Álvaro Díez was expelled from the group and replaced by Samuel Titos, former guitarist and vocalist of Sperm. In late 2005 they become the first group to support the NGO Oxfam.\n"
         ]
      },
      "Pop Reinvention: Follow the City Lights": {
         "text": [
            "For months, the group begins to compose what would be their new album. Dover announced that it would be a change that would leave everyone pleasantly surprised. And so in October 2006 they released a new album called Follow the City Lights, produced by Daniel Alcover. Dover's style changed radically, introducing electronic arrangements in their music.\n",
            "The first single from this album, \"Let Me Out\", received a Premio Ondas for Best Song in 2006. Also, the single reached number 1 on the Spanish charts Los 40 Principales for 4 weeks. Furthermore, \"Let Me Out\" soon became number one on the Spanish iTunes Music Store. The second single from the album was \"Do Ya\", which was featured in the football video game by EA Sports, FIFA 08. A third single, \"Keep On Moving\", was also released from the album. Each single had an accompanying music video.\n",
            "In November 2007 they released their first double disc compilation of Dover, titled 2, which contained many of the successful singles and tracks released by Dover, including a new song called \"Soldier\". The same year they toured with La Oreja de Van Gogh.\n",
            "In late 2008, Dover toured throughout Germany and Europe to promote 2. In March 2009 they subsequently signed a contract with Sony-BMG. In several interviews they announced that their forthcoming seventh album would come out in 2010.\n"
         ]
      }
   },
   "Band members": {
      "Timeline": {},
      "text": [
         "Members at the time of breakup\n",
         "\n",
         "Former members\n",
         "\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "References": {},
   "Sections": [
      "1 Band history",
      "1.1 Beginnings and Sister",
      "1.2 Breakthrough: Devil Came to Me",
      "1.3 Late at Night, I Was Dead for 7 Weeks in the City of Angels and The Flame",
      "1.4 Pop Reinvention: Follow the City Lights",
      "1.5 African Rhythms: I Ka Kené",
      "1.6 2012: What goes around comes around",
      "1.7 2013 - 2016: The return to rock: Dover Came to Me tour, Complications and split",
      "2 Band Influences",
      "3 Band members",
      "3.1 Timeline",
      "4 Discography",
      "5 Awards and nominations",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Dover was a Spanish band, founded in Madrid in 1992. The group was composed of the sisters and group leaders Cristina Llanos (vocals) and Amparo Llanos (lead guitarist), drummer Jesús Antúnez and bassist Samuel Titos. They recorded eight albums, selling around two million copies. They are known for their second album Devil Came to Me, which led them to international fame. In 2006, their sixth album, Follow the City Lights caused controversy as the style of the group changed from alternative rock to electronic pop. The band won, among other things, the revelation group awards at the 1997 Premios Ondas and the award for best Spanish artist at the 2000 MTV Europe Music Awards. The band was disbanded in 2016 by Amparo Llanos, who has since begun another project without her sister.\n"
      ]
   },
   "Title": "Dover (band) - Wikipedia"
}