{
   "Name": "Dover (band)",
   "rawData": [
      "Dover was a Spanish band, founded in Madrid in 1992. The group was composed of the sisters and group leaders Cristina Llanos (vocals) and Amparo Llanos (lead guitarist), drummer Jesús Antúnez and bassist Samuel Titos. They recorded eight albums, selling around two million copies. They are known for their second album Devil Came to Me, which led them to international fame. In 2006, their sixth album, Follow the City Lights caused controversy as the style of the group changed from alternative rock to electronic pop. The band won, among other things, the revelation group awards at the 1997 Premios Ondas and the award for best Spanish artist at the 2000 MTV Europe Music Awards. The band was disbanded in 2016 by Amparo Llanos, who has since begun another project without her sister.\n",
      "Dover originated outside Madrid, in the town of Boadilla del Monte, in the early 90s when Cristina Llanos, then 17, decided to form a rock band encouraged by the alternative scene from Seattle. The group's name was inspired by a brand of a clothing store that her mother owned in Majadahonda. Her sister Amparo, 10 years her senior, joined the project. In 1994, drummer Jesús Antúnez and bassist Álvaro Gómez joined the band. One of the demo tapes of the group went to the radio show Disco Grande on RNE Radio 3. The band then signed a one-year contract with the small independent label Everlasting-Caroline. Their debut album Sister, was released in 1995 and sold poorly, due to the lack of promotion as well as the inexperienced label. Nevertheless, the Spanish music fanzine Mondo Sonoro included the album among their national Top 10 of the Year. Despite the limited success in terms of album sales, this helped Dover manage to gain a foothold in the music scene in Madrid; they even recorded their first music video \"Come With Me\" by Juan Bullón, but this song was not released as a single properly, though it was the most demanded for at concerts by fans.\n",
      "The contract with Everlasting-Caroline only lasted a year and afterwards the band signed with the independent label Subterfuge Records. Their first involvement with the label was to include a demo version of their song \"Loli Jackson\" in the multi-band compilation album Stereoparty 2. This success motivated the label to produce their second album  and so they entered the Infinity Studios in Madrid in 1997 to record the album Devil Came to Me on a tight budget of 80,000 pesetas and in just 20 days. The album was released on April 21, 1997, a fragment of the album's title track (specifically the chorus with the phrase \"I lied for you, I lied for you...\") was included in a popular television commercial by Radical Fruit Company which increased their notoriety and the band was launched to national fame. During the promotion of this album, Álvaro Gómez was replaced by Álvaro Díez in 1997. The album sold over 500,000 copies and gained them fans abroad in Europe and America. They released their official first single from the album, Serenade, a song that, thanks to its strong chorus and catchy melody, managed to become their first number one in Spain. Juan Bullón again directed their next music video. The song \"Loli Jackson\" is featured by director Daniel Calparsoro in the 1997 movie Blinded.\n"
   ],
   "infobox": {
      "Origin": [
         "Madrid, Spain"
      ],
      "Genres": [
         "Alternative rock",
         "grunge",
         "electropop"
      ],
      "Years active": [
         "1992–2016"
      ],
      "Labels": [
         "Everlasting-Caroline",
         "Subterfuge Records",
         "Chrysalis",
         "Loli Jackson Records",
         "EMI",
         "Octubre Records",
         "Sony Music"
      ],
      "Website": [
         "www.dover.es"
      ],
      "Members": [
         "Amparo Llanos",
         "Cristina Llanos",
         "Jesús Antúnez",
         "Samuel Titos"
      ],
      "Past members": [
         "Álvaro Gómez",
         "Álvaro Díez"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band, founded in Madrid in [YEAR]. The group was composed of the sisters and group leaders Cristina [PERSON_NAME_LAST_1] (vocals) and [PERSON_NAME_FULL_1_FEMALE] (lead guitarist), drummer [PERSON_NAME_FULL_0_MALE] and bassist Samuel Titos. They recorded eight albums, selling around two million copies. They are known for their second album Devil Came to Me, which led them to international fame. In [YEAR], their sixth album, Follow the City Lights caused controversy as the style of the group changed from alternative rock to electronic pop. The band won, among other things, the revelation group awards at the [YEAR] Premios Ondas and the award for best [GENRE] artist at the [YEAR] MTV Europe Music Awards. The band was disbanded in [YEAR] by [PERSON_NAME_FULL_1_FEMALE], who has since begun another project without her sister.\n",
      "[BAND_NAME] originated outside Madrid, in the town of Boadilla del Monte, in the early 90s when Cristina Llanos, then 17, decided to form a [GENRE] band encouraged by the alternative scene from Seattle. The group's name was inspired by a brand of a clothing store that her mother owned in Majadahonda. Her sister Amparo, 10 years her senior, joined the project. In [YEAR], drummer [PERSON_NAME_FULL_1_MALE] and bassist [PERSON_NAME_FULL_0_MALE] joined the band. One of the demo tapes of the group went to the radio show Disco Grande on RNE Radio 3. The band then signed a one-year contract with the small independent label Everlasting-Caroline. Their debut album Sister, was released in [YEAR] and sold poorly, due to the lack of promotion as well as the inexperienced label. Nevertheless, the Spanish music fanzine Mondo Sonoro included the album among their national Top 10 of the Year. Despite the limited success in terms of album sales, this helped [BAND_NAME] manage to gain a foothold in the music scene in Madrid; they even recorded their first music video \"Come With Me\" by [PERSON_NAME_FULL_2_MALE], but this song was not released as a single properly, though it was the most demanded for at concerts by fans.\n",
      "The contract with Everlasting-Caroline only lasted a [GENRE] band signed with the independent label Subterfuge Records. Their first involvement with the label was to include a demo version of their song \"Loli Jackson\" in the multi-band compilation album Stereoparty 2. This success motivated the label to produce their second album  and so they entered the Infinity Studios in Madrid in [YEAR] to record the album Devil Came to Me on a tight budget of 80,000 pesetas and in just 20 days. The album was released on [MONTH] 21, [YEAR], a fragment of the album's title track (specifically the chorus with the phrase \"I lied for you, I lied for you...\") was included in a popular television commercial by Radical Fruit Company which increased their notoriety and the band was launched to national fame. During the promotion of this album, [PERSON_NAME_FULL_0_MALE] was replaced by [PERSON_NAME_FIRST_0] [PERSON_NAME_LAST_2] in [YEAR]. The album sold over 500,000 copies and gained them fans abroad in Europe and America. They released their official first single from the album, Serenade, a song that, thanks to its strong chorus and catchy melody, managed to become their first number one in Spain. [PERSON_NAME_FULL_1_MALE] again directed their next music video. The song \"Loli Jackson\" is featured by director Daniel Calparsoro in the [YEAR] movie Blinded.\n"
   ]
}