{
   "Name": "The Lovemakers (band)",
   "rawData": [
      "The Lovemakers is an electropop/new wave band from Oakland, California. The band was formed in the spring of 2002 by Scott Blonde (guitar, vocals) and Lisa Light (vocals, bass) who are the two core members. Light and Blonde met in 2002 via Blonde's manager, whom Light was dating at the time. Shortly afterward Light left her boyfriend, and she began dating Blonde and joined his band Applesaucer. They were forced out of the band, reportedly for making out during practice. Afterward they formed their own band naming themselves The Lovemakers after the Japanese sexploitation film The Weird Lovemakers. They joined with Jason Proctor on keyboards to form the initial lineup.\n",
      "The Lovemakers released a self-titled record in 2003. A second record, Times of Romance, was released on August 23, 2005 on Interscope Records new imprint Cherrytree. A single, \"Prepare for the Fight\", was put out in advance of the album's release date. The album also features Josh Freese on drums. In 2006, Proctor departed to return to his day job as a computer programmer full-time.\n",
      "In 2007, The Lovemakers signed to Fuzz, a fledgling San Francisco record label, who released their third album Misery Loves Company on July 24, 2007. The album is an enhanced EP featuring 5 songs and 5 corresponding high-quality music videos. A single, \"Whine & Dine\", was put out in advance of the release date. For Misery Loves Company and the subsequent touring the band featured Brandon Arnovick on keyboards and Kenneth Hard on drums. At some point Arnovick and Hard departed, and Hard was replaced by Michael Urbano on drums. Urbano recorded drums on all except for one track on Let's Be Friends, but did not play live with the band after that time. On their tour in support of the album, the band featured Cary LaScala on drums and Gareth Lloyd on synthesizer for live performances.\n"
   ],
   "infobox": {
      "Origin": [
         "Oakland, California, United States"
      ],
      "Genres": [
         "New wave, electropop[1]"
      ],
      "Years active": [
         "2002–2009, 2014-2020"
      ],
      "Labels": [
         "Interscope, Talking House, self"
      ],
      "Website": [
         "http://www.thelovemakers.net/"
      ],
      "Members": [
         "Scott Blonde",
         "Lisa Light",
         "Julia Johari",
         "Michael Gorman"
      ],
      "Past members": [
         "Jason Proctor",
         "Michael Urbano",
         "Cary LaScala",
         "Gareth Lloyd",
         "Brandon Arnovick",
         "Ken Hard"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Oakland, California. The band was formed in the spring of [YEAR] by Scott Blonde (guitar, vocals) and [PERSON_NAME_FULL_0_FEMALE] (vocals, bass) who are the two core members. [PERSON_NAME_LAST_0] and Blonde met in [YEAR] via Blonde's manager, whom [PERSON_NAME_LAST_0] was dating at the time. Shortly afterward [PERSON_NAME_LAST_0] left her boyfriend, and she began dating Blonde and joined his band Applesaucer. They were forced out of the band, reportedly for making out during practice. Afterward they formed their own band naming themselves [BAND_NAME] after the Japanese sexploitation film The Weird Lovemakers. They joined with Jason Proctor on keyboards to form the initial lineup.\n",
      "[BAND_NAME] released a self-titled record in [YEAR]. A second record, Times of Romance, was released on [MONTH] 23, [YEAR] on Interscope Records new imprint Cherrytree. A single, \"Prepare for the Fight\", was put out in advance of the album's release date. The album also features Josh Freese on drums. In [YEAR], Proctor departed to return to his day job as a computer programmer full-time.\n",
      "In [YEAR], [BAND_NAME] signed to Fuzz, a fledgling [PERSON_NAME_FULL_3_FEMALE] record label, who released their third album Misery Loves Company on [MONTH] 24, [YEAR]. The album is an enhanced EP featuring 5 songs and 5 corresponding high-quality music videos. A single, \"Whine & Dine\", was put out in advance of the release date. For Misery Loves Company and the subsequent touring the band featured [PERSON_NAME_FULL_0_MALE] on keyboards and Kenneth Hard on drums. At some point [PERSON_NAME_LAST_0] and Hard departed, and Hard was replaced by [PERSON_NAME_FULL_1_MALE] on drums. [PERSON_NAME_LAST_1] recorded drums on all except for one track on Let's Be Friends, but did not play live with the band after that time. On their tour in support of the album, the band featured [PERSON_NAME_FULL_2_MALE] on drums and Gareth Lloyd on synthesizer for live performances.\n"
   ]
}