{
   "Name": "Eskorbuto",
   "Sections": [
      "1 Biography",
      "1.1 The beginning (1980–83)",
      "1.2 Zona Especial Norte and Eskizofrenia (1984–85)",
      "1.3 Anti Todo and breakthrough success (1986)",
      "1.4 New sounds, successes and struggles (1987–90)",
      "1.5 Mexico Tour and Demasiados enemigos... (1991)",
      "1.6 Death of Iosu and Juanma (1992)",
      "1.7 Eskorbuto without Iosu and Juanma (1993–99)",
      "1.8 The \"new\" Eskorbuto (2015–present)",
      "2 Influence",
      "3 Members",
      "4 Discography",
      "5 See also",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Eskorbuto are a punk band from Santurtzi (Greater Bilbao, Basque Autonomous Community, Spain) that formed in 1980.[1] They have been one of the most influential bands for Spanish and Latin American punk rock. They are known for their strong attitude and crude lyrics. They were one of the first bands to perform punk with lyrics in Spanish. Eskorbuto is a modified word taken from escorbuto (scurvy in Spanish).\nAlong with the band La Polla Records, Eskorbuto has been very influential in the Spanish rock and punk scene.\n",
         "By 2015, Pako Galán announced that the band come back to performing again. In May 2016, the new line-up is presented with Ali Kalaña (bass and lead vocals) and Naty Penadas (guitar and backing vocals) and Pako as the only continuous member.\n"
      ]
   },
   "Biography": {
      "The beginning (1980–83)": {
         "text": [
            "Born in Nervión, Santurtzi. Influence by the punk explosion of 1977 they started playing around 1980, the line up consisted of Iosu Expósito on guitar and vocals (declared fan of The Who, The Kinks, The Rolling Stones and the Sex Pistols) and Juanma Suarez on bass and vocals (who didn't really listen to music) later to be joined by Pako Galán on drums. They gave their first concert in a school near their rehearsal space with the audience being a group of 10-year-olds.\n",
            "In August 1982, the band went to Madrid to record their first demo. They did the trip in an old Fiat 124 that left Paco pulled up to Burgos, they thought of burning it but ultimately sold it for 3000 pesetas. The trip paid off as they got signed by the independent label Spansuls Records where they recorded their first single. At that time the nascent punk movement in Spain based its subjects in the humor and messing around, but they decided to play about issues that were taboo and swept with their single: Mucha Policía, Poca Diversión, which contained the songs \"Mucha Policía, Poca Diversión\", \"Mi Degeneración\" y \"Enterrado Vivo\". The single was sold out in three months.\n"
         ]
      },
      "Zona Especial Norte and Eskizofrenia (1984–85)": {
         "text": [
            "In the summer of 1983, they returned to Madrid to record a new demo, with the songs: \"E.T.A.\", \"Escupe A La Bandera\", \"Maldito País (España)\", \"Iros A La Mierda\". Suddenly, an event shook Eskorbuto's destiny: they got arrested, the police listened to the demo and went on to accuse the band of insulting the state and its security forces. They got the emergency anti-terrorist law imposed on them, and held incommunicado for 36 hours. The attorney the band chose to defend them was Cristina Almeida; they received many calls of support, but none from the Basque Country.\n",
            "While they were detained in Bilbao they collected signatures of support from all sides. Eskorbuto felt forgotten by the Pro-Amnesty Committees when their managers were arrested in Madrid for songs such as \"E.T.A.\" y \"Maldito País (España)\".\n",
            "They wrote 3 more songs: \"Ratas En Biskaia\", \"Soldados\", \"Dios, Patria Y Rey\", recorded their first EP Zona Norte Especial, shared with the band RIP and released by the publisher Spansuls Records in 1984. Due to poor distribution, the EP was discontinued quickly. This EP caused them many problems. Due to the song \"A La Mierda El País Vasco\", they were accused of being traitors, and earned them bad reputation in Basque nationalist and cultural circles.\n",
            "In 1985, they released their first LP called Eskizofrenia, a début of new punk energy, released by the Madrid label Twins. The disc numbered 18 tracks composed between 1980 and 1984. Unfortunately the Twins label did little for it to succeed, and soon disappeared until 1987 when it was reissued by Discos Suicidas with a different cover. In the same year they staged a concert in Hernani, sharing the bill with La Polla Records and Cicatriz, who performed in the political campaign Martxa eta Borroka.\n",
            "At that time Jose Mari Blasco coined the term Rock Radical Vasco and established the Soñua label, which began recording La Polla Records, Hertzainak y Barricada. Soñua offered Eskorbuto to form a part of Basque radical rock, something that would have opened all the doors in the Basque Country, and forgotten old moves but they refused. As they pointed, \"rock has no country, not even the Basque.\"\n",
            "They then became cursed, they were censured in some stations and newspapers, and people became increasingly reluctant to hire them to play in the Basque Country, his exact words: \"We play more in the rest of Spain than in Euskadi\", but they were never anti-Basques, they preferred to play on their land instead of having to travel to faraway concerts. As Iosu said, \"we never play A La Mierda El País Vasco in Spain, there we prefer to play Maldito País España\".\n"
         ]
      },
      "Anti Todo and breakthrough success (1986)": {
         "text": [
            "Once they rejected the offer from Soñua Records, they continued with their natural independence and promised to release three discs 1986, something that seemed impossible. They joined with Discos Suicidas Records and recorded their second LP in 25 hours titled Anti Todo and say that they were anti-everything, everyone is anti-everything, but they were not against everything. The title is most eloquently summed up in two words and attitude. This album was their masterpiece, it was not just another Punk-rock record, the term punk is too small for them musically. Anti Todo is considered an incredible rock album in which we find some of their best street poetry lyrics.\n",
            "Soon they release a cassette enclosing a Fanzine. This cassette consisted of six tracks with the significant title Ya No Quedan Más Cojones, Eskorbuto A Las Elecciones. It must be said that the CSS tried to censor and refused to make the tape for the song \"Escupe A La Bandera\", the cassette was an incredible success and sold out quickly.\n",
            "Had not yet completed the year 1986 and still prepare another surprise, which nobody had done so far in this country: A live album. We do a lot of records because we plays a little bit, our albums are Live, they say. For direct recording of thought on a tour called Bloody Christmas, something that did not work, who knows whether out of laziness or lack of infrastructure. At the end of the assembly hall of a school in Santurce is the chosen location. For the release of this disc decided to sell the rights to the highest bidder contract with Discos Suicidas Records and this album would definitely strengthen the seal on the other hand aims intídducirse DRO Records in the Basque rock and after some give and take strips, Servando Carvallo of DRO Records offers a juicy offer: 200,000 pesetas to renounce the contract with Discos Suicidas and 100,000 pesetas to the group by the master. At the concert, Eskorbuto plays and recording their first live-album: Impuesto Revolucionario double LP, with a cover very expressive, a caricature of the three members of Eskorbuto by Niko from MCD.\n"
         ]
      },
      "New sounds, successes and struggles (1987–90)": {
         "text": [
            "They began the tireless work of preparing another more ambitious and novel album. They surprised with another double album released by Discos Suicidas Records called Los Demenciales Chicos Acelerados. The 20 tracks that are part of this work form a Zarzuela Rock (punk rock opera). The sound was slower, more chaotic and full of rage. Aitor Amezaga played the keyboard on the album.\n",
            "In 1988, out of the record companies, Eskorbuto decided to produce, edit and distribute their new album on their own label, Butoeskor Records. The result was Las más macabras de las vidas. From the cover to the letters of the subject, the theme of death is very present. It is an album full of anger, hopelessness, and disappointment.\n"
         ]
      },
      "Mexico Tour and Demasiados enemigos... (1991)": {
         "text": [
            "From this moment, heroin is becoming strong in Iosu and Juanma, increasingly tested least whenever they are called less to play. In 1991, they go to Mexico to give two concerts from crowds, more than 8,000 people over the two days. Just before leaving, Iosu is hospitalized and is replaced by Iñaki Speed, that was updated with the songs between the plane and hotel. Earlier this year when nobody gave them a hard, the people of Castellón Matraka Diskak Records offered they to record a new album and silencing voices and rumors of its dissolution and death to emerge with the album Demasiados Enemigos in the late 1991.\n"
         ]
      },
      "Death of Iosu and Juanma (1992)": {
         "text": [
            "A few months after going out this album, during the follow-up promotional tour, in March 1992, Iosu left the band again because of health problems. After two months in hospital, Iosu Expósito died on May 31 of that same year. Pako and Juanma reformed Eskorbuto with the new singer/guitarist Urko Igartiburu and continued working on a new album, but five months later, in October, Juanma passed away.\n"
         ]
      },
      "Eskorbuto without Iosu and Juanma (1993–99)": {
         "text": [
            "Pako with the work that had prepared with Juanma, decides to translate it into a new album: Akí No Keda Ni Dios published in 1994, dedicated to lost friends and bandmates, with songs that had been composed by Pako and Juanma before his death. Many fans of Eskorbuto deride this decision, Paco continued with the \"new\" Eskorbuto, in spite of the death of both charter members editing two more albums: Kalaña in 1996 and Dekadencia, in 1998. Then, in 1999 where the band are disbanded.\n"
         ]
      },
      "The \"new\" Eskorbuto (2015–present)": {
         "text": [
            "Pako Galán announced by the official Eskorbuto page that he, Ali Kalaña (bassist on Kalaña and Dekadencia) and Naty Penadas (Penadas Por La Ley member) began to tour and record, with their first single \"Censurados\", released in June 2016.\n"
         ]
      }
   },
   "Influence": {
      "text": [
         "The group have influences of punk and rock bands including the Sex Pistols, The Clash, The Vibrators, The Rolling Stones, The Who, ZZ Top and Motörhead.\nEskorbuto never emphasized their abilities as musicians. Nevertheless, they composed songs that quickly became hymns of the time, like \"Mucha policía, poca diversión\". Their lyrics were loaded with rage and social content, and were a very controversial group. Never were aligned politically with any ideology saying, \"Rock does not have a mother country, not even the Basque\".\n",
         "Their relationship with other groups was not good, even with La Polla Records (for instance, they stole a guitar from them) and Kortatu (particularly with Fermín Muguruza). This caused a boycott on one or another of them, and the band halls had to choose to have Eskorbuto or La Polla Records, but not both together.\n"
      ]
   },
   "Members": {},
   "Discography": {},
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Eskorbuto are a punk band from Santurtzi (Greater Bilbao, Basque Autonomous Community, Spain) that formed in 1980.[1] They have been one of the most influential bands for Spanish and Latin American punk rock. They are known for their strong attitude and crude lyrics. They were one of the first bands to perform punk with lyrics in Spanish. Eskorbuto is a modified word taken from escorbuto (scurvy in Spanish).\nAlong with the band La Polla Records, Eskorbuto has been very influential in the Spanish rock and punk scene.\n",
      "By 2015, Pako Galán announced that the band come back to performing again. In May 2016, the new line-up is presented with Ali Kalaña (bass and lead vocals) and Naty Penadas (guitar and backing vocals) and Pako as the only continuous member.\n",
      "Born in Nervión, Santurtzi. Influence by the punk explosion of 1977 they started playing around 1980, the line up consisted of Iosu Expósito on guitar and vocals (declared fan of The Who, The Kinks, The Rolling Stones and the Sex Pistols) and Juanma Suarez on bass and vocals (who didn't really listen to music) later to be joined by Pako Galán on drums. They gave their first concert in a school near their rehearsal space with the audience being a group of 10-year-olds.\n",
      "In August 1982, the band went to Madrid to record their first demo. They did the trip in an old Fiat 124 that left Paco pulled up to Burgos, they thought of burning it but ultimately sold it for 3000 pesetas. The trip paid off as they got signed by the independent label Spansuls Records where they recorded their first single. At that time the nascent punk movement in Spain based its subjects in the humor and messing around, but they decided to play about issues that were taboo and swept with their single: Mucha Policía, Poca Diversión, which contained the songs \"Mucha Policía, Poca Diversión\", \"Mi Degeneración\" y \"Enterrado Vivo\". The single was sold out in three months.\n"
   ]
}