{
   "Name": "Esplendor Geometrico",
   "rawData": [
      "Esplendor Geométrico is a Spanish industrial band. The band was formed in the early 1980s by Arturo Lanz, Gabriel Riaza, and Juan Carlos Sastre, who had all been members of El Aviador Dro y sus Obreros Especializados. They took the name \"Geometric Splendor\" from Geometric and Mechanical Splendor and the Numerical Sensibility (Italian: Lo splendore geometrico e meccanico e la sensibilità numerica), a text of the Italian futurist, F.T. Marinetti.\n",
      "In 1981 the band released their first single, \"Necrosis en la Poya\", in the Tic Tac label, followed by their debut LP, Héroe del Trabajo / El Acero del Partido in 1982. The band was active in the early-eighties international tape scene where they established a rhythmic, experimental electronic sound that foreshadowed the emergence of the powernoise subgenre by over a decade.\n",
      "In 1985 the band formed their own label, Esplendor Geométrico Discos, and released their second LP, Comisario de la Luz / Blanco de Fuerza. \n"
   ],
   "infobox": {
      "Origin": [
         "Madrid, Spain"
      ],
      "Genres": [
         "Industrial",
         "noise"
      ],
      "Years active": [
         "1980–present"
      ],
      "Labels": [
         "Geometrik"
      ],
      "Associated acts": [
         "Most Significant Beat"
      ],
      "Website": [
         "www.rotordiscos.com/autores/esplendor-geometrico/1721/"
      ],
      "Members": [
         "Arturo Lanz",
         "Saverio Evangelista"
      ],
      "Past members": [
         "Gabriel Riaza",
         "Juan-Carlos Sastre"
      ]
   },
   "prunedData": [
      "Esplendor Geométrico is a [GENRE] band. The band was formed in the early [YEAR]s by [PERSON_NAME_FULL_1_MALE], Gabriel Riaza, and [PERSON_NAME_FULL_0_MALE], who had all been members of El Aviador Dro y sus Obreros Especializados. They took the name \"Geometric Splendor\" from Geometric and Mechanical Splendor and the Numerical Sensibility (Italian: Lo splendore geometrico e meccanico e la sensibilità numerica), a text of the Italian futurist, F.T. [MONTH]inetti.\n",
      "In [YEAR] the band released their first single, \"Necrosis en la Poya\", in the Tic Tac label, followed by their debut LP, Héroe del Trabajo / El Acero del Partido in [YEAR]. The band was active in the early-eighties international tape scene where they established a [GENRE] a decade.\n",
      "In [YEAR] the band formed their own label, Esplendor Geométrico Discos, and released their second LP, Comisario de la Luz / Blanco de Fuerza. \n"
   ]
}