{
   "Biography": {
      "Collaborations": {},
      "Discography": {},
      "text": [
         "They started a small revolution in the Spanish hip-hop scene, opening new doors with a very self-assured and personal style that integrates flamenco, Cheli slang, and a lot of  humor, without losing the social critique so central to hip-hop. They have made, from a very local identity, a universal rap that has become popular around the whole country and has achieved rankings not normally held by hip-hop. They won Best Disc of the Year in Rolling Stone Magazine for their first work “”Cata Cheli”” and Best New Group from PEMOC (Group of Musical Journalists)please cite the source information.\n",
         "They have known each other since childhood, and began testing the waters with the rest of their friends in “”Amenaza Criminal””, in a totally amateur way. With time, only the actual members of the group continued in the world of hip-hop, completing the formation of La Excepción. They discovered they could make rap using their own gypsy slang and they continued to polish their style in small concerts. In one of these they met the ubiquitous MC and producer Frank T, who decided to speed their journey, making first their single “En tu carro paio!” (2002) and then their first record, “”Cata Cheli””, as well as interpreting with them the song \"El negro, el cojo y el gitano\". In addition to the basis provided by Frank T, they relied upon the Frenchman, Super Jeff Dominguez to mix their first CD. Their success among critics and sales has led them to act in the main festivals of the country, like Viña Rock, the Monegros Desert Festival or the Urban Culture de Madrid. All this brought about the re-release of the disc with a DVD and two new tracks.\n",
         "La Excepción follows a responsibly policy towards alcohol (don't try it) and drug use (a “”taste”” every once in a while). Their lyrics distil a commitment to “”El Barrio”” (the hood), happiness, and a positive attitude towards life and its hardships. Much of their music has tones of \"el Langui\", that in \"Zapato ortopédico\" (\"Orthopedic Shoe\"), jeers at the misfortunes that had been supposed to be his fate (to have paralysed arms and legs due to a lack of oxygen), and the Gypsy Anton, that in \"Nos late fuerte\" (\"It Barks At Us Loudly\"), and with the help of Antonio Carmona de Ketama also comments on the bad reputation of the Gypsies.\n",
         "In May 2006, their second disc was released, produced by Frank T and Óscar \"Acción Sánchez\", called “”Aguantando el Tiron”” (\"Withstanding The Pull\"), with collaborations like that of MC Randy. Recently they won a prize Best Spanish Group at the MTV Europe Music Awards.[citation needed]\n"
      ]
   },
   "External links": {},
   "Sections": [
      "1 Biography",
      "1.1 Discography",
      "1.2 Collaborations",
      "2 External links"
   ],
   "Summary": {
      "text": [
         "La Excepción que Confirma la Regla (The Exception That Proves The Rule; often shortened to La Excepción) is a rap band from Madrid, composed of two MCs: El Langui (Juan Manuel Montilla) and Gitano Antón (Antonio Moreno), and DJ La dako style (Javier Ibañez).\n"
      ]
   },
   "Title": "La Excepción - Wikipedia"
}