{
   "Name": "Forever Slave",
   "Sections": [
      "1 Biography",
      "2 Discography",
      "2.1 Albums",
      "2.2 Appearances on DVDs",
      "3 Members",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Forever Slave is a Spanish gothic metal band, founded by Servalath (Sergio) and vocalist Lady Angellyca in 2000.\n",
         "They recorded two demos, \"Hate\" and \"Schwarzer Engel\", in 2000 and 2001 respectively, returning with another demo in 2004, \"Resurrection\".\n",
         "In September 2005 they released their first full-length album, Alice's Inferno, produced by Lars Ratz and released by Armageddon Music. The group released a second album, Tales for Bad Girls, in April 2008. They are currently working on a follow up\n"
      ]
   },
   "Biography": {
      "text": [
         "Forever Slave was founded in 2000 by Sergio and Lady Angellyca. After three demos, \"Hate\" (2000), \"Schwarzer Engel\" (2001) and \"Resurrection\" (2003), the band recorded their first album Alice's Inferno (2005) with Armageddon Music (Germany), with production by Lars Ratz.\n",
         "This album reached the top 9 in metal French Underclass sales, the top 27 in Tipo's Sales (Spain), and was album of the Month in Metal Hammer (Spain).\n",
         "In 2005, Lady Angellyca was a candidate vocalist for Nightwish after the removal of their singer Tarja Turunen. The position was later given to Anette Olzon, who left the band in 2012.\n",
         "Forever Slave has appeared on the bill of various festivals including Wacken Open Air Fest (Germany), Metal Female Voices Fest (Belgium), and The Rock Stars Festival in Madrid.\n",
         "Forever Slave released their second album Tales for Bad Girls in 2008 which was subsequently promoted with a European tour alongside Kamelot and Firewind.[1]\n",
         "Since October 2009, Forever Slave have been working on various other projects as well as writing content for a follow up to their 2008 release which was expected to be completed in 2013, but as of August, 2017, nothing has been released. The latest info on Facebook is from March, 2015, where Lady Angellyca vaguely stated that they are having a hard time because \"a lot venues closed, the promotors don't work with metal bands very often\" [sic].[2] Neither the band's nor Lady Angellyca's personal websites have been updated since 2015. It is reasonably clear that the band's existence is over.\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Appearances on DVDs": {}
   },
   "Members": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Forever Slave is a Spanish gothic metal band, founded by Servalath (Sergio) and vocalist Lady Angellyca in 2000.\n",
      "They recorded two demos, \"Hate\" and \"Schwarzer Engel\", in 2000 and 2001 respectively, returning with another demo in 2004, \"Resurrection\".\n",
      "In September 2005 they released their first full-length album, Alice's Inferno, produced by Lars Ratz and released by Armageddon Music. The group released a second album, Tales for Bad Girls, in April 2008. They are currently working on a follow up\n",
      "Forever Slave was founded in 2000 by Sergio and Lady Angellyca. After three demos, \"Hate\" (2000), \"Schwarzer Engel\" (2001) and \"Resurrection\" (2003), the band recorded their first album Alice's Inferno (2005) with Armageddon Music (Germany), with production by Lars Ratz.\n"
   ],
   "infobox": {
      "Origin": [
         "Valencia, Spain"
      ],
      "Genres": [
         "Symphonic metal, gothic metal"
      ],
      "Years active": [
         "2000–2015"
      ],
      "Labels": [
         "Wacken Records, SPV GmbH, Armageddon Music"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Lady Angellyca",
         "Sergio",
         "Azrhael",
         "Sento"
      ]
   }
}