{
   "Name": "La Guardia (band)",
   "rawData": [
      "La Guardia is a Spanish pop-rock band. They were especially famous in the late 1980s and early 1990s, although they are still active today (after a hiatus). They have sold more than 2 million records.\n",
      "The group was founded in Granada in 1983 by Manuel España (voice), Enrique Moreno \"Conejo\" (bass guitar) and Carlos Gilabert (keyboard), with the initial name of \"La guardia del Cardenal Richelieu\" (\"Cardinal Richelieu's Guard\"). They were only teenagers and they adopted this name because they used to rehearse in the afternoons after they watched Dogtanian and the Three Muskehounds on TV.\n",
      "Under this name they released a first single with techno and mod sounds. After this, Gilabert left the band, and Joaquín Almendros (guitar) and Emilio Muñoz (drums) joined it, giving birth to the band's most famous line-up. They moved to Madrid, where the Movida was still ebullient, looking for broader success, and in 1985, they recorded an EP, now as La Guardia, after winning the Villablanca pop-rock festival in the town of Fuengirola.\n"
   ],
   "infobox": {
      "Origin": [
         "Granada, Spain"
      ],
      "Genres": [
         "Pop rock, country rock"
      ],
      "Years active": [
         "1983–1997",
         "2003-present"
      ],
      "Labels": [
         "Tubo Escape Records",
         "Blanco y Negro",
         "Vale Music"
      ],
      "Website": [
         "http://www.grupolaguardia.com/"
      ],
      "Members": [
         "Manuel España",
         "Jean Louis Barragán",
         "Javier Cano",
         "Paco Villamayor"
      ],
      "Past members": [
         "Carlos Gilabert",
         "Enrique Moreno",
         "Joaquín Almendros",
         "Emilio Muñoz"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band. They were especially famous in the late [YEAR]s and early [YEAR]s, although they are still active today (after a hiatus). They have sold more than 2 million records.\n",
      "The group was founded in Granada in [YEAR] by [PERSON_NAME_FULL_0_MALE] (voice), [PERSON_NAME_FULL_1_MALE] \"Conejo\" (bass guitar) and Carlos Gilabert (keyboard), with the initial name of \"La guardia del Cardenal Richelieu\" (\"Cardinal Richelieu's Guard\"). They were only teenagers and they adopted this name because they used to rehearse in the afternoons after they watched Dogtanian and the Three Muskehounds on TV.\n",
      "Under this name they released a [GENRE] band, and [PERSON_NAME_FULL_0_MALE] (guitar) and [PERSON_NAME_FULL_1_MALE] (drums) joined it, giving birth to the band's most famous line-up. They moved to Madrid, where the Movida was still ebullient, looking for broader success, and in [YEAR], they recorded an EP, now as [BAND_NAME], after winning the Villablanca pop-rock festival in the town of Fuengirola.\n"
   ]
}