{
   "Name": "Hidrogenesse",
   "Sections": [
      "1 Influences",
      "2 History",
      "2.1 1996-2002",
      "2.2 2007-2011",
      "2.2.1 Hidrogenesse versus The Hidden Cameras",
      "2.2.2 Art exhibition",
      "3 Alan Turing Tribute",
      "4 Hidrogenesse as producers",
      "4.1 Remixes",
      "5 Discography",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Hidrogenesse is a Catalan pop band whose members are Carlos Ballesteros (singer) and Genís Segarra (synthesizers, also of Astrud).\n"
      ]
   },
   "Influences": {
      "text": [
         "HIDROGENESSE is an electronic duo formed by Carlos Ballesteros and Genís Segarra in Barcelona in the late 1990s as a conceptual pop act. From their early steps since today they have done synth-pop, ceremony ballads, kraut- and glitter rock, 90's dance-music, french musique and fake rock’n'roll.\n",
         "According to them, their most significant influences are Sparks, Kraftwerk, Deee-Lite, The Associates (the Mac in Eres PC eres Mac stands for their lead singer, Billy Mackenzie), The Smiths and Morrissey, The Magnetic Fields, Saint Etienne, Pet Shop Boys and British eccentrics like Lawrence, Jarvis Cocker and Luke Haines. They are also influenced by 70's music like German bands La Düsseldorf, Neu! and Harmonia and UK glam acts as Gary Glitter and The Glitter Band.\n"
      ]
   },
   "History": {
      "1996-2002": {
         "text": [
            "Although they have been together since 1996, they didn't release anything until Lujo y Miseria compilation in 1998. In year 2000, they released their first single \"Así se baila el siglo XX\", a smart, cynical approach to the new millennium through the inventions of the 20th century.\n",
            "What came next, in 2001, was Eres PC, eres Mac, another EP that shares with the previous one their weird sense of humour. It contains a cover of \"Technical (you're so)\", by The Magnetic Fields, band they are devoted to.\n",
            "One year later, their first album, Gimnàstica passiva, was released. It consists of ten songs where they quote Spanish poet Luis de Góngora (\"Góngora\"), state their worship towards the Cobain family (\"Kurt, Courtney, Frances Bean and me\") or remember \"1987\", where their beloved Smiths and Andy Warhol ceased existing, and started new exciting things as samplers and club culture. 1987 is also an album by The KLF.\n",
            "A five-year break followed, when they wrote and planned a new album.\n"
         ]
      },
      "2007-2011": {
         "Hidrogenesse versus The Hidden Cameras": {
            "text": [
               "In 2010 Hidrogenesse collaborated with Canadian band The Hidden Cameras releasing \"Hidrogenesse versus The Hidden Cameras\" a minialbum of re-made/re-modelled versions of The Hidden Cameras songs from the album Origin:Orphan.\n"
            ]
         },
         "Art exhibition": {
            "text": [
               "In 2010 Hidrogenesse recorded Moix a song based on an excerpt from a travel book of Terenci Moix 'Terenci del Nil' as a part of their participation in the art exhibition 'Genius loci' of Fundació Joan Miró in Barcelona 2011. Hidrogenesse created an installation with funerary statuettes and different found objects as a parody of archeological museums. The whole project is a tribute to Terenci Moix.\n"
            ]
         },
         "text": [
            "In 2007 they released their second album, Animalitos, recorded with drummer Alfonso Melero from Spanish band Hello Cuca. It features glam rock beats, fuzz guitars, analog synthesizers and saxophones riffs. Twelve songs about pets, wild beasts and social animals, including \"Disfraz de tigre\" and \"Caballos y ponis\". Seventies production, sing-along tunes and some krautrock inspired mantras.\n",
            "The release of the new album Animalitos was followed by a Spanish tour. In 2008 they have released another album, Bestiola, influenced by early German electronica and featuring reinterpretations of old songs, covers and instrumental tracks. That release was followed by their first tour in USA and México.\n"
         ]
      }
   },
   "Alan Turing Tribute": {
      "text": [
         "In May 2012, they released a tribute album to Alan Turing, Un dígito binario dudoso. Recital para Alan Turing (\"A doubtful digital bit. Recital for Alan Turing\"), a recital that debuted in their opening shows for The Magnetic Fields 2012 Spanish tour.\n",
         "The album has had great critic and public acclaim, selected \"Record of The Year\" by Rockdelux magazine and winning The Best Electronic Music Album in the Independent Music Awards. Its eight songs are about Turing's life and work. The first song \"El beso\" (\"The Kiss\") says: \"this song is a kiss to wake Alan Turing up\" and then it goes on about teen tragedies (\"Christopher\"), computer love (\"Love Letters\"), contradictions between public and secret affairs (\"Enigma\"), and ends with a history of the world as told by our computers (\"Historia del mundo contada por las computadoras\").\n"
      ]
   },
   "Hidrogenesse as producers": {
      "Remixes": {},
      "text": [
         "Hidrogenesse have remixed songs by La Bien Querida, Javiera Mena, Fangoria, Los Punsetes and others, and have done some production work for their label Austrohúngaro (girl group Feria) and other collaborations (with Spanish act Single). In 2012 Hidrogenesse have produced Vigila el fuego by female riot-folk singer-songwriter Lidia Damunt and Rock'n Roll by Spanish duo Espanto. In 2014 they produced Single's album \"Rea\", considered \"Best Album of the Year\" by magazine Rockdelux.\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "coreData": [
      "Hidrogenesse is a Catalan pop band whose members are Carlos Ballesteros (singer) and Genís Segarra (synthesizers, also of Astrud).\n",
      "HIDROGENESSE is an electronic duo formed by Carlos Ballesteros and Genís Segarra in Barcelona in the late 1990s as a conceptual pop act. From their early steps since today they have done synth-pop, ceremony ballads, kraut- and glitter rock, 90's dance-music, french musique and fake rock’n'roll.\n",
      "According to them, their most significant influences are Sparks, Kraftwerk, Deee-Lite, The Associates (the Mac in Eres PC eres Mac stands for their lead singer, Billy Mackenzie), The Smiths and Morrissey, The Magnetic Fields, Saint Etienne, Pet Shop Boys and British eccentrics like Lawrence, Jarvis Cocker and Luke Haines. They are also influenced by 70's music like German bands La Düsseldorf, Neu! and Harmonia and UK glam acts as Gary Glitter and The Glitter Band.\n",
      "Although they have been together since 1996, they didn't release anything until Lujo y Miseria compilation in 1998. In year 2000, they released their first single \"Así se baila el siglo XX\", a smart, cynical approach to the new millennium through the inventions of the 20th century.\n"
   ],
   "infobox": {}
}