{
   "Discography": {
      "Albums": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "\"He Said, She Said\" video": {
         "text": [
            "Their first video, \"He Said, She Said\" is a combination of simulated live performance, background subway scenes from the BART rail system, and graphic novel-style cartoons hand-animated over the course of several months by Divine.[4] The video was inspired by \"Take On Me\", a popular 1985 song and video by the Norwegian band a-ha.[3]  The live portion was surreptitiously filmed on borrowed cameras in abandoned warehouses. Divine said he \"begged, stole, and cheated\" to get his hands on a camera to produce the video.[5]\n",
            "The single became popular on local San Francisco modern rock station Live 105,[citation needed] after which the video went on to win YouTube's first-ever music contest, \"The Youtube Underground\".[4] Winning the contest earned the band an appearance on Good Morning America[6][3] and interest from various record labels.[citation needed] Before the contest, Maldroid had never played together in public.[1]\n",
            "Maldroid's first three videos are all animations created by lead singer Ryan Divine. Their EP was produced at a cost of $50, which the band claims was spent mostly on food and alcohol, at a studio where two band members work.[7] The \"Heck No\" video is stop-motion animated on a Lite-Brite art toy, and took six months to create.[5] In the \"You Can Have It All\" video, Divine takes apart a bluescreen jigsaw puzzle, which is played backwards.\n"
         ]
      },
      "Post rise": {
         "text": [
            "In 2007 Maldroid was signed to a recording contract with the San Francisco record label Fuzz Artists, Inc.[citation needed]\n",
            "After winning a local band contest held by radio station Live 105,[8] Maldroid opened at the \"Not So Silent Night\" concert in December 2007. The concert included bands Paramore, Spoon, Jimmy Eat World, Angels & Airwaves, and Modest Mouse.\n",
            "Maldroid played Every Thursday Night In August and September at the Stork Club in Oakland, California\n",
            "Audio engineer Reto Peter (Green Day, The Network, Modest Mouse) provided sound engineering and mixing on two Maldroid songs released in 2007.[9]\n",
            "Maldroid will embark on their first nationwide tour(April 15-May 30) with Oakland's own The Phenomenauts and former Fueled by Ramen artist The A.K.A.s.\n",
            "Maldroid goes through a massive line-up change. With the departure of both guitarists, Johnny Genius and Todd Brown, Maldroid brings ex River City Rebels guitar player Patti Botox in to the fold. Now with a 5-man line-up Maldroid begins recording their follow up record. New songs such as \"Almost Pleasureable\", \"Get To You\" and \"Murder at The Disco\" show a significant change in style.[who?]\n",
            "Maldroid will embark on their fourth tour of their short career in October 2009 with Portland's Punk Group.\n",
            "Todd Brown returns to his original spot as lead guitar player.\n"
         ]
      },
      "text": [
         "Maldroid was founded in 2006 by lead singer Ryan Hayford, who used the stage name Ryan Divine.[1] Born and raised in Santa Cruz, Divine founded Maldroid in March 2006, picking musicians he had worked with from defunct Bay Area bands Solemite, Soundboy, and The K.G.B.[1][2] The band made its first EP Malfunction later that year produced by guitarist Johnny Genius. Divine and Genius had both worked as music producers for other Bay Area bands.[2]\n",
         "Divine said the name \"Maldroid\" comes from the term for a \"malfunctioning robot\":\n",
         "We're so technology-based that I feel like we've become robots, doing the same thing day in and day out. We're the bad droid, the black sheep, and we're going to break out of that conformity.[3]"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 \"He Said, She Said\" video",
      "1.2 Post rise",
      "2 Discography",
      "2.1 Albums",
      "2.2 Singles",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Maldroid was an electropop band based in Oakland, California. They gained fame for winning YouTube's first music contest, \"The Youtube Underground\", for their music video  \"He Said, She Said\".\n"
      ]
   },
   "Title": "Maldroid - Wikipedia"
}