{
   "Name": "Maldroid",
   "rawData": [
      "Maldroid was an electropop band based in Oakland, California. They gained fame for winning YouTube's first music contest, \"The Youtube Underground\", for their music video  \"He Said, She Said\".\n",
      "Maldroid was founded in 2006 by lead singer Ryan Hayford, who used the stage name Ryan Divine. Born and raised in Santa Cruz, Divine founded Maldroid in March 2006, picking musicians he had worked with from defunct Bay Area bands Solemite, Soundboy, and The K.G.B. The band made its first EP Malfunction later that year produced by guitarist Johnny Genius. Divine and Genius had both worked as music producers for other Bay Area bands.\n",
      "Divine said the name \"Maldroid\" comes from the term for a \"malfunctioning robot\":\n"
   ],
   "infobox": {
      "Origin": [
         "Oakland, California, USA"
      ],
      "Years active": [
         "2006 – 2008"
      ],
      "Labels": [
         "Fuzz"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Ryan Divine – vocals",
         "Todd Godley – guitar, vocals",
         "A.J. Riot – keyboard, vocals",
         "Jerry \"Prince J\" Yamashita – keyboards",
         "Sean \"The Talented Mr.\" Shippley – bass guitar",
         "Brandon Bradshaw – drums"
      ],
      "Past members": [
         "Johnny Genius – guitar",
         "Patti Botox – guitar",
         "Mike O'Millions – drums",
         "Hugo Barrientos Jr – drums",
         "Chris Swimley – drums"
      ]
   },
   "albums": [
      "Malfunction (EP)",
      "Oakland Lads Club (EP)",
      "Nevermind (EP)",
      "Maldroid"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band based in Oakland, California. They gained fame for winning YouTube's first music contest, [SONG_NAME].\n",
      "[BAND_NAME] was founded in [YEAR] by lead singer [PERSON_NAME_FULL_0_MALE], who used the stage name [PERSON_NAME_FIRST_0] Divine. Born and raised in Santa Cruz, Divine founded [BAND_NAME] in [MONTH] [YEAR], picking musicians he had worked with from defunct Bay Area bands Solemite, Soundboy, and The K.G.B. The band made its first EP Malfunction later that year produced by guitarist [PERSON_NAME_FULL_1_MALE]. Divine and [PERSON_NAME_LAST_1] had both worked as music producers for other Bay Area bands.\n",
      "Divine said the name [SONG_NAME]:\n"
   ]
}