{
   "Name": "Hinds (band)",
   "rawData": [
      "Hinds is a Spanish indie rock band from Madrid, formed in 2011, consisting of Carlotta Cosials (vocals, guitar), Ana Perrote (vocals, guitar), Ade Martin (bass, backing vocals) and Amber Grimbergen (drums). The original name of the band was Deers, but they changed it at the end of 2014 after a threat of legal action from the similarly named band The Dears. The group chose \"Hinds\", a word that means \"female deers\", as the new name of the band and officially implemented the name change on 7 January 2015.\n",
      "They have released three albums, one compilation LP and four singles. Their first studio album, Leave Me Alone, was released on 8 January 2016, and their second studio album, I Don't Run, was released on 6 April 2018. The band's third studio album, The Prettiest Curse was released on 5 June 2020.\n",
      "Hinds started in 2011 as a duo called Deers, consisting of Carlotta Cosials and Ana García Perrote. After a break of a year and a half, the duo reformed in 2013. In March 2014, still as a duo, they recorded the tracks \"Bamboo\" and \"Trippy Gum\" and released both songs in Bandcamp as \"Demo\". The single was praised by music magazines including NME and by Paul Lester of The Guardian who chose Deers as \"new band of the week\" in September 2014, and by major musicians, such as Patrick Carney, The Pastels, and Bobby Gillespie.\n"
   ],
   "infobox": {
      "Origin": [
         "Madrid, Comunidad de Madrid, Spain"
      ],
      "Genres": [
         "Indie rock",
         "lo-fi",
         "garage rock"
      ],
      "Years active": [
         "2011 (2011)–present"
      ],
      "Labels": [
         "Lucky Number",
         "Burger Records",
         "Mom + Pop"
      ],
      "Members": [
         "Carlotta Cosials [es]",
         " Ana García Perrote",
         " Ade Martín",
         " Amber Grimbergen[1]"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Madrid, formed in [YEAR], consisting of [PERSON_NAME_FULL_0_FEMALE] (vocals, guitar), Ana Perrote (vocals, guitar), Ade [MONTH]tin (bass, backing vocals) and Amber Grimbergen (drums). The original name of the band was Deers, but they changed it at the end of [YEAR] after a threat of legal action from the similarly named band The Dears. The group chose \"[BAND_NAME]\", a word that means \"female deers\", as the new name of the band and officially implemented the name change on 7 [MONTH] [YEAR].\n",
      "They have released three albums, one compilation LP and four singles. Their first studio album, Leave Me Alone, was released on 8 [MONTH] [YEAR], and their second studio album, I Don't Run, was released on 6 [MONTH] [YEAR]. The band's third studio album, The Prettiest Curse was released on 5 [MONTH] [YEAR].\n",
      "[BAND_NAME] started in [YEAR] as a duo called Deers, consisting of [PERSON_NAME_FULL_0_FEMALE] and Ana García Perrote. After a break of a year and a half, the duo reformed in [YEAR]. In [MONTH] [YEAR], still as a duo, they recorded the tracks \"Bamboo\" and \"Trippy Gum\" and released both songs in Bandcamp as \"Demo\". The single was praised by music magazines including NME and by Paul Lester of The Guardian who chose Deers as \"new band of the week\" in [MONTH] [YEAR], and by major musicians, such as [PERSON_NAME_FULL_1_MALE], The Pastels, and Bobby Gillespie.\n"
   ]
}