{
   "Discography": {
      "Albums": {},
      "Compilation albums": {},
      "Concert films": {},
      "Live albums": {},
      "Singles": {}
   },
   "External links": {},
   "Filmography": {},
   "History": {
      "10 and tour (2007-2009)": {
         "text": [
            "On September 18, 2007, Hombres G released their tenth album 10, which contained 11 new songs.  The album spawned two singles: Me Siento Bien and Hombre Real.\n",
            "10 is described as tuning into the \"raw energy of early rock\" and hinting at Euro-rock and at the \"atmospheric aesthetic favored by Coldplay and the legendary U2\" by AllMusic.[1]\n",
            "Hombres G toured Spain and the Americas in support of 10.  One of their performances included a benefit show for the victims of the 2007 Peruvian earthquake.\n",
            "The album was nominated for \"Best Pop Album By A Duo or Group With Vocal\" at the 2008 Latin Grammy Awards.[24]\n"
         ]
      },
      "A break, the second film, and the fourth album (1988)": {
         "text": [
            "Hombres G enjoyed their first break in three years at the end of 1987.  David took advantage of the tranquility of Christmas to compose new material.[15]\n",
            "A new film project was launched under Manolo Summers in 1988.  Filming began in March.  Locations included Spain, Acapulco, and Puerto Vallarta.  The movie was to be titled La cagaste Burt Lancaster but the actor Burt Lancaster threatened legal action; the name was changed to Suéltate el pelo.[15]  One of the film's actresses was Mexican singer Tatiana Palacios, and it is rumored that she and Gutiérrez dated while the movie was being filmed.[16]\n",
            "Hombres G recorded Agitar antes de usar (Shake Before Using) between February and March 1988.  The music on the album fit the categories of pop rock, rock and roll, and ballad and spawned the commercially successful single, \"Suéltate el pelo\".[17]\n",
            "Both the movie and album were released almost simultaneously, right before the summer season.  Hombres G toured Spain and the American continent once again, placing special emphasis on México.  At this time, sales of all their albums totaled more than 2 million copies in México. Sales in the smaller Spanish market were half of that figure, but Hombres G had already become the best selling band of the decade.[18]\n",
            "In September 1988, the group performed at the \"Concierto de Conciertos\" in Bogotá, Colombia.  The show was a mega concert that spanned several days and featured a variety of artists.  Among the performers were Miguel Mateos, Franco de Vita, Los Prisioneros, Timbiriche, José Feliciano, and Los Toreros Muertos.  It was there that a radio announcer baptized Hombres G as the Latin Beatles.[19][20]\n"
         ]
      },
      "An evolving sound and a farewell (1989-1992)": {
         "text": [
            "Voy a pasármelo bien (I'm Going to Have A Good Time) was released in 1989.  The group felt less pressured when composing songs for the album and their music showed a departure from the adolescent concerns of their previous works.  Their image began to reflect a more adult world.  The album continued the group's pop rock sound, but showed new influences.  The song \"Aprendiendo a caer\", made use of bossa nova and \"Madrid, Madrid\" has been compared to Frank Sinatra's music.[21]  The group toured both sides of the Atlantic with a new perspective.\n",
            "Hombres G recorded Ésta es tu vida (This Is Your Life) in the summer of 1990 in Madrid and London.[18]  Their sixth studio album contained more profound lyrics and a more sophisticated sound; it featured music performed by the London Symphony Orchestra.[22]  During this period Summers and Mezquita composed several songs for artist Luz Casal, including the ballad Te Dejé Marchar.\n",
            "That same year, Dani Mezquita married Elena Portables.  On January 18, 1992, Summers married his longtime girlfriend, Marta Madruga.[16]\n",
            "Hombres G bid farewell on May 20, 1992, with their seventh album, Historia del bikini (History of the Bikini). Production was completed by Colin Fairley, whose experience included working with artists Elvis Costello and Nick Lowe.[18]\n"
         ]
      },
      "Career comeback and tributes (2002-2004)": {
         "text": [
            "After their extended break, Hombres G returned with new material. In 2002 they released Peligrosamente Juntos (Dangerously together), an album that included hits, demos, and five new songs. The version released in America contained the new songs Lo noto and En otro mundo. The European version contained the mentioned songs and also contained Intimidad, No te escaparas and Te vi.\n",
            "At the end of 2003, Spanish pop groups such as El Canto del Loco, Los Piston, Antonio Vega, Los Secretos, Mikel Erentxun, Seguridad Social, Álex Ubago and La Cabra Mecánica, united to make a tribute album to Hombres G. The album Voy a pasármelo bien, un tributo a Hombres G (I'm going to have a good time, a tribute to Hombres G), contained cover versions of classic Hombres G singles. Another tribute was made in America with groups such as División Minúscula, Moderatto and La Quinta Estación.\n",
            "In 2004, their first two films were released in DVD format in a pack called Hombres G - Las películas (Hombres G - The Movies), also including extras.  That same year, Hombres G released El año que vivimos peligrosamente (The year that we lived dangerously).  It included live versions of songs from their Peligrosamente Juntos tour.\n"
         ]
      },
      "Formation and the first singles (1982-1983)": {
         "text": [
            "Rafael Gutiérrez Muñoz and David Summers Rodríguez met in the hallways of Televisión Española by mere coincidence in 1982; they were participants in the show Aplauso.[6]\n",
            "Rafael's brother, Felipe, played bass in the rock band Tequila, but they'd recently dissolved.  Rafa saw no definite role in the groups he had been part of: Plástico (a group formed with Toti Arboles and Eduardo Benavente, who later became involved with Alaska y los Pegamoides), Las Chinas, and Los Zombies de Bernardo Bonezzi.[6]\n",
            "David knew how to play clarinet, an instrument he studied due to his admiration for clarinetist Benny Goodman.  Rafa asked David to play clarinet in the new group he was forming with his brother Felipe.[6]\n",
            "However, David was already committed to forming a group with his two childhood friends, Daniel Mezquita Hardy and Francisco Javier de Molina Burgos.  The three were classmates at the Facultad de Ciencias de la Informacion de Madrid.  They'd been playing months prior under the names \"Los Residuos\" and \"La Burguesía Revolucionaria\".  [6]\n",
            "David welcomed Rafa's invitation to play music together, but instead asked him to play guitar with him, Dani, and Javi.  Rafa accepted.  They discarded their first idea of a name, \"Bonitos Redford\", and found inspiration in the 1935 James Cagney crime film G Men, which in Spain aired as \"Contra el imperio del crimen\".  In the film, the G-Men were agents of the Federal Bureau of Investigation (FBI).[6]\n",
            "Hombres G joined the independent recording company, Lollipop, who in 1983 released their first two singles: \"Milagro en el Congo / Venezia\" and \"Marta tiene un marcapasos / La cagaste, Burt Lancaster\".  Assisting in the recording process were Fernando Cabello (sax) and two friends of the group, Eva Dalda and Lydia Iovanne.[6]\n",
            "The group's early sound was reminiscent of La Movida Madrileña and shared similarities with Los Zombies, Los Ejecutivos Agresivos, Los Nikis, and Alaska y los Pegamoides.  The rhythm and speed of the group's songs was also inspired by the sound of the American rock band, The Ramones.[7]\n"
         ]
      },
      "Hiatus (1992-2002)": {
         "text": [
            "Following the release of their seventh album were various compilation records such as Los singles 1984-1993 and Las Baladas, but they never offered new material.[18]\n",
            "Over the following years, all members of the group remained involved in music.  Summers pursued a solo career, touring Spain and the Americas and releasing four albums.  Manuel Summers died before the release of David Summers; as a result, the album was dedicated to him.  Rafa performed with other musicians and participated in the first album by Ella Baila Sola.  He also formed a group called \"Rafa & Co.\" who released a self-titled album in 1996.  Dani became a marketing director for the record company DRO East West.  Javier cared for his Pop'n'Roll bar in Madrid, playing drums now and then for the groups he invited to perform.[18][16]\n"
         ]
      },
      "Live debut, a new recording contract, and the first album (1984)": {
         "text": [
            "Hombres G made their live debut at Madrid's Rock-Ola in 1983.  Lollipop encountered financial difficulties and was unable to support the band beginning in early 1984.[7]\n",
            "Not long after, the group was interviewed by Radio España with the purpose of promoting one of their performances.  That is where they met Paco Martín, recent founder of the recording company, Twins.  Ricardo Chirinos, vocalist of Pistones, had suggested the group to Martín.  After listening to the interview and viewing the concert later that night, Martín was convinced that Hombres G was the group that he and fellow founder Pepe Escribano were looking for.  He talked with the group after the show and the contract was set to be signed the next day.[7]\n",
            "Recording on their debut album, Hombres G, commenced two weeks later at Trak studios under producer Paco Trinidad.  Included in the album were a new version of \"Venezia\" and \"Devuélveme a mi chica\".  The album featured two covers: \"No lloraré\", based on \"I Never Cry\" by Alice Cooper, and \"Sin Ti\", a remake of the song \"Reality\" by Romanian composer, Vladimir Cosma.[7]  The album contained a very accessible pop sound, enjoyable lyrics, and youthful romanticism.  The front cover is a still from the 1963 American science fiction comedy, The Nutty Professor.[8]\n",
            "A few weeks later, it seemed Hombres G was not going to enjoy commercial success.  Escribano became impatient and abandoned the company.  Two weeks later, radio support and album sales increased. Six months later, the album reached 50,000 copies and a year later: 150,000.  Sales eventually reached the millions.[7]\n"
         ]
      },
      "New Phase and Desayuno Continental (2009-present)": {
         "text": [
            "Hombres G finished off support for their tenth album and announced the beginning of a new phase in which Internet technology would play a major role in their music.  Instead of immediately releasing a traditional album, Hombres G released a single and music video entitled \"Separados\", exclusively through their official website.  Furthermore, they performed the songs \"Desayuno Continental\" and \"No Puedo Soportar Perderte\", in addition to \"Separados\", to a small audience at their own Pop'n'Roll bar in Madrid.[25]\n",
            "Hombres G's transition into modern Internet technology was also marked by their acquisition of Facebook and Twitter accounts and their use of those as main information outlets.  The Spanish website Popes80 christened them \"Hombres G 2.0\".[26]  In addition, \"Separados\" attained the number one spot on Popes80's Top 20 Hits chart on the week of October 6, 2009.[26]\n",
            "The name of Hombres G's new studio album was announced on September 23, 2010:  Desayuno Continental.  They presented it on November 9, 2010, at la Riviera de Madrid.  The first single released from the album was \"El Secreto de Vivir\".[27] In 2018, the group announced a joint US tour with the Argentinian band Enanitos Verdes.[28]\n"
         ]
      },
      "Popularity and promotion (1985)": {
         "text": [
            "Hombres G experienced increasing popularity.  Their first performance at the Gran Musical de la Cadena SER was scheduled for noon, as was the tradition.  However, fans began to congregate at the front door beginning at 4 in the morning.[7]\n",
            "The group made over 100 performances in 1985, in addition to television appearances and promotion in youth magazines.  Many of their fans were female adolescents and the group found itself increasingly pressured, for they could no longer stroll through the streets of any Spanish city without hordes of girls following them.[7]\n"
         ]
      },
      "Release of the first film and third album (1986-1987)": {
         "text": [
            "David's father, Manuel Summers, was one of the most popular comedy film directors in Spain.  The group received the offer to star in an autobiographic film.  The result was Sufré mamón, a movie filmed in Ibiza and Madrid, and which was set to premiere in March 1987.[12]\n",
            "Once filming was finished, Hombres G began to work on their third album.  The group didn't have much time to write new compositions, but the fast and tight lifestyle that they'd recently experienced served as inspiration.  David isolated himself for a week at a cottage his family owned in Huelva, writing 12 compositions.  For the next 15 days, the group finished work on the songs.  A week later, Hombres G left for Manchester with Chilean producer Carlos Narea, and recorded Estamos locos... ¿o qué? (Are We Crazy... Or What?).  The album featured a variety of sounds, including songs based on very rapid rhythms (such as No, no… no) and more traditional rock influences (such as Y cayó la bomba (fétida) ).  The themes of the lyrics concerned romance, intimacy, and masochistic tendencies.[12][13]\n",
            "The release of the album coincided with the release of their first film.  When the film premiered, it caused the collapse of the Gran Via Madrileña, where nearly 10,000 fans crowded the streets.  When the group arrived, dozens of journalists and graphic reporters attempted to obtain snapshots.  For security reasons, the four found themselves obligated to remain inside one room for several hours, and were unable to view the film until much later.  Their assistants faced a similar scenario: even though they were able to gain entrance to the screening, they were unable to hear it due to the deafening murmur originating from the street and the constant singing of the fans watching the film.[14]\n"
         ]
      },
      "The second album and distribution throughout the Americas (1986)": {
         "text": [
            "The group returned to Trak studios in February 1986 to begin recording their second album, La cagaste... Burt Lancaster (You Fucked Up... Burt Lancaster; named after one of their first songs).  60,000 copies of the album were ordered a month before its release.[9]  Hombres G salvaged one of the songs from the Lollipop era, \"Marta tiene un marcapasos\" — the single went on to top sales charts in Spain.[9]  The album's sound has been described as less punk and more new wave than its predecessor.  It made use of ska rhythms (\"Visite Nuestro Bar\") and was influenced by the slow sounds of the 1960s (\"Te quiero\" & \"Un par de palabras\").  The cover of the album featured an image of the American actor, Burt Lancaster, continuing Hombres G's string of references to American cinema.[10]\n",
            "Their second album was even more successful than the first.  The group began to receive proclamations of love, letters written in blood, and others in which the senders threatened suicide if they couldn't have a date with the group.  One fan from Zaragoza sent more than 200 individually numbered letters.[9]\n",
            "That summer, Hombres G went on tour, which included a performance at the Madrilenian bull arena Las Ventas, where the public began to congregate outside the venue beginning at 8 in the evening of the day before.[9]\n",
            "With a consolidated market in Spain, Paco Martín placed his bet on taking the group to the Americas.  He sent copies of their albums to companies across the American continent, receiving the first response from the Peruvian offices of CBS.  Hombres G was edited in Peru in mid-1986, and in a few weeks, the album surpassed 50,000 copies.  La cagaste… Burt Lancaster was published later, but received a similar response.[11]  The next phone call was from the central offices of CBS in New York, to distribute Hombres G throughout all of America.  Hombres G found success in México and Venezuela, where their albums obtained gold and platinum certification.  Following the summer of 1986, sales of their first two albums reached nearly a million copies in Spain.[12]\n",
            "In December 1986, the group was invited to attend the gala of the Bravo awards.  The group was nominated in three categories and won \"Mejor Agrupación de Habla Hispana\" (Best Spanish Speaking Group).[12]\n"
         ]
      },
      "Todo esto es muy extraño and tour (2004-2007)": {
         "text": [
            "For the first time in over twelve years, Hombres G released a new studio album entitled Todo esto es muy extraño (This is all very strange) in 2004. The album was produced by Nigel Walker and contained 11 new songs.  The release marked the return of Hombres G to the music scene.  The first single off the album was ¿Por qué no ser amigos? which featured the frontman from the Spanish pop/rock band El canto del loco.  No lo sé and ¿Qué soy yo para tí? were the other singles released off the album.\n",
            "Hombres G embarked on numerous tours throughout Spain, Latin America, and the United States in support of this album. The album had minimal diffusion in the Americas.[23]\n"
         ]
      },
      "Tours in Spain and the American continent (1987)": {
         "text": [
            "Endorsed by the fervor of their popularity, the group embarked on a tour of 60 performances across the bull rings and soccer stadiums of the most important Spanish cities.  That summer, nearly one million people saw Hombres G live.[15]\n",
            "In October, the group performed in America for the very first time, touring Perú, Ecuador, Chile, Venezuela, Colombia, the United States, and México.  When they arrived at Perú, the airplane windows revealed a crowd of more than 20,000 people spread across the landing runway of the Jorge Chávez International Airport.  The plane commander refused to open the doors until he knew what was happening.  Banners welcoming Hombres G could be seen everywhere.[15]\n",
            "The group was protected by four security guards at every hotel they lodged in, in order to prevent fans from seeping into their rooms — though one fan managed to accomplish the feat.[15]\n",
            "After visiting Perú and Chilé, Hombres G visited Ecuador.  They performed twice for audiences of 40,000 at each show.  Their stay in the Americas amounted to two months of intense promotional activity.[15]\n"
         ]
      }
   },
   "Notes": {},
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and the first singles (1982-1983)",
      "1.2 Live debut, a new recording contract, and the first album (1984)",
      "1.3 Popularity and promotion (1985)",
      "1.4 The second album and distribution throughout the Americas (1986)",
      "1.5 Release of the first film and third album (1986-1987)",
      "1.6 Tours in Spain and the American continent (1987)",
      "1.7 A break, the second film, and the fourth album (1988)",
      "1.8 An evolving sound and a farewell (1989-1992)",
      "1.9 Hiatus (1992-2002)",
      "1.10 Career comeback and tributes (2002-2004)",
      "1.11 Todo esto es muy extraño and tour (2004-2007)",
      "1.12 10 and tour (2007-2009)",
      "1.13 New Phase and Desayuno Continental (2009-present)",
      "2 Discography",
      "2.1 Albums",
      "2.2 Singles",
      "2.3 Live albums",
      "2.4 Compilation albums",
      "2.5 Concert films",
      "3 Filmography",
      "4 Notes",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Hombres G is a Spanish pop rock band, formed in Madrid in 1983. They are widely considered one of Spain's most prominent pop groups of the 1980s and early 1990s.[1]  The band consists of David Summers (bass, vocals), Rafael Gutierrez (guitar), Dani Mezquita (guitar), and Javi Molina (drums).\n",
         "Hombres G made their live debut at Madrid's Rock-Ola in 1983.  Their sound was influenced by the early Beatles and the British new wave movement.[2]  They found commercial success with the release of Hombres G (1985) and the song \"Devuélveme a mi chica\".  The youthful and adolescent nature of their music attracted a large audience, both at home and abroad — thousands covered the Gran Vía Madrileña during the release of their two films and Lima's Jorge Chávez International Airport was nearly closed due to the 20,000 fans that congregated on the landing runway during their first visit to Perú.[3]\n",
         "The group's sound began to expand and show more adult concerns with the albums Voy a pasármelo bien (1989) and Ésta es tu vida (1990).[4]  Hombres G went on hiatus after the release of their 1992 album, Historia del bikini.  David pursued a solo career, Rafa and Dani remained involved in the music industry, and Javi devoted time to his bar in Madrid.[2]\n",
         "The group reconvened in 2002 and released Peligrosamente Juntos, a collection of new material, demos, and hits.  Hombres G also embarked on an international tour.[2]  In 2003, a variety of groups paid tribute to them — Voy a pasármelo bien, un tributo a Hombres G was released in Europe and ¿Qué te pasa?  Estás borracho: Un tributo a Hombres G in the Americas.\n",
         "Todo esto es muy extraño (2004) was the first studio album released after the end of their hiatus.  The following year they completed a sold-out tour with the Spanish pop rock band El Canto del Loco.  Their next album, 10 (2007), received a nomination at the 2008 Latin Grammy Awards.[5]  Since then, they've released Desayuno continental (2010), En la playa (2011), 30 años y un día (2015), y Resurrección (2019).\n"
      ]
   },
   "Title": "Hombres G - Wikipedia"
}