{
   "Name": "Kortatu",
   "Sections": [
      "1 Music style",
      "2 Influences",
      "3 Demos and Tours",
      "4 The book",
      "5 Members",
      "6 Discography"
   ],
   "Summary": {
      "text": [
         "Kortatu was a Basque ska punk band from the  Basque Autonomous Community formed in Irun in the summer of 1984.\n",
         "Kortatu was born in the context of the first democracy years in Spain in 1984. They had a big significance for left-wing basque nationalism (which rejected the new constitutional project) as precursors of a new wave of music: Basque Radical Rock (Rock Radikal Vasco or RRV in Spanish). They reached a huge degree of influence in Basque and Spanish punk, as other bands like La Polla Records, Cicatriz and Eskorbuto became famous in the 80s underground scene. It was a very popular band in Basque Country, and also in the rest of Spain.\n"
      ]
   },
   "Music style": {
      "text": [
         "Although labeled from the beginning as a radical Basque rock, Kortatu tried to fight against any classification, even if political links with Herri Batasuna were evident. They also faced some censorship problems, especially when they tried to add a picture of Spanish monarch Juan Carlos I depicted as a robot. In the five year life span of the band they moved from ska to punk and even hip hop, eventually disbanding the formation after seeing Public Enemy in Paris and creating a bigger project, Negu Gorriak. Although their lyrics also evolved from \"party-ska\" to \"combat-rock\" (in their last record all the songs were sung in Basque), their style along the lines of social and political protest stayed intact.\n"
      ]
   },
   "Influences": {
      "text": [
         "They were clearly influenced by The Clash, in fact, their frontman Fermin Muguruza decided to create a ska punk band after seeing Strummer's band in a 1980 gig in Donostia.\n"
      ]
   },
   "Demos and Tours": {
      "text": [
         "They recorded a demo which included their first three songs in 1985. In the same year, they included those songs in the landmark album known as \"Four's Album\", because of the sharing with other three new bands: Cicatriz, Jotakie and Kontuz-Hi.\n",
         "That year they toured first time around all the Basque Country, and also played in Madrid and Barcelona. On May 31, played in Martutene Prison (Donostia) with Barricada. Some months later, Joseba Sarrionandia, a recognized writer and poet who was imprisoned because of his ETA membership, escaped with another prisoner, Iñaki Pikabea, inside a loudspeaker, after a gig by Imanol. Kortatu and Barricada were accused of preparing the escapes, and they were banned in any prison to play, but nothing was proved. After that they wrote their best-known song, Sarri Sarri, about the escape of Sarrionandia. In fact, it was a cover, including new lyrics, of Toots & the Maytals´ Chatty Chatty.\n"
      ]
   },
   "The book": {
      "text": [
         "The book \"El estado de las cosas de Kortatu: lucha, fiesta y guerra sucia\" (Lengua de Trapo, 2013), translated as \"The current state of Kortatu-related things: fight, party and dirty war\" was published in December 2013, written by Roberto Herreros and Isidro Lopez. This work offers an analysis of the historical context in which the radical basque rock was developed.\n"
      ]
   },
   "Members": {},
   "Discography": {},
   "coreData": [
      "Kortatu was a Basque ska punk band from the  Basque Autonomous Community formed in Irun in the summer of 1984.\n",
      "Kortatu was born in the context of the first democracy years in Spain in 1984. They had a big significance for left-wing basque nationalism (which rejected the new constitutional project) as precursors of a new wave of music: Basque Radical Rock (Rock Radikal Vasco or RRV in Spanish). They reached a huge degree of influence in Basque and Spanish punk, as other bands like La Polla Records, Cicatriz and Eskorbuto became famous in the 80s underground scene. It was a very popular band in Basque Country, and also in the rest of Spain.\n",
      "Although labeled from the beginning as a radical Basque rock, Kortatu tried to fight against any classification, even if political links with Herri Batasuna were evident. They also faced some censorship problems, especially when they tried to add a picture of Spanish monarch Juan Carlos I depicted as a robot. In the five year life span of the band they moved from ska to punk and even hip hop, eventually disbanding the formation after seeing Public Enemy in Paris and creating a bigger project, Negu Gorriak. Although their lyrics also evolved from \"party-ska\" to \"combat-rock\" (in their last record all the songs were sung in Basque), their style along the lines of social and political protest stayed intact.\n",
      "They were clearly influenced by The Clash, in fact, their frontman Fermin Muguruza decided to create a ska punk band after seeing Strummer's band in a 1980 gig in Donostia.\n"
   ],
   "infobox": {
      "Origin": [
         "Irún,  Basque Autonomous Community, Spain"
      ],
      "Genres": [
         "Punk rock, Ska, Ska-punk"
      ],
      "Years active": [
         "1984–1988"
      ],
      "Labels": [
         "Soñua",
         "Nola!",
         "Esan Ozenki",
         "Oihuka"
      ],
      "Website": [
         "http://www.kortatu.net/"
      ],
      "Past members": [
         "Fermin Muguruza",
         "Iñigo Muguruza",
         "Treku Armendariz",
         "Kaki Arkarazo"
      ]
   }
}