{
   "Name": "Los Suaves",
   "rawData": [
      "Los Suaves is a Spanish hard rock band from Ourense, Galicia. The band was founded in the 1980s by the Domínguez brothers: Charly, bassist and Yosi Domínguez, vocalist.\n",
      "The chance to record their first album, Esta vida me va a matar (This Life is going to kill me), appeared after being the support band of The Ramones in A Coruña, during one of the visits of this punk band to Europe. With this album important songs like \"Peligrosa María\" or \"Viene el tren\" were published. After eight years passed going unnoticed they achieved a real success with their third album Ese día piensa en mí (1989). This point marked the beginning of their most successful stage.\n",
      "The band is considered to be one of the best live band of the country ever.\n"
   ],
   "infobox": {
      "Origin": [
         "Ourense, Spain"
      ],
      "Genres": [
         "Rock",
         "Hard rock",
         "Heavy metal"
      ],
      "Years active": [
         "1980–present"
      ],
      "Labels": [
         "Locomotive Music"
      ],
      "Members": [
         "Yosi Domínguez",
         "Alberto Cereijo",
         "Fernando Calvo",
         "Charly Domínguez",
         "Tino"
      ]
   },
   "albums": [
      "Esta vida me va a matar",
      "Frankenstein",
      "Ese día piensa en mi",
      "Maldita sea mi suerte",
      "Suave es la noche",
      "10 años de rock",
      "Malas noticias",
      "Santa Compaña",
      "Especial acústico CADENA 100",
      "Hay alguien ahí",
      "Lo mejor de ¿Hay alguien ahí?",
      "Con el corazón",
      "San Francisco Express",
      "Víspera de todos los santos",
      "Un paso atrás en el tiempo",
      "Si yo fuera Dios",
      "El jardín de las delicias",
      "Adiós, adiós"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Ourense, Galicia. The band was founded in the [YEAR]s by the Domínguez brothers: Charly, bassist and Yosi Domínguez, vocalist.\n",
      "The chance to record their first album, Esta vida me va a matar (This Life is going to kill me), appeared after being the support band of The Ramones in A Coruña, during one of the visits of this punk band to Europe. With this album important songs like [SONG_NAME] were published. After eight years passed going unnoticed they achieved a real success with their third album Ese día piensa en mí ([YEAR]). This point marked the beginning of their most successful stage.\n",
      "The band is considered to be one of the best live band of the country ever.\n"
   ]
}