{
   "Name": "Machetazo",
   "rawData": [
      "Machetazo was a grindcore/goregrind band from A Coruña, Spain formed in 1994. They were one of the few surviving bands from the Spanish underground extreme music scene of the nineties.\n",
      "Machetazo were formed in A Coruña, Spain in 1994 as a side project of two other  death metal bands from the area.  Initially, they were more noisecore-oriented than grindcore. They recorded two demos, 46 Cabezas Aplastadas por un Yunque Oxidado in 1995, and Realmente Disfruto Comiendo Cadáveres in 1997.  The latter was an international underground success, and in 1999 was remastered by the American label Fudgeworthy Records.\n",
      "At this point Machetazo stopped being a side project and became a band in its own right, although line-up problems forced them to continue with only two members.  They recorded their first album Carne de Cementerio in 1999, which was released by Razorback Records.  After this they released numerous split singles. With Dopi as the sole surviving original member together with the new guitarist Rober, Machetazo recorded their second full length, Trono de Huesos (2002). In this work the band gives tribute to the seminal grind sound in a work in the vein of bands like Carcass or Repulsion.  After the recording of Trono de Huesos Machetazo created a more stable line-up, that still exists today:  Dopi (drums and vocals); Carlos \"Cadaver\" (bass and vocals); and Rober (guitar).\n"
   ],
   "infobox": {
      "Origin": [
         "A Coruña, Spain"
      ],
      "Genres": [
         "Grindcore, death metal[1]"
      ],
      "Years active": [
         "1994-2014"
      ],
      "Labels": [
         "Razorback Records",
         "Throne Records",
         "Living Dead Society",
         "Al Pacino Records",
         "Escorbuto Records",
         "First Blood Family",
         "Frigidity Records",
         "Goryfied Productions ",
         "Hells Headbangers",
         "Ironía Records",
         "Last House on the Right Records",
         "Relapse Records",
         "Sterilized Decay Records",
         "Upground Records"
      ],
      "Website": [
         "machetazo.org"
      ],
      "Members": [
         "Dopi",
         "Santi",
         "Rober"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band from A Coruña, Spain formed in [YEAR]. They were one of the few surviving bands from the Spanish underground extreme music scene of the nineties.\n",
      "[BAND_NAME] were formed in A Coruña, Spain in [YEAR] as a [GENRE] bands from the area.  Initially, they were more noisecore-oriented than grindcore. They recorded two demos, 46 Cabezas Aplastadas por un Yunque Oxidado in [YEAR], and Realmente Disfruto Comiendo Cadáveres in [YEAR].  The latter was an international underground success, and in [YEAR] was remastered by the American label Fudgeworthy Records.\n",
      "At this point [BAND_NAME] stopped being a [GENRE] a band in its own right, although line-up problems forced them to continue with only two members.  They recorded their first album Carne de Cementerio in [YEAR], which was released by Razorback Records.  After this they released numerous split singles. With Dopi as the sole surviving original member together with the new guitarist [PERSON_NAME_FULL_0_MALE], [BAND_NAME] recorded their second full length, Trono de Huesos ([YEAR]). In this work the band gives tribute to the seminal grind sound in a work in the vein of bands like Carcass or Repulsion.  After the recording of Trono de Huesos [BAND_NAME] created a more stable line-up, that still exists today:  Dopi (drums and vocals); Carlos \"Cadaver\" (bass and vocals); and [PERSON_NAME_FULL_0_MALE] (guitar).\n"
   ]
}