{
   "Name": "Mägo de Oz",
   "rawData": [
      "Mägo de Oz (Spanish for Wizard of Oz, with a metal umlaut) are a Spanish folk metal band from Begoña, Madrid formed in mid-1988 by drummer Txus di Fellatio.\nThe band became well known for the strong Celtic feel to their music strengthened through their consistent usage of a violinist and flautist. The name for the band was chosen, according to founding member Txus, because \"life is a yellow brick road, on which we walk in the company of others searching for our dreams.\" On the 26th of October, 2018, the band played a special concert to celebrate their 30th anniversary, playing with a symphony orchestra at the WiZink Center in Madrid. \n",
      "The band was founded in 1988 by the drummer Txus di Fellatio, who slowly recruited the rest of the members for the band, finalising the line-up by 1992. Originally, the band was called \"Transilvania\" (\"Transylvania\" in Spanish), named after an instrumental piece by Iron Maiden, a heavy influence on the band. In 1992, the band members were Txus (drums and backing vocals), Mohamed (violin), Charlie (lead guitar), Chema (rhythm guitar), Salva (bass), and  Juanma (lead vocals, backup drums). They recorded several demos: Y qué más da (in 1989), Canción de cuna para un bohemio (1990), and Con la cabeza bien alta, in 1992. Their music had a wide range of styles and influences, but was primarily based around folk metal and Celtic music.\n",
      "In 1992, the band was a finalist in the \"Concurso Villa de Madrid\", and in 1994, the band released their debut album, produced by Txus and Alberto Plaza under the name Mago de Oz. This album found very little success and people were barely aware of the band's existence. During this time, Mago de Oz went through a period of turbulence and substantial line-up changes, before the line-up that has persisted almost until the present time was formed in 1996. At this point, the lineup consisted of Txus (drums and backing vocals), Mohamed (violin and backing vocals), Carlitos (lead Guitar and backing vocals), Frank (rhythm Guitar, acoustic guitar, and backing vocals), Salva (bass and backing vocals), and José Andrëa (lead Vocals, keyboards).\n"
   ],
   "infobox": {
      "Origin": [
         "Begoña, Madrid, Spain"
      ],
      "Genres": [
         "Folk metal",
         "Celtic metal",
         "symphonic metal",
         "power metal"
      ],
      "Years active": [
         "1988–present"
      ],
      "Labels": [
         "Warner Dro Atlantic"
      ],
      "Website": [
         "magodeozoficial.com"
      ],
      "Members": [
         "Txus di Fellatio (1988–)",
         "Carlos Prieto \"Mohamed\" (1992–)",
         "J.C. Marín \"Carlitos\" (1992–)",
         "Francisco Javier Gómez de la Serna \"Frank\" (1996–)",
         "Fernando Mainer (2012–)",
         "Josema (2010–)",
         "Javi Diez (2012–)",
         "Patricia Tapia (2007–)",
         "Zeta (2012–)",
         "Manuel Seoane (2018-)"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (Spanish for Wizard of Oz, with a metal umlaut) are a Spanish folk metal band from Begoña, Madrid formed in mid-[YEAR] by drummer Txus di Fellatio.\nThe band became well known for the strong Celtic feel to their music strengthened through their consistent usage of a violinist and flautist. The name for the band was chosen, according to founding member Txus, because \"life is a yellow brick road, on which we walk in the company of others searching for our dreams.\" On the 26th of [MONTH], [YEAR], the band played a special concert to celebrate their 30th anniversary, playing with a symphony orchestra at the WiZink Center in Madrid. \n",
      "The band was founded in [YEAR] by the drummer Txus di Fellatio, who slowly recruited the rest of the members for the band, finalising the line-up by [YEAR]. Originally, the band was called \"Transilvania\" (\"Transylvania\" in Spanish), named after an [GENRE] a heavy influence on the band. In [YEAR], the band members were Txus (drums and backing vocals), Mohamed (violin), Charlie (lead guitar), Chema (rhythm guitar), Salva (bass), and  Juanma (lead vocals, backup drums). They recorded several demos: Y qué más da (in [YEAR]), Canción de cuna para un bohemio ([YEAR]), and Con la cabeza bien alta, in [YEAR]. Their music had a wide range of styles and influences, but was primarily based around folk metal and Celtic music.\n",
      "In [YEAR], the band was a finalist in the \"Concurso Villa de Madrid\", and in [YEAR], the band released their debut album, produced by Txus and Alberto Plaza under the name Mago de Oz. This album found very little success and people were barely aware of the band's existence. During this time, Mago de Oz went through a period of turbulence and substantial line-up changes, before the line-up that has persisted almost until the present time was formed in [YEAR]. At this point, the lineup consisted of Txus (drums and backing vocals), Mohamed (violin and backing vocals), Carlitos (lead Guitar and backing vocals), Frank (rhythm Guitar, acoustic guitar, and backing vocals), Salva (bass and backing vocals), and [PERSON_NAME_FULL_0_MALE] (lead Vocals, keyboards).\n"
   ]
}