{
   "Name": "The Matches",
   "rawData": [
      "The Matches were an American rock band from Oakland, California, active from 1997 to 2009. Formed as the Locals, the group changed their name after five years to avoid conflict with a Chicago band of the same name. As the Matches, they self-released their debut album E. Von Dahl Killed the Locals in 2003, then signed to Epitaph Records who re-released  it the following year. Decomposer followed in 2006, seeing the band move from their pop punk roots in a more idiosyncratic direction with contributions from nine different record producers; it reached no. 18 on Billboard's Independent Albums chart. With their third album, A Band in Hope (2008), their sound became even more heavily layered and experimental; it was their only release to chart on the Billboard 200, reaching no. 179.\n",
      "The band went on hiatus in 2009, releasing a digital album of unreleased songs and demos. Between 2014 and 2018 they reunited several times for shows and tours celebrating the ten year anniversaries of each of their studio albums, resulting in three live albums and a new single. A documentary film about the band, titled Bleeding Audio, premiered at film festivals in 2020.\n",
      "Bishop O'Dowd High School sophomores Matt Esposito (lead guitar, backing vocals) and Justin San Souci (bass guitar, backing vocals) and freshman Matt Whalen (drums, percussion) started the band in 1997. Sophomore Shawn Harris (lead vocals, rhythm guitar) saw them play at the school talent show and soon joined them: \"I offered to play second guitar and add some original songs to the mix, and we spent the next four years getting noise complaints from neighbors.\" The four named their band the Locals. In 2000 they came to the attention of Miles Hurwitz, former assistant publisher of BAM, through his eighth-grade son. He attended one of their practices, later saying that \"I saw a spark — talent, vocal charm, hook-tinged material, musical accomplishment and much potential. And much to be improved.\" Hurwitz, 28 years the bands members' senior, became their manager. He would play a critical role in their career, co-writing some songs with Harris, producing their albums, directing some of their music videos, and participating in creative decisions including planning the group's image, wardrobe, and photographs. In their later album credits, the band nicknamed him \"The Wizard.\" \"Miles kept us together,\" said Harris in 2008; \"We didn't know we could be in a band. We didn't know how to make that jump  We'll work with him forever. He's an integral part of our equation.\"\n"
   ],
   "infobox": {
      "Also known as": [
         "The Locals"
      ],
      "Origin": [
         "Oakland, California"
      ],
      "Genres": [
         "Pop punk, alternative rock"
      ],
      "Years active": [
         "1997–2009, 2014–2018"
      ],
      "Labels": [
         "Epitaph"
      ],
      "Website": [
         "thematches.com"
      ],
      "Past members": [
         "Shawn Harris",
         "Matt Esposito",
         "Justin San Souci",
         "Matt Whalen",
         "Jon Devoto",
         "Dylan Rowe"
      ]
   },
   "albums": [
      "Locals",
      "The Locals"
   ],
   "prunedData": [
      "[BAND_NAME] were an [GENRE] band from Oakland, California, active from [YEAR] to [YEAR]. Formed as the Locals, the group changed their name after five years to avoid conflict with a Chicago band of the same name. As the Matches, they self-released their debut album E. Von Dahl Killed the Locals in [YEAR], then signed to Epitaph Records who re-released  it the following year. [MONTH]omposer followed in [YEAR], seeing the band move from their pop punk roots in a more idiosyncratic direction with contributions from nine different record producers; it reached no. 18 on Billboard's Independent Albums chart. With their third album, A Band in Hope ([YEAR]), their sound became even more heavily layered and experimental; it was their only release to chart on the Billboard 200, reaching no. 179.\n",
      "The band went on hiatus in [YEAR], releasing a digital album of unreleased songs and demos. Between [YEAR] and [YEAR] they reunited several times for shows and tours celebrating the ten year anniversaries of each of their studio albums, resulting in three live albums and a new single. A documentary film about the band, titled Bleeding Audio, premiered at film festivals in [YEAR].\n",
      "Bishop O'Dowd High School sophomores Matt Esposito (lead guitar, backing vocals) and [PERSON_NAME_FULL_0_MALE] (bass guitar, backing vocals) and freshman Matt Whalen (drums, percussion) started the band in [YEAR]. Sophomore Shawn Harris (lead vocals, rhythm guitar) saw them play at the school talent show and soon joined them: [SONG_NAME]\n"
   ]
}