{
   "Name": "The Matches",
   "Sections": [
      "1 History",
      "1.1 The Locals (1997–2002)",
      "1.2 E. Von Dahl Killed the Locals (2003–2005)",
      "1.3 Decomposer and A Band in Hope (2006–2008)",
      "1.4 Hiatus and Album 4 (2009–2013)",
      "1.5 Reunions (2014–Present)",
      "2 Band members",
      "3 Discography",
      "3.1 As the Locals",
      "3.2 Studio albums",
      "3.3 Live albums",
      "3.4 Compilation albums",
      "3.5 Video albums",
      "3.6 Singles",
      "3.7 Other appearances",
      "3.8 Guest appearances",
      "3.9 Music videos",
      "4 Notes",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Matches were an American rock band from Oakland, California, active from 1997 to 2009. Formed as the Locals, the group changed their name after five years to avoid conflict with a Chicago band of the same name. As the Matches, they self-released their debut album E. Von Dahl Killed the Locals in 2003, then signed to Epitaph Records who re-released  it the following year. Decomposer followed in 2006, seeing the band move from their pop punk roots in a more idiosyncratic direction with contributions from nine different record producers; it reached no. 18 on Billboard's Independent Albums chart. With their third album, A Band in Hope (2008), their sound became even more heavily layered and experimental; it was their only release to chart on the Billboard 200, reaching no. 179.\n",
         "The band went on hiatus in 2009, releasing a digital album of unreleased songs and demos. Between 2014 and 2018 they reunited several times for shows and tours celebrating the ten year anniversaries of each of their studio albums, resulting in three live albums and a new single. A documentary film about the band, titled Bleeding Audio, premiered at film festivals in 2020.\n"
      ]
   },
   "History": {
      "The Locals (1997–2002)": {
         "text": [
            "Bishop O'Dowd High School sophomores Matt Esposito (lead guitar, backing vocals) and Justin San Souci (bass guitar, backing vocals) and freshman Matt Whalen (drums, percussion) started the band in 1997.[1][2][3][4][5] Sophomore Shawn Harris (lead vocals, rhythm guitar) saw them play at the school talent show and soon joined them: \"I offered to play second guitar and add some original songs to the mix, and we spent the next four years getting noise complaints from neighbors.\"[3][6] The four named their band the Locals.[1][2][4] In 2000 they came to the attention of Miles Hurwitz, former assistant publisher of BAM, through his eighth-grade son.[1] He attended one of their practices, later saying that \"I saw a spark — talent, vocal charm, hook-tinged material, musical accomplishment and much potential. And much to be improved.\"[1] Hurwitz, 28 years the bands members' senior, became their manager.[1] He would play a critical role in their career, co-writing some songs with Harris, producing their albums, directing some of their music videos, and participating in creative decisions including planning the group's image, wardrobe, and photographs.[1] In their later album credits, the band nicknamed him \"The Wizard.\"[1] \"Miles kept us together,\" said Harris in 2008; \"We didn't know we could be in a band. We didn't know how to make that jump [...] We'll work with him forever. He's an integral part of our equation.\"[1]\n",
            "After graduating, Esposito left the band to attend the United States Naval Academy, and was replaced by Jon Devoto.[1] The Locals self-released a six-song demo and a three-song EP.[citation needed] The band members took jobs as kitchen hands at historic San Francisco music venue the Fillmore, where they would watch bands perform weekly; Harris worked as a cook while Whalen and San Souci were servers, hoping that this would get their band an opportunity to perform there.[1][3] They took vocal lessons, and Hurwitz expanded their musical palette by having them listen to albums by Elvis Costello, Joe Jackson, and Bob Dylan.[1] \"He was a history teacher for a while,\" said Harris; \"He made what we were doing seem more important and relevant. Subtly at first and then more and more, that set us apart from the other bands in the genre we play in.\"[1]\n",
            "The Locals built up a following in the East Bay.[1][4] Not readily accepted by the entrenched punk rock scene based around the 924 Gilman Street venue in Berkeley, they instead become popular at Oakland all ages venue iMusicast, where they launched a series of shows called \"L3: Live, Loud, and Local.\"[1][2][4] \"We could barely play,\" said Harris in 2016; \"like we broke all of our amps at every show, I spent more time crowd surfing than playing my guitar. I couldn't really tell you how to play a power chord at the time; we barely could play. But we put on this show that people came to and they freaked out, so I started focusing on lyrics and making songs have more substantial content.\"[7] They engaged in what they called \"commo promo\" tactics (short for \"commotion promotion\"), playing brief, unannounced acoustic sets outside schools, dormitories, shopping malls, restaurants, and music venues such as Slim's.[1][4] They would go to local high schools, enter classes that were in session, toss stacks of flyers in the air, and run through the halls strumming their guitars and singing their songs until they were chased off campus.[7] These tactics were successful in drawing hundreds of young fans to their shows.[7] \"We didn't mean to start a completely different scene,\" recalled Harris a few years later, \"but we ended up doing so. While I love punk rock, I also don't love punk rock. I think it's just as much of a dick as it is a savior. I love Bad Religion and Rancid and Green Day, but I'm not gonna throw my fist up in the air for the institution of punk rock.\"[2]\n",
            "In late 2002 the group was contacted by a Chicago band also called the Locals, led by frontwoman Yvonne Doll, threatening a copyright infringement lawsuit if they did not change their name.[4][8][7] They complied, renaming themselves the Matches.[4]\n"
         ]
      },
      "E. Von Dahl Killed the Locals (2003–2005)": {
         "text": [
            "The Matches recorded their debut album, E. Von Dahl Killed the Locals, in a series of basements and living rooms and self-released it in February 2003.[4][8] The title was a tongue-in-cheek reference to Yvonne Doll and the band's forced name change.[4][8] Harris and San Souci created the album's artwork (Harris also co-designed the artwork for Earlimart's 2004 album Treble & Tremble).[9][10] Through self-promotion and performances with bands including Reel Big Fish, Lit, and Zebrahead, the Matches gained attention for their energetic live shows and sold over 4,000 copies of the album without the support of a record label.[4][8] A show at the House of Blues in Anaheim, California on October 21, 2003 was filmed, and released the following July as part of Kung Fu Records' live concert DVD series The Show Must Go Off![11] The band contributed the song \"December Is for Cynics\" to the compilation A Santa Cause: It's a Punk Rock Christmas, released in November 2003.[4][12]\n",
            "By year's end, the Matches had signed to Epitaph Records.[4][13] The label had E. Von Dahl Killed the Locals re-mixed by Joe Barresi and re-released it in May 2004 with a slightly altered track list.[4][8] The Matches performed on that summer's Warped Tour, which they would repeat in the three subsequent years.[4][7] They appeared, along with the A.K.A.s, as guests on the Dwarves track \"Kids Today\" on the compilation Rock Against Bush, Vol. 2, released in August 2004.[14] That November, a music video was released for the song \"Chain Me Free,\" and the band went on tour opening for Yellowcard.[2][15]\n",
            "At this time, the Matches' music was rooted in pop punk.[16] Reviewing the re-release of E. Von Dahl Killed the Locals, Rolling Stone remarked that the band \"join the long list of punk-pop bands that have made their clichéd mark on today's music scene\" and \"wear the influences of Green Day and Rancid proudly.\"[17] The Dallas Observer called it \"an energetic romp through the same ideas lots of pop-punk bands romp through: broken relationships, boredom, depression, the lure of the road,\" while AllMusic remarked that the band was \"young enough not to raise eyebrows at the punk-pop kiddie park. But they have a better grasp of dynamics than much of their peer group.\"[2][8]\n",
            "The Matches teamed up with Zebrahead for a cover version of Oingo Boingo's rendition of the Willie Dixon song \"Violent Love,\" released in May 2005 on Dead Bands Party: A Tribute to Oingo Boingo.[18] That July saw the release of Takeover Records 3-Way Issue No. 2, a split album which they shared with Near Miss and Reeve Oliver, with each band contributing three tracks.[4][19] Harris and San Souci created the artwork for the album (they would later co-create the artwork for Newbury Park group Stole Your Woman's 2007 album The Scene).[20][21] The Matches played the Warped Tour again that summer.[7] Harris began illustrating with Melbourne-based artist Emilee Seymour; together they formed the design firm Oxen, creating the artwork for the next two Matches albums as well as for Epitaph labelmates Matchbook Romance's 2006 album Voices.[22][23][24][25][26][27][28][29]\n"
         ]
      },
      "Decomposer and A Band in Hope (2006–2008)": {
         "text": [
            "The Matches made a guest appearance on MC Lars's album The Graduate, released in March 2006, performing on the track \"Hot Topic Is Not Punk Rock.\"[7][30] After a stint on that year's Warped Tour, their second album, Decomposer, was released on Epitaph that September.[4][16] The album was recorded at various studios with nine different producers, including Hurwitz, Matt Rad, Mark Hoppus of Blink-182, Tim Armstrong of Rancid, Brett Gurewitz of Bad Religion, Nick Hexum of 311, and John Feldmann of Goldfinger.[4][7][16] It built on their prior pop punk sound, adding idiosyncratic elements of pop, rock, punk, and electronics.[16] Singles were released for the songs \"You (Don't) Know Me\" and \"Salty Eyes,\" and music videos for \"Papercut Skin\" and \"Salty Eyes.\" Hurwitz directed and came up with the concept for the \"Salty Eyes\" video, an homage to the D. A. Pennebaker film Dont Look Back (1967), in which Bob Dylan's song \"Subterranean Homesick Blues\" plays while Dylan holds up and discards cue cards with selected words and phrases from the lyrics; in their video, the Matches replaced the cue cards with old television sets, creating a chaotic scene.[1] A few weeks after its release, Decomposer peaked at number 18 on Billboard's Independent Albums chart.[31] Extensive touring followed: By March 2008, the Matches had done four tours of Australia (including that year's Soundwave festival), seven of Europe (including their first headlining club tour of the United Kingdom), and three Warped Tours.[1][4]\n",
            "Their third album, A Band in Hope, was released in March 2008, and the band embarked on that spring's Alternative Press Tour with All Time Low, The Rocket Summer, and Forever the Sickest Kids to support it.[1][32] The album found the band moving further away from pop punk, incorporating elements of album-oriented rock, mainstream Top 40 paradigms, and alternative rock.[32] The San Francisco Chronicle called it \"a tidy mass of musical ideas — metal, glam and punk all mingle, lots of vocals, textured, carefully layered sound, sometimes like a pocket-size Queen.\"[1] An AllMusic review also drew a comparison to Queen, as well as to Andrew Lloyd Webber, saying \"the Matches don't seem to know exactly what they're doing [...] big chunks of A Band in Hope are almost shockingly unexpected, verging at times on just plain weird.\"[32] Reflecting on the album a year and half later, Harris remarked that \"on Decomposer and A Band in Hope, we played around with a lot of studio tricks—especially Decomposer, which was us learning about a bunch of studio tricks. And then on A Band in Hope, we got carried away a number of times.\"[33] \"Wake the Sun\" was released as the album's single, and music videos were released for it and \"Yankee in a Chip Shop.\" According to Harris, Epitaph did not expect the album to perform well commercially, but opted to release it anyway.[33] It ultimately reached number 24 on the Independent Albums chart, number 179 on the Billboard 200, and number 99 on Australia's ARIA Charts.[31][34][35]\n"
         ]
      },
      "Hiatus and Album 4 (2009–2013)": {
         "text": [
            "–Shawn Harris in 2009\n",
            "Founding bassist Justin San Souci left the Matches in July 2008; he went on to become a concept artist for a video game company.[36][37] He was replaced by Dylan Rowe, who toured with the band that fall.[38] Creative differences were forming between the band members: A year later, lead guitarist Jon Devoto stated that he had wanted the band's new music to be \"a little more straightforward. A little bit less quirky, indefinable. I want to keep the element of cleverness to a certain point, because that was one of the best points about us, our cleverness and all that. But there was also a point where every song was completely different and I think we lost a lot of opportunities with that.\"[39] Harris stated that \"There were really conflicting views within the band as to what the direction should be. For me, the direction has always been, 'Well, I wanna do what is fun when it comes to music and hopefully other people find what I find fun and enjoyable also fun and enjoyable.' There were definitely heated debates over, first off, how commercial a song should be, and second off, over what makes a song commercial in the first place.\"[33]  Their recording contract with Epitaph fulfilled, the band began writing and recording demos for a potential fourth album, but found these differences difficult to overcome.[33] Harris later reflected:\n",
            "We got really ambitious, and part of that paid off in a great way, because we were really creative, and we experimented with all types of music and different producers and became this weird, arty pop-punk band. But at the same time, we got wrapped up in [the industry]: \"You need to play for more people, you need to play for more people, you need to play for more people. You need to impress promoters.\" We tried to be bigger than we should've been. When I look at the appeal of the band originally—being this sort of homespun, DIY pop-punk band who put on their own shows and make their own clothes—we were like your friend's band, but your friend's good band. Our fans liked being around us. As things progressed, there was more of a separation between us as performers and our fans. Even the sound of the music became less like you're talking to your friends and more sort of ambitiously epic, maybe. I think we always retained that conversational style, but it was really all we were at the beginning. I'm not saying we lost that completely, but it got swept up in us trying to be a bigger band. I think the appeal for our band might've been that we were your friend's band.[37]",
            "Hurwitz sent the band's new demos out to major record labels, attempting to get them a new recording contract, but the labels wanted them to alter the songs to make them more marketable.[33] \"There seemed to be some kind of core ideology that was sort of at risk of being compromised from within and without,\" said Harris, who at the same time had begun working on a new musical project with Jake Grigg of Australian band Something with Numbers.[33] Devoto, meanwhile, had been working on his own material which Hurwitz helped him develop into an acoustic project.[39] Additionally, the impact of the Great Recession affected the band's ability to tour: with their extensive touring schedules, they would stay with friends or with their parents when home, but as fuel prices and other costs increased, they could no longer break even on tours and were starting to accrue debt.[33] They decided to stay home and record, and only tour when it would be lucrative, but such opportunities became fewer and further between.[33] \"So we were home longer and longer,\" said Harris, \"which meant we were homeless longer and longer or crashing at our parents' longer and longer.\"[33]\n",
            "The Matches announced a hiatus on July 9, 2009.[33][39] On August 12, they released a collection of their most recent demos and unreleased songs digitally as The Matches Album 4, Unreleased; Graphics? Title? Or Not Needed?; the title was the subject line of an email from Hurwitz asking about the proposed album.[33][39] \"The album name is basically making fun of our manager's verbose e-mails,\" said Harris; \"[The title] was just the subject header [of his e-mail], and it had all these semicolons and like a four-way conjunction, so we just sent back the shortest e-mail saying, 'That's the title.' He tried to get us to change it a number of times, but we were like, 'Nope. That's it.'\"[33] The band played a pair of sold out farewell shows on August 22 at the Troubadour in West Hollywood and August 23 at the Fillmore in San Francisco.[33][39] Harris said of the latter that \"the final show was I think the Matches' best show. We sold out the Fillmore which is where I used to make nachos as a kid—it was one of my first jobs. It was a really weird, full-circle vindication of a dream. It was a really nice goodbye.\"[33]\n",
            "With the Matches on hiatus, Devoto fleshed out his acoustic project into a full band called Bird by Bird, while Harris and Grigg named their project Maniac.[33][39] Between 2010 and 2011 Bird by Bird released two EPs and one album, while Maniac released one EP and one album.[citation needed] Harris then started a new project, Fortress Social Club, who released two albums and an EP in 2013.[40] Harris also continued to work as a visual artist, contributing to the album artwork of Bayside's Shudder (2008) and Milo Greene's Milo Greene (2012) and Control (2015).[41][42][43][44][45][46]\n"
         ]
      },
      "Reunions (2014–Present)": {
         "text": [
            "In January 2014, Shawn Harris, Justin San Souci, Matt Whalen, and Jon Devoto met while all were back in Oakland.[37] Their licensing deal with Epitaph Records for E. Von Dahl Killed the Locals had expired, so they decided to re-release it themselves as an LP record (the original releases had been in compact disc format) to coincide with the ten-year anniversary of the Epitaph release.[37][47] They began teasing the release through social media, prompting inquiries and demand for a reunion concert.[37] That May, they announced a one-time reunion show to take place in November at Slim's in San Francisco.[48] It sold out immediately, as did a second date added at Slim's and a third at the Great American Music Hall.[37] Due to the unexpected demand, further reunion shows were added in Los Angeles, New York and Chicago.[37] The re-release of E. Von Dahl Killed the Locals came out that September as a two-disc package, including both the original self-released version of the album and the re-mixed Epitaph version.[47] The band ended up performing nine sold out shows in the United States, playing the album in its entirety as well as some later songs.[49] Two performances at the Troubadour in Los Angeles were recorded, and released as the live album 10YearsEVDKTL in December.[49] This was followed by a five-date tour of Australia in January 2015.[50]\n",
            "In October 2015 the Matches released a new single, \"Life of a Match,\" with \"Crucial Comeback Song (Mary Claire)\" as the B-side.[51][52] Harris and San Souci created the artwork for the single.[53] A music video for \"Life of a Match\" was released, consisting of snippets of other bands' music videos as well as the Matches' own past ones.[52] The band played two shows at the Fillmore that December.[51][52] Harris started a solo surf rock project called St. Ranger, releasing the album Leaves L.A. in February 2016.[54] Later that year, to celebrate the ten-year anniversary of Decomposer, the Matches re-released the album as a double LP; the second disc, titled Precomposer, consisted of demos the band had recorded while writing the album.[55] That April they released an animated music video for the Decomposer song \"Little Maggots\"; they had begun work on the video in 2006 but left it unfinished.[56] In May and June the Matches played three shows in Australia and five in the United States, performing Decomposer in full.[56][57] A performance at the Teragram Ballroom in Los Angeles was recorded, and released digitally as the live album Recomposer.[citation needed]\n",
            "The band next reconvened in 2018 for the ten year anniversary of A Band in Hope.[58] As with their previous two records, they re-released the album as a double LP; the second disc, titled Don't Shake My Hand with Your Sunglasses On, collected demos and unreleased tracks associated with the album.[58] The Matches played six shows in the United States performing A Band in Hope in full, and released a digital live album titled Aband1nh0pe.[58] Meanwhile, filmmaker Chelsea Christer, who had filmed interviews with the band members to promote their 2014 reunion, expanded upon her footage to create a documentary film about the band, titled Bleeding Audio.[59] The documentary, which features interviews with Warped Tour founder Kevin Lyman, Tom Higgenson of Plain White T's, and Justin Pierre of Motion City Soundtrack, finished filming in 2016.[59] It was screened at several film festivals in 2020.[60]\n",
            "Announcement of a possible 4th studio album was announced by The Matches via livestream, with a performance of one of the potential songs on February 13, 2021.\n"
         ]
      }
   },
   "Band members": {},
   "Discography": {
      "As the Locals": {},
      "Studio albums": {},
      "Live albums": {},
      "Compilation albums": {},
      "Video albums": {},
      "Singles": {},
      "Other appearances": {
         "text": [
            "This is not an exhaustive list. Tracks taken from the band's other releases are not included.\n"
         ]
      },
      "Guest appearances": {},
      "Music videos": {}
   },
   "Notes": {
      "text": [
         "^I  The music video for \"What Katie Said\" (from Decomposer) was filmed in January 2007, but the production company was unable to complete the visual effects until February 2008, by which time the band was preparing to release A Band in Hope and so chose not to release the video. The production company released it unofficially.[61]\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Matches were an American rock band from Oakland, California, active from 1997 to 2009. Formed as the Locals, the group changed their name after five years to avoid conflict with a Chicago band of the same name. As the Matches, they self-released their debut album E. Von Dahl Killed the Locals in 2003, then signed to Epitaph Records who re-released  it the following year. Decomposer followed in 2006, seeing the band move from their pop punk roots in a more idiosyncratic direction with contributions from nine different record producers; it reached no. 18 on Billboard's Independent Albums chart. With their third album, A Band in Hope (2008), their sound became even more heavily layered and experimental; it was their only release to chart on the Billboard 200, reaching no. 179.\n",
      "The band went on hiatus in 2009, releasing a digital album of unreleased songs and demos. Between 2014 and 2018 they reunited several times for shows and tours celebrating the ten year anniversaries of each of their studio albums, resulting in three live albums and a new single. A documentary film about the band, titled Bleeding Audio, premiered at film festivals in 2020.\n",
      "Bishop O'Dowd High School sophomores Matt Esposito (lead guitar, backing vocals) and Justin San Souci (bass guitar, backing vocals) and freshman Matt Whalen (drums, percussion) started the band in 1997.[1][2][3][4][5] Sophomore Shawn Harris (lead vocals, rhythm guitar) saw them play at the school talent show and soon joined them: \"I offered to play second guitar and add some original songs to the mix, and we spent the next four years getting noise complaints from neighbors.\"[3][6] The four named their band the Locals.[1][2][4] In 2000 they came to the attention of Miles Hurwitz, former assistant publisher of BAM, through his eighth-grade son.[1] He attended one of their practices, later saying that \"I saw a spark — talent, vocal charm, hook-tinged material, musical accomplishment and much potential. And much to be improved.\"[1] Hurwitz, 28 years the bands members' senior, became their manager.[1] He would play a critical role in their career, co-writing some songs with Harris, producing their albums, directing some of their music videos, and participating in creative decisions including planning the group's image, wardrobe, and photographs.[1] In their later album credits, the band nicknamed him \"The Wizard.\"[1] \"Miles kept us together,\" said Harris in 2008; \"We didn't know we could be in a band. We didn't know how to make that jump [...] We'll work with him forever. He's an integral part of our equation.\"[1]\n",
      "After graduating, Esposito left the band to attend the United States Naval Academy, and was replaced by Jon Devoto.[1] The Locals self-released a six-song demo and a three-song EP.[citation needed] The band members took jobs as kitchen hands at historic San Francisco music venue the Fillmore, where they would watch bands perform weekly; Harris worked as a cook while Whalen and San Souci were servers, hoping that this would get their band an opportunity to perform there.[1][3] They took vocal lessons, and Hurwitz expanded their musical palette by having them listen to albums by Elvis Costello, Joe Jackson, and Bob Dylan.[1] \"He was a history teacher for a while,\" said Harris; \"He made what we were doing seem more important and relevant. Subtly at first and then more and more, that set us apart from the other bands in the genre we play in.\"[1]\n"
   ]
}