{
   "Name": "Mecano",
   "rawData": [
      "Mecano was a Spanish pop band formed in 1981 and active until 1992. Mecano became one of the most successful Spanish pop bands of all time. The band is still the best-selling Spanish band, with over 25 million records worldwide. They were considered by some to be avant-garde for their time and part of la Movida Madrileña countercultural movement. They had a brief comeback in 1998.\n",
      "The band's line-up was singer Ana Torroja and brothers Nacho and José María Cano, who worked alongside session musicians such as Arturo Terriza, Manolo Aguilar, Nacho Mañó, Javier Quílez, Ángel Celada and Óscar Astruga. The trio's musical career spanned two distinct stages. The first, up to 1985, was essentially as a synthpop band, while in the second stage Mecano followed a more acoustic pop rock direction, with elements of ballad, dance, flamenco, bossa nova, tango, salsa, rumba flamenca, bolero, pasodoble, and even reggae.\n",
      "The unprecedented success also hit Hispanic America. Also, thanks to adaptations to other languages of several of their songs, they influenced non-Spanish speaking countries such as Italy and France, as with their Une femme avec une femme. This foreign song still holds the record for most weeks spent at the top of the French charts. In 2005, Mecano's music was adapted into the successful musical Hoy no me puedo levantar, which opened productions in Spain and Mexico. After two years, it was announced that the musical had been seen by more than 1,500,000 spectators in both countries, making it the most successful original production in Spanish of all times.\n"
   ],
   "infobox": {
      "Origin": [
         "Madrid, Spain"
      ],
      "Genres": [
         "Pop, synthpop, new wave, pop rock"
      ],
      "Years active": [
         "1981–1992, 1998"
      ],
      "Labels": [
         "CBS, Sony BMG"
      ],
      "Associated acts": [
         "Genesis",
         "Amaia Montero",
         "La Oreja De Van Gogh",
         "Alaska y Dinarama",
         "Presuntos Implicados",
         "Ultravox",
         "Nacha Pop",
         "La Union",
         "Elisa Rego"
      ],
      "Past members": [
         "Ana Torroja",
         "Nacho Cano",
         "José María Cano"
      ]
   }
}