{
   "Name": "Nahemah (band)",
   "rawData": [
      "NahemaH was a Spanish heavy metal band from Alicante, Spain, that was formed in 1997. Since then, they have released four albums. Nahemah are currently signed to Lifeforce Records.\n",
      "Nahemah was formed in 1997 in Alicante, Spain. In 1999, their debut album, Edens in Communion, was independently released. In 2001, being signed to Iberian Moon Records, Nahemah released their second album, Chrysalis. The album received positive feedback and was re-released by Concreto Records. Nahemah also were an opening act for bands such as Moonspell and Alastis.\n",
      "During 2003, Nahemah recorded an EP titled The Last Human, which remains unreleased. Following the recording of the unreleased EP, the band had line-up problems. \n"
   ],
   "infobox": {
      "Origin": [
         "Alicante, Spain"
      ],
      "Genres": [
         "Progressive death metal, melodic death metal, death/doom, gothic metal, symphonic black metal"
      ],
      "Years active": [
         "1997-2012"
      ],
      "Labels": [
         "Iberian Moon Records",
         "Concreto Records",
         "Lifeforce Records"
      ],
      "Associated acts": [
         "Amalthea",
         "Nahrayan"
      ],
      "Website": [
         "Nahemah @ Myspace"
      ],
      "Members": [
         "Pablo Egido",
         "Miguel Palazón",
         "Roberto Marco",
         "Paco Porcel",
         "Enrique Perez \"Fabique\""
      ],
      "Past members": [
         "Henry Saiz",
         "Luis Martinez",
         "Jose Carlos Marhuenda",
         "Daniel Gil",
         "Javier Fernandez",
         "Jose Diego",
         "Quino Jimenez"
      ]
   },
   "prunedData": [
      "NahemaH was a [GENRE] band from Alicante, Spain, that was formed in [YEAR]. Since then, they have released four albums. [BAND_NAME] are currently signed to Lifeforce Records.\n",
      "[BAND_NAME] was formed in [YEAR] in Alicante, Spain. In [YEAR], their debut album, Edens in Communion, was independently released. In [YEAR], being signed to Iberian Moon Records, [BAND_NAME] released their second album, Chrysalis. The album received positive feedback and was re-released by Concreto Records. [BAND_NAME] also were an [GENRE] bands such as Moonspell and Alastis.\n",
      "During [YEAR], [BAND_NAME] recorded an [GENRE] band had line-up problems. \n"
   ]
}