{
   "Name": "Nena Daconte",
   "Sections": [
      "1 Early years",
      "2 Discography",
      "2.1 He Perdido los Zapatos (2006)",
      "2.2 Retales de Carnaval (2008)",
      "2.3 Una Mosca en el Cristal (2010)",
      "2.4 Solo muerdo por ti (2013)",
      "2.5 Suerte ... (2019)",
      "3 Awards and nominations",
      "4 Singles",
      "5 Other projects",
      "6 Notes",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Nena Daconte (Spanish pronunciation: [ˈnena ðaˈkonte])[a] is a Spanish pop band created and led by singer and composer Mai Meneses in Barcelona circa 2005. The band takes its name inspired by a character from the short story \"The Trail Of Your Blood On The Snow\", by Gabriel García Márquez.\n",
         " \n\"The Trail of Your Blood in the Snow\" depicts the opposite extreme of the social spectrum. Billy Sánchez, the spoiled son of a rich Colombian, is honeymooning with his bride, Nena Daconte, in Europe, when the girl inexplicably pricks herself with a thorn and bleeds to death. When the wound initially occurs, Billy is too self-absorbed to pay much attention, but he finally realizes that something is seriously wrong and deposits his young wife in a hospital in Paris.                                                                                                                                        "
      ]
   },
   "Early years": {
      "text": [
         "Fanlo left the formation and Mai Meneses continues as the lead singer and songwriter of Nena Daconte.  Before the creation of Nena Daconte, Mai Meneses participated in the second edition of a Spanish TV singing contest called Operacion Triunfo.\n"
      ]
   },
   "Discography": {
      "He Perdido los Zapatos (2006)": {
         "text": [
            "Nena Daconte's first album was titled He perdido los zapatos (I´ve Lost My Shoes) and it was edited and produced by Daconte Music, the band's own record label, in 2005.  Shortly after, Nena Daconte signed with music label Universal Music Spain, and the album was released and sold to the public on March 27, 2006.[1]  The music and lyrics of the record were composed by Mai Meneses,[2]  based on early drafts written by her during previous years. \n",
            "Idiota (Idiot) was their first single. Later editions of the album included a new version of Idiota produced by Carlos Jean and mastered in New York City. Idiota reached number 25 of the Spanish billboard charts.\n",
            "The second single was En que estrella estará (In What Star Will It Be).  The song was selected to be the official theme for the Vuelta Ciclista a España (Spanish Cycling Tour) of 2006. For this promoting event, Nena Daconte filmed a videoclip[3] along with Spanish Hollywood actor Antonio Banderas.  En que estrella estará reached the number 1 position[4] on the Spanish billboard charts for 5 weeks.\n",
            "Nena Daconte's debut album went Gold in Spain.  Later on that same year, Nena Daconte was nominated for an MTV Europe Music Awards.\n",
            "In 2006, Nena Daconte was awarded the Premio Ondas (Spanish music Award) for Best Spanish Breakout Artist.[5]\n",
            "In 2007, Nena Daconte released a luxury edition of He perdido los zapatos with new bonus tracks, including acoustic versions of the songs Engáñame a mi también (Fool Me Too) and Pierdo el tiempo (Wasting My Time), as well as a cover of Bob Dylan´s song The Mighty Quinn, which featured in the Spanish TV spot of Codorniu.[6] Aside from these new songs, the luxury edition also included a DVD with updated artwork, pictures and interviews.\n",
            "The He perdido los zapatos tour featured more than 100 concerts throughout Spain. The band also played live in Berlin (Pop-Konn Festival) and Paris.\n"
         ]
      },
      "Retales de Carnaval (2008)": {
         "text": [
            "Their second album, titled \"Retales De Carnaval\", was released in Spain on September 30, 2008, two years after the debut record. As with the first record, this second album was entirely composed by Mai Meneses.\n",
            "The first single to air on the radio was Tenia tanto que darte (I Had a Lot To Give You), and it premiered in August 2008. On November of that same year, Tenia tanto que darte reached the number 1 position on the Spanish billboard chart (40 Principales), clinching it for two consecutive weeks.[7] For the video of the single, Nena Daconte worked along with producer Marc Lozano of Nanouk Films.[8]\n",
            "Tenia tanto que darte became Spain's Best Selling song of 2008 on iTunes. Likewise, record sales made the album become Platinum in September 2009.[9] The song's music video has over 5 million views on YouTube.[10]\n",
            "El Aleph (The Aleph) was Nena Daconte's second single for this album. The title of the song was based on the book written by Argentinian writer Jorge Luis Borges in 1949.\n",
            "On the burning February morning Beatriz Viterbo died, after braving an agony that never for a single moment gave way to self-pity or fear, I noticed that the sidewalk billboards around Constitution Plaza were advertising some new brand or other of American cigarettes. The fact pained me, for I realised that the wide and ceaseless universe was already slipping away from her and that this slight change was the first of an endless series. The universe may change but not me, I thought with a certain sad vanity. I knew that at times my fruitless devotion had annoyed her; now that she was dead, I could devote myself to her memory, without hope but also without humiliation.\nBeginning paragraphs of The Aleph, by Jorge Luis Borges\n",
            "The videoclip for El Aleph aired on February 26, 2009.  It was directed by Juan Antonio Bayona (director of The Impossible and winner of the 2008 Premio Goya for El orfanato)[11] and filmed at Barcelona's Meridiana district.  This song reached the number 5 position in the Spanish billboard chart (40 principales).\n",
            "The third single was Ay! Amor (Oh! Love) which came out almost simultaneously along with Nena Daconte's collaboration with Argentinian composer Coti in the song Perdóname. \n",
            "The Retales de carnaval tour featured more than 150 live shows throughout Spain, including performances at the Teatro Español[12] in Madrid and the Palacio de la Musica Catalana in Barcelona.\n"
         ]
      },
      "Una Mosca en el Cristal (2010)": {
         "text": [
            "In 2010, Nena Daconte released its third album titled Una mosca en el cristal, produced by Alejo Stivel.[13] The single No te invite a dormir (I Didn't Invite You Over)[14] reached number 17 on the Spanish billboard charts (40 Principales).\n",
            "In February 2011, Perdida (Lost) was released as the second single.[15]  On that same year, Nena Daconte started an acoustic tour throughout Spain under the name Nena Daconte Club.[16]\n",
            "Likewise, in late 2011, Nena Daconte participated on a tribute album for Antonio Vega, giving voice to the song Tesoros along with composer LA (native singer from Mallorca).\n",
            "In 2012, Nena Daconte took a role in the single Pero si tu no estás, which was the main theme and soundtrack of \"La Fuga\", a Spanish TV series.[17]\n"
         ]
      },
      "Solo muerdo por ti (2013)": {
         "text": [
            "On April 30, 2013, Nena Daconte released in Spain their fourth studio álbum titled “Solo muerdo por ti”.[18] It was recorded in Madrid at estudios Sonobox and produced by Manuel Colmenero and Jabibu Carretero (Vetusta Morla, Eladio y los seres queridos).[19]\n",
            "The álbum contains 13 new songs[20] (plus two more tracks in their digital edition), all composed by Mai Meneses. The album takes its title from the nursery rhyme that she composed for her son (track number 13).[21]  On the same day of its debut, Solo muerdo por ti became number 1 in sales in iTunes Spain.[22]\n",
            "According to Mai Meneses “I feel that this album is more mature and I have meditated each phrase for almost two years… there is nothing left to chance, everything is measured: every lyric, step, there is lots of work.[23]”\n",
            "As per the critics, the album is “clear and direct”. As for its sound, it is as genuine as the origins of Nena Daconte.[24] \nThe first single is title “Dispare” and it aired for the first time on March 5, 2013.  The music video was recorded at the abandoned factory of Pegaso, at the outskirts of Madrid and produced by Zoo and SevenSenses.[25]\n"
         ]
      },
      "Suerte ... (2019)": {
         "text": [
            "After living for some years in Dallas, Texas with her family, seeking rest and inspiration, she resumed her musical production.[26]\n",
            "In March of 2019, the band´s fifth studio album, titled “Suerte”, was released, produced by well-known Spanish pop producer, Paco Salazar,[27] in Madrid, Spain. The album has 7 songs.\n"
         ]
      }
   },
   "Awards and nominations": {},
   "Singles": {
      "text": [
         "Position (40 Principales)\n"
      ]
   },
   "Other projects": {},
   "Notes": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Nena Daconte (Spanish pronunciation: [ˈnena ðaˈkonte])[a] is a Spanish pop band created and led by singer and composer Mai Meneses in Barcelona circa 2005. The band takes its name inspired by a character from the short story \"The Trail Of Your Blood On The Snow\", by Gabriel García Márquez.\n",
      " \n\"The Trail of Your Blood in the Snow\" depicts the opposite extreme of the social spectrum. Billy Sánchez, the spoiled son of a rich Colombian, is honeymooning with his bride, Nena Daconte, in Europe, when the girl inexplicably pricks herself with a thorn and bleeds to death. When the wound initially occurs, Billy is too self-absorbed to pay much attention, but he finally realizes that something is seriously wrong and deposits his young wife in a hospital in Paris.                                                                                                                                        ",
      "Fanlo left the formation and Mai Meneses continues as the lead singer and songwriter of Nena Daconte.  Before the creation of Nena Daconte, Mai Meneses participated in the second edition of a Spanish TV singing contest called Operacion Triunfo.\n",
      "Nena Daconte's first album was titled He perdido los zapatos (I´ve Lost My Shoes) and it was edited and produced by Daconte Music, the band's own record label, in 2005.  Shortly after, Nena Daconte signed with music label Universal Music Spain, and the album was released and sold to the public on March 27, 2006.[1]  The music and lyrics of the record were composed by Mai Meneses,[2]  based on early drafts written by her during previous years. \n"
   ],
   "infobox": {
      "Also known as": [
         "Mai Meneses"
      ],
      "Origin": [
         "Madrid, Barcelona "
      ],
      "Genres": [
         "Pop"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Universal Music Spain"
      ],
      "Website": [
         "www.nenadaconte.com"
      ],
      "Members": [
         "Mai Meneses (Vocals, Composer & Writer)"
      ]
   }
}