{
   "Name": "Nosoträsh",
   "rawData": [
      "Nosoträsh is a Spanish pop music band formed in Gijon in 1994. Along with releasing records on the influential Elefant Records in Spain, Nosoträsh released a single in January 2007 in the United States with Hugpatch Records.\n",
      "The group is made up of five women: Bea, Cova, Malela, Montse, and Natalia. Also Eugenia was a member of the group, but she left. The setup of the band is as follows: Natalia sings; Bea plays the guitar; Malela plays the guitar and sings; Montse plays the bass and sings; and Cova plays the drums. Eugenia played the bass.\n",
      "One 1994 night in a bar of Gijón, the five music-lover friends are cheerfully talking, when the possibility of making up a new music group arises. That very night, the group has chosen a name and the roles have been assigned. So they start to practise, and they compose some songs.\n"
   ],
   "infobox": {
      "Origin": [
         "Gijón, Spain"
      ],
      "Genres": [
         "Indie rock"
      ],
      "Years active": [
         "1996—present"
      ],
      "Labels": [
         "Elefant Records"
      ],
      "Website": [
         "[1], [2]"
      ],
      "Members": [
         "Bea, Cova, Malela, Montse, Natalia"
      ]
   },
   "albums": [
      "Nadie hablará de... Nosoträsh (nobody will talk about us)",
      "Mi vida en un fin de semana (my life in a weekend)",
      "Popemas (\"popemas\")",
      "Cierra la puerta al salir (close the door when leaving)"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band formed in Gijon in [YEAR]. Along with releasing records on the influential Elefant Records in Spain, [BAND_NAME] released a single in [MONTH] [YEAR] in the United States with Hugpatch Records.\n",
      "The group is made up of five women: Bea, Cova, Malela, Montse, and Natalia. Also Eugenia was a [GENRE] band is as follows: Natalia sings; Bea plays the guitar; Malela plays the guitar and sings; Montse plays the bass and sings; and Cova plays the drums. Eugenia played the bass.\n",
      "One [YEAR] night in a [GENRE] a new music group arises. That very night, the group has chosen a name and the roles have been assigned. So they start to practise, and they compose some songs.\n"
   ]
}