{
   "Name": "Pic-Nic",
   "rawData": [
      "Pic-Nic was a Spanish teenage folk-pop and sunshine pop band formed in Barcelona in the mid-to-late 1960s, composed of lead singer Jeanette, guitarists Toti Soler and Al Cárdenas, drummer Jordi Barangé and bassist Isidoro \"Doro\" de Montaberry. Contrary to popular belief, keyboardist Jordi Sabatés does not appear in any of the group's releases, as he joined the band after their only published recordings sessions happened. Pic-Nic was the successor to the short-lived group Brenner's Folk, originally founded by brothers Haakon Brenner and Vytas Brenner together with Soler, Barangé and Jeanette. After releasing a four-song EP for label Edigsa in 1966, the Brenner brothers left the band, being replaced by Cárdenas and de Montaberry.\n",
      "With this new formation and after signing to major label Hispavox, the group changed its name to Pic-Nic and released their lead single, the Jeanette-penned \"Cállate niña,\" in late 1967. The record was a big hit during the spring of 1968, remaining on the top of the Spanish singles chart for ten consecutive weeks. The success of the song led to it being recorded in English for the international market as an EP alongside three other tracks. Throughout 1968, the band released two more singles—\"Amanecer\" and \"Me olvidarás\"—as well as their first and only self-titled studio album. Most of Pic-Nic's songs were written by Jeanette with Rafael Turia, a radioman who managed the band. Famous producer Rafael Trabucchelli was in charge of the records' arrangements, which moved the group's original compositions away from a strictly folk style.  \n",
      "Pic-Nic soon broke up due to Jeanette's departure and differences between Soler's vision and Hispavox's demands. In 1969, the label reissued their only album with a new track listing under the title Cállate niña. Following the group's dissolution, Soler formed the progressive rock band Om, enlisting de Montaberry and Sabatés. On the other hand, Jeanette was recontacted by Hispavox and launched a successful solo career as a balladeer with the single \"Soy rebelde\" in 1971. Pic-Nic has since attained cult status and is celebrated for its California sound that set them apart from other local groups of their time. Their only full-length record was reissued in 2011 and has appeared in various critics' lists for the best Spanish pop music albums of all time.\n"
   ],
   "infobox": {
      "Also known as": [
         "Pic Nic",
         "Picnic"
      ],
      "Origin": [
         "Barcelona, Spain"
      ],
      "Genres": [
         "Folk-pop",
         "sunshine pop",
         "teen pop",
         "psychedelic pop"
      ],
      "Years active": [
         "1966 (1966)–c. 1969 (1969)"
      ],
      "Labels": [
         "Hispavox"
      ],
      "Associated acts": [
         "Brenner's Folk",
         "Om"
      ],
      "Past members": [
         "Jeanette",
         "Toti Soler",
         "Jordi Barangé",
         "Al Cárdenas",
         "Isidoro \"Doro\" de Montaberry",
         "Jordi Sabatés"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band formed in Barcelona in the mid-to-late [YEAR]s, composed of lead singer [PERSON_NAME_FULL_1_FEMALE], guitarists Toti Soler and [PERSON_NAME_FULL_5_MALE], drummer [PERSON_NAME_FULL_0_MALE] and bassist Isidoro \"Doro\" de Montaberry. Contrary to popular belief, keyboardist [PERSON_NAME_FIRST_0] [PERSON_NAME_LAST_3] does not appear in any of the group's releases, as he joined the band after their only published recordings sessions happened. [BAND_NAME] was the successor to the short-lived group [PERSON_NAME_LAST_2]'s Folk, originally founded by brothers [PERSON_NAME_FIRST_4] [PERSON_NAME_LAST_2] and [PERSON_NAME_FULL_2_MALE] together with Soler, [PERSON_NAME_LAST_0] and [PERSON_NAME_FULL_1_FEMALE]. After releasing a four-song EP for label Edigsa in [YEAR], the [PERSON_NAME_LAST_2] brothers left the band, being replaced by [PERSON_NAME_LAST_5] and de Montaberry.\n",
      "With this new formation and after signing to major label Hispavox, the group changed its name to [BAND_NAME] and released their lead single, the [PERSON_NAME_FULL_0_FEMALE]-penned \"Cállate niña,\" in late [YEAR]. The record was a big hit during the spring of [YEAR], remaining on the top of the Spanish singles chart for ten consecutive weeks. The success of the song led to it being recorded in English for the international market as an EP alongside three other tracks. Throughout [YEAR], the band released two more singles—\"Amanecer\" and \"Me olvidarás\"—as well as their first and only self-titled studio album. Most of [BAND_NAME]'s songs were written by [PERSON_NAME_FULL_0_FEMALE] with [PERSON_NAME_FIRST_1] [PERSON_NAME_LAST_2], a radioman who managed the band. Famous producer [PERSON_NAME_FULL_1_MALE] was in charge of the records' arrangements, which moved the group's original compositions away from a strictly folk style.  \n",
      "[BAND_NAME] soon broke up due to [PERSON_NAME_FULL_0_FEMALE]'s departure and differences between Soler's vision and Hispavox's demands. In [YEAR], the label reissued their only album with a [GENRE] band Om, enlisting de Montaberry and Sabatés. On the other hand, [PERSON_NAME_FULL_0_FEMALE] was recontacted by Hispavox and launched a successful solo career as a balladeer with the single \"Soy rebelde\" in [YEAR]. [BAND_NAME] has since attained cult status and is celebrated for its California sound that set them apart from other local groups of their time. Their only full-length record was reissued in [YEAR] and has appeared in various critics' lists for the best Spanish pop music albums of all time.\n"
   ]
}