{
   "Name": "Pic-Nic",
   "Sections": [
      "1 History",
      "1.1 Origins as Brenner's Folk",
      "1.2 Breakthrough with \"Cállate niña\"",
      "1.3 Break-up and aftermath",
      "2 Musical style",
      "3 Legacy",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 EPs",
      "4.3 Singles",
      "5 See also",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Pic-Nic was a Spanish teenage folk-pop and sunshine pop band formed in Barcelona in the mid-to-late 1960s, composed of lead singer Jeanette, guitarists Toti Soler and Al Cárdenas, drummer Jordi Barangé and bassist Isidoro \"Doro\" de Montaberry. Contrary to popular belief, keyboardist Jordi Sabatés does not appear in any of the group's releases, as he joined the band after their only published recordings sessions happened. Pic-Nic was the successor to the short-lived group Brenner's Folk, originally founded by brothers Haakon Brenner and Vytas Brenner together with Soler, Barangé and Jeanette. After releasing a four-song EP for label Edigsa in 1966, the Brenner brothers left the band, being replaced by Cárdenas and de Montaberry.\n",
         "With this new formation and after signing to major label Hispavox, the group changed its name to Pic-Nic and released their lead single, the Jeanette-penned \"Cállate niña,\" in late 1967. The record was a big hit during the spring of 1968, remaining on the top of the Spanish singles chart for ten consecutive weeks. The success of the song led to it being recorded in English for the international market as an EP alongside three other tracks. Throughout 1968, the band released two more singles—\"Amanecer\" and \"Me olvidarás\"—as well as their first and only self-titled studio album. Most of Pic-Nic's songs were written by Jeanette with Rafael Turia, a radioman who managed the band. Famous producer Rafael Trabucchelli was in charge of the records' arrangements, which moved the group's original compositions away from a strictly folk style.  \n",
         "Pic-Nic soon broke up due to Jeanette's departure and differences between Soler's vision and Hispavox's demands. In 1969, the label reissued their only album with a new track listing under the title Cállate niña. Following the group's dissolution, Soler formed the progressive rock band Om, enlisting de Montaberry and Sabatés. On the other hand, Jeanette was recontacted by Hispavox and launched a successful solo career as a balladeer with the single \"Soy rebelde\" in 1971. Pic-Nic has since attained cult status and is celebrated for its California sound that set them apart from other local groups of their time. Their only full-length record was reissued in 2011 and has appeared in various critics' lists for the best Spanish pop music albums of all time.\n"
      ]
   },
   "History": {
      "Origins as Brenner's Folk": {
         "text": [
            "After moving to Barcelona, the German-born Venezuelan brothers Haakon Brenner and Vytas Brenner formed the Vytas Brenner Quartet together with guitarist Toti Soler and drummer Jordi Barangé,[2] who had been part of Els Xerracs, a band influenced by the Shadows that released its only EP in 1965.[3] A neighbor of the Brenner brothers introduced the group to fifteen-year-old Jeanette, who played guitar and had written a few songs, among them \"Cállate niña\".[2] Jeanette was born in London and spent her childhood in Los Angeles, until her parents divorced in 1962 and she moved with her Spanish mother to Barcelona,[4] bringing with her a musical taste for Californian folk rock.[5] The band connected with Jeanette's sound and incorporated her as a singer, changing the group's name to Brenner's Folk, since they were no longer a quartet.[6][7] She told OC Weekly in 2017: \"They loved that kind of music, that kind of music over here in Spain was completely unknown. It was new, it was something people didn't hear of before.\"[6] The band rehearsed in the large, wooden basement of an old pharmacy located on Via Laietana avenue, which they soundproofed with egg cartons.[8][9]\n",
            "In 1966, Brenner's Folk released their first and only EP on the Nova Cançó record label Edigsa, which included four songs sung in Catalan: \"Daurat oest\", \"Ho sé\", \"Clara lluna\" and \"Amor perdut\".[2][10] The release featured a cover art by designer Jordi Fornás,[2] and liner notes written by Jordi García-Soler that declared the influence of American folk music in the group and explained what the genre consisted of.[10] The EP was not commercially successful but today is regarded as a rarity that is highly valued by record collectors.[1] It was remastered and reissued for the first time by Barcelonian label Wah Wah Records in 2018.[11]\n"
         ]
      },
      "Breakthrough with \"Cállate niña\"": {
         "text": [
            "Shortly after the release of their EP, Vytas and Haakon's family decided to return to Venezuela and the rest of the band replaced them with Al Cárdenas and Isidoro \"Doro\" de Montaberry.[7][12] Brenner's Folk's new formation was introduced to Madrid-based major label Hispavox thanks to Rafael Turia, a radioman at Barcelona's Radio Juventud that they had befriended and became their band manager.[5][12] According to Lafonoteca's Roberto Macho, Turia was in charge of adapting the group's songs to Spanish.[7] Pic-Nic recorded a demo at Radio Juventud's studios that greatly impressed the Hispavox's Rafael Trabucchelli,[5][12] who thought it was an American group.[7][12] Trabucchelli was a pioneer of music production in Spain and \"one of the most influential figures in Spanish music between 1965 and 1975.\"[13][14] While working for Hispavox, he developed the \"characteristic lush sound\" of the record label, which \"[resulted] from sophisticated orchestral arrangements and studio wizardy.\"[15] He is now described as the \"Spanish Phil Spector\", and his Wall of Sound production style is known as the \"Torrelaguna Sound\", named after the Torrelaguna Street in Madrid, where Hispavox Studios was based.[15]\n",
            "Trabucchelli flew the band to Madrid, signed them to Hispavox and changed their name to Pic-Nic for commercial reasons,[7] as Brenner's Folk was too much of a foreign name for Spanish audiences and Vytas and Haakon were no longer part of the group.[12] \"Cállate niña\" was released as their debut single in November 1967.[16] To promote the release, Pic-Nic appeared at the TVE program Tele Ritmo in Madrid.[17] The single was a big hit and charted at the top spot of the national charts for ten consecutive weeks,[5][18] becoming one of the most listened to songs in Spain during the spring of 1968[19] and the second best-selling single of the year in the country.[20] After the success of their second single, \"Amanecer\" (backed by \"No digas nada\"), they got to record Pic-Nic, which would be their only LP record.[5] In the United States, the album was released under the title Cállate niña by United Artists Records' subsidiary UA International.[21] A review in Cashbox described it as \"a most charming album, filled with sparkling, fresh lilting sounds.\"[22] \"Me olvidarás\" was the band's last single, released in August 1968.[23] By September, Billboard reported that Pic-Nic would undergo a South American tour.[24]\n",
            "Despite popular belief, keyboardist Jordi Sabatés does not appear in any of Pic-Nic's releases, as he joined the band in its \"second stage\", although he did take part in later recording sessions that remain unreleased.[25] He joined because of his close friendship with Toti Soler, with whom he shared musical tastes. Sabatés told Radio 3's José Miguel López in 2017: \"We used to figure out João Gilberto's bossa novas that drove us crazy at that time, Oscar Peterson's solos... We'd go down the street and sing Slam Stewart's solo on Lionel Hampton's \"Stardust\". Well, because of our friendship I began to play the organ in Pic-Nic. I have wonderful recordings of [the band] that are not like the cliché of \"Cállate niña\", but rather songs in English, similar to Peter, Paul and Mary but much more modern. It was a time that I remember with special happiness.\"[25]\n"
         ]
      },
      "Break-up and aftermath": {
         "text": [
            "– Toti Soler, La Vanguardia, December 1988.[26]\n",
            "Pic-Nic disbanded abruptly after Jeanette's family forced her to leave the group, as the nuns from her school alerted her mother that she was missing a lot of class in order to fulfill band obligations in Madrid.[7][12][27] The singer recalled in 2017: \"she was like in a shock like 'oh my god, my daughter is number one' and of course I was traveling and singing all over Spain. My mother said 'oh no, no way, you have to study, you have to go to school' [so] she took me out of the group and she made me go to school... In the end, there was no support from my mother. Not at all, she did not want me to sing.\"[6] At the same time, Soler maintained a tense relationship with Hispavox executives, as he complained that they had no control over the songs.[28] Soler was unhappy with Trabucchelli's arrangements, and wished the band had longer instrumental sections.[28]\n",
            "According to La Vanguardia, the success of \"Cállate niña\" was such that it ended up disuniting the group, amid the pressures from the record company that wanted to continue exploiting the same \"gold mine\" at all costs.[26] Despite the repercussion that the group had during its existence, there were no great economic benefits for its members; one of the reasons may be that stated by Jeanette: \"We signed a contract with hardly any advice. Some businessmen also made fun of us, perhaps because they saw us as children.\"[7] Although Pic-Nic had already disbanded, Hispavox re-released their only studio album in 1969 under the title Cállate niña, since it was the title of their most successful single.[7][29] They also altered the order of the songs, including four new tracks: \"Palabras, sonrisas, promesas\", \"Música\", \"Soy feliz\" and \"Oí tu voz\".[29]\n",
            "After Jeanette's departure, the rest of the group briefly tried to continue playing without her but were unsuccessful.[12] Their last stage was characterized by their live performances in a nightclub on the outskirts of Barcelona called Tropical and the development of a more modern sound that foreshadowed the formation of Om.[25] The progressive rock project was founded by Soler after Pic-Nic's disbandment, together with Jordi Sabatés, Doro Montaberry and other musicians.[8] They began their career as a backing band for other artists, including María del Mar Bonet and Pau Riba, with whom they recorded the album Dioptria in 1970.[30] The following year, Om released their self-titled debut studio album on label Edigsa.[30] Months after Pic-Nic's disbandment, Jeanette graduated high school and soon moved with the Hungarian athlete Laszio Kristofe to Vienna, where they got married and had a daughter.[4][31] She was then contacted by Trabucchelli with the proposal to launch her solo career and so returned to Spain in 1971, recording the Manuel Alejandro-penned \"Soy rebelde\".[4][12] Jeanette initially refused to sing it, as she wanted to keep the folk style she had with Pic-Nic, but agreed at Hispavox's insistence.[12] The single was a major hit across the Spanish-speaking world, redefining her career as a world-famous romantic balladist.[31] Jeanette's 1973 debut studio album, Palabras, promesas, included three reworkings of songs originally recorded with Pic-Nic: \"Amanecer\", \"No digas nada\" and \"Él es distinto a ti\".[32]\n"
         ]
      }
   },
   "Musical style": {
      "text": [
         "Pic-Nic is considered an exponent of the California-styled[34] sunshine pop[35] and folk-pop genres that were popular in the United States at that time,[33] and has been defined as \"a local reflection of what was heard outside [of Spain] in 1968\".[36] The group's musical style was highly inspired by the contemporary folk and folk-rock sounds that came from the West Coast of the United States.[33][37][38] Some of their influences included Bob Dylan,[36] Donovan, the Mamas and the Papas and Peter, Paul and Mary.[7] However, the group was not an out-and-out folk act,[37] as producer and arranger Rafael Trabucchelli transformed their folk ballads into something unique.[5] Music historian Javier de Castro noted that: \"[Pic-Nic's] musical proposal was reminiscent of bands such as We Five, which mixed folk themes with electric instruments which made them, musically, closer to the Beatles than to Pete Seeger.\"[37] Pepe García Lloret described Pic-Nic's music as: \"delicious folk-pop, with drips of blues and acid rock, ethereal arrangements and introspective themes.\"[39] Ignacio Juliá of La Vanguardia felt that the band's output was \"always redirected to their own reality, bathed in acoustic delicacies and subtle electricity.\"[36] Pic-Nic's sound anticipated a style of \"hippie pop\" that proliferated in Spain in the 1970s, exemplified by groups such as Mi Generación, Solera, Cánovas, Adolfo, Rodrigo y Guzmán, Nuevos Horizontes con José y Manuel, Amigos, Tílburi and Agamenón, among several others.[35]\n",
         "The group's output consisted of very simple songs with \"sweet\" melodies that barely surpassed the three-minute mark, in which Trabucchelli's arrangements stand out.[40] According to Juan Puchades, the band was characterized by its \"vaporous languor\".[33] Pic-Nic's lyrics have been described as \"preadolescent\",[5][36] and revolve around the theme of love, usually with a \"melancholic touch\".[40] They are characterized by the use of metaphors, with sunrise and summer representing the beginning of love and, on the contrary, dusk and autumn evidencing the end of a relationship.[40] Most of them were written by Jeanette with the aid of Rafael Turia, with a few compositions by Toti Soler and Vytas Brenner, as well as cover versions of other artists.[7][41] \"Cállate niña\"—a Jeanette composition based on the traditional lullaby \"Hush, Little Baby\"—[18] has been considered the song that best defines the spirit of Pic-Nic's music.[5] According to Vicente Fabuel, the track \"overflows with melody despite its simplicity, and its use of triangle, harmonica and a male backing vocal provide an absolutely ghostly quality.\"[5]\n"
      ]
   },
   "Legacy": {
      "text": [
         "Pic-Nic is considered a mythical band of 1960s Spain,[28] and has achieved cult status.[42] Their sound is considered unprecedented in the country's music scene,[7] as well as ahead of its time.[8] Music journalist Vicente Fabuel felt that their music was \"something never seen before, or since, in Spain.\"[5] In 2020, El Confidencial considered that: \"more than half a century later, [Pic-Nic's songs] are still a mainstay of Hispanic folk.\"[42] Efe Eme's Juan Puchades described them as a precursor of the sound of the Spanish indie pop of the second half of the 1990s, especially that of San Sebastián and its surroundings.[33]\n",
         "The band's only studio album has appeared in various critics' lists since the 2000s. In 2003, Efe Eme placed it at number thirty-seven in its list of \"The 100 Best Albums of Spanish Pop Music\".[43] Rockdelux  ranked it number eighty-one in its 2004 special feature of \"The 100 Best Spanish Albums of the 20th Century\".[44] Music journalists Tito Lesende and Fernando Neira included the album in their 2007 book of \"201 albums to get hooked on Spanish pop-rock\".[45] In 2020, it appeared in an El País list of \"15 record gems of Spanish pop-rock released in the sixties\", which includes albums that \"laid the foundation of pop music in [Spain]\".[46]\n",
         "Pic-Nic's biggest hit \"Cállate niña\" is regarded as a classic of Spanish pop music.[33] In 2014, Diariocrítico.com placed it at number ninety-eight on its list of the 100 best songs of Spanish pop.[18]\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "EPs": {},
      "Singles": {}
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Pic-Nic was a Spanish teenage folk-pop and sunshine pop band formed in Barcelona in the mid-to-late 1960s, composed of lead singer Jeanette, guitarists Toti Soler and Al Cárdenas, drummer Jordi Barangé and bassist Isidoro \"Doro\" de Montaberry. Contrary to popular belief, keyboardist Jordi Sabatés does not appear in any of the group's releases, as he joined the band after their only published recordings sessions happened. Pic-Nic was the successor to the short-lived group Brenner's Folk, originally founded by brothers Haakon Brenner and Vytas Brenner together with Soler, Barangé and Jeanette. After releasing a four-song EP for label Edigsa in 1966, the Brenner brothers left the band, being replaced by Cárdenas and de Montaberry.\n",
      "With this new formation and after signing to major label Hispavox, the group changed its name to Pic-Nic and released their lead single, the Jeanette-penned \"Cállate niña,\" in late 1967. The record was a big hit during the spring of 1968, remaining on the top of the Spanish singles chart for ten consecutive weeks. The success of the song led to it being recorded in English for the international market as an EP alongside three other tracks. Throughout 1968, the band released two more singles—\"Amanecer\" and \"Me olvidarás\"—as well as their first and only self-titled studio album. Most of Pic-Nic's songs were written by Jeanette with Rafael Turia, a radioman who managed the band. Famous producer Rafael Trabucchelli was in charge of the records' arrangements, which moved the group's original compositions away from a strictly folk style.  \n",
      "Pic-Nic soon broke up due to Jeanette's departure and differences between Soler's vision and Hispavox's demands. In 1969, the label reissued their only album with a new track listing under the title Cállate niña. Following the group's dissolution, Soler formed the progressive rock band Om, enlisting de Montaberry and Sabatés. On the other hand, Jeanette was recontacted by Hispavox and launched a successful solo career as a balladeer with the single \"Soy rebelde\" in 1971. Pic-Nic has since attained cult status and is celebrated for its California sound that set them apart from other local groups of their time. Their only full-length record was reissued in 2011 and has appeared in various critics' lists for the best Spanish pop music albums of all time.\n",
      "After moving to Barcelona, the German-born Venezuelan brothers Haakon Brenner and Vytas Brenner formed the Vytas Brenner Quartet together with guitarist Toti Soler and drummer Jordi Barangé,[2] who had been part of Els Xerracs, a band influenced by the Shadows that released its only EP in 1965.[3] A neighbor of the Brenner brothers introduced the group to fifteen-year-old Jeanette, who played guitar and had written a few songs, among them \"Cállate niña\".[2] Jeanette was born in London and spent her childhood in Los Angeles, until her parents divorced in 1962 and she moved with her Spanish mother to Barcelona,[4] bringing with her a musical taste for Californian folk rock.[5] The band connected with Jeanette's sound and incorporated her as a singer, changing the group's name to Brenner's Folk, since they were no longer a quartet.[6][7] She told OC Weekly in 2017: \"They loved that kind of music, that kind of music over here in Spain was completely unknown. It was new, it was something people didn't hear of before.\"[6] The band rehearsed in the large, wooden basement of an old pharmacy located on Via Laietana avenue, which they soundproofed with egg cartons.[8][9]\n"
   ]
}