{
   "Name": "Montrose (band)",
   "rawData": [
      "Montrose was a California-based hard rock band formed in 1973 and named after guitarist and founder Ronnie Montrose. The band's original lineup featured Montrose and vocalist Sammy Hagar, who later gained greater fame as a solo artist and as a member of Van Halen. Rounding out the original foursome were bassist Bill Church and drummer Denny Carmassi. The group disbanded in early 1977.\n",
      "Prior to forming the band Montrose, guitarist Ronnie Montrose had been a successful session musician, playing (along with future Montrose bassist Bill Church) on Van Morrison's Tupelo Honey album produced by Ted Templeman, and on albums by Beaver & Krause and Herbie Hancock. He was also a member of the Edgar Winter Group, playing on the hit single \"Frankenstein\" from the best-selling album They Only Come Out at Night (1972).\n",
      "The original Montrose lineup, consisting of Ronnie Montrose on guitar, Sammy Hagar (then known as Sam Hagar) on lead vocals, Bill Church on bass, and Denny Carmassi on drums, was formed in early 1973 after Ronnie Montrose decided to leave the Edgar Winter Group. Both Hagar and Carmassi had previously worked together and were recruited from local San Francisco-area cover bands, while Bill Church and Ronnie Montrose were acquainted from their session work with singer Van Morrison and producer Ted Templeman. This prior connection provided the band with access to Templeman who heard their demos and helped the newly formed group secure a deal with Warner Bros. The band, as yet officially unnamed and billed as ‘Ronnie Montrose and Friends’, made their public debut on April 21, 1973 via a forty-five-minute radio broadcast aired on KSAN FM's Tom Donahue show. The broadcast featured the band's complete ten song performance recorded at the Record Plant in Sausalito, consisting of their entire first album (excluding \"Space Station No. 5\") as well as the unreleased tracks \"Roll Me Nice\", \"You’re Out of Time\", and \"Roll Over Beethoven\". The broadcast was in circulation as a bootleg recording for years before being released in 2017 on the Deluxe Version of their first album.\n"
   ],
   "infobox": {
      "Origin": [
         "United States"
      ],
      "Genres": [
         "Hard rock, heavy metal"
      ],
      "Years active": [
         "1973–1977, 1987, 2005"
      ],
      "Labels": [
         "Warner Bros."
      ],
      "Associated acts": [
         "Van Halen, Chickenfoot, Edgar Winter Group, Van Morrison, Buster Brown, Gamma, Scorpions"
      ],
      "Past members": [
         "Ronnie Montrose - guitar",
         "Sammy Hagar - vocals",
         "Bill Church - bass",
         "Denny Carmassi - drums",
         "Steve Smith - drums",
         "Alan Fitzgerald - bass",
         "Bob James - vocals",
         "Jim Alcivar - keyboards",
         "Randy Jo Hobbs - bass",
         "Glenn Letsch - bass",
         "Johnny Edwards - vocals",
         "James Kottak - drums"
      ]
   }
}