{
   "Name": "Montrose (band)",
   "Sections": [
      "1 History",
      "2 Post-Montrose",
      "3 Members",
      "3.1 Timeline",
      "4 Discography",
      "4.1 Compilation albums",
      "4.2 Singles",
      "5 References",
      "6 External Links"
   ],
   "Summary": {
      "text": [
         "Montrose was a California-based hard rock band formed in 1973 and named after guitarist and founder Ronnie Montrose. The band's original lineup featured Montrose and vocalist Sammy Hagar, who later gained greater fame as a solo artist and as a member of Van Halen. Rounding out the original foursome were bassist Bill Church and drummer Denny Carmassi.[1] The group disbanded in early 1977.\n"
      ]
   },
   "History": {
      "text": [
         "Prior to forming the band Montrose, guitarist Ronnie Montrose had been a successful session musician, playing (along with future Montrose bassist Bill Church) on Van Morrison's Tupelo Honey album produced by Ted Templeman, and on albums by Beaver & Krause and Herbie Hancock. He was also a member of the Edgar Winter Group, playing on the hit single \"Frankenstein\" from the best-selling album They Only Come Out at Night (1972).[1]\n",
         "The original Montrose lineup, consisting of Ronnie Montrose on guitar, Sammy Hagar (then known as Sam Hagar) on lead vocals, Bill Church on bass, and Denny Carmassi on drums, was formed in early 1973 after Ronnie Montrose decided to leave the Edgar Winter Group.[1] Both Hagar and Carmassi had previously worked together and were recruited from local San Francisco-area cover bands, while Bill Church and Ronnie Montrose were acquainted from their session work with singer Van Morrison and producer Ted Templeman. This prior connection provided the band with access to Templeman who heard their demos and helped the newly formed group secure a deal with Warner Bros. The band, as yet officially unnamed and billed as ‘Ronnie Montrose and Friends’, made their public debut on April 21, 1973 via a forty-five-minute radio broadcast aired on KSAN FM's Tom Donahue show. The broadcast featured the band's complete ten song performance recorded at the Record Plant in Sausalito, consisting of their entire first album (excluding \"Space Station No. 5\") as well as the unreleased tracks \"Roll Me Nice\", \"You’re Out of Time\", and \"Roll Over Beethoven\". The broadcast was in circulation as a bootleg recording for years before being released in 2017 on the Deluxe Version of their first album.[citation needed]\n",
         "Their debut album, the Ted Templeman-produced Montrose, was released on Warner Bros in late 1973.[1] Though the album was not a big seller upon its initial release, peaking at No. 133 on the U.S. Billboard chart,[2] it proved to be an international sleeper hit which over a period of several decades has sold in excess of one million copies, attaining platinum status.[1] Often cited as 'America's answer to Led Zeppelin', it is held to be influential amongst hard rock/heavy metal musicians including Iron Maiden who have recorded and/or performed cover versions of songs from the album. Montrose was initially managed and booked by Dee Anthony.[citation needed]\n",
         "The first member to leave the original Montrose lineup was bassist Bill Church, who was replaced by Alan Fitzgerald for the band's second album, Paper Money (1974), also produced by Ted Templeman.[1] Already disenchanted with what he perceived to be the one dimensionality and commercially waning popularity of the group's hard rock/proto-metal sound, Ronnie Montrose insisted on changing the formula for Paper Money by broadening the stylistic, compositional, rhythmic, and sonic range of the band, and generally toning down the high-energy intensity and metallic crunch that defined the group's first album.[citation needed] Despite its significant stylistic departure from the band's iconic debut, lukewarm response from critics, and mixed reactions from fans, Paper Money initially sold twice as many copies as Montrose.[citation needed] It was the band's highest-charting release, reaching No. 65 on the Billboard 200.[2]\n",
         "After building acrimony between guitarist-founder Ronnie Montrose and vocalist Sammy Hagar reached a peak during the band's 1974-75 European tour to promote Paper Money (as part of the Warner Bros Music Show package which also featured Tower of Power, Little Feat, and The Doobie Brothers), Hagar parted ways with the group in February 1975. He was replaced by Los Angeles-based vocalist Bob James. Seeking to further expand and change their sound, the band also drafted keyboardist Jim Alcivar. The Paper Money rhythm section of drummer Denny Carmassi and bassist Alan Fitzgerald remained.[1] The new quintet lineup of Montrose made their live debut in San Francisco at Winterland Ballroom on April 5, 1975. At this juncture, the group parted ways with producer Ted Templeman. Montrose released two more albums, the Ronnie Montrose-produced Warner Brothers Presents... Montrose! (1975) and Jump On It (1976), produced by Jack Douglas, known for his work with Aerosmith.[1] Both albums feature Bob James on vocals and Jim Alcivar on keyboards. On the Jump On It album, Alan Fitzgerald was replaced on bass by Randy Jo Hobbs,[1] and the subsequent tour to promote the album saw the band performing as a four-piece without a bass player, utilizing Jim Alicivar for keyboard-bass.\n",
         "Under the high-profile management of impresario and concert promoter Bill Graham, Montrose reached the peak of their commercial popularity during the Warner Bros Presents and Jump On It era from 1975 to 1977, which found the band adhering to a grueling tour schedule across America and Canada, performing predominantly in large arena and stadium venues sharing the bill with major artists that included The Rolling Stones, Kiss, Peter Frampton, Yes, Rush, The Eagles, Journey, and Aerosmith, as well as headlining their own shows in mid-size arenas.[citation needed] This period also netted Montrose their second highest chart position, with Warner Bros Presents reaching No. 79 on the Billboard 200.[2]\n",
         "As the result of a near-fatal amphetamine overdose during his stint with the Edgar Winter Group, Ronnie Montrose observed a strong personal anti-drug/anti-alcohol stance during this period, exemplified by his insistence that all Montrose band members abide by a strict policy of drug and alcohol-free performances.[citation needed]\n",
         "After the departure of vocalist Bob James following the band's performance at Winterland on December 31, 1976, Montrose imploded as a group and Ronnie Montrose resurfaced a year later with the solo instrumental album Open Fire, released in January 1978. During this period the guitarist also worked with jazz-fusion drummer Tony Williams. In 1979, along with Montrose holdovers Jim Alcivar and Alan Fitzgerald, drummer Skip Gillette, and Scottish vocalist Davey Pattison, Ronnie Montrose formed a new group in the progressive hard rock mould named Gamma. The band's debut, Gamma 1 was released in 1979. Their second release, Gamma 2 (1980), saw former Montrose drummer Denny Carmassi replacing Skip Gillette and bassist Glenn Letsch replacing Alan Fitzgerald, who went on to become a founding member (as keyboardist) of Night Ranger.[1]\n"
      ]
   },
   "Post-Montrose": {
      "text": [
         "Sammy Hagar went on to build a successful post-Montrose solo career which, during its early phase, featured fellow former Montrose member Bill Church on bass and drummer Billy Carmassi, younger brother of Montrose drummer Denny Carmassi. Hagar had many successful albums with top hits such as \"Your Love Is Driving Me Crazy\", \"I Can't Drive 55\", \"Heavy Metal\" and \"There's Only One Way To Rock\". In July 1985, Hagar joined Van Halen.\n",
         "In 1987, Ronnie Montrose formed a new lineup of Montrose with singer Johnny Edwards and drummer James Kottak (both from the band Buster Brown), and bassist Glenn Letsch, who had replaced Fitzgerald in Gamma. This lineup of the band released one album, Mean (1987). Kottak would go on to join German hard rock bands Kingdom Come and Scorpions.[1]\n",
         "The original Montrose line-up with Sammy Hagar, Bill Church, Denny Carmassi, and Ronnie Montrose reunited on Sammy Hagar's Marching to Mars (1997) album, performing \"Leaving the Warmth of the Womb,\" and also appeared together onstage during encores at several of Hagar's concerts in 2003 and 2005.[citation needed]\n",
         "Ronnie Montrose performed off and on from 2001 until his death with a Montrose lineup that featured Keith St John (endorsed by Sammy Hagar)  on vocals, and a rotating cast of veteran hard rock players including Chuck Wright, Ricky Phillips, Dave Ellefson, Mick Mahan, and Sean McNabb on bass, and Pat Torpey, Mick Brown (Dokken), Eric Singer, Jimmy Degrasso, and Bobby Blotzer (Ratt) on drums.[1] Ronnie successfully battled prostate cancer from 2007 to 2009, and beginning in 2009 had become more musically active, playing regular gigs and doing interviews. Notably, in 2009 Montrose (with Keith St John, Mick Brown, and Sean McNabb) performed at West Fest, the 40th Woodstock reunion at Golden Gate Park for a crowd of 70,000.[citation needed] A reunion of the original Montrose lineup was planned for a one-time performance at Sammy Hagar's Cabo Wabo nightclub in October 2012. In the latter part of the year before Ronnie's death, Ronnie created the \"Ronnie Montrose Band\" in order to diversify and include Gamma songs and other songs from his past song catalog in his live shows with Dan McNay on bass, Steve Brown on drums, and Randy Scoles on vocals.[citation needed]\n",
         "Following a long battle with clinical depression, Ronnie Montrose took his life on March 3, 2012.[3][1] On April 27, 2013 Montrose with Sammy Hagar, Denny Carmassi, and Bill Church participated in an all-star tribute concert in honor of Ronnie Montrose, with Joe Satriani playing lead guitar.[4]\n"
      ]
   },
   "Members": {
      "Timeline": {}
   },
   "Discography": {
      "Compilation albums": {},
      "Singles": {}
   },
   "References": {},
   "External Links": {},
   "coreData": [
      "Montrose was a California-based hard rock band formed in 1973 and named after guitarist and founder Ronnie Montrose. The band's original lineup featured Montrose and vocalist Sammy Hagar, who later gained greater fame as a solo artist and as a member of Van Halen. Rounding out the original foursome were bassist Bill Church and drummer Denny Carmassi.[1] The group disbanded in early 1977.\n",
      "Prior to forming the band Montrose, guitarist Ronnie Montrose had been a successful session musician, playing (along with future Montrose bassist Bill Church) on Van Morrison's Tupelo Honey album produced by Ted Templeman, and on albums by Beaver & Krause and Herbie Hancock. He was also a member of the Edgar Winter Group, playing on the hit single \"Frankenstein\" from the best-selling album They Only Come Out at Night (1972).[1]\n",
      "The original Montrose lineup, consisting of Ronnie Montrose on guitar, Sammy Hagar (then known as Sam Hagar) on lead vocals, Bill Church on bass, and Denny Carmassi on drums, was formed in early 1973 after Ronnie Montrose decided to leave the Edgar Winter Group.[1] Both Hagar and Carmassi had previously worked together and were recruited from local San Francisco-area cover bands, while Bill Church and Ronnie Montrose were acquainted from their session work with singer Van Morrison and producer Ted Templeman. This prior connection provided the band with access to Templeman who heard their demos and helped the newly formed group secure a deal with Warner Bros. The band, as yet officially unnamed and billed as ‘Ronnie Montrose and Friends’, made their public debut on April 21, 1973 via a forty-five-minute radio broadcast aired on KSAN FM's Tom Donahue show. The broadcast featured the band's complete ten song performance recorded at the Record Plant in Sausalito, consisting of their entire first album (excluding \"Space Station No. 5\") as well as the unreleased tracks \"Roll Me Nice\", \"You’re Out of Time\", and \"Roll Over Beethoven\". The broadcast was in circulation as a bootleg recording for years before being released in 2017 on the Deluxe Version of their first album.[citation needed]\n",
      "Their debut album, the Ted Templeman-produced Montrose, was released on Warner Bros in late 1973.[1] Though the album was not a big seller upon its initial release, peaking at No. 133 on the U.S. Billboard chart,[2] it proved to be an international sleeper hit which over a period of several decades has sold in excess of one million copies, attaining platinum status.[1] Often cited as 'America's answer to Led Zeppelin', it is held to be influential amongst hard rock/heavy metal musicians including Iron Maiden who have recorded and/or performed cover versions of songs from the album. Montrose was initially managed and booked by Dee Anthony.[citation needed]\n"
   ]
}