{
   "Name": "The Pinker Tones",
   "Sections": [
      "1 Artists and Music",
      "2 History",
      "3 Recognitions",
      "4 Discography",
      "4.1 Albums",
      "4.2 Singles, EP's and soundtracks",
      "4.3 Compilations",
      "4.4 Remixes",
      "4.5 Other releases",
      "5 External links",
      "6 References"
   ],
   "Summary": {
      "text": [
         "The Pinker Tones is an alternative pop band from Barcelona, Catalonia, Spain. They have released 6 albums to date, and have been included on many more. \"Sampleame\" is featured in most versions of EA Sports game, FIFA 09.[1]\n"
      ]
   },
   "Artists and Music": {
      "text": [
         "The Pinker Tones was founded by Barcelona natives[1] Salvador Rey and Alex Llovet, who perform under the stage names Mister Furia and Professor Manso.[2] The group's music is an eclectic mix of pop, funk, soul, bossa, break beat, swing, lounge, and psychedelia.[2] Their songs feature Spanish, French, English, Japanese, and German lyrics.[1]\n",
         "Since the release of The Million Color Revolution on the band's own label Pinkerland Records (founded by the band and UK label Outstanding Records) and Latin alternative label Nacional Records, The Pinker Tones have played more than 300 shows in over 40 countries[citation needed]. They have performed in New York, Moscow, Beijing, London, Amsterdam, Berlin, Rome, Madrid, Mexico City, Buenos Aires, Bogota, Caracas, Puerto Rico, Los Angeles, Johannesburg, Toronto, as well as many other world cities.\n"
      ]
   },
   "History": {
      "text": [
         "In \"Pinkerland,\" a  tiny rooftop studio in the center of Barcelona, the Pinker Tones put together their first album, Pink Connection, which was released in 2003. In Japan, it was released under the name Mission Pink on the Japanese label Rambling Records.\n",
         "The Pinker Tones inked a deal with UK label Outstanding Records to release their debut album worldwide under a new name The BCN Connection. Thanks to the fantastic videos for the singles \"Mais Pourquois?\" and \"Viva la Juventud\", The Pinker Tones started to appear regularly on MTV Europe and other channels around the world. The video for \"Mais Pourquois?\" spent 19 weeks in the top 20 on MTV Spain's Dance Floor Chart. During this time, they produced various albums and singles for Spanish and international bands, composed a couple of film soundtracks (Sincopat and Survival Train), and dedicated some of their time to experimenting with remixes.\n",
         "For their second album, The Million Colour Revolution, The Pinker Tones signed with US-based Latin alternative label Nacional Records. The disc scored the number one overall album spot on Emusic, outselling such notable names as Coldplay, Johnny Cash, and Cat Power. The unprecedented feat for a developing Latin dance/alternative act came on the heels of their incredible animated video for \"Sonido Total\" being featured on the main MySpace Videos page and growing online support around the world. The Million Colour Revolution also entered the Top 10 on iTunes Top Latin Albums chart.\n",
         "In the summer of 2007, The Pinker Tones released a remix and collaborations album, More Colours!, continuing the momentum of 2006's Million Colour Revolution and featuring a stellar lineup of artists including The Submarines, Kinky, Nortec Collective, PJ Rose, Zeta Bosio of Soda Stereo and Mexican Institute of Sound.\n",
         "The Pinker Tones played the entire 2008 edition of warped tour in support of their third studio album, Wild Animals.\n",
         "The group announced the release of their fourth studio album, Modular, releasing in Europe on June 8 and in the United States and Mexico on June 28.[3]\n",
         "The Pinker Tones's \"Karma Hunters\" was nominated for the 7th Annual The Independent Music Awards for Music Video of the year.\n",
         "To celebrate their 10th anniversary, they also released their compilation album called Amigos & Friends and Singles 2001-2011. In December 2011, they released album Special 10th Anniversary Edition (Amigos & Friends and Singles 2001-2011) under label Nacional Records.\n",
         "In 2012, they also released their fifth studio album Life in Stereo, released on 15 May 2012. They also released the bilingual songs for children called Flor and Rolf (also known in Spanish as Rolf y Flor) released in 2013 which contains Spanish and English songs.\n"
      ]
   },
   "Recognitions": {
      "text": [
         "The group were the subject of a NY Times feature, had an A&E television special, performed on KCRW's \"Morning Becomes Eclectic\", had a song featured on the hit ABC sitcom \"Ugly Betty,\" and saw heavy video play on networks like mtvU, MTV Tr3́s, mun2, and LATV.  The Pinker Tones also made a major splash at the 2007 South by Southwest, where they performed five shows in only 36 hours, including the Vans Warped Tour showcase. Later in the year, they wowed the audience at KCRW's Sounds Eclectic Evening at the Gibson Amphitheatre in Los Angeles alongside artists like The Shins, Lily Allen, Cold War Kids and Rodrigo and Gabriela. The Pinker Tones single \"Karma Hunters\" was also selected by national bilingual youth network Mun2 as the theme song for its popular reality show The Chicas Project also with \"Beyond Nostalgia\". They also have appeared in the game FIFA 07 with their hit song \"The Million Colour Revolution\". Forza Motorsport 2, a game on the Xbox 360, features \"Karma Hunters\" and \"Sonido Total\" in its soundtrack, whereas the game Project Gotham Racing 4 for the same system features \"In Pea We Nuts.\"[1] The Pinker Tones have also featured in EA Sports game, FIFA 09 with their song \"The Whistling Song.\"[1][4] Street racing game Need for Speed: Undercover also features The Pinker Tones' \"Electrotumbao\". In 2009, The Pinker Tones received the Premios de la Musica award in Spain for Best Electronic Song. Their song \"Sampleame\" also made an appearance on EA Sports game, FIFA 11.\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Singles, EP's and soundtracks": {},
      "Compilations": {},
      "Remixes": {},
      "Other releases": {}
   },
   "External links": {},
   "References": {},
   "coreData": [
      "The Pinker Tones is an alternative pop band from Barcelona, Catalonia, Spain. They have released 6 albums to date, and have been included on many more. \"Sampleame\" is featured in most versions of EA Sports game, FIFA 09.[1]\n",
      "The Pinker Tones was founded by Barcelona natives[1] Salvador Rey and Alex Llovet, who perform under the stage names Mister Furia and Professor Manso.[2] The group's music is an eclectic mix of pop, funk, soul, bossa, break beat, swing, lounge, and psychedelia.[2] Their songs feature Spanish, French, English, Japanese, and German lyrics.[1]\n",
      "Since the release of The Million Color Revolution on the band's own label Pinkerland Records (founded by the band and UK label Outstanding Records) and Latin alternative label Nacional Records, The Pinker Tones have played more than 300 shows in over 40 countries[citation needed]. They have performed in New York, Moscow, Beijing, London, Amsterdam, Berlin, Rome, Madrid, Mexico City, Buenos Aires, Bogota, Caracas, Puerto Rico, Los Angeles, Johannesburg, Toronto, as well as many other world cities.\n",
      "In \"Pinkerland,\" a  tiny rooftop studio in the center of Barcelona, the Pinker Tones put together their first album, Pink Connection, which was released in 2003. In Japan, it was released under the name Mission Pink on the Japanese label Rambling Records.\n"
   ]
}