{
   "Name": "Platero y Tú",
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "3.1 Albums",
      "3.2 In other media",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Platero y Tú (Spanish pronunciation: [plaˈteɾo i ˈtu]) was a Spanish rock and roll and blues rock band formed in Bilbao in the 1980s, and disbanded in 2001. Their lyrics mainly deal about drugs, bar issues and love, and their style, being mainly influenced by bands such as Status Quo, AC/DC or Leño, and guitarists like John Fogerty from Creedence Clearwater Revival, broke with the Basque Radical Rock trend of the moment.[2]\n"
      ]
   },
   "History": {
      "text": [
         "Platero y Tú was formed in Bilbao, in the late 80s. Juantxu and Uoho were the first ones to practice together, after their former band, Ke, broke up.[3] Maguila joined later, as a drummer. One day Juantxu invited Fito, his neighbor, to a practicing session, and he ended up joining the group as singer and guitarist.[2]\n",
         "They recorded their first demo in the Arion studios in Pamplona with the money from their first performances, and took the name \"Platero y Tú\" that would become definitive. The demo, which they called Burrok'n'Roll, was edited with only a few copies, and now it constitutes a collector's item.[2]\n",
         "In 1991 the Barcelonan label Welcome Records contacted them to record their first disc, Voy a acabar borracho in just one day at the Lin studios.[4] The disc would not reach a high popularity, but nevertheless awarded them the attention from the multinational label DRO, with whom they produced Burrock'n'roll as their second album, in 1992.\n",
         "That same year, between February and March, they recorded their third disc, Muy deficiente, with some tracks that would become classics in their concerts, for example El roce de tu cuerpo. The disc also features a collaboration with Rosendo Mercado, in the song Sin solución.[4] They presented the disc in around a hundred concerts.\n",
         "Their fourth disc, Vamos tirando, was marketed in 1993, and gave them nationwide projection. In this disc they have a cover of the Hertzainak song R&R Batzokian, and a live song, Mírame. That same year they edited a live disc, En directo a todo gas, with two other bands, namely Zer Bizio? and Sedientos.[2]\n",
         "Keeping a one disc per year rate, they recorded their fifth in 1994, Hay poco Rock & roll, again with DRO. They have collaborations with Roberto Iniesta and Evaristo Páramos in the song Juliette. With Hay poco Rock & Roll they obtained their first golden record, selling over 50,000 copies.[4]\n",
         "The 1995 and 1996 years are spent in tours, and they record their sixth disc, a live album they call A pelo, which awards them a golden record, again. A video was also edited with images from the concerts. After the 1996 summer they started a renowned tour with Extremoduro, in which they played alternatively in the stage, they played together, and they even played covers of each other's songs. Among other concerts, they were in the first edition of the Viñarock, in Villarrobledo (Albacete), and the tour ended in the Palacio de los Deportes in Madrid, with two performances.\n",
         "Their seventh album, 7, brought a deep change in their style, now more mature both in music and lyrics. However, this was criticized by some fans. Roberto Iniesta collaborates again, in the song Si miro a las nubes, and they are awarded a golden record again. 7 marks an inflection point in the history of the group, and their members undertake other projects: Fito records his first disc with Fito & Fitipaldis, and Uoho involves himself further in Extremoduro.[2]\n",
         "In year 2000 they record their eight and last disc, Correos, recorded in La Casa de Iñaki, with the collaboration of Roberto Iniesta in Humo de mis pies. They get a golden record again, and this time the album is promoted on TV. The tour ended in October, 2001, in what turned out to be their last concert. After the tour Fito and Uoho embraced the Extrechinato y Tú project, but some months later they separated. After that Fito continues with Fito & Fitipaldis, Uoho joins Extremoduro definitively, while producing albums for other groups, and Mongol and Maguila create La Gripe.[2]\n",
         "In 2002 they edit the first volume of the greatest hits album Hay mucho Rock'n'Roll, and in 2005 the second volume is released.\n"
      ]
   },
   "Members": {},
   "Discography": {
      "Albums": {},
      "In other media": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Platero y Tú (Spanish pronunciation: [plaˈteɾo i ˈtu]) was a Spanish rock and roll and blues rock band formed in Bilbao in the 1980s, and disbanded in 2001. Their lyrics mainly deal about drugs, bar issues and love, and their style, being mainly influenced by bands such as Status Quo, AC/DC or Leño, and guitarists like John Fogerty from Creedence Clearwater Revival, broke with the Basque Radical Rock trend of the moment.[2]\n",
      "Platero y Tú was formed in Bilbao, in the late 80s. Juantxu and Uoho were the first ones to practice together, after their former band, Ke, broke up.[3] Maguila joined later, as a drummer. One day Juantxu invited Fito, his neighbor, to a practicing session, and he ended up joining the group as singer and guitarist.[2]\n",
      "They recorded their first demo in the Arion studios in Pamplona with the money from their first performances, and took the name \"Platero y Tú\" that would become definitive. The demo, which they called Burrok'n'Roll, was edited with only a few copies, and now it constitutes a collector's item.[2]\n",
      "In 1991 the Barcelonan label Welcome Records contacted them to record their first disc, Voy a acabar borracho in just one day at the Lin studios.[4] The disc would not reach a high popularity, but nevertheless awarded them the attention from the multinational label DRO, with whom they produced Burrock'n'roll as their second album, in 1992.\n"
   ]
}