{
   "Name": "Reincidentes",
   "rawData": [
      "Reincidentes is a Spanish rock/punk rock band. They started playing in the 1980s as Incidente Local, formed by Manuel Pizarro on drums, Juan Barea on guitar, and Fernando Medina on bass and vocals. They performed their first live concert in 1987 at University of Seville. After became finalists at a local rock contest and joined sax player José Luis Nieto, they recorded their debut album in 1989 released by Discos Trilita. After signing up to Discos Suicidas label and participating in Seville Expo '92, they started touring Central America. Later, Selu left the band and Finito de Badajoz became the new guitarist. In 1997, the band signed up to BMG and shortly thereafter their live album Algazara achieved their first gold record in Spain in 2000.\n",
      "This article about a Spanish band or other musical ensemble is a stub. You can help Wikipedia by expanding it."
   ],
   "infobox": {
      "Origin": [
         "Sevilla, Spain"
      ],
      "Genres": [
         "Rock, Punk rock"
      ],
      "Years active": [
         "1987–present"
      ],
      "Labels": [
         "Locomotive Music, BMG, Discos Suicidas"
      ],
      "Website": [
         "www.reincidentes-sca.es"
      ],
      "Members": [
         "Manuel J. Pizarro Fernández",
         "Fernando Madina Pepper",
         "Juan M. Rodríguez Barea",
         "Finito de Badajoz"
      ],
      "Past members": [
         "José Luis Nieto \"Selu\""
      ]
   },
   "albums": [
      "Reincidentes",
      "Ni un paso atrás",
      "¿Dónde está Judas?",
      "Sol y Rabia",
      "Nunca es tarde... si la dicha es buena",
      "Materia Reservada",
      "¡Te lo dije!",
      "Los Auténticos",
      "Algazara",
      "¿Y ahora qué?",
      "La otra orilla",
      "Cosas de este mundo",
      "Acústico",
      "El comercio del dolor",
      "Dementes",
      "América: Canciones de ida y vuelta",
      "Tiempos de ira"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band. They started playing in the [YEAR]s as Incidente Local, formed by [PERSON_NAME_FULL_0_MALE] on drums, [PERSON_NAME_FULL_2_MALE] on guitar, and Fernando Medina on bass and vocals. They performed their first live concert in [YEAR] at University of Seville. After became finalists at a local rock contest and joined sax player [PERSON_NAME_FULL_1_MALE], they recorded their debut album in [YEAR] released by Discos Trilita. After signing up to Discos Suicidas label and participating in Seville Expo '92, they started touring Central America. Later, Selu left the band and Finito de Badajoz became the new guitarist. In [YEAR], the band signed up to BMG and shortly thereafter their live album Algazara achieved their first gold record in Spain in [YEAR].\n",
      "This article about a [GENRE] band or other musical ensemble is a stub. You can help Wikipedia by expanding it."
   ]
}