{
   "Name": "Stravaganzza",
   "Sections": [
      "1 History",
      "2 Members",
      "2.1 Current Members",
      "2.2 Past members",
      "2.3 Live members",
      "3 Discography",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Stravaganzza is a metal band from Madrid, Spain formed in 2004. The band has released four studio albums and one EP. They combine elements of extreme metal such as gothic metal, death metal, doom metal and black metal with heavily orchestrated symphonic metal and progressive/power metal.\n"
      ]
   },
   "History": {
      "text": [
         "Stravaganzza became a consolidated band in 2003. The first precursor to Stravaganzza is without a doubt the band that Pepe Herrero (guitar) and Leo Jiménez (vocals) founded in 1993 and which later would be joined by Patricio Babasasa as a drummer: Krysálida, with an instrumental group just the same as in Stravaganzza (including violin and keyboards), but adding a second vocalist who sang the guttural parts. With that lineup they had already made a similar style to Stravaganzza, with obscure parts, orchestral passages but perhaps a bit more complex and anti-commercial; maybe this was the cause of it not being very understood and accepted, which would lead to it breaking up about four years later. \n",
         "After Krysálida, Leo formed with Patricio Babasasa (drums) and Edu Fernández (bass) Azabel, a band with a more aggressive style, close to death, and it was at this time when the idea of making a version of Mecano's song \"Hijo de la luna\" was brought up, a proposal that Stravaganzza would bring to life ten years later. Azabel dissolved after Leo's departure to well-known heavy metal band Saratoga, in which he would at last get recognition, fame and prestige, and where he would stay for eight years. On his side, Pepe Herrero, after abandoning Krysálida, wouldn't participate in any musical group until 2000, in which he founded Eklectika, a personal project in which, among others, he would compose some of the songs that later would appear on Stravaganzza's first album. \n",
         "In late 2002 Alejandro Briceño (drums), Edu Fernández, Pepe Herrero and Leo Jiménez decide to unite to make music together; for that they would also count on guitarist Paco Cinta. These five friends united under the temporary name of Dyosh, initially playing Eklectika songs. A few months later, they suggested making something more serious of this band, encouraged by the idea of being able to offer a fresh alternative to the not so varied national band scene. After the departure of Alejandro Briceño and Paco Cinta, Dani Pérez, who at the time played drums for Saratoga, joined the band; at that moment Stravaganzza was born. \n",
         "A year later, in 2004, the band's first album, Primer Acto, was released under the discographic label Avispa. That was very well accepted by the media, being given the highest ratings on their reviews and assigning it the \"revelation band of the year\" award. The general public received it with awe and respect, even those who didn't like it accepted that it was a remarkable product with an excellent quality. \n",
         "To bring the band to the live stage they needed to have musicians who recreated the orchestrations and keyboards that appeared in the recording. For that, they counted on keyboardist Fernando Martín, and violinist Roberto Jabonero, who, a year later, would be replaced by Rodrigo Calderón. The first live show was done at the ViñaRock 2004 stage, with a great reception by the thousands of spectators attending the event. \n",
         "In 2005, Stravaganzza presented their second act: Sentimientos, a more mature and elaborated work that featured the spectacular production of the late Big Simon and in which each song talks about a different feeling. It's with this work when they achieve a greater recognition and are invited to play in Berlin, at the new trends festival Popkomm. In this year they play again at ViñaRock festival, where they perform for the first time their version of Mecano's \"Hijo de la luna\", with a great acceptance by the public. They also record their first video clip, for the song \"Miedo\". \n",
         "In 2006, they released their EP, Hijo del miedo, also produced by Big Simon, work in which they capture among other songs the Hijo de la luna cover, which led them to the first place in sales on the Afive list. Right in that moment, the band underwent a great change; due to discographic matters, Edu Fernández and Dani Pérez leave the band. After this rough hit, Leo Jiménez and Pepe Herrero mustered up force to not fall and face the tough and apparently impossible task of finding two substitutes for Edu and Dani. However, in a few weeks they found two great musicians and people who incarnate perfectly the band's spirit: Patricio Babasasa on bass, and Carlos Expósito on drums.\n"
      ]
   },
   "Members": {
      "Current Members": {},
      "Past members": {},
      "Live members": {
         "text": [
            "Timeline\n"
         ]
      }
   },
   "Discography": {},
   "External links": {},
   "coreData": [
      "Stravaganzza is a metal band from Madrid, Spain formed in 2004. The band has released four studio albums and one EP. They combine elements of extreme metal such as gothic metal, death metal, doom metal and black metal with heavily orchestrated symphonic metal and progressive/power metal.\n",
      "Stravaganzza became a consolidated band in 2003. The first precursor to Stravaganzza is without a doubt the band that Pepe Herrero (guitar) and Leo Jiménez (vocals) founded in 1993 and which later would be joined by Patricio Babasasa as a drummer: Krysálida, with an instrumental group just the same as in Stravaganzza (including violin and keyboards), but adding a second vocalist who sang the guttural parts. With that lineup they had already made a similar style to Stravaganzza, with obscure parts, orchestral passages but perhaps a bit more complex and anti-commercial; maybe this was the cause of it not being very understood and accepted, which would lead to it breaking up about four years later. \n",
      "After Krysálida, Leo formed with Patricio Babasasa (drums) and Edu Fernández (bass) Azabel, a band with a more aggressive style, close to death, and it was at this time when the idea of making a version of Mecano's song \"Hijo de la luna\" was brought up, a proposal that Stravaganzza would bring to life ten years later. Azabel dissolved after Leo's departure to well-known heavy metal band Saratoga, in which he would at last get recognition, fame and prestige, and where he would stay for eight years. On his side, Pepe Herrero, after abandoning Krysálida, wouldn't participate in any musical group until 2000, in which he founded Eklectika, a personal project in which, among others, he would compose some of the songs that later would appear on Stravaganzza's first album. \n",
      "In late 2002 Alejandro Briceño (drums), Edu Fernández, Pepe Herrero and Leo Jiménez decide to unite to make music together; for that they would also count on guitarist Paco Cinta. These five friends united under the temporary name of Dyosh, initially playing Eklectika songs. A few months later, they suggested making something more serious of this band, encouraged by the idea of being able to offer a fresh alternative to the not so varied national band scene. After the departure of Alejandro Briceño and Paco Cinta, Dani Pérez, who at the time played drums for Saratoga, joined the band; at that moment Stravaganzza was born. \n"
   ],
   "infobox": {
      "Origin": [
         "Madrid, Spain"
      ],
      "Genres": [
         "Gothic metal, symphonic metal, progressive metal"
      ],
      "Years active": [
         "2004–2010",
         "2017–present"
      ],
      "Labels": [
         "Avispa"
      ],
      "Associated acts": [
         "Saratoga"
      ],
      "Website": [
         "Stravaganzza.com"
      ]
   }
}