{
   "Name": "El Sueño de Morfeo",
   "rawData": [
      "El Sueño de Morfeo (English: Morpheus' Dream) was a Spanish band from Asturias. Their musical style is pop rock fused with Celtic, folk rock and indie pop elements. \nThey represented Spain at Eurovision Song Contest 2013 with the song \"Contigo hasta el final (With you until the end)\".\n",
      "The band was originally formed in 2002 under the name Xemá, with a clear influence of Asturian folk music. Their debut album, Del interior, was released that same year, but failed to generate commercial success. This album was recorded while David Feito, from Asturias himself, and Raquel del Rosario, from the Canary Islands, were at the Colegio Internacional Meres in Siero, Asturias, together with teachers Andrés Alonso (keyboard and accordion) and Antón Fernández (bass guitar and guitar). After the launch of this first album, the band had to decide if they would go on as Xemá or create a new project, opting for the latter.\n",
      "After Juan Luis Suárez joined David and Raquel in 2003, they decided to find a new name for the band. They considered names like \"Pupitre Azul\" (Blue Desk) or \"La Hija del Caos\" (The Daughter of Chaos), and eventually chose El Sueño de Morfeo.\n"
   ],
   "infobox": {
      "Also known as": [
         "ESDM"
      ],
      "Origin": [
         "Asturias, Spain"
      ],
      "Genres": [
         "Pop rock",
         "Celtic",
         "power pop[1]"
      ],
      "Years active": [
         "2002–2013"
      ],
      "Members": [
         "Raquel del Rosario (vocals)",
         "David Feito (acoustic guitar and backing vocals)",
         "Juan Luis Suárez (electric guitar)"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] (English: Morpheus' Dream) was a [GENRE] band from Asturias. Their musical style is pop rock fused with Celtic, folk rock and indie pop elements. \nThey represented Spain at Eurovision Song Contest [YEAR] with the song [SONG_NAME].\n",
      "The band was originally formed in [YEAR] under the name Xemá, with a clear influence of Asturian folk music. Their debut album, Del interior, was released that same year, but failed to generate commercial success. This album was recorded while David Feito, from Asturias himself, and Raquel del Rosario, from the Canary Islands, were at the Colegio Internacional Meres in Siero, Asturias, together with teachers [PERSON_NAME_FULL_0_MALE] (keyboard and accordion) and Antón Fernández (bass guitar and guitar). After the launch of this first album, the band had to decide if they would go on as Xemá or create a new project, opting for the latter.\n",
      "After [PERSON_NAME_FULL_0_MALE] joined David and Raquel in [YEAR], they decided to find a [GENRE] band. They considered names like [SONG_NAME] (The Daughter of Chaos), and eventually chose [BAND_NAME].\n"
   ]
}