{
   "Name": "Triana (band)",
   "rawData": [
      "Triana was a rock band hailing from Andalusia, Spain. Formed in 1974, the band were known for blending elements of progressive rock and flamenco music to make a style known as Andalusian rock or flamenco rock.\n",
      "Triana was formed in 1974 as a trio consisting of vocalist and organist Jesús de la Rosa Luque, guitarist Eduardo Rodríguez Rodway, and drummer Juan José Palacios, better known as Tele. The band released its untitled debut album (nick-named El patio) the next year, presenting a sound that blended elements of Andalusian flamenco music with progressive and psychedelic rock. Although a commercial failure, the album earned the band a cult following among the Spanish youth who, following the belated fall of fascism in the country, were interested in the subversive themes of rock (especially psychedelic rock) presented in Triana's music. In 1977, Triana released their second album, Hijos del agobio. This album was a bigger commercial success than their debut  and was notable for its politically-involved lyrics which reflected the tense and unstable nature of Spain's political climate at the time. Their third album, Sombra y luz, was released in 1979. Their most experimental album to date, Sombra y luz contained elements of jazz and was certified platinum by the AFYVE.\n",
      "In 1980, Triana released their fourth album, Un encuentro. A commercial success, the album demonstrated a much more commercial and pop rock-influenced sound. Its follow-up, 1981's Un mal sueño, featured a similar sound, as did their sixth album, 1983's Llegó el día. Shortly after the release of Llegó el día, de la Rosa Luque was killed in a car accident, and the band subsequently announced their break-up.\n"
   ],
   "infobox": {
      "Origin": [
         "Andalusia, Spain"
      ],
      "Genres": [
         "Flamenco rock",
         "progressive rock"
      ],
      "Years active": [
         "1974–1983, 1985, 1994-2002, 2007-present"
      ],
      "Labels": [
         "Fonomusic"
      ],
      "Members": [
         "Juan Reina",
         "Andrés Herrera",
         "Raúl Fernández",
         "Emilio Grueso",
         "Santi Camps",
         "Marco Gamero"
      ],
      "Past members": [
         "Jesús de la Rosa Luque",
         "Eduardo Rodríguez Rodway",
         "Juan José Palacios \"Tele\""
      ]
   },
   "albums": [
      "El Patio",
      "Hijos del agobio",
      "Sombra y luz",
      "Un encuentro",
      "Un mal sueño",
      "Llegó el día",
      "Tengo que marchar",
      "Un jardín eléctrico",
      "En libertad",
      "Un camino por andar"
   ],
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band hailing from Andalusia, Spain. Formed in [YEAR], the band were known for blending elements of progressive [GENRE] and flamenco music to make a style known as Andalusian [GENRE] or flamenco [GENRE].\n",
      "[BAND_NAME] was formed in [YEAR] as a trio consisting of vocalist and organist Jesús de la Rosa Luque, guitarist [PERSON_NAME_FULL_1_MALE], and drummer [PERSON_NAME_FULL_0_MALE], better known as Tele. The band released its untitled debut album (nick-named El patio) the next year, presenting a sound that blended elements of Andalusian flamenco music with progressive and psychedelic rock. Although a commercial failure, the album earned the band a cult following among the Spanish youth who, following the belated fall of fascism in the country, were interested in the subversive themes of rock (especially psychedelic rock) presented in [BAND_NAME]'s music. In [YEAR], [BAND_NAME] released their second album, Hijos del agobio. This album was a bigger commercial success than their debut  and was notable for its politically-involved lyrics which reflected the tense and unstable nature of Spain's political climate at the time. Their third album, Sombra y luz, was released in [YEAR]. Their most experimental album to date, Sombra y luz contained elements of jazz and was certified platinum by the AFYVE.\n",
      "In [YEAR], [BAND_NAME] released their fourth album, Un encuentro. A commercial success, the album demonstrated a much more commercial and pop rock-influenced sound. Its follow-up, [YEAR]'s Un mal sueño, featured a similar sound, as did their sixth album, [YEAR]'s Llegó el día. Shortly after the release of Llegó el día, de la Rosa Luque was killed in a car accident, and the band subsequently announced their break-up.\n"
   ]
}