{
   "Name": "Txarango",
   "rawData": [
      "Txarango is a Spanish (Catalan) band formed in Barcelona in 2010. Their members are musicians from the Catalan counties of Ripollès, Osona and Garrotxa. Nowadays, the band is composed of Alguer Miquel (voice), Marcel Lázara, a.k.a. Tito (voice, guitar), Sergi Carbonell, a.k.a. Hipi (keyboard), Joaquim Canals (drums), Àlex Pujols (bass guitar), Pau Puig (percussion), Ivan López (saxophone) and Jordi Barnola (trumpet). They propose a musical fusion, taking Reggae as the mainstay, influenced by Dubstep, Latin music or Pop, and mixing Jamaican music, Rock and Latin sonorities. The band introduces itself in an imaginary connected to the circus clowns.\n",
      "Txarango's seed was planted in 2006. It started in the Gothic Quarter, Barcelona, in the student flat of the singer Alguer Miquel, the guitarist Marcel Lázara a.k.a. Tito and the keyboardist Sergi Carbonell a.k.a. Hipi. Near Plaça George Orwell, also known colloquially as Tripi square, they started giving impromptu concerts on the streets with musicians from all around the world. It was there where different experiences and sounds were shared. Marcel \"Tito\", started playing a charango, a small stringed instrument from the central region of the Andes, with Alguer and Sergi \"Hipi\". All three of them agreed to capture that festive spirit of the street music and to take it to the stages as a new project named after Marcel's instrument: Txarangö, with a diaeresis over the \"o\".\n",
      "The band started in 2007, playing all around Catalonia. Together with Manu Chao, Gambeat, Radio Bemba and Che Sudaka, they took part in La Pegatina's debut album, Al Carrer (Self-publishing, 2007), featuring in La Pegatina's first single Penjat. They ended that year on 2 November in Sala KGB Barcelona, with a shared concert with La Pegatina, a sold-out concert.\n"
   ],
   "infobox": {
      "Origin": [
         "Ripoll, Spain"
      ],
      "Genres": [
         "Fusion, reggae, cumbia, dubstep, pop, salsa"
      ],
      "Years active": [
         "2010–present"
      ],
      "Labels": [
         "DiscMedi"
      ],
      "Website": [
         "www.txarango.com"
      ],
      "Members": [
         "Alguer Miquel",
         "Sergi Carbonell 'Hipi'",
         "Joaquim Canals",
         "Àlex Pujols",
         "Pau Puig",
         "Ivan López",
         "Jordi Barnola",
         "Joan Palà",
         "Pau Castellví",
         "Sisco Romero"
      ],
      "Past members": [
         "Marcel Lázara 'Tito'",
         "Miquel Rojo",
         "Xavi Casas"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is a Spanish (Catalan) band formed in Barcelona in [YEAR]. Their members are musicians from the Catalan counties of Ripollès, Osona and Garrotxa. Nowadays, the band is composed of Alguer Miquel (voice), [MONTH]cel Lázara, a.k.a. Tito (voice, guitar), [PERSON_NAME_FULL_3_MALE], a.k.a. Hipi (keyboard), Joaquim Canals (drums), Àlex Pujols (bass guitar), [PERSON_NAME_FULL_1_MALE] (percussion), [PERSON_NAME_FULL_2_MALE] (saxophone) and [PERSON_NAME_FULL_0_MALE] (trumpet). They propose a musical fusion, taking Reggae as the mainstay, influenced by Dubstep, Latin music or Pop, and mixing Jamaican music, Rock and Latin sonorities. The band introduces itself in an imaginary connected to the circus clowns.\n",
      "[BAND_NAME]'s seed was planted in [YEAR]. It started in the Gothic Quarter, Barcelona, in the student flat of the singer Alguer Miquel, the guitarist [MONTH]cel Lázara a.k.a. Tito and the keyboardist [PERSON_NAME_FULL_0_MALE] a.k.a. Hipi. Near Plaça George Orwell, also known colloquially as Tripi square, they started giving impromptu concerts on the streets with musicians from all around the world. It was there where different experiences and sounds were shared. [MONTH]cel [SONG_NAME].\n",
      "The band started in [YEAR], playing all around Catalonia. Together with [PERSON_NAME_FULL_1_MALE], Gambeat, Radio Bemba and [PERSON_NAME_FULL_0_MALE], they took part in La Pegatina's debut album, Al Carrer (Self-publishing, [YEAR]), featuring in La Pegatina's first single Penjat. They ended that year on 2 [MONTH] in Sala KGB Barcelona, with a [GENRE] a sold-out concert.\n"
   ]
}