{
   "Discography": {
      "Studio albums": {
         "text": [
            "Welcome to Clownia\n",
            "Benvinguts al llarg viatge\n",
            "Som Riu\n",
            "El Cor de la Terra\n"
         ]
      }
   },
   "External links": {},
   "History": {
      "Benvinguts al llarg viatge (2012)": {
         "text": [
            "January 2012, Txarango signed up with Éxists Produccions & Management agency and they came back to the studio of Can Pardaler in Taradell in order to release their first album. Benvinguts al llarg viatge was the definitive title of the album. It  had 14 songs and featured La Pegatina, Bongo Botrako, La troba Kung-Fú, Yacine & The Oriental Groove, Gertrudis, Cesk Freixas, David Rosell (Dept. i Brams), The Sey Sisters and Itaca Band. They, all together, recorded a new version of \"Vola\", the only single they recovered from Welcome to Clownia. After finishing the recording, Miquel Rojo left Txarango because of an incompatibility with other musical plans and he was replaced by Jordi Barnola.\n",
            "On February 16, the day Carnival started, Benvinguts al llarg viatge was published in their official page for free. The band chose this festivity, devoted to fun, as a link to their happy and festive universe. In the first 24 hours, more than 5,000 people downloaded the album. Tickets went on sale on the 16th April for their presentation concert on 18 April in Sala Apolo [ca] in Barcelona. They sold out 1,200 seats in 13 days.\n",
            "In March, Txarango became the first band to be cover of the magazine Enderrock without having released any physical CD yet. The record label DiscMedi reached an agreement with the band to release Benvinguts al llarg viatge in compact disc, which was released coinciding with a presentation at Sala Apolo [ca], Barcelona. Before the concert, in view of their growing popularity, they gave two little concerts of half an hour in the Enderrock[7] Awards, held on 12 March at Sala Apolo, and on 30 March in Parc del Fòrum of Barcelona, as part of the Telecogresca,[8] in front of 5,000 people.\n",
            "The first official concert of the new tour in the Barcelona concert hall received praise from the local press.[9][10] At the same time, one of the songs of the album, \"Amagada primavera\", was involved in the festivity of Sant Jordi in TV3 and Catalunya Ràdio.[11] In June, the band was chosen, among more than a hundred Catalan submitted proposals, to participate in the State Circuit of Concert Halls, Artistas en Ruta, during that very same autumn.\n",
            "The Benvinguts al llarg viatge tour included fifty dates, with stops in most regions of Catalonia, and a few festivals such as l'In-Somni, Acampada Jove, Garrinada d'Argentona, Altaveu de Sant Boi de Llobregat, Festa per la Llibertat, Mercat de Música Viva de Vic i Petit Camaleons de Sant Cugat del Vallès. On this tour, Txarango also played in some international festivals such as Festival les Feux of l'Été, in France, and Polé Polé in Ghent, Flanders.[12]\n"
         ]
      },
      "El Cor de la Terra (2017)": {
         "text": [
            "On March 14, 2017, the first single of the new album, Una Lluna a l'Aigua, was published on YouTube. During the week of March 20–26, two new songs were posted on their page every day. Finally, on Sunday, March 26, the whole album, El Cor de la Terra, was released, with the possibility of downloading it freely (as they had done with the previous albums).\n",
            "For this album, the group included three new members: percussionist Joan Palà, guitarist Pau Castellví and Sisco Romero as backing vocalist.\n"
         ]
      },
      "Som Riu (2014)": {
         "text": [
            "On March 18, 2014, Txarango released their new CD called Som Riu. The album was released on their website to be downloaded freely as they had done before. As they already did with Benvinguts al llarg viatge, the new album was released by the Catalan record label DiscMedi.[13] The new album was recorded by producer David Rosell in l’Estudi Can Pardal d’Artés.[14] The first single was called \"Músic de carrer\". [15]\n",
            "In order to introduce their new album, the band organised a new music festival held in Sant Joan de les Abadesses, in Ripollès on May 2 and 3, 2014. The festival called Clownia, brought together some other bands and singers including La Troba Kung-Fú, Els Catarres, Cesk Freixas, Strombers, Orxata Sound System, Buhos, Itaca Band, 9 Son, DeudeVeu del programa, Oh happy day, among others.[12]\n",
            "Txarango performed on July 21, 2014, in Central Park, New York, in the SummerStage Festival.[16] The concert was part of the Catalan Sounds on Tour programme organised by Institut Ramon Llull (IRL).[17]\n",
            "On March 26, 2015, the band collected four Enderrock awards.\n",
            "In October 2015 the band announced via their Facebook page that their guitarist, Marcel Lazar, was going to leave the band to focus on other experiences.\n"
         ]
      },
      "Welcome To Clownia (2010-2011)": {},
      "text": [
         "Txarango's seed was planted in 2006. It started in the Gothic Quarter, Barcelona,[2] in the student flat of the singer Alguer Miquel, the guitarist Marcel Lázara a.k.a. Tito and the keyboardist Sergi Carbonell a.k.a. Hipi. Near Plaça George Orwell, also known colloquially as Tripi square, they started giving impromptu concerts on the streets with musicians from all around the world. It was there where different experiences and sounds were shared. Marcel \"Tito\", started playing a charango, a small stringed instrument from the central region of the Andes, with Alguer and Sergi \"Hipi\". All three of them agreed to capture that festive spirit of the street music and to take it to the stages as a new project named after Marcel's instrument: Txarangö, with a diaeresis over the \"o\".[3]\n",
         "The band started in 2007, playing all around Catalonia. Together with Manu Chao, Gambeat, Radio Bemba and Che Sudaka, they took part in La Pegatina's debut album, Al Carrer (Self-publishing, 2007),[4] featuring in La Pegatina's first single Penjat. They ended that year on 2 November in Sala KGB Barcelona, with a shared concert with La Pegatina, a sold-out concert.\n",
         "After recording a maxi-single of 7 tracks named Conjuro (Self-publishing, 2008), at the recording studio Nomada57, Barcelona,[5] Txarangö decided to split up and start a new musical path with other projects.\n",
         "In 2010 after closing their phase with the group Vall Folk, Alguer, Tito and Hipi decided to work on their new music project. They knew that this new vehicle would be based, firstly, on a very own imaginary and lyrics, before tackling the music. In the free and nomad spirit of the circus, they found their inspiration to start talking about Clownia: a magic place where every street artist they grew up with in Tripi square would play. Even though they didn't have much to do with their predecessor, they reused the name of Txarango, without the diaeresis over the \"o\".[6]\n",
         "Txarango made their first steps with Alguer Miquel (voice), Marcel Lázara \"Tito\" (voice), Sergi Carbonell \"Hipi\" (piano), Joaquim Canals (drums) and Àlex Pujols (bass). Their cover letter was a single, Welcome to Clownia (Self-publishing, 2010), recorded in Can Pardaler (Taradell). It was made up by two songs: \"Nits amb Txarango\" and \"Vola\".\n",
         "On 18 December 2010, they introduced themselves live in Sala Eudald Graells in Ripoll, sharing the stage with Intifada and Empalmaos. This first concert, which gathered 800 people, had the special collaborations of La Pegatina, Malakaton and The Sey Sisters.\n",
         "That year, they became part of the record label Tercera Via. Together they worked  in the first season where they had 50 concerts and they stepped on the stages of festivals such as UnnimEthnival (Girona), SonRíasBaixas Bueu, Galícia, Acampada Jove Montblanc, Musik'n'viu Granollers, Esdansa Les Preses, In-Somni and the traveling festival FesTOUR. They gather a total of 40,000 spectators. \"Vola\" and \"Nits amb Txarango\" have 100,000 reproductions on their official page, 100,000 more in YouTube, and 25,000 in MySpace, and they have had two lipdubs made by groups of young people of Anglés and Igualada.\n",
         "This first year of life of Txarango peaked on 31 October 2011 with a concert in Castanyada Rock in Piera, where they shared stage with Bongo Botrako, Brams, and Stombers. Before 3,000 people as public, they announced they were going back into the studio in order to record their first album.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Welcome To Clownia  (2010-2011)",
      "1.2 Benvinguts al llarg viatge (2012)",
      "1.3 Som Riu (2014)",
      "1.4 El Cor de la Terra (2017)",
      "2 Discography",
      "2.1 Studio albums",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Txarango is a Spanish (Catalan) band formed in Barcelona in 2010. Their members are musicians from the Catalan counties of Ripollès, Osona and Garrotxa. Nowadays, the band is composed of Alguer Miquel (voice), Marcel Lázara, a.k.a. Tito (voice, guitar), Sergi Carbonell, a.k.a. Hipi (keyboard), Joaquim Canals (drums), Àlex Pujols (bass guitar), Pau Puig (percussion), Ivan López (saxophone) and Jordi Barnola (trumpet). They propose a musical fusion, taking Reggae as the mainstay, influenced by Dubstep, Latin music or Pop, and mixing Jamaican music, Rock and Latin sonorities.[1] The band introduces itself in an imaginary connected to the circus clowns.\n"
      ]
   },
   "Title": "Txarango - Wikipedia"
}