{
   "Name": "WarCry (band)",
   "rawData": [
      "WarCry is a Spanish power metal band led by founder, singer, and songwriter Víctor García. Formed in 2001 when García and drummer Alberto Ardines were ejected from Avalanch, the band has since released seven studio albums and two live albums, with an eighth studio album currently in progress. WarCry has had a fluctuating lineup with García as the sole constant member. The band has been acclaimed as one of Spain's most famous heavy metal acts and has won numerous awards in both Spain and Latin America.\n",
      "In the middle of 2001, while working in Spanish power metal band Avalanch, vocalist Víctor García and drummer Alberto Ardines decided to record an album with the songs they had been composing in their spare time. Most of the songs had been written during the 1990s with lyrics in English. The pair translated the lyrics into Spanish and produced the album themselves, with García singing as well as playing bass guitar, rhythm guitar, and keyboards. Guitarists Fernando Mon, formerly of Avalanch, and Pablo García of Relative Silence also collaborated on the album by recording guitar solos. Upon learning of García and Ardines' project, the other members of Avalanch disapproved of it and expelled them from the band. García has stated that he presented many of his song ideas to Avalanch, but received writing credit on only two released songs: \"Aquí Estaré\" and \"Por Mi Libertad\". \"Aquí Estaré\" had barely been accepted by the band but went on to become one of Avalanch's most popular songs, and so he decided \"to release a couple of songs, but never with the idea of leaving Avalanch.\"\n",
      "\"WarCry\" had always been Víctor García's idea of a band. In 1992 he formed a band named War-Cry, playing as guitarist, but disbanded it in 1994 when he became the rhythm guitarist for Avalanch. After leaving Avalanch, in February 1996 he reformed the group as WarCry, this time acting as songwriter and lead vocalist. They recorded a demo entitled Demon 97, but disbanded again a year later when Víctor rejoined Avalanch as lead singer.  After being expelled from Avalanch, Víctor showed Ardines the name and logo of WarCry. Ardines felt that those were \"fantastic\", and that they should continue working on their new musical project, as they already had an \"open path\".\n"
   ],
   "infobox": {
      "Origin": [
         "Oviedo, Asturias, Spain"
      ],
      "Genres": [
         "Heavy metal, power metal, progressive metal"
      ],
      "Years active": [
         "2001–present"
      ],
      "Labels": [
         "Jaus/Avispa"
      ],
      "Associated acts": [
         "Avalanch, Sauze, DarkSun, Relative Silence, Darna, Trilogy"
      ],
      "Website": [
         "www.warcry.as"
      ],
      "Members": [
         "Víctor García",
         "Pablo García",
         "Santi Novoa",
         "Roberto García",
         "Rafael Yugueros"
      ],
      "Past members": [
         "Manuel Ramil",
         "Alberto Ardines",
         "Fernando Mon",
         "Álvaro Jardón"
      ]
   },
   "albums": [
      "WarCry",
      "El Sello De Los Tiempos",
      "Alea Jacta Est",
      "¿Dónde Está La Luz?",
      "La Quinta Esencia",
      "Revolución",
      "Alfa",
      "Inmortal",
      "Donde El Silencio Se Rompió..."
   ]
}