{
   "Name": "New Diplomat",
   "Sections": [
      "Summary",
      "Discography"
   ],
   "Summary": {
      "text": [
         "New Diplomat is an American Indie - Electronic / Synth Pop band out of San Francisco, California. Made up of members from countries all over the world, they formed in 2011 and gathered a significant local and national following.[citation needed]\n",
         "They have been described by Live 105, the largest Alternative Rock radio station in Northern California and a CBS network station as one of the top 10 Bay Area bands of 2011.[1]  They were the only currently unsigned band making it to the top of the list.\n",
         "Their debut EP \"Buy Yourself Some Freedom\" was recorded at Broken Radio Studios in San Francisco, a Bill Putman studio, during most of 2011 and released in October 2011.\n",
         "Aaron Axelsen, music director from Bay Area radio station Live 105, received the EP and played it on his weekly, Sunday evening radio show, Soundcheck without interruption since its release.[2]  \nThe EP has since then gathered critical acclaim and has been made available on Amazon.com, iTunes, Myspace, Spotify and through various other music outlets.\n",
         "Since their inception, they have been sharing the stage with bands like Biffy Clyro, Big Black Delta, Army Navy, Grand Archives and the Big Pink. They were invited to co headline  the 20th Anniversary edition of the acclaimed San Francisco Noise Pop festival.[3]\n",
         "The band also recorded the follow up to \"Buy Yourself Some Freedom\", a new single produced and engineered at Trilogy Studios in San Francisco by famed producer Dan the Automator (Gorillaz, DJ Shadow, Lovage, Kasabian) in  April 2012.\n",
         "In March 2015, New Diplomat announced after a year hiatus the reincarnation of the band with original members, vocalist Horacio O'Brien-Ferres and guitarist Paolo Von Giordano with the addition of Jacob Hartog on drums and Hugo Paris on synthesizers.\n",
         "In the summer of 2016 the band (down to a 3 piece, Horacio, Paolo and Jacob) entered the studio to record their 3rd\nEP with producer Jeff Saltzman (The Killers, Blondie, Fischerspooner, The Sounds).\nThe record called \"Replaced\" was released in 2017 leading them to commercial radio air play and various West Coast performances.\n",
         "In 2018 New Diplomat influenced by their long relationship with Indie Electronic Acts, Underground and Progressive House takes a break from live performances to focus on writing new material in this new direction.\nJoining forces with UK drummer Carlos Rodrigues and San Francisco DJ/Multi-Instrumentalist/Sound Engineer Conn Cianci-McGraw New Diplomat's new lineup is currently recording and mixing with London based producer and DJ Ewan Pearson (The Rapture, Jagwar Ma, Delphic, M83, Depeche Mode).\nTheir new release and touring dates will be announced in 2020\n"
      ]
   },
   "Discography": {
      "text": [
         "\n",
         "\n",
         "\n"
      ]
   },
   "coreData": [
      "New Diplomat is an American Indie - Electronic / Synth Pop band out of San Francisco, California. Made up of members from countries all over the world, they formed in 2011 and gathered a significant local and national following.[citation needed]\n",
      "They have been described by Live 105, the largest Alternative Rock radio station in Northern California and a CBS network station as one of the top 10 Bay Area bands of 2011.[1]  They were the only currently unsigned band making it to the top of the list.\n",
      "Their debut EP \"Buy Yourself Some Freedom\" was recorded at Broken Radio Studios in San Francisco, a Bill Putman studio, during most of 2011 and released in October 2011.\n",
      "Aaron Axelsen, music director from Bay Area radio station Live 105, received the EP and played it on his weekly, Sunday evening radio show, Soundcheck without interruption since its release.[2]  \nThe EP has since then gathered critical acclaim and has been made available on Amazon.com, iTunes, Myspace, Spotify and through various other music outlets.\n"
   ]
}