{
   "Name": "Elephant Gym",
   "rawData": [
      "Elephant Gym (Chinese: 大象體操) is a math rock band from Kaohsiung, Taiwan founded in February 2012. The group consists of siblings KT Chang (bass) and Tell Chang (guitar), and drummer Chia-Chin Tu.  The word \"elephant\" in the band name symbolizes their bass-driven melodies, and \"gym\" refers to their agile and irregular rhythms.\n",
      "As children, KT and Tell Chang were trained in classical music by their mother, while Chia-chin Tu learned classical percussion.  After the siblings met Tu at a music club in high school, the trio formed Elephant Gym in February 2012, hand-produced a limited edition EP, and toured Taiwan on the single \"Ordinary Route\" (later released on their album Angle).  On May 8, 2013 the band released Balance, their first EP, which included the song \"Ocean in the Night\" which was produced in collaboration with Hong-shen Hong, the lead singer of indie band Touming Magazine.  In 2014, they collaborated with Yoga Lin on a song, \"Speaking in Tongues\", which they performed with him in Hung Hom, Hong Kong and at the Taipei Arena.\n",
      "In June 2014, their debut album Angle was released, with singles featuring Panai Kusui and Enno Cheng.   In December 2014, the group members announced a year long hiatus due to Taiwanese compulsory military service, and held a performance entitled See You Then in addition to a short documentary of the same name.\n"
   ],
   "infobox": {
      "Origin": [
         "Kaohsiung, Taiwan"
      ],
      "Genres": [
         "Math rock"
      ],
      "Years active": [
         "2012–present"
      ],
      "Labels": [
         "Topshelf"
      ],
      "Members": [
         "KT Chang",
         "Tell Chang",
         "Chia-Chin Tu"
      ],
      "Traditional Chinese": [
         "大象體操"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (Chinese: 大象體操) is a [GENRE] band from Kaohsiung, Taiwan founded in [MONTH] [YEAR]. The group consists of siblings KT Chang (bass) and Tell Chang (guitar), and drummer Chia-Chin Tu.  The word \"elephant\" in the band name symbolizes their bass-driven melodies, and \"gym\" refers to their agile and irregular rhythms.\n",
      "As children, KT and Tell Chang were trained in classical music by their mother, while Chia-chin Tu learned classical percussion.  After the siblings met Tu at a music club in high school, the trio formed [BAND_NAME] in [MONTH] [YEAR], hand-produced a limited edition EP, and toured Taiwan on the single \"Ordinary Route\" (later released on their album Angle).  On [MONTH] 8, [YEAR] the band released Balance, their first EP, which included the song \"Ocean in the Night\" which was produced in collaboration with Hong-shen Hong, the lead singer of indie band Touming Magazine.  In [YEAR], they collaborated with Yoga Lin on a song, \"Speaking in Tongues\", which they performed with him in Hung Hom, Hong Kong and at the Taipei Arena.\n",
      "In [MONTH] [YEAR], their debut album Angle was released, with singles featuring Panai Kusui and [PERSON_NAME_FULL_0_MALE].   In [MONTH] [YEAR], the group members announced a [GENRE] a performance entitled See You Then in addition to a short documentary of the same name.\n"
   ]
}