{
   "Name": {
      "text": [
         "The band's Chinese name, 老王樂隊 (Lǎowáng yuèduì), directly translates to \"Old Wang Band.\" In Chinese, \"Old Wang\" is often used as slang for the man next door who his wife has an affair with.[4] This is the origin of the band's English name, \"Your Woman Sleep With Others.\"[5]\n",
         "According to lead singer Zhang Lichang, the name is meant to reflect the band's cynical approach to both the Taiwanese education system and music-making.[6]\n"
      ]
   },
   "Sections": [
      "1 Name",
      "2 History",
      "3 Members",
      "4 Discography",
      "4.1 EP",
      "4.2 Albums",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Your Woman Sleep With Others (Traditional Chinese: 老王樂隊) is a Taiwanese folk rock band. The band was established in 2015 in Taipei, Taiwan. It currently consists of five members: Zhang Lichang (lead singer), Tong Weishuo (guitar), Liao Jiemin (drums), Feng Huiyuan (bass), and Shao Jiaying (cello).[1]\n",
         "The band is most well-known for their EP Stolen Childhood (吾十有五而志於學), which focuses on the failures of the Taiwanese education system.[2] In 2018, the band won the Golden Indie Award Best Folk Single for the song \"Cram Schools Killed the Children\" on the same album.[3]\n"
      ]
   },
   "History": {
      "text": [
         "The band was originally created in late 2015 by members Zhang Lichang, Feng Huiyuan, and Tong Weishuo in order to compete in a college music competition.[7] In 2016, the band gained notoriety due to their success at college music competitions around Taiwan.[8] Their most significant achievement was earning first prize at the music competitions at Tamkang University and National Chengchi University for their song \"Stable Life, Suffer Exams.\"[7] This earned them the title \"Double Gold Champion\" (金韶金旋雙冠), launching the band into the national spotlight.[1]\n",
         "On September 28, 2017, the band released their first EP, entitled Stolen Childhood (吾十有五而志於學). This album revolves around the despair and hopelessness caused by the Taiwanese education system.[2] In 2018, the band won the Golden Indie Award \"Best Folk Single\" for the song \"Cram Schools Killed the Children.\" Additionally, this EP earned the band a Golden Indie Award nomination for \"Best New Band.\"[3] The most popular song from this album, \"Teens Edge,\" has received over 19 million views on YouTube.[9]\n",
         "On November 8, 2019, the band released their album I Examine Myself Three Times a Day (吾日三省吾身).[10]\n",
         "Ironically, despite the band's critique of the Taiwanese education system, four of the five members are still college students. As of December 2019, the only member who has completely graduated from college is cellist Shao Jiaying.[6]\n"
      ]
   },
   "Members": {},
   "Discography": {
      "EP": {
         "text": [
            "(吾十有五而志於學)\n",
            "2. Cram Schools Killed the Children (補習班的門口高掛我的黑白照片)\n",
            "3. Teens Edge (我還年輕 我還年輕)\n"
         ]
      },
      "Albums": {
         "text": [
            "(吾日三省吾身)\n",
            "2. In Your Face (迎面而來)\n",
            "3. Fishing (垂釣)\n",
            "4. Running on the Rooftop (他們在鐵皮屋頂上奔跑)\n",
            "5. Day and Night (日夜無常)\n",
            "6. Sleepless nights and haunting memories \n",
            "(那些失眠的夜與難以忘懷的事)\n",
            "7. Where Is My Ex? (曾經的女人啊 你在哪裡 你在哪裡)\n",
            "8. Enjoy (安九)\n",
            "9. Minutes Til Dawn (再等一下就天亮了)\n",
            "10. We Need to Live a Regular Life (規律的生活)\n"
         ]
      }
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Your Woman Sleep With Others (Traditional Chinese: 老王樂隊) is a Taiwanese folk rock band. The band was established in 2015 in Taipei, Taiwan. It currently consists of five members: Zhang Lichang (lead singer), Tong Weishuo (guitar), Liao Jiemin (drums), Feng Huiyuan (bass), and Shao Jiaying (cello).[1]\n",
      "The band is most well-known for their EP Stolen Childhood (吾十有五而志於學), which focuses on the failures of the Taiwanese education system.[2] In 2018, the band won the Golden Indie Award Best Folk Single for the song \"Cram Schools Killed the Children\" on the same album.[3]\n",
      "The band's Chinese name, 老王樂隊 (Lǎowáng yuèduì), directly translates to \"Old Wang Band.\" In Chinese, \"Old Wang\" is often used as slang for the man next door who his wife has an affair with.[4] This is the origin of the band's English name, \"Your Woman Sleep With Others.\"[5]\n",
      "According to lead singer Zhang Lichang, the name is meant to reflect the band's cynical approach to both the Taiwanese education system and music-making.[6]\n"
   ],
   "infobox": {
      "Origin": [
         "Taiwan"
      ],
      "Genres": [
         "folk rock"
      ],
      "Instruments": [
         "Acoustic guitar, electric guitar, electric bass, drumset, cello"
      ],
      "Years active": [
         "2017–present"
      ],
      "Labels": [
         "Naughty Neighbors Co. (壞鄰居有限公司)"
      ],
      "Website": [
         "www.facebook.com/yourwomansleepwithothers"
      ],
      "Members": [
         "Zhang Lichang (張立長)",
         "Tong Weishuo（童偉碩)",
         "Liao Jiemin（廖潔民)",
         "Feng Huiyuan（馮會元)",
         "Shao Jiaying（邵佳瑩)"
      ]
   }
}