{
   "Name": "Love Battery",
   "rawData": [
      "Love Battery is an American rock band from Seattle, Washington.\n",
      "Love Battery was formed in 1989 by former Room Nine leader Ron Nine (b. Ron Rudzitis), guitarist Kevin Whitworth (ex-Crisis Party), bassist Tommy \"Bonehead\" Simpson (also ex-Crisis Party) and Mudhoney drummer Dan Peters.  Their name came from a song of the same name by British punk band the Buzzcocks.\n",
      "Before releasing their first single Peters left the group and was replaced by ex-Skin Yard drummer Jason Finn. With this lineup the band released their debut single Between The Eyes for seminal Seattle record label Sub Pop. By 1990 Simpson had been replaced by ex-U-Men bassist Jim Tillman. With this lineup the band released their debut EP Between the Eyes in 1990, again on Sub Pop. This record was later expanded and released as their first full-length album in 1991. Following the Between The Eyes EP were the Foot singles and Out Of Focus EP.\n"
   ],
   "infobox": {
      "Origin": [
         "Seattle, Washington, United States"
      ],
      "Genres": [
         "Alternative rock",
         "grunge",
         "psychedelic rock",
         "indie rock"
      ],
      "Years active": [
         "1989–2002",
         "2006",
         "2011–2012"
      ],
      "Labels": [
         "Sub Pop, Atlas Records, C/Z"
      ],
      "Associated acts": [
         "Mother Love Bone",
         "Mudhoney",
         "Green River",
         "The Presidents of the United States of America"
      ],
      "Website": [
         "eskimo.com/~tracyr/LoveBat.html"
      ],
      "Members": [
         "Ron Nine",
         "Kevin Whitworth",
         "Jason Finn",
         "Jim Tillman"
      ],
      "Past members": [
         "Dan Peters",
         "Tommy Simpson",
         "Mike Musburger",
         "Bruce Fairweather"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Seattle, Washington.\n",
      "[BAND_NAME] was formed in [YEAR] by former Room Nine leader [PERSON_NAME_FIRST_0] Nine (b. [PERSON_NAME_FULL_0_MALE]), guitarist [PERSON_NAME_FULL_1_MALE] (ex-Crisis Party), bassist Tommy \"Bonehead\" Simpson (also ex-Crisis Party) and Mudhoney drummer Dan Peters.  Their name came from a [GENRE] band the Buzzcocks.\n",
      "Before releasing their first single Peters left the group and was replaced by ex-Skin Yard drummer Jason Finn. With this lineup the band released their debut single Between The Eyes for seminal Seattle record label [PERSON_NAME_FULL_1_MALE]. By [YEAR] Simpson had been replaced by ex-U-Men bassist [PERSON_NAME_FULL_0_MALE]. With this lineup the band released their debut EP Between the Eyes in [YEAR], again on [PERSON_NAME_FULL_1_MALE]. This record was later expanded and released as their first full-length album in [YEAR]. Following the Between The Eyes EP were the Foot singles and Out Of Focus EP.\n"
   ]
}