{
   "Name": "Love Battery",
   "Sections": [
      "1 History",
      "2 Band members",
      "3 Discography",
      "3.1 Albums",
      "3.2 Singles/Eps",
      "3.3 Compilation/Soundtrack contributions",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Love Battery is an American rock band from Seattle, Washington.\n"
      ]
   },
   "History": {
      "text": [
         "Love Battery was formed in 1989 by former Room Nine leader Ron Nine (b. Ron Rudzitis), guitarist Kevin Whitworth (ex-Crisis Party), bassist Tommy \"Bonehead\" Simpson (also ex-Crisis Party) and Mudhoney drummer Dan Peters.  Their name came from a song of the same name by British punk band the Buzzcocks.\n",
         "Before releasing their first single Peters left the group and was replaced by ex-Skin Yard drummer Jason Finn. With this lineup the band released their debut single Between The Eyes for seminal Seattle record label Sub Pop. By 1990 Simpson had been replaced by ex-U-Men bassist Jim Tillman. With this lineup the band released their debut EP Between the Eyes in 1990, again on Sub Pop. This record was later expanded and released as their first full-length album in 1991. Following the Between The Eyes EP were the Foot singles and Out Of Focus EP.\n",
         "In 1992 the band recorded and released Dayglo. In the Sub Pop catalog, Dayglo was listed as \"Blotter not included\" a play on \"Batteries not included\" instead referring to LSD. Soon after, Tillman left to pursue other interests. He was replaced at first by original bassist Tommy Simpson, who in turn was replaced by ex-Green River and Mother Love Bone guitarist Bruce Fairweather.\n",
         "In 1993 the Far Gone album appeared, which to many was considered a disappointment following Dayglo's critical success. Initially Far Gone was to be released by PolyGram Records but due to contractual problems with Sub Pop Records,  Far Gone was dumped by the major label. Instead an inferior 'rough mix' of the album was released by Sub Pop, a problem which Love Battery planned to rectify by remixing and reissuing but never did.\n",
         "Following the Far Gone fiasco, Love Battery signed with Atlas Records in 1994 releasing the Nehru Jacket EP late in the year. It contained 2 songs that also found their way onto 1995's Straight Freak Ticket album which was also released on Atlas in 1995. The label failed to promote the band and album properly however which resulted in poor sales. Shortly thereafter Finn left the group to join The Presidents of the United States of America who quickly found success later in the year.\n",
         "A prolonged period of uncertainty ensued following Finn's departure with an array of drummers brought in as his replacement including original drummer Dan Peters and ex-Posies and Fastbacks drummer Mike Musburger. The band practically disappeared until the release of their fifth album Confusion Au Go Go in 1999. This time around drummers Peters, Musburger and Finn all contributed to the album although Peters took on a majority of the work.\n",
         "Following the release of Confusion Au Go Go Love Battery remained for the most part quiet. A few one off performances were made in 2002 featuring Tommy Simpson returning on bass and Finn and Peters on drums. After a prolonged period of inactivity the band played their first show in 4 years on June 23, 2006 at Neumo's in Seattle, WA. The current lineup consists of Nine, Whitworth, Simpson and Musburger.\n",
         "In 1996 Love Battery was featured in the documentary Hype!, chronicling the rise of the Seattle \"grunge\" music scene. A clip is shown of a live performance of \"Between the Eyes.\"\n",
         "A video for \"Out Of Focus\" appears on Sub Pop Video Network Program, Volume Two. They also made videos for \"Fuzz Factory\" and \"Harold's Pink Room\" from the Straight Freak Ticket album. The \"Fuzz Factory\" video was shot in Las Vegas and featured the band driving around in a white Cadillac convertible, hinting at Hunter S. Thompson's famous book, Fear and Loathing in Las Vegas years before the film of the same name starring actor Johnny Depp was released.\n",
         "Love Battery leader Ron Nine also plays in new band Down With People who have been significantly more active than Love Battery as of late. As of 2010 Ron Nine, former members of Love Battery and Tad bassist Kurt Danielson play in a band called Vaporland.\n",
         "In 2011, Love Battery reunited amidst the individual members' other projects to perform at The Mix in Seattle, Washington on October 22nd.\n",
         "2012 marked a new start for the band, as they reunited with a new rhythm section to perform in venues such as LoFi Performance Gallery on May 19th, the Mural Amphitheatre in Seattle on August 20th and the Comet Tavern on September 29th alongside artists such as Atomic Bride, Summer Babes and Blood Orange Paradise. On their Myspace page, they announced plans to release new material in the following year.\n",
         "That material never materialized, but the Dayglo lineup reunited in 2018 to play that album in its entirety in several Seattle shows.[1]\n"
      ]
   },
   "Band members": {},
   "Discography": {
      "Albums": {},
      "Singles/Eps": {},
      "Compilation/Soundtrack contributions": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Love Battery is an American rock band from Seattle, Washington.\n",
      "Love Battery was formed in 1989 by former Room Nine leader Ron Nine (b. Ron Rudzitis), guitarist Kevin Whitworth (ex-Crisis Party), bassist Tommy \"Bonehead\" Simpson (also ex-Crisis Party) and Mudhoney drummer Dan Peters.  Their name came from a song of the same name by British punk band the Buzzcocks.\n",
      "Before releasing their first single Peters left the group and was replaced by ex-Skin Yard drummer Jason Finn. With this lineup the band released their debut single Between The Eyes for seminal Seattle record label Sub Pop. By 1990 Simpson had been replaced by ex-U-Men bassist Jim Tillman. With this lineup the band released their debut EP Between the Eyes in 1990, again on Sub Pop. This record was later expanded and released as their first full-length album in 1991. Following the Between The Eyes EP were the Foot singles and Out Of Focus EP.\n",
      "In 1992 the band recorded and released Dayglo. In the Sub Pop catalog, Dayglo was listed as \"Blotter not included\" a play on \"Batteries not included\" instead referring to LSD. Soon after, Tillman left to pursue other interests. He was replaced at first by original bassist Tommy Simpson, who in turn was replaced by ex-Green River and Mother Love Bone guitarist Bruce Fairweather.\n"
   ]
}