{
   "Name": "Rogue Wave (band)",
   "rawData": [
      "Rogue Wave is an indie rock band from Oakland, California, and headed by Zach Schwartz (a.k.a. Zach Rogue) who created the band after losing his job in the dot-com bust. Their first album was Out of the Shadow which was released privately in 2003 and re-released in 2004. In the fall of 2004 they went on a national tour of the United States. Their most recent album, Cover Me, was released on February 17, 2017, through Easy Sound Recording Company.\n",
      "In early 2002, Zach Rogue decided to take some time off from his home base of San Francisco and set off with a one-way ticket to New York in March with the intention of recording one or two songs with friend Bill Racine. He came away with an album's worth of material that would later become Rogue Wave's debut, Out of the Shadow. After returning to the Bay Area with a nearly completed record in hand, Zach decided to leave his former band, the Bay Area-based Desoto Reds, in which he played guitar, and form his own group. At the end of 2002, while preparing the album for release, Zach rounded out the band's lineup with the addition of Patrick Spurgeon (drums, keys, samples, vocals) Sonya Westcott (bass, vocals), and Gram LeBron (guitar, keys, vocals).\n",
      "Patrick Spurgeon has played with bands Churches, Pancho San, Somehow at Sea, Antenna, Stranded at the Drive In, Ramona the Pest, Brando, Steve Kowalski, Lessick, and has also released solo work as The Phantom Drummer.\n"
   ],
   "infobox": {
      "Origin": [
         "Oakland, California, United States"
      ],
      "Genres": [
         "Indie rock, lo-fi"
      ],
      "Years active": [
         "2002–present"
      ],
      "Labels": [
         "Responsive Recordings (2002-2004)",
         "Sub Pop (2004-2007)",
         "Brushfire Records (2007-2013)",
         "Vagrant (2013-present)",
         "Easy Sound Recording Company (2016-present)"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Zach Rogue",
         "Pat Spurgeon",
         "Masanori Christianson",
         "Jon Monahan"
      ],
      "Past members": [
         "Sonya Westcott",
         "Evan Farrell",
         "Gram LeBron",
         "Patrick Abernethy",
         "Steve Taylor",
         "Ken Christianson",
         "Cameron Jasper",
         "Dominic East",
         "Dan Iead",
         "Rob Easson"
      ]
   }
}