{
   "Band members": {
      "Current": {},
      "Former": {}
   },
   "Discography": {
      "EPs": {},
      "Singles": {},
      "Soundtracks": {},
      "Studio albums": {
         "Notes": {}
      }
   },
   "External links": {},
   "History": {
      "D-Tour": {
         "text": [
            "The band is featured extensively in the documentary, D-Tour, produced and directed by Jim Granato, which chronicles Spurgeon's struggles with kidney disease and his wait for a transplant.   The film was featured on the show \"Independent Lens\" on PBS.[6] Spurgeon was born with a single kidney.\n"
         ]
      },
      "Departure and death of Evan Farrell": {
         "text": [
            "Evan Farrell left Rogue Wave after the recording of Asleep at Heaven's Gate to pursue his other project, The Japonize Elephants, but remained a friend of the band.[3] Farrell died soon after on December 23, 2007 in Oakland CA, suffering from \"massive smoke inhalation\" in an apartment fire caused by a dangerously obsolete gas-fired floor furnace. Gram LeBron was also in the house. Awakened by Evan's warnings, he was unable to rescue him when forced from the house by the flames.[4] He left behind a wife and two young children.[5] Farrell himself had replaced original bassist Sonya Westcott in 2004. \nPatrick Abernethy joined the band in 2007 to take Farrell's place on bass and was later replaced by Cameron Jasper in 2009.\n"
         ]
      },
      "Formation of Rogue Wave and other projects": {
         "text": [
            "In early 2002, Zach Rogue decided to take some time off from his home base of San Francisco and set off with a one-way ticket to New York in March with the intention of recording one or two songs with friend Bill Racine. He came away with an album's worth of material that would later become Rogue Wave's debut, Out of the Shadow. After returning to the Bay Area with a nearly completed record in hand, Zach decided to leave his former band, the Bay Area-based Desoto Reds, in which he played guitar, and form his own group. At the end of 2002, while preparing the album for release, Zach rounded out the band's lineup with the addition of Patrick Spurgeon (drums, keys, samples, vocals) Sonya Westcott (bass, vocals), and Gram LeBron (guitar, keys, vocals).[1]\n",
            "Patrick Spurgeon has played with bands Churches, Pancho San, Somehow at Sea, Antenna, Stranded at the Drive In, Ramona the Pest, Brando, Steve Kowalski, Lessick, and has also released solo work as The Phantom Drummer.[2]\n",
            "Gram LeBron has been involved in the bands Com Jr, Get Better, The Album Leaf, Port O'Brien, Long and Golden, schrasj, Sad Like Crazy, Conundrum, Jessica Six, All Transistor and has also released solo work as Golden Gram.[2]\nHe currently plays with Outer Embassy and composes for film and commercials.\n",
            "Sonya Westcott was in the band Venus Bleeding before her time with Rogue Wave.[2]\n",
            "Evan Farrell played with The Japonize Elephants, Mega Mousse, Amaldecor, Big Mule, Hunted Haunted Bazergahn Klezmorchestra, Grande Rouge, Kentucky Nightmare, Mama HooHoo.[2]\n",
            "Patrick Abernethy was formerly a keyboard player with Beulah before joining Rogue Wave.\n"
         ]
      },
      "Nightingale Floors": {
         "text": [
            "Rogue Wave announced the release of their fifth studio album, Nightingale Floors,[8] on March 27 via their Facebook page.  It was released on June 4, 2013.\n"
         ]
      },
      "Permalight": {
         "text": [
            "On November 18, 2009 Zach Rogue announced the release date for their fourth full-length album, Permalight.[7] It was released on March 2, 2010 through Brushfire Records.\n"
         ]
      },
      "Signing to Easy Sound Recording Company and Delusions of Grand Fur": {
         "text": [
            "In February 2016, the band announced the release of their sixth studio album, Delusions of Grand Fur, through new record label Easy Sound Recording Company (created in 2014 and home to Fruit Bats, Futurebirds, Vetiver, and Marianne Faithfull, among others). It was released on April 29, 2016.\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation of Rogue Wave and other projects",
      "1.2 Departure and death of Evan Farrell",
      "1.3 D-Tour",
      "1.4 Permalight",
      "1.5 Nightingale Floors",
      "1.6 Signing to Easy Sound Recording Company and Delusions of Grand Fur",
      "2 Band members",
      "2.1 Current",
      "2.2 Former",
      "3 Timeline",
      "4 Discography",
      "4.1 Studio albums",
      "4.1.1 Notes",
      "4.2 EPs",
      "4.3 Singles",
      "4.4 Soundtracks",
      "5 Television and film appearances",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Rogue Wave is an indie rock band from Oakland, California, and headed by Zach Schwartz (a.k.a. Zach Rogue) who created the band after losing his job in the dot-com bust. Their first album was Out of the Shadow which was released privately in 2003 and re-released in 2004. In the fall of 2004 they went on a national tour of the United States. Their most recent album, Cover Me, was released on February 17, 2017, through Easy Sound Recording Company.\n"
      ]
   },
   "Television and film appearances": {
      "text": [
         "Rogue Wave appeared as themselves in the 2009 movie Love Happens, starring Aaron Eckhart and Jennifer Aniston.  In the movie, set in Seattle, Eckhart's character is disappointed that tickets to a Rogue Wave outdoor concert are sold out.  However, Aniston's character surprises him by borrowing a friend's utility truck with a “cherry picker” boom.  She parks the truck near the large open-air amphitheater, and the two of them enjoy a great view of the concert from the elevated bucket.\n",
         "Rogue Wave is featured on the Stubbs: The Zombie Soundtrack performing a cover of Buddy Holly's \"'Everyday'\". Their cover of Buddy Holly's \"Everyday\" was also plagiarized[36] for a television commercial for the movie Rachel Getting Married.\n",
         "A live version of their Out of the Shadow track, \"Every Moment\", appeared on the soundtrack for the movie Napoleon Dynamite, but not in the movie itself.\n",
         "The song \"Eyes\" was featured in the movie Just Friends, the sixteenth episode of season two of 90210, the pilot of television series Heroes, and a 2010 commercial for LG\n",
         "Rogue Wave's songs have also appeared in episodes of Heroes, Friday Night Lights, Scrubs and Chuck. \nThey also had their song \"Kicking the Heart Out\" on an episode of Weeds on Showtime.\n",
         "The Fox show The O.C. has used \"Publish My Love\", \"California\",  and \"Interruptions\"  as well as included \"Publish My Love\" on Music from the OC: Mix 5, a collection of songs used in the show.\n",
         "Recently, the song \"Lake Michigan\" was used in an ad for Microsoft's MP3 player Zune, as well as a commercial for MLB Network. In 2011, Rob Kardashian danced the Viennese Waltz to \"Lake Michigan\" in Season 13 of Dancing with the Stars.\n",
         "The third episode of season five Nip/Tuck featured \"California\".\n",
         "Their song \"Harmonium\" is used in an ESPN commercial for the UEFA Euro 2008.\n",
         "In 2008, the band filmed and released a video for the song \"Chicago X 12\" (from Asleep at Heaven's Gate) which was directed by actor/comedian Bob Odenkirk.[37]\n",
         "The song \"Love's Lost Guarantee\" is featured on one episode of One Tree Hill's seventh season, as well as in the trailer for the indie-film Wristcutters.\n",
         "A poster for a Rogue Wave concert can be seen on the wall of the bakery in Stranger than Fiction.\n",
         "Rogue Wave's song 'Lake Michigan' can also be heard on the OPSM Loves Eyes Television Ad created in 2010.\n",
         "Rogue Wave's song \"Eyes\" was featured in the pilot episode of Lone Star, which aired on FOX 9/20/10.\n",
         "Their song \"Eyes\" was most recently featured on an episode of Cougar Town on 9/29/10.\n",
         "The song \"Everyday\" is used in the episode 1.12 (Unpleasantville) of The Vampire Diaries which aired on the CW in 2010.\n",
         "The song \"College\" is featured in the 2013 film Carrie.\n",
         "In 2013, Rogue Wave also did a collaboration with the cast of Studio C to produce an Off-set sketch/music video called \"Context is Everything\".\n",
         "Rogue Wave's song \"Eyes\" was featured in a 2015 sketch featuring Jimmy Fallon, Justin Timberlake and Will Ferrell for The Tonight Show Starring Jimmy Fallon.\n",
         "Rogue Wave's song \"Lake Michigan\" is featured in the movie \"The Secret Life of Walter Mitty\" and its soundtrack.\n",
         "In 2017, Rogue Wave's cover of Kim Carnes 1981 song \"Bette Davis Eyes\" was featured in Season 1, Episode 11 of the TV show Riverdale.\n"
      ]
   },
   "Timeline": {},
   "Title": "Rogue Wave (band) - Wikipedia"
}