{
   "Name": "Samiam",
   "rawData": [
      "Samiam (pronounced \"sam-I-am\") is an American punk rock band from Berkeley, California, active since 1988.\n",
      "Samiam was formed in late 1988 after the breakup of the Gilman club mainstay Isocracy. Their first show was in January 1989 with Christ on Parade. They released records through New Red Archives and Hopeless Records in the US and Burning Heart Records in Europe. In the mid-'90s, the band had two releases on major labels, Atlantic Records in 1994 and Ignition/Tommy Boy in 1997. This path achieved modest mainstream success; a video for \"Capsized\" gained considerable airplay on MTV, they performed on The Jon Stewart Show in 1994 and the single \"She Found You\" garnered considerable radio play in 1998.\n",
      "Over the years, Samiam has toured extensively throughout Europe, North America and Japan, and performed with bands like Bad Religion, Green Day, The Offspring, NOFX, No Doubt, Toadies, Sense Field, Blink-182, Deftones, 311, Millencolin, and Fishbone.\n"
   ],
   "infobox": {
      "Origin": [
         "Berkeley, California, U.S."
      ],
      "Genres": [
         "Punk rock, emo, post-hardcore, pop punk"
      ],
      "Years active": [
         "1988–present"
      ],
      "Labels": [
         "New Red Archives, Cleopatra, Atlantic, Hopeless, Your Choice, Burning Heart, No Idea, Dead Broke Rekerds"
      ],
      "Website": [
         "Official Facebook page"
      ],
      "Members": [
         "Jason Beebout (vocals) ",
         " Sergie Loobkoff (guitar) ",
         " Colin Brooks (drums) ",
         " Sean Kennerly (guitar/bass) ",
         " Chad Darby (bass)"
      ],
      "Past members": [
         "Ryan Sullivan (guitar, 1988–1989)",
         "Johnny Cruz (drums)",
         "James Brogan (guitar, 1988–2000) ",
         " Martin Brohm (bass, 1988–1993) ",
         " Aaron Rubin (bass, 1993–1997) ",
         " Jeremy Bergo (bass, 2006) ",
         " Mark Mortinsen (drums, 1988–1990/1993) ",
         " Dave Ayer (drums, 1990–1993) ",
         " Tré Cool (drums, 1999) ",
         " Scott McPherson (drums, 1999) ",
         " Victor Indrizzo (drums, 1993–1995) ",
         " Davey Latter (drums, 1999)",
         " Michael Petrak (drums, 1995–1999) ",
         " Charlie Walker (drums) ",
         " Billy Bouchard (bass)"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] (pronounced [SONG_NAME]) is an [GENRE] band from Berkeley, California, active since [YEAR].\n",
      "[BAND_NAME] was formed in late [YEAR] after the breakup of the Gilman club mainstay Isocracy. Their first show was in [MONTH] [YEAR] with Christ on Parade. They released records through New Red Archives and Hopeless Records in the US and Burning Heart Records in Europe. In the mid-'90s, the band had two releases on major labels, Atlantic Records in [YEAR] and Ignition/Tommy Boy in [YEAR]. This path achieved modest mainstream success; a video for [SONG_NAME] garnered considerable radio play in [YEAR].\n",
      "Over the years, [BAND_NAME] has toured extensively throughout Europe, North America and Japan, and performed with bands like Bad Religion, Green Day, The Offspring, NOFX, No Doubt, Toadies, Sense Field, Blink-182, Deftones, 311, Millencolin, and Fishbone.\n"
   ]
}