{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "Their name has many supposed origins, the most popular states that it is derived from an anti-skateboarding measure on the ballots in Concord, California. They were noted for self-publicity. For example, they ordered stickers by the thousands and stuck them in numerous places. They were also known to \"tag\" their name with sharpies on numerous objects and in numerous places; the results of which have been seen in places all over the country. Most of these incidents are apparently done without permission. One notable sighting was on the Grassy Knoll near where Lee Harvey Oswald assassinated President John F. Kennedy. These stickers have also been seen on bumpers of police cars all over the Bay Area.[citation needed]\n",
         "The band's vocalist is Andrew \"Andrew Champion\" Ataie, who went on to a variety of bands like Hopelifter, End of the World, Shadowboxer, and Highwire Days. Guitarist Doug Sangalang went on to the bands Limp, One Time Angels, and Jackson United. Bass player Jimi Cheetah went on to the bands Tilt and Nothing Cool, as well as running Cheetah's Records.[1] Guitarist Grant McIntire and drummer Mark Mortenson went on to a brief stint in Me First and the Gimme Gimmes. Mark Mortenson also played in the bands Grinch and Samiam. Grant McIntire and Andrew Champion also played in the band Dance Hall Crashers.[2]\n",
         "Screw 32's music has been likened to Bouncing Souls, and AFI.\nOne of the first East Coast influenced hardcore style bands to come out of the East Bay in the early 1990s, Screw 32 went on an endless string of United States and Canadian tours with many popular punk rock bands of their era, and they headlined their last few tours. Influenced by the bands that were coming up in the area (e.g.-n Rancid, Green Day, AFI, and others) they led by example and also incorporated other bands concepts into their own effort.\n",
         "The band started when Grant McIntire and Andrew Champion were at a coffee shop complaining about the state of the local music scene and their friend Shea Walters walked up and told them to, \"Stop whining and start their own band\".[citation needed] Grant and Andrew had been in two bands previously and had been friends since grade school when Grant moved to the Bay Area from New York. Doug Sangalang was playing at the time with Jesse Michaels (of Operation Ivy) current project, Big Rig, and joined Screw 32 a few weeks into the band's rehearsal endeavors and resulted as a key role in sculpting Screw 32's melodic blend of dc style hardcore and LA punk. Jimi Cheetah and Josh Kilbourn were the original rhythm section. Perhaps the largest thread was each individual member's involvement in the bay area scene before and after Screw 32 each band member was and continues to be involved just as closely as then and in some cases more-so. The band was the plan so to speak which gave everyone a very exciting 'All or nothing' perspective on the project.\n",
         "When Screw 32 first formed they were inseparable from AFI, and the two bands would help each other get shows, throwing each other on as the support for whatever shows they would get. Both bands got too big after a while to play together, to the point where they would have to jump on stage to play at 924 Gilman Street. They were not permitted to play at Gilman St. due to the size of the crowd and the inherent security problems.\nTheir first tour was with Los Angeles legends Youth Brigade, who were a huge influence on the band and helped them out getting started. Screw 32 did at least five full tours with the Bouncing Souls and was also heavily influenced by them, due to their \"no-holds-barred\", all-out touring ethic. The band was always incredibly tight due to their die-hard work ethic and practice schedule, and their team oriented attitude that really showed in their live shows.[citation needed] The members have all continued to play music since the band split in 1997.\n",
         "The last show for Screw 32 was at Boarderline Warehouse near Twain Harte, California in April 1997 run by a friend of theirs named Mark Kirkman (Who ran the now famous BullPen skateboard shop in Danville, California where the San Ramon and Danville straightedge scene was born and in extension the Northern California straightedge hardcore scene was also born with such bands as Unit Pride, Breakaway, Rabid Lassie, No Reason and many others) with Citizen Fish (ex-Subhumans), The Criminals, and Fury 66 from Santa Cruz, CA.\n"
      ]
   },
   "Members": {
      "text": [
         "Andrew Champion, Douglas Sangalang, Grant McIntire, Jimi Cheetah (McCluskey), and Josh Kilbourn were the original members of the band.[3] Jamie Morrison played a few tours and a lot of shows in between Josh and ultimately Mark Mortenson who played on their last record and all of their remaining shows, recordings, and tours.\n",
         "The band reformed with a new incarnation in the Spring of 2016 joined by original members Andrew Champion and Grant McIntire and new additions guitarist Zac “The Butcher\" Hunter of The Nerve Agents Jude Ramirez on drums and bassist Dustin Tyler \"DBC\" Kanel. The new lineup performed a few bay area shows, most notably the reunion of Fury 66 in their hometown, Santa Cruz.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Screw 32 is an American, Berkeley/East Bay-area, punk rock band.\n"
      ]
   },
   "Title": "Screw 32 - Wikipedia"
}