{
   "Band members": {
      "text": [
         "\n"
      ]
   },
   "Discography": {
      "Compilation albums": {},
      "Digital Singles (Amazon MP3 and iTunes)": {},
      "Extended plays": {
         "text": [
            "(reissued as Reset by Eulogy)\n"
         ]
      },
      "Music videos": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "Burning at Both Ends (2010–12)": {
         "text": [
            "On October 11, 2010, the band announced via their Twitter account that they had begun recording the follow-up to This Will Be the Death of Us with producer Brian McTernan. The expected release for the new album was set tentatively for Spring 2011.\n",
            "On a Q&A session on the band's Formspring account on January 7, 2011, they announced that the new album will be called Burning at Both Ends, and will be released on June 27, 2011.[15]\n",
            "In February–March 2011, the band supported Parkway Drive on their US headlining tour. Other opening acts were The Ghost Inside and The Warriors.[16] Following that tour, in April 2011, the band supported another major metalcore band - August Burns Red on their own US headlining tour, with supporting acts Texas in July and Born of Osiris.[16] In conjunction with the band's new release Burning at Both Ends, the band toured as part of the Vans Warped Tour, in June–August 2011.[17]\n",
            "On August 15, 2011, it was announced that the band was added as the main supporting act of the Pop Punk's Not Dead Tour, which headlined by New Found Glory in October–November 2011. Other opening acts include The Wonder Years, Man Overboard and This Time Next Year.\n",
            "On October 5, 2011, the band released the video for \"The Last American Virgin.\"\n",
            "On April 24, 2012 the band released two new songs, \"Only Right Now\" and \"I'll Walk It Off\", that were produced by Chad Gilbert of New Found Glory. Set Your Goals announced later in the year that they would be entering the studio to begin recording their new album with Chad as well.[18]\n",
            "On October 24, 2012, Ambrose announced on Facebook that he will be leaving the band after playing a final two shows in California. The second show was dismissed due to a band injury.\n"
         ]
      },
      "Formation and first releases (2004–08)": {
         "text": [
            "Forming in 2004, Set Your Goals released their first self-titled EP through Straight on Records in May 2004. The band embarked on some of their first tours with The Warriors and Make Move, as the word circulated about the EP they were approached by a number of labels. After \"touring off of that alone for almost 2 years\", they signed with Eulogy Recordings and re-released the EP under the name Reset in April 2005. Audelio Flores joined the band on April 2006, after playing in a band called Amity from Los Angeles.[5] Their second release on Eulogy was their debut studio album, entitled Mutiny!, which was released in July 2006. During winter of 2007 Dave Yoha amicably left the band due to tour exhaust. Daniel Coddaire returned for touring before he rejoined the band officially in 2008; Coddaire was Set Your Goals' original lead guitarist.\n",
            "In the Spring of 2007, they were support on Anti-Flag's headlining tour alongside Alexisonfire and Big D and the Kids Table. Set Your Goals released an acoustic version of their track \"Echoes\" for the Punk Goes Acoustic 2 compilation on Fearless Records in 2007. They also covered Lil Jon's \"Put Yo Hood Up\" for the Fearless Records compilation Punk Goes Crunk, released in April 2008.\n",
            "In the Spring of 2008 they played on the Bamboozle Roadshow with Saves the Day, Armor for Sleep, Valencia and Metro Station. Set Your Goals released a song entitled \"The Fallen\" through the social networking sites Trig and MySpace, and the flash and audio website Newgrounds. They played the entire 2008 Vans Warped Tour on the Smartpunk Stage.\n"
         ]
      },
      "Inactivity and departure of Ambrose (2013–15)": {
         "text": [
            "Following his departure from Set Your Goals, drummer Mike Ambrose joined emo band Misser and can be heard drumming on their 2013 EP “Distancing”, on Rise Records.\n",
            "In March 2013, rhythm guitarist Audelio Flores, Jr. suggested via Instagram and Facebook that Set Your Goals was in a deep hibernation. He has since started playing with What's Eating Gilbert (featuring Chad Gilbert of New Found Glory), joining the band on their US nationwide tour.\n",
            "On May 3, 2013, bassist Joe Saucedo announced via his Twitter account that he had started a new band and had new music on the way. One day later he went on to clarify that he had not left Set Your Goals but that the band was still on hold due to vocalist Jordan Brown still recovering and other band members being busy with different projects.\n",
            "In February 2014, Matt Wilson founded a record label called Calaveras Records, funded through crowd-funding platform Kickstarter.[19] Wilson announced on the Kickstarter page that the label would be re-releasing Set Your Goals' first demos which the band had regained from Eulogy Recordings, just in time for the band's 10th anniversary. Wilson also said that as a huge fan of vinyl, he would try to release the new vinyl pressing by April 19, 2014 (also known as Record Store Day). On February 21, 2014, the project was fully funded. On March 31, Calaveras Records tweeted that the re-release of Set Your Goals's 'Reset' Demo was recognized by Pirates Press as the record of the week for the week of March 28.[20]\n"
         ]
      },
      "Record label issues and This Will Be the Death of Us (2008–10)": {
         "text": [
            "Set Your Goals reached a buy-out agreement with Eulogy Recordings in August 2008.[8] Vocalist Matt Wilson later hinted that their next release may be self-released, saying, \"The truth is we have many options for our next record and self-releasing is one of the best and a very likely option.\"[9] In March 2009, it was announced that Epitaph Records had signed the band.[10]\n",
            "They supported New Found Glory on the UK Easy Core tour later in the year. They were the main support to New Found Glory on the Not Without a Fight tour in early 2009.\n",
            "On May 1, 2009, the band performed as Set Your Grohls, performing covers of Nirvana and Foo Fighters songs.[11] Their second record, This Will Be the Death of Us, was released through Epitaph Records on 21 July 2009 and was produced by Mike Green (Paramore, The Matches).[12]\n",
            "In support of the upcoming album, they toured Australia with All Time Low and Stealing O'Neal, and toured the United States throughout July and August with Four Year Strong, Polar Bear Club, The Swellers and Fireworks. The band played new songs from This Will Be the Death of Us live.[13]\n",
            "On the 28th of July Set Your Goals announced that their album This Will Be the Death of Us had made the Billboard (magazine) top 200 by placing at No. 65. This was in continuation to their previous success on their sophomore full-length album, where the song \"The Few That Remain\" (which features Hayley Williams) was requested at KROQ-FM and was selected for KROQ-FM's infamous Furious Five. The song Gaia Bleeds is featured on Madden NFL 10.\n",
            "The band played the entire Warped Tour 2010 on the Altec Lansing stage along with Parkway Drive, Four Year Strong, Emmure, Whitechapel, Suicide Silence and others.\n",
            "The band toured in support of You Me At Six and The Blackout overseas during November. As well, the band played their own set of headline dates in Liverpool, Leeds and Northampton.[14]\n"
         ]
      },
      "Reformation (2015–Present)": {
         "text": [
            "On December 3, 2015 Set Your Goals posted a picture of their logo with a caption of \"12-7-2015\", indicating an announcement to be made on Monday, December 7, 2015. That announcement was the reformation of Set Your Goals with their full line-up. The band listed show dates for the spring of 2016, beginning with 924 Gilman Street in Berkeley, California. More dates are anticipated in domestic and international territories. In October, the group supported Good Charlotte on their headlining US tour.[21]\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and first releases (2004–08)",
      "1.2 Record label issues and This Will Be the Death of Us (2008–10)",
      "1.3 Burning at Both Ends (2010–12)",
      "1.4 Inactivity and departure of Ambrose (2013–15)",
      "1.5 Reformation (2015–Present)",
      "2 Band members",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Extended plays",
      "3.3 Digital Singles (Amazon MP3 and iTunes)",
      "3.4 Compilation albums",
      "3.5 Music videos",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Set Your Goals is an American rock band from San Francisco, California, formed in 2004. Their band name is derived from the CIV album of the same name.[5]\n",
         "The band consists of vocalists Jordan Brown and Matt Wilson, drummer Mike Ambrose, guitarists Audelio Flores Jr and Daniel Coddaire and bassist Joe Saucedo.[6][7]\n"
      ]
   },
   "Title": "Set Your Goals (band) - Wikipedia"
}