{
   "Name": "Stoneground",
   "rawData": [
      "Stoneground was a rock band formed in 1970 in Concord, California. Originally a trio, Stoneground expanded to a 10-piece band by the time of their eponymous 1971 debut album. The group appeared in two films, Medicine Ball Caravan (1971) and Dracula A.D. 1972 (1972), and released three albums before singer Sal Valentino quit in 1973. Three other band members—Cory Lerios, Steve Price and David Jenkins—left to form pop group Pablo Cruise. Stoneground continued as an act through 1982, with only Tim Barnes and Annie Sampson remaining from the early incarnation of the band. Barnes and Price led a re-formed Stoneground in 2003 and released a studio album the following year.\n",
      "Stoneground was formed in 1970 in the San Francisco suburb of Concord, California. The original lineup consisted of Tim Barnes (guitars, vocals), Craig Randall (Bass), and Mike Mau (drums).\nBand manager and former Autumn Records executive Tom Donahue introduced the band to ex-Beau Brummels singer Sal Valentino and John Blakely (guitars, bass), both of whom joined Stoneground. Four female vocalists—Annie Sampson, Lynne Hughes, Lydia Phillips, and Deirdre LaPorte—were also added to the group. While touring America\nand Europe, the band added another new member, bassist/keyboardist Pete Sears, later of Jefferson Starship and Hot Tuna. Stoneground's self-titled debut album, released in early 1971, featured seven different lead singers on the album's ten tracks. \nThe album was produced by Tom Donahue with Sal Valentino assisting on some tracks. \nMusic journalist Robert Christgau said the album was \"certainly the aptest use of Sal Valentino since the Beau Brummels were on Autumn\". \nA Billboard review remarked that \"Stoneground has a lot of advance publicity to live up to, and in light of their first LP the predictions may have been somewhat inflationary, though there's no denying the potential for excitement here\".\n",
      "During this touring period, Stoneground was a \"traveling house band\" for Medicine Ball Caravan, an attempt by Warner Bros. to promote the band \nand capitalize on the success of the concert film genre following Woodstock. \nThe Medicine Ball Caravan film, which documented the 8,000 mile cross-country trip by 154 people \nin a \"hippie caravan\" \nof buses, trucks and musical groups, was directed by François Reichenbach—with Martin Scorsese as associate producer—and released in 1971. \nThree Stoneground songs appear on the original soundtrack, which also contains songs by Alice Cooper, B.B. King, Delaney & Bonnie, Doug Kershaw, and The Youngbloods.\n"
   ],
   "infobox": {
      "Origin": [
         "Concord, California, U.S."
      ],
      "Genres": [
         "Blues-rock, album-oriented rock"
      ],
      "Years active": [
         "1970–1984, 2003–2005"
      ],
      "Labels": [
         "Warner Bros."
      ],
      "Associated acts": [
         "The Beau Brummels, Pablo Cruise, Jefferson Starship"
      ],
      "Website": [
         "Official website"
      ],
      "Past members": [
         "Sal Valentino",
         "Tim Barnes",
         "Luther Bildt",
         "Mike Mau",
         "John Blakeley",
         "Lynne Hughes",
         "Annie Sampson",
         "Lydia Moreno",
         "Deirdre LaPorte",
         "Pete Sears",
         "Cory Lerios",
         "Steve Price",
         "Brian Godula",
         "David Jenkins",
         "Jo Baker",
         "Fred Webb",
         "Terry Davis",
         "Sammy Piazza",
         "Lenny Lee Goldsmith",
         "Dana Moret",
         "Claudia Knauer",
         "Greg King",
         "Kelly Stephens",
         "Terence Clements",
         "Joe Gazzaroli",
         "Stephan Bryan Salit"
      ]
   }
}