{
   "Name": "The Story So Far (band)",
   "rawData": [
      "The Story So Far is an American pop punk band from Walnut Creek, California, formed in 2007. They are currently signed to Pure Noise Records and have released 4 studio albums.\n",
      "The Story So Far formed in Walnut Creek, California in 2007. Their name is taken from the New Found Glory song \"The Story So Far\". The band consisted of Parker Cannon on vocals, Kevin Geyer on lead guitar, Kevin Ambrose on rhythm guitar, Ryan Torf on drums, and Kelen Capener on bass. On December 22, the band released the 5 Songs EP. Ambrose parted ways with the band when he went to college in 2010 and was replaced by William Levy. In March 2010 it was announced the band had signed to Pure Noise. Two months later the band released an EP, While You Were Sleeping (2010). In November, the band released a split with Maker.\n",
      "Barrett Records released a split of The Story So Far and Morgan Foster in May 2011. Pure Noise released the band's debut album Under Soil and Dirt in June. On March 26, 2013, they released their second studio album, What You Don't See, which debuted at number 46 on the Billboard 200 chart in the U.S. They have also released a split with Stick to Your Guns on June 18. This split contains one new original song, Clairvoyant, and a cover of Pinback's song \"Loro\". The band was featured on the cover of Alternative Press' March 2013 issue \"100 Bands You Need to Know.\" The band played the entire Warped Tour 2014 on the main stage.\n"
   ],
   "infobox": {
      "Origin": [
         "Walnut Creek, California, U.S."
      ],
      "Genres": [
         "Pop punk"
      ],
      "Years active": [
         "2007–present"
      ],
      "Labels": [
         "Pure Noise"
      ],
      "Website": [
         "thestorysofarca.com"
      ],
      "Members": [
         "Parker Cannon",
         "Kelen Capener",
         "Kevin Geyer",
         "Will Levy",
         "Ryan Torf"
      ],
      "Past members": [
         "Kevin Ambrose"
      ]
   }
}