{
   "Name": "Sweet Baby (band)",
   "rawData": [
      "Sweet Baby (originally known as Sweet Baby Jesus) was a pop punk band that originated from Berkeley, California, and was part of the 924 Gilman Street scene.  They were signed to Ruby Records.\n",
      "Formed in 1986 by singer Dallas Denery and singer/guitarist Matt Buenrostro with Crispy Jim (later of The Saddlebacks) on bass and Dr. Frank (the frontman of The Mr. T Experience) on drums. Frank and Crispy Jim did not appear on any Sweet Baby recordings, having been already replaced by Sergie Loobkoff (Samiam, Knapsack) and Richie Bucher (Jüke, Wynona Ryders), respectively. Aaron Elliott aka Aaron Cometbus also played drums for them on their 1989 US tour. They had two songs on the Maximum Rock and Roll compilation Turn it Around (1988), \"She's from Salinas\" and \"Pathetic.\" In 1989, they released their only LP, It's A Girl on Ruby Records (a Slash/Warner subsidiary). Their song \"Andorra\" was on the Lookout Records compilation double LP The Thing That Ate Floyd released in 1992.  Lookout Records re-released the band's It's A Girl album on compact disc in 1995, and Eccentric Pop Records released a remastered vinyl LP version with a bonus 7\" containing unreleased studio and live tracks in 2015.\n",
      "In January 2005, their song, \"Baby Baby Baby Baby Baby Baby Baby, I Love You\" was featured on Bravo in an advertisement for the show Queer Eye for the Straight Girl.\n"
   ],
   "infobox": {
      "Also known as": [
         "Sweet Baby Jesus"
      ],
      "Origin": [
         "Berkeley, California, United States"
      ],
      "Genres": [
         "Pop punk"
      ],
      "Years active": [
         "1985 (1985)–1989 (1989)"
      ],
      "Labels": [
         "Ruby, Lookout"
      ],
      "Associated acts": [
         "Soup, Buggerall, The Bomb Bassets, The Mr. T Experience, Kamala and the Karnivores, Crimpshrine"
      ],
      "Past members": [
         "Dallas Denery",
         "Matt Buenrostro",
         "Richie Bucher",
         "Sergie Loobkoff",
         "Crispy Jim",
         "Frank Portman",
         "Ivy DuBois",
         "Aaron Cometbus"
      ]
   },
   "albums": [
      "It's a Girl!"
   ]
}