{
   "Name": "Tower of Power",
   "Sections": [
      "1 History",
      "2 Collaborations",
      "3 Band members",
      "3.1 Current members",
      "3.2 Past members",
      "3.3 Timeline",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Live albums",
      "4.3 Compilations",
      "4.4 Singles",
      "4.5 Videos and DVDs",
      "5 See also",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Tower of Power is an American R&B-based horn section and band, originating in Oakland, California, that has been performing since 1968.[1] There have been a number of lead vocalists, the most well-known being Lenny Williams, who fronted the band between early 1973 and late 1974, the period of their greatest commercial success. They have had eight songs on the Billboard Hot 100;[2] their highest-charting songs include \"You're Still a Young Man\", \"So Very Hard to Go\", \"What Is Hip?\", and \"Don't Change Horses (in the Middle of a Stream)\".[3][4]\n"
      ]
   },
   "History": {
      "text": [
         "In the summer of 1968, tenor saxophonist/vocalist Emilio Castillo met Stephen \"Doc\" Kupka, who played baritone sax. Castillo had played in several bands, but Castillo's father told his son to \"hire that guy\" after a home audition.[5] Within months the group, then known as The Motowns, began playing various gigs around Oakland and Berkeley, their soul sound relating to both minority and rebellious listeners.[3][6]\n",
         "Castillo wanted to play Bill Graham's Fillmore Auditorium in San Francisco, but he realized he would never get in with a name like The Motowns.[6] The band agreed on Tower of Power and the name stuck.[7]\n",
         "By 1970, the now renamed Tower of Power—now including trumpet/arranger Greg Adams, first trumpet Mic Gillette, first saxophone Skip Mesquite, Francis \"Rocco\" Prestia on bass, Willie Fulton on guitar, and drummer David Garibaldi—signed a recording contract with Bill Graham's San Francisco Records and released their first album, East Bay Grease. Rufus Miller performed most of the lead vocals on this debut album.[3] The group was first introduced to the San Francisco Bay area by radio station KSAN, which played a variety of artists such as Cold Blood, Eric Mercury and Marvin Gaye.\n",
         "Augmented by percussionist/conga/bongo player Brent Byars, Tower of Power was released from their San Francisco label contract and moved to Warner Bros. Records. Rick Stevens replaced Rufus Miller as lead singer on 1972's Bump City, which gave the band their first national exposure.[8] This album included the hit single \"You're Still a Young Man\", which peaked at #29 on the Billboard Hot 100 and was Stevens' pinnacle vocal performance before leaving the band.[4] Emilio Castillo, who co-wrote the tune with Stephen Kupka, told Songfacts that the song was based on a true story about him and a former girlfriend who was six years his senior.[9]\n",
         "Tower of Power, released in the spring of 1973, was the third album for the band. It featured soul singer Lenny Williams on lead vocals and Lenny Pickett on lead tenor saxophone. Bruce Conte replaced guitarist Willie Fulton and keyboardist Chester D.Thompson also joined the band during the recording of the album. The album spawned their most-successful single \"So Very Hard to Go\". Although the single peaked at #17 on the Billboard Hot 100,[4] it landed in the Top 10 on the surveys of many West Coast Top 40 radio stations, hitting #1 on many of them. The album also charted two other singles on the Billboard Hot 100, \"This Time It's Real\" and \"What Is Hip?\"[3]\n",
         "1974's Back to Oakland spawned another hit, \"Don't Change Horses (in the Middle of a Stream)\", that reached #26 on the Billboard Hot 100, and \"Time Will Tell\", which charted at #69.[4] The funk-jazz classic instrumental \"Squib Cakes\" also came from this album.[10]\n",
         "On Urban Renewal (1974), the band moved more toward funk than soul; however, they continued recording ballads as well. Williams left the band in late 1974, and was replaced as vocalist by Hubert Tubbs. Though the band remained popular, their days of chart radio airplay declined. During the late 1970s they briefly tried recording disco-sounding material.[3]\n",
         "On January 12, 2017, long-time drummer David Garibaldi and bassist Marc Van Wageningen were hit by a train as they walked across tracks before a performance in Oakland.[2] They both survived the accident. According to their manager, Jeremy Westby, they were both “responsive and being treated at a local hospital”.[2] They fully recovered and returned to the active lineup later that year.\n"
      ]
   },
   "Collaborations": {
      "text": [
         "Tower's horn section appeared on a number of other artists' recordings, including Otis Redding, Aaron Neville, Aerosmith, Bonnie Raitt, David Sanborn, Eric Clapton, Elton John, Labelle, Huey Lewis, Little Feat, Heart, Michelle Shocked, Paula Abdul, Santana and Stevie Nicks.[3]\n",
         "The horn section also recorded with bassist Larry Graham's Graham Central Station, Grateful Dead, Carlos Santana, Journey, Elkie Brooks, Cat Stevens (on his Foreigner Suite), Luis Miguel, Linda Lewis, R.A.D. (Rose Ann Dimalanta), Jermaine Jackson, John Lee Hooker, Helen Reddy, Rufus, Rod Stewart, Jefferson Starship, Mickey Hart, Heart, Damn Yankees, Frankie Valli, Spyro Gyra, KMFDM,[11] Lyle Lovett, Poison, Phish (two songs on their album Hoist[12]), Toto, Pharoahe Monch, Brothers Johnson, and Sam The, among many other acts.[2][3]\n",
         "The song \"So Very Hard To Go\" was featured on the soundtracks of the 2002 film City of God,[13] and Will Ferrell's 2008 film Semi-Pro.\n"
      ]
   },
   "Band members": {
      "Current members": {
         "text": [
            "\n"
         ]
      },
      "Past members": {
         "text": [
            "At least 60 musicians have toured or recorded with the band over their 50 year history, including current Saturday Night Live musical director/saxophonist Lenny Pickett, legendary funk bassist Francis \"Rocco\" Prestia, organ master Chester D.Thompson, saxophonists Richard Elliot and Euge Groove, and guitarist Bruce Conte.\n",
            "Victor Conte is Bruce Conte's cousin[14] and was the band's bassist from 1977 until 1979.[14]  He was succeeded by Vito San Filippo.\n",
            "Former lead vocalist Rick Stevens (real name Donald Stevenson) was sentenced to life in prison on three counts of first-degree murder relating to a botched drug deal, crimes committed after leaving the band.[15] Stevens was paroled on July 20, 2012 after 36 years in prison.[15] He died September 5, 2017 at age 77 after a battle with cancer.[16]\n",
            "Bruce Conte joined the band as lead guitar in 1973 and left in 1979. He rejoined TOP in 2006, touring with them for 14 months, before moving to Cebu in the Philippines.[17] In 2012, Bruce announced he was battling leukemia.[17]\n",
            "\n",
            "\n"
         ]
      },
      "Timeline": {}
   },
   "Discography": {
      "Studio albums": {},
      "Live albums": {},
      "Compilations": {},
      "Singles": {},
      "Videos and DVDs": {
         "text": [
            "Note: Over the decades, there have been many televised performances of Tower of Power, several of which can be found on YouTube. In 2011, Time Life released TOP's November 10, 1973 Soul Train performance of \"What is Hip?\" on the CD The Best of Soul Train Live.[23][24]\n"
         ]
      }
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Tower of Power is an American R&B-based horn section and band, originating in Oakland, California, that has been performing since 1968.[1] There have been a number of lead vocalists, the most well-known being Lenny Williams, who fronted the band between early 1973 and late 1974, the period of their greatest commercial success. They have had eight songs on the Billboard Hot 100;[2] their highest-charting songs include \"You're Still a Young Man\", \"So Very Hard to Go\", \"What Is Hip?\", and \"Don't Change Horses (in the Middle of a Stream)\".[3][4]\n",
      "In the summer of 1968, tenor saxophonist/vocalist Emilio Castillo met Stephen \"Doc\" Kupka, who played baritone sax. Castillo had played in several bands, but Castillo's father told his son to \"hire that guy\" after a home audition.[5] Within months the group, then known as The Motowns, began playing various gigs around Oakland and Berkeley, their soul sound relating to both minority and rebellious listeners.[3][6]\n",
      "Castillo wanted to play Bill Graham's Fillmore Auditorium in San Francisco, but he realized he would never get in with a name like The Motowns.[6] The band agreed on Tower of Power and the name stuck.[7]\n",
      "By 1970, the now renamed Tower of Power—now including trumpet/arranger Greg Adams, first trumpet Mic Gillette, first saxophone Skip Mesquite, Francis \"Rocco\" Prestia on bass, Willie Fulton on guitar, and drummer David Garibaldi—signed a recording contract with Bill Graham's San Francisco Records and released their first album, East Bay Grease. Rufus Miller performed most of the lead vocals on this debut album.[3] The group was first introduced to the San Francisco Bay area by radio station KSAN, which played a variety of artists such as Cold Blood, Eric Mercury and Marvin Gaye.\n"
   ],
   "infobox": {
      "Origin": [
         "Oakland, California, U.S."
      ],
      "Genres": [
         "Soul",
         "funk",
         "R&B",
         "jazz",
         "jazz-funk"
      ],
      "Years active": [
         "1968–present"
      ],
      "Labels": [
         "Warner Bros.",
         "Columbia",
         "Epic",
         "San Francisco",
         "Mack Avenue"
      ],
      "Associated acts": [
         "Cold Blood",
         "Sons of Champlin",
         "Santana",
         "Doobie Brothers",
         "Cat Stevens",
         "Lenny Williams"
      ],
      "Website": [
         "www.towerofpower.com"
      ],
      "Members": [
         "Emilio Castillo",
         "Stephen 'Doc' Kupka",
         "David Garibaldi",
         "Roger Smith",
         "Adolfo Acosta",
         "Tom E. Politzer",
         "Jerry Cortez",
         "Sal Cracchiolo",
         "Marc van Wageningen"
      ],
      "Past members": [
         "see past members"
      ]
   }
}