{
   "Discography": {
      "DVDs": {},
      "Demos": {},
      "EPS": {},
      "Reissue": {},
      "Studio albums": {}
   },
   "History": {
      "Breakup": {
         "text": [
            "After an attempt to make a fourth album, and performing what would be their final show for eight years on December 18, 1993 with a new lineup in San Francisco, Vio-lence split up.[9][10][11]\n",
            "Phil Demmel, Deen Dell, Ray Vegas and Mark Hernandez formed a groove/thrash metal band called Torque which disbanded after releasing a studio album and playing several live shows. Demmel then went to form Technocracy.\n",
            "Robb Flynn has been the guitarist and singer of Machine Head since its inception in 1991. Demmel joined Machine Head in 2003, first as a session guitarist and later becoming a full-time member of the band; he would stay in Machine Head until his departure in 2018.[14]\n"
         ]
      },
      "Initial career": {
         "text": [
            "Vio-lence, then-called Death Penalty, was formed in 1985 with the line-up of Jerry Birr (vocals), Phil Demmel (guitar), Troy Fua (guitar), Eddie Billy (bass – brother of musicians Andy and Chuck Billy) and Perry Strickland (drums).[9] Not long after playing their first gig, which reportedly took place at a house party, Death Penalty changed their name to Violence and eventually then to Vio-lence, as the former was taken by another band. After recording two demos in 1986, they parted ways with Birr, Fua and Billy, who were replaced by Sean Killian, Robb Flynn (formerly of Forbidden Evil) and Deen Dell respectively. Their live success at local clubs in Northern California – opening for bands like D.R.I., Voivod, Kreator, Dark Angel, Suicidal Tendencies and the Mentors, as well as their Bay Area thrash metal peers Testament, Exodus, Death Angel, Lȧȧz Rockit and Heathen – allowed Vio-lence to record another demo, this time for major labels, including MCA Records' sister label Mechanic, who offered them a recording contract.[9][10][11]\n",
            "From February to April 1988, Vio-lence recorded their debut album, Eternal Nightmare, at two studios: The Music Grinder in Los Angeles and Alpha & Omega in San Francisco. The album received mostly positive reviews upon its release in the summer of 1988, and peaked at number 154 on the Billboard 200, becoming the band's only album to enter that chart;[12][13] this can be attributed to the album selling over 30,000 copies.[9] Vio-lence toured throughout 1988 and 1989 in support of Eternal Nightmare, with bands such as Testament, Voivod, Death Angel, Sanctuary, Nuclear Assault, D.R.I., M.O.D. and the Cro-Mags.[9][10][11] The underground success of the album also caught the attention of several labels, including Megaforce Records (then-home to bands such as Testament, M.O.D., Anthrax, and Overkill), who eventually signed the band.[9][10]\n",
            "In December 1989, Vio-lence entered the studio to record what would be their second album and only release on Megaforce (distributed by Atlantic) Oppressing the Masses; however, the album faced multiple delays until its release in the summer of 1990.[9][10][11] Although the album's success did not match that of Eternal Nightmare, it received some positive reviews and a video for the song \"World in a World\" was released. Oppressing the Masses also generated some controversy, when the original album (which reportedly sold only 20,000 copies) was destroyed because of Atlantic's objection to the lyrical content of \"Torture Tactics\";[9][10] as a result, the album was reprinted without this track. Vio-lence toured in support of the album for about a year, with bands such as Overkill, Exodus, Forbidden, Flotsam and Jetsam, Prong, Defiance and Rigor Mortis.[11]\n",
            "In 1991, after being dropped from Atlantic/Megaforce, Vio-lence released an EP Torture Tactics, which included three studio songs (recorded in 1989 during the sessions of Oppressing the Masses) and one \"live\" track from 1988. Internal conflicts in 1992 resulted in the departure of Robb Flynn who would move on to form groove metal band Machine Head.[9] A year later, Vio-lence released their third and final album, Nothing to Gain, which was actually recorded in 1990. They never toured in support of that album, and Strickland left the band after its release.[9]\n"
         ]
      },
      "Reunion": {
         "text": [
            "Initially planning only a few shows as part of the tribute to Testament frontman Chuck Billy during the Thrash of the Titans benefit in 2001, the band decided to reunite with early guitarist Ray Vegas replacing Robb Flynn.\n",
            "In addition to their 2005 re-release of Eternal Nightmare, the band released a 7-inch vinyl record containing two demo tracks from their original 1986 demo tape as well as one previously unreleased track. Only 1000 copies were produced and pressed by Bone Crusher Records.  The 7 inch collectible was well marketed and advertised, but due to disagreements between the band and the Bone Crusher record producers, only Vio-lence was allowed to distribute and sell the 500 given to them by the producers. A deal was made to distribute a small quantity (about 100) through a Seattle record store, the only known store to stock the item for sale to the public.\n",
            "A DVD entitled Blood And Dirt was produced by Jerry Allen (Tales From The Pit video magazine) and released on August 8, 2006 through Megaforce.\n",
            "On November 6, 2017, it was announced that the members of Vio-Lence would reunite for a performance at \"Killian on Command: An Evening of Vio-Lence\", a benefit for the band's singer Sean Killian, who was diagnosed with stage four liver cirrhosis earlier that summer.[6] The benefit took place at The Midway in San Francisco, California on January 20, 2018, and included performances by the members of Vio-Lence and their Bay Area thrash metal peers Testament, Exodus, Death Angel, Forbidden and Mordred.[6][15] The show concluded with a performance of \"World in a World\" featuring four-fifths of the Eternal Nightmare and Oppressing the Masses lineup; vocals were provided by Flynn instead of Killian, who did not perform due to his health condition.[16] On November 11, 2018, Killian's wife Dana posted a photo on her personal Facebook page, cryptically confirming that her husband has recovered from his illness.[17]\n",
            "The possibility of a Vio-lence reunion was renewed in September 2018 when Flynn announced that guitarist Phil Demmel was leaving Machine Head after a farewell tour with then-current lineup of Flynn, Demmel, Jared MacEachern and Dave McClain;[14] at first it was speculated that Machine Head was actually breaking up, but Flynn announced shortly thereafter that he was going to continue the band with a new lineup.[18]\n",
            "Musical outlets reported in November 2018 that, following Demmel's departure from Machine Head, there were rumors Vio-lence would reform \"in the not-too-distant future\" for shows and possibly new music.[19][20]\n",
            "On January 8, 2019, it was announced that Vio-lence would reunite for a performance on April 13 at the Metro in Oakland to perform their debut album, Eternal Nightmare, in its entirety.[7] The show intended as a one-off sold out shortly after its announcement, resulting in a matinee appearance at the Metro, which took place on the following day.[21][22]\n",
            "On February 16, 2019, it was announced that Vio-lence would play their first European show at the Alcatraz Metal Fest in Kortrijk, Belgium that August.[8] In addition to their first live appearance in Los Angeles in over a decade on May 31, 2019 at The Regent with Sacred Reich, Excel and Sworn Enemy,[23] they played their first shows in New York in nearly 30 years at the Brooklyn Bazaar on November 8–9.[24] The band also will reportedly play shows with their Bay Area thrash metal peers Testament and Death Angel, and has continued their reunion with more shows into 2020.[25]\n",
            "On August 9, 2019, Bloodstock Open Air announced that Vio-lence would be playing their first ever and only UK show at the festival in 2020.[26]\n",
            "The members of Vio-lence have expressed their desire to write the follow-up to 1993's Nothing to Gain. In an August 2019 interview with Australia's Heavy magazine, Demmel said, \"Sean's itching to write some new music. I'm not itching as hard. I've got a lot on my plate. Vio-lence is definitely a priority, but that's just a step I haven't... It's hard, because you have this comeback, and then you play the songs, and you want to be good. I don't want to put out something that isn't as good as Eternal Nightmare or some of the songs from Oppressing. I want to have something that's quality.\"[27] In an interview with Exodus frontman Steve \"Zetro\" Souza on his \"Toxic Vault\" video channel, Killian stated, \"Phil and I have talked a couple of times. It's kind of up to him because he is very busy doing a soundtrack for a video game and I guess a Netflix series, and he's doing Allegiance and these other things he's doing.\" Killian also said that the other members of Vio-lence are interested in writing a new album; however, he concluded that \"it's Phil and I that need to connect.\"[28]\n",
            "In January 2020, Ray Vegas announced that he had left Vio-lence and was replaced by former Overkill guitarist Bobby Gustafson.[29] Longtime bassist Deen Dell left the band shortly thereafter and was replaced by former Fear Factory bassist Christian Olde Wolbers.[30][31] In March 2020, it was announced that Vio-lence had signed to Metal Blade Records and the band was going to record a new EP in the coming months.[32] On August 20, 2020, Vio-lence released their first song in over 25 years, which was a cover of Dead Kennedys' \"California über alles\".[33]\n",
            "Vio-lence will promote their new EP by headlining the 2021 installment of the MTV Headbangers Ball tour in Europe, with support from Voivod, Exciter and Artillery.[34]\n"
         ]
      }
   },
   "Members": {
      "Timeline": {},
      "text": [
         "Current members\n",
         "\n",
         "Former members\n",
         "\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Initial career",
      "1.2 Breakup",
      "1.3 Reunion",
      "2 Members",
      "2.1 Timeline",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 EPS",
      "3.3 Demos",
      "3.4 Reissue",
      "3.5 DVDs",
      "4 References"
   ],
   "Summary": {
      "text": [
         "Vio-lence is an American thrash metal band formed in 1985 in the San Francisco Bay Area. Throughout its existence, they released demo tapes, one EP and three studio albums. Vio-lence is best-known for their association with the 1980s Bay Area thrash metal scene, and often credited as one of the leading lights of the second wave of the genre, along with Pantera, Sepultura, Sacred Reich, Dark Angel, Annihilator and Flotsam and Jetsam as well as their Bay Area counterparts Testament, Death Angel and Forbidden.[1][2][3][4][5] Their most stable line-up was Phil Demmel and Robb Flynn on guitars, Deen Dell on bass, Perry Strickland on drums and Sean Killian on vocals; this lineup recorded all their studio albums. After breaking up in 1994 and reforming for occasional live performances from 2001 to 2003, the members of Vio-Lence reunited in January 2018 for a benefit of Killian, who was battling with liver cirrhosis.[6] The band announced their third reunion in January 2019.[7][8]\n"
      ]
   },
   "Title": "Vio-lence - Wikipedia"
}