{
   "Name": "Vio-lence",
   "rawData": [
      "Vio-lence is an American thrash metal band formed in 1985 in the San Francisco Bay Area. Throughout its existence, they released demo tapes, one EP and three studio albums. Vio-lence is best-known for their association with the 1980s Bay Area thrash metal scene, and often credited as one of the leading lights of the second wave of the genre, along with Pantera, Sepultura, Sacred Reich, Dark Angel, Annihilator and Flotsam and Jetsam as well as their Bay Area counterparts Testament, Death Angel and Forbidden. Their most stable line-up was Phil Demmel and Robb Flynn on guitars, Deen Dell on bass, Perry Strickland on drums and Sean Killian on vocals; this lineup recorded all their studio albums. After breaking up in 1994 and reforming for occasional live performances from 2001 to 2003, the members of Vio-Lence reunited in January 2018 for a benefit of Killian, who was battling with liver cirrhosis. The band announced their third reunion in January 2019.\n",
      "Vio-lence, then-called Death Penalty, was formed in 1985 with the line-up of Jerry Birr (vocals), Phil Demmel (guitar), Troy Fua (guitar), Eddie Billy (bass – brother of musicians Andy and Chuck Billy) and Perry Strickland (drums). Not long after playing their first gig, which reportedly took place at a house party, Death Penalty changed their name to Violence and eventually then to Vio-lence, as the former was taken by another band. After recording two demos in 1986, they parted ways with Birr, Fua and Billy, who were replaced by Sean Killian, Robb Flynn (formerly of Forbidden Evil) and Deen Dell respectively. Their live success at local clubs in Northern California – opening for bands like D.R.I., Voivod, Kreator, Dark Angel, Suicidal Tendencies and the Mentors, as well as their Bay Area thrash metal peers Testament, Exodus, Death Angel, Lȧȧz Rockit and Heathen – allowed Vio-lence to record another demo, this time for major labels, including MCA Records' sister label Mechanic, who offered them a recording contract.\n",
      "From February to April 1988, Vio-lence recorded their debut album, Eternal Nightmare, at two studios: The Music Grinder in Los Angeles and Alpha & Omega in San Francisco. The album received mostly positive reviews upon its release in the summer of 1988, and peaked at number 154 on the Billboard 200, becoming the band's only album to enter that chart; this can be attributed to the album selling over 30,000 copies. Vio-lence toured throughout 1988 and 1989 in support of Eternal Nightmare, with bands such as Testament, Voivod, Death Angel, Sanctuary, Nuclear Assault, D.R.I., M.O.D. and the Cro-Mags. The underground success of the album also caught the attention of several labels, including Megaforce Records (then-home to bands such as Testament, M.O.D., Anthrax, and Overkill), who eventually signed the band.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco Bay Area, U.S."
      ],
      "Genres": [
         "Thrash metal"
      ],
      "Years active": [
         "1985–1994",
         "2001–2003",
         "2018",
         "2019–present"
      ],
      "Labels": [
         "MCA",
         "Megaforce",
         "Atlantic",
         "Metal Blade"
      ],
      "Associated acts": [
         "Machine Head",
         "Forbidden",
         "BPMD",
         "Torque",
         "Overkill"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Phil Demmel",
         "Perry Strickland",
         "Sean Killian",
         "Bobby Gustafson",
         "Christian Olde Wolbers"
      ],
      "Past members": [
         "Eddie Billy",
         "Troy Fua",
         "Jerry Birr",
         "Robb Flynn",
         "Mark Hernandez",
         "Steve Schmidt",
         "Ray Vegas",
         "Deen Dell"
      ]
   },
   "albums": [
      "Eternal Nightmare",
      "Oppressing the Masses",
      "Nothing to Gain"
   ]
}