{
   "Name": "Vitamin Party",
   "rawData": [
      "Vitamin Party is an American, San Francisco/Bay Area \"DIY\" rock-punk band, which formed in 2004.  Their style shows influences of lo-fi, indie, post-modern punk with straight forward rock and roll.  The band has released an EP and three albums on their own record label Get It Out! Records.\n",
      "Vitamin Party formed in the San Francisco Bay Area, United States, in 2004 after the dissolving of the bands City Volume and We're Gonna Fight The Eskimos Next.  The band wrote and rehearsed for a full year before recording their first EP Get It Out in late 2005 and playing their first show at a San Francisco house party.\nThe band soon began playing local venues such as Stork Club, Blakes On Telegraph, The Independent and the Red Devil Lounge with other local acts such as Ex-boyfriends, Hottub, Wallpaper, Hundred Days, The Hot Toddies and Bwuh.\n",
      "In 2008 they released two albums, both of which were recorded by Collisionville's Stephen Pride and mastered by Guitar Vs. Gravity's Ben Adrian.  The first album, The Revenge, was released in February and the second album, titled Back On Task, on October 31.  Both albums were released on Get It Out! Records.  All album art was created by the band with the help of photographer Kirsten Lindquist Campana.\n"
   ],
   "infobox": {},
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band, which formed in [YEAR].  Their style shows influences of lo-fi, indie, post-modern punk with straight forward rock and roll.  The band has released an EP and three albums on their own record label Get It Out! Records.\n",
      "[BAND_NAME] formed in the San Francisco Bay Area, United States, in [YEAR] after the dissolving of the bands City Volume and We're Gonna Fight The Eskimos Next.  The band wrote and rehearsed for a full year before recording their first EP Get It Out in late [YEAR] and playing their first show at a San Francisco house party.\nThe band soon began playing local venues such as Stork Club, Blakes On Telegraph, The Independent and the Red Devil Lounge with other local acts such as Ex-boyfriends, Hottub, Wallpaper, Hundred Days, The Hot Toddies and Bwuh.\n",
      "In [YEAR] they released two albums, both of which were recorded by Collisionville's Stephen Pride and mastered by Guitar Vs. Gravity's Ben Adrian.  The first album, The Revenge, was released in [MONTH] and the second album, titled Back On Task, on [MONTH] 31.  Both albums were released on Get It Out! Records.  All album art was created by the band with the help of photographer [PERSON_NAME_FULL_0_FEMALE].\n"
   ]
}