{
   "Band members": {
      "Timeline": {},
      "text": [
         "\n",
         "\n"
      ]
   },
   "Biography": {
      "Commercial success and hiatus (1984–1991)": {
         "text": [
            "Y&T's sixth studio album, In Rock We Trust, released in 1984, became the band's highest-charting and selling album, reaching No. 46 on the Billboard 200. The album produced Y&T's first big radio hit \"Don't Stop Runnin'\". Dr Pepper acquired to rights to use \"She's A Liar\" in a radio ad campaign. To date, In Rock We Trust has sold over 450,000 copies.  This album was the only Y&T album to chart in Canada, reaching No. 77 on the RPM chart.\n",
            "The band's 1985 hit \"Summertime Girls\", off their album Down for the Count, became the band's highest-charting hit to date, reaching No. 55 on the Billboard Hot 100 and No. 16 on the Mainstream Rock songs chart.[2]  It received tremendous airplay worldwide, played frequently in the Baywatch television series, featured in several feature films (including Real Genius), received heavy rotation on MTV as well as MTV's top video playlists, and gets regular airplay today on classic rock radio stations throughout the United States.\n",
            "In 1986, Haze was fired for drug abuse issues (as Haze, band, and management discuss in the documentary \"Y&T: On With the Show\"), and was replaced by Jimmy DeGrasso; decades later when interviewed for the documentary \"Y&T: On With the Show\", Haze said, \"I would've fired me too.\" In 1989, Alves was also fired for drug abuse and was replaced by Stef Burns. DeGrasso and Burns later played together with Alice Cooper in the 1990s.\n",
            "Y&T's studio album Ten was released in 1990. The album features ballads such as \"Don't Be Afraid of the Dark\", \"Ten Lovers\", and \"Come in from the Rain\", together with a few straightforward hard rock songs, including \"Hard Times\", \"City\", \"Surrender\", and the fastest track Y&T ever recorded, \"Goin' Off the Deep End\".[citation needed]\n",
            "The band decided to discontinue in 1991, concluding with the live album Yesterday & Today Live.\n"
         ]
      },
      "Early years (1974–1983)": {
         "text": [
            "Leonard Haze, Bob Gardner, and Wayne Stitzer had an unnamed band in Oakland, California that jammed only cover tunes. Dave Meniketti joined as guitar player in 1972. Soon after, the band received a call for their first gig, but they needed a name. According to Meniketti and Haze, Haze chose the name of the album that was playing on his turntable at that moment – Yesterday and Today – a studio album by the Beatles. The first lineup – which only played covers of songs by other artists – consisted of Haze on drums, Stitzer on piano, Gardner on bass, and Meniketti on lead vocals and lead guitar. After Stitzer quit the group, Gardner switched from bass to rhythm guitar and piano, and Phil Kennemore was brought in to play bass. In 1973, Gardner left the group and was replaced by Joey Alves in January 1974. It was this 1974 lineup change when the band began writing original material.\n",
            "The band released their first two studio albums, their self-titled debut and Struck Down, through London Records in 1976 and 1978 respectively. They toured extensively, building up to headliners while they opened for bands such as Wild Cherry, AC/DC, and Kiss. As Meniketti has said in numerous radio, television, and magazine interviews over the past four decades, a new record deal in 1980 with A&M Records prompted the band to shorten their moniker to simply Y&T, as influenced by their encores where fans would chant \"Y&T, Y&T, Y&T.\"\n",
            "The band's first three studio albums under A&M, Earthshaker, released in 1981, Black Tiger, released in 1982, and Mean Streak, released in 1983, did not gain mainstream exposure, but are regarded by fans and music critics alike as some of the band's best work. Songs off these three albums still make up an important part of the band's live shows.[citation needed]\n"
         ]
      },
      "Hiatus 1991-1995; Continuation (1995–present)": {
         "text": [
            "In 1995, Y&T returned with the same lineup of Meniketti, Burns, Kennemore, and DeGrasso, releasing Musically Incorrect in 1995 and Endangered Species in 1997. The band performed sporadically during the mid to late 1990s. Y&T officially reunited in 2001 with virtually the same lineup, but with Haze returning on drums. At the time, Burns was in three bands: Y&T, Huey Lewis and the News, and Italy's biggest rock star, Vasco Rossi; scheduling conflicts forced Burns to drop one of the three bands, and so in 2003, he left Y&T.  He was replaced by rhythm guitarist/backing vocalist John Nymann, who was a childhood friend of the band, and who previously toured on the In Rock We Trust tour as a background vocalist and Rock the Robot, and he sang backing vocals on Down for the Count.\n",
            "Y&T resumed touring the world in 2003. In 2006, Haze was asked to step down and was replaced by Mike Vanderhule on drums.\n",
            "In 2009, Y&T inked a deal with the Italian label Frontiers Records for the release of the band's twelfth studio album, released in May 2010.[3][4][5] Titled Facemelter;[6] it was their first proper studio album in thirteen years (since 1997's Endangered Species).\n",
            "In June 2010, Y&T toured the world in support of Facemelter, performing the big European summer festivals, such as Sweden Rock, Download Festival at Donington Park, UK, and Hellfest in Clisson, France. During this world tour, bassist Kennemore was diagnosed with stage IV lung cancer. Upon receiving doctor's orders to leave the tour and begin treatment, Kennemore urged Meniketti to find a replacement and continue touring.\n",
            "In July 2010, Brad Lang, bass player from the band Jet Red, stepped in to play live for the band as they promoted 'Facemelter', as Kennemore wanted the tour to carry on during his fight with cancer. On January 7, 2011, bassist Kennemore died at the age of 57 after a short battle with lung cancer.  Kennemore and Meniketti had been the only constant members of the band since it formed in 1974.  After Kennemore's passing, Lang was asked to become an official member of the band.\n",
            "On October 19, 2013, in Bellagio, Italy, Burns joined the band onstage for four songs (Black Tiger, Dirty Girl, Midnight In Tokyo, and Hurricane) in a reunion of sorts since Burns had been playing with Huey Lewis and the News and Vasco Rossi. This one-time reunion was very well received by the fans, as one would expect.[7]\n",
            "In April 2016, Lang left the band to properly address his alcohol dependency; his last show with the band was on April 2, 2016 at the Fillmore in San Francisco.[8] Lang's friend Aaron Leigh (Frank Hannon Band) stepped in with his first show on April 14 at the Canyon Club in Agoura Hills, CA. On June 29, 2016, Y&T and Lang announced separately on their own Facebook feeds that they had mutually and amicably parted ways, confirming that Leigh would remain as the band's bassist.\n",
            "Songwriter and original drummer Haze died on September 11, 2016, at the age of 61 after a long battle with chronic obstructive pulmonary disease.[9][10][11] Original guitarist Alves died on March 12, 2017, at the age of 63 from ulcerative colitis and inflammatory bowel disease.[12][13]  Alves' death left Meniketti as the last surviving member from the band's original and classic 1974-1986 lineup.\n",
            "In January 2018, Y&T released their first-ever acoustic EP titled Acoustic Classix Vol. 1.[14] In June 2018, Meinketti said that the band might release more acoustic EPs in the future.[15]\n",
            "On June 25, 2019, The New York Times Magazine listed Y&T among hundreds of artists whose material was reportedly destroyed in the 2008 Universal fire.[16]\n",
            "On November 26, 2019, the long-awaited, fan-backed (on Kickstarter) documentary \"Y&T: On With the Show\" was released.\n"
         ]
      },
      "Legacy": {
         "text": [
            "\"Summertime Girls\" has been the band's most widely recognized song, along with fan favorites such as \"Mean Streak\", \"Contagious\", \"Rescue Me\", \"Forever\". \n",
            "Music videos for songs such as \"Summertime Girls\", \"Mean Streak\", \"Lipstick & Leather\", \"Don't Stop Runnin'\", \"Don't Be Afraid of the Dark\", and \"Contagious\" are still featured on VH1 Classic. \n",
            "Y&T's 2010 music video for \"I'm Coming Home\" marks the band's most-viewed video on YouTube with over 1.7 million views.  \n",
            "In the movie Anvil! The Story of Anvil, in the bonus feature interview Lars Ulrich of Metallica talks at length about seeing one of his favorite bands Y&T for the first time at a club in Hollywood in December 1980. Lars Ulrich credits Y&T as the reason he decided to become a musician, saying: \"That was the turning point for me wanting to play music. . . . You could tell that they loved what they were doing.\"[17]\n"
         ]
      }
   },
   "Discography": {
      "Compilation albums": {},
      "Contributions": {},
      "Live albums": {},
      "Singles": {},
      "Studio albums": {}
   },
   "External links": {},
   "References": {},
   "Sections": [
      "1 Biography",
      "1.1 Early years (1974–1983)",
      "1.2 Commercial success and hiatus (1984–1991)",
      "1.3 Hiatus 1991-1995; Continuation (1995–present)",
      "1.4 Legacy",
      "2 Band members",
      "2.1 Timeline",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Live albums",
      "3.3 Compilation albums",
      "3.4 Singles",
      "3.5 Contributions",
      "4 Videography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Y&T (originally known as Yesterday & Today) is an American hard rock/heavy metal band formed in 1974 in Oakland, California.[1] The band released two studio albums on London Records as Yesterday & Today in the 1970s, before shortening their name to Y&T and releasing several albums on A&M Records beginning in 1981, plus albums on Geffen Records, Avex Records, and others. The band was originally co-managed by Herbie Herbert (who also managed Journey) and Louis \"Lou\" Bramy. The band has sold over 4 million albums worldwide to date.\n"
      ]
   },
   "Title": "Y&T - Wikipedia",
   "Videography": {}
}