{
   "Name": "Count Five",
   "rawData": [
      "Count Five was an American garage rock band, formed in San Jose, California in 1964, best known for their hit single \"Psychotic Reaction\".\n",
      "The band was founded in 1964 by John \"Mouse\" Michalski (born 1948, Cleveland, Ohio) playing lead guitar and Roy Chaney (born 1948, Indianapolis, Indiana) playing bass guitar. The two were high school friends who had previously played in several short-lived bands, most notably a surf rock group named The Citations. As the British Invasion's influence took effect, the band changed in musical direction. After going by the name The Squires for a short time, along with several line-up changes, the Count Five was born. John \"Sean\" Byrne (1947–2008, born Dublin, Ireland) played rhythm guitar and performed lead vocals, Kenn Ellner played tambourine and harmonica, while sharing lead vocals, and Craig \"Butch\" Atkinson (1947–1998, born San Jose, California) played drums. The Count Five were recognizable for their habit of wearing Count Dracula-style capes when playing live.\n",
      "\"Psychotic Reaction\", an acknowledged cornerstone of garage rock, was initially devised by Byrne, with the group refining it and turning it into the highlight of their live sets. The song was influenced by the style of contemporary musicians such as The Standells and The Yardbirds. The band was rejected by several record labels before they got signed to the Los Angeles-based Double Shot Records. \"Psychotic Reaction\" was released as a single, peaking at number five in the U.S. charts in late 1966. The band enjoyed limited success for a short time, dropping out of view altogether when their only hit had fallen from public memory. Another setback to a potential career in the music business was the decision of four of the five members (who at that time were between the ages of 17 and 22) to pursue college degrees. Several months before the retirement of the band, David Eugene McDowell, the youngest player at 17 hooked up with the group as a guitar player for their last several months as a band. \"Dave\" shortly later went on to join up with Billy Nix and the Ideals as their Bass player.  \n"
   ],
   "infobox": {
      "Origin": [
         "San Jose, California, U.S."
      ],
      "Genres": [
         "Garage rock[1]",
         "psychedelic rock[1]",
         "acid rock[2]"
      ],
      "Years active": [
         "1964 (1964)–1969 (1969)"
      ],
      "Labels": [
         "Double Shot"
      ],
      "Associated acts": [
         "The Count"
      ],
      "Past members": [
         "Craig \"Butch\" Atkinson",
         "John \"Sean\" Byrne",
         "Roy Chaney",
         "Kenn Ellner",
         "John \"Mouse\" Michalski"
      ]
   },
   "albums": [
      "Psychotic Reaction"
   ]
}