{
   "Discography": {},
   "External links": {},
   "History": {
      "Catch Without Arms (2005–2006)": {
         "text": [
            "While touring in support of El Cielo, Dredg began work on their third album, Catch Without Arms, spending 8 months writing material before taking another 10 months to record and mix the album.[5] Like their previous albums, Catch Without Arms was a concept album; however, differing from the concrete stories and events surrounding their earlier releases, Catch Without Arms was about opposites, mainly focused on positives and negatives.[14] Produced by Terry Date, Catch Without Arms was Dredg's most successful album, debuting at 124 on the Billboard album charts and eventually reaching the top of the Heatseekers chart.[17][18] The only single on the album, \"Bug Eyes\", was made into a music video directed by Philip Andelman.[14]\n",
            "With the release of Catch Without Arms, Dredg began a treasure hunt based around the Bay Area. The three winners each received a painting from Catch Without Arms, as well as the opportunity to name a song for the next album, \"Vague Clues and Long Days\".[19][20]\n",
            "Dredg headlined several tours in support of Catch Without Arms, playing with bands such as Circa Survive, Day One Symphony, Delta Activity, Vedera, Ours and Ambulette. They played the Taste of Chaos tour in 2006 with Deftones, Atreyu, Thrice and Story of the Year,[21] as well as shows with Coheed and Cambria, the Blood Brothers and MewithoutYou.[9] Engles and Campanella also took some time to record the soundtrack for the 2005 independent film, Waterborne.[14]\n",
            "On May 11, 2006, Dredg recorded their concert in San Francisco for a live CD entitled Live at the Fillmore. Released on November 7, 2006, Live at the Fillmore contained songs from all three studio albums, as well as a new song titled \"The Warbler\". A remix of \"Sang Real\" by Dan the Automator was released with purchase of the album on iTunes.\n",
            "On September 14 and 15, 2006, Dredg played two special shows at the Catalyst in Santa Cruz, California, playing Leitmotif and El Cielo in their entirety on separate nights. During these shows the band played songs from Catch Without Arms before diving into the full album of the night.[22] Of note, each night they played a very early version of \"It's Not Worth It\" (a song that did not make it into the final album) at about the midpoint of each album. On the second night, as a segue into El Cielo, they performed an early instrumental version of \"Wonderous Miracle\" (another song that did not make it into the final album).\n"
         ]
      },
      "Chuckles and Mr. Squeezy (2010–2014)": {
         "text": [
            "Dredg suggested on their Twitter account that they began recording their fifth album on June 23, 2010.[1]\n",
            "On August 17, 2010, Dredg announced via their official website that they had begun the process of recording a new album. Unlike the long gaps between their last two efforts, the band expected an early 2011 release. The announcement was posted in the news section and reads as follows: \"Yesterday, we began working on our fifth record with musician/producer Dan the Automator. We will be writing and recording it in San Francisco for the next month and a half and are hoping for an early 2011 release. Stay tuned as there will be more updates and studio footage in the coming months.\"\n",
            "On February 18, 2011, Dredg announced via Twitter that their fifth studio album, Chuckles and Mr. Squeezy, was to be released on May 3, 2011 in the United States and April 29 everywhere else.\n",
            "On February 2014, Dredg released a non-album track, \"I Left My Heart In San Francisco\", in conjunction with a stop-motion music video touring the city.[24]  Touring in support of the album took place from 2011, until May 2014.[25]\n"
         ]
      },
      "Early years (1993–1997)": {
         "text": [
            "While attending middle school in Los Gatos, Engles and Campanella started playing together. After Engles and Campanella graduated to Los Gatos High School, older friends Hayes and Roulette joined the group.[3][4]\n",
            "In a 2005 interview, when asked about the origin of the band's name Campanella said, \"It was so long ago that we named it I can't even remember. Honestly, we don't even like the name anymore. We mostly don't like the way it sounds. It doesn't roll off the tongue well.\"[5]\n",
            "In 1996, Dredg recorded and released their first demos of original material, the Conscious EP, garnering them exposure as far away as Boston.[3] Currently, very little information has ever been released about these demos. In 1997, they released what would become the early stages of their musical transition, the Orph EP. It includes the group's first instrumental track, \"Orph\". Additionally, the track \"Kayasuma\" shares its title with the name of the shaman in Leitmotif's liner notes for \"Lechium\".[6] With the release, Dredg slowly built a name for themselves in the Bay Area, as well as on the East Coast, such as in Boston and New York.[3]\n"
         ]
      },
      "El Cielo (2002–2004)": {
         "text": [
            "After signing to Interscope Records, the band began work on their major label debut, El Cielo. Like its predecessor, El Cielo was a concept album. Initially intended to revolve around Salvador Dalí's Dream Caused by the Flight of a Bumblebee around a Pomegranate One Second Before Awakening, the band expanded the focus to include sleep paralysis after learning of Dalí's own influences.[12] As they had done with the liner notes of Leitmotif, Dredg chose not to include the lyrics; instead, they printed letters sent to them by people suffering from sleep paralysis. Several songs on the album even included lyrics taken directly from the letters.[13]\n",
            "When the band began writing material for the new album, they secluded themselves in the deserts around Palm Desert.[4] The majority of the album was recorded at Skywalker Ranch.[14] The band used three producers, Ron Saint Germain, Tim Palmer and Jim Scott, on the record, adding another layer of diversity to the album.[11] Completed in May 2002, the album was widely available on the internet before being released on October 8, 2002.[15] Dredg made music videos for two of the album's tracks, \"Same Ol' Road\" and \"Of The Room\".\n",
            "Upon releasing the album, the band once again returned to their hectic touring schedule, including their first national headline tour with Codeseven, a then-unsigned Strata and either STUN or Woven supporting. They also toured with acts such as Ozomatli, Deftones, Chevelle, Hoobastank and Phantom Planet, as well as earning a spot on the Sno-Core Tour with Sparta, Glassjaw and Hot Water Music.[9][16]\n"
         ]
      },
      "Exit from Interscope and The Pariah, the Parrot, the Delusion (2007–2009)": {
         "text": [
            "On February 14, 2007, Dredg issued an update indicating production had begun on their next album and released several new song titles as part of the update. Gavin Hayes posted a Myspace blog on July 8, 2007, with new information that the band had 12-15 songs that might or might not make the final cut. Of the songs previously written, only a few were being worked on from prior updates. Hayes stated that on December 21, 2007, the writing process for their new album was almost done, and they planned to enter the studio in early 2008 to start recording. This would be followed by extensive touring in the spring.[23] The songs that were played at live shows during the writing process but were not released on the album include: \"Wondrous Miracle\", \"It's Not Worth It\", \"Push Away\", \"Holding a Remedy Potion\", \"Hurricane Felix\", \"Pieces of Gold\", \"Fleeing to Mexico\", \"2001\", \"MacGuffin\" and \"Fucking Smile Pt. 2\".\n",
            "The band played at the Coachella Valley Music and Arts Festival in California on April 26, 2008, during their tour to introduce the new tracks to their fans, with the exception of a few past hits and some tracks already performed such as \"Long Days and Vague Clues\". After Coachella, Dredg released demos for songs rumored to be on their upcoming album up to February 2009. They also added a song entitled \"entire new album\", which was a track consisting of every song played simultaneously. Also on February 23, 2009, Dredg announced their exit from Interscope Records as well their new record's title, The Pariah, the Parrot, the Delusion. They confirmed joining with Independent Label Group (ILG, which is a part of Warner Music Group), and Ohlone Recordings. The album was released on June 9, 2009, with a Limited Edition release with alternate artwork (as well as a Vinyl recording) made available to the public. Music videos have been made for \"Information\" and \"I Don't Know\".\n",
            "The album was inspired by the essay \"Imagine There Is No Heaven: A Letter to the Six Billionth Citizen\". The essay was written by British-Indian novelist Salman Rushdie, who found controversy in 1988 over one of his books gaining him a religious fatwa for Rushdie's death from Ayatollah Ruhollah Khomeini which ultimately resulted in United Kingdom and Iran breaking diplomatic ties to each other a year later. In consideration of the essay, the album has common themes in agnosticism and the questioning of beliefs and society. Album and liner notes artwork resembled an Air Mail letter (addressed to \"SEVEN BILLIONTH\") and was done by Rohner Segnitz of the band Division Day. Segue tracks on the album are called \"Stamps of Origin\", and unlike prior albums a few of these segue tracks contain lyrics.\n"
         ]
      },
      "Hiatus and Side Projects (2014-2017)": {
         "text": [
            "After the release of Chuckles and Mr. Squeezy, Dino Campanella has stated in an interview in 2014 that Dredg is taking an indefinite hiatus:[26]\n",
            "\"We didn’t want to be on a constant schedule of Dredg. We wanted to go out there and do things on our own, explore other things for a second. It was necessary to maintain our health individually and as a band. In a situation like this a lot of bands jump to conclusions and decide to break up, but we never had any intentions of breaking up. We love each other, love playing music together and we will as long as we want to, but at some point we felt we wanted to be in control of our own schedule. It was a very natural thing. We felt that’s what needed to happen.\"[26]",
            "Mark Engles has joined the band Black Map during the hiatus.[27]\n",
            "\"Yeah, I think now we're writing throughout the end of the year and probably all the way till spring, where we'll release it next summer or next fall, but we'll maybe start touring spring next year.\""
         ]
      },
      "Leitmotif (1998–2001)": {
         "text": [
            "In May 1998, Dredg independently released their first full-length, Leitmotif, a concept album about a man traveling the world to cure his moral disease.[7] The story was included in the liner notes, in lieu of the actual lyrics. Written by Roulette, the band had planned to release a movie of the story;[7] however, upon the death of the lead actor, the project was scrapped.[8]\n",
            "Over the next two years, Dredg toured mostly within California,[9] slowly expanding their fan base. The band began sending out a demo tape to several labels with four new songs intended for their next album, \"Of the Room\", \"Redrawing the Island Map\", \"Running Through Propellers\" and \"The Papal Insignia\".[10] In February 2001, Dredg was offered a deal by Interscope Records.[11] As part of the deal, Leitmotif was re-released by Interscope on September 11, 2001.\n",
            "With the re-release of Leitmotif, Dredg toured nationally and internationally in support of the record with bands such as Alien Ant Farm, Pressure 4-5, the Apex Theory, Taproot, Deadsy and Onesidezero.[9]\n"
         ]
      },
      "Return (2018-2019)": {
         "text": [
            "On January 27th, 2018, it was announced that the band is working on their first release since Chuckles And Mr. Squeezy.[28][29]\n"
         ]
      }
   },
   "Members": {},
   "Musical style": {
      "text": [
         "Dredg's early music in 1990s is rooted in alternative metal and nu metal styles.[30][31] Nevertheless, the band eschewed the nu metal style of the early EPs in favor of a progressive rock and art rock sound.[32][33][34] The band was also labeled as alternative rock[35] and experimental rock.[36]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Early years (1993–1997)",
      "1.2 Leitmotif (1998–2001)",
      "1.3 El Cielo (2002–2004)",
      "1.4 Catch Without Arms (2005–2006)",
      "1.5 Exit from Interscope and The Pariah, the Parrot, the Delusion (2007–2009)",
      "1.6 Chuckles and Mr. Squeezy (2010–2014)",
      "1.7 Hiatus and Side Projects (2014-2017)",
      "1.8 Return (2018-2019)",
      "2 Musical style",
      "3 Members",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Dredg (stylized as dredg) is an American rock band formed in 1993 in Los Gatos, California. The band consists of vocalist Gavin Hayes, guitarist Mark Engles, bassist Drew Roulette and drummer and pianist Dino Campanella.[1]\n",
         "The band established themselves in the indie scene with their 1998 release of the concept album Leitmotif, which landed them a deal with Interscope Records. Dredg released El Cielo in 2002, Catch Without Arms in 2005, The Pariah, the Parrot, the Delusion in 2009, and Chuckles and Mr. Squeezy[2] in 2011.\n"
      ]
   },
   "Title": "Dredg - Wikipedia"
}