{
   "Name": "The Doobie Brothers",
   "rawData": [
      "The Doobie Brothers are an American rock band from San Jose, California. Active for five decades, with their greatest success in the 1970s, the group's current lineup consists of founding members Tom Johnston (guitars, vocals) and Patrick Simmons (guitars, vocals), veteran member Michael McDonald (keyboards, vocals), longtime member John McFee (guitars, pedal steel, violin, backing vocals), and touring musicians including John Cowan (bass, vocals), Bill Payne (keyboards), Marc Russo (saxophones), Ed Toth (drums), and Marc Quiñones (percussion).\n",
      "The band's history can be roughly divided into three eras. From 1970 to 1975 it featured lead vocalist Johnston and a mainstream rock and roll sound with elements of folk, country and R&B. Johnston left the group in 1977 due to health reasons, and was replaced by Michael McDonald, whose interest in soul music changed the band's sound until it broke up in 1982 with Simmons being the only constant member having appeared on all of their albums. In 1987, the Doobie Brothers reformed with Johnston back in the fold; McDonald, who had previously made several guest appearances since their reformation, returned to the band full-time in 2019 for their upcoming 50th anniversary tour. Every incarnation of the group has emphasized vocal harmonies. The Doobie Brothers were inducted into the Vocal Group Hall of Fame in 2004, and the Rock and Roll Hall of Fame on November 7, 2020. The group has sold more than 40 million albums worldwide. Founding members John Hartman and Dave Shogren, Tiran Porter, Michael Hossack, Keith Knudsen and Jeff \"Skunk\" Baxter are former members of the band.\n",
      "Drummer John Hartman arrived in California  determined to meet Skip Spence of Moby Grape and join an aborted Grape reunion. Spence introduced Hartman to singer, guitarist, and songwriter Tom Johnston and the two proceeded to form the nucleus of what would become the Doobie Brothers. Johnston and Hartman called their fledgling group \"Pud\" and experimented with lineups (occasionally including Spence) and styles as they performed in and around San Jose. They were mostly a power trio (along with bassist Greg Murphy) but briefly worked with a horn section.\n"
   ],
   "infobox": {
      "Also known as": [
         "The Doobies"
      ],
      "Origin": [
         "San Jose, California, U.S."
      ],
      "Genres": [
         "Rock",
         "soft rock[1]",
         "pop[2]",
         "blue-eyed soul[3]"
      ],
      "Years active": [
         "1970 (1970)–1982 (1982)",
         "1987 (1987)–present"
      ],
      "Labels": [
         "Warner Bros.",
         "Capitol",
         "Arista",
         "Sony"
      ],
      "Associated acts": [
         "Southern Pacific",
         "Steely Dan"
      ],
      "Website": [
         "doobiebros.com"
      ],
      "Members": [
         "Tom Johnston",
         "Patrick Simmons",
         "Michael McDonald",
         "John McFee",
         "John Cowan",
         "Bill Payne",
         "Marc Russo",
         "Ed Toth",
         "Marc Quiñones"
      ],
      "Past members": [
         "See List of the Doobie Brothers band members"
      ]
   }
}