{
   "Name": "Monkey (band)",
   "rawData": [
      "Monkey is a third wave ska band based in the San Francisco Bay Area. Their musical influences include the Skatalites, Prince Buster, the Specials, and non-ska artists such as: Elvis Costello, David Byrne and Tito Puente. Monkey has released five albums, the first two as independent releases, the next three by Asian Man Records. Their debut album ¡Changito!, was listed as San Jose's Best Independent Release for 1998. They have toured the United States, Canada, Mexico, Europe and the United Kingdom, and have earned several nominations and awards, including winning the California Music Award (Bammie) in 1999.\n",
      "The band has gone on to tour the world and has recorded several albums. Monkey's music can be heard on several compilations, as well as movie and video game soundtracks.\n",
      "Monkey was formed in the summer of 1995, by Curtis Meacham and Kevin Miller. In 1997 Monkey's first full-length release, ¡Changito!, was released.  The lineup of the band changed numerous times after this, with Meacham and Miller remaining. In 1999, they won a Bay Area Music award, or Bammy. Their second self-released album, Station Wagon Living came out during the \"crash\" of third wave ska. Co-founding member Miller left the band in 2001. Meacham, up until then lead singer and organ player, became the band's lead guitarist. Monkey were signed in 2004, and released their first label supported album, Cruel Tutelage on Asian Man Records. While touring Europe, they met up with Bad Manners in the U.K. They returned to the U.S. and toured as their backup band. In 2009, they released Lost at Sea. The album featured Kincaid Smith from Hepcat on trumpet, and the artwork was supplied by Parker Jacobs of Yo Gabba Gabba fame.\n"
   ],
   "infobox": {},
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band based in the [PERSON_NAME_FIRST_1] Francisco Bay Area. Their musical influences include the Skatalites, Prince Buster, the Specials, and non-ska artists such as: [PERSON_NAME_FULL_2_MALE], David Byrne and [PERSON_NAME_FULL_0_MALE]. [BAND_NAME] has released five albums, the first two as independent releases, the next three by Asian Man Records. Their debut album ¡Changito!, was listed as [PERSON_NAME_FULL_1_FEMALE]'s Best Independent Release for [YEAR]. They have toured the United States, Canada, Mexico, Europe and the United Kingdom, and have earned several nominations and awards, including winning the California Music Award (Bammie) in [YEAR].\n",
      "The band has gone on to tour the world and has recorded several albums. [BAND_NAME]'s music can be heard on several compilations, as well as movie and video game soundtracks.\n",
      "[BAND_NAME] was formed in the summer of [YEAR], by Curtis Meacham and [PERSON_NAME_FULL_0_MALE]. In [YEAR] [BAND_NAME]'s first full-length release, ¡Changito!, was released.  The lineup of the band changed numerous times after this, with Meacham and [PERSON_NAME_LAST_0] remaining. In [YEAR], they won a Bay Area Music award, or Bammy. Their second self-released album, Station Wagon Living came out during the [SONG_NAME] of third wave ska. Co-founding member [PERSON_NAME_LAST_0] left the band in [YEAR]. Meacham, up until then lead singer and organ player, became the band's lead guitarist. [BAND_NAME] were signed in [YEAR], and released their first label supported album, Cruel Tutelage on Asian Man Records. While touring Europe, they met up with Bad Manners in the U.K. They returned to the U.S. and toured as their backup band. In [YEAR], they released Lost at Sea. The album featured Kincaid Smith from Hepcat on trumpet, and the artwork was supplied by Parker Jacobs of Yo Gabba Gabba fame.\n"
   ]
}