{
   "Name": "No Use for a Name",
   "Sections": [
      "1 History",
      "1.1 Sly's death",
      "2 Band members",
      "3 Timeline",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "No Use for a Name (sometimes abbreviated NUFAN or No Use) was an American punk rock band from San Jose, California, United States[1] formed in 1986[2][3] by Chris Dodge (guitar), Steve Papoutsis (bass guitar) and Rory Koff (drums). The band's sound evolved considerably through its career, starting off as a Bay Area-influenced punk band, moving on to a much heavier metallic-tinted sound to finally taking on a much lighter brand of melodic punk as the years passed. The band's career ended in 2012 following Tony Sly's death on July 31 of that year.\n"
      ]
   },
   "History": {
      "Sly's death": {
         "text": [
            "Tony Sly died in his sleep on July 31, 2012.[8] Riddle, Rest and Rivera played a tribute performance to Sly at the Envol & Macadam Festival in Québec City on September 8, 2012, along with the former No Use for a Name members Nassie and Koff.[9] This was intended to be the band's final performance, with Riddle commenting, \"This is the last No Use for a Name show ever. No one wants to do this without Tony,\"[10] The band's final show before Sly's death had also been in Quebec, at the D-Tox Rockfest in Montebello on June 15, 2012.[11] but they reunited twice more as No Use and Friends for Fat Wreck Chord's 25th Anniversary Show in August 2015, and Groezrock 2016 in Belgium.\n"
         ]
      },
      "text": [
         "No Use For a Name was formed in 1986 by longtime friends Dodge, Papoutsis and Koff. The early rehearsals of the band had taken place at a warehouse in Sunnyvale owned by Koff's father, where they also came up with the name for the band. During this era, the band was fronted by Papoutsis' friend John Meyer. Initially a four piece, it later expanded to a six piece, adding as a co-vocalist Ramon Gras and a second guitarist Doug Judd. The band experienced many line up changes during this period. In 1987, Dodge left to play in another Bay Area punk band, Stikky, while in summer that year, both Meyer and Judd left the band with Tony Sly replacing Judd on guitar. This line-up first appeared on Maximum RocknRoll's 1987 Turn it Around compilation, with the song \"Gang Way\". In 1988, Gras fell out with the rest of the band and left before an important show at Gilman and a live appearance on the KFJC radio show. In a tight spot, the band asked the former guitarist Dodge, who before the formation of No Use had sung in other local bands, to rejoin as vocalist, which he agreed. This line-up of the band recorded two EPs; No Use For a Name on Woodpecker Records and Let 'em Out on on Slap A Ham Records. In 1989, Dodge left again which allowed Sly to take over vocals and songwriting.[2][3]\n",
         "NUFAN's first album, Incognito, was released in 1990 by New Red Archives. It was the only album by the band recorded as a trio.[4] In 1991, Dodge rejoined on second guitar and they released their second album, Don't Miss the Train, in 1992 before signing up with Fat Mike's label Fat Wreck Chords in 1993. In late 1992, Dodge left the line-up,[2] and was replaced by the guitarist Robin Pfefer, who took over on lead guitar so that Sly could step down to rhythm and concentrate on singing. No Use for a Name also released their first record on Fat Wreck Chords that year, The Daily Grind (EP), which turned out to be highly successful.\n",
         "Ed Gregor replaced Pfefer on lead guitar soon after the release of The Daily Grind. In 1995, after the release of Leche Con Carne, their third full-length album, Chris Shiflett and Matt Riddle joined the band to play guitar and bass guitar, replacing Gregor and Papoutsis respectively. With the punk music breakthrough in 1994, No Use for a Name received a larger audience after releasing this album, thanks to their video for the song \"Soulmate\" which was played on the MTV show 120 Minutes. This was the first video from Fat Wreck Chords to appear on MTV. In 1997, after the success of Making Friends, the band toured the U.S., Europe, Australia, Canada and Japan.\n",
         "After releasing More Betterness!, Shiflett left the band in 1999 to join the successful Foo Fighters, being replaced by Dave Nassie. Two years later, the band released a live album, Live in a Dive: No Use for a Name on Fat Wreck Chords and, in 2002, No Use for a Name released its sixth studio album, Hard Rock Bottom.\n",
         "The band released its eighth full-length studio album, Keep Them Confused, on June 14, 2005. It takes a more political position than earlier releases. A greatest hits collection, All the Best Songs, was released on July 10, 2007. A new fourteen song full-length studio album entitled The Feel Good Record of the Year was released on April 1, 2008. In 2009, when promoting the album in Europe, Nassie left the band to join the Bleeding Through.[5] In August 2009, the band announced that Nassie had been replaced by Chris Rest, Lagwagon's guitarist and founding member of Rich Kids on LSD.[6] In December 2010,  Koff told the band that he would need time off from touring to go full time with his snowplow business[7] and he was eventually replaced by a new full-time drummer, Boz Rivera (of King City, Rich Kids on LSD, and The Mad Caddies).[1]\n"
      ]
   },
   "Band members": {},
   "Timeline": {},
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "No Use for a Name (sometimes abbreviated NUFAN or No Use) was an American punk rock band from San Jose, California, United States[1] formed in 1986[2][3] by Chris Dodge (guitar), Steve Papoutsis (bass guitar) and Rory Koff (drums). The band's sound evolved considerably through its career, starting off as a Bay Area-influenced punk band, moving on to a much heavier metallic-tinted sound to finally taking on a much lighter brand of melodic punk as the years passed. The band's career ended in 2012 following Tony Sly's death on July 31 of that year.\n",
      "No Use For a Name was formed in 1986 by longtime friends Dodge, Papoutsis and Koff. The early rehearsals of the band had taken place at a warehouse in Sunnyvale owned by Koff's father, where they also came up with the name for the band. During this era, the band was fronted by Papoutsis' friend John Meyer. Initially a four piece, it later expanded to a six piece, adding as a co-vocalist Ramon Gras and a second guitarist Doug Judd. The band experienced many line up changes during this period. In 1987, Dodge left to play in another Bay Area punk band, Stikky, while in summer that year, both Meyer and Judd left the band with Tony Sly replacing Judd on guitar. This line-up first appeared on Maximum RocknRoll's 1987 Turn it Around compilation, with the song \"Gang Way\". In 1988, Gras fell out with the rest of the band and left before an important show at Gilman and a live appearance on the KFJC radio show. In a tight spot, the band asked the former guitarist Dodge, who before the formation of No Use had sung in other local bands, to rejoin as vocalist, which he agreed. This line-up of the band recorded two EPs; No Use For a Name on Woodpecker Records and Let 'em Out on on Slap A Ham Records. In 1989, Dodge left again which allowed Sly to take over vocals and songwriting.[2][3]\n",
      "NUFAN's first album, Incognito, was released in 1990 by New Red Archives. It was the only album by the band recorded as a trio.[4] In 1991, Dodge rejoined on second guitar and they released their second album, Don't Miss the Train, in 1992 before signing up with Fat Mike's label Fat Wreck Chords in 1993. In late 1992, Dodge left the line-up,[2] and was replaced by the guitarist Robin Pfefer, who took over on lead guitar so that Sly could step down to rhythm and concentrate on singing. No Use for a Name also released their first record on Fat Wreck Chords that year, The Daily Grind (EP), which turned out to be highly successful.\n",
      "Ed Gregor replaced Pfefer on lead guitar soon after the release of The Daily Grind. In 1995, after the release of Leche Con Carne, their third full-length album, Chris Shiflett and Matt Riddle joined the band to play guitar and bass guitar, replacing Gregor and Papoutsis respectively. With the punk music breakthrough in 1994, No Use for a Name received a larger audience after releasing this album, thanks to their video for the song \"Soulmate\" which was played on the MTV show 120 Minutes. This was the first video from Fat Wreck Chords to appear on MTV. In 1997, after the success of Making Friends, the band toured the U.S., Europe, Australia, Canada and Japan.\n"
   ]
}