{
   "Discography": {
      "Singles": {},
      "text": [
         "Other independent releases:\n",
         "\"For testing purposes V1.0\" (2000)\ntrack list:\n1. \"Sapphire\"\n2. \"Flawless\"\n3. \"Die Together\"\n4. \"Champagne\"\n",
         "\"Falling Asleep\" [2000]\n1. \"Medicinal\"\n2. \"Sleep\"\n",
         "Breather Promo disc [2001]\n1. \"Off Axis (Colour)\"\n2. \"Recover\"\n",
         "Downside Demo [2002]\n1. \"I Will Breathe Fire\"\n2. \"She Stabs\"\n3. \"The Panic\"\n",
         "Klown Demos [2002]\n1. \"The Panic\"\n2. \"New Eternal\"\n3. \"I Will Breathe Fire\"\n4. \"In A Sweet Dream\"\n5. \"She Stabs\"\n6. \"Sleep\"\n7. \"Just Like Silk\"\n",
         "\"When It's All Burning\" (2003)\ntrack list:\n1. \"In/Evolve\"\n2. \"When It's All Burning\"\n3. \"You Are Eternal\"\n4. \"White Hot Light\"\n5. \"I Will Breathe Fire\"\n6. \"Piece By Piece\"\n7. \"Trust Kill Trust\"\n8. \"The Panic\"\n9. \"Waiting\"\n10. \"Never There\"\n11. \"Just Like Silk\"\n12. \"We've Changed\"\n13. \"In A Sweet Dream\"\n14. \"Out/Slow To Home\"\n"
      ]
   },
   "External links": {},
   "History": {
      "Hiatus, disbandment, and reunion (2008–2014)": {
         "text": [
            "On January 19, 2008, vocalist Eric Victorino announced that he was leaving the band, stating that he wanted to explore his creativity,[1] and encouraging fans to \"let this be a time of growth and evolution, a celebration of the past eight years and anticipation of what's to come.\"  The band was subsequently disbanded, with Hernandez and Robison forming a new project titled Beta State.[1]  Victorino later started a new band named The Limousines, and also published two books; a short story and poetry compilation titled Coma Therapy, and Trading Shadows for Sunshine: A Loosely Chronicled Descent into the World of Exercise Bikes and Antidepressants.[12] On September 17, 2010, Beta State released their full-length album entitled Stars.  On August 30, 2011, a reissue of Sleep was released to celebrate the tenth anniversary of the release of the EP, which includes previously unreleased songs, demos, and acoustic songs.\n",
            "In early 2014, Victorino and Hernandez began posting pictures and videos of the members practicing songs from both of their studio albums as well as setlists, causing rumor of a reunion. Strata has begun playing shows again, and officially announced their reunion in June 2014. Drummer Adrian Robison was invited to join, but declined. Longtime friend of the band Andy Bailey has joined on drums.[4]\n"
         ]
      },
      "Return from Hiatus (2020)": {
         "text": [
            "On 28 July 2020, the band confirmed their return with a new single titled Around The Bend. The band confirmed that this would be their first track of 2020, which was self-recorded, self-produced, and self-released. Around The Bend was released, via Bandcamp,[14] which included a podcast style breakdown of the making of Around The Bend featuring Eric Victorino & Ryan Hernandez as well as an alternate acoustic version of the song.[15]\n"
         ]
      },
      "Self-titled album (2004)": {
         "text": [
            "In 2004, they released their first full-length album on Wind-up Records.  The album was featured on the Billboard Top Heatseekers chart, where it peaked at number forty-one.[6] The album contained a lot of revised material from their previous Internet-only release When It's All Burning, and EP Now the Industry is Outnumbered. Their Factories are Burning Down'.[5]  The album spawned two singles: \"The Panic\" and \"Never There (She Stabs),\" which were accompanied by music videos.  Another song, \"Piece By Piece\", was featured on the soundtrack for the movie The Punisher, and the video game Madden NFL 2005.[7] \"Never There (She Stabs)\" was featured on the soundtrack of the movie Elektra.[8]  During 2004, the band toured with Alien Ant Farm, dredg, Sno-Core, Smile Empty Soul, Finger Eleven, Nonpoint, and Skindred.[5]\n"
         ]
      },
      "The End of the World (2007)": {
         "text": [
            "On 17 July 2007, the band released their second full-length album, titled Strata Presents The End of the World. The album spawned two singles, \"Cocaine (We're All Going to Hell)\"[9] and \"Stay Young\".  Critics noted a departure from the band's previous nu-metal grunge sound, into a more 'atmospheric' and 'epic' sound, similar to that of My Chemical Romance or the Mars Volta.[10]\n",
            "In September 2007, Strata toured with Kaddisfly.[11] The tour was their first co-headlining tour and covered most of the United States West Coast.   Between 29 November 2007 and 16 December 2007, Strata toured the West Coast of the U.S., beginning in Orangevale, California, and finishing in San Francisco.[citation needed]\n"
         ]
      },
      "The Sawmill Sessions EP (2015–2017)": {
         "text": [
            "Without announcement on the band's official social media page, Strata released a six-song EP called The Sawmill Sessions on March 8, 2016 to iTunes,[13] among other digital retailers. Many of the EP's tracks were reworked versions of songs previously released as demos on the 10-year anniversary edition of Sleep, as well as an alternate version of \"Coma Therapy.\"\n"
         ]
      },
      "text": [
         "In 2001, under the name Downside, the band released the nine-track EP Sleep. Issues surrounding the name being trademarked by another band caused the band to change their name to Strata. In 2003, after changing the band name to Strata, they released the seven-track EP Now the Industry is Outnumbered. Their Factories are Burning Down.[5]\n"
      ]
   },
   "Members": {
      "Current lineup": {},
      "Former members": {}
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Self-titled album (2004)",
      "1.2 The End of the World (2007)",
      "1.3 Hiatus, disbandment, and reunion (2008–2014)",
      "1.4 The Sawmill Sessions EP (2015–2017)",
      "1.5 Return from Hiatus (2020)",
      "2 Members",
      "2.1 Current lineup",
      "2.2 Former members",
      "3 Discography",
      "3.1 Singles",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Strata is an American rock band from Campbell, California, United States, formed in 2000, when guitarist Ryan Hernandez and singer Eric Victorino met and left their previous bands. Bassist Hrag Chanchanian and drummer Patrick Spain completed the line-up under the band's original name, Downside. The band released an EP entitled \"For Testing Purposes\" and an album called Sleep in 2001. Garnering major label attention early on, Downside signed a development deal with Capitol Records, during which time they replaced drummer Patrick Spain with Adrian Robison and recorded a collection of songs called, The Industry Is Outnumbered... Their Factories Are Burning Down, much of which would become their major label debut, under the name Strata, on Wind-Up Records in 2003. The band toured the United States and Canada extensively, supporting Team Sleep, Sonny (Skrillex), Chevelle, Helmet, Dredg, Smile Empty Soul, Trapt, Alien Ant Farm, S.T.U.N., Codeseven, FingerEleven, Steriogram, Sick Puppies and more.\n",
         "Strata filmed a music video for the single \"The Panic\" in Romania, with the film crew who had recently filmed the movie Cold Mountain. In 2005, the band was set to begin a tour with Nonpoint when singer Eric Victorino developed polyps and nodes on his vocal cords, rendering him virtually mute and forcing Strata to drop off the tour. Victorino stayed in New York City for two weeks to undergo treatment, at which time he wrote most of the lyrics to songs that would become the band's next release. The remaining band and crew drove home to California, stopping in numerous cities to go bowling with fans who had tickets to see the canceled tour dates. In the summer of 2006, Strata headed to Southern England to begin recording Strata Presents The End Of The World, with producer Sam Williams, at the Sawmills Studio in Cornwall. Released on July 27, 2007, 'SPTEOTW' was a polarizing record. Fans of the previous album noted the band's new direction, Victorino's use of falsetto and the lyrical content loosely followed a plot throughout the album, leading to speculation that the release was a concept album. Strata filmed a music video for the single \"Stay Young\" in Northern Sweden. Strata toured in support of SPTEOTW until January 2008, when Victorino abruptly quit the band, giving no explanation as to why.\n",
         "In 2014, Strata returned to the stage with a new drummer, longtime friend Andy Bailey. They performed a couple of times, then seemingly went back into hiding. Posting an occasional clip or photo from their rehearsal studio, but never releasing new music. In 2017, Victorino's cousin, pianist/keyboardist Jonny Poso joined the band on stage in San Jose and is now officially listed on the band's social media accounts as a full fledged member. Strata released a downtempo, slightly electronic sounding single entitled \"Welcome To The West Coast\" in January 2019. The song debuted on Sirius XM's Alt Nation \"Advanced Placement.\" In the summer of 2019, drummer Jim Leadbetter completed the line-up and the band began recording their next album.\n",
         "They released two albums with Wind-up Records, before disbanding[1] after the departure of vocalist Eric Victorino on 19 January 2008.[2][3] In 2014, the band reunited, minus Adrian Robison on drums, replaced by longtime friend of the band Andy Bailey.[4]\n"
      ]
   },
   "Title": "Strata (band) - Wikipedia"
}