{
   "Name": "Strata (band)",
   "rawData": [
      "Strata is an American rock band from Campbell, California, United States, formed in 2000, when guitarist Ryan Hernandez and singer Eric Victorino met and left their previous bands. Bassist Hrag Chanchanian and drummer Patrick Spain completed the line-up under the band's original name, Downside. The band released an EP entitled \"For Testing Purposes\" and an album called Sleep in 2001. Garnering major label attention early on, Downside signed a development deal with Capitol Records, during which time they replaced drummer Patrick Spain with Adrian Robison and recorded a collection of songs called, The Industry Is Outnumbered... Their Factories Are Burning Down, much of which would become their major label debut, under the name Strata, on Wind-Up Records in 2003. The band toured the United States and Canada extensively, supporting Team Sleep, Sonny (Skrillex), Chevelle, Helmet, Dredg, Smile Empty Soul, Trapt, Alien Ant Farm, S.T.U.N., Codeseven, FingerEleven, Steriogram, Sick Puppies and more.\n",
      "Strata filmed a music video for the single \"The Panic\" in Romania, with the film crew who had recently filmed the movie Cold Mountain. In 2005, the band was set to begin a tour with Nonpoint when singer Eric Victorino developed polyps and nodes on his vocal cords, rendering him virtually mute and forcing Strata to drop off the tour. Victorino stayed in New York City for two weeks to undergo treatment, at which time he wrote most of the lyrics to songs that would become the band's next release. The remaining band and crew drove home to California, stopping in numerous cities to go bowling with fans who had tickets to see the canceled tour dates. In the summer of 2006, Strata headed to Southern England to begin recording Strata Presents The End Of The World, with producer Sam Williams, at the Sawmills Studio in Cornwall. Released on July 27, 2007, 'SPTEOTW' was a polarizing record. Fans of the previous album noted the band's new direction, Victorino's use of falsetto and the lyrical content loosely followed a plot throughout the album, leading to speculation that the release was a concept album. Strata filmed a music video for the single \"Stay Young\" in Northern Sweden. Strata toured in support of SPTEOTW until January 2008, when Victorino abruptly quit the band, giving no explanation as to why.\n",
      "In 2014, Strata returned to the stage with a new drummer, longtime friend Andy Bailey. They performed a couple of times, then seemingly went back into hiding. Posting an occasional clip or photo from their rehearsal studio, but never releasing new music. In 2017, Victorino's cousin, pianist/keyboardist Jonny Poso joined the band on stage in San Jose and is now officially listed on the band's social media accounts as a full fledged member. Strata released a downtempo, slightly electronic sounding single entitled \"Welcome To The West Coast\" in January 2019. The song debuted on Sirius XM's Alt Nation \"Advanced Placement.\" In the summer of 2019, drummer Jim Leadbetter completed the line-up and the band began recording their next album.\n"
   ],
   "infobox": {
      "Origin": [
         "Campbell, California, United States"
      ],
      "Genres": [
         "Alternative metal, hard rock, post-grunge, nu metal"
      ],
      "Years active": [
         "2000–2008; 2013–present"
      ],
      "Labels": [
         "Wind-up"
      ],
      "Associated acts": [
         "Beta State, The Limousines, Balancing the Lion"
      ],
      "Website": [
         "www.strata-music.com"
      ],
      "Members": [
         "Ryan Hernandez",
         "Eric Victorino",
         "Hrag Chanchanian",
         "Jim Leadbetter",
         "Jonathan Poso"
      ],
      "Past members": [
         "Adrian Robison",
         "Patrick Spain",
         "Andy Bailey"
      ]
   }
}