{
   "Breakup, reunions, and other releases": {
      "text": [
         "The band played their final show on October 22, 1985 at the Keystone in Palo Alto, California supporting Hüsker Dü. A few days later at a Halloween party the band formally broke up citing personality conflicts and clashes over songwriting, and musical direction. Ray had this to say regarding the matter, \"the band had run its course with Adam 'Bomb' Segal on guitar, and the direction he was trying to lead the band.\" O'Brien equated the breakup to \"the end of a relationship that had run out of passion and understanding.\" The band members remained good friends and Adam would eventually join them on stage again during 2004.\n",
         "The band's final EP, Epitaph, recorded during the summer of 1985, was eventually released in 1986 on Thrash Records. A somewhat thrown together mix of songs, Epitaph does have a couple of standouts. The in your face \"I Decide For Me\" and a cover of \"California Dreamin'\" with alternate lyrics aimed at disillusionment that only a punk rock band could dial in. There is some controversy surrounding the master tapes of Epitaph.[3] For the first time ever, the band went with an outside record company in Thrash Records, a sub-label of parent company Mystic, to produce the album. Mystic apparently released the album, gave one copy to each band member, kept the masters, and never paid the band. It is still unknown if the master tapes were ever recovered. Epitaph would be the last album for 10 years. A three word slogan on the back sleeve would prove quite prophetic, however. The slogan reads, \"We'll Be Back\".\n",
         "In 1989, for reasons even unknown to the band, they reunited and played two sold out shows at the Cactus Club in San Jose. Demand for the shows was so high that club owners had to turn away a crowd of approximately 300 waiting outside on the first night. This was after they filled the venue. The shows featured the band's final lineup minus Adam Segal. Pro skater Jeff Kendall took over Adam's spot. This reunion spawned a four song demo tape. Two songs, \"Looking For You\" and \"Pet Squirrel\", appeared in the Santa Cruz Skateboards video, \"A Reason For Living\". This reunion didn't last much longer and the band again called things off.\n",
         "In 1995, Gavin was approached by Mark Waters of Goldenrod Records to put a compilation of Faction recordings together. Released in 1996, Collection: 1982-1985 gathers most of the band's recorded material including live songs from the Tool & Die in San Francisco, radio station KFJC, and CBGB. Gavin had this to say regarding the album, \"the thing is, it was never meant to be a complete collection. I named it \"Collection\" after The Stranglers album with the same name.\" Due to the missing master tapes for Epitaph, the songs from that album had to be lifted from a vinyl copy in order to be included. In 2001, former guitarist Adam Segal released a Faction collection of his own through his record label, AVD. The Faction Collection 2: Uncollectable is an assortment of various studio, demo, and live tracks including the band's entire set from the '85 CBGB gig.\n",
         "Throughout the 1990s, Cab and Ray routinely nagged at Gavin to reform the band. Gavin wouldn't commit. His life was simply too busy and he had no free time to devote to the band. During March 2001, Los Olvidados reunited and played a couple of shows to a packed house at Bottom of the Hill in San Francisco. Later, after the shows took place, Gavin made a phone call to Los O's guitarist Mike Fox. During the conversation, Gavin told Fox that, \"it was time for Los Olvidados to release the CD that never came out, and take over the whole fucking world!\"[3] Fox, however, countered back that Gavin needed to agree to a Faction reunion. A little upset at the notion of another reunion, Gavin recalled, \"[Fox] ground me down for three days until I called Stevie and Ray.\" Cab and Ray must have been ecstatic. By now, Craig Bosch had moved away from San Jose and they needed a drummer. Keith Rendon once again joined the band although he hadn't played the drums for 15 years. All that was left was to bring in another guitarist. At the recommendation of Mike Fox, the band contacted original guitarist Russ Wright who was in the Bay Area band The Demonics. Russ hopped on board. Having nearly all their original lineup, the band set out to play one show. The Faction reunited for the first time in 12 years on July 14, 2001 at The San Jose Legends Show at Usual Nightclub.[4] The Forgotten, Ribzy, and Los Olvidados opened with The Faction headlining. This show had sold out over a week prior to happening and was given an enthusiastic reception by the crowd. Two dedicated Faction fans had even driven from New Jersey to witness the event. Spurred on by this show and strong reviews from the local media, the band decided to take a shot at making another album and playing more gigs.\n",
         "The band recorded new material during the early part of the new millennium and four tracks surfaced. \"The Whistler\" on a split 7\" with J.F.A. released in 2003, \"Cut It Out\" on another compilation, \"Aisle Seat\" and \"Who The Hell Do You Think You Are?\" The last two were never officially released with \"Aisle Seat\" ending up on the band's MySpace page. The Faction continued to play in and around California as a foursome. The final lineup was Gavin, Cab, Ray, and Keith. Shows were also played in Seattle, Washington, Vancouver, British Columbia, and their first ever gigs outside of North America in Scotland and Germany. The show played in Seattle was for the Hey Punk! Festival at the Experience Music Project Museum. The Faction were celebrating their inclusion in EMP's permanent section dedicated to the genre they helped pioneer, skate rock. Gavin recalls, \"It really put things into perspective for me because I never felt the Faction was anything special. But the EMP thing was a sign of respect and recognition of our contribution to the scene.\"\n",
         "In 2004, the Faction were asked to perform at the San Jose Punk Rock Reunion shows, which spanned two nights at the Blank Club. For the first time since the classic line up broke up in 1985, Adam was asked to perform with the band. After that show, the band again fell inactive for the next decade. In 2014, however, Lars Frederiksen of Rancid asked Gavin to perform guest vocals on two Faction songs with Lars's side project Old Firm Casuals at a San Jose Earthquakes Soccer fan event. Gavin had resisted all efforts to reunite the faction since 2004 and was reluctant to perform again. Nevertheless, he agreed to perform with his friend Lars.\n",
         "Gavin's desire to perform with the Faction was rekindled by the guest spot. He emailed Adam about what had occurred, and his change of heart, and proposed that if Adam would rejoin the band, Gavin would agree to play again as well. \n",
         "The band play a number of shows from 2014 until February 22, 2020, locally in San Jose, California and also in Las Vegas, Nevada (including Punk Rock Bowling), Palm Springs, California, Orange County, California, Santiago, Chile, San Francisco, California (with Rancid), Sacramento, California, two appearances on the Flogging Molly-Salty Dog Cruise, and at their namesake brewery Faction Brewing in Alameda, California.[5][6][7]\n",
         "\"Pegged for Live\" was released as an lp on Not Like You Records on October 16, 2015, making it their first official live album in their 30+ year history. It was recorded off the soundboard at CBGBs and originally issued only on cassette by the band. The lp reissue was remastered by guitarist Adam \"Bomb\" Segal and was released on 3 colors... red vinyl, white vinyl and the limited \"let's go get cokes\" colored vinyl only available on Not Like You's website.\n",
         "\"Destroys O.C. Cab's 50th D-Day Bash!\" came out October 31, 2015 (to coincide with Halloween) on Beer City Skateboards and Records. It is a live album that was released on LP as well as a CD/DVD version. The first pressing of the LP is limited to 1,000 copies on clear vinyl. The CD comes with a DVD of the performance that is not included with the LP. This performance would be the first in Faction history to be professionally recorded and videoed.\n",
         "The band's 6-year reunion that began in 2014 ended with their last show ever on February 22, 2020, in their home town San Jose, California. However, despite ending live shows, the band did not officially break up. Instead, in October 2020 they re-recorded 12 of their most popular songs with engineer Dave Klein (former Agent Orange drummer) in Los Angeles for an expected new album Greatest Grinds.\n"
      ]
   },
   "Discography": {
      "Compilations": {},
      "Demo tape": {
         "text": [
            "Only one known Faction demo tape has ever been accounted for.\n"
         ]
      },
      "Live albums": {},
      "Split albums": {},
      "Studio albums": {}
   },
   "Early history": {
      "text": [
         "During 1982, The Faction's practice sessions began to take place in between ramp sessions at the Caballero home. There, local skaters gathered to skate \"Cab's\" backyard vert ramp and hang out. An early line up before the name \"The Faction\" was chosen included Steve Caballero, Gavin O'Brien, Craig Bosch, and Russ Wright. This lineup only lasted through a couple of practices when Craig Bosch left to join local punk band The Unaware. Bosch was replaced by Adam Segal who Steve and Gavin knew from Winchester Skate Park. Another local skater Craig Ramsey offered to manage the band under his production company Faction Productions. Discussions about a band name lead quickly to the adoption of Craig's production company name for the band itself. After recording a single demo of \"Spineless Majority\" with this line up, Adam switched to guitar and was replaced by drummer Keith Rendon. Russ Wright eventually left the band when his stepfather \"The Captain\" insisted Russ attend military school in Chico, California, leaving The Faction to carry on as a foursome. The band continued to perform during skate sessions at Cab's house and eventually landed their first gig opening for Social Distortion at San Jose City College, December 3, 1982.[1] Early gigs were also played at San Francisco clubs Mabuhay Gardens and On Broadway. Practice sessions moved from Cab's house to Segal's home in south San Jose.  At this point the band's career began to take flight.\n"
      ]
   },
   "External links": {},
   "Music and career (1982–1985)": {
      "text": [
         "The Faction's music is punk centered with strong emphasis on guitars. Prior to releasing anything official, the band recorded themselves to cassette tape and made copies to give to friends and fans at gigs. The earliest practice tapes are the only recordings of the first line up to bear The Faction band name, Steve, Gavin, Russ, Adam and Keith. Of those tapes, several tracks appeared on the compilation cassette-only release Growing Pains, which also featured Los Olvidados, Executioner, Ribzy, The Bruces, The Unaware, Grim Reality and Whipping Boy. After Russ left the band, another such tape, the Room 101 demo, was released in 1983. These songs were recorded by Adam on 4-track cassette at Steve's house with amps in separate bedrooms.\n",
         "Their first album, the 7\" Yesterday Is Gone, was released on the band's label IM Records in 1983.[2][3] This was a noble release and showed that, while fairly young, the band had chops and a solid knowledge of tempo and time changes associated with punk. Yesterday Is Gone marked something that few punk bands in their scene, with little to no money, were ever able to do: Put out an official release on vinyl record. 1,000 copies of the album were pressed thanks to Adam's mother Rita, who put up the money for the record. According to the band's official bio, this generated a bit of resentment in the local punk scene. Some people thought The Faction's popularity was only due to Steve Caballero's status outside of the band. This would prove to be untrue, however, after embarking on a small summer tour of California. They quickly discovered that their album had reached a wider audience when they were greeted with much enthusiasm in locations such as Fresno and Los Angeles. This enthusiastic response propelled the band and set the wheels in motion for a full-length release as well as plans for a nationwide US tour.\n",
         "The band's next album, No Hidden Messages, was also released in 1983. No Hidden Messages would be the only proper LP released by the band and would also prove to be a fan favorite. The band's musicianship was beginning to gel while O'Brien's vocals tackle subjects from 1980s politics \"Running Amok\", to paranoia \"Being Watched\", to anti-hippie rhetoric and consumerism in \"Why Save The Whales?\" and \"Fast Food Diet\" respectively. The song \"Skate And Destroy\" became wildly popular as background music at skate parks, pools, ramp sessions, and early skateboard videos. \"Skate And Destroy\" was also featured on the official soundtrack to Tony Hawk's Pro Skater 4 video game. Proving the band's staying ability through time, The song has long been considered the official \"anthem\" for skateboarding and skateboarders everywhere. As the band's manager, producer, and head of IM Records, Adam went to work booking a national tour in support of No Hidden Messages during 1984. The tour was a success and saw them play the infamous punk club CBGB for the first time.\n",
         "During a trip to Japan, where he was competing in a contest, Caballero spent much of his flight time listening to The Adolescents and felt inspired by their use of a two-guitar style. Upon his return, Cab wasted no time switching to rhythm guitar and handing bass duties to former Los Olvidados bassist Ray Stephens. Stevens was regarded as a hero by the band due to his time in Los Olvidados, a band that was held in high regard as the \"kings\" of the San Jose punk scene although they had never released a proper album at the time. The addition of Stevens proved very positive for the band and cemented their status firmly in the scene.\n",
         "With the lineup performing as a five-piece again, the EP Corpse in Disguise was released in 1984. Corpse In Disguise takes on a darker feel than the first two offerings both in lyrical content and musical direction, the dark and brooding \"100 Years War\" being an instant standout. It was becoming quite clear that the band were developing a heavier sound. During September 1984, just after the sessions for Corpse In Disguise finished, the band's presence was requested in Lincoln, Nebraska for Thrasher Magazine's 'Midwest Melee' skateboarding contest. While Cab was already there competing, the rest of the band obliged and set out on a Friday night, arriving late the following Saturday night. After driving halfway across the US for a one-set gig, the band's performance was cut short after just four songs. The police raided the contest and abruptly brought the festivities to an end. The band cleaned up, hopped in their van, and promptly drove back to San Jose in order to get drummer Keith Rendon back in time for work Monday morning. This was all for nothing when, upon returning to San Jose, Keith found out he didn't have to work that day. Not long after that, Keith decided that there was no money to be made in an underground punk band and departed. The band would then bring back drummer Craig Bosch whose band, The Unaware, had recently broken up. Bosch's playing skills had improved dramatically during his time away from The Faction and the band capitalized on it.\n",
         "The next album, Dark Room, was released in 1985. The punk sound wasn't gone but the heavier side of the band was very apparent. As its title suggests, Dark Room indeed had a dark feel to it. Thanks to a generous helping of metal infused punk resounding through songs like \"Tongue Like A Battering Ram\", \"Terror In The Streets\", and \"Deathless\", as well as the title track. The band pays a cheeky punk homage to their favorite drink of choice in \"Let's Go Get Cokes\". The production and mixing of Dark Room was much stronger and the best sounding album in the band's catalog. In addition to Corpse In Disguise and Dark Room the period between 1984-85 saw the band contribute tracks that were added to various skate compilations. Dark Room would be the last album before the band's breakup.\n",
         "During the summer of 1985, the band embarked on their second US tour. Almost all of the shows were headlining gigs with a couple of slots opening for bigger acts. The band opened at CBGB again and this time the concert was captured live on both audio and video. This show provides a rare glimpse at The Faction during their height. By this time their playing and showmanship were clearly taking a turn towards metal, a turn that not everyone wanted. Video footage of the July 7, 1985, CBGB gig shows Cab sporting a \"metal up your ass\" shirt from Metallica's Ride The Lightning tour. The band literally wore their influences on their sleeves and it was becoming more prevalent in their sound and stage presence. A cassette-only release of that show surfaced not long after the gig, entitled Pegged for Live NYC. While The Faction were certainly gaining momentum in the studio, their live shows were focused, powerful, and tight. The stage was where The Faction's music really came alive.\n",
         "Throughout their career, The Faction shared the stage with the likes of Social Distortion, Void, Big Boys, JFA, Executioner, Corrosion Of Conformity, The Melvins, Scream, Agent Orange, Aggression, Suicidal Tendencies, Rich Kids On LSD, Code Of Honor, Wasted Youth, Hüsker Dü, Portrait Of Poverty, Fluf, Drunk Injuns, Los Olvidados, Free Beer, U.S. Bombs, Supersuckers, and X to name a few.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Early history",
      "2 Music and career (1982–1985)",
      "3 Breakup, reunions, and other releases",
      "4 Discography",
      "4.1 Demo tape",
      "4.2 Studio albums",
      "4.3 Live albums",
      "4.4 Split albums",
      "4.5 Compilations",
      "5 External links",
      "6 References"
   ],
   "Summary": {
      "text": [
         "The Faction was an American hardcore punk band from San Jose, California. Pioneers of the skate punk era during the early 1980s, their primary stint being from Halloween 1982 until Halloween 1985, The Faction were one of the first bands whose music and lifestyle tastes centered on punk rock and skateboarding. An early demo tape had these words inscribed on the label: \"Music By Skaters For Skaters.\" All original band members and their subsequent replacements are accomplished skateboarders, most notably bass and guitar player and legendary professional skateboarder Steve Caballero. In the early years of the band Caballero was instrumental in attracting a large following of skateboarders to the band. Lead singer Gavin O'Brien was also a notable skateboarder, popular at local Winchester Skatepark. Drummer Craig Bosch has a skateboard trick named after him, \"the Bosch\" aka invert to blunt. Pro skateboarder Jeff Kendall would also play with The Faction during a brief reunion in 1989.\n"
      ]
   },
   "Title": "The Faction - Wikipedia"
}