{
   "Name": "Tsunami (band)",
   "Sections": [
      "1 Early days",
      "2 Fresh Faces",
      "3 Simple Machines",
      "4 After Simple Machines",
      "5 Discography",
      "5.1 Singles",
      "5.2 Albums",
      "5.3 Compilation appearances",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Tsunami was an American indie rock band from Arlington, Virginia, United States, formed by housemates Jenny Toomey and Kristin Thomson in late 1990 to play at New Year's party.[1] They enlisted former housemate John Pamer to play drums and Andrew Webster from Bricks and Jenny's previous band Geek to complete the line up.[2]\n"
      ]
   },
   "Early days": {
      "text": [
         "Following their inception, Tsunami split their time between touring, recording various 7\" singles and devoting time to Toomey and Thomson's Simple Machines record label- from which Tsunami would release the majority of their own music.[3] The band recorded their debut album, Deep End during the summer of 1992. However, due to manufacturing and mixing problems this was not released until early 1993.[2] It was then that the band were invited to play the side stage at Lollapalooza, going on to play six shows with Sebadoh, Free Kitten and Thurston Moore.[2] After the release of the band's second album The Heart's Tremolo,[2] Tsunami completed two tours of the US, a tour of England, and an appearance at the Phoenix Festival on the Melody Maker Stage.\n",
         "In 1995, Tsunami continued to tour the States and also managed to release their third album World Tour & Other Destinations.[2] The band subsequently had an official one year hiatus whilst John attended UMASS Amherst to complete his undergraduate degree.\n"
      ]
   },
   "Fresh Faces": {
      "text": [
         "Following his graduation in 1996, Pamer decided to stay in Amherst in order to save up so he could move to New York City. With this in mind, Tsunami enlisted the services of another Arlington drummer, Luther Gray. Having practiced with Gray for six months, the band recorded their fourth album at the Kingsize Soundlabs in Chicago. The result, A Brilliant Mistake, was released in August 1997 on Simple Machines.[2] The band embarked on another US tour to promote the album, taking on new members, Amy Domingues (bass) and Bob Massey (guitar and keyboards).\n"
      ]
   },
   "Simple Machines": {
      "text": [
         "In 1998, Toomey and Thomson took the decision to call time on the Simple Machines record label and the band.[2] The event was marked by the 'Simple Machines Finale party' at which the band performed. Whilst the end of the record label also marked the end of musical releases from Tsunami, they subsequently fulfilled a short East Coast tour in the same year. Toomey and Thomson joined up for two sets between 2001 and 2003 with a mixture of former members and guest musicians to perform at the Ladyfest festivals in Washington, D.C. and Philadelphia\n"
      ]
   },
   "After Simple Machines": {
      "text": [
         "After Simple Machines was wound up in 1998, Toomey went on to become the executive director of the Future of Music Coalition,[4] whose aim is \"to ensure that musicians have a voice in the issues that affect their livelihood\" through advocacy intended to establish a \"balanced approach to music in the digital age — one that reflects the interests of all stakeholders, and not just the powerful few\".[5] She was to be joined by Thompson who became Education Director for the organisation after completing a Masters in Urban Affairs and Public Policy from the University of Delaware.[6]\n"
      ]
   },
   "Discography": {
      "Singles": {},
      "Albums": {},
      "Compilation appearances": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Tsunami was an American indie rock band from Arlington, Virginia, United States, formed by housemates Jenny Toomey and Kristin Thomson in late 1990 to play at New Year's party.[1] They enlisted former housemate John Pamer to play drums and Andrew Webster from Bricks and Jenny's previous band Geek to complete the line up.[2]\n",
      "Following their inception, Tsunami split their time between touring, recording various 7\" singles and devoting time to Toomey and Thomson's Simple Machines record label- from which Tsunami would release the majority of their own music.[3] The band recorded their debut album, Deep End during the summer of 1992. However, due to manufacturing and mixing problems this was not released until early 1993.[2] It was then that the band were invited to play the side stage at Lollapalooza, going on to play six shows with Sebadoh, Free Kitten and Thurston Moore.[2] After the release of the band's second album The Heart's Tremolo,[2] Tsunami completed two tours of the US, a tour of England, and an appearance at the Phoenix Festival on the Melody Maker Stage.\n",
      "In 1995, Tsunami continued to tour the States and also managed to release their third album World Tour & Other Destinations.[2] The band subsequently had an official one year hiatus whilst John attended UMASS Amherst to complete his undergraduate degree.\n",
      "Following his graduation in 1996, Pamer decided to stay in Amherst in order to save up so he could move to New York City. With this in mind, Tsunami enlisted the services of another Arlington drummer, Luther Gray. Having practiced with Gray for six months, the band recorded their fourth album at the Kingsize Soundlabs in Chicago. The result, A Brilliant Mistake, was released in August 1997 on Simple Machines.[2] The band embarked on another US tour to promote the album, taking on new members, Amy Domingues (bass) and Bob Massey (guitar and keyboards).\n"
   ],
   "infobox": {
      "Origin": [
         "Arlington, Virginia, United States"
      ],
      "Genres": [
         "Alternative rock, indie rock"
      ],
      "Years active": [
         "1990-1998"
      ],
      "Labels": [
         "Simple Machines"
      ],
      "Associated acts": [
         "Franklin Bruno, Grenadine, Danielle Howle, Ida, Liquorice, Monorchid, The Raymond Brake, Retsin, Scrawl, Sea Saw, Bricks"
      ],
      "Past members": [
         "Jenny Toomey",
         "Kristin Thomson",
         "Luther Gray",
         "Amy Domingues",
         "Bob Massey",
         "Andrew Webster",
         "John Pamer"
      ]
   }
}