{
   "Name": "Black Moth",
   "rawData": [
      "Black Moth were an English stoner rock/metal band from Leeds. They cite Black Sabbath, The Stooges, Mastodon, Red Fang, Pissed Jeans, Drunk in Hell, Kvelertak, Uncle Acid & the Deadbeats, Turbowolf, Blacklisters, Nick Cave and the Bad Seeds, Swans, Bo Ningen, Goat and Arabrot and L7 as influences.\n",
      "The band released three full-length albums, all produced by Jim Sclavunos (Grinderman, Nick Cave and the Bad Seeds). While initially a quartet, the band saw the addition of guitarist Nico Carew in 2014, but he would leave the band in 2015 to focus on his other group (X-Ray Cat Trio) and was subsequently replaced by Federica Gialanze. Their second album, Condemned to Hope, had its cover created by Roger Dean. It generated mixed to positive reviews from reputable websites like TeamRock, Prog and PopMatters.\n",
      "In September 2019, the band announced the end of their activities, with a farewell show booked for 6 December of the same year.\n"
   ],
   "infobox": {
      "Origin": [
         "Leeds, Yorkshire, England"
      ],
      "Genres": [
         "Stoner rock",
         "heavy metal"
      ],
      "Years active": [
         "2010–2019"
      ],
      "Labels": [
         "New Heavy Sounds"
      ],
      "Website": [
         "www.themothpit.co.uk"
      ],
      "Members": [
         "Harriet Hyde",
         "Federica Gialanze",
         "Jim Swainston",
         "Dave Vachon",
         "Dom McCready"
      ]
   },
   "albums": [
      "The Killing Jar",
      "Condemned to Hope",
      "Anatomical Venus"
   ],
   "prunedData": [
      "[BAND_NAME] were an [GENRE] band from Leeds. They cite Black Sabbath, The Stooges, Mastodon, [PERSON_NAME_FULL_2_FEMALE], Pissed Jeans, Drunk in Hell, Kvelertak, Uncle Acid & the Deadbeats, Turbowolf, Blacklisters, [PERSON_NAME_FULL_0_MALE] and the Bad Seeds, Swans, [PERSON_NAME_FULL_1_MALE], Goat and Arabrot and L7 as influences.\n",
      "The band released three full-length albums, all produced by [PERSON_NAME_FULL_1_MALE] (Grinderman, Nick Cave and the Bad Seeds). While initially a [GENRE] band saw the addition of guitarist [PERSON_NAME_FULL_0_MALE] in [YEAR], but he would leave the band in [YEAR] to focus on his other group (X-Ray Cat Trio) and was subsequently replaced by Federica Gialanze. Their second album, Condemned to Hope, had its cover created by Roger Dean. It generated mixed to positive reviews from reputable websites like TeamRock, Prog and PopMatters.\n",
      "In [MONTH] [YEAR], the band announced the end of their activities, with a farewell show booked for 6 [MONTH] of the same year.\n"
   ]
}