{
   "Discography": {},
   "External links": {},
   "History": {
      "Booze, Broads and Beelzebub (2007)": {
         "text": [
            "Although there was no official release on the subject, Shagrath said in an interview with Live-Metal.net that Chrome Division had several new songs post Doomsday Rock 'n Roll, and that the band would probably try to produce a new album in mid-2007.[8] Björn Luna also said that there was to be a second album in an interview on MetalEagle.com, and explained that the band has signed a three-album contract with Nuclear Blast.[11]\n",
            "On January 15, 2008, Chrome Division announced they had finished recording their second album. It was recorded between January 7 and January 14, 2008, at Studio Fredmann.[19] The album, entitled Booze, Broads and Beelzebub, was released on July 18, 2008, with the band claiming it is \"a much better sounding album than the first one\".[20]\n",
            "In addition, the band issued a statement on their MySpace confirming preparation for their third release.[21]\n"
         ]
      },
      "Doomsday Rock 'n Roll (2004–2006)": {
         "text": [
            "It was this lineup that entered the Panzer Studio in Oslo to record the band's first album, Doomsday Rock 'n Roll, on December 4, 2005.[9] The album was produced by Björn Bergesen,[12] who was chosen for his commitment to the band and the fact that he was a fan of them.[7] Chrome Division announced that they had signed with Nuclear Blast on February 1, 2006.[13] It was through Nuclear Blast that Doomsday Rock N' Roll was released on August 8, 2006, in North America,[14][15] and slightly earlier in Norway, where it entered the charts at number 31.[15] It received numerous positive reviews,[16][17] and some that were less positive.[18] Jackie Smit, of Chronicles of Chaos, said \"the band seemingly ends up having more [fun] than the listener\".[18] Although the album was described as being unoriginal by reviewers, Live-Metal.net's Jeff Maki claims that \"what makes this album special is the high level of talent with which it is performed\".[16] Adam Harrold, of Rock Something, finished his review with the thought that the album \"might not be smartest record of 2006, but it is the sweatiest.\"[17] Chrome Division also recorded a music video for the song \"Serial Killer\" to publicise the album. The video was directed by Patric Ullaeus, a Swedish director.[7]\n"
         ]
      },
      "Foundation and early history": {
         "text": [
            "The idea for the band was conceived by Shagrath and Stian Arnesen, then of Dimmu Borgir, in 1999.[7] This consisted of the two musicians jamming after Dimmu Borgir rehearsals. With Shagrath on guitars and Arnesen (or \"Lex Icon\") on drums, they recorded some material, but could take it no further due to their commitments to their other bands.[1] Shagrath later claimed that Dimmu Borgir will always be his priority.[8]\n",
            "It was not until mid-2004 that the band was properly formed.[1] Shagrath and Lex Icon once again met up, and by this time Lex Icon had left Dimmu Borgir and founded The Kovenant. Shagrath had free time due to Dimmu Borgir taking a break after Ozzfest.[7] Shagrath got in contact with bassist Björn Luna (of Ashes to Ashes) and invited him to join them. The trio formed the base of Chrome Project.[1] Luna then contacted Eddie Guz (of The Carburetors) who joined as vocalist,[1] after Jarle Bernhoft of Span, had to decline.[7] Ricky Black, was the final member to be drafted in, this time as a guitarist.[1] Shortly afterwards, Lex Icon was replaced with Tony White of Minis Tirith,[1] because he was missing a large number of practice sessions, which was holding the band back.[7] The band stated that there were \"no hard feelings\".[9][10]   Björn Luna has stated that he considers Chrome Division to be a \"proper band\" rather than a side project.[11]\n"
         ]
      }
   },
   "Members": {
      "Current lineup": {},
      "Former members": {}
   },
   "Musical style": {
      "text": [
         "Shagrath cites Chrome Division's influences as Black Label Society, Spiritual Beggars, and AC/DC, and says that he wanted the band to sound like an '80s rock 'n roll heavy metal band. He also talked about the band trying adhere to that image, through lyrical content and such.[7][22] Reviewers compared the sound of the music to Motörhead,[16][18] and Black Label Society[16] and compared the \"fun\" attitude of the band to Turbonegro.[16] Shagrath has said that future releases from the band will be \"musically the same thing\", but that they will \"try to add different ingredients\" and they may also change the lyrical content.[7]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Foundation and early history",
      "1.2 Doomsday Rock 'n Roll (2004–2006)",
      "1.3 Booze, Broads and Beelzebub (2007)",
      "2 Musical style",
      "3 Members",
      "3.1 Current lineup",
      "3.2 Former members",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Chrome Division is a heavy metal band from Norway formed in 2004 by Shagrath, the lead vocalist of symphonic black metal band Dimmu Borgir. It is now considered a full band of Shagrath and the current lineup consists of him on rhythm guitar, along with Shady Blue as the vocalist, Mr Damage on lead guitar, and Tony White on drums. The band plays Doomsday hardrock and has, to date, released four albums, Doomsday Rock 'n Roll in 2006, Booze, Broads and Beelzebub in 2008, 3rd Round Knockout in 2011 and Infernal Rock Eternal in 2014.[5]\n",
         "The band has announced that their fifth album, One Last Ride, will be their last.[6]\n"
      ]
   },
   "Title": "Chrome Division - Wikipedia"
}