{
   "Name": "Chrome Division",
   "rawData": [
      "Chrome Division is a heavy metal band from Norway formed in 2004 by Shagrath, the lead vocalist of symphonic black metal band Dimmu Borgir. It is now considered a full band of Shagrath and the current lineup consists of him on rhythm guitar, along with Shady Blue as the vocalist, Mr Damage on lead guitar, and Tony White on drums. The band plays Doomsday hardrock and has, to date, released four albums, Doomsday Rock 'n Roll in 2006, Booze, Broads and Beelzebub in 2008, 3rd Round Knockout in 2011 and Infernal Rock Eternal in 2014.\n",
      "The band has announced that their fifth album, One Last Ride, will be their last.\n",
      "The idea for the band was conceived by Shagrath and Stian Arnesen, then of Dimmu Borgir, in 1999. This consisted of the two musicians jamming after Dimmu Borgir rehearsals. With Shagrath on guitars and Arnesen (or \"Lex Icon\") on drums, they recorded some material, but could take it no further due to their commitments to their other bands. Shagrath later claimed that Dimmu Borgir will always be his priority.\n"
   ],
   "infobox": {
      "Origin": [
         "Oslo, Norway[1]"
      ],
      "Genres": [
         "Biker metal[2][3][4]"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Nuclear Blast"
      ],
      "Associated acts": [
         "Dimmu Borgir, The Kovenant, The Carburetors, Susperia, Old Man's Child, Ragnarok, Ov Hell, Fimbulwinter, Troll, Carpe Tenebrum"
      ],
      "Website": [
         "chromedivision.com"
      ],
      "Members": [
         "Eddie Guz",
         "Mr. Damage",
         "Shagrath",
         "Tony White"
      ],
      "Past members": [
         "Lex Icon",
         "Shady Blue",
         "Ricky Black",
         "Björn Luna",
         "Ogee"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Norway formed in [YEAR] by Shagrath, the lead vocalist of symphonic black metal band Dimmu Borgir. It is now considered a full band of Shagrath and the current lineup consists of him on rhythm guitar, along with Shady Blue as the vocalist, Mr Damage on lead guitar, and [PERSON_NAME_FULL_0_MALE] on drums. The band plays Doomsday hardrock and has, to date, released four albums, Doomsday Rock 'n Roll in [YEAR], Booze, Broads and Beelzebub in [YEAR], 3rd Round Knockout in [YEAR] and Infernal Rock Eternal in [YEAR].\n",
      "The band has announced that their fifth album, One Last Ride, will be their last.\n",
      "The idea for the band was conceived by Shagrath and [PERSON_NAME_FULL_0_MALE], then of Dimmu Borgir, in [YEAR]. This consisted of the two musicians jamming after Dimmu Borgir rehearsals. With Shagrath on guitars and [PERSON_NAME_LAST_0] (or \"Lex Icon\") on drums, they recorded some material, but could take it no further due to their commitments to their other bands. Shagrath later claimed that Dimmu Borgir will always be his priority.\n"
   ]
}