{
   "Name": "The Godz (Ohio band)",
   "Sections": [
      "1 History",
      "2 Discography",
      "3 Members",
      "4 References"
   ],
   "Summary": {
      "text": [
         "The Godz are an American hard rock band from Columbus, Ohio, United States, that formed in 1976.\n"
      ]
   },
   "History": {
      "text": [
         "Formed in 1976, the band conceived their moniker only to later learn of a band from New York City already known as the Godz. A monetary settlement allowed them to keep their name. The Godz did not have a recording contract when they hit the road with Kiss alongside Cheap Trick in 1977. The band released its debut album, The Godz, the next year on Millennium Records. In addition to being on the Kiss Love Gun tour, they played on what was billed as the \"Heaven and Hell Tour\" by embarking on the road with Angel. \"Godz are macho, mean biker boys,\" wrote Sylvie Simmons in 1978. \"Their songs are about dope and bikes and rock and sex. They're loud, brash, crude, but a bloody good rock band.\"[4]\n",
         "In 1979, band's original label, Millennium Records, changed its distribution from Casablanca Records to RCA Records and the Millennium label was subsequently folded altogether. Millennium's parent label, Casablanca Records, picked up the Godz to fulfill their contractual obligation with the band but had no particular enthusiasm for them when their second album, Nothing is Sacred, was released the same year.\n",
         "Whatever the group's merits, the Godz went unappreciated by rock critics; the 1983 Rolling Stone Record Guide described them as a \"Miserable hard-rock quartet from Columbus/Deavertown, Ohio, epitomiz[ing] the most wretched excesses of Seventies rock.\"[5] With little label support, the band toured again with Blue Öyster Cult, Kansas, Iggy Pop, and Judas Priest.\n",
         "By late 1980, suffering from lack of label support and general exhaustion, the original Godz split up, with Eric Moore – a rocker who \"makes wildman Nugent look like Andy Williams\"[4] – remaining as the only constant member, although Mark Chatfield returned at various points. For a few brief times in-and-between the years since 1981, Moore attempted to do away with the \"Godz\" moniker, calling it among other things, The Eric Moore Band. The band's fan base continued to refer to them as \"The Godz.\" As 1982 came to a close, the Godz were all but reforming; and were fully ramped-up and back on the road the next year.\n",
         "The Godz 1985 album, I'll Get You Rockin', a European release on the Heavy Metal America label did quite well, spawning a hit video of the title track in the UK. That year and the next they went on the road with Metallica as they supported their album Master of Puppets on their Damage Inc. Tour with Ozzy Osbourne. This activity was followed by Mongolians in 1987, a domestic release on Grudge Records, featuring revamped versions of several tunes from the previous record. It turned out to be one of the best-selling independent albums of the year.[citation needed]\n",
         "In 1995, three-quarters of the classic Godz lineup reunited for a live concert which was recorded and released as Greatest Hits Live. In 2003, some new Godz material surfaced on the compilation 25 Moore Years.[6]\n",
         "Glen Cataline, nicknamed \"Animal\"[4] and drummer on the first two Godz albums, died on April 14, 2019, at age 67.[7] Eric Moore died on May 17, 2019, after a long battle with bladder cancer.[8] He was also 67. Terry Evans, who was the drummer on the last Godz album, Last of the Outlaws, released in April 2012, died unexpectedly in May 2019 at the age of 55.[9][10]\n"
      ]
   },
   "Discography": {},
   "Members": {},
   "References": {},
   "coreData": [
      "The Godz are an American hard rock band from Columbus, Ohio, United States, that formed in 1976.\n",
      "Formed in 1976, the band conceived their moniker only to later learn of a band from New York City already known as the Godz. A monetary settlement allowed them to keep their name. The Godz did not have a recording contract when they hit the road with Kiss alongside Cheap Trick in 1977. The band released its debut album, The Godz, the next year on Millennium Records. In addition to being on the Kiss Love Gun tour, they played on what was billed as the \"Heaven and Hell Tour\" by embarking on the road with Angel. \"Godz are macho, mean biker boys,\" wrote Sylvie Simmons in 1978. \"Their songs are about dope and bikes and rock and sex. They're loud, brash, crude, but a bloody good rock band.\"[4]\n",
      "In 1979, band's original label, Millennium Records, changed its distribution from Casablanca Records to RCA Records and the Millennium label was subsequently folded altogether. Millennium's parent label, Casablanca Records, picked up the Godz to fulfill their contractual obligation with the band but had no particular enthusiasm for them when their second album, Nothing is Sacred, was released the same year.\n",
      "Whatever the group's merits, the Godz went unappreciated by rock critics; the 1983 Rolling Stone Record Guide described them as a \"Miserable hard-rock quartet from Columbus/Deavertown, Ohio, epitomiz[ing] the most wretched excesses of Seventies rock.\"[5] With little label support, the band toured again with Blue Öyster Cult, Kansas, Iggy Pop, and Judas Priest.\n"
   ],
   "infobox": {
      "Origin": [
         "Columbus, Ohio, United States"
      ],
      "Genres": [
         "Hard rock, classic rock"
      ],
      "Years active": [
         "1976–2019[1]"
      ],
      "Labels": [
         "F-N-A Records, Garddog Records, Ridgeline studios, Casablanca, Grudge, Cobra"
      ],
      "Members": [
         "Mark Carlisle",
         "Jeff Boggs",
         "John Cardillino"
      ],
      "Past members": [
         "Eric Moore (d. 2019)[2]",
         "Bob Goodwin",
         "Mark Chatfield",
         "Glen Cataline (d. 2019)[3]",
         "Matt Mees",
         "Ty Beebe",
         "Eric Mauk",
         "Terry Evans (d. 2019)"
      ]
   }
}