{
   "Name": "The Gone Jackals",
   "Sections": [
      "1 History",
      "2 Band members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Gone Jackals was an American rock band formed by frontman Keith Karloff in 1984 and based in San Francisco, California. Originally named \"Keith Gale's Parallel Universe\", the first lineup consisted of Charlie Hunter, Rudy Maynard and Mark Berdon and played in the local San Francisco club scene. In 1989, after Hunter and Berdon left to pursue other projects, the band was rebranded with the addition of Judd Austin and Trey Sabatelli as \"The Gone Jackals\", releasing their first album Out and About with the Gone Jackals in 1990.\n",
         "The band's music generally consisted of hard, garage and blues rock. Their next album, Bone to Pick (1995) also incorporated heavy metal. The band collaborated with Peter McConnell of LucasArts to produce the soundtrack to the biker-themed adventure game Full Throttle;[1] tracks from Bone to Pick were specifically adapted for this purpose. Blue Pyramid (1998), their third and final album, also included experimentation with psychedelic rock.\n",
         "The band broke up in 1999, though not before signing up a new label for distributing their music in Europe.[2] In late 2001, Karloff started working on a new musical project. Led by his passion for the old style rock music, he formed the Bonedrivers,[3] a blues rock power trio which has since then toured the United States and published a locally acclaimed debut album named Roadhouse Manifesto, an even bigger second outing titled Mobile, and a third one titled Greasefire.\n"
      ]
   },
   "History": {
      "text": [
         "The Gone Jackals were founded during the late 1980s by multi-instrumentalist Keith Karloff, a drummer, guitarist and songwriter who used to play as a solo artist in New York City since the early 1980s, under the stage name \"Keith Gale\".\n",
         "After moving to San Francisco in 1984, Karloff begun to search for supporting musicians to form a new band. Bassist Rudy Maynard and guitarist virtuoso Charlie Hunter were the first to join him. In addition to them, drummer Mark Berdon came to complete the line-up. Together they formed a band called \"Keith Gale's Parallel Universe\" and started to play regularly at local clubs. Soon, they signed to Blue/Black Records and released their first EP, a promo cassette named Five Piece Screwdriver Set.\n",
         "In the subsequent years, Charlie Hunter decided to leave the band and was replaced by rock guitarist Judd Austin. After a while, Mark Berdon left the band too. Drummer Trey Sabatelli came in his place and with the strength of this new line-up, Keith Karloff managed to give birth to \"The Gone Jackals\", the final incarnation of the band. It was then that \"Keith Gale\" decided to change his name to \"Keith Karloff\".\n",
         "In 1990, The Gone Jackals released their official debut album, Out and About with the Gone Jackals. The songs were a mix of classical sounds and styles of rock music, and had a moderate success on independent radio stations throughout California and Washington state. Following the release of the album, The Gone Jackals began to tour the state of California from town to town.\n",
         "Their second full-length album, Bone to Pick, was published in 1995. Its songs were chosen by Peter McConnell, music director of the LucasArts team, to be featured as the soundtrack of the new video game they were working on, Full Throttle. Keith Karloff also helped McConnell to compose some original tracks for the game. \nThanks to Full Throttle, Bone to Pick became the most famous and acclaimed album of the band, even gaining considerable attention outside of the United States. It sold hundreds of thousands of copies worldwide, and its great success induced Blue/Black Records to produce a new run of Out and About with the Gone Jackals, the band's previous album.\n",
         "In 1998 a third album came out. It was called Blue Pyramid and was the band's most ambitious project. With this album, Karloff consolidated his American-style hard rock attitude while trying to experiment in a few new directions, such as psychedelia. Some of the songs from the album received radio airplay in various national stations, while the band promoted Blue Pyramid with a new tour that brought them from Texas to South Carolina, as well as all over California.\n",
         "During the year 1999, The Gone Jackals signed to the international record label Raspberry Records, with the intent of publicizing and distributing their music in Europe. Raspberry Records provided to re-release all of their albums, in addition to two previously unreleased singles, the song Faith Healer (which is a cover of the famous Alex Harvey Band's hit) and a re-edited version of No Sign of Rain (an original audio track from Blue Pyramid).\n"
      ]
   },
   "Band members": {},
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Gone Jackals was an American rock band formed by frontman Keith Karloff in 1984 and based in San Francisco, California. Originally named \"Keith Gale's Parallel Universe\", the first lineup consisted of Charlie Hunter, Rudy Maynard and Mark Berdon and played in the local San Francisco club scene. In 1989, after Hunter and Berdon left to pursue other projects, the band was rebranded with the addition of Judd Austin and Trey Sabatelli as \"The Gone Jackals\", releasing their first album Out and About with the Gone Jackals in 1990.\n",
      "The band's music generally consisted of hard, garage and blues rock. Their next album, Bone to Pick (1995) also incorporated heavy metal. The band collaborated with Peter McConnell of LucasArts to produce the soundtrack to the biker-themed adventure game Full Throttle;[1] tracks from Bone to Pick were specifically adapted for this purpose. Blue Pyramid (1998), their third and final album, also included experimentation with psychedelic rock.\n",
      "The band broke up in 1999, though not before signing up a new label for distributing their music in Europe.[2] In late 2001, Karloff started working on a new musical project. Led by his passion for the old style rock music, he formed the Bonedrivers,[3] a blues rock power trio which has since then toured the United States and published a locally acclaimed debut album named Roadhouse Manifesto, an even bigger second outing titled Mobile, and a third one titled Greasefire.\n",
      "The Gone Jackals were founded during the late 1980s by multi-instrumentalist Keith Karloff, a drummer, guitarist and songwriter who used to play as a solo artist in New York City since the early 1980s, under the stage name \"Keith Gale\".\n"
   ]
}