{
   "Name": "The Gone Jackals",
   "rawData": [
      "The Gone Jackals was an American rock band formed by frontman Keith Karloff in 1984 and based in San Francisco, California. Originally named \"Keith Gale's Parallel Universe\", the first lineup consisted of Charlie Hunter, Rudy Maynard and Mark Berdon and played in the local San Francisco club scene. In 1989, after Hunter and Berdon left to pursue other projects, the band was rebranded with the addition of Judd Austin and Trey Sabatelli as \"The Gone Jackals\", releasing their first album Out and About with the Gone Jackals in 1990.\n",
      "The band's music generally consisted of hard, garage and blues rock. Their next album, Bone to Pick (1995) also incorporated heavy metal. The band collaborated with Peter McConnell of LucasArts to produce the soundtrack to the biker-themed adventure game Full Throttle; tracks from Bone to Pick were specifically adapted for this purpose. Blue Pyramid (1998), their third and final album, also included experimentation with psychedelic rock.\n",
      "The band broke up in 1999, though not before signing up a new label for distributing their music in Europe. In late 2001, Karloff started working on a new musical project. Led by his passion for the old style rock music, he formed the Bonedrivers, a blues rock power trio which has since then toured the United States and published a locally acclaimed debut album named Roadhouse Manifesto, an even bigger second outing titled Mobile, and a third one titled Greasefire.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Hard rock, psychedelic rock, rock and roll, heavy metal, garage rock"
      ],
      "Years active": [
         "1984–1999"
      ],
      "Labels": [
         "Blue/Black Records",
         "ConTon Records",
         "Raspberry Records"
      ],
      "Associated acts": [
         "Tower of Power, Jefferson Starship, The Tubes, Missing Man Formation, The Bonedrivers"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Keith Karloff",
         "Judd Austin",
         "Rudy D. Maynard",
         "Trey Sabatelli"
      ],
      "Past members": [
         "Charlie Hunter",
         "Mark Berdon",
         "Johnny Gale"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band formed by frontman [PERSON_NAME_FIRST_0] Karloff in [YEAR] and based in [PERSON_NAME_FULL_1_FEMALE], California. Originally named \"[PERSON_NAME_FULL_0_MALE]'s Parallel Universe\", the first lineup consisted of Charlie Hunter, Rudy [MONTH]nard and [MONTH]k Berdon and played in the local [PERSON_NAME_FULL_1_FEMALE] club scene. In [YEAR], after Hunter and Berdon left to pursue other projects, the band was rebranded with the addition of Judd Austin and Trey Sabatelli as \"[BAND_NAME]\", releasing their first album Out and About with the Gone Jackals in [YEAR].\n",
      "The band's music generally consisted of hard, garage and blues rock. Their next album, Bone to Pick ([YEAR]) also incorporated heavy metal. The band collaborated with Peter McConnell of LucasArts to produce the soundtrack to the biker-themed adventure game Full Throttle; tracks from Bone to Pick were specifically adapted for this purpose. Blue Pyramid ([YEAR]), their third and final album, also included experimentation with psychedelic rock.\n",
      "The band broke up in [YEAR], though not before signing up a new label for distributing their music in Europe. In late [YEAR], Karloff started working on a new musical project. Led by his passion for the old style rock music, he formed the Bonedrivers, a blues rock power trio which has since then toured the United States and published a locally acclaimed debut album named Roadhouse Manifesto, an even bigger second outing titled Mobile, and a third one titled Greasefire.\n"
   ]
}