{
   "Name": "Kïll Cheerleadër",
   "rawData": [
      "Kill Cheerleader (previously known as Cheerleader 666) was a rock band whose members formed in 1999 in Toronto, Ontario, Canada . Mainly influenced by punk rock and heavy metal acts such as The Stooges, early era Guns N' Roses, Mötley Crüe, Iron Maiden, the Ramones, Girlschool, Joan Jett and Neil Young, they had crafted their own unique, sleazy style of rock 'n' roll, once being described as \"a derailed train hitting a Baptist Church\". Lemmy from Motörhead described Kill Cheerleader as the \"greatest rock n' roll band since Guns N' Roses.\"\n",
      "The original members of the group were childhood friends who learned their instruments practicing old Guns N' Roses, The Stooges and Mötley Crüe songs. A band member reportedly said that the name came from miserable high school experiences, saying, \"beat up the jocks and kill the cheerleaders\". They started off playing shows in Toronto but were soon banned from clubs for their on and off stage antics. They started playing shows in Southern California after being invited by Chris Squire to open dates for his garage punk group, The Tori Cobras. During this tour Squire introduced the band to professional skateboarder, Kris Markovich, landing Kill Cheerleader the opening music track in Markovich's \"Hollywood Skateboards\" video. After this tour the band became popular among hardcore skateboarders and so-cal punk rockers.\n",
      "After some 8000 demo CDs were sold, a German record label licensed one of their unmixed/unmastered recordings and released it as 7 track LP titled Gutter Days which was rereleased on 10\" vinyl in 2003. One reviewer called it \"the greatest punk n' roll recording ever made... completely redefined excellence in that genre... I am shaken...\" (House of Smut). Ky Anto, lead guitarist for Robin Black once called them \"The sound of desperation\"... Nikki Sixx of Mötley Crüe called them the \"best new band\" in his online journal. SPIN Magazine journalists wrote how they were \"blown away\" about their live show, and Alternative Press has called them a \"band to watch.\"  Rock legend Lemmy from Motörhead invited them to open their UK tour  and talked about them on SuicideGirls.com and in Playboy, declaring Kïll Cheerleadër as the \"greatest rock n' roll band since Guns N' Roses.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Toronto, Ontario, Canada"
      ],
      "Genres": [
         "Sleaze metal,[1] biker metal[2]"
      ],
      "Years active": [
         "1999–2006"
      ],
      "Labels": [
         "Spinerazor Records ",
         " Sonico Records ",
         " Corporate Punishment"
      ],
      "Associated acts": [
         "Crystal Castles, Goat Horn, Die Mannequin, Darlings of Chelsea"
      ],
      "Past members": [
         "Chad \"Dallas\" MacKinnon ",
         " Christopher \"Rites\" Chartrand ",
         " Ethan Deth ",
         " Jason Decay ",
         " Anthony Useless ",
         " Zach \"Jakki\" Slaughter ",
         " Jimmy Nova ",
         " Brandon Wars"
      ]
   }
}