{
   "Name": "Kylesa",
   "rawData": [
      "Kylesa is an American heavy metal band that was formed in Savannah, Georgia. Their music incorporates experimentalism with heavy riffs, drop-tuned guitars and elements of psychedelic rock. The group was established in 2001 by the former members of Damad, with the addition of guitar player Laura Pleasants who is from North Carolina. The band has since undergone line up changes; the remaining original members are Phillip Cope and Laura Pleasants. In 2006, the band added two drummers (Carl McGinley of Unpersons, from Savannah, and Jeff Porter). Eric Hernandez (of Capsule, from Miami) joined in 2008 to replace Porter. The dual drum tracks are often panned strongly to the right and left.\n",
      "On April 28, 2016, the band announced in a Facebook post that they would be going on an indefinite hiatus, stating, \"We have collectively decided to take a hiatus with no set date to reconvene.\"\n",
      "Kylesa is a metal group that borrows elements of hardcore punk, psychedelic rock, stoner rock, sludge metal, and speed metal. They have two singers, Phillip and Laura. Kylesa formed in Savannah in 2001, taking their name from \"kilesa mara\", a Buddhist term denoting delusory mental states.\n"
   ],
   "infobox": {
      "Origin": [
         "Savannah, Georgia, United States"
      ],
      "Genres": [
         "Sludge metal[1][2]",
         "heavy metal[3]",
         "stoner rock[4]",
         "biker metal[5]"
      ],
      "Years active": [
         "2001–2016 (indefinite hiatus)"
      ],
      "Labels": [
         "Season of Mist, Prosthetic, Havoc, Prank, 20 Buck Spin, La Familia, Alternative Tentacles, Retro Futurist"
      ],
      "Website": [
         "www.kylesa.com"
      ],
      "Members": [
         "Phillip Cope",
         "Laura Pleasants",
         "Carl McGinley"
      ],
      "Past members": [
         "Eric Hernandez  ",
         "Chase Rudseal ",
         "Jeff Porter",
         "Brandon Baltzley",
         "Christian Depken",
         "Brian Duke",
         "Corey Barhorst",
         "Tyler Newberry"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band that was formed in Savannah, Georgia. Their music incorporates experimentalism with heavy riffs, drop-tuned guitars and elements of psychedelic rock. The group was established in [YEAR] by the former members of Damad, with the addition of guitar player [PERSON_NAME_FULL_2_FEMALE] who is from North Carolina. The band has since undergone line up changes; the remaining original members are Phillip Cope and [PERSON_NAME_FULL_2_FEMALE]. In [YEAR], the band added two drummers ([PERSON_NAME_FULL_1_MALE] of Unpersons, from Savannah, and Jeff Porter). [PERSON_NAME_FULL_0_MALE] (of Capsule, from Miami) joined in [YEAR] to replace Porter. The dual drum tracks are often panned strongly to the right and left.\n",
      "On [MONTH] 28, [YEAR], the band announced in a [GENRE] an indefinite hiatus, stating, \"We have collectively decided to take a hiatus with no set date to reconvene.\"\n",
      "[BAND_NAME] is a metal group that borrows elements of hardcore punk, psychedelic rock, stoner rock, sludge metal, and speed metal. They have two singers, Phillip and Laura. [BAND_NAME] formed in Savannah in [YEAR], taking their name from \"kilesa mara\", a Buddhist term denoting delusory mental states.\n"
   ]
}