{
   "Achievements and awards": {
      "text": [
         "They have played over a thousand performances on three continents.[7] In 2010, Malignant Tumour's Earthshaker won the Anděl Award for Album of the Year in the category of Hard&Heavy. In 2008 the band won the Břitva Czech music polls for album of the year, thanks to their third album In Full Swing,[8] and Břitva Czech music polls in 2008 as live band of the year[8] and in 2010 music video Earthshaker won as music video of the year.[9]\n"
      ]
   },
   "Discography": {
      "Albums": {
         "full": {},
         "split": {}
      },
      "Demos": {},
      "EP": {
         "full": {},
         "split": {}
      }
   },
   "History": {
      "1991–1997: Formative years": {
         "text": [
            "Malignant Tumour was formed in Ostrava, Czech Republic, in the fall of 1991, by Martin \"Bilos\" Bílek and Roman Restel, at the ages of fifteen and fourteen, respectively.[1]\nDuring the first few years of the band the members would constantly changed instrument, and became labelled as noisecore.\n",
            "When drummer Libor Šmakal entered the band in 1992, their style changed to be more influenced by the work of the British grindcore band Carcass.[2] In this line-up they recorded their early demo tapes Cadaveric Incubator of Endo-Parasites (in 1993), Symphonies for Pathologist (in 1994) and Analyse of Pathological Conceptions (in 1995). In late 1995, Šmakal was replaced by Michal \"Cichoň\" Cichý, leading to Restel departing from the band, being replaced by Otto Beran and the band releasing a split EP with Decomposed titled Malignus Morbus with Decomposed and then three the next year with Immured, Mastic Scum and In Growning called Forensic Clinicism – The Sanguine Article, Sick Sinus Syndrome and Swarming of Virulency.\n",
            "In 1997, the band released a compilation split EP entitled Hungry Urinary Urn with Negligent Collateral Collapse, C.S.S.O. and Catasexual Urge Motivation and released their split LP Eat the Flesh...and Vomica with Squash Bowels. After the recording the album, Cichý and Beran left the band to focus on their other projects Cerebral Turbulency and Needful Things.\n"
         ]
      },
      "1997–2001: \"Equality!?\"": {
         "text": [
            "In 1997, Marek \"Švejk\" Pavlík was hired to play drums, just as Bílek took over bass duties (leading to Richard Chrobok being hired as the band's guitarist). Lyrics changed from pathological topics to socially aware ones, opposing homophobia, inequality, racism and world slavery.[3] The band then recorded the demo tape Killing for Profit in 1997 and split EPs Rock Stars – Money Wars with Dead Infection, and Murder for you to Eat with Vomito in 1998. Followed by a split LP Is this the Earth´s Last Century? with Alienation Mental and their first solo EP called Equality!? also in 1998. At the end of the same year, drummer  Marek \"Švejk\" Pavlík left the band and Michal \"Cichoň\" Cichý returned.\n",
            "The band a split tape, under this line-up, with Agathocles, Abortion and Din-Addict. Cichý was soon replaced by  Michal \"Kameň\" Kaminsky, before Chrobok also departed in mid-2000, being replaced by Marek Marunič. The band then recorded and released two split EPs Man made the End with Agathocles and Get to Attack with Unholy Grave. After disagreements began with Marunič, he left the band and Bílek took over guitar once more, picking up Petr \"Dino\" Šarina as their new bass player, who only lasted a few performances.\n"
         ]
      },
      "2001–2003: Relocation to the Netherlands and \"Dawn of the New Age\"": {
         "text": [
            "Bílek relocated from the Czech republic to the Netherlands, in which an entirely new line-up was formed, including brothers Johan and Jelle Smits on drums and bass, respectively. This line-up released the split EP Oegstgeest Grindcore with Intumescence in 2002, double split EP In Oil We Trust with Critical Madness, Szargyerek and Anubis and the band's first full-length LP Dawn of the New Age in 2003. However Bílek returned home to Ostrava, Czech Republic in mid-2003.\n"
         ]
      },
      "2003–2007: \"Burninhell\"": {
         "text": [
            "In mid-2003, Robert \"Šimek\" Šimek become the band's new bass player, having left his previous band Cerebral Turbulency, just as drummer Martin „Marsel“ Ondejka joined. With this new line-up the music was slowly evolved from raw crust punk to a dirtier rock and roll style with a crusty edge, evident on the band's next split EP Hammer and Anvil with Lycathrophy from 2004. In summer 2004 Martin \"Marsel\" Ondejka departed without notice, being replaced by drummer David Ševčík, who has also worked with bands such as Dysentry and Večírek. The band then built upon this \"crust´n´roll\" style on their second full-length album Burninhell released in 2005, the album was rated as the third best album of the year in the Břitva music awards. On this album guitarist Martin \"Korál\" Vyorálek made a guest appearance, having played in both Erebus and GG Pump, officially joining later that year. Together the band, recorded their next split LP, entitled Rock´n´Roll Engine in 2006, with Gurkha. This split got again very good reviews and wound up as the third best mini-album of the year, according to the Břitva music awards.\n"
         ]
      },
      "2007–2012: \"In Full Swing\" and \"Earthshaker\"": {
         "text": [
            "In the Summer of 2008, the band´s next album In Full Swing was released, which lead the band to become compared to Motörhead by press and fans, however the band disregards these statements, taking them as a compliment.[4] The album was rated very high by reviewers[5] and was nominated as album of the year in the Czech Anděl Music Awards in the category of Hard&Heavy, and wound up at the second spot, after winner První Hoře. Two years later, the band recorded in the German recording studio Stage One, for their next album called Earthshaker, this was their first time with a professional producer, being Andy Classen. The album was received moderate to good reviews, leading to the band winning the album of the year in Anděl Award in Hard&Heavy category in 2010 and wound up second in Břitva.\n"
         ]
      },
      "2012-present: \"Overdose&Overdrive\" and \"The Metallist\"": {
         "text": [
            "In December 2012 drummer David Ševčík left the band and his place was taken over by Petr \"Bohdič\" Bohda, who had previously worked with bands including El Ray, GG Pump, Erebus, Citron, Pouze Znouze and Nagauč. In early 2013, the band entered Stage One Studio, once again, to record their next album Overdose&Overdrive again with Andy Classen as producer.[6]\n"
         ]
      }
   },
   "Members": {
      "Current line-up": {},
      "Past members": {},
      "Timeline": {}
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 1991–1997: Formative years",
      "1.2 1997–2001: \"Equality!?\"",
      "1.3 2001–2003: Relocation to the Netherlands and \"Dawn of the New Age\"",
      "1.4 2003–2007: \"Burninhell\"",
      "1.5 2007–2012: \"In Full Swing\" and \"Earthshaker\"",
      "1.6 2012-present: \"Overdose&Overdrive\" and \"The Metallist\"",
      "2 Members",
      "2.1 Current line-up",
      "2.2 Past members",
      "2.3 Timeline",
      "3 Discography",
      "3.1 Albums",
      "3.1.1 full",
      "3.1.2 split",
      "3.2 EP",
      "3.2.1 full",
      "3.2.2 split",
      "3.3 Demos",
      "4 Videography",
      "4.1 Videoclips",
      "4.2 Live videoclips",
      "4.3 DVD",
      "4.4 Others",
      "5 Achievements and awards",
      "6 References"
   ],
   "Summary": {
      "text": [
         "Malignant Tumour is a Czech rock band formed in 1991 in Ostrava.\n"
      ]
   },
   "Title": "Malignant Tumour - Wikipedia",
   "Videography": {
      "DVD": {},
      "Live videoclips": {},
      "Others": {},
      "Videoclips": {}
   }
}