{
   "Name": "The Obsessed",
   "rawData": [
      "The Obsessed is an American heavy metal band from Potomac, Maryland, led by Scott \"Wino\" Weinrich. The band combines elements of doom metal, stoner rock, and punk rock. Formed in 1980, they recorded a few demos and played a handful of live shows until they first split up in 1986 when Weinrich joined as lead vocalist for Saint Vitus, but reformed four years later. After releasing three albums (including the one that was originally recorded in 1985), the Obsessed broke up for a second time in 1995. After briefly reuniting for some shows in 2012 and 2013, the Obsessed announced their third reunion in March 2016.\n",
      "The band formed originally under the name Warhorse in 1976 in Potomac, Maryland, led by Wino. In the late 1970s they became known as the Obsessed. Later on the group moved into a band house in Rockville, Maryland, where some of their most creative and hardest music was written. Before this move, however, original guitar player John Reese departed from the band. The band became a trio and remained that way until 1982 when Vance Bockis and later Norman Lawson joined the band. During this time they released the Sodden Jackal EP (Spring 1983) and had one track (\"Concrete Cancer\") featured on Metal Blade's Metal Massacre VI. The Obsessed also managed to record their debut album in 1985 for Metal Blade, but it never officially surfaced.\n",
      "The band broke up in the late 1980s and Wino went west to California to join up with Saint Vitus. Wino recorded three albums, an EP, and a live album with Saint Vitus. Hellhound Records (Vitus's then current label) released The Obsessed, an album that the Obsessed had recorded in 1985, which prompted Wino to leave Vitus and reform the Obsessed with a new rhythm section consisting of Scott Reeder and Greg Rogers. The band was quickly signed to Hellhound Records and soon released Lunar Womb. Scott Reeder later left to join Kyuss, whereupon he was replaced by Guy Pinhas. After the addition of Pinhas, the Obsessed signed with Columbia Records, through which they released their third album The Church Within to strong critical reviews. To promote The Church Within, the band toured as an opening act for Entombed and Unsane during the first part of 1994. Despite the tour, as well as a large amount of promotion on behalf of Columbia Records (including a 25-minute documentary on the history of the Obsessed), the album did not sell as well as expected. After the demise of the Obsessed, Wino went on to form Shine which changed name to Spirit Caravan and more projects before reuniting with Saint Vitus in 2003 (and again in 2008), while the Obsessed's rhythm section became the basis for Goatsnake.\n"
   ],
   "infobox": {
      "Also known as": [
         "Warhorse (1976–1980)"
      ],
      "Origin": [
         "Potomac, Maryland, U.S."
      ],
      "Genres": [
         "Heavy metal",
         "doom metal",
         "stoner rock"
      ],
      "Years active": [
         "1976–1986",
         "1990–1995",
         "2016–present"
      ],
      "Labels": [
         "Hellhound",
         "Columbia",
         "Southern Lord",
         "MeteorCity",
         "Tolotta",
         "Relapse"
      ],
      "Associated acts": [
         "Shine",
         "Spirit Caravan",
         "Saint Vitus",
         "The Hidden Hand",
         "Goatsnake",
         "Kyuss",
         "Melvins",
         "Acid King"
      ],
      "Members": [
         "Scott \"Wino\" Weinrich",
         "Brian Costantino"
      ],
      "Past members": [
         "Mark Laue",
         "Dave Williams",
         "Ed Gulli",
         "Scott Reeder",
         "Greg Rogers",
         "Guy Pinhas",
         "Dave Sherman",
         "John Reese"
      ]
   }
}