{
   "Name": "My Sister's Machine",
   "rawData": [
      "My Sister's Machine was an American rock band from Seattle, Washington, formed in 1989. Its members were Nick Pollock (lead vocals, guitar), Owen Wright (guitar), Chris Ivanovich (bass guitar), and Chris Gohde (drums).\n",
      "This band recorded and released two albums, Diva and Wallflower, before they broke up in 1994. They reunited in 2010 to headline the Layne Staley Tribute and Benefit Concert that year as Pollock had previously played guitar in an early incarnation of Alice in Chains, the glam metal band Alice N' Chains that also included Staley.\n",
      "Before the formation of My Sister's Machine, guitarist Owen Wright and drummer Chris Gohde were involved in a band called Mistrust in 1984; this band also included former Culprit singer Jeff L'Heureux. They recorded one album called Spin the World, which was released on CD in 2009 by Heart of Steel Records. This band did an extensive amount of touring before they broke up in 1988.\n"
   ],
   "infobox": {
      "Origin": [
         "Seattle, Washington, U.S."
      ],
      "Genres": [
         "Hard rock",
         "grunge[1][2]",
         "heavy metal",
         "alternative metal[3]"
      ],
      "Years active": [
         "1989 (1989)–1994",
         "2010–2011"
      ],
      "Labels": [
         "Caroline",
         "Chameleons",
         "Elektra"
      ],
      "Associated acts": [
         "Mistrust",
         "Sleze",
         "Alice N' Chains",
         "Tanks of Zen",
         "Soulbender"
      ],
      "Past members": [
         "Chris Gohde",
         "Chris Ivanovich",
         "Nick Pollock",
         "Owen Wright"
      ]
   },
   "albums": [
      "Diva",
      "Wallflower"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Seattle, Washington, formed in [YEAR]. Its members were Nick Pollock (lead vocals, guitar), [PERSON_NAME_FULL_2_MALE] (guitar), [PERSON_NAME_FULL_0_MALE] (bass guitar), and [PERSON_NAME_FIRST_0] [PERSON_NAME_LAST_1] (drums).\n",
      "This band recorded and released two albums, Diva and Wallflower, before they broke up in [YEAR]. They reunited in [YEAR] to headline the Layne Staley Tribute and Benefit Concert that year as Pollock had previously played guitar in an [GENRE] band Alice N' Chains that also included Staley.\n",
      "Before the formation of [BAND_NAME], guitarist Owen Wright and drummer [PERSON_NAME_FULL_0_MALE] were involved in a band called Mistrust in [YEAR]; this band also included former Culprit singer Jeff L'Heureux. They recorded one album called Spin the World, which was released on CD in [YEAR] by Heart of Steel Records. This band did an extensive amount of touring before they broke up in [YEAR].\n"
   ]
}