{
   "Name": "Sea Hags",
   "rawData": [
      "Sea Hags was an American hard rock band from San Francisco, California, United States. Their style has primarily been referred to as motorcycle rock and sleaze metal.\n",
      "Sea Hags formed in San Francisco in 1985 by frontman Ron Yocom, and bassist Chris Schlosshardt. During the three years before they had the chance to record a major label debut album, they often worked two jobs to keep their dreams of a music career alive. During the band's early years they played gigs with bands such as Dead Kennedys, Motörhead, the Ramones, and The Cramps. They were signed to Chrysalis Records in December 1987.\n",
      "Kirk Hammett, the guitarist of Metallica, co-produced their first demos with Sylvia Massy, who went on to produce two releases by progressive rock band Tool.  Ian Astbury of The Cult offered to produce their debut. Finally Mike Clink, who had just finished producing Guns N' Roses' Appetite for Destruction was enlisted by the group as producer. Guitarist Frank Wilsey, who had recently left the San Francisco band Head On, joined in November 1988, shortly before the band started to record their eponymous debut for Chrysalis with Clink. Drummer Greg Langston also gave way during this period to Adam Maples. Kevin Russell, a musician who had performed on Ted Nugent's Penetrator, contributed additional guitar to the recording. Before finishing the album, the band wrote the track \"Under The Night Stars\" for the movie A Nightmare on Elm Street 4: The Dream Master.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Glam metal, heavy metal, hard rock[1]"
      ],
      "Years active": [
         "1985–1990"
      ],
      "Labels": [
         "Chrysalis"
      ],
      "Associated acts": [
         "Beast, Head On, Legal Weapon, Arcade, The Power of 3, L.A. Guns"
      ],
      "Past members": [
         "Ron Yocom",
         "Chris Schlosshardt",
         "Greg Langston",
         "Frank Wilsey",
         "Adam Maples"
      ]
   },
   "albums": [
      "Sea Hags"
   ]
}