{
   "Name": "The Accidentals",
   "Sections": [
      "1 History",
      "1.1 2011–2012: Beginnings and Tangled Red and Blue",
      "1.2 2013–2015: Bittersweet and national reception",
      "1.3 2016: Parking Lot EP",
      "1.4 2017–2018: Sony Masterworks and Odyssey",
      "1.5 2019–present: Audiotree Live and Live",
      "2 Musical style and development",
      "3 Influences",
      "4 Members",
      "5 Discography",
      "5.1 Albums",
      "5.2 EPs",
      "5.3 Live albums",
      "6 Filmography",
      "7 Awards and nominations",
      "8 References",
      "9 External links"
   ],
   "Summary": {
      "text": [
         "The Accidentals are an American band, formed in Traverse City, Michigan in 2012 by Sav Buist and Katie Larson. The group features an eclectic blend of indie folk, pop, bluegrass, rock, classical, and other genres. They have released three full-length albums, one EP, and two live albums.\n"
      ]
   },
   "History": {
      "2011–2012: Beginnings and Tangled Red and Blue": {
         "text": [
            "Larson and Buist met as young musicians in 2011 at their public high school in Traverse City, Michigan.[1] Larson, then 15, was a freshman cello player, and Buist, then 16, was a sophomore who played violin, and they teamed up for a class orchestra project.[2] In 2012, they auditioned for and won a spot in the first-ever singer-songwriter major at the renowned Interlochen Center for the Arts high school, where they formally created The Accidentals.[3]\n",
            "In an interview with Post Independent, Larson described the formation of the band:\n",
            "We didn't really start interacting with each other until I was 15 and Savannah was 16. Our orchestra instructor asked for volunteers to play an event. Savannah and I were the only two people who raised our hands.[4]",
            "Larson had visited Buist's house to discuss their impending project, during which time Larson had played a song on Buist's guitar that she hadn't played for anyone prior to their meeting. From that moment on, they were in a band.\n",
            "Of the band's name origins, the band have stated in radio interviews that they had decided on \"The Accidentals\" because of the accidental note in music, which is denoted by a pitch that is not a member of the scale or mode that is specified by the most recently applied key signature, and the coincidental qualities behind its relation to their meeting each other by chance.[5]\n",
            "On May 21, 2012, the Accidentals released their self-produced debut full-length album, Tangled Red and Blue. The album features 13 tracks ranging across a spectrum of contemporary folk sounds and was met with strong local reception upon its release. Their eclectic use of instruments, such as the kazoo on \"The Band-Aid Song\", and the tackling of potent themes such as sexism, female stereotypes, and feminism on \"Enlightened Sexism\" and \"Jargon\", had garnered Larson and Buist their first taste of local acclaim.\n",
            "On \"Enlightened Sexism\", the band had released the following statement:\n",
            "We try to write unique songs that people can relate too or get something from. We tend to have catchy, happy melodies that tell a deeper story or relay a message. It's like when you are joking with somebody, but you really mean it. For example, one of our songs, Enlightened Sexism, was inspired by a book analyzing sexism in modern pop culture. It is about resisting stereotypes and media pressure to look a certain way. The message is simple. Beautiful doesn't come in a bottle, nor does self worth. We are all diverse and that is beautiful. We should learn to accept and appreciate one another for our differences.[6]",
            "Prior to their meeting, Larson and Buist were budding singer-songwriters and instrumentalists. Larson had developed a music video for a demo of her original song \"The Temptation of St. Anthony\" as her senior year stop-motion animation project. The song is based on the Salvador Dalí painting of the same name, and is currently available to be viewed on her Facebook fan page.[7] Similarly, many of Buist's pre-Accidentals works can be heard on her SoundCloud page.[8]\n",
            "On their official website, it had been noted that, between 2012 and 2013, the Accidentals had performed more than 500 live shows while Larson and Buist had maintained a 3.9+ GPA.\n"
         ]
      },
      "2013–2015: Bittersweet and national reception": {
         "text": [
            "On April 9, 2013, the Accidentals opened a Kickstarter campaign in an attempt to fund their sophomore album, Bittersweet, offering signed versions of the album, behind-the-scenes footage, backstage meet-and-greets, and an exclusive song titled \"Family Tree\" for backers of various pledge levels. Less than one month later, on May 6, 2013, the Accidentals successfully funded the album.[9]\n",
            "Released on June 17, 2013, Bittersweet was co-produced by Buist, Larson, and a slew of producers from across Michigan, Nashville, Tennessee, and Bloomington, Indiana. Most notably, war-themed closing track \"Blessed\" was produced and mixed in Bloomington by Zero Boys' Paul Mahern, who had previously worked with the likes of Willie Nelson and John Mellencamp.[10]\n",
            "Increased production values and stronger songwriting developments brought the band a broader acclaim than their previous, fully self-produced work in Bittersweet, garnering the attention of multiple publications. Yahoo! Voices journalist Jonathan Frahm was among the first to note the band as genre-benders, stating that \"They're the best folk/jazz/bluegrass/classical/alternative band out there today,\" and \"one of the most ground-breaking musical experiences one might just have in a lifetime.\"[11]\n",
            "During this period of time, the Accidentals collaborated with multiple local artists on the development of their own releases, including engineering, production, and performance credits on Olivia Mainville's Full Steam Ahead and string section and harmony credits on the Way Down Wanderers' single, \"Dead Birds\".[12][13] They also contributed music to independent films One Simple Question[14] and Please Wait To Be Seated[15] in 2013 and 2015, respectively, and contributed five songs from Tangled Red and Blue to Right Brain Brewery mini-documentary Hops.[16] Songs \"The Silence\" and \"Golden Lantern\" were used in local commercials for Shanty Creek Resorts and Makers Market, respectively.[13]\n",
            "Throughout 2013 and 2014, the duo had also kept busy gaining renown by opening for artists such as Brandi Carlile, Andrew Bird, Dar Williams, Ladysmith Black Mambazo, Sixto Rodriguez (Sugar Man), The Duhks, Aunt Martha, Rosco Bandana, and Lauren Mann.[17]\n",
            "Music videos for the songs \"Lemons in Chamomile\" and \"City of Cardboard\" from Bittersweet have been released on the band's official YouTube page. Their most viewed music video during this time was an acoustic rendition of Buist's folk-pop song \"Epitaphs\".[18]\n",
            "Taking advantage of the steam garnering behind their latest effort, the band pushed single \"The Silence\" onto ReverbNation following a slew of shows across Michigan and the east coast between 2013 and 2014, eventually garnering the attention of musician Marshall Crenshaw and record producer Stewart Lerman in 2015.[19] In 2014, the band had hired Novi, Michigan-hailing new wave multi-instrumentalist and Treeskin[20] artist Michael Dause as their full-time percussionist.[15]\n",
            "In early 2015, the Accidentals took to Indiegogo to fund their first-ever national tour: the \"MAKING IT HAPPEN!\" U.S. Tour, which had been successfully funded on March 20, 2015.[21] The band toured through cities such as Chicago, Illinois, Cave Creek, Arizona, San Diego, California, and Salt Lake City, Utah, with notable tour dates at South by Southwest (SXSW) 2015 and with the Traverse Symphony Orchestra in March and April, respectively.[22][23]\n",
            "It was during the \"MAKING IT HAPPEN!\" tour that the band was popularly received as one of SXSW's seven breakout acts out of some 2,200 acts, according to Billboard.[23] During the same tour, the Accidentals had also performed alongside Ben Sollee at Chicago's City Winery[24] and The Wailers at Grand Rapids venue the Orbit Room.[25] They also had their first headlining show at renowned folk music venue The Ark on June 7, 2015, following the tour,[26] as well as at Electric Forest and Blissfest's respective 2015 iterations.[27]\n",
            "On August 25, 2015, Marshall Crenshaw joined the Accidentals for their first-ever live joint performance during the final Tuesday Evening Music Club show of the summer at Meijer Gardens. Post-show, Crenshaw praised a \"precocious\" Accidentals for their engaging live technique, saying in a statement to Local Spins, \"They're killer. They go out there with the instinct of a killer. It was really something.\"[28]\n"
         ]
      },
      "2016: Parking Lot EP": {
         "text": [
            "The band announced that they had opted to continue independently releasing their music after their contract with Crenshaw and Lerman had become renegotiable.[2] The band released two new singles, \"Parking Lot\" and \"Michigan and Again\" for a \"name your price\" option via their official Bandcamp page.[29] Each release was accompanied by a music video, with the \"Michigan and Again\" video becoming their most popular to date, with over a quarter million views on Facebook and YouTube within 10 days of its release and reaching No. 2 on Reddit's Indie Folk chart.[30][31] The Accidentals later spoke with NPR on its Weekend Edition, during which Buist detailed the developmental process of \"Michigan and Again\", which began after a recommendation from a friend of the band to write a song about their home state.[32]\n",
            "During this time, the band had their song \"Bittersweet\" featured on the second season of Netflix series Bloodline, on Episode 2.06.[33]\n",
            "The Accidentals independently released the Parking Lot EP on NoiseTrade for free download on June 1, 2016.[34] The EP includes the titular \"Parking Lot\", as well as a remixed version of the song featuring rapper Rick Chyme that they call \"FRAP\", or \"folk-rap\".[35][36] Reviews for the EP were generally positive, often citing the band's \"genre-bending\" evolution since Bittersweet. John Sinkevics of Michigan-based music publication Local Spins called it \"another entertaining step forward on a magical indie-folk journey\",[37] and Jonathan Frahm said on behalf of For Folk's Sake, \"We're catching them at a compelling—and even inspirational—transitional portion of their careers.\"[38]\n",
            "The band also published an official music video for the song \"Sixth Street\" to YouTube, which is featured on the EP, on the same day as its release.[39]\n",
            "They were named one of the Huffington Post's Sweet 16 of 2016 by entertainment and sports journalist Michael Blalas on December 21, 2016. Blalas stated of the band, \"Ah, the beauty of youthful exuberance. It's a wonderful thing, to be sure, but when you have brains, musical talent, enthusiasm and the ability to connect with a growing fan base through the monster method of social media and viral videos, there's no telling how far you can go,\" and that \"The Accidentals certainly didn't happen by accident.\"[40]\n"
         ]
      },
      "2017–2018: Sony Masterworks and Odyssey": {
         "text": [
            "On January 9, 2017, the band announced that they were signed to Sony Masterworks via a feature in Local Spins, and they said they were looking forward to releasing the album internationally sometime during the spring of the same year.[41] The band announced that the album would feature multiple guest performers, including Jack White bassist Dominic John Davis, Jenny Conlee of The Decemberists, Keller Williams, Kaki King, Lily & Madeleine, and Carbon Leaf.[42] Buist described Masterworks as \"a family of like-minded music nerds that gets us and our music, and wants to support that authentically\", while Larson added, \"We feel like we can be truly who we are and they appreciate the honesty.\"[43] Masterworks is primarily a classical and jazz label, having previously signed such names as Yo-Yo Ma, Sonny Rollins, and Yanni, though it has recently expanded its reach with its signing of indie folk duo Tall Heights and acknowledgement of bluegrass on The Goat Rodeo Sessions.[44] Leo Sacks, a Grammy-winning producer and A&R consultant to Masterworks, was responsible for bringing the band to the label; Sacks had also brought Tall Heights to the label.[45]\n",
            "Sony Masterworks announced the title of the band's upcoming third album, Odyssey, on March 10, 2017 and announced that it would be released sometime during the summer of that same year.[46] The Accidentals released their lead single, \"KW\" (feat. Keller Williams), from off of the impending record on that same day. In March 2018, Texas Lifestyle Magazine named The Accidentals their \"must-see\" band of SXSW 2018.[47][48] Masterworks released the second single from Odyssey, \"Memorial Day\" (written and sung by Larson), on May 19, 2017.[49][50] The titular third single, \"Odyssey\", was released on July 24, 2017.[51]\n",
            "On August 18, 2017, the Accidentals released Odyssey via Sony Masterworks and embarked on tour throughout the United States and Canada to promote the album. The album received positive reviews from critics, including PopMatters, AllMusic, and Local Spins.[52][53] On premiering the album eight days prior to its release, NPR's Jewly Hight noted the album's \"equal interest in the focused musical forms of indie rock and pop and the expansive potential of orchestral arrangements, jam band open-endedness and impressionistic singer-songwriter expression\" and stated, \"The Accidentals know all about using finesse, and fun, to make an impact.\"[54] In December 2017, ABC News named Odyssey one of the best albums of 2017,[55] and Michael Blalas of Huffington Post put the Accidentals at Number 2 on his \"Best of Music List in 2017\", after Aimee Mann.[56]\n",
            "In January 2018, the Accidentals released the music video for the song \"Earthbound\" from Odyssey,[57] and Michigan Radio named them one of the \"Top West Michigan musicians of 2017\".[58]\n",
            "The week before the 2018 midterm election in the United States, the Accidentals independently released the single \"Heavy Flag\",[59][60] and the day before the election Billboard released the music video for the song, featuring a montage of social and environmental images.[61] Buist stated that in writing the song she was inspired by the iconic photograph Raising the Flag on Iwo Jima, and she wanted the song to make a statement about the \"weight and responsibility of our generation to care for our resources\".[59] Larson insisted that the band's goal in releasing the song before the election was to avoid a \"divisive message\" and instead to encourage \"everyone to become more aware, more informed and participate\".[59] The band participated in a \"get out the vote\" mini-tour in Michigan with Clean Water Campaign for Michigan, leading up to the election.[62][63]\n",
            "In late 2018, Buist and Larson played a series of collaborative shows with fellow singer-songwriters Beth Nielsen Chapman and May Erlewine,[64][65] and recorded a song in Cleveland with the Contemporary Youth Orchestra.[66]\n"
         ]
      },
      "2019–present: Audiotree Live and Live": {
         "text": [
            "On January 3, 2019, the band debuted their December 2018 Audiotree session as a digital release.[67] They also released a live EP titled The Accidentals on Audiotree Live featuring the songs performed during their session.[67] It includes a live rendition of \"Heavy Flag\" alongside four previously unreleased songs.\n",
            "On January 22, 2019, the band's gear trailer, containing $70,000 worth of equipment, was stolen from a hotel parking lot in Tucson, Arizona.[68][69] The trailer was later found, empty, on the edge of the desert.[68] More than 550 fans raised over $40,000 within eight days after the theft to help replace the stolen equipment.[70] The band said that immediately after the theft they wondered whether it would be the end of their band, but then were amazed by \"the sheer amount of people coming out of the woodwork and helping us get by and get back on our feet\".[71]\n",
            "The band released a new live album, Live, on April 28, 2019.[72][73] Live combines new songs with cover versions of \"Clementine\" by Sarah Jaffe, \"Where Is My Mind?\" by the Pixies, and \"Gold Lion\" by the Yeah Yeah Yeahs.[74]\n",
            "The Accidentals made their first overseas tour in May 2019, playing shows in Ireland and the United Kingdom.[75]\n"
         ]
      }
   },
   "Musical style and development": {
      "text": [
         "While Tangled Red and Blue could be described as a contemporary folk release,[76] the most consistent musical style attributed to The Accidentals following Bittersweet is \"genre-bending\". Self-described orchestra dorks, or \"orc dorks\", the group embraces its complex musical sound and style. \"You can't really put us in one genre,\" according to Buist.[77] Jim Linderman of the Dull Tool and Dim Bulb blog referred to them as \"tastefully eccentric,\" adding: \"They pack performing space with a multi-generational mix.\"[78]\n",
         "In 2015 the band delved into blues, rock and roll and hip-hop musicality, as can be heard in songs such as \"Trouble\"[79] and \"Parking Lot,\"[80] as well as in collaborations with artists such as Rick Chyme.[81]\n",
         "In 2019, the band described their sound as \"folk-influenced pop rock\".[82]\n"
      ]
   },
   "Influences": {
      "text": [
         "Growing up in musical families, including professional pianists for fathers and vocalists for mothers, Larson's and Buist's influences bounced between jazz, country, classical, bluegrass, alternative rock and the obscure.[83]\n",
         "The group's self-described \"all over the place\" list of influences in 2015 included Andrew Bird, Stéphane Grappelli, Arcade Fire, Death Cab for Cutie, Pixies, Yeah Yeah Yeahs, Doris Day, The Beatles, St. Vincent, Django Reinhardt, Sufjan Stevens, The Appleseed Collective,[84] and The National.[85][77]\n",
         "In a Coffeehouse Conversations session with WYEP-FM in 2015, Buist and Larson were asked who their top pick would be out of any artist that they could possibly ever collaborate with. During this session, Buist had chosen Ben Folds and Larson had chosen Jack White.[86] The duo named more influences during the Coffeehouse Conversation, including Chris Thile and Punch Brothers, Belle & Sebastian, Radiohead, and the White Stripes.\n",
         "In a \"20 Questions\" feature with PopMatters in 2017, the group cited additional influences as topmost inspirations to their craft, such as Kimya Dawson, Patti Smith, Caroline Shaw, David Bowie, Freddie Mercury, and Brian May.[36]\n"
      ]
   },
   "Members": {},
   "Discography": {
      "Albums": {},
      "EPs": {},
      "Live albums": {}
   },
   "Filmography": {},
   "Awards and nominations": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Accidentals are an American band, formed in Traverse City, Michigan in 2012 by Sav Buist and Katie Larson. The group features an eclectic blend of indie folk, pop, bluegrass, rock, classical, and other genres. They have released three full-length albums, one EP, and two live albums.\n",
      "Larson and Buist met as young musicians in 2011 at their public high school in Traverse City, Michigan.[1] Larson, then 15, was a freshman cello player, and Buist, then 16, was a sophomore who played violin, and they teamed up for a class orchestra project.[2] In 2012, they auditioned for and won a spot in the first-ever singer-songwriter major at the renowned Interlochen Center for the Arts high school, where they formally created The Accidentals.[3]\n",
      "In an interview with Post Independent, Larson described the formation of the band:\n",
      "We didn't really start interacting with each other until I was 15 and Savannah was 16. Our orchestra instructor asked for volunteers to play an event. Savannah and I were the only two people who raised our hands.[4]"
   ]
}