{
   "Name": "The Accidentals",
   "rawData": [
      "The Accidentals are an American band, formed in Traverse City, Michigan in 2012 by Sav Buist and Katie Larson. The group features an eclectic blend of indie folk, pop, bluegrass, rock, classical, and other genres. They have released three full-length albums, one EP, and two live albums.\n",
      "Larson and Buist met as young musicians in 2011 at their public high school in Traverse City, Michigan. Larson, then 15, was a freshman cello player, and Buist, then 16, was a sophomore who played violin, and they teamed up for a class orchestra project. In 2012, they auditioned for and won a spot in the first-ever singer-songwriter major at the renowned Interlochen Center for the Arts high school, where they formally created The Accidentals.\n",
      "In an interview with Post Independent, Larson described the formation of the band:\n"
   ],
   "infobox": {
      "Origin": [
         "Traverse City, Michigan, United States"
      ],
      "Genres": [
         "Indie rock, indie folk, folk rock, contemporary folk, folk pop, Americana, classical"
      ],
      "Years active": [
         "2012–present"
      ],
      "Associated acts": [
         "Academy Four · The Crane Wives · Miriam Pico · E Minor · Blue Eyed Sun · Angela Josephine · Blake Elliot · The Appleseed Collective · Olivia Mainville · Missy Zenker · The Way Down Wanderers · Oh Brother, Big Sister · Rick Chyme · Jenny Conlee"
      ],
      "Website": [
         "theaccidentalsmusic.com"
      ],
      "Members": [
         "Savannah Buist",
         "Katie Larson",
         "Michael Dause"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band, formed in Traverse City, Michigan in [YEAR] by Sav Buist and [PERSON_NAME_FULL_0_FEMALE]. The group features an eclectic blend of indie folk, pop, bluegrass, rock, classical, and other genres. They have released three full-length albums, one EP, and two live albums.\n",
      "Larson and Buist met as young musicians in [YEAR] at their public high school in Traverse City, Michigan. Larson, then 15, was a [GENRE] a sophomore who played violin, and they teamed up for a class orchestra project. In [YEAR], they auditioned for and won a spot in the first-ever singer-songwriter major at the renowned Interlochen Center for the Arts high school, where they formally created [BAND_NAME].\n",
      "In an [GENRE] band:\n"
   ]
}