{
   "Name": "Blackberry Smoke",
   "rawData": [
      "Blackberry Smoke is an American rock band from Atlanta, Georgia, United States. The lineup consists of Charlie Starr (lead vocals, guitar), Richard Turner (bass, vocals), Brit Turner (drums), Paul Jackson (guitar, vocals), Brandon Still (keyboards), in 2020 they added touring personnel Benji Shanks ( guitar), and Preston Holcomb (percussion). They have released six studio albums, two live albums and five extended play recordings. A 7th studio album is set to be released in 2021.\n",
      "Blackberry Smoke was formed in Atlanta, Georgia in 2000, and released their debut album, Bad Luck Ain't No Crime, in 2003. They have performed throughout the United States both as headliner and as the supporting act for artists such as Zac Brown Band, Eric Church, ZZ Top and Lynyrd Skynyrd.  Their second album released in 2009, Little Piece of Dixie. has been featured by Paste magazine and other publications.\n",
      "The band had their first chart success with their third album, The Whippoorwill, which was released in August 2012 and reached top 40 on Billboard 200.  The album was released under the Southern Ground record label. On August 26, 2012, they performed at a charity benefit called the Boot Ride with the cast of Sons of Anarchy, partnered with The Boot Campaign at the Happy Ending Bar and Grill in Hollywood, California.\n"
   ],
   "infobox": {
      "Origin": [
         "Atlanta, Georgia, United States"
      ],
      "Genres": [
         "Country rock",
         "Southern rock",
         "Hard Rock",
         "Blues Rock",
         "Jam Band"
      ],
      "Years active": [
         "2000–present"
      ],
      "Labels": [
         "BamaJam, Southern Ground, Rounder Records, 3 Legged Records, Earache Records (Europe)"
      ],
      "Website": [
         "blackberrysmoke.com"
      ],
      "Members": [
         "Paul Jackson",
         "Charlie Starr",
         "Brandon Still",
         "Brit Turner",
         "Richard Turner"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Atlanta, Georgia, United States. The lineup consists of Charlie Starr (lead vocals, guitar), [PERSON_NAME_FULL_1_MALE] (bass, vocals), Brit [PERSON_NAME_LAST_1] (drums), [PERSON_NAME_FULL_2_MALE] (guitar, vocals), Brandon Still (keyboards), in [YEAR] they added touring personnel Benji Shanks ( guitar), and [PERSON_NAME_FULL_0_MALE] (percussion). They have released six studio albums, two live albums and five extended play recordings. A 7th studio album is set to be released in [YEAR].\n",
      "[BAND_NAME] was formed in Atlanta, Georgia in [YEAR], and released their debut album, Bad Luck Ain't No Crime, in [YEAR]. They have performed throughout the United States both as headliner and as the supporting act for artists such as Zac Brown Band, Eric Church, ZZ Top and Lynyrd Skynyrd.  Their second album released in [YEAR], Little Piece of Dixie. has been featured by Paste magazine and other publications.\n",
      "The band had their first chart success with their third album, The Whippoorwill, which was released in [MONTH] [YEAR] and reached top 40 on Billboard 200.  The album was released under the Southern Ground record label. On [MONTH] 26, [YEAR], they performed at a [GENRE]"
   ]
}