{
   "Name": "BlueBilly Grit",
   "rawData": [
      "BlueBilly Grit, commonly abbreviated BBG, is an American bluegrass band originating from Maysville, Georgia. The band is a sextet composed of female and male vocals, acoustic guitar, upright bass, mandolin, fiddle, and banjo. BlueBilly Grit has released two albums — Mill Grinder's Blues (2009), Ready For A Change (2011) and Live at the Melting Point (2013). In 2012, BlueBilly Grit won the Telluride Bluegrass Festival band competition. In addition, BlueBilly Grit has performed in numerous radio and television broadcasts, including Nuts and Bolts of Fishing which aired on Turner South and the Moby in the Morning Show which airs on WNGC.\n\n\n",
      "Since forming in 2008, BlueBilly Grit has released two albums, Mill Grinder’s Blues and Ready For A Change. The albums showcase the songwriting talents of Mark, Shawn, and Amber and feature driving bluegrass rhythms with modern lyrics and seamless harmonies. Upon their albums' success, BlueBilly Grit has been playing countless festivals and venues across the United States. BlueBilly Grit hosts the annual Tony and Ann Lanuario Festival that honors a former bandmate and wife who died in an automobile accident in early 2009. In 2012, BlueBilly Grit won the Telluride Bluegrass Festival band competition.\nIn early 2013, BlueBilly Grit published a live DVD and album, Live at the Melting Point, which was recorded in late 2012 at the Melting Point in Athens, GA \nand produced by Lifesprings Media.\n",
      "This article on a United States band or other musical ensemble is a stub. You can help Wikipedia by expanding it."
   ],
   "infobox": {
      "Origin": [
         "Maysville, Georgia, United States"
      ],
      "Genres": [
         "Bluegrass, Americana"
      ],
      "Years active": [
         "2008 – Present"
      ],
      "Website": [
         "Official site"
      ],
      "Members": [
         "Amber Starr Hollis, Mark Garrison, Shawn Hart, Adam Rambin, Roman Gaddis, Patrick Chisolm"
      ]
   },
   "prunedData": [
      "[BAND_NAME], commonly abbreviated BBG, is an [GENRE] band originating from [MONTH]sville, Georgia. The band is a sextet composed of female and male vocals, acoustic guitar, upright bass, mandolin, fiddle, and banjo. [BAND_NAME] has released two albums — Mill Grinder's Blues ([YEAR]), Ready For A Change ([YEAR]) and Live at the Melting Point ([YEAR]). In [YEAR], [BAND_NAME] won the Telluride Bluegrass Festival band competition. In addition, [BAND_NAME] has performed in numerous radio and television broadcasts, including Nuts and Bolts of Fishing which aired on [PERSON_NAME_FULL_0_MALE] and the Moby in the Morning Show which airs on WNGC.\n\n\n",
      "Since forming in [YEAR], [BAND_NAME] has released two albums, Mill Grinder’s Blues and Ready For A Change. The albums showcase the songwriting talents of [MONTH]k, Shawn, and Amber and feature driving bluegrass rhythms with modern lyrics and seamless harmonies. Upon their albums' success, [BAND_NAME] has been playing countless festivals and venues across the United States. [BAND_NAME] hosts the annual Tony and [PERSON_NAME_FULL_0_FEMALE] that honors a [GENRE] bandmate and wife who died in an automobile accident in early [YEAR]. In [YEAR], [BAND_NAME] won the Telluride Bluegrass Festival band competition.\nIn early [YEAR], [BAND_NAME] published a live DVD and album, Live at the Melting Point, which was recorded in late [YEAR] at the Melting Point in Athens, GA \nand produced by Lifesprings Media.\n",
      "This article on a [GENRE] band or other musical ensemble is a stub. You can help Wikipedia by expanding it."
   ]
}