{
   "Name": "Blue Highway",
   "rawData": [
      "Blue Highway is an American contemporary bluegrass band formed in 1994 and based in Tennessee. The band's albums include Wondrous Love (2003), Marbletown (2005), and Original Traditional (2016).\n",
      "After helping found the band Dusty Miller, which was the 1990 SPBGMA International Bluegrass Band champion, and being a member (1990–92) of Alison Krauss & Union Station, Kingsport, Tennessee native Tim Stafford helped organize Blue Highway with Wayne Taylor in 1994. The group's first project, It's a Long, Long Road, \"spent six months at the top of the Bluegrass Unlimited charts and won IBMA's Album of the Year Award (1996).\" Jason Burleson, the original banjo player with the group and a multi-instrumentalist, is a native of Newland, North Carolina., Rob Ickes, a Northern California native, moved to Nashville in 1992 and joined as a founding member in 1994. Ickes has won numerous awards for his playing, and after a 21-year run with the band he announced his departure on November 18, 2015. Ickes was replaced by resonator guitarist and Virginia native, Gaven Largent. Vocalist, fiddler, and mandolin player Shawn Lane joined the group as a founding member after cutting \"his musical teeth\" in the bands of Ricky Skaggs and Doyle Lawson. Lane's songs have also been recorded by Ricky Skaggs, Ronnie Bowman, Mountain Heart, Blue Ridge, and other groups. Lead singer Wayne Taylor, who plays bass, hails from Southwest Virginia and is also a founding member of the group.\n",
      "Grammy nominations\n"
   ],
   "infobox": {
      "Origin": [
         "Kingsport, Tennessee, U.S."
      ],
      "Genres": [
         "Bluegrass, country, southern gospel, folk, Americana"
      ],
      "Years active": [
         "1994–present"
      ],
      "Website": [
         "bluehighwayband.com"
      ],
      "Members": [
         "Jason Burleson",
         "Shawn Lane",
         "Tim Stafford",
         "Wayne Taylor",
         "Gary Hultman"
      ],
      "Past members": [
         "Rob Ickes",
         "Tom Adams",
         "Gaven Largent",
         "Justin Moses"
      ]
   },
   "albums": [
      "All Things Considered"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in [YEAR] and based in Tennessee. The band's albums include Wondrous Love ([YEAR]), [MONTH]bletown ([YEAR]), and Original Traditional ([YEAR]).\n",
      "After helping found the band Dusty Miller, which was the [YEAR] SPBGMA International Bluegrass Band champion, and being a member ([YEAR]–92) of [PERSON_NAME_FULL_4_FEMALE] & Union Station, Kingsport, Tennessee native [PERSON_NAME_FULL_3_MALE] helped organize [BAND_NAME] with Wayne Taylor in [YEAR]. The group's first project, It's a Long, Long Road, [SONG_NAME] in the bands of [PERSON_NAME_FULL_2_MALE] and [PERSON_NAME_FULL_1_MALE]. Lane's songs have also been recorded by [PERSON_NAME_FULL_2_MALE], Ronnie Bowman, Mountain Heart, Blue Ridge, and other groups. Lead singer Wayne Taylor, who plays bass, hails from Southwest Virginia and is also a founding member of the group.\n",
      "Grammy nominations\n"
   ]
}