{
   "Name": "Bluegrass Brothers",
   "rawData": [
      "The Bluegrass Brothers is an American bluegrass band from Southwest Virginia.\n",
      "Brothers Robert and Victor Dowdy formed the band in 1989 after both had been members of the family group The Bluegrass Playboys. The group became well known outside of Southwest Virginia after they recorded \"The Ballad of Mark Warner\" in 2001 for the gubernatorial campaign of Mark Warner.  The Bluegrass Brothers have gotten high reviews for their 2005 album Old Crooked Trail.2010 saw the band win instrumental group of the year at the SPGMA awards. 2010 also saw original member Robert Dowdy retired from the band and was replaced by Kevin Prater. In September 2011 Victor & Robert Dowdy were inducted into the Virginia Folk Music Association Hall of Fame, joining other Virginia music Hall of Fame members that include Patsy Cline, The Statler Brothers, Jimmy Dean, Mac Wiseman, Tony Rice, The Stanley Brothers & others. The band still tours all over the US & Canada.  In 2013 original Bluegrass Brother Robert Dowdy returned on banjo and Victor's youngest son Donald returned on mandolin. Since 2013 the band line-up has been Victor Dowdy : bass & vocals, Steve Dowdy : guitar & vocals, Jamie Sparks : banjo & vocals, Donald Dowdy : mandolin & vocals, Chris Hart : dobro. In 2014 the band signed with Mountain Fever Records and in July released the album \"Generations\" The album has performed well on the national Bluegrass charts with songs \"Memories of my Childhood\", \"Moonshine Man\", \"Grand Reunion\", \"Blue Ridge Mountain Man\", and \"When the Mountain Fell\" getting national radio airplay. Since the end of 2018, there has been a change in the band members with Jacob Hensley taking over on mandolin and Caleb Shifflett taking over on guitar.\n",
      "The band is known for its hard driving playing and high lonesome family harmonies. Some of the band's biggest influences are Jimmy Martin, Flatt & Scruggs, The Stanley Brothers, The Osbourne Brothers, The McPeak Brothers, The Country Gentlemen, and The Seldom Scene. The style of music they play makes them a favorite at bluegrass festivals. They are known for putting on one of the most electrifying shows on the festival circuit. Many times they are put on in the festival closing slot due to the high number of encores demanded by the audience.\n"
   ],
   "infobox": {
      "Origin": [
         "Salem, Virginia, U.S.."
      ],
      "Genres": [
         "Bluegrass, country"
      ],
      "Years active": [
         "1989–present"
      ],
      "Labels": [
         "Mountain Fever"
      ],
      "Website": [
         "thebluegrassbrothers.com"
      ],
      "Members": [
         "Victor Dowdy",
         "Caleb Shifflett",
         "Jamie Sparks",
         "Jacob Hensley",
         "Chris Hart"
      ]
   }
}