{
   "Name": "Chesapeake (band)",
   "rawData": [
      "Chesapeake was an American bluegrass band formed in 1994 in Bethesda, Maryland as a direct offshoot from The Seldom Scene.\n\n",
      "Mike Auldridge, T. Michael Coleman, and Moondi Klein, who played together in Seldom Scene in the middle of 90' didn't feel satisfied with the way John Duffey led the group with only occasional playing and keeping their day jobs. All of them wanted to play more seriously and started to play outside the Seldom Scene.  The three formed Chesapeake along with Jimmy Gaudreau, mandolinist of the Tony Rice Unit. This occurred in mid to late 1994, after the release of their last album with the Seldom Scene, Like We Used to Be.\nChesapeake stayed together for five years and then disbanded; Mike Auldridge to pursue his own solo music, Jimmy Gaudreau and Moondi Klein continued to play together as duo.\n",
      "Chesapeake music style cannot be clearly defined, as it is a blend of bluegrass, progressive bluegrass, folk, folk-rock, country, rock and more. Folk songwriters such as Tom Paxton and Steve Gillette influenced their music as well as rock performers such as Van Morrisson and Little Feat. Their music was strongly led by Dobro and mandolin with Auldridge adding lap steel and pedal steel guitar to their arrangements. Later on the band added more percussion to their music.\n"
   ],
   "infobox": {
      "Origin": [
         "Bethesda, Maryland, United States"
      ],
      "Genres": [
         "Folk, folk rock, progressive bluegrass"
      ],
      "Years active": [
         "1994–1999"
      ],
      "Labels": [
         "Sugar Hill"
      ],
      "Associated acts": [
         "Seldom Scene, Doc Watson, Tony Rice, Country Gentlemen"
      ],
      "Past members": [
         "Jimmy Gaudreau",
         "Mike Auldridge",
         "T. Michael Coleman",
         "Moondi Klein"
      ]
   },
   "albums": [
      "Rising Tide ",
      "Full Sail",
      "Pier Pressure",
      "Hook, Live & Sinker"
   ]
}