{
   "Name": "The Country Gentlemen",
   "rawData": [
      "The Country Gentlemen was a bluegrass band that originated during the 1950s in the area of Washington, D.C., United States, and recorded and toured with various members until the death in 2004 of Charlie Waller, one of the group's founders who in its later years served as the group's leader.\n",
      "The classic line-up from 1960–64 consisted of co-founders Charlie Waller on guitar and John Duffey on mandolin, with Eddie Adcock on banjo and Tom Gray on bass. They were inducted into the International Bluegrass Music Hall of Honor in 1996.\n",
      "The band started on July 4, 1957 as a replacement group for Buzz Busby and the Bayou Boys when several members of that band were injured in a car accident. The band’s original members were\nCharlie Waller on guitar and lead vocals, John Duffey on mandolin and tenor vocals, Bill Emerson on banjo and baritone vocals, and Larry Lahey on bass. After a few early changes, the band settled into a somewhat permanent lineup consisting of Waller, Duffey, Eddie Adcock on banjo, and Tom Gray on bass.\n"
   ],
   "infobox": {
      "Origin": [
         "Washington, D.C., United States"
      ],
      "Genres": [
         "Bluegrass, country, progressive bluegrass"
      ],
      "Years active": [
         "1957–2004"
      ],
      "Labels": [
         "Folkways, Smithsonian Folkways, Starday, Vanguard, Rebel, Sugar Hill, Design, Mercury, Copper Creek, Freeland, Pinecastle, Seven Seas"
      ],
      "Associated acts": [
         "Bill Monroe, Seldom Scene, Bluegrass Album Band, The Stanley Brothers, Doc Watson, Osborne Brothers, Doyle Lawson & Quicksilver"
      ],
      "Past members": [
         "1st classic lineup",
         "Charlie Waller",
         "John Duffey",
         "Eddie Adcock",
         "Tom Gray",
         "2nd classic lineup",
         "Charlie Waller",
         "Bill Emerson",
         "Doyle Lawson",
         "Bill Yates",
         "Greg Corbett",
         "list of all past members"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band that originated during the [YEAR]s in the area of Washington, D.C., United States, and recorded and toured with various members until the death in [YEAR] of Charlie Waller, one of the group's founders who in its later years served as the group's leader.\n",
      "The classic line-up from [YEAR]–64 consisted of co-founders Charlie Waller on guitar and [PERSON_NAME_FULL_1_MALE] on mandolin, with [PERSON_NAME_FULL_0_MALE] on banjo and Tom Gray on bass. They were inducted into the International Bluegrass Music Hall of Honor in [YEAR].\n",
      "The band started on [MONTH] 4, [YEAR] as a [GENRE] band were injured in a car accident. The band’s original members were\n[PERSON_NAME_FULL_1_MALE] on guitar and lead vocals, John Duffey on mandolin and tenor vocals, [PERSON_NAME_FULL_3_MALE] on banjo and baritone vocals, and [PERSON_NAME_FULL_2_MALE] on bass. After a few early changes, the band settled into a somewhat permanent lineup consisting of [PERSON_NAME_LAST_1], Duffey, [PERSON_NAME_FULL_0_MALE] on banjo, and Tom Gray on bass.\n"
   ]
}