{
   "Name": "Cherryholmes",
   "Sections": [
      "1 History",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Cherryholmes was an American bluegrass band from Los Angeles, California, made up of six members of the Cherryholmes family: father Jere (Pop), mother Sandy Lee, daughters Cia Leigh and Molly Kate, and sons B.J. and Skip.\n"
      ]
   },
   "History": {
      "text": [
         "Shelly, the twenty-year-old daughter of Jere and Sandy Lee, died unexpectedly in March 1999. In April, Jere and Sandy Lee took the family to a local bluegrass festival, after which they and their children started learning to play bluegrass music. Jere already played electric bass and acoustic guitar. Sandy played many instruments including guitar, piano, and some fiddle and mandolin. Cia, 15, began learning guitar. B.J., 11, and Molly, 7, began the fiddle. Skip, 9, began the mandolin. Jere switched to upright bass and Sandy took the mandolin.\n",
         "They began playing in April; in July they auditioned, and were hired, for their first gig at Oak Tree Village, Oak Glen in the San Bernardino Mountains. From then they played regularly as amateurs at bluegrass venues and festivals throughout southern California and Arizona.\n",
         "They turned professional in 2000.  In 2002, they sold their home, purchased a 26-foot travel trailer, and took their show to audiences in the Midwest and the East. They earned enough in the first year to buy their first tour bus. In spring of 2003, they went to Nashville, Tennessee to make their first appearance on the Grand Ole Opry.\n",
         "They signed with Skaggs Family Records (owned by musician Ricky Skaggs) in 2005. They were nominated for the IBMA categories 'Entertainers of the Year' and 'Emerging Artist of the Year' fall of 2005, winning 'Entertainers of the Year'.\n",
         "Columbia Artist Management (CAMI) in New York City booked them into theaters and performing arts centers and eventually into performances with symphony orchestras around the country. They traveled nearly a million miles in their tour bus, playing at many bluegrass, country, roots and rock venues, including Lincoln Center in New York City, Bonnaroo and CMA Music Festival in Tennessee, Stage Coach in California, and the Pocono Raceway in Pennsylvania.\n",
         "Cherryholmes toured Switzerland, France, Japan, the United Kingdom, Canada, the Maritimes, and the Caribbean. They performed regularly on the Grand Ole Opry. During their career, they received five Grammy nominations and a Dove Award nomination. Their songs appeared on Gaither Music CDs and DVDs. They have appeared on various PBS specials including the award-winning Bluegrass Underground. In March 2006 their story was featured in a Billy Graham Television special.\n",
         "On January 12, 2011, Cherryholmes announced that they would disband, saying that the younger members needed to choose their own paths without the extreme interdependence that exists in a family business.\n",
         "Cherryholmes performed their last show together on May 7, 2011 in Galax, Virginia. Cia, B.J., Skip, and Molly went on to pursue individual careers.\n",
         "In 2014, the band reunited for a performance on 26 September 2015 at the Outer Banks Bluegrass Island Festival in Manteo, North Carolina.\n[1]\n[2]\nHowever, the last days of the festival were canceled due to weather.  Four band members - Skip, Cia, Jere, and Sandy - were scheduled to perform a \"Cherryholmes & Friends\" replacement show at a nearby coffee house.\n[3]\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Cherryholmes was an American bluegrass band from Los Angeles, California, made up of six members of the Cherryholmes family: father Jere (Pop), mother Sandy Lee, daughters Cia Leigh and Molly Kate, and sons B.J. and Skip.\n",
      "Shelly, the twenty-year-old daughter of Jere and Sandy Lee, died unexpectedly in March 1999. In April, Jere and Sandy Lee took the family to a local bluegrass festival, after which they and their children started learning to play bluegrass music. Jere already played electric bass and acoustic guitar. Sandy played many instruments including guitar, piano, and some fiddle and mandolin. Cia, 15, began learning guitar. B.J., 11, and Molly, 7, began the fiddle. Skip, 9, began the mandolin. Jere switched to upright bass and Sandy took the mandolin.\n",
      "They began playing in April; in July they auditioned, and were hired, for their first gig at Oak Tree Village, Oak Glen in the San Bernardino Mountains. From then they played regularly as amateurs at bluegrass venues and festivals throughout southern California and Arizona.\n",
      "They turned professional in 2000.  In 2002, they sold their home, purchased a 26-foot travel trailer, and took their show to audiences in the Midwest and the East. They earned enough in the first year to buy their first tour bus. In spring of 2003, they went to Nashville, Tennessee to make their first appearance on the Grand Ole Opry.\n"
   ]
}