{
   "Discography": {
      "Albums": {},
      "Live albums": {},
      "Music videos": {}
   },
   "External links": {},
   "History": {
      "2001–2008": {
         "text": [
            "O'Donovan and DiMario met at the New England Conservatory of Music in Boston, Massachusetts in the spring of 2001. Former member Rushad Eggleston, who was studying cello at Berklee College of Music, and Liszt, a graduate student at MIT, were playing music together around the same time, and when the four met that summer, they formed a band that became Crooked Still. While its members finished school, the group played various Boston venues, growing in popularity and collecting favorable reviews from the local press.\n",
            "Crooked Still went on to appear at concert halls, festivals, coffeehouses, and nightclubs in 23 states and several countries. On August 22, 2006, the group released their second album, Shaken by a Low Sound.\n"
         ]
      },
      "2011 and beyond": {
         "text": [
            "In honor of their tenth anniversary together as a band, Crooked Still embarked on a major tour of the Northeast and the Pacific Northwest, and released a 7-song EP called Friends of Fall in October 2011.[6] After the final show of their 2011 tour, Crooked Still took a three-year touring and recording hiatus (originally planned to be one year) for its members to pursue other musical projects.\n",
            "Crooked Still performed at the FreshGrass festival in North Adams, Massachusetts, in September 2017.\n",
            "In June 2018, Crooked Still songs \"Little Sadie\" and \"Ecstasy\" were featured in the gameplay trailer for The Last of Us Part II presented at E3 2018. These songs, along with \"Ain't No Grave\" were included in the final game. \n"
         ]
      },
      "From 2008": {
         "text": [
            "Cellist Rushad Eggleston performed his last show with the band on November 18, 2007, at the Iron Horse in Northampton, Massachusetts. He parted ways with Crooked Still to pursue his own music with band Tornado Rider.  In January 2008 two new members joined the band: cellist Tristan Clarridge and fiddler Brittany Haas, both of whom have toured in Darol Anger's Republic of Strings. The Darol Anger connection goes further: Rushad Eggleston was in Fiiddler's Four in 2002.  The band released its first album with the new lineup, Still Crooked in 2008, a live album in 2009, and Some Strange Country in 2010.\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 2001–2008",
      "1.2 From 2008",
      "1.3 2011 and beyond",
      "2 Discography",
      "2.1 Albums",
      "2.2 Live albums",
      "2.3 Music videos",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Crooked Still is an American band consisting of vocalist Aoife O'Donovan, banjo player Gregory Liszt, bassist Corey DiMario, cellist Tristan Clarridge and fiddler Brittany Haas. They are known for their high energy, technical skill, unusual instrumentation, and innovative acoustic style.[1]\n",
         "The string band's style has been described as progressive bluegrass, folk-country, and Americana.[2][3][4] O'Donovan states that the band is playing its \"own sort of continuation\" on the bluegrass tradition that began in the U.S. with Bill Monroe and Jimmy Martin.[5]\n"
      ]
   },
   "Title": "Crooked Still - Wikipedia"
}