{
   "Name": "Crooked Still",
   "rawData": [
      "Crooked Still is an American band consisting of vocalist Aoife O'Donovan, banjo player Gregory Liszt, bassist Corey DiMario, cellist Tristan Clarridge and fiddler Brittany Haas. They are known for their high energy, technical skill, unusual instrumentation, and innovative acoustic style.\n",
      "The string band's style has been described as progressive bluegrass, folk-country, and Americana. O'Donovan states that the band is playing its \"own sort of continuation\" on the bluegrass tradition that began in the U.S. with Bill Monroe and Jimmy Martin.\n",
      "O'Donovan and DiMario met at the New England Conservatory of Music in Boston, Massachusetts in the spring of 2001. Former member Rushad Eggleston, who was studying cello at Berklee College of Music, and Liszt, a graduate student at MIT, were playing music together around the same time, and when the four met that summer, they formed a band that became Crooked Still. While its members finished school, the group played various Boston venues, growing in popularity and collecting favorable reviews from the local press.\n"
   ],
   "infobox": {
      "Origin": [
         "Boston, Massachusetts"
      ],
      "Genres": [
         "Progressive bluegrass, folk-country, Americana"
      ],
      "Years active": [
         "2001–present"
      ],
      "Labels": [
         "Footprint, Signature Sounds "
      ],
      "Associated acts": [
         "Wild Band of Snee, Darol Anger's Republic of Strings, Fiddlers 4, Tornado Rider, Sometymes Why"
      ],
      "Website": [
         "crookedstill.com"
      ],
      "Members": [
         "Aoife O'Donovan",
         "Corey DiMario",
         "Gregory Liszt",
         "Tristan Clarridge",
         "Brittany Haas"
      ],
      "Past members": [
         "Rushad Eggleston"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band consisting of vocalist [PERSON_NAME_FULL_2_FEMALE], banjo player Gregory Liszt, bassist [PERSON_NAME_FULL_0_MALE][MONTH]io, cellist Tristan Clarridge and fiddler [PERSON_NAME_FULL_1_FEMALE]. They are known for their high energy, technical skill, unusual instrumentation, and innovative acoustic style.\n",
      "The string band's style has been described as progressive bluegrass, folk-country, and Americana. O'Donovan states that the band is playing its [SONG_NAME] on the bluegrass tradition that began in the U.S. with Bill Monroe and Jimmy [MONTH]tin.\n",
      "O'Donovan and Di[MONTH]io met at the New England Conservatory of Music in Boston, Massachusetts in the spring of [YEAR]. Former member Rushad Eggleston, who was studying cello at Berklee College of Music, and Liszt, a [GENRE] a band that became [BAND_NAME]. While its members finished school, the group played various Boston venues, growing in popularity and collecting favorable reviews from the local press.\n"
   ]
}