{
   "Name": "Danny Paisley and the Southern Grass",
   "rawData": [
      "\nDan Paisley and the Southern Grass is an American bluegrass band dedicated to the traditional style. The band was originally called \"Bob Paisley and the Southern Grass\", but was renamed after the death of Bob Paisley in 2004.\n",
      "Originally known as, Ted Lundy, Bob Paisley And The Southern Mountain boys, they gained some recognition when they performed on New Jersey Public Television.  The original members were Ted Lundy, Bob Paisley, Fred Hannah and Jerry Lundy. They were soon joined by Bob's son, Dan Paisley, and Ted Lundy's sons T.J. and Bobby. After the death of Ted Lundy the band became known as Bob Paisley and the Southern Grass.  The Southern Grass has performed at notable events such as the Presidential Inauguration of Jimmy Carter, an official state visit of Princess Anne, and at the Library of Congress in 2015 Bob Paisley lost a two-year battle with cancer in November, 2004. Since that time, his son Danny Paisley has fronted the band. In 2009 the group received the Song of the Year award from the International Bluegrass Music Association (IBMA) for the song \"Don't Throw Mama's Flowers Away\" written by Chris Stuart and Ivan Rosenberg. In 2016 Danny Paisley received the IBMA's Male Vocalist of the Year award. In November 2019, the band announced a signing to Pinecastle Records.\n"
   ],
   "infobox": {},
   "albums": [
      "The Tradition Continues:",
      "The Room Over Mine",
      "The Road into Town:",
      "Weary River:",
      "That's Why I'm Lonesome:"
   ],
   "prunedData": [
      "\nDan Paisley and the Southern Grass is an [GENRE] band dedicated to the traditional style. The band was originally called [SONG_NAME], but was renamed after the death of Bob Paisley in [YEAR].\n",
      "Originally known as, Ted Lundy, [PERSON_NAME_FULL_2_MALE] And The Southern Mountain boys, they gained some recognition when they performed on New Jersey Public Television.  The original members were Ted Lundy, [PERSON_NAME_FULL_2_MALE], [PERSON_NAME_FULL_0_MALE] and Jerry Lundy. They were soon joined by [PERSON_NAME_FIRST_2]'s son, [PERSON_NAME_FIRST_4] [PERSON_NAME_LAST_2], and Ted Lundy's sons T.J. and [PERSON_NAME_FIRST_2]by. After the death of Ted Lundy the band became known as [PERSON_NAME_FULL_2_MALE] and the Southern Grass.  The Southern Grass has performed at notable events such as the Presidential Inauguration of Jimmy Carter, an official state visit of Princess Anne, and at the Library of Congress in [YEAR] [PERSON_NAME_FULL_2_MALE] lost a two-year battle with cancer in [MONTH], [YEAR]. Since that time, his son [PERSON_NAME_FIRST_3] [PERSON_NAME_LAST_2] has fronted the band. In [YEAR] the group received the Song of the Year award from the International Bluegrass Music Association (IBMA) for the song [SONG_NAME] written by Chris Stuart and [PERSON_NAME_FULL_1_MALE]. In [YEAR] [PERSON_NAME_FIRST_3] [PERSON_NAME_LAST_2] received the IBMA's Male Vocalist of the Year award. In [MONTH] [YEAR], the band announced a signing to Pinecastle Records.\n"
   ]
}