{
   "Name": "Dixie Gentlemen",
   "rawData": [
      "The Dixie Gentlemen, was a bluegrass band formed in 1956 whose musical style varied between traditional and progressive bluegrass.\n",
      "The group were formed as the Country Gentlemen in 1956 in Alabama by banjo player Rual Yarbrough, mandolin player Herschel Sizemore and guitarist Jake Landers. About that time, another group who went by the name of the Country Gentlemen already existed so Yarbrough's group changed their name to the Dixie Gentlemen. Soon, Jake Landers entered military service but was discharged the next year in 1957. During these early years, they toured the south eastern USA and also made personal appearances on both local radio and television stations. Their efforts bore fruit and they made their recording debut in 1959 for the tiny and obscure Blue Sky label. When the fiddler Tommy Jackson was going to record an album for Dot Records, the Dixie Gentlemen were offered to back him up. In the early 1960s, they recorded for the small Time label. Shortly they signed with United Artists Records. The Dixie Gentlemen disbanded in 1966 after having made their last album together with fiddler Vassar Clements and dobro player Tut Taylor. Later, Yarbrough and Sizemore formed The Dixiemen. The original Dixie Gentlemen were temporarily revived in 1972 and again in the early 1990s.\n",
      "\n"
   ],
   "infobox": {},
   "albums": [],
   "prunedData": [
      "The [BAND_NAME], was a [GENRE] band formed in [YEAR] whose musical style varied between traditional and progressive [GENRE].\n",
      "The group were formed as the Country Gentlemen in [YEAR] in Alabama by banjo player Rual Yarbrough, mandolin player Herschel Sizemore and guitarist [PERSON_NAME_FULL_0_MALE]. About that time, another group who went by the name of the Country Gentlemen already existed so Yarbrough's group changed their name to the [BAND_NAME]. Soon, [PERSON_NAME_FULL_0_MALE] entered military service but was discharged the next year in [YEAR]. During these early years, they toured the south eastern USA and also made personal appearances on both local radio and television stations. Their efforts bore fruit and they made their recording debut in [YEAR] for the tiny and obscure Blue Sky label. When the fiddler [PERSON_NAME_FULL_1_MALE] was going to record an album for Dot Records, the [BAND_NAME] were offered to back him up. In the early [YEAR]s, they recorded for the small Time label. Shortly they signed with United Artists Records. The [BAND_NAME] disbanded in [YEAR] after having made their last album together with fiddler Vassar Clements and dobro player Tut Taylor. Later, Yarbrough and Sizemore formed The Dixiemen. The original [BAND_NAME] were temporarily revived in [YEAR] and again in the early [YEAR]s.\n",
      "\n"
   ]
}