{
   "Name": "Druhá Tráva",
   "rawData": [
      "Druhá Tráva (\"Second Grass\" in Czech) is a Czech bluegrass band originally formed in Czechoslovaia in 1991 by Robert Křesťan and Luboš Malina, and currently based in Czech Republic. They have released 13 studio albums, plus a variety of live albums, collaborative albums, and side projects. They have been described as evolving from underground musicians who subverted Communism to international artists who \"upend convention\".\n",
      "Czech musicians have long been interested in Americana, bluegrass, folk, and early country music, leading to the development of the Czech bluegrass genre in the mid-1960s. A regional tour by Pete Seeger in 1964 was a particular inspiration to Czech musicians. The Communist regime was hostile to such music, and Czech musicians with Western folk and rock influences helped advocate for the country's eventual independence.\n",
      "Singer/songwriter/mandolinist Robert Křesťan had been a fan of American roots music since age 10 in the late 1960s, listening to records that had been smuggled into the then-Communist Czechoslovakia; Křesťan was particularly fond of bluegrass pioneer Bill Monroe. Křesťan went to great pains to find records and learned how to play the music on homemade instruments.  He joined the band Poutnici in 1979.\n"
   ],
   "infobox": {
      "Origin": [
         "Czechoslovakia"
      ],
      "Genres": [
         "Czech bluegrass"
      ],
      "Years active": [
         "1991–present"
      ],
      "Members": [
         "Robert Křesťan",
         "Luboš Malina",
         "Luboš Novotný",
         "Emil Formanek",
         "Tomas Liska"
      ],
      "Past members": [
         "Petr Sury",
         "Stanislav Paluch",
         "Michal Vavro",
         "Martin Ledvina",
         "Juraj Griglak",
         "Jiri Meisner",
         "Pavel Malin",
         "Stepan Smetacek",
         "Milos Dvoracek"
      ]
   },
   "albums": [
      "Robert Křesťan a Druhá Tráva",
      "Revival",
      "Starodávný svět",
      "Druhá Tráva s Pavlínou Jíšovou",
      "Live",
      "Pohlednice",
      "New Freedom Bell",
      "Czechmate",
      "The Best and Last",
      "Good Morning, Friend",
      "Live in Brno",
      "Dylanovky",
      "Marcipán z Toleda",
      "Shuttle to Bethlehem",
      "Live in Telč",
      "Pojd'me se Napít"
   ]
}