{
   "Discography": {
      "text": [
         "Titles and release dates are from the Druhá Tráva website.[11] These are albums released under the names Druhá Tráva or Robert Křesťan & Druhá Tráva. Several members of the band have released solo albums with assistance from various permutations of the Druhá Tráva lineup.\n"
      ]
   },
   "External links": {},
   "History": {
      "text": [
         "Czech musicians have long been interested in Americana, bluegrass, folk, and early country music, leading to the development of the Czech bluegrass genre in the mid-1960s.[2] A regional tour by Pete Seeger in 1964 was a particular inspiration to Czech musicians.[3] The Communist regime was hostile to such music, and Czech musicians with Western folk and rock influences helped advocate for the country's eventual independence.[4]\n",
         "Singer/songwriter/mandolinist Robert Křesťan had been a fan of American roots music since age 10 in the late 1960s, listening to records that had been smuggled into the then-Communist Czechoslovakia; Křesťan was particularly fond of bluegrass pioneer Bill Monroe.[5] Křesťan went to great pains to find records and learned how to play the music on homemade instruments.[6]  He joined the band Poutnici in 1979.\n",
         "Křesťan and another member of Poutnici, banjo player Luboš Malina, formed Druhá Tráva in 1991. The original lineup of Druhá Tráva also included dobroist/guitarist Luboš Novotný, bassist Jiří Meisner, and guitarist Pavel Malina. The band's lineup has changed considerably over its history, though Křesťan, Malina, and Novotný have been in the band consistently since 1991. The current lineup also includes guitarist Emil Formanek and bassist Tomas Liska.[7] The band's first album, Robert Krestan & Druha Trava, was released in 1991. Druhá Tráva has been noted as the preeminent band in the Czech bluegrass scene, and critics have cited the band's unique mix of Americana and Central European influences.[8]\n",
         "Druhá Tráva has toured internationally and has performed with Ricky Skaggs, Peter Rowan, Davy Spillane, and Béla Fleck.[3] The band's international appearances attracted attention for their ability to master many different genres and eras of American roots music.[9] Their 1999 album Czechmate was their first to be released in the United States, and gained attention from international critics for its covers of jazz standards, opera numbers, and Appalachian folk songs.[10] Several of their later albums were released by Universal Music Group, and their most recent album Pojd'me se Napít was released by EMI in 2013.[11]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Druhá Tráva (\"Second Grass\" in Czech) is a Czech bluegrass band originally formed in Czechoslovaia in 1991 by Robert Křesťan and Luboš Malina, and currently based in Czech Republic. They have released 13 studio albums, plus a variety of live albums, collaborative albums, and side projects. They have been described as evolving from underground musicians who subverted Communism to international artists who \"upend convention\".[1]\n"
      ]
   },
   "Title": "Druhá Tráva - Wikipedia"
}