{
   "Name": "Nothin' Fancy",
   "rawData": [
      "Nothin' Fancy is an award-winning bluegrass band based in Buena Vista, Virginia and was formed in September 1994. Its \"parent band\" East Coast Bluegrass Band was formed Summer 1985 to compete in the East Coast Bluegrass Championship in Crimora, Virginia.\n",
      "The East Coast Bluegrass Band, predecessor to Nothin' Fancy, was formed in 1994 to compete in the East Coast Bluegrass Championship in Crimora, Virginia.  After winning the contest, the band kept the name and continued to play together at local functions. In 1986 the group won the Virginia Folk Music Society State Bluegrass Band Championship.  The members of the band developed some original material, but remained true to the traditional style of the great bluegrass bands of the 1940s and 1950s.\n",
      "In 1998 the band released Life's Mysteries with Buster Sexton on banjo, Mike Andes on mandolin, Frankie Hawkins on guitar, Darin Lawrence on rhythm guitar, Bill Ledbetter on bass, and Buster's son Chris Sexton on fiddle.  The younger Sexton joined the group at the last minute as a replacement for Mitchell Davis, who left the group in May 1997.\n"
   ],
   "infobox": {
      "Origin": [
         "Timberville, Virginia, United States",
         "Buena Vista, Virginia",
         "Lexington, Virginia",
         "Manassas, Virginia"
      ],
      "Genres": [
         "Folk",
         "Country",
         "Americana",
         "Bluegrass"
      ],
      "Years active": [
         "1994–present"
      ],
      "Labels": [
         "Mountain Fever, Pinecastle"
      ],
      "Website": [
         "Official Site"
      ],
      "Members": [
         "Mike Andes",
         "  Chris Sexton",
         "  Caleb Cox",
         "James Cox",
         "Jacob Flick"
      ],
      "Past members": [
         "Gary Ferris",
         " Buster Sexton",
         "Frankie Hawkins",
         "Darin Lawrence",
         "Bill Ledbetter",
         "Eli Johnston",
         "Justin Tomlin",
         "Jesse Smathers",
         "Tony Shorter",
         " Mitchell Davis"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band based in Buena Vista, Virginia and was formed in [MONTH] [YEAR]. Its \"parent band\" East Coast Bluegrass Band was formed Summer [YEAR] to compete in the East Coast Bluegrass Championship in Crimora, Virginia.\n",
      "The East Coast Bluegrass Band, predecessor to [BAND_NAME], was formed in [YEAR] to compete in the East Coast Bluegrass Championship in Crimora, Virginia.  After winning the contest, the band kept the name and continued to play together at local functions. In [YEAR] the group won the Virginia Folk Music Society State Bluegrass Band Championship.  The members of the band developed some original material, but remained true to the traditional style of the great bluegrass bands of the [YEAR]s and [YEAR]s.\n",
      "In [YEAR] the band released Life's Mysteries with Buster [PERSON_NAME_LAST_1] on banjo, [PERSON_NAME_FULL_2_MALE] on mandolin, Frankie Hawkins on guitar, [PERSON_NAME_FULL_0_FEMALE] on rhythm guitar, Bill Ledbetter on bass, and Buster's son [PERSON_NAME_FULL_1_MALE] on fiddle.  The younger [PERSON_NAME_LAST_1] joined the group at the last minute as a replacement for Mitchell Davis, who left the group in [MONTH] [YEAR].\n"
   ]
}