{
   "Name": "Gary Ruley and Mule Train",
   "rawData": [
      "Gary Ruley and Mule Train is an acoustic bluegrass band based in Lexington, Virginia who also play New Grass and Jazz music.\n",
      "Gary Ruley was born into a musical family in Lexington, Virginia, and first performed publicly at ten. He has performed with his father, Pat Ruley, his brother, Ronald \"Rooster\" Ruley, and his son, Jeremiah Ruley. \"Sisters Sandy, Sue and Kathy . . were strong musicians in their own rights.\" The strong musical tradition of his hometown rooted the musical Ruley family in bluegrass and mountain music.  The Ruleys were \"ahead of the curve that became the explosion of bluegrass popularity commencing in the mid-1970s.\"  Gary's musical journey was launched by many performances at a young age singing and flatpicking in and around Lexington, which was at the time a \"hotbed of nightly entertainment of live acoustic music. Many nights would feature four or five different bands performing at various venues.\"\n",
      "He grew up performing with diverse musicians for functions at Washington and Lee University, Virginia Military Institute, The University of Virginia, and various weddings and socials.\n"
   ],
   "infobox": {
      "Origin": [
         "Rockbridge County, Virginia, United States"
      ],
      "Genres": [
         "Folk, Country, Americana, Bluegrass, Jazz"
      ],
      "Website": [
         "Official Site"
      ],
      "Members": [
         "Gary Ruley",
         " Danny Knicely",
         " Will Lee",
         " Brennan Gilmore",
         " David Knicely ",
         " Ann Marie Calhoun (née Simpson)",
         " Mary Simpson",
         " Ronald \"Rooster\" Ruley ",
         " Jeremiah Ruley ",
         " Larry Keel ",
         " Jenny Keel ",
         " Nate Leath ",
         " Shannon Wheeler"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band based in Lexington, Virginia who also play New Grass and Jazz music.\n",
      "Gary [PERSON_NAME_LAST_1] was born into a musical family in Lexington, Virginia, and first performed publicly at ten. He has performed with his father, Pat [PERSON_NAME_LAST_1], his brother, Ronald \"Rooster\" [PERSON_NAME_LAST_1], and his son, [PERSON_NAME_FULL_1_MALE]. \"Sisters Sandy, Sue and Kathy . . were strong musicians in their own rights.\" The strong musical tradition of his hometown rooted the musical [PERSON_NAME_LAST_1] family in bluegrass and mountain music.  The [PERSON_NAME_LAST_1]s were \"ahead of the curve that became the explosion of bluegrass popularity commencing in the mid-[YEAR]s.\"  Gary's musical journey was launched by many performances at a young age singing and flatpicking in and around Lexington, which was at the time a \"hotbed of nightly entertainment of live acoustic music. Many nights would feature four or five different bands performing at various venues.\"\n",
      "He grew up performing with diverse musicians for functions at Washington and Lee University, Virginia Military Institute, The University of Virginia, and various weddings and socials.\n"
   ]
}