{
   "Awards": {
      "Bluegrass Unlimited National Bluegrass Survey": {
         "text": [
            "Long Forgotten Dream was their first album to appear on the Bluegrass Unlimited (BU) National Bluegrass Survey with four months on the chart;[7] Spread Your Wings followed with three months;[8] and Another Night of Waiting for nine months with a peak ranking of No. 7.[9]\nIn July 2003 \"Bona Fide\" became their first album to reach No. 1 on the BU National Bluegrass Survey;[10] \"A Long Way Back Home\" occupied the No. 1 position for four months;[11] \"Red Letter Day\"  for two months;[12] \"Iron and Diamonds\" for one month;[13] \"Ring the Bell\" for two months;[14] \"Help My Brother\" for eight months;[15] and \"They Called It Music\" for six months.[16]\n",
            "Singles from their recordings have consistently made the BU Songs Chart with \"Long Forgotten Dream\" lasting eight months, \"Picture in the Moonlight\" eleven and \"She Paints a Picture\" thirteen. The first single to attain No. 1 position was held by \"Mountain Song\" for two consecutive months;[17] \"Ring the Bell\" for three;[18] \"Farm of Yesterday\" for two;[19] \"Help My Brother\" for three;[20] and \"They Called It Music\" for three.[16]\n"
         ]
      },
      "Honorary degrees": {
         "text": [
            "On May 16, 2015 both Eric and Leigh received honorary doctorates of fine arts from the State University of New York during the spring commencement at SUNY Plattsburgh.[21]\n"
         ]
      },
      "International Bluegrass Music Association Awards": {},
      "Society for the Preservation of Bluegrass Music in America Awards": {}
   },
   "Discography": {
      "Albums": {},
      "As guest artists": {}
   },
   "External links": {},
   "References": {},
   "Sections": [
      "1 Awards",
      "1.1 International Bluegrass Music Association Awards",
      "1.2 Society for the Preservation of Bluegrass Music in America Awards",
      "1.3 Bluegrass Unlimited National Bluegrass Survey",
      "1.4 Honorary degrees",
      "2 Discography",
      "2.1 Albums",
      "2.2 As guest artists",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "The Gibson Brothers is an American bluegrass band which has performed professionally since the late 1980s.[1][2]\n",
         "The International Bluegrass Music Association (IBMA) awarded the Gibson Brothers Emerging Artist of the Year honors in 1998 following the Alan O'Bryant produced album Another Night of Waiting on the Hay Holler label. They debuted on the Grand Ole Opry on April 11, 2003. \"Ring the Bell\" (written by Chet O'Keefe) won Song of the Year and Gospel Recorded Performance of the Year  in 2010. Their first tour abroad was to Ireland and then Germany in 2010. In 2012 they returned to Germany with stops in Denmark, France, and Italy. The brothers debuted on Garrison Keillor's A Prairie Home Companion on October 4, 2014 at the Fitzgerald Theater in St. Paul, Minnesota and returned on January 17, 2015.\n"
      ]
   },
   "Title": "Gibson Brothers (bluegrass duo) - Wikipedia"
}