{
   "Name": "Gibson Brothers (bluegrass duo)",
   "rawData": [
      "The Gibson Brothers is an American bluegrass band which has performed professionally since the late 1980s.\n",
      "The International Bluegrass Music Association (IBMA) awarded the Gibson Brothers Emerging Artist of the Year honors in 1998 following the Alan O'Bryant produced album Another Night of Waiting on the Hay Holler label. They debuted on the Grand Ole Opry on April 11, 2003. \"Ring the Bell\" (written by Chet O'Keefe) won Song of the Year and Gospel Recorded Performance of the Year  in 2010. Their first tour abroad was to Ireland and then Germany in 2010. In 2012 they returned to Germany with stops in Denmark, France, and Italy. The brothers debuted on Garrison Keillor's A Prairie Home Companion on October 4, 2014 at the Fitzgerald Theater in St. Paul, Minnesota and returned on January 17, 2015.\n",
      "Long Forgotten Dream was their first album to appear on the Bluegrass Unlimited (BU) National Bluegrass Survey with four months on the chart; Spread Your Wings followed with three months; and Another Night of Waiting for nine months with a peak ranking of No. 7.\nIn July 2003 \"Bona Fide\" became their first album to reach No. 1 on the BU National Bluegrass Survey; \"A Long Way Back Home\" occupied the No. 1 position for four months; \"Red Letter Day\"  for two months; \"Iron and Diamonds\" for one month; \"Ring the Bell\" for two months; \"Help My Brother\" for eight months; and \"They Called It Music\" for six months.\n"
   ],
   "infobox": {
      "Origin": [
         "Plattsburgh, New York, U.S."
      ],
      "Genres": [
         "Bluegrass, Americana"
      ],
      "Years active": [
         "1987–present"
      ],
      "Labels": [
         "Rounder, Compass, Sugar Hill, Hay Holler"
      ],
      "Website": [
         "gibsonbrothers.com"
      ],
      "Members": [
         "Eric Gibson",
         "Leigh Gibson",
         "Jesse Brock",
         "Mike Barber"
      ]
   },
   "albums": [
      "Underneath a Harvest Moon",
      "Long Forgotten Dream",
      "Spread Your Wings",
      "Another Night of Waiting",
      "Bona Fide",
      "A Long Way Back Home",
      "Red Letter Day",
      "Iron and Diamonds",
      "Ring the Bell",
      "Help My Brother",
      "They Called It Music",
      "Brotherhood",
      "In the Ground",
      "Mockingbird"
   ],
   "prunedData": [
      "The [BAND_NAME] is an [GENRE] band which has performed professionally since the late [YEAR]s.\n",
      "The International Bluegrass Music Association (IBMA) awarded the [BAND_NAME] Emerging Artist of the Year honors in [YEAR] following the Alan O'Bryant produced album Another Night of Waiting on the Hay Holler label. They debuted on the Grand Ole Opry on [MONTH] 11, [YEAR]. [SONG_NAME] (written by Chet O'Keefe) won Song of the Year and Gospel Recorded Performance of the Year  in [YEAR]. Their first tour abroad was to Ireland and then Germany in [YEAR]. In [YEAR] they returned to Germany with stops in Denmark, France, and Italy. The brothers debuted on [PERSON_NAME_FULL_0_MALE]'s A Prairie Home Companion on [MONTH] 4, [YEAR] at the Fitzgerald Theater in St. Paul, Minnesota and returned on [MONTH] 17, [YEAR].\n",
      "Long Forgotten Dream was their first album to appear on the Bluegrass Unlimited (BU) National Bluegrass Survey with four months on the chart; Spread Your Wings followed with three months; and Another Night of Waiting for nine months with a peak ranking of No. 7.\nIn [MONTH] [YEAR] [SONG_NAME] for six months.\n"
   ]
}