{
   "Name": "The Grascals",
   "Sections": [
      "1 Members",
      "1.1 Terry Smith",
      "1.2 Danny Roberts",
      "1.3 Kristin Scott Benson",
      "1.4 Adam Haynes",
      "1.5 John Bryan",
      "1.6 Chris Davis",
      "2 Line Up Changes",
      "3 History",
      "4 Noteworthy Accomplishments",
      "5 Awards",
      "5.1 IBMA",
      "5.2 SPBGMA (Society of the Preservation of Bluegrass Music of America)",
      "5.3 Grammy Nominations",
      "5.4 Miscellaneous Honors and Awards",
      "6 Discography",
      "6.1 Albums",
      "6.2 Singles",
      "6.3 Music Videos",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "The Grascals are a six-piece American bluegrass band from Nashville, Tennessee. Founded in February 2004, the band has gained a level of notoriety by playing on the Grand Ole Opry and bluegrass festivals around the country, as well as with Dolly Parton.[1][2]\n"
      ]
   },
   "Members": {
      "Terry Smith": {
         "text": [
            "Terry Smith was born June 15, 1960, in Reidsville, North Carolina. He moved to Nashville in his early teens, after starting out playing in a family band with his mother Hazel Smith, father Patrick Smith, and brother, Billy Smith. Terry has played with such legends as Jimmy Martin, Wilma Lee Cooper, and the Osborne Brothers. Terry and his brother, Billy, recorded an album for CBS Records, which evolved to a number one video on CMT with \"Blues Stay Away From Me.\"  After touring with Grand Ole Opry member Mike Snider, Terry joined the Grascals and remains as a founding member.\n"
         ]
      },
      "Danny Roberts": {
         "text": [
            "Danny Roberts started playing guitar to back up Jimmy Mattingly when they were growing up in Leitchfield, Kentucky. He began to win contests for his guitar playing, and eventually, mandolin. In 1982, he co-founded the New Tradition, bluegrass/gospel group that toured the country for close to 20 years. The band recorded 10 CDs, made \"Seed of Love\" song, the first bluegrass video to feature the banjo, and even reached number one on the TNN channel. That band broke up in 2000, but Danny still continued to play with others including Marty Raybon, Larry Cordle, and Melonie Cannon. He also joined Ronnie Reno's band, the Reno Tradition. Danny joined the Grascals as a founding member, where he was reunited with Jimmy Mattingly.\n"
         ]
      },
      "Kristin Scott Benson": {
         "text": [
            "Kristin Scott Benson grew up in South Carolina in a musical family and joined the Grascals in January 2009. She worked previously with Petticoat Junction, Larry Cordle & Lonesome Standard Time and the Larry Stephenson Band. She has won the IBMA and SPBGMA Banjo Player of the Year numerous times. In September 2018, she was chosen as the recipient of the Steve Martin Prize for Excellence in Banjo and Bluegrass with a $50,000 reward. Kristin is married to IIIrd Tyme Out mandolin player Wayne Benson.[4]\n"
         ]
      },
      "Adam Haynes": {
         "text": [
            "Adam Haynes has an impressive pedigree having played with some of the finest: Melvin Goins & Windy Mountain, The James King Band, David Parmley & Continental Divide, Dailey & Vincent, Larry Stephenson Band, and most recently Grasstowne. Adam is originally from Norwalk, Ohio, but spent quite some time in Eastern Kentucky where his family has roots. Adam currently makes his home in Portland, Tennessee. He joined the Grascals in October 2013.\n"
         ]
      },
      "John Bryan": {
         "text": [
            "John Bryan sings lead vocals and plays guitar with the Grascals. He’s been playing and singing bluegrass since he was a teen, with a deep, family connection to the music. John’s grandfather, Willard Watson, was a first cousin to Doc, and a fine old time musician and dancer in his own right.  John was formerly with Larry Efaw and The Bluegrass Mountaineers is when he joined the Grascals in April 2015.\n"
         ]
      },
      "Chris Davis": {
         "text": [
            "Chris Davis was born in Xenia, Ohio, and has been playing bluegrass since he was around 15 years old.  Self-taught, he has worked with many bands including Larry Cordle, Marty Raybon, Wildfire, Junior Sisk, Alecia Nugent and Diamond Rio.  Chris joined the Grascals on lead vocals and guitar in May 2019.[3]\n"
         ]
      }
   },
   "Line Up Changes": {},
   "History": {
      "text": [
         "The original concept of the Grascals occurred when the four core members, Terry Eldredge, Jamie Johnson, Jimmy Mattingly, and Dave Talbot, asked Terry Smith and Danny Roberts to join a new group they were wanting to start. They played one of their first shows at the Station Inn in February 2004 with special guest Bobby Osborne. An interesting fact to mention is that the band believed that this wouldn't really go anywhere, almost as a side job to add a little money for their families.[citation needed] The Grascals began recording their first album in 2004, which would simply be a self-titled album on Rounder Records. This album featured such songs as \"Me and John and Paul\" written by Harley Allen, \"Where Corn Don't Grow\" and another popular cover song, \"Viva Las Vegas,\" which featured Dolly Parton.  During the recording, Dolly Parton showed interest in wanting to play with the Grascals.  The band soon became Dolly's opening act, as well as her bluegrass band.[2] Performing at Dollywood and the Grand Ole Opry, the band and Dolly played a cover version of Elvis's song, \"Viva Las Vegas.\" The first album made it on to the Billboard charts, as well as many country and bluegrass charts. Also on the album cover, Dolly is quoted saying, \"One of the greatest albums I've ever heard.\"[10]\n"
      ]
   },
   "Noteworthy Accomplishments": {},
   "Awards": {
      "IBMA": {
         "text": [
            "The Grascals have won the following 10 International Bluegrass Music Association (IBMA) awards.[45][46]\n"
         ]
      },
      "SPBGMA (Society of the Preservation of Bluegrass Music of America)": {
         "text": [
            "The Grascals have also been awarded these 28 awards by the Society for the Preservation of Bluegrass Music of America (SPBGMA).[47]\n"
         ]
      },
      "Grammy Nominations": {
         "text": [
            "The Grascals have received three (3) Grammy Nominations for the following:[48]\n"
         ]
      },
      "Miscellaneous Honors and Awards": {}
   },
   "Discography": {
      "Albums": {},
      "Singles": {},
      "Music Videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Grascals are a six-piece American bluegrass band from Nashville, Tennessee. Founded in February 2004, the band has gained a level of notoriety by playing on the Grand Ole Opry and bluegrass festivals around the country, as well as with Dolly Parton.[1][2]\n",
      "Terry Smith was born June 15, 1960, in Reidsville, North Carolina. He moved to Nashville in his early teens, after starting out playing in a family band with his mother Hazel Smith, father Patrick Smith, and brother, Billy Smith. Terry has played with such legends as Jimmy Martin, Wilma Lee Cooper, and the Osborne Brothers. Terry and his brother, Billy, recorded an album for CBS Records, which evolved to a number one video on CMT with \"Blues Stay Away From Me.\"  After touring with Grand Ole Opry member Mike Snider, Terry joined the Grascals and remains as a founding member.\n",
      "Danny Roberts started playing guitar to back up Jimmy Mattingly when they were growing up in Leitchfield, Kentucky. He began to win contests for his guitar playing, and eventually, mandolin. In 1982, he co-founded the New Tradition, bluegrass/gospel group that toured the country for close to 20 years. The band recorded 10 CDs, made \"Seed of Love\" song, the first bluegrass video to feature the banjo, and even reached number one on the TNN channel. That band broke up in 2000, but Danny still continued to play with others including Marty Raybon, Larry Cordle, and Melonie Cannon. He also joined Ronnie Reno's band, the Reno Tradition. Danny joined the Grascals as a founding member, where he was reunited with Jimmy Mattingly.\n",
      "Kristin Scott Benson grew up in South Carolina in a musical family and joined the Grascals in January 2009. She worked previously with Petticoat Junction, Larry Cordle & Lonesome Standard Time and the Larry Stephenson Band. She has won the IBMA and SPBGMA Banjo Player of the Year numerous times. In September 2018, she was chosen as the recipient of the Steve Martin Prize for Excellence in Banjo and Bluegrass with a $50,000 reward. Kristin is married to IIIrd Tyme Out mandolin player Wayne Benson.[4]\n"
   ]
}