{
   "Name": "Hayseed Dixie",
   "rawData": [
      "Hayseed Dixie is an American band formed in Nashville, Tennessee in 2000. Their first album was A Hillbilly Tribute to AC/DC. The band performs bluegrass cover versions of hard rock songs and also original songs of a mostly satirical or absurdist nature in a self-created musical genre which the band calls \"rockgrass.\" The band's name is a linguistic play on the name of the band AC/DC.\n",
      "Hayseed Dixie plays hard rock and bluegrass music on electrified acoustic bluegrass instruments. The band has released 16 studio albums and played over 1,400 live dates in 31 different countries since its inception in 2000.\n",
      "Upon the release of the debut album, A Hillbilly Tribute to AC/DC, on April 17, 2001, which consisted of acoustic hillbilly-styled reworkings of AC/DC songs, Hayseed Dixie received considerable morning-show radio airplay in the US, selling over 250,000 albums in the US from 2001 to 2003. The band toured the US club and festival circuit extensively during that time. In March 2003, the band had three different albums in the Top 15 in the bluegrass category of the US Billboard charts at the same time. Western Europe, however, has shown the group the most enduring appreciation.\n"
   ],
   "infobox": {
      "Also known as": [
         "Kerosene Brothers"
      ],
      "Origin": [
         "United States"
      ],
      "Genres": [
         "Rockgrass",
         "parody",
         "bluegrass",
         "comedy rock"
      ],
      "Years active": [
         "2001–present"
      ],
      "Labels": [
         "Dualtone",
         "Cooking Vinyl",
         "Festival Mushroom Records",
         "Råtass Records",
         "Cargo Records"
      ],
      "Website": [
         "www.hayseed-dixie.com"
      ],
      "Members": [
         "John Wheeler aka Barley Scotch",
         "Jake \"Bakesnake\" Byers",
         "Hippy Joe Hymas",
         "Tim Carter"
      ],
      "Past members": [
         "Kurt Carrick",
         "Mike Daly",
         "Rusty Horn",
         "Jeff Williams",
         "Chad Mize",
         "Dave Harrison",
         "Nick Buda",
         "Don Wayne Reno",
         "Dale Reno",
         "Jason D Smith"
      ]
   }
}