{
   "Discography": {
      "text": [
         "Studio albums:\n",
         "Live albums:\n"
      ]
   },
   "External links": {},
   "History": {
      "text": [
         "Hot Rize started performing January 18, 1978, with Tim O'Brien on mandolin and fiddle, Pete Wernick on banjo, Charles Sawtelle on bass and Mike Scap on guitar.[3] Scap left the band with Nick Forster (electric bass) joining in April, thereby allowing Sawtelle to switch to acoustic guitar.[4] That established the four-man line-up that lasted over 20 years: O'Brien on mandolin, fiddle and lead vocals, Forster on electric bass, harmony vocals, and emcee work, Sawtelle, on guitar and occasional lead vocals, and Wernick as \"Dr. Banjo\".[1]\n",
         "Their first, self-titled album was recorded in 1979 with follow-up Radio Boogie, released in 1981.[5]\n",
         "The band issued six studio albums before disbanding in 1990. That year they received the first Entertainer of the Year Award issued by the International Bluegrass Music Association. The following year, their album Take It Home received a Grammy nomination, and a song from the album, Colleen Malone, won Song of the Year from the IBMA.\n",
         "From 1991–98 the band played several reunion dates each year. Following the death in 1999 of Charles Sawtelle, Hot Rize re-grouped in 2002, adding Bryan Sutton to play the guitar.[6]\n",
         "In 2014 Hot Rize released its first studio album with Sutton, \"When I'm Free\", on Ten in Hand Records, and set out on their first major tour in over 20 years in support of the record.[7]\n",
         "When touring, Hot Rize often incorporates a performance as a Western swing band called Red Knuckles and the Trailblazers.[8]\n"
      ]
   },
   "Origin of the band name": {
      "text": [
         "The band takes its name from the leavening ingredient found in Martha White flour and cornmeal products.[8] Hot Rize often performs the theme song to the now defunct \"Martha White Biscuit and Cornbread Time\", a radio show in the late 1950s and early 1960s on Nashville station WSM featuring Flatt and Scruggs.[9]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Origin of the band name",
      "3 Discography",
      "4 See also",
      "5 References",
      "6 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "Hot Rize is a bluegrass band that rose to prominence in the early 1980s. Established in 1978,[1] Hot Rize has appeared on national radio and TV shows, and has toured most of the United States, as well as Japan, Europe and Australia.[2]\n"
      ]
   },
   "Title": "Hot Rize - Wikipedia"
}