{
   "Name": "Russell Moore and IIIrd Tyme Out",
   "rawData": [
      "Russell Moore and IIIrd Tyme Out (formerly known as IIIrd Tyme Out) is a bluegrass band formed in 1991 in Cumming, Georgia. Consisting of Russell Moore (lead vocals and guitar), Keith McKinnon (vocals and banjo), Nathan Aldridge (vocals and fiddle), Wayne Benson (vocals and mandolin) and Dustin Pyrtle (vocals and bass), the band has released thirteen albums and two greatest hits collections since 1991. A regular on bluegrass radio, their works have earned them many individual and group IBMA and SPBGMA award nominations including the prestigious IBMA Vocal Group of the Year award which they've won numerous times.\n",
      "In November 2013, banjo player Steve Dilling and bass player Edgar Loudermilk announced their intentions to leave IIIrd Tyme Out. Steve Dilling cited health reasons as his reason for leaving the band while Edgar Loudermilk decided to capitalize on a songwriting and solo CD push. It was later announced that Keith McKinnon would be the new banjo player and Blake Johnson would be the new bass player. The new lineup performed together on stage for the first time in January 2014 in Galax, Virginia.\n",
      "IIIrd Tyme Out headlined at the Central Canadian Bluegrass Awards show in Huntsville, Ontario, Canada in 1996 and again in 1998. They performed at the 4th Annual Willow Park Bluegrass Jamboree in Hagersville, Ontario, in August, 2002. In 2005 they performed at the Gettysburg Bluegrass Festival. The band toured as part of the Bluegrass Sundays Winter Concert Series organized by the Northern Bluegrass Committee in Ontario, Canada in 2011.\n"
   ],
   "infobox": {
      "Also known as": [
         "3TO",
         "3xoutandmoore",
         "3rd Tyme Out"
      ],
      "Origin": [
         "Cumming, Georgia, U.S."
      ],
      "Genres": [
         "Bluegrass",
         "Bluegrass Gospel"
      ],
      "Years active": [
         "1994-present"
      ],
      "Labels": [
         "Rebel/Rounder/Chateau Music Group/Rural Rhythm Records"
      ],
      "Website": [
         "www.iiirdtymeout.com "
      ],
      "Members": [
         "Russell Moore",
         "Keith McKinnon ",
         "Wayne Benson",
         "Dustin Pyrtle ",
         "Nathan Aldridge"
      ],
      "Past members": [
         "Steve Dilling",
         "Edgar Loudermilk",
         "Ray Deaton",
         "Greg Luck",
         "Alan Perdue",
         "Mike Hartgrove",
         "Terry Baucom",
         "Lou Reid",
         "Alan Bibey",
         "Barry Abernathy",
         "Justen Haynes ",
         "Blake Johnson",
         "Jerry Cole"
      ]
   }
}