{
   "Name": "The Infamous Stringdusters",
   "Sections": [
      "1 Formation",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Extended plays",
      "2.3 Singles",
      "2.4 Live Albums",
      "2.5 Music videos",
      "3 Awards",
      "3.1 Grammy Awards",
      "3.2 International Bluegrass Music Awards",
      "4 Live performances",
      "4.1 Current[when?] members",
      "4.2 Former members",
      "5 Reception",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "The Infamous Stringdusters are a progressive acoustic/bluegrass band. The band first emerged in 2006 with the limited release of a five-song extended play CD The Infamous Stringdusters,[1] followed in 2007 by their first album Fork in the Road. Both of these were on Sugar Hill Records. The band consists of Andy Hall (Dobro), Andy Falco (guitar), Chris Pandolfi (banjo), Jeremy Garrett (fiddle), and Travis Book (double bass).[2] The band has become known for a complex, distinctive, and groove-friendly sound along with a bluegrass theme.[3]\n",
         "The Infamous Stringdusters won three awards at the International Bluegrass Music Association Awards Ceremony in October 2007: Emerging Artist of the Year, Album of the Year for Fork in the Road (in a tie with J.D. Crowe & the New South's album Lefty's Old Guitar), and Song of the Year for the album's title cut.[4] The band was also nominated for 2011 Entertainer of the Year by the International Bluegrass Music Association.[5]\n",
         "In 2011, \"Magic No. 9\" (from Things That Fly) was nominated for the Grammy Award for Best Country Instrumental Performance. In 2018, they won the Grammy Award for Best Bluegrass Album.\n"
      ]
   },
   "Formation": {
      "text": [
         "The creation of the Infamous Stringdusters is first based on the relationships that banjo player Chris Pandolfi, dobro player Andy Hall, and former guitarist Chris Eldridge formed while in Boston, Massachusetts. Hall, Pandolfi and Eldridge were students at Berklee College of Music.[6]  Pandolfi and Eldridge soon followed Andy Hall to Nashville, Tennessee, where they met Hall's Ronnie Bowman Committee bandmates Jesse Cobb (mandolin) and Jeremy Garrett (fiddle). The group then held an audition for a possible bassist in the fall of 2005, where they found Travis Book. Book had been residing in Durango, Colorado. Eldridge soon departed in 2007 to join Chris Thile's Punch Brothers and was replaced by guitarist Andy Falco.[6] In October 2011, Jesse Cobb announced his departure from the group. Cobb cited mental and physical stress as the reason for his leaving days before the release of We'll Do It Live.[7]\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Extended plays": {},
      "Singles": {},
      "Live Albums": {},
      "Music videos": {}
   },
   "Awards": {
      "Grammy Awards": {
         "text": [
            "The Recording Academy represents the voices of performers, songwriters, producers, engineers, and all music professionals. They celebrate artistic excellence through the GRAMMY Awards - music's only peer-recognized accolade and highest achievement.\n"
         ]
      },
      "International Bluegrass Music Awards": {
         "text": [
            "Performance-centered awards recognizing outstanding achievement and pioneering effort in bluegrass music.[15] Presented by the International Bluegrass Music Association.\n"
         ]
      }
   },
   "Live performances": {
      "Current[when?] members": {},
      "Former members": {},
      "text": [
         "Live performances have become the main focus of the band. The Infamous Stringdusters focus their recording on how their tracks will play live, with audience interaction.[16] During live shows, the Stringdusters are known to take to their Jam Band roots and visit long improvisational and instrumental sets.[17]  The band uses these long, improvisations to showcase every member's individual talents, through solo performances or other methods.[18] The band also records almost all of their live shows and posts them on nugs.net.[19]\n"
      ]
   },
   "Reception": {
      "text": [
         "Throughout the Stringdusters' years touring, the group has been described as \"a future supergroup,\" \"phenomenon,\" \"intricately improvisational,\" and \"flawless\" by bluegrass critics. The band's music is described by many to walk the fine line between soft traditional folk and bluegrass songwriting and resilient jamming.[20] Among all of the group's released recordings, The Infamous Stringdusters,Things That Fly and\nLaws of Gravity have been the most critically acclaimed. At the end of 2011, the Stringdusters were named one of the top-trending bands of the year, just behind the Foo Fighters, The Wood Brothers, and B.B. King.[21]\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Infamous Stringdusters are a progressive acoustic/bluegrass band. The band first emerged in 2006 with the limited release of a five-song extended play CD The Infamous Stringdusters,[1] followed in 2007 by their first album Fork in the Road. Both of these were on Sugar Hill Records. The band consists of Andy Hall (Dobro), Andy Falco (guitar), Chris Pandolfi (banjo), Jeremy Garrett (fiddle), and Travis Book (double bass).[2] The band has become known for a complex, distinctive, and groove-friendly sound along with a bluegrass theme.[3]\n",
      "The Infamous Stringdusters won three awards at the International Bluegrass Music Association Awards Ceremony in October 2007: Emerging Artist of the Year, Album of the Year for Fork in the Road (in a tie with J.D. Crowe & the New South's album Lefty's Old Guitar), and Song of the Year for the album's title cut.[4] The band was also nominated for 2011 Entertainer of the Year by the International Bluegrass Music Association.[5]\n",
      "In 2011, \"Magic No. 9\" (from Things That Fly) was nominated for the Grammy Award for Best Country Instrumental Performance. In 2018, they won the Grammy Award for Best Bluegrass Album.\n",
      "The creation of the Infamous Stringdusters is first based on the relationships that banjo player Chris Pandolfi, dobro player Andy Hall, and former guitarist Chris Eldridge formed while in Boston, Massachusetts. Hall, Pandolfi and Eldridge were students at Berklee College of Music.[6]  Pandolfi and Eldridge soon followed Andy Hall to Nashville, Tennessee, where they met Hall's Ronnie Bowman Committee bandmates Jesse Cobb (mandolin) and Jeremy Garrett (fiddle). The group then held an audition for a possible bassist in the fall of 2005, where they found Travis Book. Book had been residing in Durango, Colorado. Eldridge soon departed in 2007 to join Chris Thile's Punch Brothers and was replaced by guitarist Andy Falco.[6] In October 2011, Jesse Cobb announced his departure from the group. Cobb cited mental and physical stress as the reason for his leaving days before the release of We'll Do It Live.[7]\n"
   ],
   "infobox": {
      "Origin": [
         "Nashville, Tennessee, United States"
      ],
      "Genres": [
         "Progressive bluegrass, folk, country, jam band"
      ],
      "Years active": [
         "2006–present"
      ],
      "Labels": [
         "Sugar Hill, High Country, Compass, Lumenhouse, Tape Time"
      ],
      "Associated acts": [
         "Punch Brothers, Keller Williams, Ryan Adams, Phil Lesh and Friends, Nicki Bluhm, Greensky Bluegrass, The String Cheese Incident, Josh Shilling"
      ],
      "Website": [
         "thestringdusters.com"
      ],
      "Members": [
         "Andy Hall ",
         "Andy Falco ",
         "Chris Pandolfi",
         "Jeremy Garrett",
         "Travis Book"
      ],
      "Past members": [
         "Chris Eldridge",
         "Jesse Cobb"
      ]
   }
}