{
   "Name": "Kentucky Colonels (band)",
   "Sections": [
      "1 History",
      "1.1 Early years",
      "1.2 Commercial success",
      "1.3 1973 reunion",
      "2 Members",
      "3 Discography",
      "3.1 Albums",
      "3.2 Singles",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Kentucky Colonels were a bluegrass band that was popular during the American folk music revival of the early 1960s.[1] Formed in Burbank, California in 1954, the group released two albums, The New Sound of Bluegrass America (1963) and Appalachian Swing! (1964). The band featured the influential bluegrass guitarist Clarence White, who was largely responsible for making the acoustic guitar a lead instrument within bluegrass,[2] and who later went on to join the Los Angeles rock band the Byrds.[3]  The Kentucky Colonels disbanded in late 1965, with two short-lived reunions taking place in 1966 and 1973.\n"
      ]
   },
   "History": {
      "Early years": {
         "text": [
            "In 1954, the three White brothers, Roland (mandolin), Clarence (acoustic guitar), and Eric Jr. (banjo and double bass) formed a country trio called Three Little Country Boys.[4]  The family group, which was occasionally augmented by the brothers' sister Joanne on bass,[5][6] won a talent contest early on in their career, on radio station KXLA in Pasadena, and, by 1957, had managed to attract the interest of country guitarist Joe Maphis.[7]  With Maphis's help, the Three Little Country Boys made several appearances on the popular television program Town Hall Party.[7]\n",
            "As a result of Roland's growing interest in bluegrass music, the group soon switched to an entirely bluegrass repertoire.[6]  In 1957, banjoist Billy Ray Latham and Dobro player LeRoy Mack were added to the line-up,[5] with the group renaming themselves the Country Boys soon after.[4]  In 1961, bassist Roger Bush replaced Eric Jr., who had left the band to get married.[4]  That same year, the quartet had become popular enough to appear twice on The Andy Griffith Show.[4]  Between 1959 and 1962, the Country Boys released three singles on the Sundown, Republic and Briar International record labels.[7]\n"
         ]
      },
      "Commercial success": {
         "text": [
            "In September 1962, the Country Boys recorded their debut album for Briar International.[4]  At Maphis's suggestion, the band decided to change their name to the Kentucky Colonels,[4] with their album being released in early 1963, under the title The New Sound of Bluegrass America.[8]  Around this time, Clarence's flatpicking guitar style became a more prominent part of the group's sound,[6] with his speed and virtuosity on the instrument being largely responsible for making the guitar a lead instrument within bluegrass music.[8][2]  In addition to being accomplished musicians, the Kentucky Colonels' music often featured close harmony vocals, with Clarence singing lead and baritone, Roland singing lead and tenor, Roger on lead and bass, and Billy Ray singing lead, tenor, and high baritone.[9]\n",
            "Following the release of their debut album, the Kentucky Colonels became well known on the bluegrass circuit during 1963 and 1964, performing at a multitude of folk and country venues throughout California and the United States, including an appearance at the prestigious Monterey Folk Festival in May 1963.[4]  While they may not have enjoyed the same level of commercial success as their contemporaries the Dillards, the group were highly influential and their strict adherence to a traditional, purist bluegrass repertoire saw their albums become underground classics.[10][11]\n",
            "In 1964, while continuing to make live appearances,[4] the band were signed to World Pacific Records by producer Jim Dickson,[12] who would later become the manager of the folk rock band the Byrds.  After the recruitment of fiddle player Bobby Slone,[4] the Colonels released their second album, the purely instrumental Appalachian Swing! in April 1964.[13]  Although it failed to chart, the album was a commercial success, with White's flatpicking permanently expanding the language of bluegrass guitar.[12]  Writing for the AllMusic website, critic Thom Owens has described the album as \"one of the most influential albums in the whole of bluegrass music, primarily because of the stunning playing of Clarence White.\"[14]  Owens also noted that White's playing on the album \"helped pioneer a new style in bluegrass; namely, he redefined the acoustic guitar as a solo instrument.\"[14]  By the close of the year, the Kentucky Colonels were considered by fans and critics to be one of the best bluegrass groups in the United States.[4]\n",
            "Although they were now a successful recording act, it was becoming increasingly hard for the Colonels to make a living playing bluegrass.[7]  The folk music revival of the late 1950s and early 1960s—which had helped facilitate the Colonels' commercial success—had been dealt a serious blow in 1964 by the popularity of the beat music of the British Invasion.  However, it wasn't until mid-1965, with the release of the Byrds' folk rock single \"Mr. Tambourine Man\" and Bob Dylan's \"Subterranean Homesick Blues\", that the folk revival's popularity began to seriously wane.  Before long, many young folk performers and some bluegrass acts were switching to electric instrumentation.[7]  The Kentucky Colonels followed suit, plugging in with electric instruments and hiring a drummer, in order to keep a concert booking as a country dance band at a bowling alley.[15]  The band added fiddle player Scotty Stoneman to their line-up in mid-1965, as a replacement for Slone,[7] but some months later, the Kentucky Colonels dissolved as a band after a show on October 31, 1965.[8]\n",
            "In 1966, Clarence, Roland and Eric Jr. reunited, with rhythm guitarist Dennis Morris, banjo player Bob Warford, and fiddle player Bobby Crane to form a new version of the Kentucky Colonels.[16]  This line-up of the band made sporadic concert appearances and also recorded a series of demos that were eventually released in 1979 on the archival album Kentucky Colonels 1966.[16]  The group continued to make concert appearances until 1967 when Clarence was asked to play with Bill Monroe and the Blue Grass Boys.[16]  Although Clarence declined the offer, his brother Roland took the job and, as a result, the Colonels once more disbanded.[16]\n"
         ]
      },
      "1973 reunion": {
         "text": [
            "In early 1973, Roland, Eric Jr. and Clarence reunited once again for a series of shows as the White Brothers (a.k.a. The New Kentucky Colonels).[17]  The trio was augmented by Herb Pedersen on guitar and Alan Munde on banjo.[18]  After playing a handful of shows in California, including one at the Ash Grove folk club in Los Angeles, the White Brothers departed for Europe in May 1973.[18]  One of the band's Swedish shows was later released in 1976 as The White Brothers: The New Kentucky Colonels Live in Sweden 1973,[17] while a concert recording from Breda in the Netherlands was issued in 2013 as Live in Holland 1973.[19]\n",
            "Returning to the United States, the New Kentucky Colonels took part in a four-date country rock package tour in June 1973, with Gram Parsons, Emmylou Harris, Country Gazette, Sneaky Pete Kleinow, Gene Parsons, Byron Berline, and Chris Ethridge among others.[20]\n",
            "Clarence White died on July 15, 1973, after being struck by a drunk driver, while he loaded his gear into the back of a car, in Palmdale, California, following a concert by the New Kentucky Colonels.[21]  This tragic event marked the end of the Kentucky Colonels.\n"
         ]
      }
   },
   "Members": {},
   "Discography": {
      "Albums": {},
      "Singles": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Kentucky Colonels were a bluegrass band that was popular during the American folk music revival of the early 1960s.[1] Formed in Burbank, California in 1954, the group released two albums, The New Sound of Bluegrass America (1963) and Appalachian Swing! (1964). The band featured the influential bluegrass guitarist Clarence White, who was largely responsible for making the acoustic guitar a lead instrument within bluegrass,[2] and who later went on to join the Los Angeles rock band the Byrds.[3]  The Kentucky Colonels disbanded in late 1965, with two short-lived reunions taking place in 1966 and 1973.\n",
      "In 1954, the three White brothers, Roland (mandolin), Clarence (acoustic guitar), and Eric Jr. (banjo and double bass) formed a country trio called Three Little Country Boys.[4]  The family group, which was occasionally augmented by the brothers' sister Joanne on bass,[5][6] won a talent contest early on in their career, on radio station KXLA in Pasadena, and, by 1957, had managed to attract the interest of country guitarist Joe Maphis.[7]  With Maphis's help, the Three Little Country Boys made several appearances on the popular television program Town Hall Party.[7]\n",
      "As a result of Roland's growing interest in bluegrass music, the group soon switched to an entirely bluegrass repertoire.[6]  In 1957, banjoist Billy Ray Latham and Dobro player LeRoy Mack were added to the line-up,[5] with the group renaming themselves the Country Boys soon after.[4]  In 1961, bassist Roger Bush replaced Eric Jr., who had left the band to get married.[4]  That same year, the quartet had become popular enough to appear twice on The Andy Griffith Show.[4]  Between 1959 and 1962, the Country Boys released three singles on the Sundown, Republic and Briar International record labels.[7]\n",
      "In September 1962, the Country Boys recorded their debut album for Briar International.[4]  At Maphis's suggestion, the band decided to change their name to the Kentucky Colonels,[4] with their album being released in early 1963, under the title The New Sound of Bluegrass America.[8]  Around this time, Clarence's flatpicking guitar style became a more prominent part of the group's sound,[6] with his speed and virtuosity on the instrument being largely responsible for making the guitar a lead instrument within bluegrass music.[8][2]  In addition to being accomplished musicians, the Kentucky Colonels' music often featured close harmony vocals, with Clarence singing lead and baritone, Roland singing lead and tenor, Roger on lead and bass, and Billy Ray singing lead, tenor, and high baritone.[9]\n"
   ],
   "infobox": {
      "Origin": [
         "Burbank, California, United States"
      ],
      "Genres": [
         "Bluegrass"
      ],
      "Years active": [
         "1954–65; 1966–67; 1973"
      ],
      "Labels": [
         "Sundown, Republic, Briar International, World Pacific, Sierra"
      ],
      "Associated acts": [
         "The White Brothers, the New Kentucky Colonels, the Byrds, the Dillards, Country Gazette, Tut Taylor, Eric Weissberg, the Nashville Bluegrass Band, the Flying Burrito Brothers"
      ],
      "Past members": [
         "Roland White",
         "Clarence White",
         "Billy Ray Latham",
         "LeRoy Mack",
         "Roger Bush",
         "Bobby Slone",
         "Scotty Stoneman",
         "Eric White Jr.",
         "Dennis Morris",
         "Bob Warford",
         "Bobby Crane"
      ]
   }
}