{
   "Name": "Lonesome Pine Fiddlers",
   "rawData": [
      "The Lonesome Pine Fiddlers (1938- 1966) were an early bluegrass band. Throughout their formations, they included notable \"first generation\" bluegrass musicians such as Ezra Cline, Bobby Osborne, Paul Williams, Melvin Goins, Charlie Cline, Curly Ray Cline, and Larry Richardson. The Lonesome Pine Fiddlers were inducted into the International Bluegrass Music Association Hall of Fame in 2009.\n",
      "The group was started by Ezra Cline and his cousins Ireland \"Lazy Ned\" Cline and Ray \"Curly Ray\" Cline. The group was originally named \"Cousin Ezra and the Lonesome Pine Fiddlers\". Ezra played the bass, Ireland the banjo, and Ray the fiddle. After Ireland was killed on D-Day, his other brother Charlie took his place in the band. The Clines came from a large and musically talented family. Ray and Charlie's father, Charlie, was a banjo player while the women in the family, Geraldine and Bobbi, were singers. For reasons unknown, Bobbi and Geraldine never joined the band on the road but often joined in at home, especially when notable Country singers, such as Bill Monroe, Lester Flatt and Earl Scruggs, and Hank Williams, came visiting. Natives of the Gilbert Creek region of southern West Virginia, the original Lonesome Pine Fiddlers worked on radio at WHIS Bluefield, West Virginia. \n",
      "In 1949 the additions of vocalist Bobby Osborne and banjoist Larry Richardson made the Fiddlers into a bluegrass band. The group was first recorded in 1950, releasing a double-sided, shellac disk with the tracks \"Don't Forget Me\" and \"Will I Meet Mother in Heaven\" under label Cozy Records. At this time the band consisted of Ezra Cline, Larry Richardson, Ray Morgan, and Bobby Osborne. Throughout the remainder of their career, the Lonesome Pine Fiddlers would record 4 albums under Starday Records and many EPs under RCA Victor, Starday, and others. \n"
   ],
   "infobox": {
      "Origin": [
         "Bluefield, West Virginia, United States"
      ],
      "Genres": [
         "bluegrass"
      ],
      "Years active": [
         "1938-1966"
      ],
      "Past members": [
         "Ezra Cline, Charlie Cline, Curly Ray Cline, Larry Richardson, Bobby Osborne, Paul Williams, Jimmy Martin, Ray Morgan"
      ]
   },
   "albums": [],
   "prunedData": [
      "The [BAND_NAME] ([YEAR]- [YEAR]) were an [GENRE] band. Throughout their formations, they included notable [SONG_NAME] bluegrass musicians such as Ezra Cline, [PERSON_NAME_FULL_0_MALE], Paul Williams, [PERSON_NAME_FULL_1_MALE], Charlie Cline, Curly Ray Cline, and Larry Richardson. The [BAND_NAME] were inducted into the International Bluegrass Music Association Hall of Fame in [YEAR].\n",
      "The group was started by Ezra Cline and his cousins Ireland [SONG_NAME]. Ezra played the bass, Ireland the banjo, and Ray the fiddle. After Ireland was killed on D-Day, his other brother Charlie took his place in the band. The Clines came from a [GENRE] a banjo player while the women in the family, Geraldine and Bobbi, were singers. For reasons unknown, Bobbi and Geraldine never joined the band on the road but often joined in at home, especially when notable Country singers, such as Bill Monroe, [PERSON_NAME_FULL_1_MALE] and Earl Scruggs, and [PERSON_NAME_FULL_0_MALE], came visiting. Natives of the Gilbert Creek region of southern West Virginia, the original [BAND_NAME] worked on radio at WHIS Bluefield, West Virginia. \n",
      "In [YEAR] the additions of vocalist Bobby Osborne and banjoist [PERSON_NAME_FULL_0_MALE] made the Fiddlers into a [GENRE] band. The group was first recorded in [YEAR], releasing a double-sided, shellac disk with the tracks [SONG_NAME] under label Cozy Records. At this time the band consisted of Ezra Cline, [PERSON_NAME_FULL_0_MALE], [PERSON_NAME_FULL_1_MALE], and Bobby Osborne. Throughout the remainder of their career, the [BAND_NAME] would record 4 albums under Starday Records and many EPs under RCA Victor, Starday, and others. \n"
   ]
}