{
   "Name": "Mountain Heart",
   "rawData": [
      "Mountain Heart is an American band, which combines elements of rock, jam band, country, blues, jazz, folk and bluegrass music. Critics have described the band using terms such as \"acoustic overdrive\", \"Folk rock on steroids\", and \"slam grass\". Mountain Heart, or its members have won or been nominated for multiple Grammys, ACM, CMA, and IBMA Awards.  They have appeared on the revered stage of the Grand Ole Opry over 130 times and have shared the stage with acts ranging from Lynyrd Skynyrd, Levon Helm, Punch Brothers, George Jones, Merle Haggard, and Brad Paisley, to Alison Krauss, Tony Rice, Travis Tritt, Yonder Mountain Stringband, Leann Rimes and Patty Loveless.  \n",
      "The band plays large outdoor folk/roots/country music festivals, to sold-out arena shows opening for Lynyrd Skynyrd, to headlining concerts with  Tony Rice.\n",
      "Members of the band as of 2015 are:\n"
   ],
   "infobox": {
      "Origin": [
         "1998"
      ],
      "Genres": [
         "Acoustic music"
      ],
      "Website": [
         "Official website"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band, which combines elements of rock, jam band, country, blues, jazz, folk and bluegrass music. Critics have described the band using terms such as \"acoustic overdrive\", \"Folk rock on steroids\", and \"slam grass\". [BAND_NAME], or its members have won or been nominated for multiple Grammys, ACM, CMA, and IBMA Awards.  They have appeared on the revered stage of the Grand Ole Opry over 130 times and have shared the stage with acts ranging from Lynyrd Skynyrd, Levon Helm, Punch Brothers, George Jones, [PERSON_NAME_FULL_3_MALE], and Brad Paisley, to [PERSON_NAME_FULL_1_FEMALE], Tony Rice, [PERSON_NAME_FULL_0_MALE], Yonder Mountain Stringband, [PERSON_NAME_FULL_2_FEMALE] and Patty Loveless.  \n",
      "The band plays large outdoor folk/roots/country music festivals, to sold-out arena shows opening for Lynyrd Skynyrd, to headlining concerts with  Tony Rice.\n",
      "Members of the band as of [YEAR] are:\n"
   ]
}