{
   "Name": "Mountain Heart",
   "Sections": [
      "1 Band members",
      "2 History",
      "3 Awards and recognition",
      "4 Discography",
      "4.1 Music videos",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Mountain Heart is an American band, which combines elements of rock, jam band, country, blues, jazz, folk and bluegrass music. Critics have described the band using terms such as \"acoustic overdrive\", \"Folk rock on steroids\", and \"slam grass\".[1] Mountain Heart, or its members have won or been nominated for multiple Grammys,[2] ACM, CMA, and IBMA Awards.[3]  They have appeared on the revered stage of the Grand Ole Opry[4][5] over 130 times and have shared the stage with acts ranging from Lynyrd Skynyrd,[6] Levon Helm, Punch Brothers, George Jones, Merle Haggard, and Brad Paisley, to Alison Krauss,[7] Tony Rice,[8] Travis Tritt, Yonder Mountain Stringband, Leann Rimes and Patty Loveless.  \n",
         "The band plays large outdoor folk/roots/country music festivals, to sold-out arena shows opening for Lynyrd Skynyrd, to headlining concerts with  Tony Rice.[9]\n"
      ]
   },
   "Band members": {
      "text": [
         "Members of the band as of 2015 are:\n"
      ]
   },
   "History": {
      "text": [
         "The band was formed in 1998 by Barry Abernathy, Steve Gulley, Adam Steffey, and Jim VanCleve.  Johnny Dowdle was brought on early as the original bassist.  For a short period, Adam Steffey left the band to play with the bluegrass/gospel group The Isaacs.  During that period, Steffey was replaced by mandolinist, Alan Perdue.  Early in 2000, Dowdle left the group and was replaced by Jason Moore, the former bassist for the James King Band.  In 2001, Steffey returned to the group, and Mountain Heart added virtuoso guitarist, Clay Jones,[11] in 2003.\n",
         "Touring in Canada, Mountain Heart performed in Scarborough, Ontario as part of the Bluegrass Sundays Winter Concert Series in 2000 and again in 2001.[12][13] In 2005 they took part in the Gettysburg Bluegrass Festival.[14] Later, in 2007, the band visited Canada again when they entertained at the Tottenham Bluegrass Festival in Ontario.[15]\n",
         "The band released their first, eponymous project in 1999, on the now defunct, Doobie Shea Records,[16] following it quickly with their IBMA Award Winning, all-gospel release, The Journey.[17]  In 2001, the band signed with Skaggs Family Records and soon released, No Other Way, their first for the label.[18]  The project was nominated for Album of the Year honors by the IBMA and Mountain Heart was nominated for Entertainer of the Year.  In 2004, they released \"Force Of Nature\"[19] \", which was also nominated for Album of the Year honors.  Again, Mountain Heart was nominated for Entertainers of the Year.  The group released their final Skaggs Family Records recording in 2005.  Entitled, \"Wide Open\",[20] \", the album was the beginning of a stylistic departure into the Americana/Folk/Country markets.  Produced by uber-producer, Mark Bright (Carrie Underwood, Rascal Flatts, Sara Evans, BlackHawk), the project achieved stellar success for the band, both critically,[21] and at retail.\n",
         "In December 2006, the band announced that lead singer, Steve Gulley, would be leaving the group.[22] In January 2007, Josh Shilling debuted with the band at the Grand Ole Opry in Nashville, TN, and was announced as the group's new lead singer.[23]  In September of that year, Jones was replaced by Grammy Award winning guitarist, Clay Hess. In December 2007, mandolinist Aaron Ramsey replaced Steffey, making his debut also on the stage of The Grand Ole Opry.  Clay Jones returned replacing Hess in January 2009,[24] joining the band again at The Ark, in Ann Arbor, MI, which would later become the site of their 2007 (live) recording, The Road That Never Ends- The Live Album.  The band had been with the Skaggs Family Records label since 2002, but this marked their first project with Rural Rhythm Records[25] out of Los Angeles, CA, which was a single record deal.  This album, produced by the band's own, Jim VanCleve, was critically acclaimed[25][26] and highly sought after, becoming one of their best-selling projects to date.[24]  A music video for Road That Never Ends,[27] produced by Josh Shilling, was released and subsequently landed the group a spot in heavy rotation on GAC and CMT.\n",
         "In 2010, Mountain Heart ventured to open their own record label.[28]  MH Music Group was born and their first ever self-released project \"That Just Happened\" hit store shelves in January 2011.  Among the album's featured guests are New Grass Revival front man & current Doobie Brothers bassist, John Cowan,[29] legendary session drummer, Eddie Bayers,[30] and acoustic guitar whiz, Bryan Sutton.[31]  Produced again by VanCleve and Mountain Heart, \"That Just Happened\" received high praise from critics,[32][33]  even scoring a prestigious Four Star rating from Country Weekly Magazine.[34]\n",
         "In January 2012, the band welcomed into the group Seth Taylor,[35] an eighteen-year-old guitar prodigy who has won numerous awards and shared the stage with Charlie Daniels and his mentor, Brad Paisley. In his second week with the band Seth got to share the stage two nights in a row with one of his guitar heroes, Tony Rice, when Mountain Heart shared back-to-back dates with him in Georgia.\n",
         "In November 2014, Barry Abernathy left the band to focus on family and Jeff Partin of Volume Five joined on guitar, dobro, bass, vocals, and virtually every other instrument.\n",
         "Blue Skies, their first album for over five years, saw another revamped line-up, including Molly Kate Cherryholmes of Cherryholmes on fiddle.  The album was released on May 6, 2016, with a series of planned concerts to follow.[36]\n"
      ]
   },
   "Awards and recognition": {
      "text": [
         "Mountain Heart was awarded the IBMA Emerging Artist of the Year[3] award in 1999, before the release of their first recording.\n",
         "The group was awarded Gospel Recorded Performance of the Year by[17] the IBMA in 2002.\n",
         "They have since been nominated for many other IBMA awards, including, but not limited to, \"Entertainer of the Year\" (2003, 2004, 2005), \"Vocal Group of the Year\" (2003, 2004, 2005, 2006), and \"Instrumental Group of the Year\" (2002, 2003, 2004, 2005, 2006, 2007).\n",
         "Jason Moore has been nominated for \"Bass Performer of the Year\" for 2004, 2005, and 2006.\n",
         "Aaron Ramsey was a recipient of an IBMA Award for Album of the Year in 2006[37] for his involvement in Celebration of Life: Musicians Against Childhood Cancer.\n",
         "As a member of Mountain Heart, Adam Steffey won the Mandolin Player of the Year Award several times (2002, 2003, 2004, 2005, 2006).  He also was nominated as a member of Alison Krauss & Union Station for multiple CMA, ACM, and Grammy awards.\n",
         "VanCleve won a Grammy for Best Country Album in 2004 for his involvement in \"Livin', Lovin', Losin': Songs of the Louvin Brothers\".  That project won another Grammy for Best Country Vocal Collaboration (Alison Krauss and James Taylor, \"How's the World Treating You?\"). He was also nominated for a GRAMMY for \"Best Country Instrumental Performance\" for a track from his solo project, \"No Apologies\".[2]  His album, which featured all the members of Mountain Heart, was nominated for \"Instrumental Recorded Performance of the Year in 2007\".  The project also won Album of the Year Honors from the Indie Acoustic Awards.[38]  Van Cleve was also nominated for Fiddle Player of the Year by the IBMA in 2007.  He was a recipient of an IBMA Award for Album of the Year[37] in 2006 for his involvement in Celebration of Life: Musicians Against Childhood Cancer.[39]  He also was a recipient of the Recorded Event of the Year[40] award in 2012 for his involvement as producer and fiddle player on \"Life Goes On\".[40]\n"
      ]
   },
   "Discography": {
      "Music videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Mountain Heart is an American band, which combines elements of rock, jam band, country, blues, jazz, folk and bluegrass music. Critics have described the band using terms such as \"acoustic overdrive\", \"Folk rock on steroids\", and \"slam grass\".[1] Mountain Heart, or its members have won or been nominated for multiple Grammys,[2] ACM, CMA, and IBMA Awards.[3]  They have appeared on the revered stage of the Grand Ole Opry[4][5] over 130 times and have shared the stage with acts ranging from Lynyrd Skynyrd,[6] Levon Helm, Punch Brothers, George Jones, Merle Haggard, and Brad Paisley, to Alison Krauss,[7] Tony Rice,[8] Travis Tritt, Yonder Mountain Stringband, Leann Rimes and Patty Loveless.  \n",
      "The band plays large outdoor folk/roots/country music festivals, to sold-out arena shows opening for Lynyrd Skynyrd, to headlining concerts with  Tony Rice.[9]\n",
      "Members of the band as of 2015 are:\n",
      "The band was formed in 1998 by Barry Abernathy, Steve Gulley, Adam Steffey, and Jim VanCleve.  Johnny Dowdle was brought on early as the original bassist.  For a short period, Adam Steffey left the band to play with the bluegrass/gospel group The Isaacs.  During that period, Steffey was replaced by mandolinist, Alan Perdue.  Early in 2000, Dowdle left the group and was replaced by Jason Moore, the former bassist for the James King Band.  In 2001, Steffey returned to the group, and Mountain Heart added virtuoso guitarist, Clay Jones,[11] in 2003.\n"
   ],
   "infobox": {
      "Origin": [
         "1998"
      ],
      "Genres": [
         "Acoustic music"
      ],
      "Website": [
         "Official website"
      ]
   }
}