{
   "Name": "New Grass Revival",
   "Sections": [
      "1 Origin",
      "2 History",
      "2.1 Separation from mainstream bluegrass",
      "2.2 First lineup (1972-1981)",
      "2.3 Second lineup (1981-1989)",
      "2.4 After breakup",
      "3 Personnel",
      "3.1 1972 - 1974[7]",
      "3.2 1974[7]",
      "3.3 1974 - 1981[7]",
      "3.4 1981 - 1989[7]",
      "3.5 1996 reunion[7]",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "New Grass Revival was an American progressive bluegrass band founded in 1971, and composed of Sam Bush, Courtney Johnson, Ebo Walker, Curtis Burch, Butch Robins, John Cowan, Béla Fleck and Pat Flynn. They were active between 1971 and 1989, releasing more than twenty albums as well as six singles. Their highest-charting single is \"Callin' Baton Rouge\", which peaked at No. 37 on the U.S. country charts in 1989 and was a Top 5 country hit for Garth Brooks five years later.\n",
         "In 2020, the group were inducted into the Bluegrass Music Hall of Fame.[1]\n"
      ]
   },
   "Origin": {
      "text": [
         "The origins of New Grass Revival lay in the Bluegrass Alliance, which Sam Bush (vocals, fiddle, guitar, mandolin) and Courtney Johnson (banjo, vocals) joined in 1970. At the time, the Alliance also featured bassist Ebo Walker and fiddler Lonnie Peerce. Within a year after Bush's and Johnson's arrival, Curtis Burch (dobro, guitar, vocals) joined the band. In 1972, Peerce left the band, and the remaining members decided to continue under the new name New Grass Revival. The band released their eponymous debut album The Arrival of the New Grass Revival later in 1972 on Starday Records.\n"
      ]
   },
   "History": {
      "Separation from mainstream bluegrass": {
         "text": [
            "Other groups were also playing progressive bluegrass at the time, such as The Dillards, Eddie Adcock's II Generation,  and the Country Gentlemen, but few did it with the flair of the New Grass Revival. At the time, bluegrass was a very tradition-bound music; bands were expected to have short hair and dress in matching outfits. The New Grass Revival bucked these traditions, with long hair, informal clothing, and performances of songs from a  variety of genres, including music by Jerry Lee Lewis (\"Great Balls of Fire\"), the Beatles (\"Get Back\"; \"I'm Down\"), Bob Marley (\"One Love/People Get Ready\"), and protest songs (\"One Tin Soldier\"). This break from bluegrass tradition was not well received in some quarters—some thought it wasn't the way Bill Monroe meant for Bluegrass to be played.[2] \"Our reason for doing the newer-type music wasn't pretentious or irreverent or sarcastic or disrespectful,\" explained Curtis Burch. \"We just felt like people were ready to see that you could really expand the sound, using those same instruments.\"[3]  (Monroe was a fan of New Grass Revival.[citation needed]) In 1979, they became the backup group and opening act for Leon Russell, further alienating them from the mainstream bluegrass community.\n"
         ]
      },
      "First lineup (1972-1981)": {
         "text": [
            "After the release of their debut, Walker parted ways with the band, and the group replaced him with Butch Robins, who was with the band from July, 1973 to November, 1974. He was replaced by John Cowan, an Evansville, Indiana, native. This lineup was stable throughout the 1970s, recording a number of albums for Flying Fish Records. As their name suggested, New Grass Revival never played traditional bluegrass—all of the members brought elements of rock & roll, jazz, and blues to the group's sound. Consequently, certain portions of the bluegrass community scorned them, but they also gained a devoted following of listeners who believed they were moving the genre in a new, fresh direction. For example, they played regularly to sold-out shows at Amazingrace Coffeehouse in the Chicago metro area.\n"
         ]
      },
      "Second lineup (1981-1989)": {
         "text": [
            "In 1981 Johnson and Burch left the band, claiming they were tired of touring. Bush and Cowan continued the group, replacing them with virtuoso banjoist Béla Fleck and guitarist Pat Flynn. These two moved the band to new musical heights. Fleck's compositions such as \"Metric Lips\", \"Seven by Seven\" and \"Big Foot\" were very well received as were Pat Flynn's \"Do What You Gotta Do\", \"Lonely Rider\" and \"On The Boulevard\". Pat Flynn also brought strong lead and harmony vocals to the group as well as a distinctive guitar style.\n",
            "In 1984 the group moved to Sugar Hill Records, and released their first album featuring the new lineup, On the Boulevard. In 1986 the band signed with EMI Records and released an eponymous album New Grass Revival, which proved to be their breakthrough into the mainstream. Two of the singles from the album, \"What You Do to Me\" and \"Ain't That Peculiar\" were minor hits on the country charts, and Fleck's showcase \"Seven by Seven\" was nominated for a Grammy for Best Country Instrumental. Hold to a Dream, released in 1987, was just as successful as its predecessor, featuring the hits \"Unconditional Love\" and \"Can't Stop Now,\" both of which nearly made the Top 40.\n",
            "In 1989, New Grass Revival released their third major-label album, Friday Night in America, which was yet another commercial success. \"Callin' Baton Rouge\" became their first Top 40 single, followed by the number 58 hit \"You Plant Your Fields.\" Even though the band was more popular than ever, Bush decided to pull the plug on the group after the release of Friday Night in America. Bush formed The Sam Bush Band, and Fleck went on to a successful and respected solo career. \n"
         ]
      },
      "After breakup": {
         "text": [
            "In 1993, Bush, Cowan, Fleck, and Flynn returned to the studio, to back Garth Brooks, on his recording of \"Callin' Baton Rouge\".\n",
            "Banjoist Courtney Johnson died of lung cancer in 1996 at age 56.[4]  Bush, Fleck, Cowan, and Burch reunited for one concert (September 24, 1996) at the Ryman Auditorium in Nashville, Tennessee to benefit his widow.[5]\nThe concert included a number of musicians and groups, such as John Hartford, Hot Rize, Tim O'Brien, Vassar Clements, Del McCoury Band, Ricky Skaggs, Pete Rowan, Jerry Douglas and others.[5]\n",
            "In 1997, when Garth Brooks was invited on Late Night with Conan O'Brien to perform \"Do What You Gotta Do\", a song written by Pat Flynn, he asked Flynn, Bush, Cowan, and Fleck to join him in performing it.  Since that performance, Flynn has worked with both Cowan and Fleck, but not Bush. Likewise, Bush has also worked with Cowan and Fleck on numerous occasions. Bush and Cowan have also played with Burch.\n",
            "In April 2007, Bush, Fleck, Cowan, and Flynn stepped into the spotlight together during the Merlefest 20th Anniversary Jam and played the Townes Van Zandt song \"White Freight Liner.\"  The single song reunion was the first time the four of them had played together in a decade.\n",
            "Sam Bush, John Cowan and Curtis Burch performed with their own groups on the world's first International Newgrass Festival 21–23 August 2009 at Ballance Motox, Kentucky.[6]\n"
         ]
      }
   },
   "Personnel": {
      "1972 - 1974[7]": {},
      "1974[7]": {},
      "1974 - 1981[7]": {},
      "1981 - 1989[7]": {},
      "1996 reunion[7]": {},
      "text": [
         "(Benefit concert for Courtney Johnson)\n"
      ]
   },
   "Discography": {},
   "References": {
      "text": [
         "Record Year released on February 16, 2016 as the second single from his fifth studio album, Mr. Misunderstood. It was written by Church and Jeff Hyde. It peaked at number 44 on the Billboard Hot 100 and number 1 on the Country Airplay references New Grass Revival.\n"
      ]
   },
   "External links": {},
   "coreData": [
      "New Grass Revival was an American progressive bluegrass band founded in 1971, and composed of Sam Bush, Courtney Johnson, Ebo Walker, Curtis Burch, Butch Robins, John Cowan, Béla Fleck and Pat Flynn. They were active between 1971 and 1989, releasing more than twenty albums as well as six singles. Their highest-charting single is \"Callin' Baton Rouge\", which peaked at No. 37 on the U.S. country charts in 1989 and was a Top 5 country hit for Garth Brooks five years later.\n",
      "In 2020, the group were inducted into the Bluegrass Music Hall of Fame.[1]\n",
      "The origins of New Grass Revival lay in the Bluegrass Alliance, which Sam Bush (vocals, fiddle, guitar, mandolin) and Courtney Johnson (banjo, vocals) joined in 1970. At the time, the Alliance also featured bassist Ebo Walker and fiddler Lonnie Peerce. Within a year after Bush's and Johnson's arrival, Curtis Burch (dobro, guitar, vocals) joined the band. In 1972, Peerce left the band, and the remaining members decided to continue under the new name New Grass Revival. The band released their eponymous debut album The Arrival of the New Grass Revival later in 1972 on Starday Records.\n",
      "Other groups were also playing progressive bluegrass at the time, such as The Dillards, Eddie Adcock's II Generation,  and the Country Gentlemen, but few did it with the flair of the New Grass Revival. At the time, bluegrass was a very tradition-bound music; bands were expected to have short hair and dress in matching outfits. The New Grass Revival bucked these traditions, with long hair, informal clothing, and performances of songs from a  variety of genres, including music by Jerry Lee Lewis (\"Great Balls of Fire\"), the Beatles (\"Get Back\"; \"I'm Down\"), Bob Marley (\"One Love/People Get Ready\"), and protest songs (\"One Tin Soldier\"). This break from bluegrass tradition was not well received in some quarters—some thought it wasn't the way Bill Monroe meant for Bluegrass to be played.[2] \"Our reason for doing the newer-type music wasn't pretentious or irreverent or sarcastic or disrespectful,\" explained Curtis Burch. \"We just felt like people were ready to see that you could really expand the sound, using those same instruments.\"[3]  (Monroe was a fan of New Grass Revival.[citation needed]) In 1979, they became the backup group and opening act for Leon Russell, further alienating them from the mainstream bluegrass community.\n"
   ]
}