{
   "Name": "Nothin' Fancy",
   "Sections": [
      "1 History",
      "1.1 East Coast Bluegrass Band",
      "1.2 Name change",
      "2 Recordings",
      "3 Performance",
      "4 Musical style and sound",
      "5 Nothin' Fancy Bluegrass Festival",
      "6 Discography",
      "7 Awards, distinctions, and honors",
      "8 Members",
      "9 Reviews, articles, notices",
      "10 See also",
      "11 References",
      "12 External links"
   ],
   "Summary": {
      "text": [
         "Nothin' Fancy is an award-winning[1] bluegrass band based in Buena Vista, Virginia and was formed in September 1994. Its \"parent band\" East Coast Bluegrass Band was formed Summer 1985 to compete in the East Coast Bluegrass Championship in Crimora, Virginia.[2]\n"
      ]
   },
   "History": {
      "East Coast Bluegrass Band": {
         "text": [
            "The East Coast Bluegrass Band, predecessor to Nothin' Fancy, was formed in 1994 to compete in the East Coast Bluegrass Championship in Crimora, Virginia.[1]  After winning the contest, the band kept the name and continued to play together at local functions. In 1986 the group won the Virginia Folk Music Society State Bluegrass Band Championship.[3]  The members of the band developed some original material, but remained true to the traditional style of the great bluegrass bands of the 1940s and 1950s.[3]\n",
            "In 1998 the band released Life's Mysteries with Buster Sexton on banjo, Mike Andes on mandolin, Frankie Hawkins on guitar, Darin Lawrence on rhythm guitar, Bill Ledbetter on bass, and Buster's son Chris Sexton on fiddle.  The younger Sexton joined the group at the last minute as a replacement for Mitchell Davis, who left the group in May 1997.\n"
         ]
      },
      "Name change": {
         "text": [
            "Nothin' Fancy was formed in 1994. Mike Andes and Mitchell Davis (now on banjo) joined forces with Gary Ferris on guitar, Tony Shorter on bass, and Guy Carawan on fiddle to play the same East Coast Bluegrass Championship in September 1994 that East Coast Bluegrass Band had once played almost a decade earlier. Nothin' Fancy released their first project \"Bluegrass in a Plain Brown Wrapper\" shortly afterwards.\n",
            "Nothin' Fancy and East Coast Bluegrass Band continued to coexist until 2000 when East Coast Bluegrass Band's members drifted apart and had to reorganize. Chris Sexton, who had appeared with Nothin' Fancy for their first-place victory in the band competition at the Maury River Fiddler's Convention in 1998 and recorded as a guest fiddler on the band's second and third releases (\"Earn Your Ticket\" and \"Field of Dreams,\" respectively), officially became the newest member of Nothin' Fancy in 2000.  The fourth project, Now and Then is the first album to feature the five-piece group as it is today.\n",
            "Shorter departed from the group in 2005, and was replaced by Eli Johnston of Branson, MO.  Nothin' Fancy released \"Album No. 7\" under Pinecastle with Johnston and featured him as the lead vocal on the song \"Tupelo County Jail,\" but Johnston only stayed with the group for 13 months.  Citing artistic differences, he left the group and joined the band Pine Mountain Railroad.  Nothin' Fancy's members called Shorter back into service in time for the 6th Annual Nothin' Fancy Bluegrass Festival.  Shorter, who at the time was playing bass for country star Keith Bryant, happily agreed and the band was re-united with its original cast and has stayed as such since.\n",
            "Gary Ferris, the guitar player, also departed the group in July 2012 and was replaced by Justin Tomlin.[4] Tomlin left in March 2014, and Jesse Smathers joined the group in his place.[5] In June 2015, Jesse Smathers departed the group and was replaced by guitar and dobro player, Caleb Cox.[6] A month later, the band signed a recording contract with Mountain Fever Records and released their first project for the label \"By Any Other Name\" in August 2015.[7]\n",
            "In 2019, founding member Mitchell Davis announced that he would be leaving the band. Following his departure, the band announced in March of that year that it had signed on Jacob Flick to take up Davis' role on the banjo.[8]\n"
         ]
      }
   },
   "Recordings": {
      "text": [
         "East Coast Bluegrass Band released four self-produced albums.  They then contracted Tim Austin of Doobie Shea Studios to produce and record the project. Recording began in February 1996. Later that spring, lightning struck and destroyed the studio and all the recorded sessions. Once it was up and running again they were one of the first acts to record in the new studio.[3] After four albums, thirteen years, and hundreds of performances, the band released their first nationally distributed recording project, Life's Mysteries on Copper Creek Records.\n",
         "The group, now appearing as Nothin' Fancy, was approached by Pinecastle Records and signed to the label in 2002.  They recorded their fifth project, \"Once Upon a Road\" with the title song written for the band by Tom T. Hall and his wife Dixie.  \"Once Upon a Road\" rose to number 10 on the Bluegrass Charts as posted by Bluegrass Unlimited.  Their bluegrass gospel song \"When the Angels Take My Hand\" rose to the Number 1 spot on the Bluegrass Gospel charts as posted by (the now-defunct) Bluegrass Now magazine.  The album also earned them a showcase at the International Bluegrass Music Association (IBMA) Convention in October 2002 and a nomination for the IBMA Emerging Artist of the Year Award.\n",
         "Their sixth album, \"Reflections,\" was a much more personal album, with Andes penning 10 of the 13 songs.  It featured the novelty single \"I Met My Baby in the Porta-John Line\" as a bonus track, also by Andes.  \"Reflections\" was not as commercially successful as \"Once Upon a Road,\" but it was from these two albums and the performances from this period that Nothin' Fancy had found its highly unique voice, which paid homage to bands such as the Country Gentlemen and the Seldom Scene.  The late Charlie Waller, a founding member of the Country Gentlemen who went on to lead that group until his death in 2004, met with Andes at the Society for the Preservation of Bluegrass Music of America annual convention and learned the song \"Heaven Got an Angel\" from Andes (that was recorded originally on \"Field of Dreams\") and recorded it on the Country Gentlemen album \"Cryin' in the Chapel.\"\n",
         "Their eighth album, Lord Bless This House, the first all-gospel recording for the group, was officially released January 27, 2009 through Pinecastle.  Co-produced by Grammy-nominated bluegrass artist Rhonda Vincent and her brother Darrin Vincent (of Dailey and Vincent fame) with guest appearances from the both of them, it is frequently played on Sirius XM Radio's Bluegrass Junction station, along with other selections from their discography.\n",
         "Undeniable is the group's 16th studio recording, released in 2019 to celebrate their 25th year together. The album includes all-original songwriting by Mike Andes, Caleb Cox, and Chris Sexton. It features Mike Andes (mandolin, lead/harmony vocals), Chris Sexton (fiddle, harmony vocals), Caleb Cox (guitar, lead/harmony vocals), James Cox (bass), and Jacob Flick (banjo). Cello, viola, and string arrangements on “Here’s To My Life” were provided by Chris Sexton. The album was recorded, mixed, and mastered at Mountain Fever Studios in Willis, Virginia and released by Mountain Fever Records.\n"
      ]
   },
   "Performance": {
      "text": [
         "East Coast Bluegrass Band paid their dues at lawn parties and bars in and around the Harrisonburg, Virginia area and the Charlottesville, Virginia area for many years.  In years since, the band, as Nothin' Fancy, has played the Grand Ole Opry at the historic Ryman Auditorium in Nashville,[9] and with the \"Bluegrass Series with Rhonda Vincent & Nothin' Fancy\".[10] They have played such other major venues as Lincoln Center in New York City, and The Birchmere in Alexandria, Virginia.  Nothin' Fancy plays about 140 shows a year and is a staple on the bluegrass festival circuit.[11] The band has been known to take fans on bus trips to festivals and accompanying them on bluegrass cruises aboard the Royal Caribbean and Carnival cruises.[12] Nothin' Fancy performed in June 2010 at the Tottenhan Bluegrass Festival in Ontario, Canada, and the band toured as part of the 2012 Bluegrass Sundays Winter Concert series organized by the Northern Bluegrass Committee in Scarborough, Ontario.[13]\n"
      ]
   },
   "Musical style and sound": {
      "text": [
         "The band seeks to remain \"true to the traditional sounds of the great bluegrass bands of the 1940s and '50s\",[3] while also performing and recording original songs by their prolific songwriter, lead singer Mike Andes.  Classic bluegrass material draws from Bill Monroe, Ralph Stanley, the Country Gentlemen, and the Seldom Scene; but song selection ranges from original material to gospel classics to covers of pop artists such as Bob Seger, Bruce Springsteen, Bill Withers, Bob Dylan, and Creedence Clearwater Revival.\n",
         "In live performance Nothin' Fancy has been noted for its strong vocals, four-part arrangements, and its high-energy shows well-seasoned with humor.  The quintet's early years saw the band gathering around one microphone, employing a shell-game choreography for solos and back-up which keeps the show visually active as well as aurally pleasing, although the most recent configuration is more traditional with individual microphones for instruments and vocals. Andes' clear singing style is attributed to the unique stylings of Charlie Waller, whose earthy bass-baritone voice sang with clear enunciation.  Farris sings a bold tenor harmony remarkable for its projection; his powerful delivery has been likened to the late John Duffey of the Seldom Scene.  Shorter occasionally sings baritone harmonies an octave higher, while Davis sings bass vocals, more on gospel songs. In later recordings, Davis gave up singing bass and allowed Sexton to sing bass on gospel songs\n"
      ]
   },
   "Nothin' Fancy Bluegrass Festival": {
      "text": [
         "In 2001, a Rockbridge County entrepreneur, Morris O'Shields, created a bluegrass festival at the Glen Maury Park, the site of the Maury River Fiddler's Convention where Nothin' Fancy won its victory three years before.  The festival was named for Nothin' Fancy, who have served as the host act in years since.[14]  Just as the band originally named itself after the first music festival in which it competed—subsequently winning the prize—it then had a music festival, whose competition it had also won, subsequently named for it.\n",
         "The so-named festival has become a much-loved annual event that brings scores of bluegrass fans to the Shenandoah Valley and to the little town of Buena Vista, VA, where Farris calls home (and from which the band operates).  Held each year at the Glen Maury Park in Buena Vista, Virginia, the festival has perennially played host to major bluegrass bands.  The 2008 festival, for example, included such names as Rhonda Vincent, Michelle Nixon, Blue Mountain Sunrise, The Deer Creek Boys, Randy Waller & the Country Gentlemen, Blue Moon Rising, and the Gary Waldrep Band.[15]  It has also hosted bands and artists such as IIIrd Tyme Out, the Lonesome River Band, Missy Raines, Marty Raybon, The Dillards, the Lewis Family, Goldwing Express, Larry Stephenson, Mark Newton, Doyle Lawson, and Charlie Sizemore.\n"
      ]
   },
   "Discography": {},
   "Awards, distinctions, and honors": {},
   "Members": {},
   "Reviews, articles, notices": {},
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Nothin' Fancy is an award-winning[1] bluegrass band based in Buena Vista, Virginia and was formed in September 1994. Its \"parent band\" East Coast Bluegrass Band was formed Summer 1985 to compete in the East Coast Bluegrass Championship in Crimora, Virginia.[2]\n",
      "The East Coast Bluegrass Band, predecessor to Nothin' Fancy, was formed in 1994 to compete in the East Coast Bluegrass Championship in Crimora, Virginia.[1]  After winning the contest, the band kept the name and continued to play together at local functions. In 1986 the group won the Virginia Folk Music Society State Bluegrass Band Championship.[3]  The members of the band developed some original material, but remained true to the traditional style of the great bluegrass bands of the 1940s and 1950s.[3]\n",
      "In 1998 the band released Life's Mysteries with Buster Sexton on banjo, Mike Andes on mandolin, Frankie Hawkins on guitar, Darin Lawrence on rhythm guitar, Bill Ledbetter on bass, and Buster's son Chris Sexton on fiddle.  The younger Sexton joined the group at the last minute as a replacement for Mitchell Davis, who left the group in May 1997.\n",
      "Nothin' Fancy was formed in 1994. Mike Andes and Mitchell Davis (now on banjo) joined forces with Gary Ferris on guitar, Tony Shorter on bass, and Guy Carawan on fiddle to play the same East Coast Bluegrass Championship in September 1994 that East Coast Bluegrass Band had once played almost a decade earlier. Nothin' Fancy released their first project \"Bluegrass in a Plain Brown Wrapper\" shortly afterwards.\n"
   ],
   "infobox": {
      "Origin": [
         "Timberville, Virginia, United States",
         "Buena Vista, Virginia",
         "Lexington, Virginia",
         "Manassas, Virginia"
      ],
      "Genres": [
         "Folk",
         "Country",
         "Americana",
         "Bluegrass"
      ],
      "Years active": [
         "1994–present"
      ],
      "Labels": [
         "Mountain Fever, Pinecastle"
      ],
      "Website": [
         "Official Site"
      ],
      "Members": [
         "Mike Andes",
         "  Chris Sexton",
         "  Caleb Cox",
         "James Cox",
         "Jacob Flick"
      ],
      "Past members": [
         "Gary Ferris",
         " Buster Sexton",
         "Frankie Hawkins",
         "Darin Lawrence",
         "Bill Ledbetter",
         "Eli Johnston",
         "Justin Tomlin",
         "Jesse Smathers",
         "Tony Shorter",
         " Mitchell Davis"
      ]
   }
}