{
   "Band history": {
      "text": [
         "The Petersen children grew up playing music together, but first heard bluegrass in 2003 at the Gettysburg bluegrass festival. The band was formed and had their first performance in 2005 at their mother's hometown church First Christian Church of Mountain Grove, MO.\n",
         "The band was originally siblings Katie (on fiddle), Ellen (on banjo), their brother Matt (on bass), and their youngest sister Julianne (sings and dance), accompanied by their mother Karen (on mandolin) and father Jon (on guitar). But over time, Julianne took the mandolin part and Karen switched to bass. Matt took the guitar part and their father, Jon, played the piano on some of the gospel songs. These early performances were mostly held initially in local festivals, churches and cafes.[6]\n",
         "In 2010 the band won the CAM Gospel Sing-Off[7] competition at the Sight & Sound Theatre in Branson, which performance caught the attention of the IMAX Entertainment Complex and where they were invited to play regularly at the Little Opry Theater for the entertainment of local and state residents.[8] In 2015, the band received international recognition when banjo player, Ellen Petersen, competed in the singing reality TV show, American Idol, placing in the top 48.[9][10][11][12][13] In 2017, Emmett Franz joined the band as their dobro player.[6]\n",
         "In 2018 the band placed 4th in the International Bluegrass Music Competition in Nashville.[14]\n",
         "Katie, vocal and composer, has composed several original songs of her own, the most popular being \"California.\" Julianne is a multi-talented performer with a history of  buck-dancing whilst playing the violin at the same time.[15]\n",
         "The band, although young and upcoming, has garnered praise from top music professionals in the United Kingdom, who see the group as being unique in the field of bluegrass music.[15] So, too, Tripadvisor, which has posted a reference to The Petersens' concerts as a suggested source of entertainment when visiting Branson, MO.[16]\n"
      ]
   },
   "Discography": {
      "Albums and music videos": {
         "text": [
            "Several of the group's newer releases, as well as covers of other artists, have been made available on Spotify[26] and iTunes.[27]\n"
         ]
      }
   },
   "External links": {},
   "Musical style": {
      "text": [
         "The band performs American Roots music,[17] which is a mixture of several genres: country, gospel a cappella, and bluegrass, the latter being a genre of American roots music that developed in the 1940s in the United States. Some of the band's biggest influences include Alison Krauss, Patsy Cline, Dolly Parton, John Denver and Glen Campbell.\n",
         "Their youth, as also the style of music they play, make them a popular attraction at bluegrass festivals. The band has often improvised on songs composed by other musicians, making them actually more popular, such as Dolly Parton's \"Jolene,\" which has received more than 10 million views on YouTube.[18] Their rendition of \"Take Me Home, Country Roads\" had 12.7 million views in just six months.[19]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Band history",
      "2 Musical style",
      "3 Touring",
      "4 Discography",
      "4.1 Albums and music videos",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Petersens are an American bluegrass family band from Branson, Missouri, the authors of the popular songs \"California,\" and \"It's Over.\"[1] Since the group's inception, they have been a regular feature on Country Music and Bluegrass television specials.[2][3][4][5]\n"
      ]
   },
   "Title": "The Petersens - Wikipedia",
   "Touring": {
      "text": [
         "Prior to 2019, The Petersens had performed to audiences throughout the continental United States, in Canada and in Ireland.[20] In late 2019, The Petersens went on additional singing tours to Finland and to Ireland, the trip to Ireland being the group's fourth tour of that country. Social media platforms are often used to document their performances and recordings.\n"
      ]
   }
}