{
   "Name": "The Rarely Herd",
   "rawData": [
      "The Rarely Herd are an American Bluegrass band from Athens County, Ohio, founded in 1989, playing progressive and traditional bluegrass as well as their own unique compositions and adaptations from other genres.\n",
      "The Rarely Herd toured extensively on the festival circuit, where audiences enjoyed their close vocal harmonies and high energy performances. In 1997 they performed in Scarborough, Ontario, Canada as part of the Bluegrass Sundays Concert Series organized by the Northern Bluegrass Committee.  In 1997 they were headliners at the Central Canadian Bluegrass Awards festival in Huntsville, Ontario.\n",
      "In 1992 the Rarely Herd showcased at the International Bluegrass Music Awards.  That year their first album, \"Midnight Loneliness\" was issued by Pinecastle, followed by \"Heartbreak City\" in 1994. \"What About Him\", released in 1996, earned then a Dove Award nomination. \"Coming of Age\" was released in 1998, \"Part of Growing Up\" was released in 2000, both produced by Ronnie Reno. Three more CD's, \"Return Journey\" in 2004, \"Round-up, Vol One\" in 2007, and \"Fields of the Harvest\" in 2007, were released on their own label.\n"
   ],
   "infobox": {
      "Also known as": [
         "The Herd"
      ],
      "Origin": [
         "Athens, Ohio, U.S./",
         "Albany, Ohio, U.S."
      ],
      "Genres": [
         "Bluegrass, country, gospel, bluegrass gospel, Southern rock"
      ],
      "Years active": [
         "1992-present"
      ],
      "Labels": [
         "Pinecastle, MDJ, Herd Records"
      ],
      "Website": [
         "www.therarelyherd.com"
      ],
      "Members": [
         "Jim Stack",
         "Jeff Weaver",
         "Dan Brooks",
         "Alan Stack",
         "Calvin Leport"
      ],
      "Past members": [
         "Ned Luberecki",
         "Brandon Shuping",
         " Jeff Hardin",
         "Todd Sams",
         "Shane Bartley",
         "Chris Stockwell"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band from Athens County, Ohio, founded in [YEAR], playing progressive and traditional bluegrass as well as their own unique compositions and adaptations from other genres.\n",
      "[BAND_NAME] toured extensively on the festival circuit, where audiences enjoyed their close vocal harmonies and high energy performances. In [YEAR] they performed in Scarborough, Ontario, Canada as part of the Bluegrass Sundays Concert Series organized by the Northern Bluegrass Committee.  In [YEAR] they were headliners at the Central Canadian Bluegrass Awards festival in Huntsville, Ontario.\n",
      "In [YEAR] the Rarely Herd showcased at the International Bluegrass Music Awards.  That year their first album, [SONG_NAME] in [YEAR], were released on their own label.\n"
   ]
}