{
   "Name": "Salamander Crossing",
   "rawData": [
      "Salamander Crossing was a bluegrass band based in New England that disbanded in 1999. The band was composed of lead singer and fiddler Rani Arbo, Jeff Kelliher on guitar, mandolin, and vocals, and Andrew Kinsey on bass and vocals. They derived their name from a pair of tunnels under Henry Street in Amherst, Massachusetts that salamanders used in order to cross the road to mate in vernal pools. There is a salamander monument, featured on their final album cover in the Cushman Village Historic District that commemorates the first salamander crossings installed in 1987.   \n",
      "Rani Arbo went on to found Rani Arbo and Daisy Mayhem, of which Kinsey is a member.\n",
      "This article on a United States country music band is a stub. You can help Wikipedia by expanding it."
   ],
   "infobox": {
      "Origin": [
         "New England"
      ],
      "Genres": [
         "bluegrass, folk"
      ],
      "Years active": [
         "1991–1999"
      ],
      "Labels": [
         "Signature"
      ],
      "Past members": [
         "Rani Arbo, Jeff Kelliher, and Andrew Kinsey"
      ]
   },
   "albums": [
      "Salamander Crossing",
      "Passion Train",
      "Bottleneck Dreams",
      "Henry Street: A Retrospective"
   ],
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band based in New England that disbanded in [YEAR]. The band was composed of lead singer and fiddler Rani Arbo, [PERSON_NAME_FULL_0_MALE] on guitar, mandolin, and vocals, and Andrew Kinsey on bass and vocals. They derived their name from a pair of tunnels under [PERSON_NAME_FULL_1_MALE] in Amherst, Massachusetts that salamanders used in order to cross the road to mate in vernal pools. There is a salamander monument, featured on their final album cover in the Cushman Village Historic District that commemorates the first salamander crossings installed in [YEAR].   \n",
      "Rani Arbo went on to found Rani Arbo and Daisy [MONTH]hem, of which Kinsey is a [GENRE]",
      "This article on a [GENRE] band is a stub. You can help Wikipedia by expanding it."
   ]
}