{
   "Name": "The Seldom Scene",
   "rawData": [
      "The Seldom Scene is an American bluegrass band that formed in 1971 in Bethesda, Maryland.\n",
      "The Seldom Scene was established in 1971, and they would practice in Ben Eldridge's basement. These practice sessions included John Starling on guitar and lead vocals, Mike Auldridge on Dobro and baritone vocals, and former Country Gentlemen member Tom Gray on bass. The mandolinist John Duffey, who had also performed with the Country Gentlemen, was invited to jam sessions at the time when Mike Auldridge arranged for the group to play as a performing band. \nAnother member of the Country Gentlemen, Charlie Waller, is responsible for the band's name. Expressing his doubt that this new band could succeed, Waller reportedly asked Duffey, “What are you going to call yourselves, the seldom seen?” The band had weekly performances at clubs and performed regularly at the Red Fox Inn, a music club in Bethesda Maryland. The band switched over to the Birchmere music hall in Alexandria, Virginia which resulted in a residency.\n",
      "Each of the band members had a job during the week; Duffey repaired musical instruments, Eldridge was a mathematician, Starling a physician, Auldridge a graphic artist, and Gray a cartographer with National Geographic. They agreed to play one night a week at local clubs, perform occasionally at concerts and festivals on weekends, and make records. After playing for six weeks at a small Washington, D.C., club called the Rabbit's Foot, the group found a home at the Red Fox Inn in Bethesda, Maryland. They performed at that venue Friday nights from January 1972 through September 1977 before starting weekly performances at The Birchmere Music Hall in Alexandria, Virginia.\n"
   ],
   "infobox": {
      "Origin": [
         "Bethesda, Maryland, United States"
      ],
      "Genres": [
         "Bluegrass, country, Progressive bluegrass"
      ],
      "Years active": [
         "1971–present"
      ],
      "Labels": [
         "Rebel, Sugar Hill"
      ],
      "Associated acts": [
         "Chesapeake, Country Gentlemen, Jonathan Edwards"
      ],
      "Website": [
         "seldomscene.com"
      ],
      "Members": [
         "Lou Reid",
         "Dudley Connell",
         "Ron Stewart",
         "Ronnie Simpkins",
         "Fred Travers"
      ],
      "Past members": [
         "John Duffey",
         "Mike Auldridge",
         "Ben Eldridge",
         "Tom Gray",
         "John Starling",
         "Phil Rosenthal ",
         "T. Michael Coleman",
         "Moondi Klein",
         "Rickie Simpkins"
      ]
   }
}