{
   "Name": "The SteelDrivers",
   "rawData": [
      "The SteelDrivers are a bluegrass band from Nashville, Tennessee. Members include fiddler Tammy Rogers, bassist Mike Fleming, guitarist/vocalist Kelvin Damrell, mandolinist Brent Truitt, and banjoist Richard Bailey. Past members include  Chris Stapleton, Gary Nichols, and  Mike Henderson.  The band has recorded four albums on the Rounder Records label and one independent live album recorded at The Station Inn. The band has received several Grammy nominations and won a Grammy for the album  The Muscle Shoals Recordings.\n",
      "After playing at bluegrass festivals The SteelDrivers signed to Rounder Records and released a self-titled debut in 2008, featuring new lead singer Chris Stapleton. The album peaked at No. 57 on the U.S. Billboard Top Country Albums chart. The group was nominated for a Grammy Award in 2009 for Best Country Performance by a Duo or Group with Vocals for their song \"Blue Side of the Mountain.\" In 2010, the group received two nominations for its second album, Reckless. The album has been nominated for both Best Bluegrass Album and Best Country Performance by a Duo or Group with Vocal for the song \"Where Rainbows Never Die\".\n",
      "Stapleton announced in April 2010, that he was leaving the band to focus on raising his family. He was replaced by former Mercury Records artist Gary Nichols on lead vocals and guitar. In December 2011, founding member Mike Henderson left the band. Henderson was replaced by Nashville musician and record producer Brent Truitt. In 2015, the new lineup received a Grammy Award for Best Bluegrass Album for its new album The Muscle Shoals Recordings.  In 2018, Kelvin Damrell became the band's new lead singer and debuted on the 2020 release Bad for You.\n"
   ],
   "infobox": {
      "Origin": [
         "Nashville, Tennessee, U.S."
      ],
      "Genres": [
         "Bluegrass"
      ],
      "Years active": [
         "2005–present"
      ],
      "Labels": [
         "Rounder"
      ],
      "Website": [
         "thesteeldrivers.com"
      ],
      "Members": [
         "Richard Bailey",
         "Kelvin Damrell",
         "Mike Fleming",
         "Tammy Rogers",
         "Brent Truitt",
         "Adam Wakefield"
      ],
      "Past members": [
         "Chris Stapleton",
         "Mike Henderson",
         "Gary Nichols"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band from Nashville, Tennessee. Members include fiddler Tammy Rogers, bassist [PERSON_NAME_FULL_2_MALE], guitarist/vocalist Kelvin Damrell, mandolinist Brent Truitt, and banjoist [PERSON_NAME_FULL_1_MALE]. Past members include  [PERSON_NAME_FULL_0_MALE], Gary Nichols, and  [PERSON_NAME_FIRST_2] [PERSON_NAME_LAST_3].  The band has recorded four albums on the Rounder Records label and one independent live album recorded at The Station Inn. The band has received several Grammy nominations and won a Grammy for the album  The Muscle Shoals Recordings.\n",
      "After playing at bluegrass festivals [BAND_NAME] signed to Rounder Records and released a self-titled debut in [YEAR], featuring new lead singer [PERSON_NAME_FULL_0_MALE]. The album peaked at No. 57 on the U.S. Billboard Top Country Albums chart. The group was nominated for a Grammy Award in [YEAR] for Best Country Performance by a Duo or Group with Vocals for their song \"Blue Side of the Mountain.\" In [YEAR], the group received two nominations for its second album, Reckless. The album has been nominated for both Best Bluegrass Album and Best Country Performance by a Duo or Group with Vocal for the song \"Where Rainbows Never Die\".\n",
      "Stapleton announced in [MONTH] [YEAR], that he was leaving the band to focus on raising his family. He was replaced by former Mercury Records artist Gary Nichols on lead vocals and guitar. In [MONTH] [YEAR], founding member [PERSON_NAME_FULL_0_MALE] left the band. [PERSON_NAME_LAST_0] was replaced by Nashville musician and record producer Brent Truitt. In [YEAR], the new lineup received a Grammy Award for Best Bluegrass Album for its new album The Muscle Shoals Recordings.  In [YEAR], Kelvin Damrell became the band's new lead singer and debuted on the [YEAR] release Bad for You.\n"
   ]
}