{
   "Name": "Steep Canyon Rangers",
   "rawData": [
      "Steep Canyon Rangers is an American bluegrass band based in Asheville and Brevard, North Carolina. Though formed in 2000, the band has become widely known since 2009 for collaborating with actor/banjoist Steve Martin. In 2013, the Steep Canyon Rangers' solo album Nobody Knows You won the Grammy Award for Best Bluegrass Album. The previous year, their 2012 collaboration with Steve Martin, Rare Bird Alert, was nominated for the same award. Steep Canyon Rangers have recorded 9 solo albums plus two collaborative albums with Steve Martin. SCR performed as a quintet for nearly a decade before intermittent touring began as a sextet with Steve Martin; the band still performs in both configurations. In May 2013, Steve Martin and SCR began performing with Edie Brickell after she and Martin co-wrote and recorded Love Has Come for You.\n",
      "Steep Canyon Rangers formed in 2000 while students at the University of North Carolina in Chapel Hill.  The core group consisted of Woody Platt (guitar), Graham Sharp (banjo) and Charles R. Humphrey III (upright bass).  Early on, Platt's childhood friend, Mike Guggino (mandolin), was asked to join.  With original fiddler, Lizzie Hamilton, completing the quintet, Steep Canyon Rangers garnered fans across the U.S. performing festivals from North Carolina to Colorado.  Two albums of original music were recorded with the early lineup: Old Dreams and New Dreams and Mr. Taylor's New Home.  In 2001, the Rangers took first prize in Lyons, CO at the Rockygrass Festival band competition earning the Rangers a main stage performance the following year.  Hamilton left the group in 2003 but heavy touring continued with a rotation of fiddlers leading up to the eponymous CD Steep Canyon Rangers (released 2004) on Rebel Records.  The album contained a dozen more original songs and featured guest fiddlers including Josh Goforth.\n",
      "In 2004, Nicky Sanders approached the band for the position of full-time fiddle player and subsequently joined in July. The Rangers recorded their fourth album, One Dime at a Time in 2005 with producer Mike Bub (Del McCoury Band).  The next year the band won Emerging Artist of the Year at the International Bluegrass Music Association Awards ceremony.  Following the release of their fifth album in 2007, the band received two more IBMA nominations for Best Album (Lovin' Pretty Women) and Gospel Performance of the Year (\"Be Still Moses\"). In 2010, Sanders's fiddle tune \"Mourning Dove\" was nominated for IBMA Instrumental Song of the Year.\n"
   ],
   "infobox": {
      "Origin": [
         "Brevard, North Carolina, United States"
      ],
      "Genres": [
         "Bluegrass"
      ],
      "Years active": [
         "2000–present"
      ],
      "Labels": [
         "Rounder, Yep Roc"
      ],
      "Associated acts": [
         "Edie Brickell",
         "Steve Martin"
      ],
      "Website": [
         "steepcanyon.com"
      ],
      "Members": [
         "Woody Platt",
         "Graham Sharp",
         "Mike Guggino",
         "Nicky Sanders",
         "Mike Ashworth"
      ],
      "Past members": [
         "Lizzie Hamilton",
         "Charles Humphrey"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band based in Asheville and Brevard, North Carolina. Though formed in [YEAR], the band has become widely known since [YEAR] for collaborating with actor/banjoist Steve [MONTH]tin. In [YEAR], the [BAND_NAME]' solo album Nobody Knows You won the Grammy Award for Best Bluegrass Album. The previous year, their [YEAR] collaboration with Steve [MONTH]tin, Rare Bird Alert, was nominated for the same award. [BAND_NAME] have recorded 9 solo albums plus two collaborative albums with Steve [MONTH]tin. SCR performed as a quintet for nearly a decade before intermittent touring began as a sextet with Steve [MONTH]tin; the band still performs in both configurations. In [MONTH] [YEAR], Steve [MONTH]tin and SCR began performing with [PERSON_NAME_FULL_0_FEMALE] after she and [MONTH]tin co-wrote and recorded Love Has Come for You.\n",
      "[BAND_NAME] formed in [YEAR] while students at the University of North Carolina in Chapel Hill.  The core group consisted of Woody Platt (guitar), [PERSON_NAME_FULL_0_MALE] (banjo) and Charles R. Humphrey III (upright bass).  Early on, Platt's childhood friend, [PERSON_NAME_FULL_1_MALE] (mandolin), was asked to join.  With original fiddler, Lizzie Hamilton, completing the quintet, [BAND_NAME] garnered fans across the U.S. performing festivals from North Carolina to Colorado.  Two albums of original music were recorded with the early lineup: Old Dreams and New Dreams and Mr. Taylor's New Home.  In [YEAR], the Rangers took first prize in Lyons, CO at the Rockygrass Festival band competition earning the Rangers a main stage performance the following year.  Hamilton left the group in [YEAR] but heavy touring continued with a rotation of fiddlers leading up to the eponymous CD [BAND_NAME] (released [YEAR]) on Rebel Records.  The album contained a dozen more original songs and featured guest fiddlers including Josh Goforth.\n",
      "In [YEAR], Nicky Sanders approached the band for the position of full-time fiddle player and subsequently joined in [MONTH]. The Rangers recorded their fourth album, One Dime at a Time in [YEAR] with producer [PERSON_NAME_FULL_0_MALE] (Del McCoury Band).  The next year the band won Emerging Artist of the Year at the International Bluegrass Music Association Awards ceremony.  Following the release of their fifth album in [YEAR], the band received two more IBMA nominations for Best Album (Lovin' Pretty Women) and Gospel Performance of the Year ([SONG_NAME] was nominated for IBMA Instrumental Song of the Year.\n"
   ]
}