{
   "Name": "Seaweed (band)",
   "rawData": [
      "Seaweed was an American band from Tacoma, Washington who were active throughout the 1990s. Their style of music was a combination of various rock subgenres, including grunge and post-hardcore. They were signed to various notable record labels, such as Sub Pop Records and Hollywood Records.\n",
      "The band started out in 1989, consisting of vocalist Aaron Stauffer, guitarist Clint Werner, guitarist Wade Neal, bassist John Atkins, and drummer Bob Bulgrien. All 5 members were still attending high school at the time, and most of them were already active in other local bands. Their first major tour was alongside the band Superchunk. Throughout the next few years, the band would release various one-off singles. In 1990, a smaller label known as Tupelo (known for releases by the bands Jawbreaker, Nirvana, and The Melvins) approached the band to release their first album. Instead, the band compiled their previous singles, and recorded one new song, to release Seaweed. As stated in later interviews  and the name of the band's 1993 album, this is considered to be the band's first major release.\n",
      "In 1990, Seaweed signed to the thriving Seattle label Sub Pop. The label wanted a single but the band wanted a full-length. They met halfway, and released the EP Despised. Six songs would be brand new tracks, recorded with producer Jack Endino. The remaining four tracks were slightly remixed from their previous release, Seaweed; thus, angering their former label Tupelo. On foreign editions of the album, the last four tracks were not included.\n"
   ],
   "infobox": {
      "Origin": [
         "Tacoma, Washington, United States"
      ],
      "Genres": [
         "grunge, punk rock, alternative rock, post-hardcore[1]"
      ],
      "Years active": [
         "1989–1999",
         "2007–2014"
      ],
      "Labels": [
         "Sub Pop",
         "Hollywood Records",
         "Merge Records",
         "Tupelo"
      ],
      "Associated acts": [
         "Quicksand ",
         " Jawbreaker ",
         " Superchunk ",
         " Bad Religion ",
         " Green Day"
      ],
      "Members": [
         "Aaron Stauffer",
         "Clint Werner",
         "Wade Neal",
         "John Atkins",
         "Jesse Fox",
         "Bob Bulgrien",
         "Alan Cage"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Tacoma, Washington who were active throughout the [YEAR]s. Their style of music was a combination of various rock subgenres, including grunge and post-hardcore. They were signed to various notable record labels, such as Sub Pop Records and Hollywood Records.\n",
      "The band started out in [YEAR], consisting of vocalist Aaron Stauffer, guitarist [PERSON_NAME_FULL_0_MALE], guitarist Wade Neal, bassist [PERSON_NAME_FULL_1_MALE], and drummer Bob Bulgrien. All 5 members were still attending high school at the time, and most of them were already active in other local bands. Their first major tour was alongside the band Superchunk. Throughout the next few years, the band would release various one-off singles. In [YEAR], a smaller label known as Tupelo (known for releases by the bands Jawbreaker, Nirvana, and The Melvins) approached the band to release their first album. Instead, the band compiled their previous singles, and recorded one new song, to release [BAND_NAME]. As stated in later interviews  and the name of the band's [YEAR] album, this is considered to be the band's first major release.\n",
      "In [YEAR], [BAND_NAME] signed to the thriving Seattle label Sub Pop. The label wanted a [GENRE] band wanted a full-length. They met halfway, and released the EP Despised. Six songs would be brand new tracks, recorded with producer [PERSON_NAME_FULL_0_MALE]. The remaining four tracks were slightly remixed from their previous release, [BAND_NAME]; thus, angering their former label Tupelo. On foreign editions of the album, the last four tracks were not included.\n"
   ]
}