{
   "Band members": {
      "Final": {},
      "Former": {}
   },
   "Discography": {
      "Albums": {},
      "Compilation Appearances": {},
      "Music Videos": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "Reunion (2007–2014)": {
         "text": [
            "In 2007, Seaweed reunited to play sporadic shows, including Sub Pop's 20th anniversary show in 2008. The reunited lineup included new member Jesse Fox on drums. The band had mentioned a new album was being recorded, titled Small Engine Repair. The album never came to fruition, as the band did not have a creative drive, and also did not want to extensively tour. A few songs from the sessions were later released in 2011, as the \"Service Deck\"/\"The Weight\" single. Since the band's albums spanned different labels, the only release to see a reissue is 1999's Actions and Indications, which included three unreleased bonus tracks as a download.[13] Since their reunion in 2007, the band has played various shows and festivals, but no full tour. Their last show was in May 2014. Frontman Stauffer works as a nurse in Northern California and has said \"It’s hard to play a show because it hurts me physically. I only have one show in me. I can’t do two.\"[14]\n"
         ]
      },
      "Seaweed and Despised (1989–1991)": {
         "text": [
            "The band started out in 1989, consisting of vocalist Aaron Stauffer, guitarist Clint Werner, guitarist Wade Neal, bassist John Atkins, and drummer Bob Bulgrien. All 5 members were still attending high school at the time, and most of them were already active in other local bands. Their first major tour was alongside the band Superchunk.[3] Throughout the next few years, the band would release various one-off singles. In 1990, a smaller label known as Tupelo (known for releases by the bands Jawbreaker, Nirvana, and The Melvins) approached the band to release their first album. Instead, the band compiled their previous singles, and recorded one new song, to release Seaweed. As stated in later interviews [4] and the name of the band's 1993 album, this is considered to be the band's first major release.\n",
            "In 1990, Seaweed signed to the thriving Seattle label Sub Pop. The label wanted a single but the band wanted a full-length.[5] They met halfway, and released the EP Despised. Six songs would be brand new tracks, recorded with producer Jack Endino. The remaining four tracks were slightly remixed from their previous release, Seaweed; thus, angering their former label Tupelo. On foreign editions of the album, the last four tracks were not included.\n"
         ]
      },
      "Spanaway and Actions and Indications (1995–1999)": {
         "text": [
            "After fulfilling their contract to Sub Pop, Seaweed found a new home on major record label Hollywood Records. Their 1995 album Spanaway became the band's major label debut, and their most successful to date.[11] The single \"Start With\" would be Seaweed's only appearance on a Billboard chart, peaking at #38 on the Alternative Songs chart in 1995.[12] In the summer of that year, Seaweed was notable as being a part of the lineup for the first ever Vans Warped Tour; however, unlike many of the other bands, they would not make anymore appearances after that year. Despite the label's initial large financial advance and marketing promises, the album did not sell well as expected. It took the band over a year to be released from their contract.\n",
            "Afterwards, the band would experience their first lineup change, as drummer Bulgrien left the band. He was replaced by Quicksand drummer Alan Cage. They would decide on the label Merge Records as their next home. The label was putting out albums by Seaweed's friends such as Superchunk and Neutral Milk Hotel, and so the transition was seamless. The band's next album, Actions and Indications, came out in early 1999; however, the exposure from their previous two albums had diminished, and the band was exhausted from touring. After playing an anniversary show for Merge Records in the summer of 1999, Seaweed disbanded.\n"
         ]
      },
      "Weak and Four (1992–1994)": {
         "text": [
            "The band continued their relationship with Sub Pop, releasing their third major release (and first actual full-length) in 1992, titled Weak. Again produced by Endino, the band supported the album with a summer U.S. tour, followed by a condensed European tour with the band Pavement, stretching 69 shows over 71 days. After the exhausting touring schedule, the band went home to record their follow-up album. After impressing Sub Pop with their self-production work on a single titled \"Measure\",[6] the label allowed the band to self-produce their 1993 effort Four (being the band's 4th major release). Sub Pop promoted the album more heavily than their past albums, releasing more versions of this album and having their songs featured on more compilations.[7] Around this time, Seaweed toured with the bands Bad Religion and Green Day, a tour that Green Day bassist Mike Dirnt joked as \"The BadGreenWeed Tour\".[8] Four contained the single \"Kid Candy\", which was most prominently featured in a season four episode of the TV show Beavis and Butt-head. \"Losing Skin\" was also released as a single from this album, and would be more prominently featured on the soundtrack for the video game NHL 2K7 13 years later.[9] Seaweed would get another shot at exposure, as their cover of Fleetwood Mac's hit song \"Go Your Own Way\" was featured in the 1994 film Clerks and its soundtrack, despite being recorded a year earlier. Also in 1994, the band made an appearance on the radio program hosted by John Peel.[10]\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Seaweed and Despised (1989–1991)",
      "1.2 Weak and Four (1992–1994)",
      "1.3 Spanaway and Actions and Indications (1995–1999)",
      "1.4 Reunion (2007–2014)",
      "2 Band members",
      "2.1 Final",
      "2.2 Former",
      "3 Discography",
      "3.1 Albums",
      "3.2 Singles",
      "3.3 Music Videos",
      "3.4 Compilation Appearances",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Seaweed was an American band from Tacoma, Washington who were active throughout the 1990s. Their style of music was a combination of various rock subgenres, including grunge and post-hardcore. They were signed to various notable record labels, such as Sub Pop Records and Hollywood Records.[2]\n"
      ]
   },
   "Title": "Seaweed (band) - Wikipedia"
}