{
   "Current band members": {},
   "External links": {},
   "Former band members": {},
   "Recordings": {
      "text": [
         "In 2004, the group recorded their first full-length CD, \"Just a Spoonful (and other Folksongs of Rural Cook County)\", with noted engineer Bob Weston. The record was made as a modern field recording in an empty Chicago two flat, capturing the band live to two-track analog tape, using vintage recording equipment. In stark contrast to most modern recordings, the CD was made without edits or overdubs. The album's tunes drew from old-time country (Train 45, Katy Kline), Blues (Spoonful), Bluegrass (Orange Blossom Special), and Jazz (Duke Ellington's C Jam Blues).The record received rave reviews from the music press in publications such as Sing Out!, Bluegrass Unlimited, and the Chicago Reader. Chicago Reader music critic Monica Kendrick also drew attention to the CD's humorous liner notes, written by Jazz critic Alexander Gelfand and mandolinist Kenneth Rainey.\n",
         "Tangleweed's second full-length CD, \"Where You Been So Long?\", was recorded at King Size Sound Labs in Chicago, with engineer Mike Hagler (Billy Bragg, Wilco). The group expanded their source material to include traditional Irish ballads and tunes (the Leaving of Liverpool, the Musical Priest, and Whiskey Before Breakfast), folk ragtime (Draggin' the Bow), and western swing (I Found a New Baby). The CD was similarly well-received, garnering airplay in twenty countries and twice appearing on the Folk Music Airplay chart. The band's song \"Wrap Yourself Around Me\" was a semifinalist in the 2005 International Songwriting competition.\n",
         "Tangleweed recorded an interpretation of the popular sea shanty \"South Australia\" for the \"Old Town School of Folk Music Songbook Series, volume 2\", on Chicago-based Bloodshot Records. The recording is actually a medley of two tunes, as the band inserted the traditional fiddle tune Fisher's Hornpipe between verses. The Songbook Series sessions were engineered by John Abbey in a mobile recording facility at the school.\n",
         "Their third CD, \"Most Folk Heroes Started Out As Criminals,\" was released in October, 2008. Their fourth CD, \"Please Punch Richard for Me\" was released in July, 2011. Their fifth CD, \"In the Unlikely Event of a Water Landing\" was released in 2016.\n"
      ]
   },
   "Sections": [
      "1 Recordings",
      "2 Current band members",
      "3 Former band members",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Tangleweed is a three-person acoustic Americana band from Chicago, Illinois. They have five full-length CDs, and were included on the \"Old Town School of Folk Music Songbook Series, Volume 2\", on Bloodshot Records. Their recording of the Ola Belle Reed song \"High On a Mountain\" is featured in episode eight of the 2007 Roadtrip Nation series on PBS.\n",
         "The group performs approximately 75 dates a year, traveling as far as Hawaii, and has been featured at major festivals such as Wakarusa, the Chicago Country Music Fest, and the Folk and Roots Fest.\n"
      ]
   },
   "Title": "Tangleweed - Wikipedia"
}