{
   "Name": "Trampled by Turtles",
   "Sections": [
      "1 Lineup",
      "2 Discography",
      "2.1 Albums",
      "2.2 EPs",
      "2.3 Singles",
      "2.4 Music videos",
      "3 Appearances",
      "4 Features",
      "5 Honors and awards",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Trampled by Turtles  are an American bluegrass/folk rock band from Duluth, Minnesota.  They have released eight full albums, three of which have reached US Billboard bluegrass chart number one spots. Their fifth release, Palomino, maintained a position in the Top 10 on the bluegrass charts for 52 straight weeks. Their latest album, Life is Good on the Open Road, was released on May 4, 2018.  \n"
      ]
   },
   "Lineup": {
      "text": [
         "Simonett, Saxhaug, and Young also play in a side project called Dead Man Winter. Young fronts The Fiddle Heirs and continues to collaborate with Pert Near Sandstone; he contributed to their cover of The Beatles classic \"I Am the Walrus\".\n",
         "Dave Simonett\n",
         "Erik Berry\n",
         "Dave Carroll, Banjo\n",
         "Tim Saxhaug\n",
         "Ryan Young\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "EPs": {},
      "Singles": {},
      "Music videos": {}
   },
   "Appearances": {
      "text": [
         "The band has performed at many national festivals including Coachella, Bonnaroo, Stagecoach, Hardly Strictly Bluegrass, Bumbershoot, and Pickathon. In 2011, they performed at several large folk music festivals such as Telluride Bluegrass Festival, Newport Folk Festival, Floydfest, Pilgrimage, and ROMP roots and branches. They played at San Francisco's Outside Lands Music and Arts Festival,[6] the Sasquatch Festival, Bonnaroo, Lollapalooza, Austin City Limits Music Festival, Firefly Festival, Rock the Garden, All Good Music Festival and the Newport Folk Festival in 2012.\n",
         "Trampled by Turtles made their national television debut April 24, 2012 on Late Show with David Letterman.[7] They would return to the Late Show with David Letterman on July 16, 2014 to play songs off their Wild Animals album.\n"
      ]
   },
   "Features": {
      "text": [
         "Their single, \"Are You Behind The Shining Star?\" was featured in The Troubadour's Road Top 25 Songs of 2014.[8]\n",
         "Their music has been featured in TV shows including Deadliest Catch and Squidbillies. \n",
         "Their song \"Alone\" was featured at the end of the 2013 movie The Way Way Back.\n",
         "Their song \"Codeine\" was featured in the 2018 video game Far Cry 5.\n",
         "Their song \"Ghosts\" was featured in the Showtime series \"Ray Donovan\" in January 2019.\n"
      ]
   },
   "Honors and awards": {
      "text": [
         "The band has been honored with a star on the outside mural of the Minneapolis nightclub First Avenue,[9] recognizing performers that have played sold-out shows or have otherwise demonstrated a major contribution to the culture at the iconic venue.[10] Receiving a star \"might be the most prestigious public honor an artist can receive in Minneapolis,\" according to journalist Steve Marsh.[11]\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Trampled by Turtles  are an American bluegrass/folk rock band from Duluth, Minnesota.  They have released eight full albums, three of which have reached US Billboard bluegrass chart number one spots. Their fifth release, Palomino, maintained a position in the Top 10 on the bluegrass charts for 52 straight weeks. Their latest album, Life is Good on the Open Road, was released on May 4, 2018.  \n",
      "Simonett, Saxhaug, and Young also play in a side project called Dead Man Winter. Young fronts The Fiddle Heirs and continues to collaborate with Pert Near Sandstone; he contributed to their cover of The Beatles classic \"I Am the Walrus\".\n",
      "Dave Simonett\n",
      "Erik Berry\n"
   ],
   "infobox": {
      "Origin": [
         "Duluth, Minnesota, U.S."
      ],
      "Genres": [
         "Indie folk[1]",
         "alternative country",
         "bluegrass"
      ],
      "Instruments": [
         "Vocals, guitar, bass, mandolin, banjo, fiddle, harmonica"
      ],
      "Years active": [
         "2003–present"
      ],
      "Labels": [
         "BanjoDad"
      ],
      "Website": [
         "www.trampledbyturtles.com"
      ],
      "Members": [
         "Dave Simonett",
         "Tim Saxhaug",
         "Dave Carroll",
         "Erik Berry",
         "Ryan Young",
         "Eamonn McLain"
      ]
   }
}