{
   "Name": "Walker's Run",
   "Sections": [
      "1 History",
      "2 Other groups",
      "3 Performance",
      "4 Musical style",
      "5 Distinctions, honors, and awards",
      "6 Personnel",
      "6.1 Previous members",
      "7 Discography",
      "8 Video",
      "9 See also",
      "10 References",
      "11 External links",
      "12 Further reading"
   ],
   "Summary": {
      "text": [
         "Walker's Run is an acoustic bluegrass band based out of Lexington, Virginia who also play New Grass and Jazz music.\n"
      ]
   },
   "History": {
      "text": [
         "In 1997 Brennan Gilmore of Lexington, Virginia gathered together musicians from his hometown and from the University of Virginia, where he was studying international relations, to create the band Walker's Run.[1] The group combined Rockbridge County mountain-music, Blue Ridge bluegrass, and the Indie Rock experience of Gilmore's high school band, Concordia Discors. They packed major Charlottesville venues such as The Starr Hill Music Hall while becoming regulars at smaller venues like Millers and Michael's Bistro. Their repertoire included new takes on the  \"old time\" canon, an eclectic group of covers and crowd favorites along with original songs. The Walker's Run sound is best defined by compositions like \"Torrent\" by songwriter Gilmore.\n",
         "The band sold thousands of copies of their eponymous debut CD Walker's Run before taking a long-term hiatus in 2002 when their founder began his professional career as a United States Foreign Service Officer which takes him to long-term posts abroad.[2] During Gilmore's stateside posts, the band reunites and invites new fans to local shows.[3]  In the interim band members have continued separate musical careers, including collaborations with Sub-Saharan and North African musicians and reggae fusion to producing bluegrass records.\n",
         "In 2009, the group re-formed, welcoming two new members, mandolin player Andy Thacker with Adrienne Young and Fairweather Bums, and fiddler Nick Reeb of King Wilkie. The other band members are founding members Brennan Gilmore on guitar (switching from mandolin) and vocals and Zack Blatter on upright bass. Will Lee, of the legendary Magraw Gap and an early musical mentor to the younger Walker's Run members growing up in Rockbridge County, often joins the group on banjo and vocals.[2]\n",
         "Early members of the group from Lexington, Brian Calhoun and Randall Ray, ended up making instruments together − forming Rockbridge Guitar Company to ply their craft and trade.[4]\n"
      ]
   },
   "Other groups": {
      "text": [
         "Two members of Magraw Gap, the musical inspiration for Walker's Run, have performed with the  group:  Will Lee and Danny Knicely.  Lee and Knicely also perform as a duo. Lee's father joined the Stanley Brothers as lead guitarist after playing with Bluegrass Tar Heels, special protegées of Bill Monroe.[5] Ann Marie Calhoun (née Simpson) has toured with Jethro Tull's Ian Anderson, performed with Ringo Starr,[6] and played with the rock supergroup SuperHeavy — Mick Jagger, Dave Stewart, Joss Stone, AR Rahman, and Damian Marley — on their debut studio album.[7]\n",
         "Early Walker's Run members Billy Cardine and Ben Krakauer have helped form other groups — The Biscuit Burners and Old School Freight Train respectively — in addition to their own solo careers.  Ann Marie's sister Mary Simpson, who has also played fiddle and sung with the group, has originated Whisky Rebellion. She joined Yanni in September 2010, for his South American tour, also performing with the composer in Puerto Rico.\n",
         "Gilmore, Lee, Knicely, and Calhoun perform with another group out of Lexington and Rockbridge County, Gary Ruley and Mule Train. As Gary Ruley states:  \"There's so many great pickers who live in or near Rockbridge County that it's not difficult to get a bunch of friends together and make music.\"[8]\n"
      ]
   },
   "Performance": {
      "text": [
         "Walker's Run and its members have appeared on stages throughout the United States and overseas, including the Kennedy Center, Telluride Bluegrass Festival, Theater at Lime Kiln, and many others.  Walker's Run were highlighted at the 2009 Watermelon Park Festival in Berryville, Virginia, where Magraw Gap had reunited for an appearance the year prior — and Gary Ruley and Mule Train performed the following year.\n"
      ]
   },
   "Musical style": {
      "text": [
         "Walker's Run performs traditional bluegrass material in a hard-charging \"mountain metal\" style, always pushing the edges into other genres such as jazz, blues, reggae, and even rock.  They perform bluegrass covers of Beatles tunes together with those by reggae great Bob Marley.\n",
         "There's a roughness to the music. Our sound is more raw mountain music than cleaner traditional bluegrass.[3]"
      ]
   },
   "Distinctions, honors, and awards": {},
   "Personnel": {
      "Previous members": {
         "text": [
            "Brennan Gilmore (guitar), Zach Blatter (bass), Will Lee (banjo) of Walker's Run perform at Bel Rio in Charlottesville, Virginia April 17, 2009.\n",
            "Brennan Gilmore on guitar at Bel Rio in Charlottesville, Virginia April 17, 2009.\n",
            "Danny Knicely on violin, playing with Gary Ruley and Mule Train at The Southern Inn in Lexington, Virginia, Christmas 2008\n",
            "Will Lee on banjo, David Knicely on bass, playing with Gary Ruley and Mule Train at The Southern Inn in Lexington, Virginia, Christmas 2008\n",
            "Brennan Gilmore on mandolin, playing with Gary Ruley and Mule Train at The Southern Inn in Lexington, Virginia, Christmas 2008\n",
            "Ann Marie Calhoun on violin, playing with Gary Ruley and Mule Train at The Southern Inn in Lexington, Virginia, Thanksgiving 2008\n"
         ]
      }
   },
   "Discography": {},
   "Video": {},
   "See also": {},
   "References": {},
   "External links": {},
   "Further reading": {},
   "coreData": [
      "Walker's Run is an acoustic bluegrass band based out of Lexington, Virginia who also play New Grass and Jazz music.\n",
      "In 1997 Brennan Gilmore of Lexington, Virginia gathered together musicians from his hometown and from the University of Virginia, where he was studying international relations, to create the band Walker's Run.[1] The group combined Rockbridge County mountain-music, Blue Ridge bluegrass, and the Indie Rock experience of Gilmore's high school band, Concordia Discors. They packed major Charlottesville venues such as The Starr Hill Music Hall while becoming regulars at smaller venues like Millers and Michael's Bistro. Their repertoire included new takes on the  \"old time\" canon, an eclectic group of covers and crowd favorites along with original songs. The Walker's Run sound is best defined by compositions like \"Torrent\" by songwriter Gilmore.\n",
      "The band sold thousands of copies of their eponymous debut CD Walker's Run before taking a long-term hiatus in 2002 when their founder began his professional career as a United States Foreign Service Officer which takes him to long-term posts abroad.[2] During Gilmore's stateside posts, the band reunites and invites new fans to local shows.[3]  In the interim band members have continued separate musical careers, including collaborations with Sub-Saharan and North African musicians and reggae fusion to producing bluegrass records.\n",
      "In 2009, the group re-formed, welcoming two new members, mandolin player Andy Thacker with Adrienne Young and Fairweather Bums, and fiddler Nick Reeb of King Wilkie. The other band members are founding members Brennan Gilmore on guitar (switching from mandolin) and vocals and Zack Blatter on upright bass. Will Lee, of the legendary Magraw Gap and an early musical mentor to the younger Walker's Run members growing up in Rockbridge County, often joins the group on banjo and vocals.[2]\n"
   ]
}