{
   "Name": "Walker's Run",
   "rawData": [
      "Walker's Run is an acoustic bluegrass band based out of Lexington, Virginia who also play New Grass and Jazz music.\n",
      "In 1997 Brennan Gilmore of Lexington, Virginia gathered together musicians from his hometown and from the University of Virginia, where he was studying international relations, to create the band Walker's Run. The group combined Rockbridge County mountain-music, Blue Ridge bluegrass, and the Indie Rock experience of Gilmore's high school band, Concordia Discors. They packed major Charlottesville venues such as The Starr Hill Music Hall while becoming regulars at smaller venues like Millers and Michael's Bistro. Their repertoire included new takes on the  \"old time\" canon, an eclectic group of covers and crowd favorites along with original songs. The Walker's Run sound is best defined by compositions like \"Torrent\" by songwriter Gilmore.\n",
      "The band sold thousands of copies of their eponymous debut CD Walker's Run before taking a long-term hiatus in 2002 when their founder began his professional career as a United States Foreign Service Officer which takes him to long-term posts abroad. During Gilmore's stateside posts, the band reunites and invites new fans to local shows.  In the interim band members have continued separate musical careers, including collaborations with Sub-Saharan and North African musicians and reggae fusion to producing bluegrass records.\n"
   ],
   "infobox": {
      "Origin": [
         "Rockbridge County, Virginia, United States"
      ],
      "Genres": [
         "Folk, Country, Americana, Bluegrass,",
         "Jazz"
      ],
      "Years active": [
         "1997 to present"
      ],
      "Labels": [
         "Concordia Discors Recordings"
      ],
      "Website": [
         "Official Site"
      ],
      "Members": [
         "Brennan Gilmore",
         " Zack Blatter",
         " Will Lee",
         " Andy Thacker",
         " Nick Reeb"
      ],
      "Past members": [
         "Brian Calhoun",
         " Steve Hoke",
         " Randall Ray",
         " Ann Marie Calhoun (née Simpson) ",
         " Mary Simpson",
         " Billy Cardine ",
         " Ben Krakauer ",
         " Mark Krakauer"
      ]
   }
}