{
   "Name": "The Waybacks",
   "Sections": [
      "1 History",
      "1.1 1998: Formation",
      "1.2 1999–2000: Rise to national attention",
      "1.3 2001–Present",
      "2 Side projects",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Waybacks are an American four-piece band based in the San Francisco Bay area of California. Their style has been alternately described as Americana, Progressive bluegrass, rock-n-roll, folk, and acoustic mayhem.[1]  They described themselves as a \"power trio with a fiddler\" in an interview with NPR.[2]\n",
         "The group's most notable performances to date have included sets at large festivals such as MerleFest in Wilkesboro, North Carolina,[3] the Riverbend Festival in Chattanooga, Tennessee,[4]  and Hardly Strictly Bluegrass Festival in San Francisco's Golden Gate Park.[5] They have also headlined the Great American Music Hall and Yoshi's in their home city of San Francisco. They have a tradition of covering entire classic rock albums such as Led Zeppelin's II, the Rolling Stones' Sticky Fingers, and the Beatles' Abbey Road at the Hillside Album Hour at Merlefest.[6] They have performed with a wide array of artists, including Bob Weir,[7] Emmylou Harris,[8] Elvis Costello,[9] Joan Osborne, Susan Tedeschi, Sam Bush, John Cowan,[7] Gillian Welch,[5] and David Rawlings.[5]\n",
         "The band's second album, Burger After Church, was described by David Royko of the Chicago Tribune as the \"near-ideal balance of irreverence, chops, discipline, and originality\".[10]  The band began recording for Compass Records in 2006, releasing \"From The Pasture To The Future,\" produced by Lloyd Maines.  Their 2008 Compass release Loaded, produced by Byron House,[8] made it to number 4 on Billboard's Top Bluegrass Albums list,[11] and featured a guest appearance by Sam Bush on mandolin.\n"
      ]
   },
   "History": {
      "1998: Formation": {
         "text": [
            "The band began in 1998 with founding members Stevie Coyle (vocals, fingerpicked guitar), Wayne \"Chojo\" Jacques (vocals, fiddle, mandolin) and Glenn (Pomianek) Houston (flatpicked guitar),[12] soon to be joined by Peter Tucker (drums) and Chris Kee (vocals, bass). Live performances of this first iteration of the band drew much acclaim in the San Francisco Bay Area, not only for the Jacques/Houston solo duels and for Coyle's onstage banter, but for Kee's and Tucker's tight-as-can-be rhythm section as well.\n"
         ]
      },
      "1999–2000: Rise to national attention": {
         "text": [
            "Songwriter, lead guitarist and singer James Nash replaced Glenn Houston in June 1999, before the recording of The Waybacks' first album \"Devolver\".[13] With the addition of Nash's songwriting and distinctive guitar improvisations,[14] and without professional management or an agency (booking and promotion spearheaded internally by Coyle), The Waybacks quickly moved from playing small local pubs and coffeehouses to headlining concert halls and roots/folk/bluegrass festivals throughout North America and abroad. James Nash remains the most consistent of the band's members, and he is featured on all of The Waybacks' studio and live recordings.[15]\n",
            "Performances during the Coyle/Jacques/Nash/Kee/Tucker period included the Strawberry and Wintergrass music festivals,[16] and showcases at the Americana Music Festival in Nashville, TN, and Folk Alliance in Vancouver, BC, and Kerrville, TX.  The band began to build a national audience as tracks from its first album were added to playlists on KPFK Los Angeles, WNUR Chicago, WICN Boston, KFAI Minneapolis, WYEP Pittsburgh, and WYMS Milwaukee.[17]\n"
         ]
      },
      "2001–Present": {
         "text": [
            "Bassist Joe Kyle, Jr., and drummer Chuck Hamilton replaced Chris Kee and Peter Tucker in early 2001, as the Waybacks transitioned into a full-time touring project. In 2003, the band hired manager Michael Nash (Tritone Management) and agent Mary Brabec (now of Billions Corporation),[18] both of whom still represent The Waybacks. Songwriter, fiddler and singer Warren Hood replaced Chojo Jacques in September 2004 during the recording of the band's third studio album, From The Pasture to the Future.  Stevie Coyle left the band in September 2007, leaving the quartet lineup that continues to this day: Nash, Hood, Kyle, Hamilton.\n",
            "The band's performances have included venues such as the Kennedy Center,[19] Ryman Auditorium, Old Town School of Music,[20] The Warfield, The Fillmore, and the Bumbershoot,[21] Wakarusa,[22] and Edmonton Folk festivals.  In their peak touring seasons between 2000–2009, The Waybacks averaged between 100-200 shows/year.\n",
            "The Waybacks continue performing sporadically, and in July 2011 the band released a live album covering The Allman Brothers' \"Eat A Peach\" in its entirety with Joan Osborne on lead vocals.[23]  In April 2012, the band hosted the 5th Annual Merlefest Album Hour, performing Jimi Hendrix's \"Are You Experienced\" with guest vocalists Sarah Dugas, Susan Tedeschi, Jim Lauderdale, and John Cowan.[24]  In the years that followed, the Album Hour became a \"mainstay\" at Merlefest, running 12 years in a row as of 2019,[25] featuring the music of Tom Petty, Crosby, Stills, Nash, and Young, Bob Dylan, The Band, Bruce Springsteen.  The event has become a \"fan favorite,\" notable for \"exploring... lyrical themes by juxtaposing music from other artists and time periods\".[26]  In 2017, \"Rolling Stone\" magazine dubbed the annual event \"one of the most anticipated performances of the festival,\" and described the band's adaptation of \"Sgt. Pepper's Lonely Hearts Club Band\" as \"an inventive tribute studded with sounds that spanned the psychedelic era\".[27]\n",
            "In August, 2019, the Waybacks began performing a song by the North African band Tinariwen, who were receiving death threats for their overlapping tour of the American Southeast.[28]\n"
         ]
      }
   },
   "Side projects": {
      "text": [
         "In 2010, The Waybacks cut back their touring schedule, with James Nash and Warren Hood devoting more time to side-projects including The NashVillains,[29] James Nash and the Nomads,[30] and Warren Hood and the Goods.[31]\n",
         "Kee, Tucker, and Houston, joined by Travis Jones (vocals, guitar) and Henry Salvia (vocals, keyboards, accordion), now perform as Houston Jones.[32]  In addition, Stevie Coyle is touring nationally and internationally as a solo performer, and occasionally appears with Houston Jones as a guest.  Wayne \"Chojo\" Jacques now performs with Texas musician Billy Bright (vocals, mandolin, guitar).\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Waybacks are an American four-piece band based in the San Francisco Bay area of California. Their style has been alternately described as Americana, Progressive bluegrass, rock-n-roll, folk, and acoustic mayhem.[1]  They described themselves as a \"power trio with a fiddler\" in an interview with NPR.[2]\n",
      "The group's most notable performances to date have included sets at large festivals such as MerleFest in Wilkesboro, North Carolina,[3] the Riverbend Festival in Chattanooga, Tennessee,[4]  and Hardly Strictly Bluegrass Festival in San Francisco's Golden Gate Park.[5] They have also headlined the Great American Music Hall and Yoshi's in their home city of San Francisco. They have a tradition of covering entire classic rock albums such as Led Zeppelin's II, the Rolling Stones' Sticky Fingers, and the Beatles' Abbey Road at the Hillside Album Hour at Merlefest.[6] They have performed with a wide array of artists, including Bob Weir,[7] Emmylou Harris,[8] Elvis Costello,[9] Joan Osborne, Susan Tedeschi, Sam Bush, John Cowan,[7] Gillian Welch,[5] and David Rawlings.[5]\n",
      "The band's second album, Burger After Church, was described by David Royko of the Chicago Tribune as the \"near-ideal balance of irreverence, chops, discipline, and originality\".[10]  The band began recording for Compass Records in 2006, releasing \"From The Pasture To The Future,\" produced by Lloyd Maines.  Their 2008 Compass release Loaded, produced by Byron House,[8] made it to number 4 on Billboard's Top Bluegrass Albums list,[11] and featured a guest appearance by Sam Bush on mandolin.\n",
      "The band began in 1998 with founding members Stevie Coyle (vocals, fingerpicked guitar), Wayne \"Chojo\" Jacques (vocals, fiddle, mandolin) and Glenn (Pomianek) Houston (flatpicked guitar),[12] soon to be joined by Peter Tucker (drums) and Chris Kee (vocals, bass). Live performances of this first iteration of the band drew much acclaim in the San Francisco Bay Area, not only for the Jacques/Houston solo duels and for Coyle's onstage banter, but for Kee's and Tucker's tight-as-can-be rhythm section as well.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco Bay Area"
      ],
      "Genres": [
         "Progressive bluegrass,  rock"
      ],
      "Years active": [
         "1998-present"
      ],
      "Labels": [
         "Compass Records, Fiddling Cricket"
      ],
      "Website": [
         "www.waybacks.com"
      ],
      "Members": [
         "James Nash",
         "Warren Hood",
         "Joe Kyle Jr.",
         "Chuck Hamilton"
      ],
      "Past members": [
         "Wayne \"Chojo\" Jacques",
         "Stevie Coyle",
         "Glenn Houston",
         "Chris Kee",
         "Peter Tucker"
      ]
   }
}