{
   "Name": "You Say Party",
   "rawData": [
      "You Say Party (formerly You Say Party! We Say Die!) is a Canadian four-piece dance-punk new-wave band from Abbotsford, British Columbia.\n",
      "Their first album Hit the Floor! was released in September 2005, and the band completed their second Canadian tour, an appearance at South by Southwest and a tour of the United States, before touring the United Kingdom and Germany. Their second album Lose All Time was released in Canada on March 20, 2007, and in the United States on August 18, 2007, on Paper Bag Records, in the United Kingdom on June 18, 2007, on Fierce Panda Records and in Germany, Austria and Switzerland on August 17, 2007, on PIAS. Their third album XXXX was released on September 29, 2009, in Canada, February 9, 2010, in the US and May 17, 2010, in the UK. The band's fourth album, You Say Party, was released on February 12, 2016.\n",
      "You Say Party! We Say Die! was conceived by Stephen O'Shea, Becky Ninkovic and Krista Loewen in November 2003. The band was birthed out of a bike gang known as The Smoking Spokes.  December was too cold to ride bikes, so they started jamming in Ninkovic's parents' basement.\n"
   ],
   "infobox": {
      "Origin": [
         "Abbotsford, British Columbia, Canada"
      ],
      "Genres": [
         "Indie rock, dance-punk"
      ],
      "Years active": [
         "2004–2011, 2012–present"
      ],
      "Labels": [
         "Paper Bag Records"
      ],
      "Website": [
         "www.yousayparty.com"
      ],
      "Members": [
         "Becky Ninkovic",
         "Derek Adam",
         "Stephen O'Shea",
         "Krista Loewen"
      ],
      "Past members": [
         "Devon Clifford",
         "Bruce Dyck",
         "Jason Nicholas",
         "Carissa Ropponen",
         "Robert Andow",
         "Al Boyle"
      ]
   },
   "albums": [
      "Hit the Floor!",
      "Lose All Time",
      "XXXX",
      "You Say Party"
   ],
   "prunedData": [
      "[BAND_NAME] (formerly [BAND_NAME]! We Say Die!) is a [GENRE] band from Abbotsford, British Columbia.\n",
      "Their first album Hit the Floor! was released in [MONTH] [YEAR], and the band completed their second Canadian tour, an [GENRE] a tour of the United States, before touring the United Kingdom and Germany. Their second album Lose All Time was released in Canada on [MONTH] 20, [YEAR], and in the United States on [MONTH] 18, [YEAR], on Paper Bag Records, in the United Kingdom on [MONTH] 18, [YEAR], on Fierce Panda Records and in Germany, Austria and Switzerland on [MONTH] 17, [YEAR], on PIAS. Their third album XXXX was released on [MONTH] 29, [YEAR], in Canada, [MONTH] 9, [YEAR], in the US and [MONTH] 17, [YEAR], in the UK. The band's fourth album, [BAND_NAME], was released on [MONTH] 12, [YEAR].\n",
      "[BAND_NAME]! We Say Die! was conceived by Stephen O'Shea, [PERSON_NAME_FULL_1_FEMALE] and [PERSON_NAME_FULL_0_FEMALE] in [MONTH] [YEAR]. The band was birthed out of a bike gang known as The Smoking Spokes.  [MONTH] was too cold to ride bikes, so they started jamming in [PERSON_NAME_LAST_1]'s parents' basement.\n"
   ]
}