{
   "Name": "You Say Party",
   "Sections": [
      "1 History",
      "1.1 Formation and danskwad (2003–2004)",
      "1.2 Hit the Floor and Lose All Time (2005–2007)",
      "1.3 Remik's Cube and XXXX (2008–2009)",
      "1.4 Death of Devon Clifford, name change and REMIXXXX (2010–2011)",
      "1.5 Hiatus",
      "1.6 Reformation and You Say Party",
      "2 Members",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Remix albums",
      "3.3 EPs",
      "3.4 Singles",
      "4 See also",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "You Say Party (formerly You Say Party! We Say Die!) is a Canadian four-piece dance-punk new-wave band from Abbotsford, British Columbia.\n",
         "Their first album Hit the Floor! was released in September 2005, and the band completed their second Canadian tour, an appearance at South by Southwest and a tour of the United States, before touring the United Kingdom and Germany. Their second album Lose All Time was released in Canada on March 20, 2007, and in the United States on August 18, 2007, on Paper Bag Records, in the United Kingdom on June 18, 2007, on Fierce Panda Records and in Germany, Austria and Switzerland on August 17, 2007, on PIAS. Their third album XXXX was released on September 29, 2009, in Canada, February 9, 2010, in the US and May 17, 2010, in the UK. The band's fourth album, You Say Party, was released on February 12, 2016.\n"
      ]
   },
   "History": {
      "Formation and danskwad (2003–2004)": {
         "text": [
            "You Say Party! We Say Die! was conceived by Stephen O'Shea, Becky Ninkovic and Krista Loewen in November 2003. The band was birthed out of a bike gang known as The Smoking Spokes.  December was too cold to ride bikes, so they started jamming in Ninkovic's parents' basement.[1]\n",
            "You Say Party! We Say Die! played their first show in April 2004, and gained some instant notoriety for their \"willingness to play anything, anywhere, anytime.\"[2] Their first show was played in a church basement in Abbotsford opening for Fun 100. That year, they independently released their first EP, danskwad (pronounced \"Dance Squad\"), which is, according to different sources, a reference to the people who came to their shows, a name considered early on for the band, or the name of a more or less unrelated earlier band.\n"
         ]
      },
      "Hit the Floor and Lose All Time (2005–2007)": {
         "text": [
            "In 2005, the band began receiving press as the five members toured Canada,[3] opening for such notable acts such as The Blood Brothers and Pretty Girls Make Graves. They released a full-length album, entitled Hit the Floor!, in September, received some positive reviews,[4] and performed at Pop Montreal.\n",
            "In 2006, Edmonton-based record label Reluctant Recordings released Hit the Floor on vinyl, as You Say Party toured Canada for the second time. The group appeared at SXSW and was interviewed on MuchMusic, as they received funding for a video of \"The Gap (Between the Rich and the Poor)\" from VideoFACT. You Say Party toured the United Kingdom and Germany in May/June 2006, then continental Europe with a focus on the UK in August 2006, released a single for \"The Gap\" on UK label Cheesedream, and one for \"You Did It!\" on UK label Sink & Stove.\n",
            "In October 2006, You Say Party was heading to the United States for a major tour; however, they did not have the proper visas to be able to perform in the United States. Since band member Stephen O'Shea was banned from performing in the United States for five years, the band could not perform there until 2011 with O'Shea.[5]\n",
            "In January 2007, after months of speculation, You Say Party signed an album deal with Toronto-based Paper Bag Records label.[6] The label features such artists as Uncut and Tokyo Police Club. The band released their new album, Lose All Time, on March 20, 2007 in Canada. Lose All Time has been released by Fierce Panda Records in the United Kingdom and PIAS in Germany, Austria and Switzerland.\n"
         ]
      },
      "Remik's Cube and XXXX (2008–2009)": {
         "text": [
            "On August 26, 2008, You Say Party released Remik's Cube, a remixed version of their previous album Lose All Time. The digital-only release was put out on Paper Bag Digital, the online imprint of Paper Bag Records.[7]\n",
            "After relentless touring, members began paying attention to their personal lives again, pursuing artistic endeavours and meaningful employment. They provided supportive care for adults living with disabilities, aid to the poor in developing countries, and services for the homeless in Vancouver's Downtown East Side and the message was put forth that \"the loving is the everything.\"[8]\n",
            "The rest of 2008 was spent creating the songs that grew to become their third album, XXXX. Collaborating with producer Howard Redekopp (Tegan and Sara, The New Pornographers), XXXX was recorded between January and August 2009.\n",
            "XXXX was released to critical acclaim, and reached No. 1 on Canadian campus radio charts in only its second week on the charts, remaining at No. 1 for six weeks straight. Additionally, XXXX's lead single, \"Laura Palmer's Prom\", reached No. 1 on CBC Radio 3's The R3-30 chart the week of November 28, 2009[9] and the band was asked to perform on CBC Radio One's morning show Q.[10] You Say Party! We Say Die! played two shows for the 2010 Winter Olympics held in Vancouver, BC. In November 2009, Aux brought Becky Ninkovic together with one of her idols, Martha Johnson of Martha and the Muffins, for a cross-generational interview.[11]\n"
         ]
      },
      "Death of Devon Clifford, name change and REMIXXXX (2010–2011)": {
         "text": [
            "On April 16, 2010, just after the band had finished touring the U.S. and Western Canada,[12] drummer Devon Clifford collapsed on stage during the band's set at The Rickshaw Theatre in Vancouver. He died on April 18,[13] reportedly as a result of complications from a sudden brain hemorrhage.[14] They were slated to begin a European tour later in the month in support of XXXX, starting in Germany in April and ending in Mallorca, Spain, in June.[15]\n",
            "The band subsequently announced that they were officially dropping \"We Say Die\" from their name, \"out of respect for [Clifford] and the evolution of life\".[16] It was also announced that Krista Loewen had left the band, while Robert Andow and Bobby Siadat of Vancouver band Gang Violence had joined, taking over keyboards and drums, respectively.[16] On July 29, the band performed an outdoor show at Jubilee Park in their hometown of Abbotsford, their first live show since Clifford's death.[17] Siadat subsequently decided not to remain with the band, and was replaced by Al Boyle of the band Hard Feelings.[18]\n",
            "In July 2010 the band unveiled the track listing for their new remix album, titled REMIXXXX, which was released on September 21, 2010.[19] Concurrently, the band announced a rescheduled series of concert dates in the United Kingdom and Ireland for fall 2010.[20]\n",
            "In September 2010, XXXX won a Western Canadian Music Award for Best Rock Album of the year. The album was also included on the long list for the Polaris Prize.[21]\n",
            "On October 25, 2010, You Say Party! released a split 7-inch with The Duloks on Club.The Mammoth Records.\n"
         ]
      },
      "Hiatus": {
         "text": [
            "On April 14, 2011, You Say Party! announced \"the immediate cease to activity as YSP\", according to a statement released by the band. Bassist Stephen O'Shea wrote: \"Becky [Ninkovic, vocals], Derek [Adam, guitar] and I are announcing the immediate cease to activity as YSP. Call it a hiatus. Call it a break. Call it whatever you want. It's been a hard year for us. Not a bad year. We've experienced wonderful support from people. But you gotta listen to your body and your mind when it begins to revolt against what you think it is you have to do. So we're gonna stop for a while, and we're gonna work on who we are as people. We know that everyone understands exactly why and where we're coming from. Thanks for the support over the years.\"\n",
            "Ninkovic subsequently appeared as a guest vocalist on recordings by Beta Frontiers, Rich Aucoin and k-os.\n"
         ]
      },
      "Reformation and You Say Party": {
         "text": [
            "In July 2012, the band announced they had reunited, with Loewen returning to the lineup for the first time since 2010.[22] The band's first concert since reforming was the tenth-anniversary concert of Paper Bag Records on September 29, 2012.[23] The band has opted not to replace Clifford with another drummer, and instead utilize drum machines for percussion.[24] In January 2013, the band released a new single in tribute to Clifford, entitled \"Friend\".[24]\n",
            "In April 2014, the band celebrated their 10th anniversary by releasing the DECENNIUM EP.\n",
            "The band released their self-titled fourth album on February 12, 2016.[25]\n"
         ]
      }
   },
   "Members": {},
   "Discography": {
      "Studio albums": {},
      "Remix albums": {},
      "EPs": {},
      "Singles": {}
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "You Say Party (formerly You Say Party! We Say Die!) is a Canadian four-piece dance-punk new-wave band from Abbotsford, British Columbia.\n",
      "Their first album Hit the Floor! was released in September 2005, and the band completed their second Canadian tour, an appearance at South by Southwest and a tour of the United States, before touring the United Kingdom and Germany. Their second album Lose All Time was released in Canada on March 20, 2007, and in the United States on August 18, 2007, on Paper Bag Records, in the United Kingdom on June 18, 2007, on Fierce Panda Records and in Germany, Austria and Switzerland on August 17, 2007, on PIAS. Their third album XXXX was released on September 29, 2009, in Canada, February 9, 2010, in the US and May 17, 2010, in the UK. The band's fourth album, You Say Party, was released on February 12, 2016.\n",
      "You Say Party! We Say Die! was conceived by Stephen O'Shea, Becky Ninkovic and Krista Loewen in November 2003. The band was birthed out of a bike gang known as The Smoking Spokes.  December was too cold to ride bikes, so they started jamming in Ninkovic's parents' basement.[1]\n",
      "You Say Party! We Say Die! played their first show in April 2004, and gained some instant notoriety for their \"willingness to play anything, anywhere, anytime.\"[2] Their first show was played in a church basement in Abbotsford opening for Fun 100. That year, they independently released their first EP, danskwad (pronounced \"Dance Squad\"), which is, according to different sources, a reference to the people who came to their shows, a name considered early on for the band, or the name of a more or less unrelated earlier band.\n"
   ],
   "infobox": {
      "Origin": [
         "Abbotsford, British Columbia, Canada"
      ],
      "Genres": [
         "Indie rock, dance-punk"
      ],
      "Years active": [
         "2004–2011, 2012–present"
      ],
      "Labels": [
         "Paper Bag Records"
      ],
      "Website": [
         "www.yousayparty.com"
      ],
      "Members": [
         "Becky Ninkovic",
         "Derek Adam",
         "Stephen O'Shea",
         "Krista Loewen"
      ],
      "Past members": [
         "Devon Clifford",
         "Bruce Dyck",
         "Jason Nicholas",
         "Carissa Ropponen",
         "Robert Andow",
         "Al Boyle"
      ]
   }
}