{
   "Costuming": {
      "text": [
         "A large part of The Thickets live shows involves the band members wearing \"imaginative and bizarre\" stage costumes.[4] The outfits are usually Cthulhu Mythos-themed. The band has gone through various iterations over the years, from plush gug and fungi from Yuggoth outfits to the red jumpsuit/astronaut motif for their Spaceship Zero concerts, to their Satyr costumes, and most recently, their early twentieth century nautical styles featuring mustaches.\n"
      ]
   },
   "Discography": {
      "Compilations": {},
      "Soundtrack Appearances": {}
   },
   "External links": {},
   "Filmography": {},
   "Further details and credits": {},
   "History": {
      "Band formation (1992)": {
         "text": [
            "The Darkest of the Hillside Thickets formed in January 1992[1][2] after meeting at Fraser Valley College in Abbotsford, British Columbia.[3] Lead singer Toren Atkinson and lead guitarist Warren Banks formed the band so they could open for local group Mystery Machine.[2] Even though they \"had no musical training or experience\"[2] they were able to create a three song set list and play the opening act for their first show.\n",
            "The band's name is drawn from a phrase in Lovecraft's story The Tomb: \"I will tell only of the lone tomb in the darkest of the hillside thickets\".[2][1] Atkinson and Banks decided to create a band around the Cthulhu mythos because it was a topic they were interested in, and it was a unique \"niche that [needed] to be filled\". [4]\n",
            "In their early years the band produced three demo tapes: Gurgle Gurgle Gurgle', Hurts Like Hell!, and Cthulhuriffomania.[5] Most of the songs were later re-released on other albums.[5]\n"
         ]
      },
      "Cthulhu Strikes Back (1995)": {
         "text": [
            "The band's first CD release was Cthulhu Strikes Back.[5] Cthulhu Strikes Back was re-released as a Special Edition in 2003, containing two new songs.\n[5][6][7]\n"
         ]
      },
      "Great Old Ones (1996)": {
         "text": [
            "In 1996 the band released Great Old Ones.[8]\n"
         ]
      },
      "Let Sleeping Gods Lie (2002)": {
         "text": [
            "In 2002 the Thickets collaborated with Wizards of the Coast to release Let Sleeping Gods Lie - an all-Cthulhu Mythos themed CD. The album was used to promote Wizards' new d20 edition of the Call of Cthulhu role-playing game.[13] The album contained twelve previously-released Thickets tracks, and had a special tie-in with the Call of Cthulhu game rules. If the CD is played during a roleplaying session, the game contains rules for die roll modifiers that take effect depending on what song is currently playing.[14]\n"
         ]
      },
      "PAX, Child's Play, and Rock Band (2008)": {
         "text": [
            "In 2008 the Thickets were invited to play at the Penny Arcade Expo.[19] Their performance at the event led to their previously unreleased song \"Shhh....\" being included as a downloadable track in the PAX 2008 Collection for the video game Rock Band.[20][21] A Thickets song was also included on the \"Child's Play CD 2008\" compilation.[22][23]\n",
            "In December that year the Thickets organized a fundraiser dubbed \"Cthulhupalooza\".[24] The event included a show by the band, as well as screening of The Call of Cthulhu and a Rock Band contest. The winner of the Rock Band contest won the opportunity to perform a Rock Band song with the Thickets. Proceeds from the event were donated to Child's Play charity. A second Cthulhupalooza festival was run in 2011. [25]\n"
         ]
      },
      "Spaceship Zero (2000)": {
         "text": [
            "In 2000 the Thickets released Spaceship Zero: Original Motion Picture Soundtrack.[9][10] The singer Toren said the album was \"heavily inspired by the science fiction movies and reruns we’d all grown up with like Lost in Space and Angry Red Planet\".[11] Spaceship Zero was released under a new record label, Divine Industries.[12][10]\n"
         ]
      },
      "The Dukes of Alhazred (2017)": {
         "text": [
            "In March 2016 the Thickets launched an Indiegogo campaign to fund creation of a new album.[26] The album successfully funded later that year.[27] The album was released in 2017 with the title The Dukes of Alhazred.[17] A Stranger Aeons review said \"If you like some catchy rock with your cosmic horror, The Darkest of the Hillside Thickets are your guys!\"[28] In 2018 the Thickets won the \"Rock\" category for the Fraser Valley Music Awards.[29]\n"
         ]
      },
      "The Shadow Out of Tim (2007)": {
         "text": [
            "The Shadow Out of Tim is the Thickets' second theme album, after Spaceship Zero. The title is a play on words from the H.P Lovecraft short story The Shadow Out of Time. The album is an adaptation and a rock opera based on Lovecraft's story.[4] The album recounts the tale of a marine biologist who found his body had \"been possessed by an alien intelligence\" and works to find out what happened. [4] The album was released at the Summer Solstice (June 21) 2007.[15]\n",
            "Among the songs recorded during The Shadow Out of Tim sessions were \"Shhh....\" and \"(We're Gonna) Kill the Chupacabra (Tonight).\" They were not included on the album as they \"didn’t fit in with the [album] narrative\".[16] Both we're later released on The Dukes of Alhazred.[17]\n",
            "In 2009 the Shadow Out Of Tim song \"Blackout\" was nominated for the 8th Annual Independent Music Awards for Hard Rock/Metal Song of the year.[18]\n"
         ]
      }
   },
   "Members": {
      "Side projects": {
         "text": [
            "Several members have other artistic side projects outside of the band. Lead singer Toren Atkinson co-hosted a science/comedy podcast named Caustic Soda.[44] Drummer Jordan Pratt, former bassist/video director Bob Fugger, and former guitarist Chris Woods formed and co-hosted comedy podcast Speedway Squad. Upon Fugger's departure, Pratt and Woods were joined by Thickets guitarist Warren Banks to create a new podcast, Horsetrack Hooligans.[45]\n",
            "Toren Atkinson is also an artist, having illustrated books for several role-playing games including Dungeons & Dragons, Call of Cthulhu (and Delta Green), as well as the Lovecraft-inspired collectible card game Mythos. Warren Banks and Toren Atkinson also co-wrote the roleplaying game Spaceship Zero, published by Green Ronin Publishing, along with contributions by John Scott Tynes and Monte Cook.\n"
         ]
      },
      "Timeline": {},
      "text": [
         "The original three members of the band, at the January 1992 formation, were Toren Atkinson, Warren Banks and Quentin Rogers. Quentin, though, never appeared on any of their releases, nor played at any of their public performances. The first bass player to appear with the band at a show was Devon Presseau.[43]  The band has gone through several bassists and drummers since its inception. Thomas R. Falk has toured and played with the band as a second guitarist.\n",
         "The current line-up of the band consists of vocalist and lyricist Toren Atkinson, guitarist Warren Banks, guitarist/bassist Mario Nieva, drummer Jordan Pratt (former drummer for the band Mystery Machine), and bassist/backup vocalist Merrick Atkinson.\n"
      ]
   },
   "Musical style": {
      "Creative process": {
         "text": [
            "While the singer Toren admits to writing \"95% of the band's lyrics\",[2] he attests that the rest of the Thickets' creation process is a group effort.[2] \"Usually when we practice, one or more of us will come with some melodies and riffs we’ve cooked up over the past couple weeks, and we 'jam it out' until we either get a song or we get sick of it\".[2] He also notes that the band uses deadlines as external motivation to create: \"As a collection of lazy procrastinators, we will usually 'throw our hat over the fence' by booking time at a recording studio. Then we have x months/weeks to come up with an album\".[11]\n",
            "Toren notes that they also reach out to the Thickets fan base for help when they need special subject expertise. \"For example, for \"The Math Song\" and \"Dies Ist Unverschamtheit\" I had a brain friend help me with the algebraic equation and the German lyrics, respectively. On The Shadow Out of Tim, I put the call out ... for help with writing the Middle Egyptian lyrics\".[2]\n"
         ]
      },
      "text": [
         "Lead singer Toren Atkinson classified the Thickets' music as \"rock and roll\" and \"power pop\".[30] Toren notes that they try to be creative and original with their music and ideas. \"One thing I’m proud of ... is that while we don’t necessarily take a Lovecraft poem or story and directly put it to music ... [our songs are] steeped in Lovecraftian lore. We make ... the Cthulhu Mythos our own by putting it in a more punk-rock milieu and a distinctly new, and often tongue-in-cheek, place\".[11]\n",
         "In \"The Strange Sound of Cthulhu: Music Inspired by the Writings of H.P. Lovecraft\", Gary Hill described \"One Gilled Girl\" from Great Old Ones as \"The Ramones take on H. P. Lovecraft\".[31] Hill describes several Thickets songs as having \"thrash and punk influences merge\".[31]\n",
         "Several reviewers have specifically called out praise for the Thickets' song lyrics. A review in\nThe Unspeakable Oath said \"the lyrics really are what sets this band apart\".[32] For his part, lyric author Toren Atkinson said \"I like to challenge myself when writing music. I love playing with language\".[11]\n",
         "Toren notes that he tries to use the Thickets' music to spread knowledge of Lovecraft and other related topics. \"I try to use our music to promote literacy and that includes scientific literacy, but I don’t let that goal get in the way of our number one mandate: goofiness\".[3] \"Trying new things and being fun is our core ethos\". [4]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Band formation (1992)",
      "1.2 Cthulhu Strikes Back (1995)",
      "1.3 Great Old Ones (1996)",
      "1.4 Spaceship Zero (2000)",
      "1.5 Let Sleeping Gods Lie (2002)",
      "1.6 The Shadow Out of Tim (2007)",
      "1.7 PAX, Child's Play, and Rock Band (2008)",
      "1.8 The Dukes of Alhazred (2017)",
      "2 Musical style",
      "2.1 Creative process",
      "3 Costuming",
      "4 Shows",
      "5 Members",
      "5.1 Timeline",
      "5.2 Side projects",
      "6 Discography",
      "6.1 Compilations",
      "6.2 Soundtrack Appearances",
      "7 Videography",
      "8 Filmography",
      "9 Further details and credits",
      "10 References",
      "11 External links"
   ],
   "Shows": {
      "text": [
         "The Thickets have toured across North America a few times, performing with such bands as GWAR, Dayglo Abortions, MC Frontalot, Freezepop, BlöödHag,[33][34] Bad Brains and Nomeansno.[35][36] They played at Dragon Con in 1997.[37][38] The Thickets opened for They Might Be Giants at GenCon in 1998.[39] They were invited to play at the first annual H. P. Lovecraft Film Festival in 1996, and returned to play at the festival for three years afterward. [40] They returned again to play at the festival in 2008[41] and Anime Evolution in 2010.[42]\n"
      ]
   },
   "Summary": {
      "text": [
         "The Darkest of the Hillside Thickets is a rock band from Chilliwack, British Columbia, Canada. Their music largely consists of often tongue-in-cheek homages to the works of H. P. Lovecraft, specifically the Cthulhu Mythos.\n"
      ]
   },
   "Title": "The Darkest of the Hillside Thickets - Wikipedia",
   "Videography": {}
}