{
   "Name": "The Darkest of the Hillside Thickets",
   "rawData": [
      "The Darkest of the Hillside Thickets is a rock band from Chilliwack, British Columbia, Canada. Their music largely consists of often tongue-in-cheek homages to the works of H. P. Lovecraft, specifically the Cthulhu Mythos.\n",
      "The Darkest of the Hillside Thickets formed in January 1992 after meeting at Fraser Valley College in Abbotsford, British Columbia. Lead singer Toren Atkinson and lead guitarist Warren Banks formed the band so they could open for local group Mystery Machine. Even though they \"had no musical training or experience\" they were able to create a three song set list and play the opening act for their first show.\n",
      "The band's name is drawn from a phrase in Lovecraft's story The Tomb: \"I will tell only of the lone tomb in the darkest of the hillside thickets\". Atkinson and Banks decided to create a band around the Cthulhu mythos because it was a topic they were interested in, and it was a unique \"niche that  to be filled\". \n"
   ],
   "infobox": {
      "Also known as": [
         "The Thickets"
      ],
      "Origin": [
         "Chilliwack, British Columbia, Canada"
      ],
      "Genres": [
         "Punk rock, horror punk, power pop"
      ],
      "Years active": [
         "1992–present"
      ],
      "Labels": [
         "Divine Industries"
      ],
      "Website": [
         "http://thickets.net"
      ],
      "Members": [
         "Toren Atkinson",
         "Merrick Atkinson",
         "Warren C. Banks",
         "Mario Nieva",
         "Jordan Pratt"
      ],
      "Past members": [
         "Chris Woods, Devon Presseau, Chris West, Bob Fugger, Troy Zak"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Chilliwack, British Columbia, Canada. Their music largely consists of often tongue-in-cheek homages to the works of H. P. Lovecraft, specifically the Cthulhu Mythos.\n",
      "[BAND_NAME] formed in [MONTH] [YEAR] after meeting at Fraser Valley College in Abbotsford, British Columbia. Lead singer Toren Atkinson and lead guitarist Warren Banks formed the band so they could open for local group Mystery Machine. Even though they \"had no musical training or experience\" they were able to create a [GENRE]",
      "The band's name is drawn from a [GENRE] a band around the Cthulhu mythos because it was a topic they were interested in, and it was a unique \"niche that  to be filled\". \n"
   ]
}