{
   "Name": "Mystery Machine (band)",
   "Sections": [
      "1 History",
      "1.1 Early years",
      "1.2 10 Speed",
      "1.3 Headfirst Into Everything",
      "1.4 Montana",
      "1.5 Hiatus and reunion shows",
      "1.6 Western Magnetics",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Mystery Machine is a Canadian rock band formed in 1990 in Vancouver.[1]  The core of the band consisted of Jordan Pratt, Luke Rogalsky, Bean (Chris Switzer) and Shane Ward.\n"
      ]
   },
   "History": {
      "Early years": {
         "text": [
            "The band started in 1990 in Chilliwack, BC. The young band quickly grew a strong following around the Vancouver area with their strong musicianship, ear-splitting volume, unconventional, progressive song structures and often volatile and confrontational live shows. After winning the Vancouver Shindig contest the band was signed to Nettwerk Records. The band released their first album, Glazed, in 1993 and toured extensively in support of the album. Before working on a new record, Bean left the band and was replaced by Norm Thody from the band Captain Gravity.\n"
         ]
      },
      "10 Speed": {
         "text": [
            "In 1994, Mystery Machine headed back into the studio to record their second album. Entitled 10 Speed, it was a shift from progressive leanings of Glazed. The bands love for English shoe-gazers like My Bloody Valentine, Swervedriver and Ride was becoming more apparent. The album was as commercially successful as Mystery Machine ever got. The single \"Pound For Pound\" made its way onto the soundtrack for Foxfire, and the video for the single \"Brand New Song\" was nominated for a Much Music Video Award. After releasing the record, Bean returned and the band hit the road again.\n"
         ]
      },
      "Headfirst Into Everything": {
         "text": [
            "Now with momentum from 10 Speed, the band entered Bryan Adams' Warehouse Studios to record their third record, Headfirst Into Everything, in 1997. With an elevated budget, slick production and less complicated arrangements, the album was to be their most accessible record to date. Unfortunately, the record did not meet its commercial expectations, promotion for the record was limited and the band was dropped from Nettwerk. Around this time, Dean Young (also from the band Captain Gravity) was added as a third guitar player.\n"
         ]
      },
      "Montana": {
         "text": [
            "In 1999, Jordan left Mystery Machine to concentrate on his other band, The Darkest of the Hillside Thickets. The rest of the band carried on under the name Montana with Mario Nieva filling the vacant drumming position. Montana was meant to be a departure from the noise rock of Mystery Machine with the band taking more of an American singer/songwriter approach a la Tom Petty. Keyboardist Cary \"Cozy Pines\" Britton was added to fill out the line up. Although the band was well received, Montana never quite captured public interest.\n"
         ]
      },
      "Hiatus and reunion shows": {
         "text": [
            "With children, mortgages and other projects becoming more of a priority, the band stopped rehearsing on a regular basis. In 2004, Mystery Machine reformed with Luke, Shane, Bean from the original line-up and Mario, the drummer from Montana. They played a couple of \"reunion\" shows in Vancouver. This line up has stayed intact up until the present and has continued to write and record when the opportunity provided.\n"
         ]
      },
      "Western Magnetics": {
         "text": [
            "Western Magnetics is Mystery Machine's fourth album, released in September 2012 on Sonic Unyon Records. They had a short \"tour\" to promote the release in Ontario and Vancouver. The record is a collection of recordings made between 2000-2012 and combines elements of all three previous albums.[2]\n"
         ]
      }
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Mystery Machine is a Canadian rock band formed in 1990 in Vancouver.[1]  The core of the band consisted of Jordan Pratt, Luke Rogalsky, Bean (Chris Switzer) and Shane Ward.\n",
      "The band started in 1990 in Chilliwack, BC. The young band quickly grew a strong following around the Vancouver area with their strong musicianship, ear-splitting volume, unconventional, progressive song structures and often volatile and confrontational live shows. After winning the Vancouver Shindig contest the band was signed to Nettwerk Records. The band released their first album, Glazed, in 1993 and toured extensively in support of the album. Before working on a new record, Bean left the band and was replaced by Norm Thody from the band Captain Gravity.\n",
      "In 1994, Mystery Machine headed back into the studio to record their second album. Entitled 10 Speed, it was a shift from progressive leanings of Glazed. The bands love for English shoe-gazers like My Bloody Valentine, Swervedriver and Ride was becoming more apparent. The album was as commercially successful as Mystery Machine ever got. The single \"Pound For Pound\" made its way onto the soundtrack for Foxfire, and the video for the single \"Brand New Song\" was nominated for a Much Music Video Award. After releasing the record, Bean returned and the band hit the road again.\n",
      "Now with momentum from 10 Speed, the band entered Bryan Adams' Warehouse Studios to record their third record, Headfirst Into Everything, in 1997. With an elevated budget, slick production and less complicated arrangements, the album was to be their most accessible record to date. Unfortunately, the record did not meet its commercial expectations, promotion for the record was limited and the band was dropped from Nettwerk. Around this time, Dean Young (also from the band Captain Gravity) was added as a third guitar player.\n"
   ],
   "infobox": {}
}