{
   "Name": "These Kids Wear Crowns",
   "rawData": [
      "These Kids Wear Crowns is a six-member Canadian power pop and pop-rock boy band, formed in 2009 in Chilliwack, British Columbia, Canada. They were \"discovered\" on MuchMusic's disBand and signed to a contract with Capitol Records/EMI. They have performed with acts such as Hedley, Faber Drive, Forever the Sickest Kids, Good Charlotte and Lights. The band's debut single and music video \"Break It Up\" debuted at No. 60 on the Canadian Hot 100. They re-issued their EP on August 31, 2010.\n",
      "In Fall 2010, These Kids Wear Crowns returned to the studio to record their full-length album, entitled Jumpstart, which was released on March 1, 2011.  One of the singles released was a cover of the Whitney Houston song \"I Wanna Dance With Somebody (Who Loves Me)\" featuring Mexican actress and singer, Eiza González.\n",
      "Alex and Alan knew each other from high school, where they wrote songs together. Following a several year hiatus, in which Alex recorded some tracks as a rapper and Alan continued to hone his producing skills, they recorded a short EP as Goodnight Moon, but it was never released.   Shortly after completing that CD, Alex and Alan formed Goodnight Medic along with Matt Vink, Brad Fry and Mark Sawatzky. Goodnight Medic placed in the top 10 of the 2008 Fox Seeds contest, but broke up in February 2009 via a Facebook announcement, stating \"We will be back again in the form of something great and new.\" Following the departure of Brad and Mark, Alex, Alan, and Matt formed a new group, recruiting guitarist Joe Porter. Drummer Josh Mitchinson found out about the project via MySpace and joined These Kids Wear Crowns as named by Matt. In summer 2009, TKWC recorded their original EP, recorded and produced at the Sound Suite in Abbotsford, British Columbia. The original EP was released on September 11, 2009. In Fall 2009, the band went on a cross-Canada tour with fellow Vancouver-area band A Trophy Life. During this tour, they received news that they were selected to appear on MuchMusic's disBand in Toronto, Ontario. Needing a second guitarist, they recruited A Trophy Life's guitarist Joshua \"Gypsy\" McDaniel.\n"
   ],
   "infobox": {
      "Also known as": [
         "TKWC"
      ],
      "Origin": [
         "Chilliwack, British Columbia, Canada"
      ],
      "Genres": [
         "Power pop, pop rock, rock"
      ],
      "Years active": [
         "2009–present"
      ],
      "Labels": [
         "Capitol Records/EMI"
      ],
      "Members": [
         "Alex Johnson",
         "Alan Poettcker",
         "Matt Vink",
         "Joe Porter",
         "Josh Mitchinson",
         "Josh \"Gypsy\" McDaniel"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band, formed in [YEAR] in Chilliwack, British Columbia, Canada. They were [SONG_NAME] debuted at No. 60 on the Canadian Hot 100. They re-issued their EP on [MONTH] 31, [YEAR].\n",
      "In Fall [YEAR], [BAND_NAME] returned to the studio to record their full-length album, entitled Jumpstart, which was released on [MONTH] 1, [YEAR].  One of the singles released was a cover of the Whitney Houston song [SONG_NAME] featuring Mexican actress and singer, Eiza González.\n",
      "Alex and Alan knew each other from high school, where they wrote songs together. Following a [GENRE] a rapper and Alan continued to hone his producing skills, they recorded a short EP as Goodnight Moon, but it was never released.   Shortly after completing that CD, Alex and Alan formed Goodnight Medic along with Matt Vink, [PERSON_NAME_FULL_1_MALE] and [MONTH]k Sawatzky. Goodnight Medic placed in the top 10 of the [YEAR] Fox Seeds contest, but broke up in [MONTH] [YEAR] via a Facebook announcement, stating [SONG_NAME] McDaniel.\n"
   ]
}