{
   "Name": "Matthew Good Band",
   "rawData": [
      "Matthew Good Band was a Canadian alternative rock band formed in Coquitlam, British Columbia in 1995. The band consisted of singer-songwriter/guitarist Matthew Good, guitarist/keyboardist Dave Genn, drummer Ian Browne and bassist Geoff Lloyd. Lloyd was replaced by Rich Priske in 1998. They became one of the most successful rock bands in Canada during the late 1990s and early 2000s, being nominated for 14 Juno Awards and winning the awards for \"Best Group\" and \"Best Rock Album\" (Beautiful Midnight) in 2000. The band broke up after the release of their 2001 album, The Audio of Being.\n",
      "After beginning his music career as a folk musician, Matthew Good formed a three-piece rock band in 1995 composed of himself, drummer Ian Browne and bassist Geoff Lloyd. Dave Genn originally only recorded with the band as a paid session musician. The four recorded the band's debut album, Last of the Ghetto Astronauts. The band released the album independently in 1995, after which Genn officially joined the band. The band was not originally called \"Matthew Good Band\". In fact, the first 5000 copies of Last of the Ghetto Astronauts were just titled \"MGB\". After the album was released, \"Alabama Motel Room\" began to receive significant radio airplay, and people began requesting the song on radio and the album at retail stores calling the band, \"Matthew Good Band\". At the time, the band had been having conversations about their name, and decided that they would be called \"Matthew Good Band\". Although initially popular only in the Vancouver area, they received more exposure across Canada in 1996, with the singles \"Alabama Motel Room\" and \"Symbolistic White Walls\" becoming significant hits on radio and their music videos being played on MuchMusic. In December 1996, Matthew Good Band signed a two-album deal with Private Music.\n",
      "In mid-January 1997, on the first day of pre-production for their next album, the group was notified that BMG Entertainment North America was merging Private Music into Windham Hill/High Street Records, putting a halt to the production of the album. In mid-March, after negotiations, Windham Hill/High Street released the group from its contract. Good was paid what he was owed for the two albums, and the group then decided to record the new album without label support, using the money received from the divorce of their contract with Windham Hill/High Street to fund it. The group then agreed to release the upcoming album under a distribution agreement with PolyGram Group Canada. After releasing the EP Raygun in May 1997, the band later that year released their second full-length album, Underdogs. The album was produced by Warne Livesey, who would go on to produce every full-length MGB album and most of Good's subsequent solo albums. The album spawned the singles \"Everything Is Automatic\", \"Indestructible\", \"Apparitions\" and \"Rico\", all of which were hits in Canada.\n"
   ],
   "infobox": {
      "Origin": [
         "Coquitlam, British Columbia, Canada"
      ],
      "Genres": [
         "Alternative rock",
         "hard rock"
      ],
      "Years active": [
         "1995 (1995)–2002 (2002)"
      ],
      "Labels": [
         "A&M",
         "Mercury",
         "Polygram",
         "Darktown",
         "Universal",
         "Atlantic"
      ],
      "Associated acts": [
         "Limblifter",
         "Age of Electric",
         "Odds",
         "54-40"
      ],
      "Past members": [
         "Matthew Good",
         "Dave Genn",
         "Ian Browne",
         "Rich Priske",
         "Geoff Lloyd"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band formed in Coquitlam, British Columbia in [YEAR]. The band consisted of singer-songwriter/guitarist Matthew Good, guitarist/keyboardist [PERSON_NAME_FULL_1_MALE], drummer Ian Browne and bassist [PERSON_NAME_FULL_0_MALE]. [PERSON_NAME_LAST_0] was replaced by Rich Priske in [YEAR]. They became one of the most successful rock bands in Canada during the late [YEAR]s and early [YEAR]s, being nominated for 14 [MONTH]o Awards and winning the awards for \"Best Group\" and \"Best Rock Album\" (Beautiful Midnight) in [YEAR]. The band broke up after the release of their [YEAR] album, The Audio of Being.\n",
      "After beginning his music career as a [GENRE] a three-piece rock band in [YEAR] composed of himself, drummer [PERSON_NAME_FULL_0_MALE] and bassist Geoff Lloyd. [PERSON_NAME_FULL_1_MALE] originally only recorded with the band as a paid session musician. The four recorded the band's debut album, Last of the Ghetto Astronauts. The band released the album independently in [YEAR], after which [PERSON_NAME_LAST_1] officially joined the band. The band was not originally called \"[BAND_NAME]\". In fact, the first [YEAR] copies of Last of the Ghetto Astronauts were just titled \"MGB\". After the album was released, \"Alabama Motel Room\" began to receive significant radio airplay, and people began requesting the song on radio and the album at retail stores calling the band, \"[BAND_NAME]\". At the time, the band had been having conversations about their name, and decided that they would be called \"[BAND_NAME]\". Although initially popular only in the Vancouver area, they received more exposure across Canada in [YEAR], with the singles \"Alabama Motel Room\" and \"Symbolistic White Walls\" becoming significant hits on radio and their music videos being played on MuchMusic. In [MONTH] [YEAR], [BAND_NAME] signed a two-album deal with Private Music.\n",
      "In mid-[MONTH] [YEAR], on the first day of pre-production for their next album, the group was notified that BMG Entertainment North America was merging Private Music into Windham Hill/High Street Records, putting a halt to the production of the album. In mid-[MONTH], after negotiations, Windham Hill/High Street released the group from its contract. Good was paid what he was owed for the two albums, and the group then decided to record the new album without label support, using the money received from the divorce of their contract with Windham Hill/High Street to fund it. The group then agreed to release the upcoming album under a distribution agreement with PolyGram Group Canada. After releasing the EP Raygun in [MONTH] [YEAR], the band later that year released their second full-length album, Underdogs. The album was produced by Warne Livesey, who would go on to produce every full-length MGB album and most of Good's subsequent solo albums. The album spawned the singles \"Everything Is Automatic\", \"Indestructible\", \"Apparitions\" and \"Rico\", all of which were hits in Canada.\n"
   ]
}