{
   "Name": "Ten Ways",
   "rawData": [
      "Ten Ways (formerly Ten Ways from Sunday) is a Canadian progressive rock band formed in Port Coquitlam, British Columbia in 2001, and based in nearby Coquitlam. The band was selected as one of five British Columbian bands to perform on CBC Television's Great Canadian Music Dream event in January 2003. Their song \"You've Been Around\" was featured in EA Sports' video game NHL 2004 and was selected for CFOX's 2003 Vancouver Seeds compilation. The band has independently released two EPs, What I Wanted (produced by Tom Baker, 2003) and Ten Ways from Sunday (produced by Devin Townsend, 2005). They independently released their debut album The Solution on iTunes in May 2010 and have since been inactive.\n"
   ],
   "infobox": {
      "Origin": [
         "Port Coquitlam, British Columbia"
      ],
      "Genres": [
         "Progressive rock"
      ],
      "Years active": [
         "2001–2010"
      ],
      "Labels": [
         "Independent"
      ],
      "Associated acts": [
         "The Devin Townsend Band ",
         " Terror Syndrome"
      ],
      "Website": [
         "TenWaysMusic.com"
      ],
      "Members": [
         "Dave Young ",
         " Mike Young ",
         " Ryan Van Poederooyen ",
         " Erik Severinson"
      ],
      "Past members": [
         "Jeff Johnson ",
         " Matt Layzell ",
         " Travis Robson"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (formerly [BAND_NAME] from Sunday) is a [GENRE] band formed in Port Coquitlam, British Columbia in [YEAR], and based in nearby Coquitlam. The band was selected as one of five British Columbian bands to perform on CBC Television's Great Canadian Music Dream event in [MONTH] [YEAR]. Their song \"You've Been Around\" was featured in EA Sports' video game NHL [YEAR] and was selected for CFOX's [YEAR] Vancouver Seeds compilation. The band has independently released two EPs, What I Wanted (produced by Tom Baker, [YEAR]) and [BAND_NAME] from Sunday (produced by [PERSON_NAME_FULL_0_MALE], [YEAR]). They independently released their debut album The Solution on iTunes in [MONTH] [YEAR] and have since been inactive.\n"
   ]
}