{
   "Name": "Theory of a Deadman",
   "rawData": [
      "Theory of a Deadman (abbreviated as Theory or TOAD) is a Canadian rock band from North Delta, British Columbia. Formed in 1999, the band is currently signed to Roadrunner Records as well as 604 Records. The band includes traits of music styles, such as country and acoustic, in addition to their post-grunge and alternative rock foundation. Nine of their singles have entered the top ten of the US Billboard Mainstream Rock chart, including four songs that peaked at number one: \"Bad Girlfriend\", \"Lowlife\", \"Rx (Medicate)\" and \"History of Violence\".\n",
      "Theory of a Deadman was initially formed in 1999 by Lead Guitarist/Vocalist Tyler Connolly, and Bassist Dean Back.  They later  became the first act to sign with Nickelback frontman Chad Kroeger's 604 Records imprint in 2001 after Connolly convinced Kroeger's ex-girlfriend Jodi to send him a copy of their first demo recording. Shortly afterwards; Kroeger invited Connolly to a barbecue and discussed giving his band a record deal soon after. They released their eponymous debut album Theory of a Deadman on September 17, 2002. The name of the band comes from a song from their first album, whose lyrics describe a man preparing to commit suicide. That track was later renamed \"The Last Song\". The album was a large success for the band and was certified platinum in the United States and Canada on May 12, 2006.\n",
      "On March 29, 2005, Theory of a Deadman released their second album, Gasoline. After the release of the album, the band toured with Shinedown and No Address. Starting on March 1, 2005, Theory began a promotional tour, headlined by Breaking Benjamin and The Exies. Songs from Gasoline appeared in the soundtrack of the 2005 video game Fahrenheit, which was released under the title Indigo Prophecy in the United States.\n"
   ],
   "infobox": {
      "Also known as": [
         "Theory",
         "TOAD"
      ],
      "Origin": [
         "North Delta, British Columbia, Canada"
      ],
      "Genres": [
         "Post-grunge",
         "hard rock",
         "alternative rock",
         "alternative metal",
         "pop rock"
      ],
      "Years active": [
         "1999–present"
      ],
      "Labels": [
         "604",
         "Roadrunner",
         "Island",
         "Atlantic"
      ],
      "Associated acts": [
         "Nickelback"
      ],
      "Website": [
         "theoryofadeadman.com"
      ],
      "Members": [
         "Tyler Connolly",
         "Dave Brenner",
         "Dean Back",
         "Joey Dandeneau"
      ],
      "Past members": [
         "Tim Hart",
         "Brent Fitz",
         "Robin Diaz"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (abbreviated as Theory or TOAD) is a [GENRE] band from North Delta, British Columbia. Formed in [YEAR], the band is currently signed to Roadrunner Records as well as 604 Records. The band includes traits of music styles, such as country and acoustic, in addition to their post-grunge and alternative rock foundation. Nine of their singles have entered the top ten of the US Billboard Mainstream Rock chart, including four songs that peaked at number one: \"Bad Girlfriend\", \"Lowlife\", \"Rx (Medicate)\" and \"History of Violence\".\n",
      "[BAND_NAME] was initially formed in [YEAR] by Lead Guitarist/Vocalist Tyler Connolly, and Bassist Dean Back.  They later  became the first act to sign with Nickelback frontman Chad Kroeger's 604 Records imprint in [YEAR] after Connolly convinced Kroeger's ex-girlfriend Jodi to send him a [GENRE] a barbecue and discussed giving his band a record deal soon after. They released their eponymous debut album [BAND_NAME] on [MONTH] 17, [YEAR]. The name of the band comes from a song from their first album, whose lyrics describe a man preparing to commit suicide. That track was later renamed \"The Last Song\". The album was a large success for the band and was certified platinum in the United States and Canada on [MONTH] 12, [YEAR].\n",
      "On [MONTH] 29, [YEAR], [BAND_NAME] released their second album, Gasoline. After the release of the album, the band toured with Shinedown and No Address. Starting on [MONTH] 1, [YEAR], Theory began a promotional tour, headlined by Breaking Benjamin and The Exies. Songs from Gasoline appeared in the soundtrack of the [YEAR] video game Fahrenheit, which was released under the title Indigo Prophecy in the United States.\n"
   ]
}