{
   "Discography": {
      "text": [
         "Studio albums\n",
         "Extended Plays\n",
         "Compilations\n"
      ]
   },
   "External links": {},
   "History": {
      "text": [
         "The band formed in 2001 and began playing as many bar shows as they possibly could in their home town of Kelowna, British Columbia. After their move to Vancouver BC, selling out a four-song EP, and acquiring a new drummer and guitarist, the band sought out local producer Shawn Cole to put together what is now their first full-length album Through the Broken City.[2] The band did three consecutive nationwide tours in support of the album.\n",
         "After gaining experience from the road, Bend Sinister returned to the studio to record a few new songs. These songs included the single \"Time Breaks Down\", which moved the band into uncharted territory and captured the attention of Distort Entertainment president, Greg Below.\n",
         "In 2006, Bend Sinister switched labels to newly formed sister division of Distort Entertainment, Distort Light.\n",
         "In January 2006, the band performed a set of six songs in session at CBC Television Studio 2.[3] Later, CBC featured the band in a short film, \"Meat the Band - Bend Sinister\", on the television show ZeD.[4] The band released its third album, a self-titled EP, on September 4, 2007 and toured Canada supporting it under the sponsorship of CBC Radio 3, including a stop at Pop Montreal on October 7, 2007.[5]\n",
         "After a few more changes to their lineup, Bend Sinister returned to the studio once again in 2008 in order to put together what was to become their second full-length album, Stories of Brothers, Tales of Lovers. It was released on October 21, 2008.[6] Since then, the band has welcomed new guitarists Henry Alcock-White and Joseph Blood and released a music video for their song \"The Same Things\".\n",
         "In March 2009, they joined the Sound of Fiction Tour[7] along with Inward Eye and Mobile. Bend Sinister has played Sled Island Music Festival two consecutive years (2008 and 2009) in Calgary, Alberta. The band has also played at many small venues, and even schools like Tom Baines, also in Calgary.\n",
         "Enter 2012, Bend Sinister left Distort Ent and released On My Mind and Small Fame with Vancouver label File Under: Music. Following two years touring in Germany, Canada and the US the band spent a month in San Diego recording Animals. Released in 2014, the band followed up with extensive touring supporting Bigelf and Flying Colors.\n",
         "The band is currently signed to Cordova Bay Records and have released albums in 2017 and 2018 and continue to tour on occasion.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "3 See also",
      "4 References",
      "5 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "Bend Sinister is a progressive-indie band formed in 2001 now based in Vancouver, British Columbia, Canada. The band takes its name from a novel by Vladimir Nabokov.[1]\n"
      ]
   },
   "Title": "Bend Sinister (band) - Wikipedia"
}