{
   "Name": "Ginger (band)",
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Singles",
      "2.2 Albums",
      "3 References"
   ],
   "Summary": {
      "text": [
         "Ginger was a Canadian rock band in the 1990s. The band was formed by members of the band The Grapes of Wrath, which broke up when Kevin Kane left. The band released four singles and two albums.\n"
      ]
   },
   "History": {
      "text": [
         "Singer/guitarist/bassist Tom Hooper, drummer Chris Hooper and keyboardist Vincent Jones continued to play together after the departure of Kevin Kane from their earlier band The Grapes of Wrath.\n",
         "With the Grapes of Wrath name and song catalogue tied up in legal wrangling between Kane and the remainder of the band, Jones and the Hooper brothers adopted the name Ginger.[1][2][3] They released a self-titled EP under that name in 1993, with session players Lanny Hussey and Sean Ashby adding extra guitars.[4]\n",
         "In 1994, Ginger released Far Out. Both Far Out and the self-titled EP were noted for their strong similarity to the classic Grapes jangle-pop sound.[5] It was also notable for being one of the first CDs to be released with Enhanced CD technology.[6]\n",
         "In 1996, Jones  left the band and Lanny Hussey was promoted to full membership. Ginger then made a more conscious effort to develop its own distinctive sound, adding some trip hop and electronic elements to their album Suddenly I Came to My Senses.[7]  Jones played keyboards on the album, billed as a \"special guest\"; long-time session sideman Ashby was also a guest performer. Sarah McLachlan (billed merely as an \"additional musician\") performed some of the backing vocals on the album.[citation needed] The song \"Come to Me\" was featured in the film Kissed, and was included on the soundtrack album as well.[citation needed]\n",
         "The members of Ginger went their separate ways following that recording. Jones, Ashby and Chris Hooper became session musicians — Jones and Ashby appear on McLachlan's live albums Mirrorball and Afterglow Live. Meanwhile, Tom Hooper reunited with Kane for a new Grapes of Wrath album, Field Trip, in 2000. Jones and Chris Hooper did not participate in that reunion; Chris Hooper did, however, reunite with Tom Hooper and Kevin Kane for the band's 2013 album High Road.\n"
      ]
   },
   "Discography": {
      "Singles": {},
      "Albums": {}
   },
   "References": {},
   "coreData": [
      "Ginger was a Canadian rock band in the 1990s. The band was formed by members of the band The Grapes of Wrath, which broke up when Kevin Kane left. The band released four singles and two albums.\n",
      "Singer/guitarist/bassist Tom Hooper, drummer Chris Hooper and keyboardist Vincent Jones continued to play together after the departure of Kevin Kane from their earlier band The Grapes of Wrath.\n",
      "With the Grapes of Wrath name and song catalogue tied up in legal wrangling between Kane and the remainder of the band, Jones and the Hooper brothers adopted the name Ginger.[1][2][3] They released a self-titled EP under that name in 1993, with session players Lanny Hussey and Sean Ashby adding extra guitars.[4]\n",
      "In 1994, Ginger released Far Out. Both Far Out and the self-titled EP were noted for their strong similarity to the classic Grapes jangle-pop sound.[5] It was also notable for being one of the first CDs to be released with Enhanced CD technology.[6]\n"
   ],
   "infobox": {
      "Origin": [
         "Kelowna, British Columbia, Canada"
      ],
      "Genres": [
         "alternative rock"
      ],
      "Years active": [
         "1992–1997"
      ],
      "Labels": [
         "Nettwerk"
      ],
      "Associated acts": [
         "The Grapes of Wrath"
      ],
      "Past members": [
         "Vincent Jones",
         "Tom Hooper",
         "Chris Hooper",
         "Lanny Hussey",
         "Sean Ashby"
      ]
   }
}