{
   "Name": "The Grapes of Wrath (band)",
   "rawData": [
      "The Grapes of Wrath are a Canadian rock band.\n",
      "Formed in 1983, they enjoyed their greatest commercial success in the late 1980s and early 1990s.  The group split in 1992, although throughout the 1990s, most of the band continued to record as Ginger while the \"Grapes of Wrath\" band name was tied up in litigation. Vocalists Tom Hooper and Kevin Kane briefly reunited as the Grapes of Wrath for one album in 2000.  With the addition of Chris Hooper, the three founding members reunited in July 2010. They now tour various Canadian cities on an annual basis, mostly in Ontario and Western Canada, and are again active as a group.\n",
      "Singles, a greatest hits collection featuring two new recordings, was released in October 2012 by EMI in Canada.  The band's most recent album, High Road, was issued in 2013.  \n"
   ],
   "infobox": {
      "Origin": [
         "Kelowna, British Columbia, Canada"
      ],
      "Genres": [
         "Alternative rock"
      ],
      "Years active": [
         "1983–1992",
         "1998–2001",
         "2010–present"
      ],
      "Labels": [
         "Nettwerk",
         "Capitol-EMI",
         "Aporia Records"
      ],
      "Associated acts": [
         "Ginger",
         "Lava Hay"
      ],
      "Members": [
         "Chris Hooper",
         "Tom Hooper",
         "Kevin Kane"
      ],
      "Past members": [
         "Vincent Jones"
      ]
   },
   "albums": [
      "Seems Like Fate 1984–1992",
      "Singles"
   ],
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band.\n",
      "Formed in [YEAR], they enjoyed their greatest commercial success in the late [YEAR]s and early [YEAR]s.  The group split in [YEAR], although throughout the [YEAR]s, most of the band continued to record as Ginger while the [SONG_NAME] band name was tied up in litigation. Vocalists Tom [PERSON_NAME_LAST_0] and [PERSON_NAME_FULL_1_MALE] briefly reunited as the Grapes of Wrath for one album in [YEAR].  With the addition of [PERSON_NAME_FULL_0_MALE], the three founding members reunited in [MONTH] [YEAR]. They now tour various Canadian cities on an [GENRE] a group.\n",
      "Singles, a greatest hits collection featuring two new recordings, was released in [MONTH] [YEAR] by EMI in Canada.  The band's most recent album, High Road, was issued in [YEAR].  \n"
   ]
}