{
   "Band members": {
      "text": [
         "Former members\n"
      ]
   },
   "Discography": {},
   "History": {
      "Daria theme songs and breakup: 1997–2002": {
         "text": [
            "In 1997, Cindy Brolsma acted as a producer of the then-upcoming adult animated sitcom Daria. Brolsma shared a copy of Splendora's debut studio album, In the Grass, with fellow Daria producer Susie Lewis, who ultimately chose Splendora to compose the theme song for the show. Splendora recorded a four-track demo for the show, building these songs around certain phrases that producers asked them to include in their lyrics. \"You're Standing on My Neck\" was chosen as the show's theme, with elements of the song also acting as incidental music in the show. The full song was also featured in the 2000 puzzle adventure video game Daria's Inferno.[3] Splendora produced two further original themes for the Daria television movies Is It Fall Yet? and Is It College Yet?, being \"Turn the Sun Down\" and \"College Try\" respectively.\n",
            "Following the release of \"College Try\" in 2002, the band announced their decision to break up. With the exit of Delissa Santos and as other members began getting married and having children, there was a general lack of enthusiasm among band members. Tricia Wygal explained that these events had left the group feeling dissatisfied, stating, \"It wasn’t quite the same band. It felt a little different\".[1]\n"
         ]
      },
      "Formation and In the Grass: 1993–1996": {
         "text": [
            "After the break up of her power pop band The Wygals, Janet Wygal began recreationally composing music with her sister Tricia Wygal. By 1993, these music sessions expanded to include friends of the two sisters, namely Delissa Santos, Cindy Brolsma, and Jennifer Richardson. In an interview with Billboard, Tricia Wygal described the formation of the band to be a \"labor of love\", recalling that \"[Splendora] rehearsed all the time. It was just fun\".[1]\n",
            "Splendora's debut studio album In the Grass was released on September 9, 1995 by Koch Records. Produced collaboratively between Splendora and Gene Holder, the title of the record is a spin on the 1961 teen melodrama Splendor in the Grass.[2] In the Grass received little promotion and failed to achieve any considerable commercial success, with the album now being out of print and unavailable on music streaming services.[1] Janet Wygal attributes the album's lukewarm commercial reception to a lack of support from Koch Records, explaining: \"[Splendora] didn’t have a booking agent, the tour that we did, I booked, I think… I remember going in there and calling radio stations myself, and asking if they’d received our CD\".[1]\n"
         ]
      },
      "Post-breakup": {
         "text": [
            "In 2013, lead vocalists Janet and Tricia Wygal briefly reunited for a performance of \"You're Standing on My Neck\" at the tavern and music venue Maxwell's.\n",
            "To commemorate the 20th anniversary of Daria, Andrew Unterberger of Billboard interviewed Janet and Tricia Wygal, in which they discussed Splendora's history and the group's three Daria theme songs.[1]\n",
            "On July 6, 2020, \"You're Standing on My Neck\" was officially released onto music streaming services under the title \"Daria (Official MTV Theme)\".\n"
         ]
      }
   },
   "Musical style and influences": {
      "text": [
         "Splendora drew inspiration from a variety of genres, including CBGB, sunshine pop, and grunge. Late-'60s and '70s bands such as Ramones, Television, Talking Heads, and The Free Design were formative influences on the band.[1] Janet Wygal explained that the musical style of Splendora was meant to display \"this aggressive-sounding bed, with pretty vocals floating over it\".[1]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation and In the Grass: 1993–1996",
      "1.2 Daria theme songs and breakup: 1997–2002",
      "1.3 Post-breakup",
      "2 Musical style and influences",
      "3 Band members",
      "4 Discography",
      "5 References"
   ],
   "Summary": {
      "text": [
         "Splendora were an American all-female alternative rock band from New York City. Formed in 1993 by Janet Wygal (lead vocals, guitar), Tricia Wygal (lead vocals, bass), Delissa Santos (drums), Cindy Brolsma (cello), and Jennifer Richardson (violin), the band released one studio album, 1995's In the Grass, before disbanding in 2002.\n",
         "The band is best known for performing \"You're Standing on My Neck\", which was featured as the opening theme to the MTV animated series Daria. Splendora also performed \"Turn the Sun Down\" and \"College Try\" for the Daria television films Is It Fall Yet? and Is It College Yet?, respectively.\n"
      ]
   },
   "Title": "Splendora - Wikipedia"
}