{
   "Name": "Stutterfly",
   "rawData": [
      "Stutterfly was a post-hardcore band formed in 1998, \nStutterfly started in Kelowna, British Columbia, Canada, with four members: Alex Crowson (vocals), Jordan Chase (bass, vocals), Bradyn Byron (guitar, vocals), and Craig Langerud (drums). In 2005, Jason Ciolli (guitar) joined the band, and the next year Ryan Loerke took over on drums. 2007 saw Stickney leave the band and after recruiting vocalist Charles Furney the band decided to form Secret and Whisper rather than carry on under the Stutterfly banner.\n",
      "Stutterfly was well established at MP3.com and was a popular download. With the help of Los Angeles-based Freeze Management, Stutterfly made a deal with Madonna's Maverick Records in the summer of 2004, and later toured with fellow labelmates Story of the Year.\n",
      "Stutterfly's second full-length album “And We Are Bled of Color” was released in 2005 (to later be re-released on the bands' own label, The Elysien Project), music videos were produced for the songs \"Gun in Hand\" and \"Fire Whispers\". “And We Are Bled of Color” was a commercial disappointment, selling less than 100,000 albums, which subsequently lead to the band being dropped from their label.\n"
   ],
   "infobox": {
      "Origin": [
         "Kelowna, British Columbia, Canada"
      ],
      "Genres": [
         "Alternative metal, post-hardcore, nu metal (Early)"
      ],
      "Years active": [
         "1998–2007"
      ],
      "Labels": [
         "Maverick Records (2004-2007)"
      ],
      "Associated acts": [
         "Secret and Whisper"
      ],
      "Website": [
         "stutterfly myspace"
      ],
      "Members": [
         "Jordan Chase - Bass, Vocals",
         "Bradyn Byron - Lead Guitar, Vocals",
         "Jason Ciolli - Rhythm Guitar",
         "Ryan Loerke - Drums, Percussion",
         "Charles David Furney - Lead Vocals"
      ],
      "Past members": [
         "Chris Stickney - Lead Vocals",
         "Craig Langerud - Drums"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band formed in [YEAR], \n[BAND_NAME] started in Kelowna, British Columbia, Canada, with four members: [PERSON_NAME_FULL_0_MALE] (vocals), Jordan Chase (bass, vocals), [PERSON_NAME_FULL_2_MALE] (guitar, vocals), and [PERSON_NAME_FULL_1_MALE] (drums). In [YEAR], Jason Ciolli (guitar) joined the band, and the next year [PERSON_NAME_FULL_3_MALE] took over on drums. [YEAR] saw Stickney leave the band and after recruiting vocalist Charles Furney the band decided to form Secret and Whisper rather than carry on under the [BAND_NAME] banner.\n",
      "[BAND_NAME] was well established at MP3.com and was a popular download. With the help of Los Angeles-based Freeze Management, [BAND_NAME] made a deal with Madonna's Maverick Records in the summer of [YEAR], and later toured with fellow labelmates Story of the Year.\n",
      "[BAND_NAME]'s second full-length album “And We Are Bled of Color” was released in [YEAR] (to later be re-released on the bands' own label, The Elysien Project), music videos were produced for the songs \"Gun in Hand\" and \"Fire Whispers\". “And We Are Bled of Color” was a [GENRE] band being dropped from their label.\n"
   ]
}