{
   "Name": "We Are the City",
   "Sections": [
      "1 History",
      "2 Reception",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "We Are The City was a Canadian progressive rock band based in Vancouver, British Columbia and formed in 2008 in Kelowna, British Columbia. The last known line-up included singer-keyboardist Cayne McKenzie, drummer Andrew Huculiak, and guitarist David Menzel. Their musical style is often referred to as prog rock. The name \"We Are The City\" is inspired by Matthew 5:14 from the Bible, \"\"Ye are the light of the world. A city that is set on a hill cannot be hid.\"\" [1] Georgia Straight, a British Columbia newspaper, described the group not necessarily as a Christian band, but as a band composed of Christians.\n",
         "The band composed the score for the critically acclaimed film Violent, which was based on their album of the same name.\n"
      ]
   },
   "History": {
      "text": [
         "Their debut album, In a Quiet World, was released in 2009. It was produced by Tom Dobrzanski of The Zolas.[2] Many of the tracks were written in high school, as the band's previous incarnations. \"Astronomers\" was written when Cayne was in the 8th grade, and they posted an early demo of it on their Tumblr page. \"The album is about family, and about our journey in and out and all around spirituality,\" said band member Cayne McKenzie, \"Dare I say it, the newer songs we're writing now are even more progressive than the ones on the album,\" McKenzie says. \"So hopefully we don't spin completely out of control.\"\n",
         "High School was an EP released in the first half of 2011, after their original guitarist, David Menzel, quit the band for personal reasons. The album name comes from the alter-ego band name they used while performing as a small, aptly named band \"High School\" by tying T-shirts over their heads during shows. Eventually, they were unwittingly ratted out by other local bands who recognized them, which made them decide to release the songs as an EP under the We Are The City name.\n",
         "Their third album,Violent, was also produced by Dobrzanski.[3] Violent was released on June 4, 2013 and marks the return of David Menzel to the band. The band also has a 7\" single out, \"Morning Song/Mourning Song\". In conjunction with the album's release, We Are The City, along with Amazing Factory Production, a Vancouver-based film company, began development on a feature film sharing the album's Violent title. Violent was showcased in 2014 at the Cannes Film Festival. Coming out of the Canadian premiere of the film in the band's hometown of Vancouver, British Columbia at the Vancouver International Film Festival, the film was met with critical acclaim, with Marina Antunes of Quiet Earth saying, \"Violent is unlike any other coming of age story I've seen and its unlikely I'll ever see another one quite this profound, a movie that works as both a story of self discovery and of self reflection at the same time. A fantastic achievement that is not to be missed.\"\n",
         "In September 2015, a new song was released from the band titled Keep On Dancing, which was expected to be part of an upcoming album. The band released a music video on September 22, produced by Amazing Factory, which featured all of the band members in multiple abstract settings and clothes. The band's label, Sinnbus, released a statement on the song, saying, \"Now, looking towards recording their 3rd full length album, the band have an impulsive and experimental approach in mind. We Are The City is embarking on an idea with the intent to outdo all that the band has previously created, resulting in what, paradoxically, could either become the biggest or the smallest thing they have ever done.\nKeep On Dancing, We Are The City's first venture into self producing, was recorded in the back of a bike shop in East Vancouver. This single features a hypnotic improvised chorus, \"Whatever God is, It's here with me now.\" Captured in the recording is the first time the lyric and melody of this chorus were ever performed. The visual accompaniment aligns with the inventive nature of the track.\" [4]\n",
         "In late August 2018, the band had announced the completion of their latest effort RIP. To promote RIP, the band decided to release another new record first, called At Night. Effectively, two new album releases were announced.\n",
         "In October of 2020, the band announced on social media that disbanding. They released their final single \"Lover is Dead\" on October 11, 2020.\n"
      ]
   },
   "Reception": {
      "text": [
         "The band won the top prize in the 2009 Peak Performance Project contest, sponsored by Vancouver radio station 102.7 The Peak, receiving $150,000 for the award.[1][5]\n",
         "Exclaim! wrote that the debut album featured \"chime-y, piano-driven, anthemic rock, not unlike Coldplay's early records\", and called it \"a minor success\".[2] In its review of High School, Chart wrote that the band at times sounds \"like a less rambunctious version of Born Ruffians, which isn't a bad place to be.\"[6] The Vancouver Sun wrote, \"High School is a dark, introspective and slightly terrifying mini masterwork.\"[7]\n",
         "Clash Music praised \"Keep on Dancing\", a single from the band's new album Above Club, calling it an \"inspired return\", stating, \"Vancouver tends to do things its own way. The city stands apart, with the local creative scene fostering a deeply individual outlook. We Are The City make billowing, headily inventive music, with second album 'Violent' winning cult acclaim. Embarking on their third album, the material was self-produced in the back of a bike shop in East Vancouver, and it's an inspired return.\" Canada's Exclaim also praised the new song, saying, \"Various airy sound effects hover in the ether of the intro, just above a deep and earthy boom of drums. From there, texturally spectral guitars and falsetto vocals are brought into the mix. Lyrically, the track takes a positive approach to plotting out your day, suggesting \"Don't stay inside, don't go to bed, gotta keep on dancing.\" [8][9]\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "We Are The City was a Canadian progressive rock band based in Vancouver, British Columbia and formed in 2008 in Kelowna, British Columbia. The last known line-up included singer-keyboardist Cayne McKenzie, drummer Andrew Huculiak, and guitarist David Menzel. Their musical style is often referred to as prog rock. The name \"We Are The City\" is inspired by Matthew 5:14 from the Bible, \"\"Ye are the light of the world. A city that is set on a hill cannot be hid.\"\" [1] Georgia Straight, a British Columbia newspaper, described the group not necessarily as a Christian band, but as a band composed of Christians.\n",
      "The band composed the score for the critically acclaimed film Violent, which was based on their album of the same name.\n",
      "Their debut album, In a Quiet World, was released in 2009. It was produced by Tom Dobrzanski of The Zolas.[2] Many of the tracks were written in high school, as the band's previous incarnations. \"Astronomers\" was written when Cayne was in the 8th grade, and they posted an early demo of it on their Tumblr page. \"The album is about family, and about our journey in and out and all around spirituality,\" said band member Cayne McKenzie, \"Dare I say it, the newer songs we're writing now are even more progressive than the ones on the album,\" McKenzie says. \"So hopefully we don't spin completely out of control.\"\n",
      "High School was an EP released in the first half of 2011, after their original guitarist, David Menzel, quit the band for personal reasons. The album name comes from the alter-ego band name they used while performing as a small, aptly named band \"High School\" by tying T-shirts over their heads during shows. Eventually, they were unwittingly ratted out by other local bands who recognized them, which made them decide to release the songs as an EP under the We Are The City name.\n"
   ],
   "infobox": {
      "Origin": [
         "Kelowna, British Columbia, Canada"
      ],
      "Genres": [
         "Progressive rock, experimental pop"
      ],
      "Years active": [
         "2008–2020"
      ],
      "Labels": [
         "Hidden Pony Records, Tooth & Nail Records, Sinnbus"
      ],
      "Website": [
         "wearethecity.ca"
      ],
      "Past members": [
         "Cayne McKenzie ",
         " Andrew Huculiak ",
         " David Menzel ",
         " Blake Enemark"
      ]
   }
}