{
   "Name": "Gob (band)",
   "rawData": [
      "Gob is a Canadian punk rock band from Langley, British Columbia, formed in 1993. The band consists of Tom Thacker, Theo Goutzinakis, Gabe Mantle and Steven Fairweather. Juno nominated for best new group in 2000, and another Juno nomination for best video in 2002. Gob's most successful album is World According to Gob. Their best-selling songs to date are \"I Hear You Calling\", \"Soda\", and \"Banshee Song\". They have been featured in movies, TV shows, and many sporting video games such as NHL 2002, NHL 2003, NHL 2004 and Madden NFL 2004 with songs such as \"Oh! Ellin\", \"I've Been Up These Steps\", \"Sick With You\" (both re-mixed for the game), \"I Hear You Calling\" and \"Give Up The Grudge\". The band has appeared at several music festivals, the most well-known being the Vans Warped Tour. Thacker is also a lead guitarist for fellow Canadian rock band Sum 41.\n",
      "Gob formed in 1993 consisting of Tom Thacker as lead guitarist and vocalist, Theo Goutzinakis as rhythm/co-lead guitarist and vocalist, Patrick \"Wolfman Pat\" Paszana on drums, and Kelly Macauley on bass guitar. Thacker and Goutzinakis often switched between lead vocals with Goutzinakis playing the occasional lead guitar line. During the early days of the band, Tom usually kept his place as lead guitar while Theo had more vocal duties and focused on rhythm guitar. They recorded their self-titled Gob in 1993 and released it in 1994 on Landspeed Records with the odd numbered tracks sung by Theo and the even numbered tracks sung by Tom. The tracks 1, 2 and 8 were re-recorded and released on their next album Too Late... No Friends. Kelly Macauley was replaced by Jamie Fawkes and in 1995 Gob released Too Late... No Friends on Mint Records and Landspeed Records. It was later reissued by Nettwerk in 2000. After the release of Too Late... No Friends, Gob had replaced many bassists until they found Craig Wood. \"Wolfman\" Pat left the band due to his daughter being born before the recording of \"How Far Shallow Takes You\", so the band replaced him with Gabe Mantle, former member of a Vancouver Punk band Brand New Unit. With a newly formed band, Gob released How Far Shallow Takes You. It was home to a heavier sound with a better production value, mature lyrics focusing on personal and political issues and a growth in musicianship. It was released on Fearless records in 1998 but re-released in 1999 on Landspeed because of conflicts with Fearless. In 1999, Gob signed with Nettwerk records, who re-released the How Far Shallow Takes You album in May of the same year.\n",
      "Gob released World According to Gob, in 2001. This album was Gob's most successful album to date; featuring one of their biggest hits \"I Hear You Calling.\" Musically, the sound was a continuation of their previous 1990s-era punk rock sound. Other singles released from World According To include \"For The Moment\", \"That's The Way\" and \"No Regrets\". The album was certified Gold by the CRIA in May 2002.\n"
   ],
   "infobox": {
      "Origin": [
         "Langley, British Columbia, Canada"
      ],
      "Genres": [
         "Punk rock, pop punk[1][2]"
      ],
      "Years active": [
         "1993–present"
      ],
      "Labels": [
         "Nettwerk, Aquarius/EMI, New Damage Records"
      ],
      "Associated acts": [
         "Sum 41, The Offspring, Waiting for God, Treble Charger, Another Joe, The McRackins"
      ],
      "Members": [
         "Tom Thacker",
         "Theo Goutzinakis",
         "Gabe Mantle",
         "Steven Fairweather"
      ],
      "Past members": [
         "Tyson Maiko",
         "Craig Wood",
         "Patrick \"Wolfman Pat\" Paszana",
         "Jamie Fawkes",
         "Kelly Macauley",
         "Happy Kreter"
      ]
   }
}