{
   "Name": "Stabilo (band)",
   "Sections": [
      "1 Band`s history",
      "1.1 Before Stabilo",
      "1.2 Formation",
      "1.3 1999: First EP and growth",
      "1.4 2000-2002: Self-titled debut album",
      "1.5 2003-2005: Name change and Cupid?",
      "1.6 2006-2008: Happiness and Disaster",
      "1.7 2011-present: Hiatus",
      "2 Discography",
      "2.1 Singles",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Stabilo (originally Stabilo Boss) was a Canadian rock band from Maple Ridge, British Columbia. It formed in 1999 and is best known for its songs \"Everybody\", \"One More Pill\", \"Don't Look in Their Eyes\", \"Flawed Design\", and \"Kidding Ourselves\".\n"
      ]
   },
   "Band`s history": {
      "Before Stabilo": {
         "text": [
            "Members Jesse Dryfhout and Christopher John (then Chris Moerman) were high-school classmates who played in a band called Molly along with Shaun Bennett and McKenzie Dougall. Molly released their only EP Ghosts of Yesterday in 1997. Dryfhout was originally the drummer of the band until he came to the band with the first song that he had ever written: \"Everybody\". Soon after, he and John started to share song-writing and singing duties.\n"
         ]
      },
      "Formation": {
         "text": [
            "Molly played their last show at a barn in Maple Ridge only to walk back onto the stage as Stabilo Boss, sporting a new line-up with both Christopher and Jesse leading the band. The band's acoustic-rock sound featured Nathan Wylie, an accomplished drummer and former classmate of the band, and Shaun Bennett on bass.\n"
         ]
      },
      "1999: First EP and growth": {
         "text": [
            "In 1999, the band recorded Kitchen Sessions, so named as it was an independent recording made in a kitchen. The EP was a completely home-made affair, the band and their university friends burning and distributing the discs themselves. Around this time, Stabilo Boss began to grow a solid local fan base based on the core support of their peers in school.\n"
         ]
      },
      "2000-2002: Self-titled debut album": {
         "text": [
            "In the summer of 2000, the band recorded their self-titled debut with Recording Producer/Engineer, Matthew J Doughty at Praiz Sound Studio in Northern California.  Released independently in early 2001, the album quickly sold out of its first pressing as Stabilo Boss began to become regulars in the local Vancouver music scene. The band's big break came roughly a year later when a DJ at the Vancouver's XFM decided to play \"Everybody\" on their music competition show, Chaos.\n",
            "The band's solid songwriting and loyal fan base lead to the song beating out other offerings from more well-established artists and dominating the station's Top 7@7 charts for nearly a month. With this exposure, the band sold 5000 copies of their album independently and began to be courted by major labels.\n",
            "In the midst of all of the excitement over \"Everybody\", the band quietly released The Beautiful Madness EP which they sold only at their shows. The four song disc was recorded live off of the soundboard and prominently featured a grand piano on all tracks. It quickly sold out.\n"
         ]
      },
      "2003-2005: Name change and Cupid?": {
         "text": [
            "Rather than accept the first offers coming in from major labels, the band began to record their next album at Mushroom Studios. According to John, the studio's owner John Wozniak (Marcy Playground) liked the band so much that he \"basically just gave us free time there\". By 2003, the band had completed their next album, produced by Wozniak and local musician/producer Jon Anderson (Radiogram/Jonathan Inc.).\n",
            "At this point, the album was not released as Stabilo Boss was courting the record companies. After a search, they signed a deal with EMI Canada. With this transition to the big time, the band shortened their name to Stabilo. In an interview, Jesse stated that the band's name came from the Stabilo Boss brand highlighter they used to write down possible band names.\n",
            "After touring Canada, sharing the stage with many notable Canadian performers, the new material recorded in 2002 was included in the album 'Cupid?', which was released on May 11, 2004. The radio-friendly release was somewhat of a let down to longtime fans who had been waiting for the release of a new album's worth of material for two years. Most of the new material recorded was shelved in favor of a seven-song disc featuring only three previously unreleased tracks.\n",
            "For the uninitiated, the album was well received across Canada with \"Everybody\" repeating much of its original success in many new locations. The re-release of \"Everybody\" was followed by the single \"One More Pill\", which was also culled from the self-titled disc.\n"
         ]
      },
      "2006-2008: Happiness and Disaster": {
         "text": [
            "Stabilo released their second album with EMI Canada on April 4, 2006 called Happiness and Disaster. The first single, \"Flawed Design\", was played on radio stations across Canada (and in nearby U.S. areas such as Detroit) rising to Number 1 on the Canadian charts. The video was aired on MuchMusic, MuchMoreMusic and Most Requested. In July 2006, Stabilo released their second single and video from the Happiness and Disaster album, \"Kidding Ourselves\". In September 2006, Stabilo was awarded the SOCAN(Society of Composers, Authors and Music Publishers of Canada)#1 song award for \"Flawed Design\", which topped the Canadian Music Networks' Hot Adult Contemporary Chart on May 16, 2006.\n",
            "In March 2007, Stabilo was nominated as the Juno Awards New Band of the Year, but lost to Mobile.\n",
            "In November 2007, Stabilo was awarded the SOCAN award for \"Flawed Design\" in the category of pop song that achieved the greatest number of plays on Canadian radio for 2006.\n"
         ]
      },
      "2011-present: Hiatus": {
         "text": [
            "In April 2011, the band released a statement declaring they were on permanent hiatus. Bass player Karl Williaume now plays with Canadian reggae singer Caleb Hart as a part of 'The Royal Youths'\n"
         ]
      }
   },
   "Discography": {
      "Singles": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Stabilo (originally Stabilo Boss) was a Canadian rock band from Maple Ridge, British Columbia. It formed in 1999 and is best known for its songs \"Everybody\", \"One More Pill\", \"Don't Look in Their Eyes\", \"Flawed Design\", and \"Kidding Ourselves\".\n",
      "Members Jesse Dryfhout and Christopher John (then Chris Moerman) were high-school classmates who played in a band called Molly along with Shaun Bennett and McKenzie Dougall. Molly released their only EP Ghosts of Yesterday in 1997. Dryfhout was originally the drummer of the band until he came to the band with the first song that he had ever written: \"Everybody\". Soon after, he and John started to share song-writing and singing duties.\n",
      "Molly played their last show at a barn in Maple Ridge only to walk back onto the stage as Stabilo Boss, sporting a new line-up with both Christopher and Jesse leading the band. The band's acoustic-rock sound featured Nathan Wylie, an accomplished drummer and former classmate of the band, and Shaun Bennett on bass.\n",
      "In 1999, the band recorded Kitchen Sessions, so named as it was an independent recording made in a kitchen. The EP was a completely home-made affair, the band and their university friends burning and distributing the discs themselves. Around this time, Stabilo Boss began to grow a solid local fan base based on the core support of their peers in school.\n"
   ],
   "infobox": {
      "Origin": [
         "Maple Ridge, British Columbia, Canada"
      ],
      "Genres": [
         "Rock",
         "Acoustic rock"
      ],
      "Years active": [
         "1999–2011 (hiatus)"
      ],
      "Labels": [
         "EMI Canada"
      ],
      "Members": [
         "Jesse Dryfhout",
         "Christopher John",
         "Nathan Wylie",
         "Karl Williaume"
      ]
   }
}