{
   "Name": {
      "text": [
         "The band got their name when Faber and Red were driving and Faber was playing guitar behind the wheel and drove through a red light. Red then said \"Faber drive!\", thus giving them the name Faber Drive. After winning the Fox Seeds competition, they changed their name to Faber Drive to avoid potential legal issues. One of the names they considered before electing Faber Drive was Seven Second Surgery, but they decided it made a better album title than band name.\n"
      ]
   },
   "Sections": [
      "1 Biography",
      "2 Name",
      "3 History",
      "3.1 Formation",
      "3.2 Early years and rise to fame",
      "3.3 Seven Second Surgery",
      "3.4 Can't Keep a Secret",
      "3.5 Lost in Paradise",
      "3.6 2014 to present",
      "4 Members",
      "4.1 Current members",
      "4.2 Former members",
      "4.3 Touring members",
      "5 Discography",
      "5.1 Albums",
      "5.2 EP",
      "6 Awards",
      "7 See also",
      "8 References",
      "9 External links"
   ],
   "Summary": {
      "text": [
         "Faber Drive is a four-piece Canadian pop punk band from Mission, British Columbia, formed in 2004. The band consist of lead vocalist Dave Faber, lead guitarist Jordan Pritchett, bass guitarist Jeremy \"Krikit\" Liddle and drummer Seamus O'Neill.\n"
      ]
   },
   "Biography": {
      "text": [
         "Faber Drive is a four-piece Juno Award-nominated Canadian rock band from Mission, British Columbia. They have toured with bands such as Hedley, Stereos, Marianas Trench, Simple Plan and Metro Station. They have gained a huge amount of popularity in many parts of Canada. Already well known for a local fan base, Faber Drive released a limited-edition three-song EP under the band name Faber. Due to legal issues, the band changed their name to Faber Drive.\n",
         "Discovered by Chad Kroeger of Nickelback and signed to his 604 Records label, Faber Drive released their debut album Seven Second Surgery on May 1, 2007, which was followed by the release of four singles. The band's biggest influences are U2, The Police, Def Leppard, Jimmy Eat World, Stryper and Winger. The band also featured in the American drama television series Kyle XY. Two of their songs, \"Killin' Me\" and \"Summer Fades to Fall\", had featured in the show. The band also made an appearance in episode 3.01, \"Psychic Friend\", which aired on January 19, 2009. The band's lead singer Dave Faber is married to Ricarda Faber and has four kids—Faith, David Dayton, Patience and Isaiah (also known as Powfu).\n"
      ]
   },
   "History": {
      "Formation": {
         "text": [
            "Faber taught \"Red\" how to play drums for a while and asked him if he wanted to audition for his band. Hinsley was referred to Faber by his brother. At first, Dave thought he wasn't what he was looking for. A couple days later, Hinsley invited Faber for some beverages and they just connected. Dave found his lead guitarist. Red and Faber saw Krikit playing bass at an Easter service at the local church. Faber gave him his number, Krikit thought he was trying to make him come to church more often but he was going to stop coming because he had started drinking and didn't feel it was right. When he found out Faber and Red weren't from the church he was overwhelmed. He learned all the songs and played without hesitation three days before the band's first gig. Since then, they have opened for bands such as Nickelback, Hedley and Simple Plan.\n"
         ]
      },
      "Early years and rise to fame": {
         "text": [
            "After forming Faber, Dave would sign to Chad Kroeger of Nickelback's 604 Records label and hook up with Joey Moi for pre-production and Brian Howes to co-write with Faber. They then joined Fox's Battle of the Bands and would eventually win. After the band's triumph, they released a limited edition self-titled EP. They would later change their name to Faber Drive to avoid potential legal issues and would go on tour to promote their debut album titled Seven Second Surgery. Some concerts were partially taped on camera by band members and posted on YouTube. They would release three singles and music videos from Seven Second Surgery. In April 2008, Ray was married and decided to leave the band. Calvin \"Poncho\" Lechner would join Faber Drive's line up and replace Red. They would later release a fourth single titled \"Sleepless Nights\", concerning a child's point of view of his parents fighting. In the summer of 2008, David Hinsley quit the band. Zubin Thakkar from the band Prize Fighter would come in to replace Hinsley and play in concerts until Faber Drive's last show in October 2008.\n"
         ]
      },
      "Seven Second Surgery": {
         "text": [
            "Faber Drive's debut album, Seven Second Surgery, was released on May 1, 2007. Four singles were released from Seven Second Surgery: \"Second Chance\", \"Tongue Tied\", \"When I'm with You\", and \"Sleepless Nights\" (featuring Brian Melo). While \"Second Chance\" and \"Tongue Tied\" had successful chart positions in the west of Canada, \"When I'm with You\" had its best chart positions in the east.\n"
         ]
      },
      "Can't Keep a Secret": {
         "text": [
            "The band's second album, Can't Keep a Secret, was released on November 10, 2009. The lead single, \"G-Get Up and Dance\", was produced by Faber, Dave \"Rave\" Ogilvie (Nine Inch Nails) and Colin \"Crocker\" Friesen. The single premiered on July 13, 2009, and became available on iTunes on July 21, 2009. Guitarist Jordan Pritchett, son of country singer Aaron Pritchett, and drummer Andrew Stricko joined, replacing Hinsley and Lechner. \"G-Get Up and Dance\" went Gold after five weeks and reached number 6 on the Canadian Hot 100.\n"
         ]
      },
      "Lost in Paradise": {
         "text": [
            "The band released their third studio album, Lost in Paradise, on August 28, 2012. Since the album's release, Faber Drive has shot and released music videos for the songs \"Do It in Hollywood\", \"Candy Store\" and \"Life Is Waiting\". And before they released their new single \"Life Is Waiting\", Andrew Stricko left the band and Seamus O'Neill replaced him. The band headed across Canada on the successful Lost in Paradise tour in Fall/Winter 2012. They have since visited Singapore to perform two shows for Music Matters and performed at some music festivals during the summer of 2013. They have since released two more singles from their third studio album, \"Too Little Too Late\" (featuring Pierre Bouvier of Simple Plan) and \"Dead On The Dancefloor\" (featuring Proper Villains). But the Music Videos are still not made. Therefore, the Official Lyric Video of \"Dead On The Dancefloor\" is already made by Warner Music Philippines. Note: (The single \"Dead On The Dancefloor\" [featuring Proper Villains] is the promotional single in Philippines).\n"
         ]
      },
      "2014 to present": {
         "text": [
            "In April 2014, Faber Drive announced that they would play at Spring Fest 2014 at Kal Tire Place in Vernon, British Columbia, featuring Kardinal Offishall, Karl Wolf, JRDN and These Kids Wear Crowns. On May 23, 2014, the show was cancelled due to unforeseen circumstances. Simple Plan toured with Faber Drive in June 2014 in Kirkland Lake, Canada, marking Faber Drive's last show of 2014. They later released two demos from their fourth album, \"The Best of Me\" and \"Gonna Make It\". On July 24, 2015, the band held an acoustic mini-show at Highstreet in Abbotsford, British Columbia.[citation needed]\n",
            "In January 2016, Faber Drive posted on their official Facebook account that they would have new exciting things possibly happening that year. Then, they started to post some photos from their past concerts and music videos from their previous albums. Six months later, the band posted a photo showing that Dave was already back in the studio and they hinted that they would release new music shortly. On December 4, 2016, they held a reunion concert with their friends and special guests at the Hard Rock Casino in Vancouver. Following this, they released a Christmas song called \"We 3 Kings\". On March 13, 2017, they released new demos from their upcoming album ― \"More Than Perfect\", \"Without\", \"Without a Fight\", \"One Million\" and \"Done My Best\". On August 5, 2018, they released a new single called \"Surrender\".[citation needed]\n",
            "After a year, the band released new songs like \"To Be With You ft. Powfu (cover)\", \"What Are We Waiting For\", \"Night Like This\", \"Mr Good For Nothin'\", another collab song with Powfu--\"Chocolate Milk\" & \"I Can See the Light\", \"Have You Ever Seen the Rain ft. The Faceplants (cover)\" and \"You Lift Me Up ft. sleep.ing\"\n",
            "In 2020, they released 2 Demos called \"Can We Talk\" and \"Is Heaven Where You Are\". Also, they do a cover song with his daughter (sleep.ing) called \"Time After Time\" and collab with Maddi K, \"Me Myself and I\". But the long awaited fourth album is still unknown.\n"
         ]
      }
   },
   "Members": {
      "Current members": {},
      "Former members": {},
      "Touring members": {}
   },
   "Discography": {
      "Albums": {},
      "EP": {}
   },
   "Awards": {},
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Faber Drive is a four-piece Canadian pop punk band from Mission, British Columbia, formed in 2004. The band consist of lead vocalist Dave Faber, lead guitarist Jordan Pritchett, bass guitarist Jeremy \"Krikit\" Liddle and drummer Seamus O'Neill.\n",
      "Faber Drive is a four-piece Juno Award-nominated Canadian rock band from Mission, British Columbia. They have toured with bands such as Hedley, Stereos, Marianas Trench, Simple Plan and Metro Station. They have gained a huge amount of popularity in many parts of Canada. Already well known for a local fan base, Faber Drive released a limited-edition three-song EP under the band name Faber. Due to legal issues, the band changed their name to Faber Drive.\n",
      "Discovered by Chad Kroeger of Nickelback and signed to his 604 Records label, Faber Drive released their debut album Seven Second Surgery on May 1, 2007, which was followed by the release of four singles. The band's biggest influences are U2, The Police, Def Leppard, Jimmy Eat World, Stryper and Winger. The band also featured in the American drama television series Kyle XY. Two of their songs, \"Killin' Me\" and \"Summer Fades to Fall\", had featured in the show. The band also made an appearance in episode 3.01, \"Psychic Friend\", which aired on January 19, 2009. The band's lead singer Dave Faber is married to Ricarda Faber and has four kids—Faith, David Dayton, Patience and Isaiah (also known as Powfu).\n",
      "The band got their name when Faber and Red were driving and Faber was playing guitar behind the wheel and drove through a red light. Red then said \"Faber drive!\", thus giving them the name Faber Drive. After winning the Fox Seeds competition, they changed their name to Faber Drive to avoid potential legal issues. One of the names they considered before electing Faber Drive was Seven Second Surgery, but they decided it made a better album title than band name.\n"
   ],
   "infobox": {
      "Origin": [
         "Mission, British Columbia, Canada"
      ],
      "Genres": [
         "Pop punk, alternative rock, synthpop (new material)"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "604"
      ],
      "Associated acts": [
         "These Kids Wear Crowns, Simple Plan, Green Day, Hedley, The Latency, Stereos, Marianas Trench, The New Cities, MXPX, Ishan Morris, Belly, Jessie Farrell, Suzie McNeil"
      ],
      "Website": [
         "www.faberdrive.com"
      ],
      "Members": [
         "Dave Faber",
         "Jeremy \"Krikit\" Liddle",
         "Seamus O'Neill",
         "Jordan \"JP\" Pritchett"
      ],
      "Past members": [
         "Ray Bull",
         "David Hinsley",
         "Calvin Lechner ",
         "Andrew Stricko"
      ]
   }
}