{
   "Name": "Faber Drive",
   "rawData": [
      "Faber Drive is a four-piece Canadian pop punk band from Mission, British Columbia, formed in 2004. The band consist of lead vocalist Dave Faber, lead guitarist Jordan Pritchett, bass guitarist Jeremy \"Krikit\" Liddle and drummer Seamus O'Neill.\n",
      "Faber Drive is a four-piece Juno Award-nominated Canadian rock band from Mission, British Columbia. They have toured with bands such as Hedley, Stereos, Marianas Trench, Simple Plan and Metro Station. They have gained a huge amount of popularity in many parts of Canada. Already well known for a local fan base, Faber Drive released a limited-edition three-song EP under the band name Faber. Due to legal issues, the band changed their name to Faber Drive.\n",
      "Discovered by Chad Kroeger of Nickelback and signed to his 604 Records label, Faber Drive released their debut album Seven Second Surgery on May 1, 2007, which was followed by the release of four singles. The band's biggest influences are U2, The Police, Def Leppard, Jimmy Eat World, Stryper and Winger. The band also featured in the American drama television series Kyle XY. Two of their songs, \"Killin' Me\" and \"Summer Fades to Fall\", had featured in the show. The band also made an appearance in episode 3.01, \"Psychic Friend\", which aired on January 19, 2009. The band's lead singer Dave Faber is married to Ricarda Faber and has four kids—Faith, David Dayton, Patience and Isaiah (also known as Powfu).\n"
   ],
   "infobox": {
      "Origin": [
         "Mission, British Columbia, Canada"
      ],
      "Genres": [
         "Pop punk, alternative rock, synthpop (new material)"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "604"
      ],
      "Associated acts": [
         "These Kids Wear Crowns, Simple Plan, Green Day, Hedley, The Latency, Stereos, Marianas Trench, The New Cities, MXPX, Ishan Morris, Belly, Jessie Farrell, Suzie McNeil"
      ],
      "Website": [
         "www.faberdrive.com"
      ],
      "Members": [
         "Dave Faber",
         "Jeremy \"Krikit\" Liddle",
         "Seamus O'Neill",
         "Jordan \"JP\" Pritchett"
      ],
      "Past members": [
         "Ray Bull",
         "David Hinsley",
         "Calvin Lechner ",
         "Andrew Stricko"
      ]
   },
   "albums": []
}