{
   "Name": "3 Inches of Blood",
   "rawData": [
      "3 Inches of Blood was a Canadian heavy metal band formed in 1999 in Victoria, British Columbia, last consisting of Cam Pipes, Justin Hagberg, Shane Clark, and Ash Pearson, none of whom were original members of the band. They are marked by strong influences from the new wave of British heavy metal movement.\n",
      "The group began when Jamie Hooper, Sunny Dhak, and Bobby Froese, along with Geoff Trawick and Rich Trawick filling in on drums and bass, got together to do a one-off reunion gig for an old group of theirs, but things went so well with writing new material in a traditional metal style that they decided to continue under a new moniker. Rich Trawick's roommate, Steve Bays (keyboard player for Hot Hot Heat), heard the demo of the band's first recording and suggested having his friend Cam Pipes overdub some clean vocals to it. Pipes overdubbed additional vocals to what became the band's first EP, Sect of the White Worm, and became a permanent band member after the results proved to the rest of the band's liking. Their debut album Battlecry Under a Wintersun was recorded in 2002 and released in cooperation with the Teenage Rampage and Fashion Before Function labels. It was later remastered and re-released by the band under their own label, Minion Music. This album had moderate underground success in the Canadian market, ranking on national college radio charts and winning Metal Album of Year at the 2002 Canadian Independent Music Awards. The band garnered international exposure when its UK distribution label put them on as a support slot for a tour with platinum rock band The Darkness. This exposure garnered much critical attention and acclaim in the world of underground metal, and they were signed by major label subsidiary Roadrunner Records in 2004.\n",
      "In 2004, Geoff Trawick (original drummer) and brother Rich Trawick (original bass player) left the band following personal differences with the rest of the band and professional differences with Roadrunner Records. Matt Wood of Vancouver doom/sludge/noise band Goatsblood, and Brian Redman replaced them. Soon after, just after recording the band's second album Advance and Vanquish, original guitarists Sunny Dhak and Bob Froese left the band and, with Mike Payette and Matt Wood (who is also an ex-3 Inches of Blood member and was replaced by Alexei Rodriguez), founded the rock band Pride Tiger.\n"
   ],
   "infobox": {
      "Origin": [
         "Victoria, British Columbia, Canada"
      ],
      "Genres": [
         "Heavy metal",
         "power metal",
         "speed metal",
         "thrash metal"
      ],
      "Years active": [
         "1999–2015"
      ],
      "Labels": [
         "Minion, Roadrunner, Century Media"
      ],
      "Associated acts": [
         "Pride Tiger, S.T.R.E.E.T.S, Allfather, Curse of the North, Bison B.C."
      ],
      "Website": [
         "www.3inchesofblood.com"
      ],
      "Past members": [
         "Jay Watts",
         "Geoff Trawick",
         "Rich Trawick",
         "Bobby Froese",
         "Sunny Dhak",
         "Matt Wood",
         "Brian Redman†",
         "Alexei Rodriguez",
         "Jamie Hooper",
         "Nick Cates",
         "Byron Stroud",
         "Cam Pipes",
         "Justin Hagberg",
         "Shane Clark",
         "Ash Pearson",
         "Steve Ericson (live/touring only)",
         "Aaron \"Boon\" Gustafson (live/touring only)"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band formed in [YEAR] in Victoria, British Columbia, last consisting of Cam Pipes, [PERSON_NAME_FULL_0_MALE], Shane Clark, and Ash Pearson, none of whom were original members of the band. They are marked by strong influences from the new wave of British heavy metal movement.\n",
      "The group began when [PERSON_NAME_FULL_2_FEMALE], Sunny Dhak, and [PERSON_NAME_FULL_1_MALE], along with [PERSON_NAME_FULL_0_MALE] and Rich [PERSON_NAME_LAST_0] filling in on drums and bass, got together to do a [GENRE] an old group of theirs, but things went so well with writing new material in a traditional metal style that they decided to continue under a new moniker. Rich [PERSON_NAME_LAST_0]'s roommate, [PERSON_NAME_FULL_4_MALE] (keyboard player for Hot Hot Heat), heard the demo of the band's first recording and suggested having his friend [PERSON_NAME_FULL_3_FEMALE] overdub some clean vocals to it. [PERSON_NAME_LAST_3] overdubbed additional vocals to what became the band's first EP, Sect of the White Worm, and became a permanent band member after the results proved to the rest of the band's liking. Their debut album Battlecry Under a Wintersun was recorded in [YEAR] and released in cooperation with the Teenage Rampage and Fashion Before Function labels. It was later remastered and re-released by the band under their own label, Minion Music. This album had moderate underground success in the Canadian market, ranking on national college radio charts and winning Metal Album of Year at the [YEAR] Canadian Independent Music Awards. The band garnered international exposure when its UK distribution label put them on as a support slot for a tour with platinum rock band The Darkness. This exposure garnered much critical attention and acclaim in the world of underground metal, and they were signed by major label subsidiary Roadrunner Records in [YEAR].\n",
      "In [YEAR], [PERSON_NAME_FULL_0_MALE] (original drummer) and brother Rich [PERSON_NAME_LAST_0] (original bass player) left the band following personal differences with the rest of the band and professional differences with Roadrunner Records. [PERSON_NAME_FULL_4_MALE] of Vancouver doom/sludge/noise band Goatsblood, and [PERSON_NAME_FULL_2_MALE] replaced them. Soon after, just after recording the band's second album Advance and Vanquish, original guitarists Sunny Dhak and [PERSON_NAME_FULL_3_MALE] left the band and, with Mike Payette and [PERSON_NAME_FULL_4_MALE] (who is also an ex-[BAND_NAME] member and was replaced by [PERSON_NAME_FULL_1_MALE]), founded the rock band Pride Tiger.\n"
   ]
}