{
   "Name": "Archspire",
   "Sections": [
      "1 History",
      "2 Members",
      "2.1 Current members",
      "2.2 Former members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Archspire is a Canadian technical death metal band from Vancouver, British Columbia. They are currently signed to Season of Mist.[1] The group has released three studio albums.[2]\n"
      ]
   },
   "History": {
      "text": [
         "The band was formed in 2007 as Defenestrated, but changed their name to Archspire in 2009.[3]\n",
         "In April 2011, Trendkill Recordings released All Shall Align, the band's first album. It was recorded between May and December 2010 working with producer Stuart McKillop at The Hive studios[4]\n",
         "In early 2013, founding bassist Jaron Evil suffered an unexpected stroke at age 31.[5] He returned to the band for a brief period after recovering, but eventually parted ways.\n",
         "Later in 2013, Archspire signed with Season of Mist,[6] and returned to Rain City Recorders to produce a second album with Stuart McKillop.[7] On February 2, 2014, the band released a single from their upcoming album, \"Lucid Collective Somnambulation\",[8] and in April released The Lucid Collective.[1][9][10]\n",
         "In January 2015 the band announced they were seeking a permanent bass player as a replacement for then-touring bassist Clayton Harder. They asked interested parties to record a video of themselves playing an Archspire song (they suggested \"Deathless Ringing\") and sending the band a link.[11] On January 12, the band announced that they had selected Jared Smith to become their full-time bassist, and posted Smith's play through video of \"Lucid Collective Somnambulation\".[12]\n",
         "The band announced their third album Relentless Mutation and a single, \"Involuntary Doppelgänger\", on July 5, 2017. The album was released on September 22, 2017.[13]\n",
         "In 2019, the band made tech news headlines when a duo of programmers called Dadabots created a neural network trained on Archspire's music to produce a non-stop stream of technical death metal based on the band's music; Dadabots also noted that Archspire's music produced the most consistent AI results, presumably because of the high tempo and technical machine-like nature of the songs. Archspire themselves also commented on the phenomenon, jokingly referring to themselves as robots.[14][15] Later that year, Aleron and Prewett appeared in a cameo in the first episode of See; actor Jason Momoa is a fan of the band[16] and asked singer Aleron to coach him for a war cry technique.[17]\n"
      ]
   },
   "Members": {
      "Current members": {},
      "Former members": {
         "text": [
            "Timeline\n"
         ]
      }
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Archspire is a Canadian technical death metal band from Vancouver, British Columbia. They are currently signed to Season of Mist.[1] The group has released three studio albums.[2]\n",
      "The band was formed in 2007 as Defenestrated, but changed their name to Archspire in 2009.[3]\n",
      "In April 2011, Trendkill Recordings released All Shall Align, the band's first album. It was recorded between May and December 2010 working with producer Stuart McKillop at The Hive studios[4]\n",
      "In early 2013, founding bassist Jaron Evil suffered an unexpected stroke at age 31.[5] He returned to the band for a brief period after recovering, but eventually parted ways.\n"
   ]
}