{
   "Name": "Blind Melon",
   "rawData": [
      "Blind Melon is an American rock band formed in 1990 in Los Angeles, California, by five musicians: three from Mississippi, one from Pennsylvania and one from Indiana. The band currently consists of guitarists Rogers Stevens and Christopher Thorn, drummer Glen Graham, vocalist Travis Warren and bassist Nathan Towne. They are best known for their 1993 hit \"No Rain\", and enjoyed critical and commercial success in the early 1990s with their neo-psychedelic take on alternative rock.\n",
      "Blind Melon released two albums on Capitol Records – Blind Melon (1992) and Soup (1995) – before their original lead vocalist Shannon Hoon died of a drug overdose on the band's tour bus in New Orleans on October 21, 1995. After four years of unsuccessfully searching for a replacement for Hoon, Blind Melon officially dissolved in 1999. The remaining members reformed the band in 2006 with Warren and recorded one album with him, For My Friends (2008). Shortly after its release, Warren left Blind Melon but rejoined in 2010, when the band returned to performing occasional gigs.  Blind Melon is currently working on their fourth studio album. Blind Melon has been nominated for 4 Grammy Awards.\n",
      "Blind Melon formed in Los Angeles in March 1990 after West Point, Mississippi, transplants Rogers Stevens and Brad Smith, a guitarist and bassist respectively, met vocalist Shannon Hoon, a native of Lafayette, Indiana.  Guitarist Christopher Thorn, originally from Pennsylvania, was added shortly thereafter; the four eventually convinced drummer Glen Graham to relocate from Mississippi to complete the group after failing to find a drummer in Los Angeles.  Their moniker derived from a nickname Smith had observed among Mississippi hippies, a name with precedent in the 1920s blues artist Blind Lemon Jefferson and the Cheech & Chong character Blind Melon Chitlin'.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Alternative rock",
         "folk rock",
         "psychedelic rock",
         "roots rock",
         "blues rock",
         "grunge"
      ],
      "Years active": [
         "1990–1999",
         "2006–2008",
         "2010–present"
      ],
      "Labels": [
         "EMI",
         "Capitol"
      ],
      "Associated acts": [
         "Unified Theory",
         "Awolnation",
         "Abandon Jalopy"
      ],
      "Website": [
         "blindmelon.com"
      ],
      "Members": [
         "Rogers Stevens",
         "Christopher Thorn",
         "Glen Graham",
         "Travis Warren",
         "Nathan Towne"
      ],
      "Past members": [
         "Shannon Hoon",
         "Brad Smith"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in [YEAR] in Los Angeles, California, by five musicians: three from Mississippi, one from Pennsylvania and one from Indiana. The band currently consists of guitarists Rogers Stevens and [PERSON_NAME_FULL_1_MALE], drummer Glen Graham, vocalist [PERSON_NAME_FULL_0_MALE] and bassist [PERSON_NAME_FULL_2_MALE]. They are best known for their [YEAR] hit \"No Rain\", and enjoyed critical and commercial success in the early [YEAR]s with their neo-psychedelic take on alternative rock.\n",
      "[BAND_NAME] released two albums on Capitol Records – [BAND_NAME] ([YEAR]) and Soup ([YEAR]) – before their original lead vocalist [PERSON_NAME_FULL_0_FEMALE] died of a [GENRE] band's tour bus in New Orleans on [MONTH] 21, [YEAR]. After four years of unsuccessfully searching for a replacement for [PERSON_NAME_LAST_0], [BAND_NAME] officially dissolved in [YEAR]. The remaining members reformed the band in [YEAR] with Warren and recorded one album with him, For My Friends ([YEAR]). Shortly after its release, Warren left [BAND_NAME] but rejoined in [YEAR], when the band returned to performing occasional gigs.  [BAND_NAME] is currently working on their fourth studio album. [BAND_NAME] has been nominated for 4 Grammy Awards.\n",
      "[BAND_NAME] formed in Los Angeles in [MONTH] [YEAR] after West Point, Mississippi, transplants Rogers Stevens and [PERSON_NAME_FULL_0_MALE], a [GENRE] a native of Lafayette, Indiana.  Guitarist Christopher Thorn, originally from Pennsylvania, was added shortly thereafter; the four eventually convinced drummer Glen Graham to relocate from Mississippi to complete the group after failing to find a drummer in Los Angeles.  Their moniker derived from a nickname [PERSON_NAME_LAST_0] had observed among Mississippi hippies, a name with precedent in the [YEAR]s blues artist Blind Lemon Jefferson and the Cheech & Chong character [BAND_NAME] Chitlin'.\n"
   ]
}