{
   "Name": "Bear Mountain (band)",
   "rawData": [
      "Bear Mountain is a Canadian indie band from Vancouver, British Columbia. They released their first album XO on Last Gang Records in May 2013. Bear Mountain have toured as direct support for Bloc Party, Cut Copy, Hot Chip, MS MR and have played major festivals including Lollapalooza, The Governor's Ball, Sasquatch! Music Festival, Osheaga and Austin City Limits.\n",
      "After a successful showcase at SXSW 2013, Billboard wrote that \"The fact they could catch so much attention says something about the potential and staying power of their music.\"\n",
      "The group was originally formed as a solo project by Ian Bevis of the band Top Less Gay Love Tekno Party. After playing several shows solo as Bear Mountain, Bevis invited fellow University of Victoria student Kyle Statham to join the band. The pair wrote and recorded their debut album XO in their home studio, and self-released the EP in August 2012. Initial reception for the EP was positive, with taste-maker blogs The Fader and Consequence of Sound praising the sound.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Indie, Dance, Alternative, Electronic"
      ],
      "Years active": [
         "2012 (2012)-present"
      ],
      "Labels": [
         "Last Gang Records"
      ],
      "Website": [
         "http://mybmtn.com/"
      ],
      "Members": [
         "Ian Bevis",
         "Greg Bevis",
         "Kenji Rodriguez",
         "Kyle Statham"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Vancouver, British Columbia. They released their first album XO on Last Gang Records in [MONTH] [YEAR]. [BAND_NAME] have toured as direct support for Bloc Party, Cut Copy, Hot Chip, MS MR and have played major festivals including Lollapalooza, The Governor's Ball, Sasquatch! Music Festival, Osheaga and [PERSON_NAME_FULL_0_MALE].\n",
      "After a successful showcase at SXSW [YEAR], Billboard wrote that \"The fact they could catch so much attention says something about the potential and staying power of their music.\"\n",
      "The group was originally formed as a solo project by [PERSON_NAME_FULL_1_MALE] of the band Top Less Gay Love Tekno Party. After playing several shows solo as [BAND_NAME], [PERSON_NAME_LAST_1] invited fellow University of Victoria student [PERSON_NAME_FULL_0_FEMALE] to join the band. The pair wrote and recorded their debut album XO in their home studio, and self-released the EP in [MONTH] [YEAR]. Initial reception for the EP was positive, with taste-maker blogs The Fader and Consequence of Sound praising the sound.\n"
   ]
}