{
   "Name": "Blue Monday (band)",
   "rawData": [
      "Blue Monday (2001–2006) was a Canadian, Vancouver-based hardcore punk band.\n",
      "Blue Monday was formed by guitarist Kyle De Ville and vocalist Dave Mac in the spring of 2001. After securing a drummer and bassist the band proceeded to write an eight-song demo which came out in early 2002. After a few short tours down the west coast Blue Monday entered the studio again in mid-2002 and recorded the War Wounds 7\" EP which came out in early 2003 on the now defunct For The Core Records from California.\n",
      "In early 2003, the original bassist and drummer left the band.  With these departures Adam Mitchell and Jason Kehoe joined on bass and drums respectively. Adam's brother Dave joined at the end of 2003.  In 2003, Blue Monday released their second EP, What's Done Is Done on Stab And Kill Records from Boston, Massachusetts. Blue Monday spent the bulk of 2003 and 2004 touring throughout the US. They toured with fellow hardcore bands such as Mental, Desperate Measures, Far From Breaking, Lights Out, Final Word, Internal Affairs, The Distance, and Allegiance during this time.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Punk"
      ],
      "Years active": [
         "2001 (2001)–2006 (2006)"
      ],
      "Labels": [
         "Bridge 9"
      ]
   },
   "prunedData": [
      "[BAND_NAME] ([YEAR]–[YEAR]) was a [GENRE] band.\n",
      "[BAND_NAME] was formed by guitarist Kyle De Ville and vocalist [PERSON_NAME_FULL_0_MALE] in the spring of [YEAR]. After securing a [GENRE] band proceeded to write an eight-song demo which came out in early [YEAR]. After a few short tours down the west coast [BAND_NAME] entered the studio again in mid-[YEAR] and recorded the War Wounds 7\" EP which came out in early [YEAR] on the now defunct For The Core Records from California.\n",
      "In early [YEAR], the original bassist and drummer left the band.  With these departures Adam Mitchell and [PERSON_NAME_FULL_0_MALE] joined on bass and drums respectively. Adam's brother Dave joined at the end of [YEAR].  In [YEAR], [BAND_NAME] released their second EP, What's Done Is Done on Stab And Kill Records from Boston, Massachusetts. [BAND_NAME] spent the bulk of [YEAR] and [YEAR] touring throughout the US. They toured with fellow hardcore bands such as Mental, Desperate Measures, Far From Breaking, Lights Out, Final Word, Internal Affairs, The Distance, and Allegiance during this time.\n"
   ]
}