{
   "Name": "The Blue Shadows",
   "Sections": [
      "1 History",
      "2 Reissues",
      "3 Discography",
      "3.1 Albums",
      "3.2 Singles",
      "4 References"
   ],
   "Summary": {
      "text": [
         "The Blue Shadows were a Juno Award-nominated Canadian alt-country band that existed between 1992 and 1996, releasing two albums in Canada on Sony Music.[1]\n"
      ]
   },
   "History": {
      "text": [
         "The origins of the group are referenced to Billy Cowsill and Elmar Spanier, who had been performing as The Billy Cowsill Band, playing traditional country songs.[2][3]\n",
         "The settled initial group formation was Jeffrey Hatcher and Billy Cowsill as guitarists and principal songwriters, plus bassist Elmer Spanier and drummer J.B. \"Jay\" Johnson. Spanier left the band in 1993, prior to the release of their first album, and was replaced by Barry Muir, who had previously worked with Barney Bentall and The Payolas.[1][2]  The name of the group, suggested by Hatcher's wife, was based on the song \"Blue Shadows On The Trail\" by Sons of the Pioneers.[4]\n",
         "The group was initially managed by Larry Wanagas and David Chesney, who also managed k.d. lang and owned Bumstead Records, through which lang's early recordings were released.[2]\n",
         "The group was eventually signed to Sony Music.  The group's first album, On The Floor of Heaven, released on Bumstead Records and distributed by Sony, was certified gold in Canada, for sales in excess of 50,000 copies.  The group generated the interest of U.S. record executives, appearing at South by Southwest in 1994, among other U.S. showcases venues, but did not receive a U.S. record distribution contract.[2][5]  The group also received a 1994 Juno award nomination as Best Country Group or Duo.[2][6]  The group's second album, Lucky to Me was released in 1995 and was followed by regular touring by the band for the year thereafter. Both Blue Shadows albums were co-produced by Cowsill and Hatcher. Having not obtained international record distribution by the end of 1996, the group broke up, amidst \"creative differences\" which were, as acknowledged by Cowsill, precipitated by Cowsill's drug addictions.[2] Cowsill's addictions impaired his ability to contribute to songwriting meetings with Hatcher, band rehearsals and, ultimately, band performances.[5] The actual end of the band occurred during a three-day layover in Ottawa, Ontario, Canada, when the band found that its van had crashed into a laundromat, after Cowsill had gone to retrieve a guitar.  The band fulfilled its remaining contractual performance obligations, and then disbanded.  Cowsill continued for a brief period with another band, using The Blue Shadows name.[7]\n"
      ]
   },
   "Reissues": {
      "text": [
         "In later years, there has been increased interest in the band's music,[8] particularly following the re-release, in 2010, of On The Floor of Heaven.[9][10]  The album was re-released on Bumstead Records, owned by the band's original manager, Larry Wanagas.  The re-release included a second CD of outtakes during the band's career, including cover versions of Joni Mitchell's \"Raised on Robbery\", Michel Pagliaro's \"What The Hell I Got\" and Merle Haggard's \"If We Make It Through December\".[2]  The re-release was also the first occasion when the band's music was also released in the United States.  One of Cowsill's final wishes, prior to his 2006 death, was that On The Floor of Heaven would be re-released and be appreciated by a wider audience.[11][12]\n",
         "During the 1990s, The Blue Shadows made a professional live recording for CBC, which was played on the radio and televised as part of a strategy to promote their studio releases. This live recording is highly regarded by fans who heard the radio broadcast or watched the television special. The performance was later showcased on the archive portion of the CBC website, to coincide with the Deluxe Edition reissue of \"On The Floor Of Heaven\" in 2010. One reissue record label expressed interest in releasing this concert on CD as a bonus disc packaged with a reissue of the studio album \"Lucky To Me,\" although the project was scrapped when the label unexpectedly closed its operations.\n",
         "Currently, both studio albums, including \"Lucky To Me\" and the 2010 Deluxe Edition reissue for \"On The Floor Of Heaven,\" have become out of print and are considered to be collector's items.\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Singles": {}
   },
   "References": {},
   "coreData": [
      "The Blue Shadows were a Juno Award-nominated Canadian alt-country band that existed between 1992 and 1996, releasing two albums in Canada on Sony Music.[1]\n",
      "The origins of the group are referenced to Billy Cowsill and Elmar Spanier, who had been performing as The Billy Cowsill Band, playing traditional country songs.[2][3]\n",
      "The settled initial group formation was Jeffrey Hatcher and Billy Cowsill as guitarists and principal songwriters, plus bassist Elmer Spanier and drummer J.B. \"Jay\" Johnson. Spanier left the band in 1993, prior to the release of their first album, and was replaced by Barry Muir, who had previously worked with Barney Bentall and The Payolas.[1][2]  The name of the group, suggested by Hatcher's wife, was based on the song \"Blue Shadows On The Trail\" by Sons of the Pioneers.[4]\n",
      "The group was initially managed by Larry Wanagas and David Chesney, who also managed k.d. lang and owned Bumstead Records, through which lang's early recordings were released.[2]\n"
   ]
}