{
   "Name": "The Brass Action",
   "rawData": [
      "The Brass Action is a Canadian six-piece independent band from Vancouver, British Columbia. The band plays a unique style that mixes the intensity of punk rock and rockabilly with the dancy, horn driven sounds of ska.\n",
      "The Brass Action formed in 2007 in Vancouver, BC, and have since released three independent full-length albums.\n",
      "The band's first album, entitled Making Waves (2013), was recorded over a three-year period and serves as a compilation of EP albums released during that time. The album was recorded and engineered by Paul Boechler at Fader Mountain Sound and Armoury Studios in Vancouver, BC. Mastering was done by Brock McFarlane at CPS Mastering.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Punk, ska, brass punk"
      ],
      "Years active": [
         "2007–2020"
      ],
      "Labels": [
         "Independent"
      ],
      "Website": [
         "http://thebrassaction.com"
      ],
      "Members": [
         "Ryan Clare",
         "Richard Mitchell",
         "Tyson Sully",
         "Kieron Rhys Lillo",
         "Bradley Young",
         "Derek Simpson"
      ],
      "Past members": [
         "Mael Thébault",
         "Evan Kelly",
         "Garrett McLaughlin",
         "Mark Myskiw",
         "Alan Keelan",
         "William Shand"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Vancouver, British Columbia. The band plays a unique style that mixes the intensity of punk rock and rockabilly with the dancy, horn driven sounds of ska.\n",
      "[BAND_NAME] formed in [YEAR] in Vancouver, BC, and have since released three independent full-length albums.\n",
      "The band's first album, entitled Making Waves ([YEAR]), was recorded over a [GENRE] a compilation of EP albums released during that time. The album was recorded and engineered by Paul Boechler at Fader Mountain Sound and Armoury Studios in Vancouver, BC. Mastering was done by [PERSON_NAME_FULL_0_MALE] at CPS Mastering.\n"
   ]
}