{
   "Name": "Sweet Water (band)",
   "Sections": [
      "1 History",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Sweet Water is an American rock band from Seattle, Washington.\n"
      ]
   },
   "History": {
      "text": [
         "\nOriginally known as S.G.M., the majority of Sweet Water's members met while students at The Bush School. SGM had garnered acclaim as second generation punk pioneers in the Seattle scene, playing with Nirvana, the Accused, The Rejectors, The Melvins and more. Bruce Pavitt called the original SGM demo \"Young, loud and crazy. Better than Soundgarden and Green River put together. Better than Led Zep and the Stooges even\" [1] ",
         "SGM evolved into Sweet Water as the band lineup changed in 1990. The original Sweet Water included Adam Czeisler, vocals, Rich Credo, rhythm guitar, Cole Peterson, bass guitar, Dudley Taft, lead guitar and Paul Uhlir, Drums. Garnering acclaim for their debut on New Rage Records, Sweet Water, the band was subsequently signed in 1992 by Jason Flom of Atlantic Records and released its second self-titled album, Sweet Water produced by Don Gilmore (Linkin Park, Dashboard Confessional, Lit, Pearl Jam) and mixed by Tim Palmer (Mother Love Bone, Pearl Jam, Tin Machine, Robert Plant). [2] [3] The band were then signed to Elektra Records subsidiary East-West, and they recorded a follow-up record Superfriends with Dave Jerden (Alice in Chains, Jane's Addiction) producing. Guitarist Taft was fired during the recording of Superfriends and a new Sweet Water sound took shape with Rich Credo as sole guitarist. Producer Dave Jerden called the band \"Mott the Hoople meets the 90's\" [4] Superfriends had two charting singles, \"Feed Yourself\" and \"Superstar\" with the track \"Superstar\" reaching #40 on the modern rock charts. [5] [6] [7]\n",
         "Jerden returned to produce Suicide for Tom Zutaut of EMI imprint The Enclave. Suicide was eventually released in conjunction with Good-Ink records in 1999. [8]\n",
         "Members of the band engaged in various side-projects as well, including Peterson's work as bassist for Calm Down Juanita with Tyler Willman and Kevin Guess on their eponymous first studio album, Calm Down Juanita, released in 1998.[9] [10] The band spent 2000-2006 on a self-imposed hiatus, releasing no new music and playing no shows. 2007 saw their return to the stage and various rock websites reported an album in the works. \n",
         "In 2009, the band released Clear the Tarmac on Golden City Records, the label run by Sweet Water guitarist Rich Credo.[11] Clear the Tarmac sold well and represented what most fans and critics considered to be a return to form. A video for its single Rock Steady garnered national airplay.[12]\n",
         "Notable Seattle Drummer Chris Friel replaced Paul Uhlir in 2009, and has been a mainstay in the group since that time. \n",
         "2012 and 2013 saw more creative output from the band, with the 2012 release of a single entitled  \"Hey Living\" with the b-side \"Get High Clover\" and an accompanying video for the b-side. The 5 song \"Dance Floor Kills\" EP followed in April 2013. Both releases were on the dual Fin Records/Golden City Records imprint, with Fin handling physical product and Golden City handling digital. [13]\n",
         "In November 2015, Sweet Water returned to the stage with a one-off performance at Seattle's Benaroya Hall. The show was Sweet Water's first performance with a full orchestra, and was notable for the unique on stage collaboration with Seattle singer Shawn Smith. [14][15] Summer 2018 saw the release of the \"Galer Street\" single (with supporting video) and two sold out shows at the Paramount Theatre in Seattle with Green Apple Quick Step and Candlebox.\n",
         "2019 saw the release of the Galer Street single, closely following in 2019 by the release of the Firebird EP on Golden City Records. The band played several west coast shows in support of the release of Firebird. [16]\n",
         "The band continues to record and perform select shows.\n",
         "\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Sweet Water is an American rock band from Seattle, Washington.\n",
      "\nOriginally known as S.G.M., the majority of Sweet Water's members met while students at The Bush School. SGM had garnered acclaim as second generation punk pioneers in the Seattle scene, playing with Nirvana, the Accused, The Rejectors, The Melvins and more. Bruce Pavitt called the original SGM demo \"Young, loud and crazy. Better than Soundgarden and Green River put together. Better than Led Zep and the Stooges even\" [1] ",
      "SGM evolved into Sweet Water as the band lineup changed in 1990. The original Sweet Water included Adam Czeisler, vocals, Rich Credo, rhythm guitar, Cole Peterson, bass guitar, Dudley Taft, lead guitar and Paul Uhlir, Drums. Garnering acclaim for their debut on New Rage Records, Sweet Water, the band was subsequently signed in 1992 by Jason Flom of Atlantic Records and released its second self-titled album, Sweet Water produced by Don Gilmore (Linkin Park, Dashboard Confessional, Lit, Pearl Jam) and mixed by Tim Palmer (Mother Love Bone, Pearl Jam, Tin Machine, Robert Plant). [2] [3] The band were then signed to Elektra Records subsidiary East-West, and they recorded a follow-up record Superfriends with Dave Jerden (Alice in Chains, Jane's Addiction) producing. Guitarist Taft was fired during the recording of Superfriends and a new Sweet Water sound took shape with Rich Credo as sole guitarist. Producer Dave Jerden called the band \"Mott the Hoople meets the 90's\" [4] Superfriends had two charting singles, \"Feed Yourself\" and \"Superstar\" with the track \"Superstar\" reaching #40 on the modern rock charts. [5] [6] [7]\n",
      "Jerden returned to produce Suicide for Tom Zutaut of EMI imprint The Enclave. Suicide was eventually released in conjunction with Good-Ink records in 1999. [8]\n"
   ]
}