{
   "Name": "Chilliwack (band)",
   "rawData": [
      "Chilliwack is a Canadian rock band centered on the singer and guitarist Bill Henderson, which started off with a more progressive rock sound that incorporated elements of folk, indigenous, jazz and blues, before moving towards a more straight-ahead hard rock/pop rock sound by the mid-70s. They were active from 1970 to 1988. Henderson reformed the band in 1997. Their six best-selling songs were \"My Girl (Gone, Gone, Gone)\", \"I Believe\", \"Whatcha Gonna Do\", \"Fly at Night\", \"Crazy Talk\", and \"Lonesome Mary\".  The band's lineup has changed many times while they have continued to tour across Canada.\n",
      "The band originated in Vancouver, British Columbia.   The members of the C-FUN Classics changed the band's name to The Collectors when Bill Henderson joined in 1966. Their psychedelic self-titled debut album yielded the minor hit \"Lydia Purple\". Their second album was based on the musical score written by the band for a stage play by Canadian playwright George Ryga, Grass and Wild Strawberries.\n",
      "Vocalist Howie Vickers left the Collectors in 1969; the remaining members formed the band Chilliwack in 1970, Chilliwack being a Salish term meaning \"valley of many streams\" and the name of a city east of Vancouver in the Fraser River valley.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Rock, progressive rock"
      ],
      "Years active": [
         "1970–1988, 1997–present"
      ],
      "Labels": [
         "Parrot, A&M,[1] Goldfish, Casino, Sire, Mushroom Records, Solid Gold, Millennium[2]"
      ],
      "Associated acts": [
         "Classics (1964), Collectors (1966), Headpins"
      ],
      "Members": [
         "Bill Henderson",
         "Ed Henderson",
         "Jerry Adolphe",
         "Gord Maxwell"
      ],
      "Past members": [
         "Doug Edwards",
         "Ross Turney",
         "Claire Lawrence",
         "Glenn Miller",
         "Brian MacLeod",
         "Howard Froese",
         "Jamie Bowers",
         "Ab Bryant",
         "Bucky Berger",
         "Rick Taylor",
         "John Roles"
      ]
   }
}