{
   "Discography": {
      "Albums": {
         "text": [
            "As The Collectors (Pre-Chilliwack)\n",
            "Chilliwack\n"
         ]
      },
      "Singles": {}
   },
   "External links": {},
   "History": {
      "Headpins": {
         "text": [
            "As a side project, MacLeod and the band (minus Henderson) in the early 1980s performed as The Headpins with first Denise McCann and then Darby Mills as lead vocalist.\n"
         ]
      },
      "text": [
         "The band originated in Vancouver, British Columbia.   The members of the C-FUN Classics[4] changed the band's name to The Collectors when Bill Henderson joined in 1966.[5] Their psychedelic self-titled debut album yielded the minor hit \"Lydia Purple\". Their second album was based on the musical score written by the band for a stage play by Canadian playwright George Ryga, Grass and Wild Strawberries.\n",
         "Vocalist Howie Vickers left the Collectors in 1969; the remaining members formed the band Chilliwack in 1970,[6][7] Chilliwack being a Salish term meaning \"valley of many streams\" and the name of a city east of Vancouver in the Fraser River valley.\n",
         "Lead guitarist Bill Henderson led the remaining former Collectors members: Glenn Miller (bass, guitar, backing vocals), Ross Turney (drums) and Claire Lawrence (flute, saxophone, keyboards, backing vocals);[8] while he provided most of the vocals and did most of the composing. During 1970, Miller briefly left the band, who were joined on the road by Robbie King (keyboards, bass) and played at Expo '70 in Japan and other gigs across Canada.\n",
         "In 1971 bassist Rick Kilburn played live with Chilliwack for a short time before Miller returned later that same year when Lawrence departed. New member Howard Froese (guitar, keyboards, backing vocals) joined in 1973.\n",
         "The band released several records that were moderately successful. Hit singles in Canada included \"Lonesome Mary\", which entered Cashbox January 22, 1972 [9] (and was their first US charting single, peaking at #75 on the Billboard Hot 100 in February 1972), \"Crazy Talk\" (#98 in the US in January 1975), and \"Fly at Night\" (#75 in the US in May 1977). The album track \"Rain-o\", a blues-based composition that appeared in different versions on their debut album, Chilliwack (June 1970) and the later Dreams, Dreams, Dreams (January 1977), was a well-known concert favourite.\n",
         "Chilliwack's debut was followed by two more albums: Chilliwack in September 1971 and  All Over You in December 1972.\n",
         "In April 1974 their album Riding High on Goldfish Records (Terry Jacks' label) contained one of their biggest hits, the aforementioned \"Crazy Talk\", which was produced by Jacks. This album was not released in the US until early 1975 (on the Sire Records label), where it was retitled Chilliwack (their third U.S. release to bear that title).\n",
         "However, Chilliwack had a difficult time sustaining any success because of their constant changes of label. The two Collectors albums were on Warner Brothers and Chilliwack's first five albums were on four different labels in Canada: Parrot, A&M, Goldfish and Casino Records.\n",
         "Rockerbox, their fifth album, was released in December 1975 on Sire Records in the US and (with a different cover) on the little known, aforementioned Casino Records label in Canada. It was Chilliwack's least successful album in Canada.\n",
         "The band was then signed to Vancouver's Mushroom Records, with distribution throughout North America.  After completing one album for the label, Dreams, Dreams, Dreams, Chilliwack began work on their seventh album, to be titled Lights from the Valley. The first attempt at recording proved unsatisfactory, leading to discord among the band members. Veteran guitarist Froese was replaced by Brian MacLeod, who contributed guitar, drums, keyboards and backing vocals.  The album was re-recorded; with some of Froese's vocal and guitar work, as well as percussion from session drummer Eddie Tuduri, included in the final mix. By the time of the record's release, bassist Glenn Miller and long term drummer Ross Turney had left the group. Mushroom was also having financial problems which hampered the promotion of the album after its release in June 1978.\n",
         "Drummer Skip Layton and former Prism bassist Ab Bryant were recruited to perform with Henderson, MacLeod, and Jamie Bowers (guitar, keyboards) in Chilliwack's 1978 live gigs.[10] Henderson, MacLeod and Bryant then began working on Chilliwack's eighth album in 1979, joined by John Roles (guitar, keyboards, backing vocals) and drummer Bucky Berger. The Mushroom label went bankrupt abruptly shortly after the album, Breakdown in Paradise, was released in December 1979. Berger was replaced by Rick Taylor shortly thereafter and the lineup of Henderson, MacLeod, Bryant, Roles and Taylor toured into 1980.\n",
         "Chilliwack then signed with Solid Gold Records in Canada and Millennium Records in the U.S. in 1981 as a trio (Henderson/MacLeod/Bryant) and enjoyed its greatest success with this lineup, releasing the albums Wanna Be a Star (September 1981) and Opus X (October 1982). The singles \"My Girl (Gone, Gone, Gone)\" (Their first US Top 40 hit, peaking at #22 in December 1981), \"I Believe\" (US #33 in March 1982), and \"Whatcha Gonna Do (When I'm Gone)\" (US #41 in December 1982) were popular both in Canada and in the U.S.[11] Rolling Stone wrote:\n",
         "At their best, Chilliwack was the finest Canadian rock band, outrocking BTO and outwriting Burton Cummings. But a lack of consistency kept it from international success.",
         "The trio of Henderson, MacLeod and Bryant were joined by drummer Paul Delaney in the fall of 1981 through early 1982 for US promotional appearances on TV shows, like American Bandstand,[12] Solid Gold and The Merv Griffin Show, before heading out on the road later in 1982 with an expanded lineup of Henderson, MacLeod, Bryant, Joey Franco (drums), Glenn Grayson (keyboards, backing vocals) and Dennis Grayson (keyboards, backing vocals).\n",
         "Henderson and MacLeod received a Best Producer Juno Award for Opus X. However, echoing the Mushroom problems, Millennium Records then collapsed. MacLeod and Bryant left the band soon after, in early 1983, to devote more time to their other project, the Headpins, and Chilliwack's last new studio recording, Look In Look Out, was released in July 1984 with Henderson as the only continuing member, joined by session players Ashley Mulford (guitar, backing vocals, from the band Sad Café), Richard Gibbs (keyboards, from the group Oingo Boingo), Mo Foster (bass), Simon Phillips (drums) and Tom Keenlyside (saxophone), with additional vocals provided by Mark LaFrance, Saffron & Camille Henderson, Dustin Keller and Bob Rock.\n",
         "By 1985, the band was without a record deal and Henderson cobbled together a touring only lineup made up of former member Claire Lawrence (sax, backing vocals), Jerry Adolphe (drums), Brian Newcombe (bass), Robbie Gray (keyboards, backing vocals) and Dave Pickell (keyboards). Pickell was replaced almost immediately by another former member John Roles (guitar, keyboards).  This grouping played mostly in Canadian clubs and smaller venues until Henderson disbanded the group in December 1988. The following year, Henderson formed the folk-rock supergroup UHF.\n",
         "On October 6, 1991 Henderson joined fellow rockers Loverboy, Bryan Adams, Colin James and Chrissy Steele at a benefit show at Vancouver's 86 Street Music Hall to raise over $50,000 for Henderson's former Chilliwack bandmate, Brian MacLeod, who was fighting cancer and undergoing treatment at a Houston medical clinic. MacLeod died on April 25, 1992, aged 39.[citation needed]\n",
         "After the band had been dormant for nearly a decade, Henderson decided to launch a new Chilliwack lineup in 1997, made up of himself, Adolphe (drums), Doug Edwards[13] (bass, backing vocals), and Roy 'Bim' Forbes (guitar, backing vocals, from UHF). Forbes was succeeded on guitar in 1998 by Bill's brother, Ed, and Chilliwack released a new live album, There and Back - Live, in 2003.\n",
         "Chilliwack performed at 2005's Voyageur Days Festival in Mattawa, Ontario, where they appeared that July with other Canadian bands Moxy, Toronto, Trooper, Goddo, Killer Dwarfs and Ray Lyell for the thirtieth anniversary of Moxy's debut album release.\n",
         "On May 24, 2010, the current members of Chilliwack (Bill Henderson, Ed Henderson, Doug Edwards and Jerry Adolphe) were joined by former members Roy 'Bim' Forbes, Ab Bryant and Claire Lawrence plus Howard Froese's son, Tyson, on acoustic guitar (standing in for his father, who had died of cancer in the mid-1990s) and Collectors singer Howie Vickers for a Chilliwack 40th Anniversary show at River Rock Show Theatre in Richmond, British Columbia.\n",
         "Since that time, Bill Henderson has continued Chilliwack but also does duo shows with Claire Lawrence from time to time.\n",
         "Chilliwack's original bassist, Glenn Miller, died on March 4, 2011 in Toronto after suffering from muscular dystrophy.\n",
         "In 2015 music fans were treated to a new music video by Chilliwack for the song \"Take Back This Land\". The song became a rallying call during the 2015 Canadian federal election. \"The song wasn’t just about the election\", said Bill Henderson. \"Whether it is logging or fracking or whatever else, there is still a lot more work to do in Canada.\"[citation needed]\n",
         "Chilliwack continues to play, mostly in the spring, summer, and early fall, at outdoor gatherings and festivals.[14]\n",
         "Sadly, Doug Edwards died at his home in Vancouver at the age of 70 on November 11, 2016, after a long illness. Doug was succeeded in Chilliwack by Gord Maxwell (formerly with Ian Tyson and One Horse Blue), who had been filling in for Edwards in Chilliwack since 2013.\n",
         "Matt Bryant, son of former Chilliwack bass player Ab Bryant, is the singer/songwriter and founding member of Canadian roots/folk band Headwater.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Headpins",
      "2 Discography",
      "2.1 Albums",
      "2.2 Singles",
      "3 See also",
      "4 References",
      "5 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "Chilliwack is a Canadian rock band centered on the singer and guitarist Bill Henderson, which started off with a more progressive rock sound that incorporated elements of folk, indigenous, jazz and blues, before moving towards a more straight-ahead hard rock/pop rock sound by the mid-70s. They were active from 1970 to 1988. Henderson reformed the band in 1997. Their six best-selling songs were \"My Girl (Gone, Gone, Gone)\",[3] \"I Believe\", \"Whatcha Gonna Do\", \"Fly at Night\", \"Crazy Talk\", and \"Lonesome Mary\".  The band's lineup has changed many times while they have continued to tour across Canada.\n"
      ]
   },
   "Title": "Chilliwack (band) - Wikipedia"
}