{
   "Name": "Dear Rouge",
   "rawData": [
      "Dear Rouge is a Juno award-winning Vancouver-based electronic rock band formed in 2012 by Drew and Danielle McTaggart.\n",
      "Drew and Danielle McTaggart were both touring musicians under separate projects. They met while in their early touring days, and began dating before getting married and starting Dear Rouge. The name of the duo is derived from the name of Danielle's home town, Red Deer, Alberta, \"dear\" being a homophone of deer and \"rouge\" meaning red in French. Danielle had previously been in a duo called Gaetz Ave, named after a street in Red Deer. Drew was a member of Vancouver indie circuit band Maclean.\n",
      "In April 2012, Dear Rouge independently released their debut EP Heads Up! Watch Out!, a four-song EP on their Bandcamp page, and followed up six months later with their second EP Kids Wanna Know.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Alternative rock, dance-rock"
      ],
      "Years active": [
         "2012–present"
      ],
      "Labels": [
         "Universal Music Canada"
      ],
      "Associated acts": [
         "Gaetz Ave, Maclean"
      ],
      "Website": [
         "www.dearrouge.com"
      ],
      "Members": [
         "Danielle McTaggart",
         "Drew McTaggart"
      ]
   },
   "albums": [
      "Heads Up! Watch Out! (EP)",
      "Kids Wanna Know (EP)",
      "Black To Gold",
      "PHASES"
   ],
   "prunedData": [
      "[BAND_NAME] is a [MONTH]o award-winning Vancouver-based electronic rock band formed in [YEAR] by Drew and [PERSON_NAME_FULL_0_FEMALE].\n",
      "Drew and [PERSON_NAME_FULL_0_FEMALE] were both touring musicians under separate projects. They met while in their early touring days, and began dating before getting married and starting [BAND_NAME]. The name of the duo is derived from the name of [PERSON_NAME_FIRST_0]'s home town, Red Deer, Alberta, [SONG_NAME] meaning red in French. [PERSON_NAME_FIRST_0] had previously been in a [GENRE] a street in Red Deer. Drew was a member of Vancouver indie circuit band Maclean.\n",
      "In [MONTH] [YEAR], [BAND_NAME] independently released their debut EP Heads Up! Watch Out!, a [GENRE]"
   ]
}