{
   "Name": "Default (band)",
   "Sections": [
      "1 History",
      "2 In popular culture",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Singles",
      "3.3 Promotional singles",
      "4 Music videos",
      "5 Band members",
      "6 See also",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Default is a Canadian rock band formed in Vancouver in 1999. Since forming, the band has released four albums, and has sold more than a million records. The majority of their fan base is in Canada, but they had brief mainstream success in the United States with the release of their hit single \"Wasting My Time\".\n",
         "The group disbanded in 2013 after a hiatus following the release of their fourth album, and lead singer Dallas Smith pursued a country music solo career. In 2018, Default announced that they were back together. The band also announced a tour in support of Stone Temple Pilots and Seether, and a co-headline tour with Ages of Days.[1]\n",
         "Between 1996 and 2016, Default was among the top 150 best-selling Canadian artists in Canada and among the top 50 selling Canadian bands in Canada.[2]\n"
      ]
   },
   "History": {
      "text": [
         "The band was discovered by Chad Kroeger, the vocalist of Nickelback (also a Canadian post-grunge/alternative rock band), when their demo tape caught his attention. Kroeger subsequently lent support and production assistance to their first and second albums. Default's debut album, The Fallout, was released in 2001.[3] It achieved success due to strong radio play of \"Wasting My Time\" and \"Deny\". In 2002 Default won the Juno Award for \"Best New Group\". On August 23, 2002, The Fallout received a platinum album certification from Canada's CRIA,[4] and on April 30, 2003 it was certified platinum in the United States by the RIAA, signifying a million records sold.[5]\n",
         "The follow-up album, Elocation, failed to gain the same amount of popularity in the United States as their first album; however, they did solidify their popularity in Canada. Elocation was most successful for their hit single \"(Taking My) Life Away\" which was played extensively on the radio and television in Canada.  Their second single from Elocation was \"Throw It All Away\", which was then followed by \"All She Wrote\". Elocation was subsequently nominated \"Best Rock Album of the Year\" at the 2005 Juno Awards. The single \"Count On Me\" from their third album, One Thing Remains, was a hit on Canadian radio stations before the album was even released. After the official release, the album was very successful in the United States.\n",
         "According to Default's blog on their official website, the band was originally hoping to have their fourth album finished and ready to be released by the summer/early fall of 2007, but the date was postponed to March 2008. TVT Records filed for bankruptcy in February, and was sold in a private auction to The Orchard, an online independent music distributor. With the album finished, a tentative release date of March 2009 was announced in mid-2008, but the material was not released. In an audio interview with the website  AlternativeAddiction.com, it was announced that the new record, Comes and Goes, would be released in September 2009 via EMI Canada Records.  The album was released on September 29, 2009 in Canada.  It was subsequently released in the U.S. on October 25, 2010.\n",
         "On September 28, 2013 the band announced on their official Facebook page that the band were not splitting up, but taking a break and starting different projects. However, Smith and bandmates Jeremy Hora, Dave Benedict, and Danny Craig announced later in 2013 that they indeed were going their separate ways.[6] On September 4, 2018, Default announced their reunion. The band also announced that they would be touring across Canada in support of Stone Temple Pilots and Seether and that they'd be touring with Age of Days in October and November, with Age of Days opening for them on select dates across Canada. Dallas Smith has gone on to be a highly successful country solo artist in Canada.\n"
      ]
   },
   "In popular culture": {
      "text": [
         "Default's hit single \"Deny\" was featured in the videogame NHL 2003 by EA Sports. Their song \"The Memory Will Never Die\" was used as a secondary theme song for WWE's WrestleMania 23 and in house during the 2006 World Junior Ice Hockey Championships in Vancouver British Columbia. They also contributed an original song called \"Blind\" to Music from and Inspired by Spider-Man.\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Singles": {},
      "Promotional singles": {}
   },
   "Music videos": {},
   "Band members": {},
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Default is a Canadian rock band formed in Vancouver in 1999. Since forming, the band has released four albums, and has sold more than a million records. The majority of their fan base is in Canada, but they had brief mainstream success in the United States with the release of their hit single \"Wasting My Time\".\n",
      "The group disbanded in 2013 after a hiatus following the release of their fourth album, and lead singer Dallas Smith pursued a country music solo career. In 2018, Default announced that they were back together. The band also announced a tour in support of Stone Temple Pilots and Seether, and a co-headline tour with Ages of Days.[1]\n",
      "Between 1996 and 2016, Default was among the top 150 best-selling Canadian artists in Canada and among the top 50 selling Canadian bands in Canada.[2]\n",
      "The band was discovered by Chad Kroeger, the vocalist of Nickelback (also a Canadian post-grunge/alternative rock band), when their demo tape caught his attention. Kroeger subsequently lent support and production assistance to their first and second albums. Default's debut album, The Fallout, was released in 2001.[3] It achieved success due to strong radio play of \"Wasting My Time\" and \"Deny\". In 2002 Default won the Juno Award for \"Best New Group\". On August 23, 2002, The Fallout received a platinum album certification from Canada's CRIA,[4] and on April 30, 2003 it was certified platinum in the United States by the RIAA, signifying a million records sold.[5]\n"
   ]
}