{
   "Name": "The Dreadnoughts",
   "rawData": [
      "The Dreadnoughts are a Canadian 6-piece folk-punk band from Vancouver.  The band combines a wide range of European folk music with modern street punk.  In late 2011 they announced an indefinite hiatus. However, they followed this by playing shows occasionally, such as annual Vancouver shows, a two-week European tour in January 2014, and two March gigs with Guttermouth in 2014. On November 11, 2017 they released their fourth full-length album Foreign Skies. They followed this up with the album Into The North on November 15, 2019.\n",
      "The band has four full-lengths and two EPs on various labels and has played around 500 shows in around 30 countries. Their performance peak was in 2010, when 180 shows were played.\n",
      "The Dreadnoughts formed in 2007 in the Downtown Eastside area of Vancouver, British Columbia, Canada.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Folk Punk, Celtic Punk, Polka Punk, Folk, Sea Shanty"
      ],
      "Years active": [
         "2007 (2007)–present"
      ],
      "Labels": [
         "Stomp"
      ],
      "Website": [
         "thedreadnoughts.com"
      ],
      "Members": [
         "Marco Bieri",
         "Andrew Hay",
         "Drew Sexsmith",
         "Nicholas Smyth",
         "Kyle Taylor",
         "Tegan Ceschi-Smith"
      ]
   },
   "albums": [
      "Legends Never Die",
      "Victory Square",
      "Polka's Not Dead",
      "Foreign Skies ",
      "Into The North"
   ],
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band from Vancouver.  The band combines a wide range of European folk music with modern street punk.  In late [YEAR] they announced an indefinite hiatus. However, they followed this by playing shows occasionally, such as annual Vancouver shows, a two-week European tour in [MONTH] [YEAR], and two [MONTH] gigs with Guttermouth in [YEAR]. On [MONTH] 11, [YEAR] they released their fourth full-length album Foreign Skies. They followed this up with the album Into The North on [MONTH] 15, [YEAR].\n",
      "The band has four full-lengths and two EPs on various labels and has played around 500 shows in around 30 countries. Their performance peak was in [YEAR], when 180 shows were played.\n",
      "[BAND_NAME] formed in [YEAR] in the Downtown Eastside area of Vancouver, British Columbia, Canada.\n"
   ]
}