{
   "Band members": {
      "Current members": {},
      "Former members": {},
      "Session / live musicians": {}
   },
   "Discography": {
      "Albums": {},
      "EPs": {},
      "Singles": {}
   },
   "External links": {},
   "Fourth album": {
      "text": [
         "On September 19, 2017, they released two more songs from the upcoming album, \"Amsterdam\" and \"Can't Let Go\". The band announced on their website that the album would be titled \"The Hurt of Happiness\", and would be released on April 6, 2018.[19]\n"
      ]
   },
   "Music videos": {},
   "Reception": {
      "text": [
         "In April 2009, \"A Song about California\" was featured[20] as a top song on MuchMoreMusic. The band was nominated in that year for a Western Canadian Music Award,[21] and in 2010 for an Independent Music Award.[22]\n",
         "In 2010 they wrote a short song called \"Only You\"[23] for T-Booth mobile, which has been used since in television advertising campaigns throughout Canada.\n",
         "As of November 2011, \"Big Blue Wave\" is on rotation[24] with CBC Radio 3 and local station 102.7 The Peak.[25] Also in 2011, \"Make a New Dance Up\" was featured in a promotional video from HootSuite,[26] and the band performed for CBC's Canadian Indie Christmas Special. The band was also voted number one in the \"Best Local Band (Unsigned)\" category by readers of The Georgia Straight, a popular local news and entertainment paper in its \"Best of Vancouver 2011 Readers' Choices\" recognition.[27]\n",
         "In 2012, \"Islands\" was featured in the episode \"Last Known Surroundings\" of One Tree Hill. The February 22, 2012 episode of Entertainment Tonight Canada ended with the music video for \"Big Blue Wave\". On January 29, 2013, the album \"IS\" was officially released in the U.S. under Nettwerk Records.[28] \"Make A New Dance Up\" was featured in the episode \"Mother and Child Divided\" of Switched at Birth.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Tours",
      "2 Fourth album",
      "3 Reception",
      "4 Band members",
      "4.1 Current members",
      "4.2 Session / live musicians",
      "4.3 Former members",
      "5 Discography",
      "5.1 Albums",
      "5.2 EPs",
      "5.3 Singles",
      "6 Music videos",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Hey Ocean! is a Canadian indie alternative rock and synthpop band formed in 2004 in Vancouver. David Beckingham and Ashleigh Ball had been friends since grade 6, joining with David Vertesi in the 2000s to form the band.[1] The band consists of Ashleigh Ball (vocals/flute), David Beckingham (vocals/guitar), and David Vertesi (vocals/bass). Their music draws from many genres, including pop and acoustic, and the group tours Canada widely. They have performed locally alongside other Vancouver acts such as Shad K, Mother Mother and Said the Whale.\n",
         "The band ran their own label for many years, being represented by Nettwerk Management,[2] and had overtures from Gene Simmons[3] before signing with Universal Music Canada for distribution in 2011.[4]\n",
         "Lead singer Ashleigh Ball's voice acting work has drawn international attention to the band from members of the My Little Pony: Friendship Is Magic fan community. Fans have created music videos featuring the band's songs and footage from the show, some of which were featured on the band's official website.[5] At the end of June 2013, the band performed at Fiesta Equestria, a brony convention in Houston, Texas. The band also did a collaborative music video between the staff of the television show My Little Pony: Friendship Is Magic and bronies titled #TweetIt. The band was featured in Brent Hodge's critically acclaimed documentary A Brony Tale.\n",
         "Hey Ocean! was nominated in the \"Breakthrough Group of the Year\" category for the Juno Awards of 2013, (later won by Monster Truck), and featured on the compilation album released by Warner Music for the event.\n"
      ]
   },
   "Title": "Hey Ocean! - Wikipedia",
   "Tours": {
      "text": [
         "In 2009, the band toured Canada with The Cat Empire[6] and performed at SxSW.[7]\n",
         "The band again toured Canada in 2010, and played several events[8] for the 2010 Winter Olympics in Vancouver, British Columbia, Canada.\n",
         "In summer 2011, the band performed at the City of Vancouver's 125th Anniversary[9] and \"Live At Squamish,\" an annual 3-day music festival in Squamish, BC.[10]\n",
         "They finished the year with a cross-Canada tour, including an appearance at the Prince George Winter Festival.[11] Ashleigh Ball suffered a vocal cord injury during a performance, which resulted in the cancellation of the Eastern Canada portion of the tour.[12]\n",
         "In summer 2012, Hey Ocean! performed at the Osheaga music festival in Montreal. In August, the band joined indie-alternative group fun. for the SeaWheeze After Party and concert in Vancouver, BC.\n",
         "In 2013, the band toured in the United States in support of the release of their third studio album, titled \"IS\".\n",
         "On August 31, 2014, Hey Ocean! performed in Vancouver, BC at the PNE for what Ashleigh Ball dubbed as their final show 'for a long time'.[13] Through 2015 and 2016 the group's performances were exclusively at charity events, such as Sing it Fwd,[14] while Ball and others worked on solo projects.[15]\n",
         "In July 2017 the band announced through their Facebook page that they have reunited to work on their fourth album The Hurt of Happiness,[16][17] released in April 2018.[18]\n"
      ]
   }
}