{
   "Name": "Idle Eyes",
   "rawData": [
      "Idle Eyes is a Canadian rock and roll band from Vancouver, British Columbia. They are best known for the Canadian hit single \"Tokyo Rose\", which peaked at #16 on RPM's Canadian singles chart in June 1985.\n",
      "The band had its genesis in 1980 while Tad Campbell was travelling in Australia, when he encountered an advertisement for a local band looking for a guitarist. He joined the band, which spent several months as the house band at a resort in the Whitsunday Islands, during which time they were also joined by new vocalist Donna McConville, who would also become Campbell's girlfriend. They later moved to Townsville, where they recorded early demos of several songs that would eventually end up on the band's first two albums.\n",
      "Campbell eventually returned to Canada with McConville, putting together a new lineup since most of the original Australian members had not moved with them. The band lineup changed frequently over the early years, including McConville eventually leaving the band when her relationship with Campbell ended. She returned to Australia, where she became a backing vocalist for John Farnham.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1983 (1983)–1994 (1994)",
         "2002 (2002)–present"
      ],
      "Labels": [
         "WEA"
      ],
      "Website": [
         "idleeyes.com"
      ],
      "Members": [
         "Tad Campbell"
      ],
      "Past members": [
         "Glenn R. Smith",
         "Miles Fox Hill",
         "John Webster",
         "Phil Robertson",
         "Randy Booth",
         "Al Webster",
         " Bud Omstead ",
         " Dave Stone ",
         " Bruce Mckenzie",
         "Scotty Hall ",
         "  Russel Newell ",
         "Gus Vassos ",
         "Tony Ferraro ",
         "Mark Poy",
         "Randy Heibert ",
         "Kelly Cook",
         "Thom Christiansen",
         "Donna McConville ",
         "Dudley Welsh ",
         "Mike Poulter ",
         "Kevin O'Brien ",
         "Bill Miekle ",
         "Don Biggar ",
         "James Chadwick ",
         "Steve Elaschuk",
         "Terry Alton ",
         "Larry Pardue ",
         "Kevin Swain"
      ]
   },
   "albums": [
      "Idle Eyes",
      "Love's Imperfection",
      "Standing at the Edge",
      "Land of the Midnight Sun",
      "Karma Cops",
      "Bites Back"
   ]
}