{
   "Name": "Left Spine Down",
   "rawData": [
      "Left Spine Down (LSD) is a Canadian band based in Vancouver, British Columbia, that plays what they call \"cyberpunk\": a mixture of electronica, metal, punk, and drum & bass.\n",
      "The group formed in Vancouver in 2001 with Matt Girvan, Frank Valoczy and Kaine Delay, with Jeremy Inkel replacing Valoczy in 2003 (Jared Slingerland joined the following year). They spent the next five years honing their skill and recruiting talent, all the while drawing attention to Bill Leeb, whom hired both Inkel and Slingerland into Front Line Assembly for the Artificial Soldier tour and album in 2006. LSD had begun to  build a cult following, both local and abroad, and not until they found bass player Denyss McKnight and Tim Hagberg did they self-release their debut Smartbomb EP, in June 2007. The EP was produced by Front Line Assembly/Noise Unit's Chris Peterson. Their debut LP, Fighting for Voltage, was released in April 2008 on Synthetic Sounds in Canada, and a Canadian tour followed in support of the album. Bit Riot Records picked up the rights to the release of Fighting for Voltage in the US and released the album in September 2008.\n",
      "On March 3, 2009 and again via Synthetic Sounds the band released their second full-length album entitled Voltage 2.3: Remixed and Revisited. The album featured three new songs; \"Welcome to the Future\" with covers of \"Territorial Pissings\" by Nirvana and \"She's Lost Control\" by Joy Division; along with remixes and segues. In January 2011 the band's fourth music video was released (She's Lost Control) which made it into rotation on MuchMusic in Canada.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Digital hardcore, punk rock, electronica, drum and bass, heavy metal, industrial rock, industrial metal"
      ],
      "Years active": [
         "2003–present"
      ],
      "Labels": [
         "Metropolis Records, Synthetic Sounds (Canada) (Current Label),",
         "Danse Macabre (Europe), Bit Riot Records (USA)"
      ],
      "Associated acts": [
         "Front Line Assembly",
         "Noise Unit"
      ],
      "Website": [
         "http://www.leftspinedown.com"
      ],
      "Members": [
         "Kaine Delay",
         "Galen Waling",
         " Dan Curtis",
         "Bill E. Organ",
         "Adrian Black"
      ],
      "Past members": [
         "Jeremy Inkel",
         "Matt Girvan",
         "Jared Slingerland",
         "Denyss McKnight",
         "Tim Hagberg"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] (LSD) is a [GENRE] band based in Vancouver, British Columbia, that plays what they call [SONG_NAME]: a mixture of electronica, metal, punk, and drum & bass.\n",
      "The group formed in Vancouver in [YEAR] with Matt Girvan, [PERSON_NAME_FULL_2_MALE] and Kaine Delay, with [PERSON_NAME_FULL_3_MALE] replacing [PERSON_NAME_LAST_2] in [YEAR] (Jared Slingerland joined the following year). They spent the next five years honing their skill and recruiting talent, all the while drawing attention to [PERSON_NAME_FULL_0_MALE], whom hired both [PERSON_NAME_LAST_3] and Slingerland into Front Line Assembly for the Artificial Soldier tour and album in [YEAR]. LSD had begun to  build a cult following, both local and abroad, and not until they found bass player Denyss McKnight and [PERSON_NAME_FULL_1_MALE] did they self-release their debut Smartbomb EP, in [MONTH] [YEAR]. The EP was produced by Front Line Assembly/Noise Unit's [PERSON_NAME_FULL_4_MALE]. Their debut LP, Fighting for Voltage, was released in [MONTH] [YEAR] on Synthetic Sounds in Canada, and a Canadian tour followed in support of the album. Bit Riot Records picked up the rights to the release of Fighting for Voltage in the US and released the album in [MONTH] [YEAR].\n",
      "On [MONTH] 3, [YEAR] and again via Synthetic Sounds the band released their second full-length album entitled Voltage 2.3: Remixed and Revisited. The album featured three new songs; [SONG_NAME] by Joy Division; along with remixes and segues. In [MONTH] [YEAR] the band's fourth music video was released (She's Lost Control) which made it into rotation on MuchMusic in Canada.\n"
   ]
}