{
   "Awards and nominations": {},
   "Band members": {},
   "Discography": {
      "text": [
         "Studio albums\n"
      ]
   },
   "External links": {},
   "History": {
      "Astoria (2014–2016)": {
         "text": [
            "On July 12, 2014, the new single \"Pop 101\" (Barely Feat. Anami Vice) was announced.[13] It was released on July 28, 2014. On October 30, they performed a new song titled \"Here's to the Zeros\" in the first show of their Australia/New Zealand tour. On December 13, 2014, the band announced that \"Here's to the Zeros\" would be the album's second single. It was released on December 25, 2014, in Canada and the United States, with an international release on December 29, 2014.[14] On March 2, 2015, Marianas Trench announced that the music video for \"Here's to the Zeros\" would be released in the United States and Canada on March 5, 2015, and worldwide on March 6, 2015.[15] Since then, the band has put out an EP including the two singles, as well as two previously-unreleased tracks—Primetime and Sicker Things, previously only available as low-quality YouTube rips.\n",
            "The group performed on July 15, 2015 at Nathan Phillips Square in Toronto. On October 9, 2015, the group performed at the Norfolk County Fair in Simcoe, Ontario. On September 15, 2015, the group announced plans for their The Hey You Guys Tour, across the United States in November 2015. On September 20, 2015, the group announced plans for their Never Say Die Tour, across Canada in March, 2016.\n",
            "Astoria was released October 23, 2015.[16] The name Astoria comes from Astoria, Oregon, the hometown of The Goonies.[17] Josh Ramsay confirmed via his verified Twitter account that the album would be composed of entirely new material and would not feature either \"Pop 101\" or \"Here's to the Zeros\".[18] On September 14, 2015, the group released a single from Astoria, called \"One Love\". The tracklist is composed of 17 songs, 5 of which are described as cinematic orchestral movements. On October 2, 2015, \"Wildfire,\" the second single from Astoria, was released.  On September 15, 2015, the group announced plans for their \"The Hey You Guys!\" Tour, across the United States in November 2015. Marianas Trench was also nominated as Group of the Year for the 2016 Juno Awards.[19] In summer 2016, they started their SPF 80s Tour.This world tour includes locations in Canada, the United Kingdom, France, Switzerland, Germany, Belgium, and the Netherlands.[20]\n"
         ]
      },
      "Ever After (2011–2013)": {
         "text": [
            "On June 19, 2011, Ramsay tweeted that the album would be titled Ever After. It was set to be released November 29, 2011, but the date was then changed to November 21.[1] Ramsay also stated that there would be no breaks in between tracks on the new record; as soon as one track ended, the next would begin without pause, essentially making the album one extended song.[1]\n",
            "The first single released from the album was \"Haven't Had Enough\". It was released to iTunes on July 19, 2011. \"Haven't Had Enough\" reached the No. 1 spot on iTunes Canada Top of the Charts and Pop Downloads and was named \"Song of the Week\" by The Tune. It also went platinum. Through a series of Studio Updates on their YouTube page, the band has released recordings of the gospel choir for their song \"Stutter\" as well as a track with some of the vocals of the band. Other songs on the track include \"Ever After\", \"By Now\", \"Truth or Dare\", \"Desperate Measures\", \"Porcelain\", \"Fallout\", \"Toy Soldiers\", \"B Team\", \"So Soon\", and \"No Place Like Home\".[9] The music video for \"Haven't Had Enough\" was released on August 25, 2011.[10]\n",
            "Marianas Trench began the United States Ever After Tour on April 6, 2012 in New York City. Due to the illness of frontman Josh Ramsay the rest of the tour was postponed to later in 2012. They performed live as part of Journey's Backyard BBQ Tour in the Summer of 2012. Marianas Trench announced in June 2012 that they would be performing at the Fat As Butter Festival with additional tour dates as part of their first headlining tour of Australia in September 2012. Concert dates included locations in the Corner Hotel, Melbourne, The Zoo nightclub[11]  in Brisbane and The Metro Theatre in Sydney.[12]\n",
            "The band announced their first Canadian headlining Arena tour, Face The Music, in August 2012. The tour began October 12, 2012 in Barrie, Ontario and concluded November 3, 2012 in Kamloops, British Columbia. The tour included Down With Webster, Anami Vice, Crystalyne (*October 17, 2012 in Oshawa, Ontario) & Jesse Giddings (with the exception of October 18 in Montreal, Quebec, The New Cities opened for the band). Marianas Trench participated at the Bazooka Rocks Festival, the Philippines' first indoor rock festival September 30, 2012 at the SMX Convention Center, Metro Manila along with The Pretty Reckless, The Maine, Forever the Sickest Kids, Mayday Parade, A Skylit Drive and Avastera. On November 25, 2012, Marianas Trench performed Stutter at half-time at the 100th Grey Cup.\n",
            "On March 20, 2013, the group headlined the Canadian Radio Music Awards at Koolhaus in Toronto, Ontario. From March 23 to April 19, 2013, a second part of the Face The Music tour took place across Canada. This second part was named Face The Music: With A Vengeance. On April 21, Marianas Trench performed an a capella version of Fallout, leading straight into Stutter at the Juno Awards 2013. In May and June 2013, they completed their first headlining coast to coast US tour, powered by Journeys, called The Noise Tour. On October 22, Marianas Trench performed Pop 101 live for the first time at We Day Vancouver. Marianas Trench performed as part of Toronto's PanAm Games celebration, being featured as part of the Panamania concert series.\n",
            "On April 10, 2013, Marianas Trench announced that they had signed with Cherrytree Records and Interscope Records, who would handle their releases outside of Canada. 604 will continue to handle Canadian releases. A four-song extended play entitled Face the Music was released on May 14, 2013, containing the album versions of \"Haven't Had Enough\" and \"Desperate Measures,\" as well as acoustic versions of \"Haven't Had Enough\" and \"Fallout.\"\n"
         ]
      },
      "Marianas Trench & Fix Me (2001–2007)": {
         "text": [
            "The band recorded and released a self-titled EP in 2001. It contained songs which would later be added onto their debut album, Fix Me.\n",
            "In 2006, the band released their debut full-length studio album entitled Fix Me. It included the singles \"Say Anything\", \"Decided to Break It\", and the hit single \"Shake Tramp\". Before the album was released, a song named \"Fix Me\" was on it and was later taken out, because \"Say Anything\" supposedly sounded more like a single. The album was named after \"Fix Me\" and the name stayed to pay homage even after the song was taken out. The album was engineered and mixed by Mike Fraser and the band performed concerts nationwide to promote the album, alongside Faber Drive.\n"
         ]
      },
      "Masterpiece Theatre (2009–2011)": {
         "text": [
            "Masterpiece Theatre, the band's follow-up album, was released as planned on February 24, 2009, as announced on the band's MySpace on January 22, 2009.The album debuted at No. 4 on the Canadian Albums Chart. \"Cross My Heart\" became the band's second song to peak at No. 1 on both the Much Music Countdown and iTunes Canada Digital Download. \"Cross My Heart\" was nominated for four MMVAs in 2009 and was certified platinum in Canada.[3] Recently after, Marianas Trench reached the No. 1 spot with the song \"All To Myself\" on Much Music's MOD. \"All To Myself\" also made Platinum certification in August 2009 in Canada.[4] The music video for \"Beside You\" premiered on MuchOnDemand on October 30, 2009.\n",
            "In 2009, the band went on the Beside You tour, beginning in St. Catharines, Ontario on October 4, 2009 and ending in Prairieland Park, Saskatoon, Saskatchewan on December 31, 2009. The band also participated in the University of British Columbia's Lipdub event on March 26, 2011. The video features approximately a thousand students and community members lip-syncing to the songs \"Raise Your Glass,\" by Pink, and \"Celebrity Status,\" by Marianas Trench. The video was released April 8, 2011.[5]\n",
            "Their first US show ever was September 23, 2010 at The Bowery Electric[6] in Manhattan, New York City. The band toured as an opening act with Simple Plan on the Get Your Heart On! Tour in 2010. Marianas Trench performed several free concerts during the 2010 Vancouver Olympics, at the LiveCity Yaletown stage and Richmond O Zone.\n",
            "Marianas Trench joined The Glamour Kills Tour in 2011 with The Ready Set, Allstar Weekend, The Downtown Fiction, and We Are The In Crowd.[7]\n",
            "On November 30, 2010,  Directors Cut of Masterpiece Theatre was released, which included bonus acoustic tracks of the songs \"Celebrity Status\" and \"Cross My Heart\", an alternate version of the song \"Good to You\" (feat. Jessica Lee), as well as a never-before recorded cover of \"And So It Goes\" by Billy Joel. The band played the final show of their Masterpiece Theatre tour on December 18, 2010 in their hometown of Vancouver, British Columbia at the Orpheum Theatre, during which their manager and the co-founder of 604 Records, Jonathan Simkin, revealed the album had gone platinum in Canada.\n",
            "During this time, the band played five free shows at the 2010 Winter Olympics in Vancouver and one in Surrey.[8] Josh Ramsay also took part in a project called 'Young Artists For Haiti' to try and raise funds to support the victims of the 2010 Haiti earthquake.\n"
         ]
      },
      "Phantoms (2017–2019)": {
         "text": [
            "Marianas Trench performed at New Year Celebrations in Niagara Falls, Ontario in 2017.[21]\n",
            "In the fall of 2017, the single \"Rhythm of Your Heart\" was released. On March 15, 2018, the music video for \"Rhythm of Your Heart\" premiered on YouTube.[22] On November 5, 2018, the band announced the lead single off their upcoming fifth album, \"I Knew You When,\" which was later released on November 16. On December 3, 2018, the band announced the US Suspending Gravity Tour to promote their upcoming album Phantoms.[2] The music video for \"I Knew You When\" was released on YouTube on December 19, 2018.[23] On January 31, 2019, their second single from Phantoms, \"Only The Lonely Survive,\" was premiered on YouTube.[24] On February 7, 2019, the third released single from Phantoms, \"Echoes Of You (Feat. Roger Joseph Manning Jr.)\" was premiered on Youtube.[25]\n",
            "Phantoms was released on March 1, 2019, and follows the theme of a \"being haunted by the ghosts of former love.\" Josh Ramsay describes the new record as \"modern-song writing, but very organic, old-school approaches and trickery...done in a way that you haven't heard us do before.\" [26] The tracklist contains 10 songs, including \"Eleonora\", \"Only The Lonely Survive\", \"Echoes Of You\", \"Don't Miss Me?\", \"Wish You Were Here\", \"Your Ghost\", \"Glimmer\", \"The Death Of Me\" and \"The Killing Kind.\"[27] Within the first 24 hours of the album's release, it skyrocketed on iTunes, hitting #1 in the Pop genre in both Canada and the US and topping Ariana Grande's thank u, next.[28][29]\n"
         ]
      }
   },
   "Musical style": {
      "text": [
         "Fix Me has been described as hard rock[30] and pop punk.[31] Masterpiece Theatre has been described as pop punk[32][33] and symphonic rock.[33] Ever After has been described as pop punk and symphonic rock.[33] Astoria has been described as funk,[34] pop,[34][35][36] and pop punk.[34] and Phantoms has been described as electropop and symphonic rock.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Marianas Trench & Fix Me (2001–2007)",
      "1.2 Masterpiece Theatre (2009–2011)",
      "1.3 Ever After (2011–2013)",
      "1.4 Astoria (2014–2016)",
      "1.5 Phantoms (2017–2019)",
      "2 Musical style",
      "3 Band members",
      "4 Discography",
      "5 Awards and nominations",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Marianas Trench is a Canadian pop rock band from Vancouver, British Columbia, formed in 1999 by Josh Ramsay (lead vocalist, rhythm guitarist, pianist, songwriter, occasional drummer) and lead guitarist Steve Marshall with Ramsay's sister Sara on keyboards and vocals, Erik Scott on drums and Trev Spilchen on bass. Originally called Ramsay Fiction, Marshall suggested a name change when Ramsay's high school friend Matt Webb, drummer Ian Casselman and Morgan Hempstead on bass, replacing Spilchen and Ramsay. Mike Ayeley, a long time friend  \nof Casselman took up bass responsibilities when Hempstead and Marshall left the band in 2004, taking the 5 piece down to 4. The band's current line up has released five full-length studio albums: Fix Me (2006), Masterpiece Theatre (2009), Ever After (2011), Astoria (2015), and Phantoms (2019).[1][2]\n"
      ]
   },
   "Title": "Marianas Trench (band) - Wikipedia"
}