{
   "Name": "Marianas Trench (band)",
   "rawData": [
      "Marianas Trench is a Canadian pop rock band from Vancouver, British Columbia, formed in 1999 by Josh Ramsay (lead vocalist, rhythm guitarist, pianist, songwriter, occasional drummer) and lead guitarist Steve Marshall with Ramsay's sister Sara on keyboards and vocals, Erik Scott on drums and Trev Spilchen on bass. Originally called Ramsay Fiction, Marshall suggested a name change when Ramsay's high school friend Matt Webb, drummer Ian Casselman and Morgan Hempstead on bass, replacing Spilchen and Ramsay. Mike Ayeley, a long time friend  \nof Casselman took up bass responsibilities when Hempstead and Marshall left the band in 2004, taking the 5 piece down to 4. The band's current line up has released five full-length studio albums: Fix Me (2006), Masterpiece Theatre (2009), Ever After (2011), Astoria (2015), and Phantoms (2019).\n",
      "The band recorded and released a self-titled EP in 2001. It contained songs which would later be added onto their debut album, Fix Me.\n",
      "In 2006, the band released their debut full-length studio album entitled Fix Me. It included the singles \"Say Anything\", \"Decided to Break It\", and the hit single \"Shake Tramp\". Before the album was released, a song named \"Fix Me\" was on it and was later taken out, because \"Say Anything\" supposedly sounded more like a single. The album was named after \"Fix Me\" and the name stayed to pay homage even after the song was taken out. The album was engineered and mixed by Mike Fraser and the band performed concerts nationwide to promote the album, alongside Faber Drive.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Pop punk",
         "pop rock",
         "symphonic rock",
         "pop"
      ],
      "Years active": [
         "2001 (2001)–present"
      ],
      "Labels": [
         "604"
      ],
      "Website": [
         "marianastrench.net"
      ],
      "Members": [
         "Ian Casselman",
         "Josh Ramsay",
         "Matt Webb",
         "Mike Ayley"
      ],
      "Past members": [
         "Erik Scott",
         "Morgan Hempstead",
         "Sara Ramsay",
         "Steve Marshall",
         "Trev Spilchen"
      ]
   }
}