{
   "Name": "The New Pornographers",
   "rawData": [
      "The New Pornographers are a Canadian indie rock band, formed in 1997 in Vancouver, British Columbia. Presented as a musical collective of singer-songwriters and musicians from multiple projects, the band has released eight studio albums to critical acclaim for their use of multiple vocalists and elements of power pop incorporated into their music.\n",
      "The New Pornographers' name was chosen by Carl Newman, who has said that he came up with it after watching a Japanese film called The Pornographers.  The band has released eight albums to date: Mass Romantic (2000), Electric Version (2003), Twin Cinema (2005), Challengers (2007), Together (2010), Brill Bruisers (2014), Whiteout Conditions (2017), and In the Morse Code of Brake Lights (2019). A live album recorded on their 2006 tour is available only at concerts and on the band's website. In 2005, the band was the subject of Reginald Harkema's documentary film Better Off in Bed.\n",
      "The New Pornographers' first four albums each placed in the top 40 on The Village Voice's Pazz & Jop year-end poll of hundreds of music reviewers. From 2000 to 2006, either a New Pornographers' album or a solo album from one of the band's members ranked in the top 40 on the list each year. In 2007, Blender magazine ranked the New Pornographers' first album, Mass Romantic, the 24th best indie album of all time. In 2009, Rolling Stone magazine ranked the band's second studio album, Electric Version, No. 79 in the \"100 Best Albums of the Decade\".\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Indie rock, power pop, post-punk revival"
      ],
      "Years active": [
         "1997–present"
      ],
      "Labels": [
         "Matador",
         "Concord",
         "Mint",
         "Last Gang"
      ],
      "Associated acts": [
         "Pretty Girls Make Graves",
         "Destroyer",
         "AC Newman",
         "Limblifter",
         "Superconductor",
         "Neko Case",
         "Age of Electric",
         "Zumpano"
      ],
      "Website": [
         "thenewpornographers.com"
      ],
      "Members": [
         "Kathryn Calder",
         "Neko Case",
         "John Collins",
         "Todd Fancey",
         "Carl Newman",
         "Joe Seiders",
         "Simi Stone",
         "Blaine Thurier"
      ],
      "Past members": [
         "Dan Bejar",
         "Kurt Dahle",
         "Fisher Rose"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band, formed in [YEAR] in Vancouver, British Columbia. Presented as a musical collective of singer-songwriters and musicians from multiple projects, the band has released eight studio albums to critical acclaim for their use of multiple vocalists and elements of power pop incorporated into their music.\n",
      "[BAND_NAME]' name was chosen by Carl Newman, who has said that he came up with it after watching a [GENRE] band has released eight albums to date: Mass Romantic ([YEAR]), Electric Version ([YEAR]), Twin Cinema ([YEAR]), Challengers ([YEAR]), Together ([YEAR]), Brill Bruisers ([YEAR]), Whiteout Conditions ([YEAR]), and In the Morse Code of Brake Lights ([YEAR]). A live album recorded on their [YEAR] tour is available only at concerts and on the band's website. In [YEAR], the band was the subject of Reginald Harkema's documentary film Better Off in Bed.\n",
      "[BAND_NAME]' first four albums each placed in the top 40 on The Village Voice's Pazz & Jop year-end poll of hundreds of music reviewers. From [YEAR] to [YEAR], either a [GENRE] a solo album from one of the band's members ranked in the top 40 on the list each year. In [YEAR], Blender magazine ranked the New Pornographers' first album, Mass Romantic, the 24th best indie album of all time. In [YEAR], Rolling Stone magazine ranked the band's second studio album, Electric Version, No. 79 in the \"100 Best Albums of the [MONTH]ade\".\n"
   ]
}