{
   "Name": "Odds (band)",
   "rawData": [
      "Odds are a Canadian alternative rock band based in Vancouver, British Columbia. They perform music with a power pop style. They were nominated for six Juno Awards in the 1990s, winning zero. As of 2014, they are on their fifth record label.\n",
      "The band was formed in 1987 in Vancouver, British Columbia, consisting of vocalist-guitarists Craig Northey and Steven Drake (both of whom had led different bands appearing on a Vancouver music compilation album, Spotlight '86), bassist Doug Elliott and drummer Paul Brennan. Pat Steward was originally asked to be the band's drummer, but he declined. The band members claim the name came when Brennan asked Drake, in a town somewhere on the BC coast, \"What are the odds of us ever escaping bullshit gigs like this?\"\n",
      "In the late 1980s, the band played up to four nights a week as a 1960s and 1970s cover band called Dawn Patrol at the Roxy nightclub in Vancouver, while playing as Odds on weekends and funding their own demo recordings at Crosstown Studios in North Vancouver, hoping for a break. They travelled to Los Angeles doing showcases and eventually signed to Zoo Entertainment.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Alternative rock"
      ],
      "Years active": [
         "1987 (1987)–1999 (1999)",
         "2007–present"
      ],
      "Labels": [
         "Zoo, Elektra, Warner, Pheromone Recordings, Second Motion Records"
      ],
      "Associated acts": [
         "The Kids in the Hall",
         "Warren Zevon",
         "Colin James",
         "Sharkskin",
         "Stripper's Union",
         "The Tragically Hip",
         "Rosanne Cash"
      ],
      "Website": [
         "oddsmusic.com"
      ],
      "Members": [
         "Craig Northey",
         "Doug Elliott",
         "Pat Steward",
         "Murray Atkinson"
      ],
      "Past members": [
         "Steven Drake",
         "Paul Brennan"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band based in Vancouver, British Columbia. They perform music with a power pop style. They were nominated for six [MONTH]o Awards in the [YEAR]s, winning zero. As of [YEAR], they are on their fifth record label.\n",
      "The band was formed in [YEAR] in Vancouver, British Columbia, consisting of vocalist-guitarists [PERSON_NAME_FULL_1_MALE] and Steven Drake (both of whom had led different bands appearing on a Vancouver music compilation album, Spotlight '86), bassist [PERSON_NAME_FULL_0_MALE] and drummer Paul Brennan. [PERSON_NAME_FULL_2_FEMALE] was originally asked to be the band's drummer, but he declined. The band members claim the name came when Brennan asked Drake, in a town somewhere on the BC coast, \"What are the odds of us ever escaping bullshit gigs like this?\"\n",
      "In the late [YEAR]s, the band played up to four nights a [GENRE] a [YEAR]s and [YEAR]s cover band called Dawn Patrol at the Roxy nightclub in Vancouver, while playing as [BAND_NAME] on weekends and funding their own demo recordings at Crosstown Studios in North Vancouver, hoping for a break. They travelled to Los Angeles doing showcases and eventually signed to Zoo Entertainment.\n"
   ]
}