{
   "Name": "The Paperboys",
   "rawData": [
      "The Paperboys (sometimes billed and credited as Tom Landa and the Paperboys) are a Canadian folk music band from Vancouver that formed in 1991. The Paperboys blend Celtic folk with bluegrass, Mexican, Eastern European, African, zydeco, soul and country influences. The band has had a variety of members and line-ups since its original formation, with Landa remaining as the sole founding member, although veteran banjoist/bassist Cam Salay often returns as a guest performer. Known for consistently creating pop songs with melodic hooks, their music has been called versatile, with a wide range of influences, melding diverse musical influences more successfully than some other Irish rock bands have previously.\n",
      "The Paperboys first studio album, Late As Usual, was released on their own record labelStompy Discs in 1995. \nThey also created Stomp Productions to produce and market their work themselves. \nTheir first three studio albums have received Juno Award nominations, with 1997's Molinos winning for the Roots and Traditional Album of the Year category. They also won a West Coast Music Award the same year.\n",
      "Their album Postcards won a West Coast Music Award in 2000.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "folk rock, world music"
      ],
      "Years active": [
         "1991–present"
      ],
      "Website": [
         "www.paperboys.com"
      ],
      "Members": [
         "Tom Landa",
         "Brad Gillard",
         "Kalissa Landa",
         "Geoffrey Kelly",
         "Sam Esecson",
         "Kareem Kandi",
         "Nick LaRiviere",
         "Miguelito Valdes",
         "Greg Lyons"
      ],
      "Past members": [
         "Chris Jonat",
         "Jeremy Hughes",
         "Kevin Ball",
         "David Plenkovich",
         "Glenn Kruger",
         "Owen Owen Owenr",
         "Moritz Behm",
         "Neil Burnett",
         "Paul Lawton",
         "Steve Mitchell",
         "Cam Salay",
         "Shona Le Mottée",
         "Shannon Saunders",
         "Hanz Araki",
         "Doug Schmidt",
         "Alan Macleod",
         "Tom Neville",
         "Victor Smith",
         "Matt Brain",
         "Kendel Carson",
         "Miranda Mulholland"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (sometimes billed and credited as Tom Landa and the Paperboys) are a [GENRE] band from Vancouver that formed in [YEAR]. [BAND_NAME] blend Celtic folk with bluegrass, Mexican, Eastern European, African, zydeco, soul and country influences. The band has had a variety of members and line-ups since its original formation, with Landa remaining as the sole founding member, although veteran banjoist/bassist Cam Salay often returns as a guest performer. Known for consistently creating pop songs with melodic hooks, their music has been called versatile, with a wide range of influences, melding diverse musical influences more successfully than some other Irish rock bands have previously.\n",
      "[BAND_NAME] first studio album, Late As Usual, was released on their own record labelStompy Discs in [YEAR]. \nThey also created Stomp Productions to produce and market their work themselves. \nTheir first three studio albums have received [MONTH]o Award nominations, with [YEAR]'s Molinos winning for the Roots and Traditional Album of the Year category. They also won a [GENRE]",
      "Their album Postcards won a West Coast Music Award in [YEAR].\n"
   ]
}