{
   "Name": "Payolas",
   "Sections": [
      "1 Band history",
      "1.1 Early years (1978–1981)",
      "1.2 Mick Ronson era (1982–1984)",
      "1.3 Compromises, David Foster and \"Tears Are Not Enough\" (1985)",
      "1.4 Paul Hyde and the Payolas (1985–1986)",
      "1.5 Rock and Hyde (1987–1988)",
      "1.6 Long hiatus (1989–2003)",
      "1.7 Reunion (2003–2008)",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Compilation albums",
      "2.3 Extended plays",
      "2.4 Singles",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Payolas (or Payola$) were a Canadian rock band, most prominent in the 1980s.[1] Evolving from a new wave sound toward mainstream pop-rock, they released several albums and singles that were Canadian chart hits.\n",
         "The band's name is a reference to the payola scandal in the United States in the early 1960s. The group was based in Vancouver, British Columbia, and recorded mostly at Vancouver's Little Mountain Sound Studios. Through several lineup changes and name changes (the band also played as The Payola$, Paul Hyde and the Payolas, and Rock and Hyde), the Payolas core members remained Paul Hyde and Bob Rock, who together wrote virtually all of the band's songs, occasionally with co-writers.  As well, Rock engineered and mixed virtually every Payolas recording.\n",
         "They disbanded in 1988, but reformed again from 2003 to 2008, issuing a new EP in 2007.\n"
      ]
   },
   "Band history": {
      "Early years (1978–1981)": {
         "text": [
            "Vocalist Hyde, a British immigrant, met guitarist Rock (originally from Winnipeg) during high school in Langford, B.C.  Shortly after they joined with drummer Ian Tiles and bass player Marty Higgs to form a pop-punk band. As the band got started, Bob Rock simultaneously started his career as a recording engineer at Little Mountain Sound Studios in Vancouver, B.C., allowing the Payola$ the time to record their first single, \"China Boys\" (1979). This single was sold at their gigs and in local music stores.\n",
            "Higgs and Tiles left shortly after the single was recorded, and in the first of many personnel changes for the band, were replaced by drummer Taylor Nelson Little and sax/bass player Gary Middleclass (né Gary Bourgeois). Spotted by A&M Records, the band was given the budget to record four songs, which were issued as Introducing Payola$ in 1980. The major-label EP included a new version of their signature song “China Boys”, early versions of “Jukebox” and “Rose”, and the profanity-laden working class anthem “T.N.T.”\n",
            "The EP garnered enough attention to warrant a full-length follow up album. Middleclass left, in 1980, to become a sales man at Annex Pro (he later became a teacher at the Vancouver Film School sound design program), and was replaced by Lawrence Wilkins on bass. As well, Lee Kelsey (keyboards) was added. This quintet recorded 1981's In a Place Like This (produced by Rock), which was a critical success, but a commercial flop.\n"
         ]
      },
      "Mick Ronson era (1982–1984)": {
         "text": [
            "1982 saw drummer Chris Taylor added to the band lineup, replacing Taylor Little. Kelsey left the band and was not replaced. This line-up recorded the Mick Ronson-produced album No Stranger to Danger. Incorporating elements of reggae, pop, punk, and new wave, the LP included a hit (No. 4) in \"Eyes of a Stranger\", which later earned the Juno for best single of the year. Junos were also given to Rock and Hyde for their songwriting, and to the band as a whole for Most Promising Group. Bob Rock's recording work on the album also won him a Juno, and the LP also featured the moderately successful single \"Romance\". Even the non-album B-side \"Soldier\" was a minor Canadian hit (No. 25). When the Payola$ toured the album in 1982, Ronson played keyboards as a guest performer.[2]\n",
            "\n"
         ]
      },
      "Compromises, David Foster and \"Tears Are Not Enough\" (1985)": {
         "text": [
            "Around this same time, the record label recruited David Foster to produce and also assist in writing the band's next recording. Hyde's then-wife, Myriam Nelson, also took a role in much of the songwriting around this time. The label wanted the next release to break the band into the US mainstream and a more pop-orientated direction was chosen. By this point, the band consisted of Hyde, Rock, drummer Chris Taylor and bassist Alex \"A-Train\" Boynton. Keyboardist Livingston was no longer an official band member, but was hired to play during the album sessions (as was Foster).\n",
            "Quincy Jones asked Hyde him to produce and contribute a Canadian all-star recording to the USA for Africa famine relief project. Using a song title supplied by Rock and Hyde, Foster helped assemble an all-star band called Northern Lights to record the No. 1 Canadian hit \"Tears Are Not Enough\". Rock and Hyde received co-writer credits on the song (along with Bryan Adams, Foster, Rachel Paiement and Jim Vallance). As well, Hyde is heard as one of 44 vocalists on the song, and Rock was one of the engineers.\n"
         ]
      },
      "Paul Hyde and the Payolas (1985–1986)": {
         "text": [
            "Later in 1985, when Paul Hyde and the Payolas' Here's the World for Ya LP was released, its singles included “You're the Only Love”, “It Must Be Love”, “Stuck in the Rain,”  and “Here’s the World”. All these singles did moderately well in Canada, and “You're the Only Love”, actually also charted in the US, peaking at #84 on the Billboard Hot 100 Chart[3]—the first Payolas single to do so.\n",
            "However, critical and consumer reaction to Here's the World for Ya went the opposite way. The album was not the hit the record company was hoping for, especially considering Foster's previous track record of producing massive international hits for artists such as Chicago, John Parr, and Barbra Streisand. Many found Foster's richly ornamented production style conflicted with the Payolas previous highly creative, eclectic works. Furthermore, the band lost many loyal fans who felt the Payolas had turned their backs on them with the commercial compromises. As a consequence of all these factors, within weeks of Here's the World for Ya's release (and relative commercial failure), the band was dropped by A&M.\n",
            "\n"
         ]
      },
      "Rock and Hyde (1987–1988)": {
         "text": [
            "In 1987, the band rebranded themselves as Rock and Hyde (although the core duo was still in fact working with Payolas Taylor and Boynton) and released Under the Volcano[4]  on Capitol/EMI.\n",
            "Under the Volcano was critically well-received, and Rock and Hyde had two hits in Canada with \"Dirty Water\" (#20) and \"I Will\" (#40).[5] \"Dirty Water\" also peaked on the US Billboard Hot 100 at #61.[6]\n",
            "A&M tried to piggyback on the duo's EMI success by immediately offering forth a greatest hits package called Between a Rock & a Hyde Place.\n"
         ]
      },
      "Long hiatus (1989–2003)": {
         "text": [
            "The duo of Rock and Hyde ceased to be a performing unit at the end of the 1980s, although at the time of Hyde's first solo release (1989's Turtle Island), Hyde was referring to the split simply as a hiatus. However, it took a long time for the hiatus to end; throughout the 1990s and early 2000s, Rock busied himself producing heavy metal bands like Mötley Crüe and Metallica. Along with ex-Payola Chris Taylor, he also created the short-lived band Rockhead.\n",
            "Paul Hyde, meanwhile, pursued an on-again/off-again solo recording career, which included Rock as producer, guitarist and occasional co-writer on 2000s Living off the Radar.[7] Ex-Payolas Chris Taylor and Alex \"A-Train\" Boynton also guested on a few of this album's tracks.\n",
            "Another Payolas compilation was released in 2002 in Universal Music's 20th Century Masters Series. This compilation also featured the Rock and Hyde track \"Dirty Water\".\n"
         ]
      },
      "Reunion (2003–2008)": {
         "text": [
            "Finally, in 2003, Rock and Hyde played a Vancouver gig. An EP called \"Missing Links\" was released for a charitable foundation, consisting of previously-unreleased Payolas songs and demos, a couple of which had surfaced earlier, in slightly different productions, on Paul Hyde's solo album Living off the Radar.\n",
            "The following year, Rock and Hyde announced they were at long last going into the studio to record a new Payolas release. The band was now a duo, with Hyde singing and Rock playing multiple instruments in the studio, occasionally augmented by session musicians.  In 2006, a track called \"Bomb\" was available at their website, followed by \"At the Angel's Feet\".\n",
            "On July 17, 2007, the Payolas released a seven-song EP, Langford (Part One). They then played several live dates, reuniting the late 1980s band line-up of Rock, Hyde, and bassist Alex \"A-Train\" Boynton — a line-up that performed as \"Paul Hyde and The Payolas\" and as \"Rock and Hyde\", but prior to this reunion, had never performed as the Payolas.\n",
            "It was announced that there would be a full length follow-up to the Langford (Part One) EP, to be released in 2008 and possibly incorporating some of the EP's tracks. However, this release never materialized.\n",
            "The band stopped performing live as of 2008, and the official Payolas' website shut down in 2009. As with the band's first break-up, no formal announcement was made that the Payolas were ceasing operations; however, later in 2009 Paul Hyde resumed his solo career, releasing his fifth studio album.\n"
         ]
      }
   },
   "Discography": {
      "Studio albums": {},
      "Compilation albums": {},
      "Extended plays": {},
      "Singles": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Payolas (or Payola$) were a Canadian rock band, most prominent in the 1980s.[1] Evolving from a new wave sound toward mainstream pop-rock, they released several albums and singles that were Canadian chart hits.\n",
      "The band's name is a reference to the payola scandal in the United States in the early 1960s. The group was based in Vancouver, British Columbia, and recorded mostly at Vancouver's Little Mountain Sound Studios. Through several lineup changes and name changes (the band also played as The Payola$, Paul Hyde and the Payolas, and Rock and Hyde), the Payolas core members remained Paul Hyde and Bob Rock, who together wrote virtually all of the band's songs, occasionally with co-writers.  As well, Rock engineered and mixed virtually every Payolas recording.\n",
      "They disbanded in 1988, but reformed again from 2003 to 2008, issuing a new EP in 2007.\n",
      "Vocalist Hyde, a British immigrant, met guitarist Rock (originally from Winnipeg) during high school in Langford, B.C.  Shortly after they joined with drummer Ian Tiles and bass player Marty Higgs to form a pop-punk band. As the band got started, Bob Rock simultaneously started his career as a recording engineer at Little Mountain Sound Studios in Vancouver, B.C., allowing the Payola$ the time to record their first single, \"China Boys\" (1979). This single was sold at their gigs and in local music stores.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "New wave, rock"
      ],
      "Years active": [
         "1978 (1978)–1988 (1988)",
         "2003 (2003)–2008 (2008)"
      ],
      "Labels": [
         "A&M",
         "EMI"
      ],
      "Associated acts": [
         "Rock and Hyde"
      ],
      "Past members": [
         "Paul Hyde",
         "Bob Rock",
         "Alex \"A-Train\" Boynton",
         "Chris Taylor",
         "Gary Middleclass",
         "Lawrence Wilkins",
         "Lee Kelsey",
         "Taylor Nelson Little",
         "Christopher Livingston",
         "Ian Tiles",
         "Marty Higgs"
      ]
   }
}