{
   "Discography": {
      "Compilations": {},
      "Singles": {},
      "Studio Albums": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Brown, Flower, and Schmaljohn were ex-members of the Boise punk band State of Confusion.[1] The three would link up with Martsch and form Treepeople in 1988. The band gained local notoriety and success in the late 1980s and early 1990s in regional scenes. This lineup recorded the No Mouth Pipetting self-released album in 1989, and then shortly released the Time Whore EP the following year. The band's next album would be Guilt Regret Embarrassment in 1991, released through two small labels, Toxic Shock Records and K Records. Afterwards in 1992, Flower had left the band, and Tony Reed was recruited as the new drummer. This lineup would record the Something Vicious for Tomorrow EP; however, the band had more label backing on this release, as they had signed with the label C/Z Records, and would stay with them for the remainder of their career. The label wanted to make the release a full-length; thus, they included the previously-released Time Whore EP as an add-on. \n",
         "Shortly before the recording of the next album, Brown had left the band. He was replaced by drummer-turned-bassist Reed, and Eric Akre was added on for drums. This lineup would release its next album Just Kidding in 1993. The following year in 1994, Schmaljohn would change the lineup yet again, with John Polle replacing Martsch on guitars and Eric Carnell replacing Reed on bass; however, drummer Akre stayed on board. Martsch would move on with the band Built to Spill. The band's final album would be Actual Re-Enactment. After losing members to family complications and other projects, the group disbanded later that year in 1994.\n",
         "Scott Schmaljohn later played in Stuntman, The Hand, and The Treatment. Schmaljohn also guested on Built to Spill's 2009 album There Is No Enemy, playing on the song \"Pat\", a tribute to Pat Brown, who committed suicide in April 1999. Prior to his death, Brown fronted the band Hive. Wayne Flower went on to play in Violent Green and The Halo Benders with Doug Martsch and Calvin Johnson (of Beat Happening, Dub Narcotic and co-founder of K Records).\n",
         "Treepeople reformed in 2018 with Troy Wright taking over bass duties for Pat Brown.[2] Wright was also the last drummer for State of Confusion. Treepeople performed at the 2018 Treefort music festival and played in Portland, Seattle, Vancouver, San Francisco, Los Angeles, San Diego, Phoenix, Tucson, Albuquerque, and Denver.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Studio Albums",
      "2.2 Singles",
      "2.3 Compilations",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Treepeople is an alternative rock band from Boise, Idaho, although its members were officially based in Seattle, Washington. The band was originally composed of bassist Pat Brown (née Schmaljohn, Scott's older brother), drummer Wayne Rhino Flower, guitarist Doug Martsch, and frontman Scott Schmaljohn. After six albums and various lineup changes, the band disbanded in 1994. The band's original lineup would reform in 2018, sans Brown due to his death in 1999.\n"
      ]
   },
   "Title": "Treepeople - Wikipedia"
}