{
   "Name": "Pointed Sticks",
   "rawData": [
      "Pointed Sticks are a Canadian punk rock/new wave band from Vancouver. Originally active from 1978 to 1981, then reuniting to perform in July 2006 through to November 2012. After a three-year hiatus, Pointed Sticks returned to the stage in June 2015 for shows on Vancouver island as well as the July 11th Khatsahlano street party in Vancouver (sporadic live appearances have continued into 2016). The band is known for their fast melodic pop music and liberal use of harmony singing by all five members—also for unusual graphic images that acted as counterpoint to the music.\n",
      "They were the first Canadian band signed to Stiff Records, although the label was going through financial problems and never released an album by the band. The original band consisted of vocalist Nick Jones, guitarist Bill Napier-Hemy, bassist Tony Bardach and drummer Ian Tiles. Keyboard player Gord Nicholl joined soon after. Johnny Ferreira later joined on saxophone, Bardach was replaced by Scott Watson on bass, and Tiles was replaced by drummer Robert Bruce (from Active Dog), and later by Ken \"Dimwit\" Montgomery (who was also known for stints in the Subhumans and D.O.A.). The band released four singles, (including their only Stiff records release, a 3-song 7\") before releasing their first full-length album, Perfect Youth in 1980. Members of the band were featured in Dennis Hopper's 1980 film, Out of the Blue.\n",
      "The first compilation of their recordings was released in 1995 on Zulu Records. Part Of The Noise, now out of print, included five songs from the Perfect Youth album as well as 45's and rarities. In 2005, the complete Perfect Youth album, with four bonus tracks, was reissued by Sudden Death Records, followed the next year by a compilation of singles, outtakes, and other rarities, entitled Waiting for the Real Thing, also on Sudden Death. These two releases do not share or repeat any tracks.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Punk rock, new wave[1]"
      ],
      "Years active": [
         "1978 (1978)–1981 (1981)",
         "2006–2012",
         "2015-present"
      ],
      "Labels": [
         "Stiff, Sudden Death, Quintessence"
      ],
      "Members": [
         "Nick Jones",
         "Bill Napier-Hemy",
         "Gord Nicholl",
         "Tony Bardach",
         "Ian Tiles"
      ],
      "Past members": [
         "Colin Griffiths",
         "Robert Bruce",
         "Ken \"Dimwit\" Montgomery",
         "Johnny Ferreira",
         "Scott Watson"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band from Vancouver. Originally active from [YEAR] to [YEAR], then reuniting to perform in [MONTH] [YEAR] through to [MONTH] [YEAR]. After a three-year hiatus, [BAND_NAME] returned to the stage in [MONTH] [YEAR] for shows on Vancouver island as well as the [MONTH] 11th Khatsahlano street party in Vancouver (sporadic live appearances have continued into [YEAR]). The band is known for their fast melodic pop music and liberal use of harmony singing by all five members—also for unusual graphic images that acted as counterpoint to the music.\n",
      "They were the first Canadian band signed to Stiff Records, although the label was going through financial problems and never released an [GENRE] band. The original band consisted of vocalist [PERSON_NAME_FULL_0_MALE], guitarist Bill Napier-Hemy, bassist [PERSON_NAME_FULL_1_MALE] and drummer Ian Tiles. Keyboard player Gord Nicholl joined soon after. Johnny Ferreira later joined on saxophone, [PERSON_NAME_LAST_1] was replaced by [PERSON_NAME_FULL_2_MALE] on bass, and Tiles was replaced by drummer Robert Bruce (from Active Dog), and later by Ken [SONG_NAME]) before releasing their first full-length album, Perfect Youth in [YEAR]. Members of the band were featured in Dennis Hopper's [YEAR] film, Out of the Blue.\n",
      "The first compilation of their recordings was released in [YEAR] on Zulu Records. Part Of The Noise, now out of print, included five songs from the Perfect Youth album as well as 45's and rarities. In [YEAR], the complete Perfect Youth album, with four bonus tracks, was reissued by Sudden Death Records, followed the next year by a [GENRE]"
   ]
}