{
   "Name": "Powder Blues Band",
   "rawData": [
      "The Powder Blues is a Canadian blues/pop/jazz band formed in 1978 in Vancouver. Its first album Uncut went double platinum in Canada. The second album Thirsty Ears was similarly popular.\n",
      "Their best known songs include: \"Boppin' with the Blues\", \"Doin' It Right\", \"Thirsty Ears\", \"Hear That Guitar Ring\", and \"What've I Been Drinkin\".\n",
      "The Powder Blues was founded in 1978 as a house band in Vancouver, British Columbia. The band was founded by brothers Tom Lavin (guitar, vocals), Jack Lavin (bass, vocals), and Willie MacCalder (keyboards, vocals). After playing in local clubs for 18 months, the band released their self-financed and self-produced debut album, Uncut, in 1980, followed by a tour of Canada and the US. The band won the Juno Award for \"Most Promising Group of the Year\" in 1981. Uncut went double platinum in Canada in 1982, selling over 200,000 copies. Their second album, Thirsty Ears, was released in 1981 and was certified platinum in Canada. In 1986, the band won the American W.C. Handy Award for \"Foreign Band of the Year\". The band's greatest hits album First Decade was released in 1990 and was certified gold.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, BC, Canada"
      ],
      "Genres": [
         "Blues/Jazz"
      ],
      "Years active": [
         "1978–present"
      ],
      "Website": [
         "http://www.powderblues.net"
      ],
      "Members": [
         "Tom Lavin",
         "Bill Hicks",
         "Bill Runge",
         "Miles Black",
         "Paul Baron",
         "Vincent Mai",
         "Rod Murray",
         "Pat Caird",
         "Mike Kalanj"
      ],
      "Past members": [
         "Jack Lavin",
         "Willie MacCalder",
         "Mark Hasselbach",
         "Duris Maxwell",
         "Wayne Kozak",
         "Gordon Bertram",
         "David Woodward",
         "Daryl Bennett"
      ]
   },
   "albums": [],
   "prunedData": [
      "The Powder Blues is a [GENRE] band formed in [YEAR] in Vancouver. Its first album Uncut went double platinum in Canada. The second album Thirsty Ears was similarly popular.\n",
      "Their best known songs include: [SONG_NAME].\n",
      "The Powder Blues was founded in [YEAR] as a [GENRE] band in Vancouver, British Columbia. The band was founded by brothers Tom [PERSON_NAME_LAST_1] (guitar, vocals), [PERSON_NAME_FULL_1_MALE] (bass, vocals), and [PERSON_NAME_FULL_0_MALE] (keyboards, vocals). After playing in local clubs for 18 months, the band released their self-financed and self-produced debut album, Uncut, in [YEAR], followed by a tour of Canada and the US. The band won the [MONTH]o Award for [SONG_NAME]. The band's greatest hits album First [MONTH]ade was released in [YEAR] and was certified gold.\n"
   ]
}