{
   "Awards": {},
   "Discography": {
      "Albums": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "Current lineup": {
         "text": [
            "The band's most recent release is blues + jazz = BLAZZ! (2004). The lineup on that album consisted of:\n"
         ]
      },
      "text": [
         "The Powder Blues was founded in 1978 as a house band in Vancouver, British Columbia. The band was founded by brothers Tom Lavin (guitar, vocals), Jack Lavin (bass, vocals), and Willie MacCalder (keyboards, vocals).[1] After playing in local clubs for 18 months,[citation needed] the band released their self-financed and self-produced debut album, Uncut, in 1980, followed by a tour of Canada and the US.[citation needed] The band won the Juno Award for \"Most Promising Group of the Year\" in 1981.[1] Uncut went double platinum in Canada in 1982, selling over 200,000 copies.[2] Their second album, Thirsty Ears, was released in 1981[1] and was certified platinum in Canada.[2] In 1986, the band won the American W.C. Handy Award for \"Foreign Band of the Year\".[3] The band's greatest hits album First Decade was released in 1990 and was certified gold.[2]\n",
         "The band is now known as Tom Lavin and the Legendary Powder Blues.[4] They were still touring as of winter 2020.[5]\n",
         "The initial lineup of the band consisted of:[1]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Current lineup",
      "2 Discography",
      "2.1 Singles",
      "2.2 Albums",
      "3 Awards",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Powder Blues is a Canadian blues/pop/jazz band formed in 1978 in Vancouver. Its first album Uncut went double platinum in Canada. The second album Thirsty Ears was similarly popular.\n",
         "Their best known songs include: \"Boppin' with the Blues\", \"Doin' It Right\", \"Thirsty Ears\", \"Hear That Guitar Ring\", and \"What've I Been Drinkin\".\n"
      ]
   },
   "Title": "Powder Blues Band - Wikipedia"
}