{
   "Name": "Prism (band)",
   "rawData": [
      "Prism (often styled as PRiSM) is a Canadian rock band formed in Vancouver in 1977. They were originally active from 1977 to 1984 and have been active again from 1987 to present. Their classic line-up consisted of lead singer Ron Tabak, guitarist Lindsay Mitchell, keyboardist John Hall, bass guitarist Allen Harlow and drummer Rocket Norton.\n",
      "The band's sound is a mix of Album-oriented rock (AOR) and pop rock and they have released a total of eight studio albums, three compilation albums and one live album.\n",
      "Prism's success has been primarily in Canada where they won the Canadian music industry Juno Award for Group of the Year in 1981, although they also reached the US top 40 charts with 1981's \"Don't Let Him Know\". Prism is also noteworthy for launching the careers of several former group members, including international record producer Bruce Fairbairn, songwriter Jim Vallance, Powder Blues Band frontman Tom Lavin and Headpins and Chilliwack musician Ab Bryant. A pre-fame Bryan Adams also contributed as a songwriter to several early Prism releases.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Rock",
         "hard rock",
         "pop rock"
      ],
      "Years active": [
         "1976 (As Stanley Screamer), 1977 (1977)–1984 (1984), 1987–present"
      ],
      "Labels": [
         "GRT",
         "Capitol",
         "Spinner Music Group"
      ],
      "Website": [
         "prism.ca"
      ],
      "Members": [
         "Al Harlow",
         "Gary Grace",
         "Marc Gladstone",
         "Tad Goddard"
      ],
      "Past members": [
         "Jim Vallance",
         "Ron Tabak",
         "John Hall",
         "Lindsay Mitchell",
         "Tom Lavin",
         "Ab Bryant",
         "Rocket Norton",
         "Henry Small",
         "Paul Warren",
         "John Trivers",
         "Robyn Robbins",
         "Doug Maddick",
         "Darcy Deutsch",
         "Andy Lorimer",
         "Steve-O",
         "Timothy B. Hewitt",
         "Steve Soucy",
         "Frank Baker",
         "Darrell Mayes",
         "John Counsel"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (often styled as PRiSM) is a [GENRE] band formed in Vancouver in [YEAR]. They were originally active from [YEAR] to [YEAR] and have been active again from [YEAR] to present. Their classic line-up consisted of lead singer Ron Tabak, guitarist [PERSON_NAME_FULL_0_FEMALE], keyboardist John Hall, bass guitarist [PERSON_NAME_FULL_1_MALE] and drummer Rocket Norton.\n",
      "The band's sound is a mix of Album-oriented rock (AOR) and pop rock and they have released a total of eight studio albums, three compilation albums and one live album.\n",
      "[BAND_NAME]'s success has been primarily in Canada where they won the Canadian music industry [MONTH]o Award for Group of the Year in [YEAR], although they also reached the US top 40 charts with [YEAR]'s \"Don't Let Him Know\". [BAND_NAME] is also noteworthy for launching the careers of several former group members, including international record producer [PERSON_NAME_FULL_2_MALE], songwriter [PERSON_NAME_FULL_0_MALE], Powder Blues Band frontman [PERSON_NAME_FULL_1_MALE] and Headpins and Chilliwack musician Ab Bryant. A pre-fame Bryan Adams also contributed as a songwriter to several early [BAND_NAME] releases.\n"
   ]
}