{
   "Name": "Prism (band)",
   "Sections": [
      "1 History",
      "1.1 Sunshyne & Seeds of Time",
      "1.2 Prism debut",
      "1.3 1978–1981: Fixed line-up",
      "1.4 1981–1984: Henry Small era",
      "1.5 Death of Ron Tabak",
      "1.6 Reunion and Jericho",
      "1.7 Present line-up and Big Black Sky",
      "1.8 2015 reunion concert",
      "1.9 Recent",
      "2 Legacy",
      "3 Personnel",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Live albums",
      "4.3 Compilation albums",
      "4.4 Extended plays",
      "4.5 Music videos",
      "4.6 Singles",
      "5 Awards and nominations",
      "6 See also",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Prism (often styled as PRiSM) is a Canadian rock band formed in Vancouver in 1977. They were originally active from 1977 to 1984 and have been active again from 1987 to present. Their classic line-up consisted of lead singer Ron Tabak, guitarist Lindsay Mitchell, keyboardist John Hall, bass guitarist Allen Harlow and drummer Rocket Norton.\n",
         "The band's sound is a mix of Album-oriented rock (AOR) and pop rock and they have released a total of eight studio albums, three compilation albums and one live album.\n",
         "Prism's success has been primarily in Canada where they won the Canadian music industry Juno Award for Group of the Year in 1981, although they also reached the US top 40 charts with 1981's \"Don't Let Him Know\". Prism is also noteworthy for launching the careers of several former group members, including international record producer Bruce Fairbairn, songwriter Jim Vallance, Powder Blues Band frontman Tom Lavin and Headpins and Chilliwack musician Ab Bryant. A pre-fame Bryan Adams also contributed as a songwriter to several early Prism releases.\n",
         "On Sunday March 6, 2011 Prism's \"Spaceship Superstar\" was chosen as the wake up song for the Space Shuttle Discovery crew members. This was a significant point in history as it was the last day that the crews of Discovery and the International Space Station were together before Discovery returned to Earth in the last mission of Discovery.[1]\n"
      ]
   },
   "History": {
      "Sunshyne & Seeds of Time": {
         "text": [
            "Prism was the brainchild of musician-producer Bruce Fairbairn and comprised members from two local Vancouver bands, \"Sunshyne\" and \"Seeds of Time\". Fairbairn was originally a trumpet player in Sunshyne, a jazz-rock band, in the early 70s. Around 1974, the band switched their format to blues-rock by recruiting guitarist Lindsay Mitchell from Seeds of Time as their frontman.  The Seeds of Time were a blues-oriented group that had recently wound down after a mildly successful recording career, in which they placed two songs in the Canadian Top 100 (RPM Magazine): \"My Home Town\" reached #76 and \"Crying the Blues\" reached #90, both in 1971.[2]\n",
            "Still operating under the name Sunshyne, Fairbairn then decided to pursue a recording contract for the band. After a year of trying, he was unsuccessful and in mid-1975 he approached former Sunshyne member Jim Vallance for help in reworking the demos. Some changes were made. First, Vallance helped with new arrangements on two of Mitchell's songs and also began contributing some of his own at Fairbairn's request. Ron Tabak was recruited to replace Mitchell on lead vocals while Mitchell remained as the guitarist and alternate songwriter. A set of five demo songs, two by Mitchell and three by Vallance, were then recorded and sent to record labels across Canada. An executive at GRT Records liked one of Vallance's songs, \"Open Soul Surgery\", and offered Fairbairn's project a recording contract in 1976.\n"
         ]
      },
      "Prism debut": {
         "text": [
            "Over the next year, Fairbairn produced the group's debut album. At the time there was no fixed band line-up for the recording and Fairbairn employed various musicians from around the local Vancouver music scene. Tabak, Mitchell and Vallance were relative constants during the sessions: others who participated in the recording sessions included Steve Pugsley, Richard Christie, Peter Bjerring, Dave Calder, Tom and Jack Lavin, David Sinclair, Dave Pickell, John Hall and Graeme Coleman.\n",
            "Eventually, the group line-up \"officially\" coalesced into: Ron Tabak (vocals), John Hall (keyboards, synthesizers, backing vocals), Lindsay Mitchell (lead guitar, backing vocals), Tom Lavin (rhythm guitar & bass), Ab Bryant (bass) and Jim Vallance (drums). The group was still known as Sunshyne at this point and Bryant had not actually played on any of the recording sessions, joining shortly after they were completed.\n",
            "By the time the album was completed, seven of its nine songs were written by Vallance with one by Mitchell and one by Lavin. As the album was about to go into production, some changes were made to the credits. The label's management did not like the name \"Sunshyne\", so they released a pre-LP teaser single, \"I Ain’t Lookin’ Anymore\" with \"Don’t Let Me Find Out\" as a B-Side, under the group name \"Stanley Screamer\".  That moniker wasn't popular with the group, so after trying out several other names at local gigs (including \"Under Construction\"), the members settled on \"Prism\" as the band's new name. Also, Vallance decided to use a pseudonym, Rodney Higgs, for his work as the band's drummer and songwriter. As Prism's principal songwriter, Vallance was afraid that if the album failed and his real name was associated with it, he would never land another recording contract. By using the pseudonym, he could get around that problem.\n",
            "Finally, Fairbairn (horns) and Tom Keenlyside (saxophone) received credit as session musicians, with Fairbairn acting as road manager on US and Canadian tour dates. The others who played were not credited on the finished album as musicians but were listed in the credits in a section labelled \"special thanks\".\n",
            "The band was then taken on by Bruce Allen, arguably the biggest rock music manager in Canada at the time.[3]\n",
            "The self-titled Prism album was released on GRT (Ariola Records in the US) in May 1977.  Although Ab Bryant appears on the back jacket, he'd actually only been hired days before the photo was taken. But within a few months of the album's debut, Bryant exited the group to join the Rocket Norton Band, later joining Chilliwack (and later still, The Headpins). Lavin switched back to bass in Bryant's absence and Sunshyne's trombonist, Ralph Eppel, joined alongside adjunct members Bruce Fairbairn and Tom Keenlyside in Prism's horn section for their ensuing tour (with Vallance still drumming as \"Rodney Higgs\").\n",
            "After the first leg of touring ended in late August 1977, Vallance resigned as drummer but remained as principal songwriter. Vallance did not enjoy the lifestyle of touring, preferring instead to write songs in his home studio. He was replaced with Seeds of Time alumnus Rocket Norton, who was also leading his own Rocket Norton Band at the time.[3]\n",
            "Lavin was let go in December 1977 and went on to form the Powder Blues Band, who in the next few years would hit the Canadian charts with several singles and albums.[3]\n",
            "Prism's \"Spaceship Superstar\" and \"Take Me to the Kaptin\" were released as singles and both charted in Canada. The debut album reached platinum status in sales (100,000+ units sold) by the next year.\n"
         ]
      },
      "1978–1981: Fixed line-up": {
         "text": [
            "As Prism was preparing to record their follow up album, some changes happened to the lineup that would remain fixed for the next three years. Firstly, another former Seeds of Time alumni, Al Harlow, was brought in as bassist, in January 1978, to replace Tom Lavin. \nThen, Vallance quit the band as principal songwriter. Upon rehearsing song demos with the band, Mitchell and Vallance had fallen into heated disagreements over the style of songwriting. When it became apparent they were at an impasse, Vallance elected to go, leaving two songs for the band, \"N-N-N-No!\" and \"You're Like The Wind\" (both credited to Rodney Higgs as songwriter). But his departure left a gaping hole in songwriting for the band to fill. Fortunately, Al Harlow supplied two songs, and the remaining members' songs filled out the album. See Forever Eyes was again produced by Fairbairn and employed a number of uncredited studio musicians playing alongside or in place of the credited band members.  The album was released in June 1978 with the title track and Harlow's songs, Flyin' and Take Me Away, released as singles. See Forever Eyes reached platinum status by the next year.\n",
            "Just before their 1978 tour, saxophonist Tom Keenlyside was dropped but Fairbairn and Eppel remained on trumpet and trombone respectively.[3]\n",
            "On July 16, 1978 Prism played a show at Royal Oak Music Theater in Royal Oak, Michigan that was broadcast by Westwood One Radio and later appeared as a much sought after promo album.[3]\n",
            "That same summer, the band toured the US and Canada as the opening act for Meat Loaf's Bat Out Of Hell Tour.[3]\n",
            "During the spring of 1979, the band returned to the studio to record their third and what would be their most commercially successful album. Mitchell was now the principal songwriter and wrote/co-wrote four songs for the album. Although it was his largest contribution yet for a single album, it fell short of what was needed. In an effort to help, Vallance became involved again and brought along his new songwriting partner, Bryan Adams, to contribute to the songwriting effort. Adams, who at the time was an unsigned recording artist, wrote/co-wrote three songs. Vallance, meanwhile, co-wrote one track as Rodney Higgs, arranged two tracks using his real name, and played drums, bass and guitars on several tracks without credit.\n",
            "For their '79 tour, the two remaining horns were dumped, but Fairbairn remained involved with the band and organized a six piece horn section that would appear with the band on selected dates for the next few tours.[3]\n",
            "Album #3, Armageddon, was released in June 1979 to much promotional hype. \"Virginia\", \"Armageddon\" and \"Night to Remember\" were released as singles and charted in Canada. The album reached double platinum status (in excess of 200,000 units sold) by the next year and helped garner the band their lone Canadian music industry Juno award for Group of the Year in 1981. Also, Mitchell received the SOCAN Song of the Year award for \"Night to Remember\" in 1980. The title track \"Armageddon\" would become one of the band's most recognizable songs. Despite the album's commercial success, the record label, GRT, went into receivership and the band signed on with Capitol Records.\n",
            "The group's next record, Young and Restless, was released in May 1980.  This was the first Prism album written without any credited contributions from Vallance/Higgs: all songs were written by Mitchell, Harlow or Norton. (Vallance claims he did participate in the making of the album as an arranger, and as an uncredited co-writer of one track, but admits that his participation in Young and Restless was \"minimal\"). The album spun off Prism's highest charting single, also called \"Young and Restless\", which peaked at #14 on the Canadian charts.\n",
            "At this point, Prism parted company with their long-time producer and founder Bruce Fairbairn and recorded one new track for their 1980 greatest hits album, All the Best From Prism, with new producer John S. Carter, who was known professionally simply as \"Carter\"; Carter would be the group's producer for all their subsequent releases through 1983. The new song, \"Cover Girl\", was written by Mitchell and Bryan Adams and was released as a single but did not chart.\n",
            "Fairbairn went on to a successful career as a record producer. He died of a heart attack on May 17, 1999 in his Vancouver home, aged 49.[4]\n"
         ]
      },
      "1981–1984: Henry Small era": {
         "text": [
            "At a show at the Danforth Music Hall in Toronto on December 9, 1980, singer Ron Tabak's performance was so lackluster that he was fired by the band's manager Bruce Allen in early 1981 at Capitol's insistence and the band's support. Various reasons cited were his drug and alcohol abuse, conflicts with other band members, several run-ins with the law and/or lack of songwriting ability. Vocalist Henry Small (ex-Scrubbaloe Caine and Small Wonder) was brought in after being recommended by his friend and former bandmate, Paul Dean (of Loverboy).[3]\n",
            "Tabak, with the help of drummer Norton, formed The Ron Tabak Band in 1981, which attracted interest from CBS Records. But when the CBS deal fell through, a discouraged Tabak left the music business altogether.\n",
            "In the meantime, keyboardist John Hall, unhappy with Tabak's firing, left Prism as well and the new four-piece line-up (Small/Mitchell/Harlow/Norton) recorded the album Small Change in the summer of 1981, which was released that December. Keyboards on the album were handled by Jimmy Phillips (who had previously played with The Guess Who in 1979 under his real name of Jimmy Grabowski) and guitarist Randy Hansen and harmonica player Norton Buffalo were among those who also contributed to the sessions for Small Change. Plus Harlow's and Norton's contributions to the record were reportedly minimal as Capital had more session players brought in, in hopes of a hit. The lead track \"Don't Let Him Know\", written by Jim Vallance (using his real name) and Bryan Adams, became Prism's first top 40 hit (#39 in early 1982) in the US and a #1 single on Billboard's new Rock Tracks chart,.[5] The follow-up single \"Turn on Your Radar\" also charted at #64, becoming their fifth and final American charter.\n",
            "In 1981 Small, Mitchell, Harlow and Norton were joined for touring by keyboardists Jamie Bowers (also rhythm guitar) and David Stone (ex-Rainbow).\n",
            "But during another Christmas show at the Danforth Music Hall on December 14, 1981, the group was playing with fellow Canadian rockers Klaatu. When Klaatu received a better response and most of the audience left before Prism had finished their set, the band realized that their new line-up was not being embraced by fans, so Mitchell, Harlow, Norton, Bowers and Stone, who were also chafing over Bruce Allen and Capital designating Henry Small in charge of musical direction and rehearsals in Los Angeles, decided to leave Prism by early 1982.[3] With Mitchell's departure, Prism now had no original members left.\n",
            "In 1982 because of debts, ownership of the band's name temporarily was held by Allen, who decided to build on the success of \"Don't Let Him Know\" by putting the band on the road with a lineup of Small, guitarist Paul Warren (ex-Rare Earth), bassist John Trivers, keyboardist Robyn Robbins (from Bob Seger's Silver Bullet Band) and Doug Madick (formerly of Starz and Hellcats) on drums.\n",
            "Although the band had essentially broken up by the end of 1982, Small decided to continue recording as a solo artist but using the Prism name and assembled a group of session musicians, including Alan Pasqua, Richie Zito, Mike Baird, and backup vocalists Timothy B. Schmit (Eagles), Bobby Kimball (Toto) and Bill Champlin (Chicago) to assist him.  Together, this ad hoc line-up released the album Beat Street under the Prism name in July 1983.  The album was not a commercial success and failed to spin off any charting singles. In a 2006 interview, Small explained why: \"Bruce Allen had a falling out with the president of EMI at the time, over Tom Cochrane, and suddenly the Beat Street album, which at that point had been charting all over the east coast of the US, was basically pulled by Capitol Records. I had put together a great touring band but Bruce called and said the tour was off and soon after, Prism was dropped from the label. That was heartbreaking but not unusual in the business.\"  Small—by now the group's only member—essentially retired from using the Prism name in early 1984 and the 'group' became defunct.\n"
         ]
      },
      "Death of Ron Tabak": {
         "text": [
            "Several former members of Prism were in the preliminary discussion stages of a Prism reunion in late 1984.  Al Harlow and Ron Tabak had made plans to spend Christmas 1984 together at Harlow's place in Kitsilano.[6]  Tabak decided to cycle to Harlow's home on Christmas Eve as a way to get some exercise. This turned out to be poor judgment, as the roads were snow covered and he rode at night without a headlight and helmet.  It is believed that on the way, Tabak was struck by a passing vehicle, fell and hit his head on the pavement. He was taken by ambulance to the hospital where Tabak abruptly became abusive, prompting two police officers at the hospital to arrest him, thinking he was under the influence of alcohol. He was later discovered unconscious in his jail cell and was rushed back to the hospital. A second examination discovered a blood clot had developed on the right side of his brain. Tabak died of an aneurysm on Christmas Day 1984, before a pending neurosurgical operation could be performed.[7] Previously discussed plans for a Prism reunion were canceled, out of respect for Tabak's death.[8][9]\n"
         ]
      },
      "Reunion and Jericho": {
         "text": [
            "In 1987 Prism reformed with a revised line-up, and two new Prism tracks were recorded for another greatest hits album called Over 60 Minutes with...Prism, released in 1988.  One of the new tracks, \"Good To Be Back\", was composed by Al Harlow, Bryan Adams and Jim Vallance, produced by Vallance, and in a nod to long-time fans, was mixed by \"Rodney Higgs\".  The song was performed by new vocalist Darcy Deutsch (vocals), Al Harlow (guitar and bass), Jim Vallance (drums and keyboards) and Lindsay Mitchell (guitar solo).  Paul Janz and Marc Le France provided backing vocals.  Subsequently, Harlow, Mitchell and Deutsch recruited former member Rocket Norton on drums and new keyboardist Andy Lorimer.[9] This line-up toured live in 1988. Deutsch and Lorimer had previously performed Prism songs in their former band Simon Kaos, where they had been spotted by Prism guitarist Mitchell.\n",
            "Five years later, this same line-up released the first new Prism album in 10 years, 1993's Jericho.  Guest musicians on the album included Bryan Adams, Paul Janz and Mark LaFrance, with Rick Springfield and Randy Bachman (Bachman–Turner Overdrive) contributing to the songwriting.\n"
         ]
      },
      "Present line-up and Big Black Sky": {
         "text": [
            "In 1990 China White singer Rick Shermack, of Edmonton, had done a short tour substituting for  Darcy Deutsch as lead vocalist with Prism, which he called not only an honour, but actually rather easy. \"We were always playing their songs anyway, now here was my chance to blast out all those Prism hits I'd been covering for all those years with the guys who wrote them - an absolute blast\".[10]\n",
            "Norton left the band in 1994 to work in television and stage production and was replaced by drummer John Cody (who had already subbed for Norton on the road in 1992-1993 and played on the Jericho album). But after Cody's departure in 1996 and a brief return in 1997 by Norton, Darrell Mayes (from the Colin James Band) took over the drum chair before turning it over to Frank Baker circa 2000. Baker stayed on until 2003 when Mayes briefly returned, but he was replaced almost immediately by Gary Grace.\n",
            "Keyboardist Richard Sera (formerly with fellow Canadian rockers Trooper) subbed for Andy Lorimer from 1991 to 1992 before Lorimer returned. But after Lorimer left Prism for good in 1996, John Counsel, then Steve Soucy, assumed the keyboard chair from the mid-90s to 2003, when Alfie Galpin took over for a year, followed by Johnny Ferreira (another Colin James player) in 2004.\n",
            "After singer Darcy Deutsch left Prism in 2003, Harlow assumed the lead singer position and also lead guitar when Lindsay Mitchell left in early 2005. Mitchell's departure left Prism once again with no original members.\n",
            "The band continued to tour in 2005 with a new lineup of Harlow, drummer Gary Grace (who'd joined in 2003), Steve-O (keyboards, guitars, backing vocals) and bassist Michael Kaye (who was soon replaced by Tad Goddard). In 2006 Goddard left and Timothy B. Hewitt (bass, guitars, keyboards, backing vocals) came in for two years.\n",
            "By 2008, Prism consisted of Harlow, Gary Grace, Steve-O and Timothy B. Hewitt (bass, guitars, keyboards). This line-up released a new studio album called Big Black Sky in July 2008.  It featured mostly compositions by Harlow, with one track written by long-time ally Jim Vallance. At the end of 2008, Hewitt departed and Tad Goddard returned.\n",
            "Since 2010, Prism's line-up has been Allen Harlow (vocals, guitar, bass), Gary Grace (drums, percussion, backing vocals), Marc Gladstone (keyboards, backing vocals) and Tad Goddard (bass, backing vocals).\n",
            "On August 19, 2016 the band was flying to a show in Ottawa when drummer Gary Grace began experiencing increasing chest and leg pains. After that evening's show, he was hospitalized immediately with a massive blood clot. Prism played the following night in Halifax at the large outdoor Weir Rockin festival with drummer A.J. Chabidon from Harlequin, one of the other bands on the festival's bill. After this, former Prism drummer Frank Baker (currently with fellow Canadian rockers Sweeney Todd) did the honors at the group's Deerfoot Calgary show on August 27. One month and five days following the Ottawa incident, Grace returned to the concert stage at Edmonton's Century Casino Showroom playing to a sold-out crowd.\n"
         ]
      },
      "2015 reunion concert": {
         "text": [
            "On May 22, 2015 a \"Local Legends of Rock\" concert, featuring Ab Bryant, John Hall, Al Harlow and Rocket Norton, was held in Lynn Valley, North Vancouver. At the concert, Al Harlow said, “Here’s a disclaimer; this isn’t the reunion of any one band, but it might be the reunion of 3 or 4 bands.” A review of the concert titled it, \"Prism / Jet / Seeds of Time Reunion Concert,\" with Sunshyne being an obvious candidate for the fourth band Al referred to. The concert included the Prism songs, \"Young and Restless\", \"Nickels and Dimes\", \"Take Me to the Kaptin\", \"You're Like the Wind\" and \"Spaceship Superstar.\"\n"
         ]
      },
      "Recent": {
         "text": [
            "On May 4, 2018, Prism took part in a “White Hat Ceremony” at a concert in Calgary making them official Citizens of Calgary.\n",
            "On November 23, 2020 former Prism keyboardist Steve Soucy passed away after a heart attack.\n"
         ]
      }
   },
   "Legacy": {
      "text": [
         "Although Prism has had only moderate success as a band, their legacy is renowned for some of its former members who went on to have success in the music industry. Prism helped launch the careers of Bruce Fairbairn as an international record producer and Jim Vallance as a music industry wide songwriter. Fairbairn would go on to produce successful albums for international artists such as Loverboy, Bon Jovi, Aerosmith, AC/DC, Kiss and Yes. Vallance would team up with Bryan Adams to become Adams-Vallance, a successful song-writing team. Vallance then continued that success as a music industry \"song doctor\" for many well known international recording artists.\n"
      ]
   },
   "Personnel": {},
   "Discography": {
      "Studio albums": {},
      "Live albums": {},
      "Compilation albums": {},
      "Extended plays": {},
      "Music videos": {},
      "Singles": {},
      "text": [
         "+ indicates unofficial releases.\n"
      ]
   },
   "Awards and nominations": {
      "text": [
         "Juno Awards[11]\n\n"
      ]
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Prism (often styled as PRiSM) is a Canadian rock band formed in Vancouver in 1977. They were originally active from 1977 to 1984 and have been active again from 1987 to present. Their classic line-up consisted of lead singer Ron Tabak, guitarist Lindsay Mitchell, keyboardist John Hall, bass guitarist Allen Harlow and drummer Rocket Norton.\n",
      "The band's sound is a mix of Album-oriented rock (AOR) and pop rock and they have released a total of eight studio albums, three compilation albums and one live album.\n",
      "Prism's success has been primarily in Canada where they won the Canadian music industry Juno Award for Group of the Year in 1981, although they also reached the US top 40 charts with 1981's \"Don't Let Him Know\". Prism is also noteworthy for launching the careers of several former group members, including international record producer Bruce Fairbairn, songwriter Jim Vallance, Powder Blues Band frontman Tom Lavin and Headpins and Chilliwack musician Ab Bryant. A pre-fame Bryan Adams also contributed as a songwriter to several early Prism releases.\n",
      "On Sunday March 6, 2011 Prism's \"Spaceship Superstar\" was chosen as the wake up song for the Space Shuttle Discovery crew members. This was a significant point in history as it was the last day that the crews of Discovery and the International Space Station were together before Discovery returned to Earth in the last mission of Discovery.[1]\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Rock",
         "hard rock",
         "pop rock"
      ],
      "Years active": [
         "1976 (As Stanley Screamer), 1977 (1977)–1984 (1984), 1987–present"
      ],
      "Labels": [
         "GRT",
         "Capitol",
         "Spinner Music Group"
      ],
      "Website": [
         "prism.ca"
      ],
      "Members": [
         "Al Harlow",
         "Gary Grace",
         "Marc Gladstone",
         "Tad Goddard"
      ],
      "Past members": [
         "Jim Vallance",
         "Ron Tabak",
         "John Hall",
         "Lindsay Mitchell",
         "Tom Lavin",
         "Ab Bryant",
         "Rocket Norton",
         "Henry Small",
         "Paul Warren",
         "John Trivers",
         "Robyn Robbins",
         "Doug Maddick",
         "Darcy Deutsch",
         "Andy Lorimer",
         "Steve-O",
         "Timothy B. Hewitt",
         "Steve Soucy",
         "Frank Baker",
         "Darrell Mayes",
         "John Counsel"
      ]
   }
}