{
   "Name": "Pure (Canadian band)",
   "rawData": [
      "Pure was a Canadian rock band, formed in Vancouver in 1991. Previously, the band was known as After All and Grin Factory. Signed to the Reprise label, the band reached a greater audience once their song \"Greedy\" was featured on the soundtrack album Songs from the Cool World, and the single \"Blast\" reached No. 22 on Billboard's Modern Rock chart in 1993.\n",
      "The band's original members were singer Jordy Birch, guitarist Todd Simko, bass guitarist Dave Hadley and drummer Leigh Grant. Grant was replaced in 1996 by Jim Hobbs. Mark R. Henning played keyboards, but left in 1994.\n",
      "Pure was discovered at Vancouver's Music West Conference in 1991, when they went there to showcase their demo, impressing amongst others, an executive from Restless Records. They were subsequently signed by Warner/Reprise and the band's song \"Greedy\" was used in the Ralph Bakshi animated movie Cool World.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Alternative rock"
      ],
      "Years active": [
         "1991 (1991)–2000 (2000)"
      ],
      "Labels": [
         "Reprise, Mammoth, Shag"
      ],
      "Associated acts": [
         "Blisterene",
         "Combine The Victorious",
         "Guilty About Girls",
         "The Wivez"
      ],
      "Past members": [
         "Jordy Birch",
         "Todd Simko",
         "David Hadley",
         "Mark Henning",
         "Leigh Grant",
         "Jim Hobbs"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band, formed in Vancouver in [YEAR]. Previously, the band was known as After All and Grin Factory. Signed to the Reprise label, the band reached a greater audience once their song \"Greedy\" was featured on the soundtrack album Songs from the Cool World, and the single \"Blast\" reached No. 22 on Billboard's Modern Rock chart in [YEAR].\n",
      "The band's original members were singer Jordy Birch, guitarist [PERSON_NAME_FULL_0_MALE], bass guitarist [PERSON_NAME_FULL_1_MALE] and drummer Leigh Grant. Grant was replaced in [YEAR] by [PERSON_NAME_FULL_2_MALE]. [MONTH]k R. Henning played keyboards, but left in [YEAR].\n",
      "[BAND_NAME] was discovered at Vancouver's Music West Conference in [YEAR], when they went there to showcase their demo, impressing amongst others, an [GENRE] band's song \"Greedy\" was used in the Ralph Bakshi animated movie Cool World.\n"
   ]
}