{
   "Name": "Pure (Canadian band)",
   "Sections": [
      "1 History",
      "1.1 Purefunalia",
      "1.2 Generation 6 Pack",
      "1.3 Feverish",
      "2 Post break-up",
      "3 Discography",
      "3.1 Singles",
      "3.2 Albums and EPs",
      "4 References"
   ],
   "Summary": {
      "text": [
         "Pure was a Canadian rock band, formed in Vancouver in 1991. Previously, the band was known as After All and Grin Factory.[1] Signed to the Reprise label, the band reached a greater audience once their song \"Greedy\" was featured on the soundtrack album Songs from the Cool World, and the single \"Blast\" reached No. 22 on Billboard's Modern Rock chart in 1993.[2]\n"
      ]
   },
   "History": {
      "Purefunalia": {
         "text": [
            "Pure's first chart success occurred in 1992 with the single \"Blast\" from Purefunalia. In November 1992, \"Blast\" reached No. 1 on RPM Magazine's Canadian Content (Cancon) chart.[4] Purefunalia was produced by Talking Heads keyboardist Jerry Harrison. The video for \"Blast\" won the award for the \"Best Alternative Video\" at the 1993 Much Music Video Awards and the song charted on Billboard's Modern Rock chart in 1993, peaking at No. 22. Later that year Pure were nominated for a Most Promising Group of the Year Juno Award in 1993.\n"
         ]
      },
      "Generation 6 Pack": {
         "text": [
            "Generation 6 Pack was released in August 1994 and led off with the single \"Denial\". The band toured relentlessly in the fall and winter of 1994. In January 1995, they played the Big Day Out festival in Australia. Despite this, they were dropped by Warner/Reprise. Pure then started their own record label - Shag Records, and released the song \"The Hammock\"  in the summer of 1995 and Extra Purestrial EP. \"Lemonade\", the first single, was a hit.\n",
            "In 1996 Pure re-released Generation 6-Pack on Mammoth as Generation Six-Pack. The album became a Canadian Campus chart in late 1996 hit fueled by the singles \"Denial\" and \"Anna Is A Speed Freak\".[5]\n"
         ]
      },
      "Feverish": {
         "text": [
            "On April 14, 1998 Pure released their third full-length album, Feverish. The song \"Tennis Ball\" was featured in the movie BASEketball, though not featured on the soundtrack.\n",
            "The group disbanded in 2000, citing \"musical differences\".\n"
         ]
      },
      "text": [
         "The band's original members were singer Jordy Birch, guitarist Todd Simko, bass guitarist Dave Hadley and drummer Leigh Grant. Grant was replaced in 1996 by Jim Hobbs. Mark R. Henning played keyboards, but left in 1994.[3]\n",
         "Pure was discovered at Vancouver's Music West Conference in 1991, when they went there to showcase their demo, impressing amongst others, an executive from Restless Records. They were subsequently signed by Warner/Reprise and the band's song \"Greedy\" was used in the Ralph Bakshi animated movie Cool World.\n"
      ]
   },
   "Post break-up": {
      "text": [
         "Post-Pure, vocalist Birch embarked on a solo career, with the single \"Moola Moola\" charting in Canada.[6] In 2008 he formed Guilty About Girls with bassist Mark R. Henning and drummer/DJ Lucas T. Poth. In 2015 he formed a new group called The Wivez.\n",
         "Todd Simko played on Bif Naked's first album which was released in 1995, and worked as a successful record producer/engineer in Vancouver, British Columbia and made records with such artists as Marcy Playground, Xavier Rudd, The Organ, Big John Bates, The Yoko Casiono's, Current Swell and Patrick Brealey, plus many others. Simko died at the age of 45 when he went missing and was presumed drowned on April 22, 2012.[7][8][9]\n",
         "Mark R. Henning formed Vancouver PowerPop trio Blisterene in 1995 and released the full-length CD \"So I Have Them\" in 1997 on the Poncy Rocket/IMD label.  As of 2007 Mark has formed a new group Combine the Victorious with fashion designer Isabelle Dunlop, and released their debut cd \"The World Over\" independently.  Combine the Victorious also recently became part of the Boutique Empire label.\n"
      ]
   },
   "Discography": {
      "Singles": {},
      "Albums and EPs": {}
   },
   "References": {},
   "coreData": [
      "Pure was a Canadian rock band, formed in Vancouver in 1991. Previously, the band was known as After All and Grin Factory.[1] Signed to the Reprise label, the band reached a greater audience once their song \"Greedy\" was featured on the soundtrack album Songs from the Cool World, and the single \"Blast\" reached No. 22 on Billboard's Modern Rock chart in 1993.[2]\n",
      "The band's original members were singer Jordy Birch, guitarist Todd Simko, bass guitarist Dave Hadley and drummer Leigh Grant. Grant was replaced in 1996 by Jim Hobbs. Mark R. Henning played keyboards, but left in 1994.[3]\n",
      "Pure was discovered at Vancouver's Music West Conference in 1991, when they went there to showcase their demo, impressing amongst others, an executive from Restless Records. They were subsequently signed by Warner/Reprise and the band's song \"Greedy\" was used in the Ralph Bakshi animated movie Cool World.\n",
      "Pure's first chart success occurred in 1992 with the single \"Blast\" from Purefunalia. In November 1992, \"Blast\" reached No. 1 on RPM Magazine's Canadian Content (Cancon) chart.[4] Purefunalia was produced by Talking Heads keyboardist Jerry Harrison. The video for \"Blast\" won the award for the \"Best Alternative Video\" at the 1993 Much Music Video Awards and the song charted on Billboard's Modern Rock chart in 1993, peaking at No. 22. Later that year Pure were nominated for a Most Promising Group of the Year Juno Award in 1993.\n"
   ]
}