{
   "Name": "Rymes with Orange",
   "Sections": [
      "Summary",
      "History"
   ],
   "Summary": {
      "text": [
         "Rymes with Orange is a Canadian alternative rock band which formed in 1991 in Vancouver, British Columbia, Canada. This independent band have released four albums: Peel (1992), Trapped in the Machine (1994), Crash (1999) and One More Mile (2003). They have had three Top 10 singles on Canadian Rock Radio, with sales of over 70,000 units worldwide, and have toured Canada, New Zealand, the U.S. and the U.K., all while maintaining independent status.[1]\n"
      ]
   },
   "History": {
      "text": [
         "The band originated in the early 1990s in Prince George, British Columbia, as The Night Watchmen, by original drummer and songwriter Alex (Julien) Dias, and writing partner, guitarist Rob Lulic. Vancouver based keyboardist Bob D'Eith later joined the band. It was when lead singer Jimmy Gilmore, subsequently a member of The Silencers from Scotland, decided to leave the band to go back to Scotland, Dias, Lulic and D'Eith continued, with what would eventually become Rymes with Orange.\n",
         "In 1991, after The Night Watchmen split-up, Dias, Lulic and D'Eith joined up with UK-born lead singer Lyndon Johnson, to form Rymes With Orange in Vancouver.[1] As The Night Watchmen, the band had a more conventional alternative rock sound, while as Rymes With Orange, their style evolved more towards a Madchester-influenced dance rock alternative rock sound.[2]\n",
         "That same year, the band was a semi-finalist in Vancouver's local Demo Listen Derby competition in 1991.[3] Around this time, the band joked in promotional interviews that the apparently missing letter \"h\" in their name had been donated to the band hHead.[4]\n",
         "In 1992, the band released their first full-length, debut d album entitled Peel, co-produced by Bill Buckingham and Rymes With Orange.[5] It spawned the singles \"Marvin\", \"Memory Fade\" and a cover of The Small Faces' \"Itchycoo Park\".[2]\n",
         "Russell Sholberg, a longtime, close friend of the band, played bass on the album but turned down their offers to be an official member of the band. So, it was in early 1992, that Nelson Sinclair, who would become their official bass player. \n",
         "And, not long after the release of Peel, drummer and co-founding member Alex Dias, left the band to focus on an acting career, and to pursue other musical ventures, such as his current project called; Beastly Idiots. (2017)\n",
         "In early 1992, not long after Alex's departure and Nelson's arrival, Niko Quintal from Saint-Hyacinthe, Quebec would become their new drummer. \n",
         "The album was supported by their first large-scale national tour across Canada in June 1993,[2] both on their own and as an opening act for The Blue Shadows,[6] Redd Kross, One Free Fall[7] and Odds.[2]\n",
         "Also with the band, since their first national tour in June 1993, is musician and longtime friend of Niko's, Steeve Hennessy from Campbellton, New Brunswick. It was the early 1990s, while they were both in a Halifax-based band together, that Niko first met and began playing music with Steeve. When that band decided to relocate to the West coast and call Vancouver its new home, both Niko and Steeve decided to leave the group to pursue new musical adventures. Niko's first project, was with a rocking power trio called Free Water, who released their self-titled debut album that same year, but not long after its release, they decide to call it quits, and that's when Niko joined Rymes With Orange. And for Steeve, he began working in and around Vancouver, as a freelance sound and lighting technician and writing music. It was Niko who recommended to his bandmates in Rymes, that they should hire his friend Steeve, as their sound engineer. \n",
         "After touring Canada numerous times that first year, D'Eith was forced to choose between a career on the road or a life on the business side of music. He moved back to co-managing the band with manager Peter Karroll, and became a non-touring member of the band, while Steeve moved into his touring position on keyboards and backing vocals, while also adding rhythm guitar to their live sound.\n",
         "In September 1994, the band released Trapped in the Machine, produced, engineered and mixed by John Webster, and including all six members, Lyndon Johnson, Rob Lulic, Bob D'Eith, Nelson Sinclair, Niko Quintal and Steeve Hennessy. With D'Eith off the road and helping run Citrus Soul Productions from Vancouver, Rymes With Orange tour Canada extensively to support the album, and garnered airplay on radio and at Much Music with the singles \"Toy Train\", \"I Believe\", \"She Forgot to Laugh\" and \"The Taking of David\". This record resulted in a number of Top 30 radio hits including \"Toy Train\" which was the band's biggest hit. The song was featured in the Labatt's beer commercial \"Genuine Kelly\". \n",
         "During this period, D'Eith was honored with a Best Keyboardist Award nomination at Canadian Music Week. After his official split from Rymes with Orange, D'Eith decided to re-focus his attention on his Law Practice, Politics and for his music output, he teamed up with Paul Schmidt, a classically trained acoustic guitar player, to form an ambient, instrumental project called Mythos.[8]\n",
         "Niko also played on Bif Naked's eponymous album. Bif Naked was a support act for several dates on this summer tour.[9] Part of the tour had to be postponed, however, after the band were involved in a tour van accident near Sicamous, British Columbia, January 13th, 1995.[10] They returned to the road at the beginning of March, 1995, with their friends Age of Electric, who shared a tour bus with them, on the appropriately titled \"The Electric Orange Tour\", which included dates all the way cross Canada, including Atlantic Canada, a region where they had never previously played.[11]\n",
         "January 1996, not long after a three-week tour of New Zealand at the end of December and the beginning of the new year, original bass player Nelson Sinclair, takes a break from touring. Replacing him on the bass and backing vocals is Kevin Spencer, from Hamilton Ontario. Kevin's previous band, The Misunderstood, would often support Rymes With Orange on their Ontario tour dates.\n",
         "At the Juno Awards of 1996 in Hamilton Ontario, the band garnered a nomination for Best New Group.[12] and also marked Spencer's first public appearance with the band.  \n",
         "The band continued to tour and perform from late 1996 through early 1997, but then took a hiatus from touring to write and work on new songs. \n",
         "Trapped in the Machine was the band's most successful album, selling over 60,000 copies in Canada.[13]\n",
         "In mid 1997, Kevin and Niko left Rymes to record and tour with Kim Bingham's band Mudgirl after her founding rhythm section members drummer/singer Glenn Kruger, and bassist/vocalist Russell Less pursued other creative opportunities.[14] Friend and drummer Bobby James of (Destineak), filled the position until the band found a permanent drummer. Rymes With Orange original members, singer Lyndon Johnson and guitarist Rob Lulic, along with long-time member Steeve Hennessy on keyboards, programming, vocals and guitar, were now looking for a new rhythm section for their upcoming album.\n",
         "The band returned in 1999 with their third album Crash, co-produced by Rymes With Orange and Mike Plotnikoff, recorded at the legendary Mushroom Studios, Vancouver. Crash was recorded with new rhythm section; Timothy Hewitt on bass and Trevor Grant on drums, both from New Brunswick. However, not long after the album was recorded and released, Hewitt left the band to pursue other musical ventures, including recording, co-producing and playing bass and backing vocals on Prism's 2008 album Big Black Sky. So, co-writer of the lead single \"Standing in the Rain\", Kevin Spencer returned to the band, to play bass and backing vocals, for the touring and promotion of 'Crash' [15]\n",
         "'Crash' was supported by touring Canada and the UK, and also produced two music video; \"Standing in the Rain\" and \"She's the One\".\n",
         "During their tour to support Crash, their equipment van was stolen in Winnipeg, Manitoba,[16] And then on the following tour across Canada, another rental van with a trailer, was struck by a transport truck in a parking lot, while the band was asleep in their hotel rooms. [17]\n",
         "Crash was named Best Pop / Rock Album at the 1999 West Coast Music Awards. [13]\n",
         "Following that tour, the band took a break from touring, to focus on writing and to work on other musical projects. Kevin Spencer moved to the United States, to begin performing the role of Roger Davis in the U.S. touring production of Jonathan Larson's hit musical Rent. In 2001, Rob Lulic produced an album for a band called Duke Fame. That album also mixed by Peel producer Bill Buckingham. That same year, Steeve Hennessy started touring extensively as backline / stage technician, with such acts and Econoline Crush in the U.S., supporting the band Buck Cherry. And in both summers of 2002 and 2003, he worked as Production Manager for the Vancouver International Jazz Festival, while also touring with Canadian singer-songwriter Matthew Good, as his drum and bass technician, and also playing keyboard from side stage.\n",
         "In 2003, the band released their fourth album, One More Mile, produced by Rob Lulic and Lyndon Johnson, and mixed by Trapped in the Machine mixer and producer; John Webster. The album features original members Lyndon Johnson, Rob Lulic and Steeve Hennessy, with new rhythm section Paul Fournier on Bass and Patrick Aldous on drums.\n",
         "As a side project to Rymes With Orange, in 2004 Steeve Hennessy began a career as a touring technician with Canadian singer songwriter Sarah McLachlan, on her Afterglow Tour, as her drums tech and sampler programmer. In 2006 he worked with Australian band INXS as Andrew Farriss' guitar and keyboard tech. During his entire career as a technician, he has worked with such artists as Prince, Bryan Adams, Diana Krall and YES. In 2007, he began working with Canadian singer Michael Bublé, where he continues to do so, to this day as his piano and head musical instrument technician.\n",
         "In 2008, the band was invited to perform a 45-minute set, at a Canada Day festival in Vancouver, headlined by Loverboy, and legendary producer; Bob Rock's band, the Payola$.[18]  For this special event, Rymes With Orange reunited its 1999 touring lineup of; Lyndon Johnson, Rob Lulic, Steeve Hennessy, Kevin Spencer and Trevor Grant.  \n",
         "March 2016, a new Rymes With Orange channel was launched on YouTube. RWOTV (The Rymes With Orange Channel) features rare and unreleased material, such as live performances on MuchMusic, MusiquePlus and the CBC, and includes all their official music videos. \n",
         "On November 4, 2017, Rymes With Orange reunite for the first time in 21 years, with Trapped in the Machine lineup; Lyndon Johnson, Rob Lulic, Steeve Hennessy and Nelson Sinclair. Original Trapped in the Machine drummer Niko Quintal, who couldn't attend the private event in Vancouver, is also rumored to be returning to the project for future recordings.\n"
      ]
   },
   "coreData": [
      "Rymes with Orange is a Canadian alternative rock band which formed in 1991 in Vancouver, British Columbia, Canada. This independent band have released four albums: Peel (1992), Trapped in the Machine (1994), Crash (1999) and One More Mile (2003). They have had three Top 10 singles on Canadian Rock Radio, with sales of over 70,000 units worldwide, and have toured Canada, New Zealand, the U.S. and the U.K., all while maintaining independent status.[1]\n",
      "The band originated in the early 1990s in Prince George, British Columbia, as The Night Watchmen, by original drummer and songwriter Alex (Julien) Dias, and writing partner, guitarist Rob Lulic. Vancouver based keyboardist Bob D'Eith later joined the band. It was when lead singer Jimmy Gilmore, subsequently a member of The Silencers from Scotland, decided to leave the band to go back to Scotland, Dias, Lulic and D'Eith continued, with what would eventually become Rymes with Orange.\n",
      "In 1991, after The Night Watchmen split-up, Dias, Lulic and D'Eith joined up with UK-born lead singer Lyndon Johnson, to form Rymes With Orange in Vancouver.[1] As The Night Watchmen, the band had a more conventional alternative rock sound, while as Rymes With Orange, their style evolved more towards a Madchester-influenced dance rock alternative rock sound.[2]\n",
      "That same year, the band was a semi-finalist in Vancouver's local Demo Listen Derby competition in 1991.[3] Around this time, the band joked in promotional interviews that the apparently missing letter \"h\" in their name had been donated to the band hHead.[4]\n"
   ]
}