{
   "Name": "Rymes with Orange",
   "rawData": [
      "Rymes with Orange is a Canadian alternative rock band which formed in 1991 in Vancouver, British Columbia, Canada. This independent band have released four albums: Peel (1992), Trapped in the Machine (1994), Crash (1999) and One More Mile (2003). They have had three Top 10 singles on Canadian Rock Radio, with sales of over 70,000 units worldwide, and have toured Canada, New Zealand, the U.S. and the U.K., all while maintaining independent status.\n",
      "The band originated in the early 1990s in Prince George, British Columbia, as The Night Watchmen, by original drummer and songwriter Alex (Julien) Dias, and writing partner, guitarist Rob Lulic. Vancouver based keyboardist Bob D'Eith later joined the band. It was when lead singer Jimmy Gilmore, subsequently a member of The Silencers from Scotland, decided to leave the band to go back to Scotland, Dias, Lulic and D'Eith continued, with what would eventually become Rymes with Orange.\n",
      "In 1991, after The Night Watchmen split-up, Dias, Lulic and D'Eith joined up with UK-born lead singer Lyndon Johnson, to form Rymes With Orange in Vancouver. As The Night Watchmen, the band had a more conventional alternative rock sound, while as Rymes With Orange, their style evolved more towards a Madchester-influenced dance rock alternative rock sound.\n"
   ],
   "infobox": {
      "Also known as": [
         "R W O"
      ],
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Alternative rock"
      ],
      "Years active": [
         "1992–2017"
      ],
      "Labels": [
         "RWO Records, Citrus Soul with A&M Distribution"
      ],
      "Website": [
         "http://www.rymes.ca//"
      ],
      "Members": [
         "Lyndon Johnson",
         "Rob Lulic",
         "Steeve Hennessy",
         "Nelson Sinclair",
         "Niko Quintal",
         "Kevin Spencer"
      ],
      "Past members": [
         "Alexander Julien",
         "Bob D'Eith",
         "Trevor Grant",
         "Timothy B. Hewitt",
         "Session players:",
         "Russell Sholberg",
         "Pat Aldous",
         "David Devendish",
         "Dave O'Bray",
         "Ian Cameron",
         "Randall Stoll",
         "Paul Fournier",
         "Lee Dymburt",
         "Chad Hunt",
         "Kevin Elaschuck",
         "Joe Burke",
         "Bobby James",
         "John Webster"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band which formed in [YEAR] in Vancouver, British Columbia, Canada. This independent band have released four albums: Peel ([YEAR]), Trapped in the Machine ([YEAR]), Crash ([YEAR]) and One More Mile ([YEAR]). They have had three Top 10 singles on Canadian Rock Radio, with sales of over 70,000 units worldwide, and have toured Canada, New Zealand, the U.S. and the U.K., all while maintaining independent status.\n",
      "The band originated in the early [YEAR]s in Prince George, British Columbia, as The Night Watchmen, by original drummer and songwriter Alex ([MONTH]ien) Dias, and writing partner, guitarist Rob Lulic. Vancouver based keyboardist Bob D'Eith later joined the band. It was when lead singer [PERSON_NAME_FULL_0_MALE], subsequently a [GENRE] band to go back to Scotland, Dias, Lulic and D'Eith continued, with what would eventually become [BAND_NAME].\n",
      "In [YEAR], after The Night Watchmen split-up, Dias, Lulic and D'Eith joined up with UK-born lead singer Lyndon Johnson, to form Rymes With Orange in Vancouver. As The Night Watchmen, the band had a [GENRE] a Madchester-influenced dance rock alternative rock sound.\n"
   ]
}