{
   "Name": "Slow (band)",
   "Sections": [
      "1 Expo 86 show",
      "2 Reunion",
      "3 Legacy",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Slow is a Canadian punk rock band that started in the mid-1980s. Based in Vancouver, British Columbia, the band consisted of vocalist Thomas Anselmi, guitarists Christian Thorvaldson and Ziggy Sigmund, bassist Stephen Hamm and drummer Terry Russell.[1]\n",
         "Hamm and Russell had previously been in a West Point Grey punk band called Chuck & the Fucks, playing an infamous concert at Queen Mary Elementary in the spring of 1980 where many of the teachers forced the children to leave.\n",
         "They recorded and released their debut single, \"I Broke The Circle,\" in 1985 on Zulu Records, and followed up with the EP Against The Glass in 1986.[1]\n"
      ]
   },
   "Expo 86 show": {
      "text": [
         "Slow are known for a controversial incident which both marred the Expo 86 festivities and effectively ended the band's career. While performing their typical performance at the event's Festival of Independent Recording Artists,[1] which included Anselmi pitching two two-by-fours into the front rows' empty seats at the side of the stage,[1] Anselmi stripped off his shirt and jeans and performed in a pair of boxers, occasionally \"poking through\" the front as he adjusted his underwear; at the end of the set, Hamm dropped his shorts to his knees and, with arms raised in triumph, said goodbye to the audience while naked from the waist down.[1] In response Expo officials cut the power to the pavilion, ending the entire event.[1][2]\n",
         "The band were detained by the Vancouver police, who considered charging them with indecent exposure. Citing security concerns, Expo officials cancelled the evening's headlining concert, Poisoned featuring Art Bergmann; subsequently, the entire week-long festival was also cancelled.[3]\n",
         "Some of the fans in attendance got onstage and many in the audience refused to leave the venue. A chant of \"BCTV\" started in the crowd and a large group marched to the location of BCTV's onsite studios. The group gathered outside the studio windows, where they protested the concert's cancellation so loudly and persistently with chants of \"Expo sucks\" that the station had to pull its 11:00 pm newscast. Instead, BCTV started its late night movie early; the movie was Rock 'n Roll High School featuring the Ramones.[1]\n",
         "The band subsequently embarked on a cross-Canada tour, although the negative publicity they received as a result of the Expo show led them to split up by the time they returned to Vancouver.[1] Anselmi and Thorvaldson continued to collaborate under the band names Mo and Christian Thorvaldson's Freeze-Dried Dog before settling on the new band name © in 1988,[4] while Hamm and Russell launched Tankhog and Sigmund joined The Scramblers.[1]\n"
      ]
   },
   "Reunion": {
      "text": [
         "On November 1, 2017, the Georgia Straight carried a feature article on the band that discussed Slow's reunion.[5] It was revealed that the band was working on its first new material since 1986, recording with Dave Ogilvie. In early 2018 they performed a number of reunion shows in Vancouver and Victoria, and at Canadian Music Week in Toronto.[6]\n"
      ]
   },
   "Legacy": {
      "text": [
         "In a 1996 reader poll conducted by Chart, Against the Glass was named the 17th best Canadian album of all time, and their single \"Have Not Been the Same\" ranked as the 10th greatest Canadian song. Have Not Been the Same: The Can-Rock Renaissance 1985-1995, a 2001 book by music journalists Michael Barclay, Ian Jack and Jason Schneider about the rise of alternative rock in Canada in the late 1980s and early 1990s, also took its title from the latter song.\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Slow is a Canadian punk rock band that started in the mid-1980s. Based in Vancouver, British Columbia, the band consisted of vocalist Thomas Anselmi, guitarists Christian Thorvaldson and Ziggy Sigmund, bassist Stephen Hamm and drummer Terry Russell.[1]\n",
      "Hamm and Russell had previously been in a West Point Grey punk band called Chuck & the Fucks, playing an infamous concert at Queen Mary Elementary in the spring of 1980 where many of the teachers forced the children to leave.\n",
      "They recorded and released their debut single, \"I Broke The Circle,\" in 1985 on Zulu Records, and followed up with the EP Against The Glass in 1986.[1]\n",
      "Slow are known for a controversial incident which both marred the Expo 86 festivities and effectively ended the band's career. While performing their typical performance at the event's Festival of Independent Recording Artists,[1] which included Anselmi pitching two two-by-fours into the front rows' empty seats at the side of the stage,[1] Anselmi stripped off his shirt and jeans and performed in a pair of boxers, occasionally \"poking through\" the front as he adjusted his underwear; at the end of the set, Hamm dropped his shorts to his knees and, with arms raised in triumph, said goodbye to the audience while naked from the waist down.[1] In response Expo officials cut the power to the pavilion, ending the entire event.[1][2]\n"
   ]
}