{
   "Discography": {
      "Albums": {},
      "Compilations": {},
      "Covered by": {},
      "Singles, 7\"s, EPs": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Dimwit quit the band shortly after their first 7\" was released to join the Pointed Sticks and was replaced by Koichi Imagawa, also known as Jim Imagawa, on drums.[1]\n",
         "In 1981, Hannah left the band and gradually became involved with a small group of underground activists calling themselves Direct Action. In the alternative media they were referred to as the Vancouver 5, but in the mainstream press they were dubbed the Squamish 5.  The group, composed of ecologists and feminists, were responsible for a number of actions, including the 14 October 1982 bombing of the Litton Industries plant in Ontario which made guidance systems for cruise missiles. The Litton bombing hurt several plant workers and three police officers were also injured. While Gerry was not part of the Litton bombing, he supported it, and did take part in other actions, as well as planning to rob a Brinks truck to fund future actions. He was arrested on 20 January 1983, along with the four other members of Direct Action. Many benefits were arranged for the group by people such as Jello Biafra and Joey Shithead of D.O.A. to pay lawyers fees but, in the end, Hannah pleaded guilty to avoid years in prison. He received a 10-year sentence and was released after serving 5 years.[1][2] During his time in prison, he began writing a column for the fanzine Maximum RocknRoll which helped maintain his connection to the punk scene. A number of years after his release he was the subject of a documentary film made by B.C. filmmaker Glen Sanford, called Useless.\n",
         "After Hannah left the band, the Subhumans re-formed with Ron Allan on bass.[1] After Imagawa left the band, Dimwit was briefly back with the Subhumans before Randy Bowman joined in his place. With the line up of Wimpy Roy, Mike Graham, Ron Allan, and Randy Bowman, the Subhumans recorded the album No Wishes, No Prayers for Black Flag's SST Records. Ron Allan and Randy Bowman later went on to join the Vancouver band The Scramblers and Brian Goble went on to join D.O.A. on bass and occasional lead vocals.\n",
         "Their songs have been covered by many other bands, including D.O.A., NoMeansNo, MDC, Overkill, Jingo de Lunch, and the Vancouver band Cub, and they are highly regarded within the punk community.\n",
         "The band toured western Canada in 1995, with Hannah and Goble along with Jon Williams on guitar and David \"Salty\"  MacAnulty on drums. They released the CD Pissed Off … With Good Reason the following year.[3]\n",
         "In 2005, the Subhumans reunited with the following lineup:  Gerry Hannah on bass, Jon Card (ex-Personality Crisis, SNFU and D.O.A.) on drums, Wimpy Roy on vocals and Mike Graham on guitar.[2] They signed to Alternative Tentacles and G7 Welcoming Committee Records. A new album, New Dark Age Parade, was released in September 2006.  Death Was Too Kind, a compilation of the band's early singles and EPs, was released in 2008. In 2010, the band released the album Same Thoughts, Different Day, a re-recorded version of Incorrect Thoughts, after legal issues prevented the band from reissuing the original album.\n",
         "The Subhumans were featured in the 2010 documentary film Bloodied but Unbowed, directed by  Susanne Tabata.[4]\n",
         "On December 7, 2014, lead singer Brian Goble died of a heart attack at the age of 57.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Albums",
      "2.2 Singles, 7\"s, EPs",
      "2.3 Compilations",
      "2.4 Covered by",
      "3 See also",
      "4 References",
      "5 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "The Subhumans are a punk rock band formed in Vancouver, British Columbia, Canada in 1978.[1]\n",
         "Known by pejorative, punk rock nicknames, original members were known simply as \"Useless\" (Gerry Hannah), \"Dimwit\" (Ken Montgomery), \"Wimpy\" (Brian Roy Goble) and \"Normal\" (Mike Graham).\n"
      ]
   },
   "Title": "Subhumans (Canadian band) - Wikipedia"
}