{
   "Discography": {},
   "External links": {},
   "History": {
      "Background, formation, and Heart and Lungs (1990-1992)": {
         "text": [
            "Following the demise of his previous band The Storybook Krooks, Robert Roth auditioned to play guitar for Nirvana but they ultimately decided to continue as a trio.[2]  A month later, Roth says he met up with Pickerel as he (Roth) was beginning to write new songs for what would become his signature venture:\n",
            "After Pickerel joined, Roth claims that Quinn insisted on switching to guitar, which led to an opening for a bass player.[2] Pickerel then contacted Yamamoto, who reflects:\n",
            "Truly released their debut EP,  Heart and Lungs, through Sub Pop in 1991. This is the only recording that the band did as a quartet [3]  as Chris Quinn left shortly thereafter. Roth later commented that he and Quinn did not get along that well, saying, \"I’m more of an intuitive type, he’s more a studied type.\"[2] Truly also played on the side stage at Lollapalooza in 1992.\n"
         ]
      },
      "Fast Stories...from Kid Coma and Feeling You Up (1993-2000)": {
         "text": [
            "In 1993, Truly signed on to Capitol Records and two years later released their critically acclaimed album Fast Stories...from Kid Coma. Steve Kurutz of  AllMusic gave the album four and a half stars, calling it \"a loosely based concept album filled with overdriven guitar and the soothing yet slightly menacing voice of singer Robert Roth.\"[4] The track \"Hot Summer 1991\" is also featured on the compilation album Subject to Change: Artists for a Hate-Free America'.  Robert Roth has deemed Fast Stories…from Kid Coma his favorite, saying:\n",
            "Hiro Yamamoto commented on the album:\n",
            "Roth claims he later edited a single version of the album’s opening track \"Blue Flame Ford\" so that  Stories would get more exposure but instead the band was sent back to the studio to begin working on their next album, Feeling You Up. At this point, the band became fed up by the lack of support they were getting from Capitol Records. They switched to a smaller, independent label called Thick Records and released Feeling You Up in 1997.[6][7] Greg Prato of AllMusic gave Feeling You Up four stars, calling it \"an incredibly solid album, which easily could have fit into MTV and rock radio play lists at the time, if both outlets weren't so obsessed with Limp Bizkit and Everclear.\"[7] \nThe band toured briefly in support of Feeling You Up in the U.S. but had to cancel halfway through as Roth said Pickerel had some personal issues to take care of and the band broke up shortly afterward.\n"
         ]
      },
      "Twilight Curtains and post-Truly (2000-present)": {
         "text": [
            "The band's final release, Twilight Curtains , a mixture of new and unreleased songs and demos, was released in Europe in 2000 through the independent label, Cargo/Headhunter U.K. \"While it’s  expectedly not on par with their woefully overlooked 1995 masterpiece, Fast Stories from Kid Coma,\" writes Greg Prato, \"Twilight Curtains is still highly recommended to longtime fans.\" [8]\n",
            "In 2004, Robert Roth released his solo album Someone Somewhere....\n",
            "In 2008, the band began touring and were said to be working on another album. In October 2013, the band premiered their new single titled \"Wheels on Fire\".\n",
            "In 2014, Fast Stories...from Kid Coma came in at #3 on a \"Top 10 Underrated 90’s Alternative Rock Albums\" list at the Alternative Nation website.[9]\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Background, formation, and Heart and Lungs (1990-1992)",
      "1.2 Fast Stories...from Kid Coma and Feeling You Up (1993-2000)",
      "1.3 Twilight Curtains and post-Truly (2000-present)",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Truly is an American rock band formed in the wake of the grunge era.[1] It featured singer-guitarist Robert Roth,  bassist Hiro Yamamoto, and drummer Mark Pickerel.[1] Yamamoto and Pickerel were founding members respectively of Soundgarden and Screaming Trees. While not a commercially successful group like some of their Seattle contemporaries, the band lasted a decade with two studio albums to their name.\n"
      ]
   },
   "Title": "Truly (band) - Wikipedia"
}