{
   "Name": "Truly (band)",
   "rawData": [
      "Truly is an American rock band formed in the wake of the grunge era. It featured singer-guitarist Robert Roth,  bassist Hiro Yamamoto, and drummer Mark Pickerel. Yamamoto and Pickerel were founding members respectively of Soundgarden and Screaming Trees. While not a commercially successful group like some of their Seattle contemporaries, the band lasted a decade with two studio albums to their name.\n",
      "Following the demise of his previous band The Storybook Krooks, Robert Roth auditioned to play guitar for Nirvana but they ultimately decided to continue as a trio.  A month later, Roth says he met up with Pickerel as he (Roth) was beginning to write new songs for what would become his signature venture:\n",
      "After Pickerel joined, Roth claims that Quinn insisted on switching to guitar, which led to an opening for a bass player. Pickerel then contacted Yamamoto, who reflects:\n"
   ],
   "infobox": {
      "Origin": [
         "Seattle, Washington, United States"
      ],
      "Genres": [
         "Grunge, psychedelic rock, alternative rock"
      ],
      "Years active": [
         "1990–1998 (hiatus), 2000, 2008–present"
      ],
      "Labels": [
         "Sub Pop, Capitol, Thick, Flotation"
      ],
      "Associated acts": [
         "Screaming Trees, Soundgarden, Storybook Krooks"
      ],
      "Members": [
         "Robert Roth",
         "Mark Pickerel",
         "Hiro Yamamoto"
      ],
      "Past members": [
         "Chris Quinn"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in the wake of the grunge era. It featured singer-guitarist Robert Roth,  bassist [PERSON_NAME_FULL_0_FEMALE], and drummer [MONTH]k Pickerel. [PERSON_NAME_LAST_0] and Pickerel were founding members respectively of Soundgarden and Screaming Trees. While not a commercially successful group like some of their Seattle contemporaries, the band lasted a decade with two studio albums to their name.\n",
      "Following the demise of his previous band The Storybook Krooks, Robert Roth auditioned to play guitar for Nirvana but they ultimately decided to continue as a trio.  A month later, Roth says he met up with Pickerel as he (Roth) was beginning to write new songs for what would become his signature venture:\n",
      "After Pickerel joined, Roth claims that Quinn insisted on switching to guitar, which led to an [GENRE] a bass player. Pickerel then contacted Yamamoto, who reflects:\n"
   ]
}