{
   "Name": "The Veer Union",
   "Sections": [
      "1 History",
      "1.1 Time to Break  the Spell as \"Veer\" (2004-2007)",
      "1.2 Against the Grain (2008-2010)",
      "1.3 Divide the Blackened Sky (2011-2012)",
      "1.4 Life Support Part 1 and Decade (2013-2020)",
      "1.5 Slaves To The System (2020-present)",
      "2 Musical style and influences",
      "3 Members",
      "3.1 Timeline",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Compilation albums",
      "4.3 EPs",
      "4.4 Singles",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Veer Union is a Canadian rock band from Vancouver, British Columbia. They have released four studio albums, Time to Break the Spell (2006), Against the Grain (2009), Divide the Blackened Sky (2012), and an EP Life Support Part 1 (2013). Their fourth studio album, Decade, was released on January 29, 2016.\n"
      ]
   },
   "History": {
      "Time to Break the Spell as \"Veer\" (2004-2007)": {},
      "Against the Grain (2008-2010)": {
         "text": [
            "Before releasing their debut album, they recorded and released a self-titled EP containing alternate versions of songs on their debut, and unreleased songs as well. The band released their debut album, Against the Grain, on April 21, 2009. Against the Grain has reached number 32 on Billboard's Top Heatseekers,[11] and its first single, Seasons, has reached number 10 on Billboard's Hot Mainstream Rock Tracks chart,[12] number 16 on the Rock Songs chart and number 30 on the Alternative Songs chart. \"Seasons\" was also the official theme song for WWE Backlash 2009, Pittsburgh Penguins,[13][14]\n",
            "From July to September, the band supported Sick Puppies and Hurt in a tour throughout the U.S,[15] and then later toured with Cavo and Framing Hanley.\n",
            "Despite the band's success with the album, the single \"Seasons\", and reports of the band getting along very well with their record label,[16] the band was dropped from the label after touring in support of the album ended.[17]\n"
         ]
      },
      "Divide the Blackened Sky (2011-2012)": {
         "text": [
            "Despite being dropped by Universal Records, the band decided to continue on without major record label support. In 2011, the band announced the title of their second album would be Divide the Blackened Sky, and would be released on smaller label Rocket Science Ventures/Red Distribution. In 2011, they held a contest to have fans submit artwork to be picked to be on the album's front cover.[18] Divide the Blackened Sky was released on March 26, 2012,[19] and the first single was \"Bitter End\".[19] Frontman Crispin Earl said of the album, \"\"Our new record, Divide The Blackened Sky, is a much darker and heavier effort than our previous works. It depicts all the hard times we have been through over the last couple of years.\"[19]\n",
            "On February 22, 2012, it was announced that bassist Marc Roots and guitarist James Fiddler left the band.[17] The band chose to use their previous bass tech, Winston Wolfe, as a touring replacement on bass, and decided to not find a replacement for Fiddler as the second guitarist, opting to continue as a four-piece band.[17] In April 2012, the band toured with My Darkest Days and Cavo. In July 2012, the band announced intentions on releasing a fourth studio album, for release some time in 2013.[20]\n"
         ]
      },
      "Life Support Part 1 and Decade (2013-2020)": {
         "text": [
            "In early 2013, the band started a Kickstarter to help raise money towards working on future music. The band met the goal, and then began working on material in Edmonton, AB for an upcoming release, titled Life Support Part 1, which was released on December 10, 2013.\n",
            "In December 2015, the band announced that they would be releasing a fourth album, consisting of Earl and an all new lineup, entitled Decade, on January 29, 2016. The First single, \"Defying Gravity\", was released in the same month. The release coincides with the tenth anniversary of their first album, Time to Break the Spell, and consists of five reworked unreleased tracks that were written prior to the first album, and five tracks that are completely new.[21] In addition to Earl, new members include Ryan Ramsdell on rhythm guitar, Dan Sittler on lead guitar, Tyler Reimer on drums, and Amal Wijayanayake on bass guitar and screamed vocals.[21]\n",
            "In early 2016, the ensemble travelled the southern, southeastern and Midwestern United States along with Bridge to Grace, Bobaflex and Artifas.[22]\n"
         ]
      },
      "Slaves To The System (2020-present)": {
         "text": [
            "In August 2020, the band release a new single titled Slaves to the System with the album planning to come out early spring next year in 2021. https://theveerunion.com/bio. Missing or empty |title= (help)</ref>\n"
         ]
      },
      "text": [
         "\nThe band was formed in 2004 by founders Crispin Earl, and Eric Schraeder, under the original name of \"Veer\".[6]  The band released one independent album, Time to Break the Spell, in 2006.  After the album's release, and  touring with bands like Hinder, Theory of a Deadman, Seether and Black Stone Cherry, the band was able to attract major label interest, and signed a record deal with Universal Motown Records.[7] Once signing to the label, the band decided to change their name to \"The Veer Union\". The band explained that it wasn't legal problems, but rather getting away from negative situations and coming together in a more positive one.[8] ",
         "\"It was more of a band decision. Before TVU we were all in other bands and not digging the situations we were in. So we \"veered\" away from the negativity and came together as a \"Union\". Originally it was Veer, when we got signed, we added the Union.\"[9] ",
         "After the band received major record label attention, the album was re-issued in August 2011.[10]\n"
      ]
   },
   "Musical style and influences": {
      "text": [
         "The band's musical style is most commonly described as hard rock[2][3][23] or post-grunge.[4][24] They have also been described as alternative rock.[5] The band used to employ a style of dual harmonized vocals, typically between vocalist Crispin Earl and Eric Schraeder in a similar style to the band Alice in Chains,[25] until Schraeder left in 2013, leaving vocals to only Crispin Earl. Earl has mentioned other influences of the band as Led Zeppelin,[26] Soundgarden,[25] and Rush.[26]\n"
      ]
   },
   "Members": {
      "Timeline": {}
   },
   "Discography": {
      "Studio albums": {},
      "Compilation albums": {},
      "EPs": {},
      "Singles": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Veer Union is a Canadian rock band from Vancouver, British Columbia. They have released four studio albums, Time to Break the Spell (2006), Against the Grain (2009), Divide the Blackened Sky (2012), and an EP Life Support Part 1 (2013). Their fourth studio album, Decade, was released on January 29, 2016.\n",
      "\nThe band was formed in 2004 by founders Crispin Earl, and Eric Schraeder, under the original name of \"Veer\".[6]  The band released one independent album, Time to Break the Spell, in 2006.  After the album's release, and  touring with bands like Hinder, Theory of a Deadman, Seether and Black Stone Cherry, the band was able to attract major label interest, and signed a record deal with Universal Motown Records.[7] Once signing to the label, the band decided to change their name to \"The Veer Union\". The band explained that it wasn't legal problems, but rather getting away from negative situations and coming together in a more positive one.[8] ",
      "\"It was more of a band decision. Before TVU we were all in other bands and not digging the situations we were in. So we \"veered\" away from the negativity and came together as a \"Union\". Originally it was Veer, when we got signed, we added the Union.\"[9] ",
      "After the band received major record label attention, the album was re-issued in August 2011.[10]\n"
   ]
}