{
   "Name": "The Veer Union",
   "rawData": [
      "The Veer Union is a Canadian rock band from Vancouver, British Columbia. They have released four studio albums, Time to Break the Spell (2006), Against the Grain (2009), Divide the Blackened Sky (2012), and an EP Life Support Part 1 (2013). Their fourth studio album, Decade, was released on January 29, 2016.\n",
      "\nThe band was formed in 2004 by founders Crispin Earl, and Eric Schraeder, under the original name of \"Veer\".  The band released one independent album, Time to Break the Spell, in 2006.  After the album's release, and  touring with bands like Hinder, Theory of a Deadman, Seether and Black Stone Cherry, the band was able to attract major label interest, and signed a record deal with Universal Motown Records. Once signing to the label, the band decided to change their name to \"The Veer Union\". The band explained that it wasn't legal problems, but rather getting away from negative situations and coming together in a more positive one. ",
      "\"It was more of a band decision. Before TVU we were all in other bands and not digging the situations we were in. So we \"veered\" away from the negativity and came together as a \"Union\". Originally it was Veer, when we got signed, we added the Union.\" "
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Alternative metal[1] Hard rock,[2][3] post-grunge[4] alternative rock[5]"
      ],
      "Years active": [
         "2004 - present"
      ],
      "Labels": [
         "Rock Shop Entertainment",
         "Pavement Entertainment",
         "Universal Motown"
      ],
      "Website": [
         "theveerunion.com"
      ],
      "Members": [
         "Crispin Earl",
         "Ryan Ramsdell",
         "Ricardo Viana"
      ],
      "Past members": [
         "James Fiddler",
         "Marc Roots",
         "Neil Beaton",
         "Eric Schraeder",
         "Tyler Reimer",
         "Amal Wijayanayake",
         "Dan Sittler"
      ]
   }
}