{
   "Name": "West End Girls (Canadian band)",
   "rawData": [
      "West End Girls were a Canadian pop band and girl group formed in 1990 in Vancouver, British Columbia.\n",
      "The band was formed in Vancouver by producers John Dexter and John Livingston, and consisted of three teenaged girls, Camille Henderson, Aimee MacKenzie and Silvana Petrozzi. After several months of performing lessons with Henderson's father Bill Henderson, the lead singer of rock group Chilliwack, the trio recorded and released their debut album, West End Girls, on Johnny Jet Records in 1991. That album produced the Canadian Top 10 hits \"Not Like Kissing You\" and \"I Want U Back\" (a remake of the Jackson 5 hit), as well as the Top 40 singles \"Say You'll Be Mine\" and \"Show Me The Way\".\n",
      "Petrozzi left the band in 1992, and was replaced by Janele Woodley. In 1993, shortly before the release of the group's second album, Henderson also left and was replaced by Celia-Louise Martin. In 1993, the band's new lineup released the album We Belong Together, which included the singles  \"R U Sexin' Me\", \"Pure\", and \"Sexy'\". Their second album wasn't as successful as their first one and they broke up the following year. Shortly afterwards, the group's record label released a remix album of some of their earlier hits.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia Canada"
      ],
      "Genres": [
         "R&B / Pop"
      ],
      "Years active": [
         "1990 (1990)–1994 (1994)"
      ],
      "Labels": [
         "A&M Canada"
      ],
      "Members": [
         "Camille Henderson",
         "Aimee MacKenzie",
         "Silvana Petrozzi",
         "Janele Woodley",
         "Celia-Louise Martin"
      ]
   },
   "prunedData": [
      "[BAND_NAME] were a [GENRE] band and girl group formed in [YEAR] in Vancouver, British Columbia.\n",
      "The band was formed in Vancouver by producers [PERSON_NAME_FIRST_1] Dexter and [PERSON_NAME_FULL_1_MALE], and consisted of three teenaged girls, [PERSON_NAME_FULL_0_FEMALE], Aimee MacKenzie and [PERSON_NAME_FULL_2_FEMALE]. After several months of performing lessons with [PERSON_NAME_LAST_0]'s father Bill [PERSON_NAME_LAST_0], the lead singer of rock group Chilliwack, the trio recorded and released their debut album, [BAND_NAME], on [PERSON_NAME_FIRST_1]ny [PERSON_NAME_LAST_3] Records in [YEAR]. That album produced the Canadian Top 10 hits \"Not Like Kissing You\" and \"I Want U Back\" (a remake of the Jackson 5 hit), as well as the Top 40 singles \"Say You'll Be Mine\" and \"Show Me The Way\".\n",
      "Petrozzi left the band in [YEAR], and was replaced by [MONTH]ele Woodley. In [YEAR], shortly before the release of the group's second album, Henderson also left and was replaced by Celia-Louise [MONTH]tin. In [YEAR], the band's new lineup released the album We Belong Together, which included the singles  \"R U Sexin' Me\", \"Pure\", and \"Sexy'\". Their second album wasn't as successful as their first one and they broke up the following year. Shortly afterwards, the group's record label released a [GENRE]"
   ]
}