{
   "Name": "Zimmers Hole",
   "Sections": [
      "1 History",
      "1.1 Bound by Fire",
      "1.2 Legion of Flames",
      "1.3 When You Were Shouting at the Devil...",
      "1.4 Hiatus and reformation",
      "2 Members",
      "2.1 Current members",
      "2.2 Former members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "\n",
         "Zimmers Hole is a Canadian heavy metal band from Vancouver. The band formed in 1991, and features former Strapping Young Lad members Byron Stroud, Jed Simon and Gene Hoglan, along with vocalist Chris Valagao.\n"
      ]
   },
   "History": {
      "Bound by Fire": {
         "text": [
            "Zimmers Hole began life as a side project for members and friends of Strapping Young Lad. The band's debut album Bound by Fire was produced by Devin Townsend and released on his label Hevy Devy Records. The band was named after the sphincter of the band's late mutual friend Dean Zimmer, who would chase other people with his buttcheeks spread during parties.[2][3] Lyrics took inspiration from comedic anecdotes from tours past,[4] backed by middle-of-the-road \"metal flying V riffs\", usually stolen from Kiss and Morbid Angel. Details of the bizarre back stories for all the songs were provided by Chris Valagao (\"'Gospel Sodomy Boy on Blow' is about an asshole called Troy who wouldn't stop doing coke and spouting about Jesus\") and posted on the official Strapping Young Lad forums by Tracy Turner around 1999.[citation needed]\n"
         ]
      },
      "Legion of Flames": {
         "text": [
            "In 2001, when Strapping Young Lad finished touring, Jed Simon and Byron Stroud had Townsend to produce the second album, Legion of Flames. It was released on Townsend's label Hevy Devy Records. Legion of Flames included song parodies such as \"Gender of the Beast\" (\"Number of the Beast\", Iron Maiden), \"Sodomanaz\" (\"Go for a Soda\", Kim Mitchell), and a spoof of Metallica's \"Master of Puppets\" in the song \"Evil Robots\", with the line \"Napster, Napster, where's the cash that I've been after?\". The album also contained a cover of Joni Mitchell's \"This Flight Tonight\", with humorously altered lyrics.\n"
         ]
      },
      "When You Were Shouting at the Devil...": {
         "text": [
            "In August 2007, Zimmers Hole signed with Century Media Records for the release of the band's third studio album.[5] Stroud and Simon said:\n",
            "Now with Zimmers Hole signing a fresh, new deal with Century Media, we have decided to give this band our full and undivided attention. No more 'side-project' status here; the men of the HOLE are fired up like a city on fire and we entered Vancouver's famed Armoury Studios today to begin tracking the new release. [...] As you can see, it's all about having a good time with the HOLE. Make no mistake though, we are very serious about our love of metal; it made us who we are, and we wear our influences on our sleeves proudly. We are now more focused than ever before and are so excited about the new album. So excited in fact, that the combined length of our erections may just reach out and touch ya![5]",
            "Shortly after, drummer Steve Wheeler left the band, and in December 2007 was replaced by Gene Hoglan, another former Strapping Young Lad member. Hoglan joined in time to start recording the new album.[6] With this roster, Zimmers Hole includes three former Strapping Young Lad members, and Townsend is involved as vocal producer.[7] The band entered Vancouver's Armoury Studios in the same month to record the album. When You Were Shouting at the Devil... We Were in League with Satan was released on March 11, 2008, through Century Media Records.[8]\n",
            "In an interview with MTV on April 2008, Valagao explained the origin of the album's name:\n",
            "I believe David Vincent of Morbid Angel was having a conversation with one of the guys from Forbidden,\" he recalled. \"They were drinking and fucking around, and they got into this argument over who's more metal. The dude from Forbidden, at one point, turned to Dave and said, \"Dude, when you were shouting at the devil [a reference to Mötley Crüe], I was in league with Satan [a reference to Venom],\" and Jed was in the room and picked up on that. So we started saying it as a joke. That little statement applies to a whole bunch of shit. Basically, \"When you were a poseur, I was the real deal\".[9]"
         ]
      },
      "Hiatus and reformation": {
         "text": [
            "The band's activity waned after their third album, but a new live appearance was announced for 2016.[10] In March 2016, Simon announced that Meldrum guitarist Laura Christine has joined the band.[11] The band is currently working on their next album.[12]\n"
         ]
      }
   },
   "Members": {
      "Current members": {},
      "Former members": {}
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Zimmers Hole is a Canadian heavy metal band from Vancouver. The band formed in 1991, and features former Strapping Young Lad members Byron Stroud, Jed Simon and Gene Hoglan, along with vocalist Chris Valagao.\n",
      "Zimmers Hole began life as a side project for members and friends of Strapping Young Lad. The band's debut album Bound by Fire was produced by Devin Townsend and released on his label Hevy Devy Records. The band was named after the sphincter of the band's late mutual friend Dean Zimmer, who would chase other people with his buttcheeks spread during parties.[2][3] Lyrics took inspiration from comedic anecdotes from tours past,[4] backed by middle-of-the-road \"metal flying V riffs\", usually stolen from Kiss and Morbid Angel. Details of the bizarre back stories for all the songs were provided by Chris Valagao (\"'Gospel Sodomy Boy on Blow' is about an asshole called Troy who wouldn't stop doing coke and spouting about Jesus\") and posted on the official Strapping Young Lad forums by Tracy Turner around 1999.[citation needed]\n",
      "In 2001, when Strapping Young Lad finished touring, Jed Simon and Byron Stroud had Townsend to produce the second album, Legion of Flames. It was released on Townsend's label Hevy Devy Records. Legion of Flames included song parodies such as \"Gender of the Beast\" (\"Number of the Beast\", Iron Maiden), \"Sodomanaz\" (\"Go for a Soda\", Kim Mitchell), and a spoof of Metallica's \"Master of Puppets\" in the song \"Evil Robots\", with the line \"Napster, Napster, where's the cash that I've been after?\". The album also contained a cover of Joni Mitchell's \"This Flight Tonight\", with humorously altered lyrics.\n",
      "In August 2007, Zimmers Hole signed with Century Media Records for the release of the band's third studio album.[5] Stroud and Simon said:\n"
   ],
   "infobox": {
      "Also known as": [
         "ZH, The Hole"
      ],
      "Origin": [
         "Vancouver, British Columbia, Canada"
      ],
      "Genres": [
         "Extreme metal, comedy rock[1]"
      ],
      "Years active": [
         "1991–present"
      ],
      "Labels": [
         "Century Media, Hevydevy"
      ],
      "Associated acts": [
         "Strapping Young Lad, Tenet, Fear Factory"
      ],
      "Members": [
         "Chris Valagao",
         "Jed Simon",
         "Byron Stroud",
         "Gene Hoglan"
      ],
      "Past members": [
         "Steve Wheeler",
         "Will Campagna",
         "Chris Stanley"
      ]
   }
}