{
   "Name": "The Zolas",
   "Sections": [
      "1 History",
      "1.1 2009–2011: Formation and Tic Toc Tic",
      "1.2 2012–2014: Ancient Mars",
      "1.3 2015–2019: Swooner",
      "1.4 2020-present: Z Days and fourth album",
      "2 Discography",
      "2.1 Albums",
      "2.2 EPs",
      "2.3 Singles",
      "3 See also",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "[1]The Zolas are a Canadian indie rock band based in Vancouver, British Columbia. They are signed to Light Organ Records. The core of the band is duo Zachary Gray (vocals/guitar) and Tom Dobrzanski (piano), with other musicians supporting them live and on record.\n"
      ]
   },
   "History": {
      "2009–2011: Formation and Tic Toc Tic": {
         "text": [
            "Zachary Gray and Tom Dobrzanski were previously part of the band Lotus Child, from 2003 to 2008. Gray is the son of writer and composer John MacLachlan Gray.[2]\n",
            "The Zolas' debut album, Tic Toc Tic, was released in November 2009. The album was produced by Howard Redekopp, who has worked with The New Pornographers and Tegan and Sara. The album was recorded for most part in a studio Dobrzanski constructed in his parents' basement while he was studying at the University of British Columbia. Other Vancouver bands such as Said the Whale and Hey Ocean! have also recorded there.[2] The song \"The Great Collapse\" has been in rotation on CBC Radio 3.[3]\n",
            "Five tracks from 'Tic Toc Tic' have been heavily rotated on XM satellite radio station The Verge (\"The Great Collapse\", \"You're Too Cool\", \"Body Ash\", \"No Talking\", and \"Marlaina Kamikaze\").  Despite being a relative newcomer, The Zolas were the 4th-most heavily tracked band on the Verge for the first half of 2010. The Zolas were also nominated for Album of the Year at The Verge XM Awards in 2011.\n"
         ]
      },
      "2012–2014: Ancient Mars": {
         "text": [
            "The Zolas' second album, Ancient Mars, was released on October 2, 2012.  The duo's track \"Knot in My Heart\" from Ancient Mars was heard in the background on an episode of the TV program \"Whitney\" on NBC on 2/20/13. \nThe song the album was named after, Ancient Mars, was written by vocalist and guitarist Zachary Gray while he was a student in the faculty of Commerce at the University of British Columbia. Gray revealed it was written at the University of British Columbia's Irving K. Barber Library during his time as a student when the Zolas headlined an event at Koerner's Pub at the University of British Columbia in March 2019.\n"
         ]
      },
      "2015–2019: Swooner": {
         "text": [
            "After touring with Ancient Mars, the Zolas began work on new material, releasing \"Invisible\" in 2013 as a standalone single. While working on material for a new full-length, Gray collaborated with Carly Rae Jepsen, writing the song \"LA Hallucinations\" from 2015's Emotion.[4] On October 2, 2015, the band released its four-song EP, Wino Oracle EP, teasing three songs from their third studio album, as well as a B-side called \"Island Life\".\n",
            "Gray and Dobrzanski united with new members Cody Hiles and Dwight Abell, and the Zolas began touring again during mid-2015. In January 2016, the band released a new single, \"Swooner\", to announce its third studio album of the same name,[5] which was released on March 4, 2016.\n"
         ]
      },
      "2020-present: Z Days and fourth album": {
         "text": [
            "On June 8, 2020, the Zolas announced they would release their fourth studio album later in the year following a promotion of singles, dubbed Z Days. The band would release one single a month at the end of the month until the end of summer 2020.[6] The singles released from the album, in order of release, included \"Energy Czar,\" \"Come Back to Life,\" and \"Ultramarine.\"\n"
         ]
      }
   },
   "Discography": {
      "Albums": {},
      "EPs": {},
      "Singles": {}
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "[1]The Zolas are a Canadian indie rock band based in Vancouver, British Columbia. They are signed to Light Organ Records. The core of the band is duo Zachary Gray (vocals/guitar) and Tom Dobrzanski (piano), with other musicians supporting them live and on record.\n",
      "Zachary Gray and Tom Dobrzanski were previously part of the band Lotus Child, from 2003 to 2008. Gray is the son of writer and composer John MacLachlan Gray.[2]\n",
      "The Zolas' debut album, Tic Toc Tic, was released in November 2009. The album was produced by Howard Redekopp, who has worked with The New Pornographers and Tegan and Sara. The album was recorded for most part in a studio Dobrzanski constructed in his parents' basement while he was studying at the University of British Columbia. Other Vancouver bands such as Said the Whale and Hey Ocean! have also recorded there.[2] The song \"The Great Collapse\" has been in rotation on CBC Radio 3.[3]\n",
      "Five tracks from 'Tic Toc Tic' have been heavily rotated on XM satellite radio station The Verge (\"The Great Collapse\", \"You're Too Cool\", \"Body Ash\", \"No Talking\", and \"Marlaina Kamikaze\").  Despite being a relative newcomer, The Zolas were the 4th-most heavily tracked band on the Verge for the first half of 2010. The Zolas were also nominated for Album of the Year at The Verge XM Awards in 2011.\n"
   ]
}