{
   "Name": "Current Swell",
   "Sections": [
      "1 History",
      "1.1 Influences",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Extended plays",
      "2.3 Compilation appearances",
      "3 Personnel",
      "4 Extended Family",
      "5 Previous Members",
      "6 References"
   ],
   "Summary": {
      "text": [
         "Current Swell is a Canadian indie rock band from Victoria, British Columbia, Canada. To date, the band has released a total of seven albums; So I Say, Trust Us Now, Protect Your Own, Long Time Ago, Ulysses, When to Talk and When to Listen and Buffalo.[1]\n"
      ]
   },
   "History": {
      "Influences": {
         "text": [
            "The band's albums So I Say, Trust Us Now, and Protect Your Own were inspired predominantly by their experiences travelling. However, the people in the band's life, friends, strangers, and fans who have been a part of their journey and development as artists have influenced their album Long Time Ago.\n"
         ]
      },
      "text": [
         "Current Swell's roots lie on the west coast of Canada in Victoria, British Columbia, on Vancouver Island. The band's members consist of Scott Stanton, Dave Lang, Louis Sadava and Chris Petersen.[2] Originally a group of friends hanging out, jamming, and writing music, the band began performing in backyards and on beaches, and has gained popularity through the likes of its online presence and dedicated Internet fan base. The band has been noted for its authenticity and for remaining true to its upbeat folk roots.\n",
         "Current Swell sold out the very first show they played as a band. The band had released a short, five song ep on the internet that teenagers enrolled in a high school up island got a hold of. The band had booked a show at a local coffee shop in hopes of playing in front of two, or three people but ended up playing in front of a packed audience.\n",
         "The band credits much of their success to their fans, particularly the online community. Their song Young and Able (2009) became an Internet hit through its popularization on YouTube. The Internet has contributed significantly to the Canadian west coast band's large following in South America, particularly Brazil, where it headlined in Rio de Janeiro and São Paulo in 2012.\n",
         "Current Swell has opened for bands like The Beach Boys, Xavier Rudd, Dispatch, Bedouin Soundclash and The Beautiful Girls, and has made appearances at the 2010 Winter Olympics and the Ottawa Blues Festival.[3]\n",
         "In 2011, Current Swell placed first at Vancouver's Peak Performance Project, winning the $100,500 top prize. The band also played one of the largest concerts of its kind in Victoria at a Canada Day concert for 45,000 people at the B.C. Legislature.\n",
         "The band's sound combines the musical styles of folk, rock, roots, blues, reggae, and ska. The band's sound has also been described as \"surf rock.\"[4]\n",
         "In 2014, it was announced that the band would be releasing their fourth studio album on May 6, entitled Ulysses. The album was produced by Nathan Sabatino (Dr. Dog, White Rabbits) at Vancouver's Greenhouse Studios. The first single was the third track on the album, called Rollin'.  Rollin' is also featured in TGR's 2015 feature unReal.\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Extended plays": {},
      "Compilation appearances": {}
   },
   "Personnel": {},
   "Extended Family": {},
   "Previous Members": {
      "text": [
         "\n"
      ]
   },
   "References": {},
   "coreData": [
      "Current Swell is a Canadian indie rock band from Victoria, British Columbia, Canada. To date, the band has released a total of seven albums; So I Say, Trust Us Now, Protect Your Own, Long Time Ago, Ulysses, When to Talk and When to Listen and Buffalo.[1]\n",
      "Current Swell's roots lie on the west coast of Canada in Victoria, British Columbia, on Vancouver Island. The band's members consist of Scott Stanton, Dave Lang, Louis Sadava and Chris Petersen.[2] Originally a group of friends hanging out, jamming, and writing music, the band began performing in backyards and on beaches, and has gained popularity through the likes of its online presence and dedicated Internet fan base. The band has been noted for its authenticity and for remaining true to its upbeat folk roots.\n",
      "Current Swell sold out the very first show they played as a band. The band had released a short, five song ep on the internet that teenagers enrolled in a high school up island got a hold of. The band had booked a show at a local coffee shop in hopes of playing in front of two, or three people but ended up playing in front of a packed audience.\n",
      "The band credits much of their success to their fans, particularly the online community. Their song Young and Able (2009) became an Internet hit through its popularization on YouTube. The Internet has contributed significantly to the Canadian west coast band's large following in South America, particularly Brazil, where it headlined in Rio de Janeiro and São Paulo in 2012.\n"
   ]
}