{
   "Name": "Dayglo Abortions",
   "rawData": [
      "The Dayglo Abortions (sometimes abbreviated to DGA) are a Canadian hardcore punk and metal band from Victoria, British Columbia. Their lyrics reflect a genre-typical disregard for societal norms. The band was formed in 1979 and released a first album in 1981. The band has sold 500,000+ copies worldwide since their first release. The band's biography, Argh Fuck Kill: The Story of the Dayglo Abortions, by the author Chris Walter, was published in 2010 by Gofuckyerself Press. Gymbo Jak, the lead singer from 1994 to 2007, also sang for the Toronto-based Maximum RNR.\n",
      "The band is known for its graphic album covers. In 1988, a police officer in Nepean, Ontario, instigated a criminal investigation of the Dayglos after his daughter brought home a copy of Here Today, Guano Tomorrow. Obscenity charges were laid against the Dayglo Abortion's record label, Fringe Product, (carried by Alternative Tentacles in the US and embroiling Dead Kennedys frontman Jello Biafra in the battle for freedom of speech) and the label's record store, Record Peddler, but those charges were cleared in 1990.\n",
      "On their 2004 album, the Dayglos showed a new-found political awareness. Holy Shiite has song titles such as \"America Eats Her Young\", \"Christina Bin Laden\", \"Scientology\", and \"Where's Bin Laden?\".\n"
   ],
   "infobox": {
      "Origin": [
         "Victoria, British Columbia, Canada"
      ],
      "Genres": [
         "Punk rock, hardcore punk, crossover thrash, heavy metal[1]"
      ],
      "Years active": [
         "1979–present"
      ],
      "Labels": [
         "Fringe Product",
         "God Records"
      ],
      "Associated acts": [
         "Bunchofuckingoofs, Lummox,"
      ],
      "Members": [
         "The Cretin",
         "Matt Fiorito",
         "Blind Marc"
      ]
   },
   "albums": [
      "Out of the Womb",
      "Feed Us a Fetus",
      "Here Today, Guano Tomorrow",
      "Two Dogs Fucking - Deux Chiens Fourrent",
      "Little Man in the Canoe",
      "Corporate Whores",
      "Stupid World, Stupid Songs",
      "Death Race 2000",
      "Holy Shiite",
      "Live 2011 AD",
      "Armageddon Survival Guide"
   ]
}