{
   "Name": "Frog Eyes",
   "Sections": [
      "1 History",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Frog Eyes was an indie rock band from Victoria, British Columbia, Canada fronted by Carey Mercer. Their 2010 album Paul's Tomb: A Triumph was a longlisted nominee for the 2010 Polaris Music Prize.[1] They have released eight albums and two EPs[2] and are noted for their collaboration with Dan Bejar of Destroyer.\n"
      ]
   },
   "History": {
      "text": [
         "Frog Eyes is led by singer/songwriter/guitarist Carey Mercer.[3] Drummer Melanie Campbell and Mercer are married, and were Frog Eyes' only two permanent members.[4] Campbell is originally from Penticton, British Columbia, as is former member Spencer Krug.\n",
         "Mercer's prior band Blue Pine, with drummer Lily Fawn and Frog Eyes bassist Michael Rak, released two records, although the second remained unreleased during the band's existence, instead being released as a bonus album appended to the reissue of Frog Eyes' debut, The Bloody Hand. Mercer also has a solo project, Blackout Beach, and has released four albums and a single under that name. Alternate versions of four Blackout Beach songs appear on Frog Eyes releases. In 2003 they released The Golden River,[5] which appeared on the !earshot National Top 50 chart in August that year.[6]\n",
         "Frog Eyes performed with Destroyer in live shows and on Dan Bejar's album Notorious Lightning & Other Works. This collaboration led to the formation of Swan Lake, a songwriter's project with Dan Bejar of Destroyer/The New Pornographers and Spencer Krug of Sunset Rubdown/Wolf Parade. Frog Eyes performed at Wavelength No. 177 in August 2003 (Wavelength Music Arts Projects). In 2007 the band released Tears of the Valedictorian.[7]\n",
         "On April 26, 2010, Frog Eyes released their fifth full-length studio album, Paul's Tomb: A Triumph, in the UK. It was released a day later in the US. It is the band's first release on Bloomington, Indiana indie label Dead Oceans.[8] Around the same time Mercer and Campbell had a son. Carey's Cold Spring, Frog Eyes' sixth album did not feature Campbell and she was temporarily replaced by Matt Skillings.[4] The album was long listed for the 2014 Polaris Music Prize Award.[1]\n",
         "Frog Eyes' seventh studio album, Pickpocket's Locket, was released on August 28, 2015. The first single, Joe With the Jam, was released on June 29, 2015.[9] The second single, Two Girls, released on August 6, 2015, was selected for the top 10 tracks of the week by Consequence of Sound.[10]\n",
         "In March 2018, the band announced it would release its final album, Violet Psalms, accompanied by a farewell tour ending in July of the same year.[11]\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Frog Eyes was an indie rock band from Victoria, British Columbia, Canada fronted by Carey Mercer. Their 2010 album Paul's Tomb: A Triumph was a longlisted nominee for the 2010 Polaris Music Prize.[1] They have released eight albums and two EPs[2] and are noted for their collaboration with Dan Bejar of Destroyer.\n",
      "Frog Eyes is led by singer/songwriter/guitarist Carey Mercer.[3] Drummer Melanie Campbell and Mercer are married, and were Frog Eyes' only two permanent members.[4] Campbell is originally from Penticton, British Columbia, as is former member Spencer Krug.\n",
      "Mercer's prior band Blue Pine, with drummer Lily Fawn and Frog Eyes bassist Michael Rak, released two records, although the second remained unreleased during the band's existence, instead being released as a bonus album appended to the reissue of Frog Eyes' debut, The Bloody Hand. Mercer also has a solo project, Blackout Beach, and has released four albums and a single under that name. Alternate versions of four Blackout Beach songs appear on Frog Eyes releases. In 2003 they released The Golden River,[5] which appeared on the !earshot National Top 50 chart in August that year.[6]\n",
      "Frog Eyes performed with Destroyer in live shows and on Dan Bejar's album Notorious Lightning & Other Works. This collaboration led to the formation of Swan Lake, a songwriter's project with Dan Bejar of Destroyer/The New Pornographers and Spencer Krug of Sunset Rubdown/Wolf Parade. Frog Eyes performed at Wavelength No. 177 in August 2003 (Wavelength Music Arts Projects). In 2007 the band released Tears of the Valedictorian.[7]\n"
   ]
}