{
   "Discography": {
      "EPs and singles": {
         "text": [
            "Additionally, there are numerous compilation albums featuring Hanson Brothers tracks.\n"
         ]
      },
      "Full-length albums": {}
   },
   "External links": {},
   "History": {
      "text": [
         "From 1984 to 1989, the Wright brothers and original NoMeansNo guitarist Andy Kerr performed Ramones cover sets sporadically under the name The Hanson Brothers.  The Hanson Brothers later began to write \"their own Ramones songs\".[1]  At this time John Wright played drums and the three members shared lead vocal duties.  Examples of songs from this era are \"Ya Little Creep\" and \"Bad,\" two Kerr-era NoMeansNo songs with songwriting credited to the Hanson Brothers; the former appears on the 1991 compilation Clam Chowder and Ice Vs. Big Macs and Bombers, and the latter on The Sky Is Falling and I Want My Mommy, a collaborative LP with Jello Biafra.\n",
         "The Wrights began working with Holliston as the Hanson Brothers in 1989.  The earliest sessions from this time still featured John Wright on drums; however, Ken Jensen of D.O.A. soon joined and, after releasing a debut 7\", the band recorded their first album, Gross Misconduct, in 1992.  The album featured art spoofing the cover of the Ramones' Road to Ruin.\n",
         "Jensen died in a house fire in 1995. Ken Kempster (member of, among many other groups, the Showbusiness Giants) became the group's next drummer, referred to as \"Kenny Jr\" Hanson.  This lineup released the group's second record, Sudden Death, through a subsidiary of Virgin Records.  The cover spoofed D.O.A.'s \"The Prisoner\" single cover.\n",
         "In 2000, the songs \"Rink Rat\", \"Third Man In\", \"Stick Boy\", and \"Danielle\", were featured in the NHL Rock The Rink game for the Sony PlayStation.  Also in 2000, John Wright, in his Johnny Hanson character, recorded an instructional video regarding homebrewing beer. Wright also compiled and released two compilations of hockey-themed songs called Puck Rock Volumes I and II.\n",
         "Kempster left the group in 2001, and Ernie Hawkins joined for touring behind the group's third record, My Game. The cover parodied Black Flag's My War. Hawkins appears on the group's 2008 live album It's a Living, whose cover parodies the Ramones' It's Alive. Mike Branum, from The Freak Accident, debuted as the group's drummer for their 2008 tour. Byron Slack replaced Branum in 2014.\n"
      ]
   },
   "Members": {},
   "References": {
      "text": [
         "Citations\n"
      ]
   },
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "3.1 Full-length albums",
      "3.2 EPs and singles",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Hanson Brothers were a Canadian punk rock band formed in 1984 in Victoria and later based in Vancouver.  The group included John and Rob Wright and Tom Holliston, all members of the punk rock band Nomeansno.  The Hanson Brothers' band name references characters in the cult ice hockey film Slap Shot.\n"
      ]
   },
   "Title": "The Hanson Brothers (band) - Wikipedia"
}