{
   "Name": "The Hanson Brothers (band)",
   "rawData": [
      "The Hanson Brothers were a Canadian punk rock band formed in 1984 in Victoria and later based in Vancouver.  The group included John and Rob Wright and Tom Holliston, all members of the punk rock band Nomeansno.  The Hanson Brothers' band name references characters in the cult ice hockey film Slap Shot.\n",
      "From 1984 to 1989, the Wright brothers and original NoMeansNo guitarist Andy Kerr performed Ramones cover sets sporadically under the name The Hanson Brothers.  The Hanson Brothers later began to write \"their own Ramones songs\".  At this time John Wright played drums and the three members shared lead vocal duties.  Examples of songs from this era are \"Ya Little Creep\" and \"Bad,\" two Kerr-era NoMeansNo songs with songwriting credited to the Hanson Brothers; the former appears on the 1991 compilation Clam Chowder and Ice Vs. Big Macs and Bombers, and the latter on The Sky Is Falling and I Want My Mommy, a collaborative LP with Jello Biafra.\n",
      "The Wrights began working with Holliston as the Hanson Brothers in 1989.  The earliest sessions from this time still featured John Wright on drums; however, Ken Jensen of D.O.A. soon joined and, after releasing a debut 7\", the band recorded their first album, Gross Misconduct, in 1992.  The album featured art spoofing the cover of the Ramones' Road to Ruin.\n"
   ],
   "infobox": {
      "Origin": [
         "Victoria, British Columbia, Canada"
      ],
      "Genres": [
         "Punk rock, pop punk"
      ],
      "Years active": [
         "1984–2016"
      ],
      "Labels": [
         "Alternative Tentacles, Wrong Records, Southern, Konkurrent, Mint, Virgin"
      ],
      "Associated acts": [
         "NoMeansNo, Showbusiness Giants"
      ],
      "Website": [
         "nomeanswhatever.com"
      ],
      "Past members": [
         "John Wright",
         "Rob Wright",
         "Andy Kerr",
         "Tom Holliston",
         "Ken Jensen",
         "Ken Kempster",
         "Ernie Hawkins",
         "Mike Branum",
         "Byron Slack"
      ]
   },
   "albums": [
      "Gross Misconduct",
      "Sudden Death",
      "My Game",
      "It's a Living"
   ],
   "prunedData": [
      "[BAND_NAME] were a [GENRE] band formed in [YEAR] in Victoria and later based in Vancouver.  The group included John and Rob Wright and [PERSON_NAME_FULL_0_MALE], all members of the punk rock band Nomeansno.  [BAND_NAME]' band name references characters in the cult ice hockey film Slap Shot.\n",
      "From [YEAR] to [YEAR], the Wright brothers and original NoMeansNo guitarist [PERSON_NAME_FULL_0_MALE] performed Ramones cover sets sporadically under the name [BAND_NAME].  [BAND_NAME] later began to write [SONG_NAME] two [PERSON_NAME_LAST_0]-era NoMeansNo songs with songwriting credited to the Hanson Brothers; the former appears on the [YEAR] compilation Clam Chowder and Ice Vs. Big Macs and Bombers, and the latter on The Sky Is Falling and I Want My Mommy, a [GENRE]",
      "The Wrights began working with Holliston as the Hanson Brothers in [YEAR].  The earliest sessions from this time still featured John Wright on drums; however, [PERSON_NAME_FULL_0_MALE] of D.O.A. soon joined and, after releasing a [GENRE] band recorded their first album, Gross Misconduct, in [YEAR].  The album featured art spoofing the cover of the Ramones' Road to Ruin.\n"
   ]
}