{
   "Name": "Hot Hot Heat",
   "rawData": [
      "Hot Hot Heat was a Canadian indie rock band from Victoria, British Columbia, formed in 1999. The band was signed by Seattle label Sub Pop in 2001 and released its first EP, Knock Knock Knock, and first full-length album, Make Up the Breakdown, the following year. The band released five full-length albums, the last being the self-titled Hot Hot Heat in 2016. The band's style makes use of electronic and traditional instruments and has variously been categorized as dance-punk, post-punk revival, new wave, and art-punk. They made an appearance on Yo Gabba Gabba, with the song, \"Time to go Outdoors\". It was featured on the \"Talent\" episode.\n",
      "After five years of little activity, on March 13, 2016, Hot Hot Heat announced new music in the form of a special 7\" titled \"Nature of Things\" to be released for Record Store Day (April 16, 2016). Following on from this, on April 5, the band announced via Twitter they would be releasing their fifth and final self-titled album on June 24. New song \"Kid Who Stays in the Picture\" was premiered the same day.\n",
      "Dustin Hawthorne, a drugstore clerk, and Steve Bays, a personal assistant, had been in many different bands together since 1995 and met Paul Hawley in 1998. In 1999, Hawley bought a Juno 6 keyboard and asked Bays to try playing it, as no one else knew how. Hawley took over the drums from Bays and Hawthorne played bass. Matthew Marnik, who was a friend of the band, sang vocals. The band's original sound can be considered electropunk.\n"
   ],
   "infobox": {
      "Origin": [
         "Victoria, British Columbia, Canada"
      ],
      "Genres": [
         "Alternative rock, indie rock, art punk,[1] dance-punk, new wave, post-punk revival"
      ],
      "Years active": [
         "1999 (1999)–2016"
      ],
      "Labels": [
         "Sub Pop, Dangerbird, Dine Alone, Sire, Warner Bros. Records"
      ],
      "Associated acts": [
         "Fake Shark - Real Zombie!, Mounties, Johnny and the Moon, Fur Trade"
      ],
      "Website": [
         "hothotheat.com"
      ],
      "Past members": [
         "Steve Bays",
         "Paul Hawley",
         "Luke Paquin",
         "Louis Hearn",
         "Dante DeCaro",
         "Dustin Hawthorne",
         "Matthew Marnik",
         "Parker Bossley"
      ]
   },
   "albums": [
      "Scenes One Through Thirteen"
   ]
}