{
   "Career": {
      "text": [
         "Singer-songwriter and guitarist Jon Middleton and percussionist Roy Vizer met at University of Victoria. They formed Jon and Roy, and began performing around Victoria and Vancouver in 2003. They added multi-instrumentalist Dougal Bain Mclean in 2004 and recorded their first album, Sittin' Back, in 2005 with recording engineer & producer Stephen Franke.[1]\n",
         "After traveling together in Australia, Jon and Roy went on hiatus from 2006 to 2007, during which Middleton recorded the solo album, After A Trip, while McLean and Vizer relocated to Vancouver. In 2007, Jon and Roy reformed and the duo recorded the album Another Noon, once again with Stephen Franke, at Blue Heron Studios. The album's title track was featured in a Volkswagen TV commercial that ran for nine months across the United States, giving the group considerable profile in that country. The success of the album also spawned the YouTube hit \"Little Bit of Love\".[1]\n",
         "In April 2010, Jon and Roy released Homes. Reviewers stated the music \"wants you to get outside, enjoy the sunshine and leave all your material possessions behind.\" Homes earned them further airtime and exposure, as well as a placement in a six-month Scotiabank ad campaign, in addition to a headlining performance on Canada Day.[2]\n",
         "With the fourth album, Let It Go, the band were deemed notable, by some critics, for their \"folk sound, their light swing rhythm and their predominant use of acoustic instrument.\"[3]\nTheir fifth LP, By My Side, released in 2014, was written during jams at Roy Vizer's house.[4]\n"
      ]
   },
   "Discography": {
      "Albums": {}
   },
   "External links": {},
   "References": {},
   "Sections": [
      "1 Career",
      "2 Discography",
      "2.1 Albums",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Jon and Roy is a Canadian three-piece folk rock and reggae band from Victoria, British Columbia.\n"
      ]
   },
   "Title": "Jon and Roy - Wikipedia"
}