{
   "Name": "Jon and Roy",
   "rawData": [
      "Jon and Roy is a Canadian three-piece folk rock and reggae band from Victoria, British Columbia.\n",
      "Singer-songwriter and guitarist Jon Middleton and percussionist Roy Vizer met at University of Victoria. They formed Jon and Roy, and began performing around Victoria and Vancouver in 2003. They added multi-instrumentalist Dougal Bain Mclean in 2004 and recorded their first album, Sittin' Back, in 2005 with recording engineer & producer Stephen Franke.\n",
      "After traveling together in Australia, Jon and Roy went on hiatus from 2006 to 2007, during which Middleton recorded the solo album, After A Trip, while McLean and Vizer relocated to Vancouver. In 2007, Jon and Roy reformed and the duo recorded the album Another Noon, once again with Stephen Franke, at Blue Heron Studios. The album's title track was featured in a Volkswagen TV commercial that ran for nine months across the United States, giving the group considerable profile in that country. The success of the album also spawned the YouTube hit \"Little Bit of Love\".\n"
   ],
   "infobox": {
      "Origin": [
         "Victoria, British Columbia, Canada"
      ],
      "Genres": [
         "Folk rock, reggae"
      ],
      "Years active": [
         "2003 (2003)–present"
      ],
      "Associated acts": [
         "Bocce Avocado",
         "Jon Middleton",
         "Ocie Elliott",
         "Current Swell"
      ],
      "Website": [
         "jonandroy.ca"
      ],
      "Members": [
         "Jon Middleton",
         "Roy Vizer",
         "Louis Sadava"
      ],
      "Past members": [
         "Ryan Tonelli",
         "Dougal McLean"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Victoria, British Columbia.\n",
      "Singer-songwriter and guitarist Jon Middleton and percussionist Roy Vizer met at University of Victoria. They formed [BAND_NAME], and began performing around Victoria and Vancouver in [YEAR]. They added multi-instrumentalist [PERSON_NAME_FULL_0_MALE] in [YEAR] and recorded their first album, Sittin' Back, in [YEAR] with recording engineer & producer Stephen Franke.\n",
      "After traveling together in Australia, [BAND_NAME] went on hiatus from [YEAR] to [YEAR], during which Middleton recorded the solo album, After A Trip, while McLean and Vizer relocated to Vancouver. In [YEAR], [BAND_NAME] reformed and the duo recorded the album Another Noon, once again with Stephen Franke, at Blue Heron Studios. The album's title track was featured in a [GENRE]"
   ]
}