{
   "Name": "88 Fingers Louie",
   "rawData": [
      "88 Fingers Louie is an American punk rock band from Chicago, Illinois, United States, which was formed in 1993.\nAfter disbanding in 1999, guitarist Dan Wleklinski and bassist Joe Principe formed the well-known punk rock band Rise Against. The band reunited in 2009, and has continued playing shows in Chicago, Canada, Belgium, Las Vegas, and Asbury Park. The band held a 20th anniversary show in 2013. The name comes from a Flintstones gangster who sells dodgy pianos.\n",
      "88 Fingers Louie was formed in 1993 in Chicago, Illinois by vocalist Denis Buckley, guitarist Mr. Precision (Dan Wleklinski), bassist Joe Principe and drummer Dom Vallone. The same year the band released their first 7\" on their own \"Go Deaf Records\", and after signing to Fat Wreck Chords the band released two more 7\" EPs, \"Go Away\" and \"Wanted\".\nAfter appearing on several split and compilation albums in 1994, the band released their next 10\" EP, \"Totin' 40's and Fuckin' Shit Up\" in 1995 and shortly after, drummer Dom Vallone left the band. The band was joined by new drummer Glenn Porter, followed by the release of their first full album \"Behind Bars\" on Hopeless Records on September 12, 1995, which was well received.\n",
      "The band started touring more and tension between band members started building up. After appearing on the \"Chicago vs. Amsterdam\" split EP, 88 Fingers Louie disbanded in late 1996 due to fights between band members, and vocalist Denis Buckley allegedly having urinated on drummer Glenn Porter. However, shortly before disbanding, the band had recorded a new 7\" single, \"The Teacher Gets it\", which was released in early 1997. Later the same year, Fat Wreck Chords released a compilation album of all the band's 7\" releases on the label titled \"The Dom Years\".\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, United States"
      ],
      "Genres": [
         "Melodic hardcore, Punk rock"
      ],
      "Years active": [
         "1993–96, 1998–99, 2009–10, 2013–present"
      ],
      "Labels": [
         "Fat Wreck Chords, Hopeless, Rocco Records, Go Deaf Records"
      ],
      "Associated acts": [
         "Rise Against, Break The Silence, Shot Baker Alkaline Trio, Explode and Make Up"
      ],
      "Members": [
         "Denis Buckley ",
         " Mr Precision ",
         " Nat Wright ",
         " John Carroll"
      ],
      "Past members": [
         "Dom Vallone ",
         " Glenn Porter ",
         " John Contreras ",
         " Joe Principe"
      ]
   }
}