{
   "Name": "Arma Angelus",
   "rawData": [
      "Arma Angelus (formerly known as Novena) was a metalcore band from Chicago, Illinois. The band was formed in 1998 and disbanded in 2002. Members of the band were Pete Wentz (vocals, now bass guitarist and backing vocalist in Fall Out Boy), Tim McIlrath (bass guitar, now lead singer and rhythm guitarist of Rise Against), Jay Jancetic (guitar, last played guitar for the Chicago \"Holy Roman Empire\" and Harm's Way), Daniel Binaei (guitarist, formerly of Racetraitor), Adam Bishop (guitarist, now an English teacher at San Dieguito Academy High School in Encinitas, California) and Timothy Miller (drums, Last played drums for Arizona-based punk band Last Action Zeros & now owner of Immortal Art Tattoo & Body Piercing, located in Scottsdale, Arizona).\n",
      "After McIlrath left to form Rise Against, he was replaced in 1999 by Christopher Gutierrez. Gutierrez was a touring author and spoken word artist and founded and runs The Catcade in Chicago. Gutierrez was replaced as bass guitarist for one tour by Joseph Trohman (also a guitarist in Fall Out Boy and in The Damned Things). He was replaced mid-tour when the band flew Chris Gutierrez out to New York for the final half of their tour, including a stop at CBGBs. In the last Arma Angelus concert, (which also had Fall Out Boy billed) Patrick Stump played drums, Pete Wentz sang and Joe Trohman played guitar, along with Adam Bishop, and Christopher Gutierrez on bass guitar.\n",
      "AllMusic described the band's style as \"dark and metallic hardcore\". Heather Weil of Verbicide Magazine stated the band \"is one of the handful of metal-influenced hardcore bands that actually know what they’re doing, and how to pull it off\". Under the Gun reviews described their sound as \"Sending out posi vibes to kids fighting in the crowd during the band’s last set, Pete screams his sober heart out while Joe Trohman filled in on guitar and Patrick Stump took role of drummer\". In reference to their sole studio album, TeethOfTheDevine.com said that \"Where most bands in this space use death and thrash metal devices to create a sense of heaviness missing in traditional hardcore, Arma Angelus’ thick, angular attack comes from a rock and roll sense of composition that’s every bit as heavy as their metal-infused counterparts. True, elements of Where Sleeplessness is Rest from Nightmares do delve into death metal territory (vocals, tuning), the majority of Arma Angelus’ material pummels to the tune of catchy, head-bashing song structure.\" Upon their disbandment, the members stated that \"the goal of Arma Angelus was to express and stimulate discourse within the punk and hardcore community and to express our distaste for apathy and uncaring, which we felt had become ideals with in the community\"\n"
   ],
   "infobox": {
      "Also known as": [
         "Novena"
      ],
      "Origin": [
         "Chicago, Illinois, U.S."
      ],
      "Genres": [
         "Metalcore, hardcore punk[1]"
      ],
      "Years active": [
         "1998–2002"
      ],
      "Labels": [
         "Eulogy, Let It Burn Records"
      ],
      "Associated acts": [
         "Fall Out Boy",
         "Racetraitor",
         "Rise Against",
         "Holy Roman Empire",
         "The Killing Tree",
         "Yellow Road Priest",
         "Harm's Way"
      ],
      "Past members": [
         "Pete Wentz",
         "Jay Jancetic",
         "Adam Bishop",
         "Daniel Binaei",
         "Andy Hurley",
         "Timothy Miller",
         "Christopher Gutierrez",
         "Patrick Stump",
         "Joe Trohman",
         "Tim McIlrath"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (formerly known as [MONTH]ena) was a [GENRE] band from Chicago, Illinois. The band was formed in [YEAR] and disbanded in [YEAR]. Members of the band were [PERSON_NAME_FULL_2_MALE] (vocals, now bass guitarist and backing vocalist in Fall Out Boy), [PERSON_NAME_FULL_1_MALE] (bass guitar, now lead singer and rhythm guitarist of Rise Against), Jay [MONTH]cetic (guitar, last played guitar for the Chicago \"Holy Roman Empire\" and Harm's Way), Daniel Binaei (guitarist, formerly of Racetraitor), [PERSON_NAME_FULL_0_MALE] (guitarist, now an English teacher at San Dieguito Academy High School in Encinitas, California) and [PERSON_NAME_FIRST_1]othy Miller (drums, Last played drums for Arizona-based punk band Last Action Zeros & now owner of Immortal Art Tattoo & Body Piercing, located in Scottsdale, Arizona).\n",
      "After McIlrath left to form Rise Against, he was replaced in [YEAR] by [PERSON_NAME_FIRST_1]topher [PERSON_NAME_LAST_1]. [PERSON_NAME_LAST_1] was a touring author and spoken word artist and founded and runs The Catcade in Chicago. [PERSON_NAME_LAST_1] was replaced as bass guitarist for one tour by Joseph [PERSON_NAME_LAST_0] (also a guitarist in Fall Out Boy and in The Damned Things). He was replaced mid-tour when the band flew [PERSON_NAME_FULL_1_MALE] out to New York for the final half of their tour, including a stop at CBGBs. In the last [BAND_NAME] concert, (which also had Fall Out Boy billed) Patrick Stump played drums, [PERSON_NAME_FULL_2_MALE] sang and [PERSON_NAME_FULL_0_MALE] played guitar, along with Adam Bishop, and [PERSON_NAME_FIRST_1]topher [PERSON_NAME_LAST_1] on bass guitar.\n",
      "AllMusic described the band's style as \"dark and metallic hardcore\". Heather Weil of Verbicide Magazine stated the band \"is one of the handful of metal-influenced hardcore bands that actually know what they’re doing, and how to pull it off\". Under the Gun reviews described their sound as \"Sending out posi vibes to kids fighting in the crowd during the band’s last set, Pete screams his sober heart out while [PERSON_NAME_FULL_0_MALE] filled in on guitar and Patrick Stump took role of drummer\". In reference to their sole studio album, TeethOfTheDevine.com said that \"Where most bands in this space use death and thrash metal devices to create a sense of heaviness missing in traditional hardcore, [BAND_NAME]’ thick, angular attack comes from a rock and roll sense of composition that’s every bit as heavy as their metal-infused counterparts. True, elements of Where Sleeplessness is Rest from Nightmares do delve into death metal territory (vocals, tuning), the majority of [BAND_NAME]’ material pummels to the tune of catchy, head-bashing song structure.\" Upon their disbandment, the members stated that \"the goal of [BAND_NAME] was to express and stimulate discourse within the punk and hardcore community and to express our distaste for apathy and uncaring, which we felt had become ideals with in the community\"\n"
   ]
}