{
   "Name": "The Bollweevils",
   "Sections": [
      "1 Discography",
      "1.1 Albums",
      "1.2 Minor releases",
      "2 References",
      "3 External links"
   ],
   "Summary": {
      "text": [
         "The Bollweevils is a punk band from Chicago, Illinois.\n",
         "The members consist of Daryl Wilson on vocals, Sensitive Pete on bass, Ken Fitzner (\"Ken Weevil\") on guitar, and Pete Mumford on drums.\nFormer members include founding bass player, Bob Skwerski, Brian Czarnik (who played simultaneously in Oblivion) on drums later replaced by Brett Friesen (who played simultaneously in Houseboy).[1]\n",
         "They formed during the Naked Raygun era which was where the band members met and also, for whom they eventually opened.\n",
         "The group released a number of albums on Dr. Strange Records; though, their first, minor releases were on Underdog Records(Chicago). The group's current record label, Go Deaf Records LLC, is owned and operated by the band.\n",
         "In the summer of 1993, the band went on a cross-country road tour with the Smoking Popes.[citation needed]\n",
         "Ultimately, the Bollweevils dissipated when Daryl completed medical school and became a doctor. Ken started a new band, The Feds.[2] The Bollweevils reunited for one show in late 2003 for WLUW, the college radio station at Loyola University Chicago, and then again on November 3 and played a show at Double Door and November 5, 2006 for Riot Fest at the Congress Theater, which Naked Raygun headlined. The group says it will play another show if they can get 1000 friends on their MySpace account. In 2007, the group posted on their official website: \"The Bollweevils reunion at Riot Fest 2006 wasn't a one-off deal and we're all super stoked to say that we’re a band again\".\n",
         "In 2011, The Bollweevils amicably parted ways with founding bassist, Bob Skwerski, and recruited  bass player, Miguel Perez.\nThe band was performing actively and working on new music as of 2012.\n",
         "The Bollweevils have created 2 laws.  The first is Ken Weevil's law which states that any song with \"Hey\" or \"Go\" is automatically good.  \n",
         "Mumford's law states that if someone buys you a drink, no matter what it is or how you feel about it, you must drink it.\n",
         "The Bollweevils are the inventors of the game Flippy Cap which is a game of skill using a beer bottle cap.\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Minor releases": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Bollweevils is a punk band from Chicago, Illinois.\n",
      "The members consist of Daryl Wilson on vocals, Sensitive Pete on bass, Ken Fitzner (\"Ken Weevil\") on guitar, and Pete Mumford on drums.\nFormer members include founding bass player, Bob Skwerski, Brian Czarnik (who played simultaneously in Oblivion) on drums later replaced by Brett Friesen (who played simultaneously in Houseboy).[1]\n",
      "They formed during the Naked Raygun era which was where the band members met and also, for whom they eventually opened.\n",
      "The group released a number of albums on Dr. Strange Records; though, their first, minor releases were on Underdog Records(Chicago). The group's current record label, Go Deaf Records LLC, is owned and operated by the band.\n"
   ]
}