{
   "Name": "Charles Bronson (band)",
   "rawData": [
      "Charles Bronson was a powerviolence band from DeKalb, Illinois, existing from 1994 to 1997.\n",
      "Charles Bronson borrowed from the early powerviolence of Infest, who blended youth crew hardcore with the velocity and dissonance of thrashcore. Songs were very brief, and sometimes punctuated by samples taken from various media (including Charles Bronson films). Lyrically, the group tended towards satirical commentary on the hardcore punk scene. The group has been described as a \"fast, screaming mess of tall, skinny guys with a lot to say (which you would only know if you read the liner notes)\". The group was sometimes criticized for its conceptual take on hardcore and art school tendencies, maintaining a long-standing feud with Felix Havoc of Code 13.\n"
   ],
   "infobox": {
      "Origin": [
         "DeKalb, Illinois, United States"
      ],
      "Genres": [
         "Powerviolence, thrashcore, hardcore punk"
      ],
      "Years active": [
         "1994–1997"
      ],
      "Labels": [
         "625 Thrashcore",
         "Slap-a-Ham"
      ],
      "Past members": [
         "Mark McCoy",
         "Jon Arends",
         "Ebro Vinumbrales",
         "James DeJesus",
         "Mike Suffin",
         "Aaron Aspinwall",
         "Jeff Jelen",
         "Max Ward"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band from DeKalb, Illinois, existing from [YEAR] to [YEAR].\n",
      "[BAND_NAME] borrowed from the early powerviolence of Infest, who blended youth crew hardcore with the velocity and dissonance of thrashcore. Songs were very brief, and sometimes punctuated by samples taken from various media (including [BAND_NAME] films). Lyrically, the group tended towards satirical commentary on the hardcore punk scene. The group has been described as a [GENRE] a lot to say (which you would only know if you read the liner notes)\". The group was sometimes criticized for its conceptual take on hardcore and art school tendencies, maintaining a long-standing feud with Felix Havoc of Code 13.\n"
   ]
}