{
   "Discography": {
      "Albums": {},
      "Compilations": {},
      "Singles and EPs": {}
   },
   "External links": {},
   "History": {
      "text": [
         "The Effigies' website states that they were one of the first punk bands in Chicago.[1] This might be a complicated claim for a band not formed until 1980, but true in the sense that the Midwest resisted punk and was late to discover or appreciate it to any degree. In the years immediately after The Ramones and The Sex Pistols first released records (1977), Chicago remained dominated by classic rock, disco and blues; punk bands were anathema to the Midwest rock establishment and had few places to play and fans had few places to hear live bands. Despite revisionistic claims in its later advertised station history, even Chicago's \"progressive\" radio station, WXRT, was never very supportive of punk or even new wave, outside a few efforts of a couple of DJs relegated to late night slots. What most punk fans recall as the first \"scene\" in Chicago did not rise until the very early 1980s, when clubs like Oz and O’Banion’s started to provide venues for live punk. In a 1999 retrospective about the 1985 music year, Chicago Sun-Times music writer Jim Derogatis termed the heyday of The Effigies \"the second generation of Midwestern punks,\"[4] but this is correct only in describing the burgeoning young 1985 Midwest punk scene as it overtook the smaller, older scene which had cloistered itself in punk discos like La Mere Vipere and for all its excesses was musically passive, generating no bands and creating no music. By 1985,The Effigies, Naked Raygun, Strike Under and Big Black had been around for half a decade. There were no active punk bands in Chicago before them.\n",
         "Attempts to characterize The Effigies as post-punk, hardcore and, to the extent it is distinguishable, Chicago hardcore, reveal the difficulty in pigeonholing the band's sound which is more expansive than the punk subgenres both musically and thematically. Even the catch-all \"post-hardcore\" becomes an inapt anachronism in light of the fact that the band's seminal releases pre-date the arrival of hardcore by several years. Indie rock pundit Steve Albini writes that \"The Effigies were absolutely essential to the development of a healthy punk scene in Chicago. Between them and Naked Raygun, in the early 80s they basically kept the scene going until it developed momentum beyond them.\"[5] [6] \"The Effigies were a moving force during a crucial and exhilarating time.\"[7]\n",
         "The history of The Effigies develops in three discernible periods, each marked by a different lead guitarist. The Effigies' original lineup consisted of John Kezdy (vocals), Earl \"Oil\" Letiecq (guitar), Paul Zamost (bass) and Steve Economou (drums). By 1984 Letiecq’s distractions had estranged him from the group, and in the words of Zamost, “we had problems with our guitar player. We had to switch guitar players....”[8] Minor Threat guitarist Lyle Preslar made inquiries about joining the band.[9] Robert O’Connor replaced Letiecq as lead guitarist and this second lineup released two LPs, Fly on a Wire, and Ink. These albums were engineered and co-produced with the band by Iain Burgess, and were distinguished from the recordings of the first lineup by their sublimated aggression and comparatively muted rhythms. They also hinted at another growing division in the band.[10] As Burgess put it, \"they got a lot of heat for the change in musical direction to some degree on the latter two albums that I worked on, Ink and Fly on a Wire. I think both of which have some really f*****g good songs on them, and some are, well, in my opinion, just not all that marvelous. I think John (Kezdy) would say the same thing. I’m sure he likes all the songs, but some of it we could have done better.\"[11]  It was at this stage the band began getting tagged with the ill-fitting post-punk and post-hardcore labels.\n",
         "Perceiving the band's punk ethos as an obstacle to \"mass appeal,\" Zamost and O'Connor joined O'Connor's wife to form a new band called Machines in Motion during the summer of 1986 to pursue a more commercial sound.[8] Economou fell in with them. This effectively dissolved The Effigies in the middle of a national tour supporting their third LP, Ink. Prosaic and muddled, Machines in Motion were poorly received and broke up acrimoniously after only a few performances.[8] The O'Connors dropped back into obscurity and Zamost began a long string of short-lived bands.\n",
         "In 1987 Kezdy reunited with Letiecq and added Chris Bjorklund (Strike Under, Bloodsport, Trial by Fire)(bass) and Joe Haggerty (drums). In 1988, Letiecq departed again to form the band Jack Scratch with Dave Bergeron, formerly of Bloodsport. Bjorklund moved to guitar and Tom Woods became the Effigies' bassist. Coincidentally, Bjorklund, Haggerty, and Woods had comprised the rest of Bloodsport.[12] In 1990, the Effigies called it quits and Kezdy pursued a career as an attorney.[13] [14] [15] [16] [17]   The original line up reunited for a one-off show in 1992. They came together again in late 1995 and early 1996 to play a few Chicago shows to celebrate the reissue of their Remains Nonviewable compilation CD on Touch and Go Records.\n",
         "After seventeen years of unremarkable musical projects,[18] Economou and Zamost sought a rapprochement with Kezdy. The Effigies re-formed in 2004 and in 2007 released their first recording in nearly 20 years, a full LP titled Reside, which was a return to their earlier form.[10] The album was produced by Andy Gerber, who once played with Zamost and Economou in the band Laughing Man. The most recent lineup consisted of original members John Kezdy, Paul Zamost, and Steve Economou, and new guitarist Robert McNaughton, who had previously been in the bands Pop Media, We're Staying, and along with Zamost, The Indicators, The Lemmings, The Greys, 80 Proof Preacher and People Like Us. McNaughton composed music for the film Henry: Portrait of a Serial Killer.[19] Since 2010 Economou has also been collaborating with Steve Bjorklund and keyboardist LizB in the band High Value Target.[20]\n"
      ]
   },
   "Members": {},
   "Miscellaneous": {
      "text": [
         "The cover of the band's record \"Haunted Town\"[21] constitutes the first use of the Chicago flag as a countercultural geo-signifier.  Consequently, the flag was adopted as a motif within the nascent Chicago punk scene and later became fashionable outside the milieu of music.[22]\n[23]\n",
         "In late 2010, The Effigies were slated to play a Riot Fest show commemorating the re-release of the 1981 Busted at Oz compilation.[24] The show was to be at a Chicago venue called the Metro and featured a number of reunited groups that had appeared on the original compilation. Due to the band's long-standing objection to the Metro as a venue – alluded to in a 1993 interview with bassist Zamost[8] – the show was moved to a smaller club, the Double Door. Initially agreeing to fill out the original lineup for what promised to be a compelling show, guitarist Letiecq pulled out within weeks of the show and just prior to the event posted a note on the Riot Fest website declaiming against the endeavor and vowing for unstated reasons never to perform with the original members again. Without their guitarist, the remaining band members withdrew from the show rather than appear as an unrehearsed and falsely billed original line-up.\n",
         "John Kezdy is the older brother of Naked Raygun bassist Pierre Kezdy.\n",
         "The Effigies can be seen in You Weren’t There, a 2007 film about the Chicago punk scene from 1977 through 1984.[25][26]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Miscellaneous",
      "3 Members",
      "4 Discography",
      "4.1 Albums",
      "4.2 Singles and EPs",
      "4.3 Compilations",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Effigies were an American punk band from Chicago, Illinois, United States. The band played its first show in 1980 and was active initially for approximately a decade, undergoing multiple personnel changes with frontman John Kezdy the only constant, before disbanding in 1990.[1] The band released 5 albums and several EPs, most on the record label they founded in 1981, Ruthless Records, which was distributed by Enigma. Later albums were on the Fever Records[2] and Roadkill Records[3] labels. They toured the U.S. and Canada and played notable venues, including CBGB, Maxwell's, First Avenue (nightclub), Mabuhay Gardens, Paycheck's (Detroit), Exit (Chicago) and The Rathskeller, among others. They also received a significant amount of national airplay on college radio at a time when it was the only medium for alternative music.\n"
      ]
   },
   "Title": "The Effigies - Wikipedia"
}