{
   "Name": "The Effigies",
   "rawData": [
      "The Effigies were an American punk band from Chicago, Illinois, United States. The band played its first show in 1980 and was active initially for approximately a decade, undergoing multiple personnel changes with frontman John Kezdy the only constant, before disbanding in 1990. The band released 5 albums and several EPs, most on the record label they founded in 1981, Ruthless Records, which was distributed by Enigma. Later albums were on the Fever Records and Roadkill Records labels. They toured the U.S. and Canada and played notable venues, including CBGB, Maxwell's, First Avenue (nightclub), Mabuhay Gardens, Paycheck's (Detroit), Exit (Chicago) and The Rathskeller, among others. They also received a significant amount of national airplay on college radio at a time when it was the only medium for alternative music.\n",
      "The Effigies' website states that they were one of the first punk bands in Chicago. This might be a complicated claim for a band not formed until 1980, but true in the sense that the Midwest resisted punk and was late to discover or appreciate it to any degree. In the years immediately after The Ramones and The Sex Pistols first released records (1977), Chicago remained dominated by classic rock, disco and blues; punk bands were anathema to the Midwest rock establishment and had few places to play and fans had few places to hear live bands. Despite revisionistic claims in its later advertised station history, even Chicago's \"progressive\" radio station, WXRT, was never very supportive of punk or even new wave, outside a few efforts of a couple of DJs relegated to late night slots. What most punk fans recall as the first \"scene\" in Chicago did not rise until the very early 1980s, when clubs like Oz and O’Banion’s started to provide venues for live punk. In a 1999 retrospective about the 1985 music year, Chicago Sun-Times music writer Jim Derogatis termed the heyday of The Effigies \"the second generation of Midwestern punks,\" but this is correct only in describing the burgeoning young 1985 Midwest punk scene as it overtook the smaller, older scene which had cloistered itself in punk discos like La Mere Vipere and for all its excesses was musically passive, generating no bands and creating no music. By 1985,The Effigies, Naked Raygun, Strike Under and Big Black had been around for half a decade. There were no active punk bands in Chicago before them.\n",
      "Attempts to characterize The Effigies as post-punk, hardcore and, to the extent it is distinguishable, Chicago hardcore, reveal the difficulty in pigeonholing the band's sound which is more expansive than the punk subgenres both musically and thematically. Even the catch-all \"post-hardcore\" becomes an inapt anachronism in light of the fact that the band's seminal releases pre-date the arrival of hardcore by several years. Indie rock pundit Steve Albini writes that \"The Effigies were absolutely essential to the development of a healthy punk scene in Chicago. Between them and Naked Raygun, in the early 80s they basically kept the scene going until it developed momentum beyond them.\"  \"The Effigies were a moving force during a crucial and exhilarating time.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, United States"
      ],
      "Genres": [
         "Punk rock"
      ],
      "Years active": [
         "1980–1990, 1992, 1995–1996, 2004–2009"
      ],
      "Labels": [
         "Ruthless, Enigma, Touch and Go Records, Criminal IQ Records, Roadkill Records, Fever Records"
      ],
      "Associated acts": [
         "Naked Raygun, Strike Under, Pegboy, Bloodsport,Trial by Fire"
      ],
      "Website": [
         "effigies.com"
      ],
      "Members": [
         "John Kezdy, Robert McNaughton, Paul Zamost, Steve Economou"
      ],
      "Past members": [
         "Earl Letiecq, Robert O'Connor, Chris Bjorklund, Joe Haggerty, Tom Woods"
      ]
   },
   "prunedData": [
      "[BAND_NAME] were an [GENRE] band from Chicago, Illinois, United States. The band played its first show in [YEAR] and was active initially for approximately a decade, undergoing multiple personnel changes with frontman John Kezdy the only constant, before disbanding in [YEAR]. The band released 5 albums and several EPs, most on the record label they founded in [YEAR], Ruthless Records, which was distributed by Enigma. Later albums were on the Fever Records and Roadkill Records labels. They toured the U.S. and Canada and played notable venues, including CBGB, Maxwell's, First Avenue (nightclub), Mabuhay Gardens, Paycheck's (Detroit), Exit (Chicago) and The Rathskeller, among others. They also received a significant amount of national airplay on college radio at a time when it was the only medium for alternative music.\n",
      "[BAND_NAME]' website states that they were one of the first punk bands in Chicago. This might be a [GENRE] a band not formed until [YEAR], but true in the sense that the Midwest resisted punk and was late to discover or appreciate it to any degree. In the years immediately after The Ramones and The Sex Pistols first released records ([YEAR]), Chicago remained dominated by classic rock, disco and blues; punk bands were anathema to the Midwest rock establishment and had few places to play and fans had few places to hear live bands. Despite revisionistic claims in its later advertised station history, even Chicago's \"progressive\" radio station, WXRT, was never very supportive of punk or even new wave, outside a few efforts of a couple of DJs relegated to late night slots. What most punk fans recall as the first \"scene\" in Chicago did not rise until the very early [YEAR]s, when clubs like Oz and O’Banion’s started to provide venues for live punk. In a [YEAR] retrospective about the [YEAR] music year, Chicago Sun-Times music writer [PERSON_NAME_FULL_0_MALE] termed the heyday of [BAND_NAME] \"the second generation of Midwestern punks,\" but this is correct only in describing the burgeoning young [YEAR] Midwest punk scene as it overtook the smaller, older scene which had cloistered itself in punk discos like La Mere Vipere and for all its excesses was musically passive, generating no bands and creating no music. By [YEAR],[BAND_NAME], Naked Raygun, Strike Under and Big Black had been around for half a decade. There were no active punk bands in Chicago before them.\n",
      "Attempts to characterize [BAND_NAME] as post-punk, hardcore and, to the extent it is distinguishable, Chicago hardcore, reveal the difficulty in pigeonholing the band's sound which is more expansive than the punk subgenres both musically and thematically. Even the catch-all \"post-hardcore\" becomes an [GENRE] band's seminal releases pre-date the arrival of hardcore by several years. Indie rock pundit [PERSON_NAME_FULL_0_MALE] writes that \"[BAND_NAME] were absolutely essential to the development of a healthy punk scene in Chicago. Between them and Naked Raygun, in the early 80s they basically kept the scene going until it developed momentum beyond them.\"  \"[BAND_NAME] were a moving force during a crucial and exhilarating time.\"\n"
   ]
}