{
   "Name": "The Fighters (band)",
   "rawData": [
      "The Fighters were an American pop-punk band from Chicago, Illinois that played an important part in the punk rock subculture of the Midwestern United States in the early 1990s. The band was formed in 1993 and helped create a style of guitar-driven, energetic punk with gang-vocals and humorous lyrics that became prevalent in Chicago bands of the period. They embraced the DIY ethic in recording and releasing records on lead-singer Jason Mojica's Rocco Records label, booking their own tours, and organizing punk rock shows in non-traditional venues such as laundromats. Members of The Fighters were involved in creating the third edition of the Maximumrocknroll DIY resource guide, Book Your Own Fuckin' Life, and were active participants in the Underdog Records collective, which helped distribute Chicago-area punk music around the world. After disbanding in 1995, guitarist Paul Koob went on to play in with well-known indie rock band Joan of Arc before becoming a graphic designer, and lead singer Jason Mojica joined ska-punk / power-pop band the Eclectics before starting a career as an award-winning journalist and filmmaker.\n",
      "The Fighters was formed in 1993 by Jason Mojica, Paul Koob, Mike McKee, and Don Shrader. The four had met while attending St. Joseph High School in Westchester, Illinois, where they collaborated on self-published comic books and zines under the monikers Rocco Comics, and Rocco Publishing. The world of small-press comics and zines that was cataloged at the time by Factsheet Five also served as the gateway for the group to other subcultures, including DIY punk rock. Unfortunately, just as the group's interest in punk rock was forming, they left for their first year of college: Koob and McKee were based in Chicago at DePaul University, while Mojica and Shrader were 350 miles away at Southern Illinois University in Carbondale. Undeterred by distance, the four decided to form The Fighters halfway into that first school year, and used available technology to help with long-distance songwriting: \"Mojica would call up Koob and hum a melody, Koob would process the murmuring into a guitar riff and the two would have a jam session over the phone\" reported the Daily Egyptian. When summer finally rolled around, The Fighters had their first in-person practice session and recorded and released their first 7\" EP, Give 'em the Business–the first release under the spinoff Rocco Records imprint–just a month later. Give 'em the Business received a positive review from the grandfather of punk rock, Maximum Rocknroll founder Tim Yohannan. Yohannan would later entrust the third edition of the DIY resource guide Book Your Own Fuckin' Life to Mojica and the Rocco team, which included The Fighters. Mojica and Yohannan bonded over an earnest love for the punk scene and its DIY ethos as well as a shared a workaholic streak. \"What drives so many people to work their asses off to the extent of becoming total maniacs in this wacky world we call punk?\" Mojica was quoted as saying in Underground: The Subterranean Culture of DIY Punk Shows. \"Satisfaction, belonging, 'fame', the desire to escape ordinary life, and just plain fun are a few of the reasons,\" he continues, \"but it all comes down to love.\"\n",
      "The band played around Chicago and the midwest in the summer of 1993. When the fall came, Mojica decided to drop out of school to devote more time to the band and the record label, while Shrader left the band and returned to SIU. The Fighters found a new drummer in 16-year old C.J. Heimberger, whose speed, energy, and humor changed the direction of the band's music, as evidenced on The Fighters' second EP, 1994's Breaking Bones for Laughs.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, U.S."
      ],
      "Genres": [
         "Pop punk",
         "hardcore punk",
         "punk rock",
         "melodic hardcore"
      ],
      "Years active": [
         "1993–1995, 2001, 2005"
      ],
      "Labels": [
         "Rocco Records"
      ],
      "Associated acts": [
         "Joan of Arc",
         "The Hitmen",
         "Eclectics",
         "Old Dad",
         "Black Print",
         "Full On"
      ],
      "Past members": [
         "Jason Mojica",
         "Paul Koob",
         "CJ Heimberger",
         "Jim Milak",
         "Mike McKee",
         "Don Shrader"
      ]
   },
   "prunedData": [
      "[BAND_NAME] were an [GENRE] band from Chicago, Illinois that played an important part in the punk rock subculture of the Midwestern United States in the early [YEAR]s. The band was formed in [YEAR] and helped create a style of guitar-driven, energetic punk with gang-vocals and humorous lyrics that became prevalent in Chicago bands of the period. They embraced the DIY ethic in recording and releasing records on lead-singer Jason Mojica's [PERSON_NAME_FULL_0_MALE] label, booking their own tours, and organizing punk rock shows in non-traditional venues such as laundromats. Members of [BAND_NAME] were involved in creating the third edition of the Maximumrocknroll DIY resource guide, Book Your Own Fuckin' Life, and were active participants in the Underdog [PERSON_NAME_LAST_0] collective, which helped distribute Chicago-area punk music around the world. After disbanding in [YEAR], guitarist Paul Koob went on to play in with well-known indie rock band Joan of Arc before becoming a graphic designer, and lead singer Jason Mojica joined ska-punk / power-pop band the Eclectics before starting a career as an award-winning journalist and filmmaker.\n",
      "[BAND_NAME] was formed in [YEAR] by Jason Mojica, [PERSON_NAME_FULL_4_MALE], Mike McKee, and [PERSON_NAME_FULL_1_MALE]. The four had met while attending St. Joseph High School in Westchester, Illinois, where they collaborated on self-published comic books and zines under the monikers [PERSON_NAME_FIRST_0] Comics, and [PERSON_NAME_FIRST_0] [PERSON_NAME_LAST_2]. The world of small-press comics and zines that was cataloged at the time by Factsheet Five also served as the gateway for the group to other subcultures, including DIY punk rock. Unfortunately, just as the group's interest in punk rock was forming, they left for their first year of college: [PERSON_NAME_LAST_4] and McKee were based in Chicago at De[PERSON_NAME_FIRST_4] University, while Mojica and [PERSON_NAME_LAST_1] were 350 miles away at Southern Illinois University in Carbondale. Undeterred by distance, the four decided to form [BAND_NAME] halfway into that first school year, and used available technology to help with long-distance songwriting: \"Mojica would call up [PERSON_NAME_LAST_4] and hum a melody, [PERSON_NAME_LAST_4] would process the murmuring into a guitar riff and the two would have a jam session over the phone\" reported the Daily Egyptian. When summer finally rolled around, [BAND_NAME] had their first in-person practice session and recorded and released their first 7\" EP, Give 'em the Business–the first release under the spinoff [PERSON_NAME_FULL_0_MALE] imprint–just a month later. Give 'em the Business received a positive review from the grandfather of punk rock, Maximum Rocknroll founder [PERSON_NAME_FULL_3_MALE]. [PERSON_NAME_LAST_3] would later entrust the third edition of the DIY resource guide Book Your Own Fuckin' Life to Mojica and the [PERSON_NAME_FIRST_0] team, which included [BAND_NAME]. Mojica and [PERSON_NAME_LAST_3] bonded over an earnest love for the punk scene and its DIY ethos as well as a shared a workaholic streak. \"What drives so many people to work their asses off to the extent of becoming total maniacs in this wacky world we call punk?\" Mojica was quoted as saying in Underground: The Subterranean Culture of DIY Punk Shows. \"Satisfaction, belonging, 'fame', the desire to escape ordinary life, and just plain fun are a few of the reasons,\" he continues, \"but it all comes down to love.\"\n",
      "The band played around Chicago and the midwest in the summer of [YEAR]. When the fall came, Mojica decided to drop out of school to devote more time to the band and the record label, while Shrader left the band and returned to SIU. [BAND_NAME] found a [GENRE] band's music, as evidenced on [BAND_NAME]' second EP, [YEAR]'s Breaking Bones for Laughs.\n"
   ]
}