{
   "Name": "Harm's Way (band)",
   "rawData": [
      "Harm's Way is an American straight edge hardcore punk band from Chicago, Illinois, formed in 2006. The band started as a side project, but ended up becoming a more serious and full-time band in their later years. Harm's Way has since released four studio albums: Reality Approaches (2009), Isolation (2011) and Rust (2015) and several EP's. On February 9, 2018, the band released their critically acclaimed Metal Blade Records debut, titled Posthuman. They have been recognized for their unique blend of metal, industrial, and hardcore music.\n",
      "In 2006, the members of a straight edge punk band called Few and the Proud started a \"side project-slash-joke\" band to have fun playing short-and-fast powerviolence songs influenced by Crossed Out and Infest. Harm's Way drummer Chris Mills commented on the band's early days and progression, stating: \"We'd play super fast powerviolence songs, and our singer would put on a mask and sing silly lyrics about beating up frat boys or whatever. Then, later as the band became more serious, we retired a lot of those elements and went in a more death metal direction—darker and less ridiculous, even if some aspects of it still weren't 100 percent serious.\" Harm's Way released several albums, EPs and singles through Organized Crime Records and Closed Casket Activities in their early days.\n",
      "After the release of their 2011 second studio album Isolation, Harm's Way emailed Jacob Bannon (Converge) and his label Deathwish Inc. after hearing that he was a fan of the band's music to ask if the label would be interested in signing them. The band's signing to Deathwish was announced in March 2013. Harm's Way released the EP Blinded on July 23, 2013 featuring artwork by Florian Bertmer, and promoted it with a music video for the track \"Mind Control\" followed by a world tour. Mills commented on their positive relationship with the label, stating: \"It's been awesome—they've been really helpful, we have a bigger budget, we were able to do a music video.  They've been willing to do anything we've really wanted. They're really supportive.\" The Blinded EP also saw the band incorporating more Godflesh-influenced industrial metal into their sound.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, US"
      ],
      "Genres": [
         "Hardcore punk[1]",
         "metalcore[2]",
         "industrial metal",
         "powerviolence (early)[3]"
      ],
      "Years active": [
         "2006 (2006)–present"
      ],
      "Labels": [
         "Metal Blade, Deathwish"
      ],
      "Associated acts": [
         "Few and the Proud,[4] Wolfnote,[5]"
      ],
      "Members": [
         "James Pligge",
         "Bo Lueders",
         "Nick Gauthier",
         "Casey Soyk",
         "Chris Mills"
      ],
      "Past members": [
         "Jason Jancetic"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Chicago, Illinois, formed in [YEAR]. The band started as a side project, but ended up becoming a more serious and full-time band in their later years. [BAND_NAME] has since released four studio albums: Reality Approaches ([YEAR]), Isolation ([YEAR]) and Rust ([YEAR]) and several EP's. On [MONTH] 9, [YEAR], the band released their critically acclaimed Metal Blade Records debut, titled Posthuman. They have been recognized for their unique blend of metal, industrial, and hardcore music.\n",
      "In [YEAR], the members of a [GENRE] band called Few and the Proud started a \"side project-slash-joke\" band to have fun playing short-and-fast powerviolence songs influenced by Crossed Out and Infest. [BAND_NAME] drummer Chris Mills commented on the band's early days and progression, stating: \"We'd play super fast powerviolence songs, and our singer would put on a mask and sing silly lyrics about beating up frat boys or whatever. Then, later as the band became more serious, we retired a lot of those elements and went in a more death metal direction—darker and less ridiculous, even if some aspects of it still weren't 100 percent serious.\" [BAND_NAME] released several albums, EPs and singles through Organized Crime Records and Closed Casket Activities in their early days.\n",
      "After the release of their [YEAR] second studio album Isolation, [BAND_NAME] emailed Jacob Bannon (Converge) and his label Deathwish Inc. after hearing that he was a [GENRE] band's music to ask if the label would be interested in signing them. The band's signing to Deathwish was announced in [MONTH] [YEAR]. [BAND_NAME] released the EP Blinded on [MONTH] 23, [YEAR] featuring artwork by [PERSON_NAME_FULL_0_MALE], and promoted it with a music video for the track \"Mind Control\" followed by a world tour. Mills commented on their positive relationship with the label, stating: \"It's been awesome—they've been really helpful, we have a bigger budget, we were able to do a music video.  They've been willing to do anything we've really wanted. They're really supportive.\" The Blinded EP also saw the band incorporating more Godflesh-influenced industrial metal into their sound.\n"
   ]
}