{
   "Name": "Los Crudos",
   "rawData": [
      "Los Crudos is an American hardcore punk band from Chicago, Illinois active from 1991 to 1998 and from 2006 onward. Comprising all Latino members, the band paved the way for later Spanish-speaking punk bands in the United States and helped to increase the presence of Latinos in the country's predominantly white punk subculture.\n",
      "Los Crudos express a Left-wing political critique of issues affecting Latin America and the Latino community, such as U.S. imperialism, racism, xenophobia, and economic inequality. They have been described as \"one of '90s punk's truly great bands\" and \"one of the greatest hardcore bands...ever.\" Paul Kennedy additionally describes them as \"very popular in both the 'crusty' and Emo/straight edge scenes in North America.\"\n",
      "The band formed in the early 1990s by singer Martin Sorrondeguy and guitarist José Casas, who remained the group's consistent members through changing rhythm sections. Their lyrics were almost always sung in Spanish; the song \"We're That Spic Band\" (written in response to an audience member calling them a \"spic band\") is the sole exception. Los Crudos' lyrics were explicitly political, addressing issues such as class, police brutality, homophobia, and California ballot propositions directed against immigrants.  At concerts, Sorrondeguy would often speak at length about the songs' meanings between songs, partly as a way of getting around the language barrier (audiences were not always happy about this).  Their music was loud, fast, and energetic with songs built around three chords or fewer. \"We're That Spic Band\" and \"Asesinos\" (about \"the disappearances of radical youth during military dictatorships in Latin America\") have both been described as their most well-known songs.\n"
   ],
   "infobox": {
      "Origin": [
         "Pilsen, Chicago, Illinois, United States"
      ],
      "Genres": [
         "Hardcore punk"
      ],
      "Years active": [
         "1991–1998, 2006, 2008–2009, 2012–present"
      ],
      "Associated acts": [
         "Limp Wrist, I Attack, Charles Bronson, Punch in the Face, MK-ULTRA, Harto, Tragatelo"
      ],
      "Past members": [
         "Martin Sorrondeguy",
         "José Casas",
         "Juan Jimenez",
         "Ebro Virumbrales",
         "Oscar Chávez",
         "Joel Martinez",
         "Bryan",
         "Lenin",
         "Mando"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Chicago, Illinois active from [YEAR] to [YEAR] and from [YEAR] onward. Comprising all Latino members, the band paved the way for later Spanish-speaking punk bands in the United States and helped to increase the presence of Latinos in the country's predominantly white punk subculture.\n",
      "[BAND_NAME] express a Left-wing political critique of issues affecting Latin America and the Latino community, such as U.S. imperialism, racism, xenophobia, and economic inequality. They have been described as [SONG_NAME]\n",
      "The band formed in the early [YEAR]s by singer [MONTH]tin Sorrondeguy and guitarist [PERSON_NAME_FULL_0_MALE], who remained the group's consistent members through changing rhythm sections. Their lyrics were almost always sung in Spanish; the song [SONG_NAME]) have both been described as their most well-known songs.\n"
   ]
}