{
   "Name": "Pegboy",
   "rawData": [
      "Pegboy is an American punk band from Chicago, Illinois with a relatively large cult following. They were founded in 1990 by John Haggerty (ex-guitarist for Naked Raygun), along with his brother Joe Haggerty (drums, formerly of The Effigies), Larry Damore (vocals/guitar), and Steve Saylors (bass).  Both Damore and Saylors had been members of Chicago-based hardcore band Bhopal Stiffs, whose 1987 demo had been produced by John Haggerty. Pegboy's 1990 debut EP, \"Three-Chord Monte\", was also the first release by Quarterstick Records, an offshoot of Touch and Go Records.  Steve Saylors dropped out in 1992 after job commitments prevented him from touring.  Steve Albini, a longtime friend of the band, filled the bass slot on the \"Fore\" EP.  Former Naked Raygun bassist Pierre Kezdy became the permanent bass player in 1994. After the reformation of Naked Raygun, Mike Thompson took over for Kezdy on bass.\n",
      "Pegboy supposedly played a \"farewell\" show on New Year's Eve in 1999 but then denied that it was really a \"farewell\" show a few years later when they returned to live action.\n",
      "Pegboy has been touring through the summer of 2009 with Face to Face and Polar Bear Club.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois"
      ],
      "Genres": [
         "Punk rock"
      ],
      "Years active": [
         "1990-present"
      ],
      "Labels": [
         "Quarterstick"
      ],
      "Associated acts": [
         "Naked Raygun, Bhopal Stiffs"
      ],
      "Website": [
         "Myspace"
      ],
      "Members": [
         "John Haggerty ",
         "Joe Haggerty",
         " Larry Damore",
         "Mike Thompson"
      ],
      "Past members": [
         "Steve Saylors",
         " Steve Albini",
         " Pierre Kezdy"
      ]
   },
   "albums": [
      "Strong Reaction",
      "Earwig",
      "Cha Cha Damore"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Chicago, Illinois with a relatively large cult following. They were founded in [YEAR] by John [PERSON_NAME_LAST_3] (ex-guitarist for Naked Raygun), along with his brother [PERSON_NAME_FULL_3_MALE] (drums, formerly of The Effigies), [PERSON_NAME_FULL_1_MALE] (vocals/guitar), and [PERSON_NAME_FULL_0_MALE] (bass).  Both [PERSON_NAME_LAST_1] and [PERSON_NAME_LAST_0] had been members of Chicago-based hardcore band Bhopal Stiffs, whose [YEAR] demo had been produced by John [PERSON_NAME_LAST_3]. [BAND_NAME]'s [YEAR] debut EP, [SONG_NAME] EP.  Former Naked Raygun bassist Pierre Kezdy became the permanent bass player in [YEAR]. After the reformation of Naked Raygun, [PERSON_NAME_FULL_4_MALE] took over for Kezdy on bass.\n",
      "[BAND_NAME] supposedly played a [SONG_NAME] show a few years later when they returned to live action.\n",
      "[BAND_NAME] has been touring through the summer of [YEAR] with Face to Face and Polar Bear Club.\n"
   ]
}