{
   "Name": "Racetraitor",
   "rawData": [
      "Racetraitor is an American hardcore punk and metal band originally from Chicago, Illinois. The band attracted controversy in the late 1990s, before any releases, as a result of their radical take on racial politics, which focused on ideas like systematic racism and white privilege before they were widely discussed topics in popular or underground culture. Racetraitor was also a key proto-metalcore act being one of the first few bands to incorporate extreme metal influences, such as death metal, grindcore, and doom metal, into hardcore. \n",
      "In 1998, the band released their classic full length 'Burn the Idol of the White Messiah'. Burn the Idol was followed up by a split EP with Indianapolis band Burn It Down called Make Them Talk in 1999 before an initial breakup. The band has reformed as of 2016, releasing two EPs featuring new music and their second full length 2042.\n",
      "Racetraitor was formed by drummer Karl Hlavinka, guitarist Daniel Binaei, bassist Brent Decker, and vocalist Mani Mostofi, playing powerviolence/grindcore music. Early songs were extremely short and heavily filled with noise. The songs were recorded in a demo that was not publicly released till 2016.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, U.S."
      ],
      "Genres": [
         "Hardcore punk",
         "metalcore",
         "grindcore (early)"
      ],
      "Years active": [
         "1996–1999, 2016–present"
      ],
      "Labels": [
         "Good Life",
         "Uprising",
         "Trustkill",
         "Organized Crime Records",
         "Good Fight Music",
         "Ugly and Proud Records",
         "Carry The Weight Records"
      ],
      "Associated acts": [
         "Fall Out Boy",
         "Arma Angelus",
         "Killtheslavemaster",
         "The Kill Pill",
         "The Damned Things",
         "Creation is Crucifixion",
         "SECT"
      ],
      "Members": [
         "Andy Hurley",
         "Mani Mostofi",
         "Brent Decker",
         "Dan Binaei",
         "Andrea Black"
      ],
      "Past members": [
         "Karl Hlavinka",
         "Eric Bartholomae",
         "Pete Wentz",
         "Rich Miles"
      ]
   },
   "albums": [
      "Burn the Idol of the White  Messiah",
      "Make Them Talk",
      "By the Time I Get to Pennsylvania",
      "Continuing the tradition",
      "Burn the Idol of the White  Messiah: remix and remaster",
      "Invisible Battles Against Invisible Fortresses",
      "2042"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band originally from Chicago, Illinois. The band attracted controversy in the late [YEAR]s, before any releases, as a result of their radical take on racial politics, which focused on ideas like systematic racism and white privilege before they were widely discussed topics in popular or underground culture. [BAND_NAME] was also a key proto-metalcore act being one of the first few bands to incorporate extreme metal influences, such as death metal, grindcore, and doom metal, into hardcore. \n",
      "In [YEAR], the band released their classic full length 'Burn the Idol of the White Messiah'. Burn the Idol was followed up by a [GENRE] band Burn It Down called Make Them Talk in [YEAR] before an initial breakup. The band has reformed as of [YEAR], releasing two EPs featuring new music and their second full length [YEAR].\n",
      "[BAND_NAME] was formed by drummer [PERSON_NAME_FULL_0_MALE], guitarist Daniel Binaei, bassist Brent [MONTH]ker, and vocalist [PERSON_NAME_FULL_1_MALE], playing powerviolence/grindcore music. Early songs were extremely short and heavily filled with noise. The songs were recorded in a demo that was not publicly released till [YEAR].\n"
   ]
}