{
   "Name": "Racetraitor",
   "Sections": [
      "1 Early career",
      "2 \"Burn the Idol\" and \"Make Them Talk\"",
      "3 Post-breakup",
      "4 Reunion and \"2042\"",
      "5 Image",
      "6 Members",
      "6.1 Current members",
      "6.2 Former members",
      "7 Discography",
      "8 References",
      "9 External links"
   ],
   "Summary": {
      "text": [
         "Racetraitor is an American hardcore punk and metal band originally from Chicago, Illinois. The band attracted controversy in the late 1990s, before any releases, as a result of their radical take on racial politics, which focused on ideas like systematic racism and white privilege before they were widely discussed topics in popular or underground culture.[1] Racetraitor was also a key proto-metalcore act being one of the first few bands to incorporate extreme metal influences, such as death metal, grindcore, and doom metal, into hardcore. \n",
         "In 1998, the band released their classic full length 'Burn the Idol of the White Messiah'. Burn the Idol was followed up by a split EP with Indianapolis band Burn It Down called Make Them Talk in 1999 before an initial breakup. The band has reformed as of 2016, releasing two EPs featuring new music and their second full length 2042.\n",
         "\n"
      ]
   },
   "Early career": {
      "text": [
         "Racetraitor was formed by drummer Karl Hlavinka, guitarist Daniel Binaei, bassist Brent Decker, and vocalist Mani Mostofi, playing powerviolence/grindcore music. Early songs were extremely short and heavily filled with noise. The songs were recorded in a demo that was not publicly released till 2016.[2]\n",
         "In the early shows, Racetraitor took a more confrontational approach to spreading social justice ideas. The band became known for calling their own audience members \"crackers\", which the band explained as not a racial category but a term for people perpetuate racism and exploitation in their day-to-day lives.[3] During a performance in Columbus, Ohio during this period, the band members criticised members of Anti-Racist Action for focusing on white nationalist groups like the Ku Klux Klan rather than systemic issues such as institutional racism, leading to a physical altercation between the groups.[4]\n"
      ]
   },
   "\"Burn the Idol\" and \"Make Them Talk\"": {
      "text": [
         "A year into the band Andy Hurley joined them on drums and Hlavinka began performing as a guitarist. The band noted that when Hurely joined the band they changed sounds to match his technical ability, shifting from a noisy powerviolence band to something much closer to 90's death metal.[5] Hlavinka soon quit, only to return to the band on and off over the years. In 1997, the band went into Blue Iguana studios Lafayette Indiana to record their debut.  In 1998, Uprising Records released the album called 'Burn the Idol of the White Messiah'. Decker soon left the group, with a number of musicians playing bass in the band temporarily, including Fall Out Boy's Pete Wentz.[4]\n",
         "After the release of \"Burn the Idol\", the band started touring more extensively, around which time Eric Bartholomae joined the band on guitar. While playing Hellfest in Syracuse New York in 1998, the band struck up a friendship with Josh Grabelle of Trustkill Records who expressed interest in working with them.  Racetraitor released a split EP called Make Them Talk on Trustkill with Indianapolis band Burn It Down in 1999 and set off on their first full U.S. tour sharing a number of dates with Zao, Brother's Keeper, and Eighteen Visions. By the year's end, however, the band broke up.\n"
      ]
   },
   "Post-breakup": {
      "text": [
         "After Racetraitor, Hurley played drums in several other projects, including Killtheslavemaster and Project Rocket, and also joined Mostofi in The Kill Pill, who released one record on Uprising before disbanding. Hurley was also a guest drummer on Vegan Reich's \"Jihad\" EP. Most notably, Hurley joined Fall Out Boy with previous Racetraitor substitute bass player Pete Wentz. In 2016, Hurley joined the band SECT with members of Earth Crisis and Burning Love.\n",
         "Binaei went on to form Arma Angelus with Pete Wentz, which released one full-length album on Eulogy Recordings and an EP on the label Happy Couples Never Last, and Jay Jancetic (Harm's Way), as well as other bands. Karl Hlavinka left Racetraitor in 1997, joining the Pittsburgh band Creation is Crucifixion, continuing to appear occasionally with Racetraitor until they disbanded in 1999, and playing in other bands.\n",
         "Bass player Brent Decker works at the University of Illinois at Chicago School of Public Health. Mostofi played in a series of bands and completed further study. He now works as a human rights advocate. Bassist and guitarist Eric Bartholomae now plays guitar in Vegan Reich.\n"
      ]
   },
   "Reunion and \"2042\"": {
      "text": [
         "In 2016, Racetraitor announced via Facebook that a new remixed version of Burn the Idol would be re-released on vinyl. In October 2016, the band played its first show in 17 years with Detroit hardcore band Earthmover. In September 2016, the group released two new songs: \"By the Time I Get to Pennsylvania\" and \"Damaged\".[6] Hurley attributed the band's reformation to the current political situation.[7]\n",
         "In July 2017, Carry the Weight Records, from the UK, released reissue Burn the Idol of the White Messiah. The record was remixed by Dallas Thomas from Pelican. The same month Organized Crime Records released a new EP from Racetraitor called Invisible Battles Against Invisible Fortresses.\n",
         "Racetraitor announced their signing to Good Fight Music in October 2018, releasing their second full length 2042 with lead single \"BLK XMAS.\"[8] 2042 received strong critical acclaim, even landing in Vice Magazine's list of 100 Best Albums of 2018.[9] The second press of the Burn the Idol of the White Messiah reissue was also released on Good Fight in partnership with Ugly and Proud Records from Bulgaria.\n"
      ]
   },
   "Image": {
      "text": [
         "The band attracted controversy in the late 1990s as a result of their radical take on racial politics.[10] Racetraitor has been featured on the covers of both Maximumrocknroll and HeartattaCk before releasing any music.[10]Their political advocacy centered around anti-racism and anti-colonialism, discussing issues such as white privilege, class privilege, the war on drugs, biases in the US criminal justice system, economic globalization, and US foreign policy. The name of the band is a reappropriation of the pejorative term \"race traitor\" used by white American racists as a reference to using one's social and economic privilege to pursue social justice. The band's members were vegan and straight edge. After they developed a profile in the U.S. hardcore scene, Racetraitor's communication style became less confrontational. In 1999, Tacoma, Washington metalcore band Botch released the song \"C. Thomas Howell as the 'Soul Man'\" on their album We Are the Romans, a critique of Racetraitor's attitude to race politics.[4]\n"
      ]
   },
   "Members": {
      "Current members": {},
      "Former members": {}
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Racetraitor is an American hardcore punk and metal band originally from Chicago, Illinois. The band attracted controversy in the late 1990s, before any releases, as a result of their radical take on racial politics, which focused on ideas like systematic racism and white privilege before they were widely discussed topics in popular or underground culture.[1] Racetraitor was also a key proto-metalcore act being one of the first few bands to incorporate extreme metal influences, such as death metal, grindcore, and doom metal, into hardcore. \n",
      "In 1998, the band released their classic full length 'Burn the Idol of the White Messiah'. Burn the Idol was followed up by a split EP with Indianapolis band Burn It Down called Make Them Talk in 1999 before an initial breakup. The band has reformed as of 2016, releasing two EPs featuring new music and their second full length 2042.\n",
      "Racetraitor was formed by drummer Karl Hlavinka, guitarist Daniel Binaei, bassist Brent Decker, and vocalist Mani Mostofi, playing powerviolence/grindcore music. Early songs were extremely short and heavily filled with noise. The songs were recorded in a demo that was not publicly released till 2016.[2]\n",
      "In the early shows, Racetraitor took a more confrontational approach to spreading social justice ideas. The band became known for calling their own audience members \"crackers\", which the band explained as not a racial category but a term for people perpetuate racism and exploitation in their day-to-day lives.[3] During a performance in Columbus, Ohio during this period, the band members criticised members of Anti-Racist Action for focusing on white nationalist groups like the Ku Klux Klan rather than systemic issues such as institutional racism, leading to a physical altercation between the groups.[4]\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, U.S."
      ],
      "Genres": [
         "Hardcore punk",
         "metalcore",
         "grindcore (early)"
      ],
      "Years active": [
         "1996–1999, 2016–present"
      ],
      "Labels": [
         "Good Life",
         "Uprising",
         "Trustkill",
         "Organized Crime Records",
         "Good Fight Music",
         "Ugly and Proud Records",
         "Carry The Weight Records"
      ],
      "Associated acts": [
         "Fall Out Boy",
         "Arma Angelus",
         "Killtheslavemaster",
         "The Kill Pill",
         "The Damned Things",
         "Creation is Crucifixion",
         "SECT"
      ],
      "Members": [
         "Andy Hurley",
         "Mani Mostofi",
         "Brent Decker",
         "Dan Binaei",
         "Andrea Black"
      ],
      "Past members": [
         "Karl Hlavinka",
         "Eric Bartholomae",
         "Pete Wentz",
         "Rich Miles"
      ]
   }
}