{
   "Background": {
      "text": [
         "Strike Under was founded in 1979 or 1980. Although American punk is generally considered to have started four or five years earlier, punk and new wave music arrived in Chicago far later than on either coast, so that Strike Under is correctly still considered an \"early\" Chicago punk band.[citation needed] They can also be seen as one of the first and most important bands of the \"second wave\" of Chicago punk, as it turned toward a more hardcore scene and sound, and as an archetype of Chicago hardcore.\n",
         "In 1981, Strike Under released a 5-song 12\" EP record, Immediate Action, notable as the first release by the new label Wax Trax Records (the record is commonly known as WAX 001, although the actual catalog number is Wax Trax 103015X).[1][2] The album cover resembled a book of matches (the band's name derives from the phrase commonly seen on cheap matchbooks). Songs included \"Sunday Night Disorientation\", \"Context\", \"Closing In\", \"Elephant's Graveyard\" (which later appeared on the Wax Trax Best of boxed set), and the title track. Immediate Action received mixed reviews; however, as one of the first actual recordings by a local punk outfit in the Windy City, looms large in the memory of denizens of the early Chicago punk scene, and has been called an \"integral document to the history of punk rock in Chicago\".[3][4][5]\n",
         "Strike Under, besides releasing its own record, played out at clubs such as O'Banion's, and also appeared on the 1981 Busted at Oz LP, which is usually viewed as an historic document of the second wave of Chicago punk, recorded at the club Oz before it closed down.[6][7]\n",
         "Strike Under broke up in late 1981. Steve Bjorklund briefly formed another Chicago punk band, Terminal Beach, then ultimately relocated to Minneapolis to pursue playing and recording with various punk and industrial music bands, including Breaking Circus.[8] The other three members formed Trial By Fire, which played throughout Chicago in 1982. After Trial By Fire broke up, Pierre Kezdy went on to play with Naked Raygun and Pegboy. Chris Bjorklund played first with Bloodsport and then with The Effigies during the mid and late 1980s, the latter being another leading 1980s Chicago hardcore band who happened to be fronted by Pierre Kezdy's brother, John Kezdy.\n",
         "Strike Under was profiled in the 2007 documentary You Weren't There. The film featured interviews with both Bjorklund brothers and Pierre Kezdy.\n"
      ]
   },
   "Discography": {
      "Compilation Appearances": {},
      "Releases": {}
   },
   "External links": {},
   "References": {},
   "Sections": [
      "1 Background",
      "2 Discography",
      "2.1 Releases",
      "2.2 Compilation Appearances",
      "3 See also",
      "4 References",
      "5 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "Strike Under was an influential Chicago punk rock band of the early 1980s. It was started by Steve Bjorklund (vocals, guitar) after the demise of The Rabbits. The principal musicians, besides Bjorklund, were his brother Chris (guitar), Pierre Kezdy (bass), and Bob Furem (drums).\n"
      ]
   },
   "Title": "Strike Under - Wikipedia"
}