{
   "Name": "Tar (band)",
   "rawData": [
      "Tar was an American post-hardcore band, formed in 1988 in Chicago, Illinois. Throughout their career they released four studio albums, two extended plays, and a number of singles before breaking up in 1995. They were known for their dry sense of humor.\n",
      "The precursor to Tar was a hardcore punk outfit called Blatant Dissent, which formed in DeKalb, Illinois where singer/guitarist John Mohr and drummer Mike Greenlees were attending Northern Illinois University.  Joining Mohr and Greenlees in Tar were original bassist Tim Mescher (only until 1991 and who also played for Snailboy), bassist Tom Zaluckyj and guitarist Mark Zablocki. Zaluckyj and Mohr played unique instruments, crafted of aluminum, designed by Ian Schneller of Specimen Products.\n",
      "The band released albums on the Amphetamine Reptile and Touch and Go Records labels before disbanding in 1995. During its career, the band released a total of four singles, four albums, two mini albums, and contributed songs to six compilations and split singles.  The band toured nationally and internationally with bands such as Jawbox, Arcwelder, and the Jesus Lizard. In 1994 the band made the decision to call it quits after releasing one final album. Over and Out was written and recorded over a period of a year and a half, produced by the band and engineered by Steve Albini and Bob Weston, and released in 1995.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, United States"
      ],
      "Genres": [
         "Noise rock, post-hardcore"
      ],
      "Years active": [
         "1988–1995, 2012, 2017"
      ],
      "Labels": [
         "Touch and Go Records",
         "Amphetamine Reptile Records",
         "No Blow Records"
      ],
      "Associated acts": [
         "Snailboy, Blatant Dissent"
      ],
      "Members": [
         "Mike Greenlees",
         "John Mohr",
         "Mark Zablocki",
         "Tom Zaluckyj"
      ],
      "Past members": [
         "Tim Mescher"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band, formed in [YEAR] in Chicago, Illinois. Throughout their career they released four studio albums, two extended plays, and a number of singles before breaking up in [YEAR]. They were known for their dry sense of humor.\n",
      "The precursor to [BAND_NAME] was a hardcore punk outfit called Blatant Dissent, which formed in DeKalb, Illinois where singer/guitarist John Mohr and drummer [PERSON_NAME_FULL_2_MALE] were attending Northern Illinois University.  Joining Mohr and [PERSON_NAME_LAST_2] in [BAND_NAME] were original bassist [PERSON_NAME_FULL_0_MALE] (only until [YEAR] and who also played for Snailboy), bassist Tom Zaluckyj and guitarist [MONTH]k Zablocki. Zaluckyj and Mohr played unique instruments, crafted of aluminum, designed by [PERSON_NAME_FULL_1_MALE] of Specimen Products.\n",
      "The band released albums on the Amphetamine Reptile and Touch and Go Records labels before disbanding in [YEAR]. During its career, the band released a [GENRE] band toured nationally and internationally with bands such as Jawbox, Arcwelder, and the Jesus Lizard. In [YEAR] the band made the decision to call it quits after releasing one final album. Over and Out was written and recorded over a period of a year and a half, produced by the band and engineered by [PERSON_NAME_FULL_0_MALE] and Bob Weston, and released in [YEAR].\n"
   ]
}