{
   "Name": "The 77s",
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Promotional singles",
      "3 7&7iS",
      "3.1 7&7iS discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The 77s (alternatively spelled the Seventy Sevens or the 77's) is an American rock band consisting of Michael Roe on vocals/guitar, Mark Harmon on bass guitar, and Bruce Spencer on drums.\n"
      ]
   },
   "History": {
      "text": [
         "The group was “formed at a church by a church” under the name Scratch Band in Sacramento, California, during the late 1970s according to Mike Roe.[1] Accompanying him were Mark Tootle on guitar and keyboards, Jan Eric Volz on bass guitar, and Mark Proctor on drums. They were occasionally joined by singer Sharon McCall and guitarist Jimmy A. Their repertoire included originals and songs by English poet Steve Scott among others. The “church” that brought the players together was Sacramento's Warehouse Christian Ministries with the band being a part of the ministries artistic outreach, performing every weekend at the Warehouse.[1][2] The name of the band was changed to The Seventy Sevens before the release of their first album, Ping Pong Over the Abyss in 1982, on WCM’s own Exit label. While the meaning of the group's name has never been revealed, it is thought to be derived from either Matt 18:22, Daniel 9 or, simply, a year – possibly 1977 – which holds some significance to the band. In 1984, the group toured with labelmate Vector and Resurrection Band with all 3 bands playing the very first Cornerstone festival.[1]\n",
         "When Proctor left the band, he was replaced by Aaron Smith, who appeared on the album All Fall Down (1984) and remained with the band until 1995. Smith had been a former sideman with Ray Charles and The Temptations and a member of Vector.[1][2] The next album, The Seventy Sevens, was released by Island Records in 1987. While the album received favorable reviews, it did not sell as well as it might; the reason being The Joshua Tree by labelmate U2 was released that same year. In his article on the subject, John Thompson (True Tunes) thought it likely that Island put most of its resources into promoting The Joshua Tree while others on the label received less promotional support. The album received a positive review by Rolling Stone critic, Margot Mifflin: \"the 77s have come up with a sound that suggests not only that they know where they’re coming from, but also that they’re going places\". Mark Alan Powell called it \"an artistic masterpiece – probably one of the ten best albums of the year not simply in the Christian market but in rock and roll, period\".[1]\n",
         "A compilation album – Sticks and Stones (1990) and a live album – 88 (1991) (which contained a manic version of Over, Under, Sideways, Down) were released after their eponymous Island Records release. At some point in 1992 Tootle and Volz left the band which left Roe as the only original member. David Leonhardt (guitar) joined in early 1992 with Mark Harmon (bass) joining that year also, replacing Tootle and Volz.[1]\n",
         "Pray Naked was released in 1992 but the title was changed by the label, Word Records, to The Seventy Sevens. The album title change would cause confusion in the minds of consumers and marketers since the 1987 album on Island bore the same name.[1] This was followed by  Drowning with Land in Sight in 1994. Leonhardt and Smith left the band soon after, with Smith being replaced by former bandmate Bruce Spencer of Vector. This change brought about a new version of the band, namely a power trio line up with Harmon, Roe and Spencer which started referring to itself as “the band that won’t go away”. It also brought the release of Tom Tom Blues (1995).[1]\n",
         "At the end of the 1996, The 77s started the label Fools of the World and reissued some of its albums. New material was also released following the label's formation: Echoes o' Faith (1996 live acoustic material), EP (1999) and A Golden Field of Radioactive Crows (2001).[2] Also, Scott Reams occasionally played in the band during concerts beginning in 2000.[1]\n",
         "In 2010, The 77's participated in the tribute album Mister Bolin's Late Night Revival, a compilation of 17 unreleased tracks written by Tommy Bolin. [3]\n",
         "Critically, the 77s are considered by fans and music critics; such as Dwight Ozzard (Prism magazine), Brian Quincy Newcomb (HM) and John Thompson (True Tunes), as the greatest – or “best” depending on whom one might quote, rock and roll band in the world.[1]\n"
      ]
   },
   "Discography": {
      "Promotional singles": {}
   },
   "7&7iS": {
      "7&7iS discography": {},
      "text": [
         "Members of The 77s have used the moniker 7&7is to release projects that they do not see as fitting under their regular band name.  The name comes from the title of a classic song by the 60s music group Love, called \"7 and 7 Is.\"\n",
         "The name was first used for Alternative Records' 1989 collection of rarities and outtakes (later released as More Miserable Than You'll Ever Be). The name was revived in 2004 for Fun with Sound, a collaboration between lead singer Michael Roe and bassist Mark Harmon. Harmon and Roe also toured that year under the name.\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The 77s (alternatively spelled the Seventy Sevens or the 77's) is an American rock band consisting of Michael Roe on vocals/guitar, Mark Harmon on bass guitar, and Bruce Spencer on drums.\n",
      "The group was “formed at a church by a church” under the name Scratch Band in Sacramento, California, during the late 1970s according to Mike Roe.[1] Accompanying him were Mark Tootle on guitar and keyboards, Jan Eric Volz on bass guitar, and Mark Proctor on drums. They were occasionally joined by singer Sharon McCall and guitarist Jimmy A. Their repertoire included originals and songs by English poet Steve Scott among others. The “church” that brought the players together was Sacramento's Warehouse Christian Ministries with the band being a part of the ministries artistic outreach, performing every weekend at the Warehouse.[1][2] The name of the band was changed to The Seventy Sevens before the release of their first album, Ping Pong Over the Abyss in 1982, on WCM’s own Exit label. While the meaning of the group's name has never been revealed, it is thought to be derived from either Matt 18:22, Daniel 9 or, simply, a year – possibly 1977 – which holds some significance to the band. In 1984, the group toured with labelmate Vector and Resurrection Band with all 3 bands playing the very first Cornerstone festival.[1]\n",
      "When Proctor left the band, he was replaced by Aaron Smith, who appeared on the album All Fall Down (1984) and remained with the band until 1995. Smith had been a former sideman with Ray Charles and The Temptations and a member of Vector.[1][2] The next album, The Seventy Sevens, was released by Island Records in 1987. While the album received favorable reviews, it did not sell as well as it might; the reason being The Joshua Tree by labelmate U2 was released that same year. In his article on the subject, John Thompson (True Tunes) thought it likely that Island put most of its resources into promoting The Joshua Tree while others on the label received less promotional support. The album received a positive review by Rolling Stone critic, Margot Mifflin: \"the 77s have come up with a sound that suggests not only that they know where they’re coming from, but also that they’re going places\". Mark Alan Powell called it \"an artistic masterpiece – probably one of the ten best albums of the year not simply in the Christian market but in rock and roll, period\".[1]\n",
      "A compilation album – Sticks and Stones (1990) and a live album – 88 (1991) (which contained a manic version of Over, Under, Sideways, Down) were released after their eponymous Island Records release. At some point in 1992 Tootle and Volz left the band which left Roe as the only original member. David Leonhardt (guitar) joined in early 1992 with Mark Harmon (bass) joining that year also, replacing Tootle and Volz.[1]\n"
   ],
   "infobox": {
      "Origin": [
         "Sacramento, California, U.S."
      ],
      "Genres": [
         "Rock, Christian rock, Christian alternative rock, new wave"
      ],
      "Years active": [
         "1979–present"
      ],
      "Labels": [
         "Exit",
         "Island",
         "Broken",
         "Myrrh",
         "Brainstorm Artists, Intl",
         "Galaxy21",
         "Fools of the World",
         "Lo-Fidelity"
      ],
      "Website": [
         "www.77s.com"
      ],
      "Members": [
         "Michael Roe",
         "Mark Harmon",
         "Bruce Spencer"
      ],
      "Past members": [
         "Mark Proctor",
         "Jan Eric Volz",
         "Mark Tootle",
         "Aaron Smith",
         "David Leonhardt"
      ]
   }
}