{
   "Name": "The 77s",
   "rawData": [
      "The 77s (alternatively spelled the Seventy Sevens or the 77's) is an American rock band consisting of Michael Roe on vocals/guitar, Mark Harmon on bass guitar, and Bruce Spencer on drums.\n",
      "The group was “formed at a church by a church” under the name Scratch Band in Sacramento, California, during the late 1970s according to Mike Roe. Accompanying him were Mark Tootle on guitar and keyboards, Jan Eric Volz on bass guitar, and Mark Proctor on drums. They were occasionally joined by singer Sharon McCall and guitarist Jimmy A. Their repertoire included originals and songs by English poet Steve Scott among others. The “church” that brought the players together was Sacramento's Warehouse Christian Ministries with the band being a part of the ministries artistic outreach, performing every weekend at the Warehouse. The name of the band was changed to The Seventy Sevens before the release of their first album, Ping Pong Over the Abyss in 1982, on WCM’s own Exit label. While the meaning of the group's name has never been revealed, it is thought to be derived from either Matt 18:22, Daniel 9 or, simply, a year – possibly 1977 – which holds some significance to the band. In 1984, the group toured with labelmate Vector and Resurrection Band with all 3 bands playing the very first Cornerstone festival.\n",
      "When Proctor left the band, he was replaced by Aaron Smith, who appeared on the album All Fall Down (1984) and remained with the band until 1995. Smith had been a former sideman with Ray Charles and The Temptations and a member of Vector. The next album, The Seventy Sevens, was released by Island Records in 1987. While the album received favorable reviews, it did not sell as well as it might; the reason being The Joshua Tree by labelmate U2 was released that same year. In his article on the subject, John Thompson (True Tunes) thought it likely that Island put most of its resources into promoting The Joshua Tree while others on the label received less promotional support. The album received a positive review by Rolling Stone critic, Margot Mifflin: \"the 77s have come up with a sound that suggests not only that they know where they’re coming from, but also that they’re going places\". Mark Alan Powell called it \"an artistic masterpiece – probably one of the ten best albums of the year not simply in the Christian market but in rock and roll, period\".\n"
   ],
   "infobox": {
      "Origin": [
         "Sacramento, California, U.S."
      ],
      "Genres": [
         "Rock, Christian rock, Christian alternative rock, new wave"
      ],
      "Years active": [
         "1979–present"
      ],
      "Labels": [
         "Exit",
         "Island",
         "Broken",
         "Myrrh",
         "Brainstorm Artists, Intl",
         "Galaxy21",
         "Fools of the World",
         "Lo-Fidelity"
      ],
      "Website": [
         "www.77s.com"
      ],
      "Members": [
         "Michael Roe",
         "Mark Harmon",
         "Bruce Spencer"
      ],
      "Past members": [
         "Mark Proctor",
         "Jan Eric Volz",
         "Mark Tootle",
         "Aaron Smith",
         "David Leonhardt"
      ]
   }
}