{
   "Name": "After Edmund",
   "rawData": [
      "After Edmund was an art rock band from LaGrange, Georgia.\n",
      "The members of After Edmund formed as a band in 2001, originally under the name Taken. During that time they had five independent releases: Not the Typical EP (2002), Moonlight E-CD Single and ARE You Listening? in 2003, and Amplified EP (2004). The SA BA DE EP in 2005 was Taken's final independent release before the band changed their name to After Edmund. The name is a reference to the character Edmund Pevensie in the book series The Chronicles of Narnia by C. S. Lewis.\n",
      "In November 2006, the band signed onto Slanted Records and began recording for their first main studio album until February 2007. It was originally prepared for release in mid-2007, but the date was pushed forward to February of the following year. The album is reportedly the same version as the original demo releases in 2007, but instead \"gave Slanted Records more time to market After Edmund just right.\"  The album was finally released under the title Hello on February 26, 2008, nearly a year after the band finished recording it. The album was produced by Scotty Wilbanks.\n"
   ],
   "infobox": {
      "Origin": [
         "LaGrange, Georgia, USA"
      ],
      "Genres": [
         "Art rock, rock and roll, Christian rock"
      ],
      "Years active": [
         "2001–2015"
      ],
      "Labels": [
         "Slanted"
      ],
      "Website": [
         "AfterEdmund.com"
      ],
      "Past members": [
         "Mitch Parks",
         "Joey West",
         "Austin Abbott",
         "Adam Stanley",
         "Yates",
         "Matt McFadden",
         "Ben Hosey"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from LaGrange, Georgia.\n",
      "The members of [BAND_NAME] formed as a band in [YEAR], originally under the name Taken. During that time they had five independent releases: Not the Typical EP ([YEAR]), Moonlight E-CD Single and ARE You Listening? in [YEAR], and Amplified EP ([YEAR]). The SA BA DE EP in [YEAR] was Taken's final independent release before the band changed their name to [BAND_NAME]. The name is a reference to the character [PERSON_NAME_FULL_0_MALE] in the book series The Chronicles of Narnia by C. S. Lewis.\n",
      "In [MONTH] [YEAR], the band signed onto Slanted Records and began recording for their first main studio album until [MONTH] [YEAR]. It was originally prepared for release in mid-[YEAR], but the date was pushed forward to [MONTH] of the following year. The album is reportedly the same version as the original demo releases in [YEAR], but instead \"gave Slanted Records more time to market [BAND_NAME] just right.\"  The album was finally released under the title Hello on [MONTH] 26, [YEAR], nearly a [GENRE] band finished recording it. The album was produced by [PERSON_NAME_FULL_0_MALE].\n"
   ]
}