{
   "Name": "All Together Separate",
   "rawData": [
      "All Together Separate was a Christian rock band from Riverside, California, USA. They are frequently compared to Earth, Wind and Fire.\n",
      "The group was formed at California Baptist University in the late 1990s, and first began playing for student conferences and retreats. Originally known as Praise House, they changed their name to All Together Separate because of complications with a Christian techno group with the same name around at the same time. Signing to Ardent Records, their first album was released in 1999, and was nominated for a Dove Award for Best Rock Album in 2000. In 2001, Ardent released a live album recorded at their home church, Harvest Christian Fellowship.\n",
      "Guitarist Andrew Shirley became a touring member of Switchfoot in 2003, and a full member of the band subsequently.\n"
   ],
   "infobox": {
      "Origin": [
         "Riverside, California, U.S."
      ],
      "Genres": [
         "CCM, Funk rock"
      ],
      "Years active": [
         "1997-2003"
      ],
      "Labels": [
         "Ardent Records"
      ],
      "Associated acts": [
         "Switchfoot"
      ],
      "Past members": [
         "Andrew Shirley",
         "Ben Rayls",
         "Dex Alexander",
         "Charles Rumahlewang"
      ]
   },
   "albums": [
      "All Together Separate",
      "Ardent Worship Live",
      "Unusual"
   ],
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band from Riverside, California, USA. They are frequently compared to Earth, Wind and Fire.\n",
      "The group was formed at California Baptist University in the late [YEAR]s, and first began playing for student conferences and retreats. Originally known as Praise House, they changed their name to [BAND_NAME] because of complications with a Christian techno group with the same name around at the same time. Signing to Ardent Records, their first album was released in [YEAR], and was nominated for a Dove Award for Best Rock Album in [YEAR]. In [YEAR], Ardent released a live album recorded at their home church, Harvest Christian Fellowship.\n",
      "Guitarist Andrew Shirley became a touring member of Switchfoot in [YEAR], and a full member of the band subsequently.\n"
   ]
}