{
   "Name": "The Action Design",
   "rawData": [
      "The Action Design is an American rock band formed in Petaluma, California, after the breakup of the former punk rock band Tsunami Bomb. Emily Whitehurst and Matt McKenzie came together to produce a new band self-described as \"a refreshing mix of the band's punk rock roots infused with hard hitting dance rhythms and catchy basslines wrought with think memorable vocal hooks\". In January 2011, on their official Facebook page, the band announced its members are currently focusing on other musical projects rather than The Action Design.\n",
      "While the original line-up consisted of McKenzie, Whitehurst and drummer Brett Friesen; Brett was replaced shortly after the release of their first EP at the end of 2006. Taking over drumming duties would be Jake Krohn, formerly of The Rum Diary; also added to The Action Design crew would be Jaycen McKissick, formerly of Pipedown, on guitar. With the addition of Krohn and McKissick, The Action Design would complete their line-up. In order to begin touring and playing shows as soon as possible, they enlisted Bobby from the band Kiev to fill in on keyboards for their first tour as a band on the 2007 Warped Tour. The band later began playing their set as a foursome without Bobby who returned to his work with his band. Each band member began pulling double duty; picking up the keyboard parts on their respective instruments.\nThe Action Design released a limited edition EP with only 1000 pressings in the fall of 2006 and quickly sold out without having played a single show. This version of the EP was recorded when the band was still a three piece and did not feature much guitar work (if any on most of the recordings). It also contained the song \"Move On\" which was later omitted from the Popsmear released version of the E.P. \"Into a Sound\". This original pressing was completely self-published, with all of the artwork hand-printed and numbered by the band.\n",
      "Almost eight months later came the new EP, with a new added cover and insert art. Along with the change in visual appearance, the EP contained two new songs written with new drummer Jake Krohn and added guitar work by Jaycen McKissick to the previously recorded songs.\nDrums on tracks 1, 3, 4, 6 by Brett Friesen.\n"
   ],
   "infobox": {
      "Origin": [
         "Petaluma, California, U.S."
      ],
      "Genres": [
         "Indie",
         "power pop"
      ],
      "Labels": [
         "Your New Boyfriend",
         "Popsmear"
      ],
      "Members": [
         "Emily Whitehurst",
         "Jake Krohn",
         "Jaycen Mckissick",
         "Matt Mckenzie"
      ],
      "Past members": [
         "Brett Friesen"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in Petaluma, California, after the breakup of the former punk rock band Tsunami Bomb. [PERSON_NAME_FULL_0_FEMALE] and Matt McKenzie came together to produce a new band self-described as [SONG_NAME]. In [MONTH] [YEAR], on their official Facebook page, the band announced its members are currently focusing on other musical projects rather than [BAND_NAME].\n",
      "While the original line-up consisted of McKenzie, Whitehurst and drummer [PERSON_NAME_FULL_1_MALE]; [PERSON_NAME_FIRST_1] was replaced shortly after the release of their first EP at the end of [YEAR]. Taking over drumming duties would be [PERSON_NAME_FULL_0_MALE], formerly of The Rum Diary; also added to [BAND_NAME] crew would be Jaycen McKissick, formerly of Pipedown, on guitar. With the addition of [PERSON_NAME_LAST_0] and McKissick, [BAND_NAME] would complete their line-up. In order to begin touring and playing shows as soon as possible, they enlisted Bobby from the band Kiev to fill in on keyboards for their first tour as a band on the [YEAR] Warped Tour. The band later began playing their set as a foursome without Bobby who returned to his work with his band. Each band member began pulling double duty; picking up the keyboard parts on their respective instruments.\n[BAND_NAME] released a limited edition EP with only [YEAR] pressings in the fall of [YEAR] and quickly sold out without having played a single show. This version of the EP was recorded when the band was still a three piece and did not feature much guitar work (if any on most of the recordings). It also contained the song [SONG_NAME]. This original pressing was completely self-published, with all of the artwork hand-printed and numbered by the band.\n",
      "Almost eight months later came the new EP, with a new added cover and insert art. Along with the change in visual appearance, the EP contained two new songs written with new drummer [PERSON_NAME_FULL_0_MALE] and added guitar work by Jaycen McKissick to the previously recorded songs.\nDrums on tracks 1, 3, 4, 6 by [PERSON_NAME_FULL_1_MALE].\n"
   ]
}