{
   "Name": "The Action Design",
   "Sections": [
      "Summary"
   ],
   "Summary": {
      "text": [
         "The Action Design is an American rock band formed in Petaluma, California, after the breakup of the former punk rock band Tsunami Bomb. Emily Whitehurst and Matt McKenzie came together to produce a new band self-described as \"a refreshing mix of the band's punk rock roots infused with hard hitting dance rhythms and catchy basslines wrought with think memorable vocal hooks\". In January 2011, on their official Facebook page, the band announced its members are currently focusing on other musical projects rather than The Action Design.\n",
         "While the original line-up consisted of McKenzie, Whitehurst and drummer Brett Friesen; Brett was replaced shortly after the release of their first EP at the end of 2006. Taking over drumming duties would be Jake Krohn, formerly of The Rum Diary; also added to The Action Design crew would be Jaycen McKissick, formerly of Pipedown, on guitar. With the addition of Krohn and McKissick, The Action Design would complete their line-up. In order to begin touring and playing shows as soon as possible, they enlisted Bobby from the band Kiev to fill in on keyboards for their first tour as a band on the 2007 Warped Tour. The band later began playing their set as a foursome without Bobby who returned to his work with his band. Each band member began pulling double duty; picking up the keyboard parts on their respective instruments.\nThe Action Design released a limited edition EP with only 1000 pressings in the fall of 2006 and quickly sold out without having played a single show. This version of the EP was recorded when the band was still a three piece and did not feature much guitar work (if any on most of the recordings). It also contained the song \"Move On\" which was later omitted from the Popsmear released version of the E.P. \"Into a Sound\". This original pressing was completely self-published, with all of the artwork hand-printed and numbered by the band.\n",
         "Almost eight months later came the new EP, with a new added cover and insert art. Along with the change in visual appearance, the EP contained two new songs written with new drummer Jake Krohn and added guitar work by Jaycen McKissick to the previously recorded songs.\nDrums on tracks 1, 3, 4, 6 by Brett Friesen.\n",
         "After the September 11, 2007 release of \"Into a Sound\", the band embarked on their first full coast to coast US tour; booked completely on their own without an agent. After the tour came to an end in December 2007, the band returned to San Francisco where they began making plans for 2008; which include a new release, extensive touring and a new video for the song \"Connect/Disconnect\", directed by music video director Djay Brawner.\n",
         "A new album, Never Say, was released on September 23, 2008.\n",
         "The Action Design's first vinyl release, Desperation, was officially released July 14, 2010. They first started selling it at their summer tour shows and then online at the official store. Its track list consists of the title track, the long-awaited \"Desperation\", along with the b-side \"Still Standing.\" Only 500 copies were pressed, 350 copies were taken on tour for the merchandise table and the 150 left were put up on the official store.  Each copy came with its own download card, so you could have digital copies as well. Each vinyl was completely hand-decorated and hand-numbered by the band. The covers are screen printed, spray painted, stickered and markered. Each 100 copies of the vinyl were written with a different color so you could collect all 5.\n"
      ]
   },
   "coreData": [
      "The Action Design is an American rock band formed in Petaluma, California, after the breakup of the former punk rock band Tsunami Bomb. Emily Whitehurst and Matt McKenzie came together to produce a new band self-described as \"a refreshing mix of the band's punk rock roots infused with hard hitting dance rhythms and catchy basslines wrought with think memorable vocal hooks\". In January 2011, on their official Facebook page, the band announced its members are currently focusing on other musical projects rather than The Action Design.\n",
      "While the original line-up consisted of McKenzie, Whitehurst and drummer Brett Friesen; Brett was replaced shortly after the release of their first EP at the end of 2006. Taking over drumming duties would be Jake Krohn, formerly of The Rum Diary; also added to The Action Design crew would be Jaycen McKissick, formerly of Pipedown, on guitar. With the addition of Krohn and McKissick, The Action Design would complete their line-up. In order to begin touring and playing shows as soon as possible, they enlisted Bobby from the band Kiev to fill in on keyboards for their first tour as a band on the 2007 Warped Tour. The band later began playing their set as a foursome without Bobby who returned to his work with his band. Each band member began pulling double duty; picking up the keyboard parts on their respective instruments.\nThe Action Design released a limited edition EP with only 1000 pressings in the fall of 2006 and quickly sold out without having played a single show. This version of the EP was recorded when the band was still a three piece and did not feature much guitar work (if any on most of the recordings). It also contained the song \"Move On\" which was later omitted from the Popsmear released version of the E.P. \"Into a Sound\". This original pressing was completely self-published, with all of the artwork hand-printed and numbered by the band.\n",
      "Almost eight months later came the new EP, with a new added cover and insert art. Along with the change in visual appearance, the EP contained two new songs written with new drummer Jake Krohn and added guitar work by Jaycen McKissick to the previously recorded songs.\nDrums on tracks 1, 3, 4, 6 by Brett Friesen.\n",
      "After the September 11, 2007 release of \"Into a Sound\", the band embarked on their first full coast to coast US tour; booked completely on their own without an agent. After the tour came to an end in December 2007, the band returned to San Francisco where they began making plans for 2008; which include a new release, extensive touring and a new video for the song \"Connect/Disconnect\", directed by music video director Djay Brawner.\n"
   ]
}