{
   "Name": "A Band Called David",
   "rawData": [
      "a band called David was a group of musicians who provided the instrumental support from 1974 until 1988 for the 2nd Chapter of Acts, a Contemporary Christian music group.\n",
      "The members of the band, without a name, played informally together and attended The Church on the Way in Van Nuys, California, where they met 2nd Chapter of Acts, who also attended there. They chose their name because of a sermon by Pastor Jack W. Hayford describing David as a man after God's heart, as seeking God's heart was an important motivation of the members of the band. The name of the band was always in lower case to take the emphasis off of themselves and keep it on the 2nd Chapter of Acts.\n",
      "The original members of the band were bass guitarist Herb Melton, keyboardist Richard Souther, guitarists Rick Azim and Paul Offenbacher, and drummer Gene Gunnels, who had played with the psychedelic bubblegum band Strawberry Alarm Clock on their hit record \"Incense and Peppermints\" in 1967.  (He left Strawberry Alarm Clock for two years and rejoined them from 1969 to 1971.)  Azim and Offenbacher were replaced by Peter York. Gunnels left the band in 1980 and Jack Kelly joined as a member until the 2nd Chapter of Acts stopped touring in 1988. Kelly had previously substituted for Gunnels, when Gunnels took time off from touring in 1975. Richard Souther left in the early 1980s and was replaced by Greg Springer.\n"
   ],
   "infobox": {},
   "albums": [],
   "prunedData": [
      "a band called David was a group of musicians who provided the instrumental support from [YEAR] until [YEAR] for the 2nd Chapter of Acts, a Contemporary Christian music group.\n",
      "The members of the band, without a [GENRE] a sermon by [PERSON_NAME_FULL_0_MALE] W. Hayford describing David as a man after God's heart, as seeking God's heart was an important motivation of the members of the band. The name of the band was always in lower case to take the emphasis off of themselves and keep it on the 2nd Chapter of Acts.\n",
      "The original members of the band were bass guitarist Herb Melton, keyboardist [PERSON_NAME_FULL_0_MALE], guitarists Rick Azim and [PERSON_NAME_FULL_1_MALE], and drummer Gene Gunnels, who had played with the psychedelic bubblegum band Strawberry Alarm Clock on their hit record [SONG_NAME] in [YEAR].  (He left Strawberry Alarm Clock for two years and rejoined them from [YEAR] to [YEAR].)  Azim and [PERSON_NAME_LAST_1] were replaced by [PERSON_NAME_FULL_2_MALE]. Gunnels left the band in [YEAR] and Jack Kelly joined as a member until the 2nd Chapter of Acts stopped touring in [YEAR]. Kelly had previously substituted for Gunnels, when Gunnels took time off from touring in [YEAR]. [PERSON_NAME_FULL_0_MALE] left in the early [YEAR]s and was replaced by [PERSON_NAME_FULL_3_MALE].\n"
   ]
}