{
   "Name": "Big Dismal",
   "rawData": [
      "Big Dismal is a Florida-based post-grunge Christian Rock band featuring vocalist Eric Durrance, guitarist Chuck Shea, bassist Gary Sobel, and drummer Corey Lane. Before the band found its way to Wind-Up, it was essentially just Durrance, toiling away in Tallahassee's local scene. Eventually, his solo recordings (and Christian beliefs) sparked the interest of the label, and with the addition of his supporting players renamed the project Big Dismal. Believe, the official debut, appeared in May 2003. It showcased a familiar and faith-based post-grunge sound similar to Creed or 3 Doors Down.\n",
      "Rolling Stone named Big Dismal one of \"Five Christian Bands on the Rise\" and the band had three consecutive No. 1 Singles off their debut record, Believe on Christian Rock radio (Remember, I.O.U., Reality and Just The Same). The band's first No. 1 Single, (Remember, I.O.U.) was named Song of the Year in Christian Rock Radio by Radio and Records, having remained at No. 1 on the chart for over (6) weeks. The song was also used in the Chris Benoit tribute edition of Raw. Big Dismal was also named Band of the Year in the Christian Rock market by Radio and Records and were also nominated for a Dove award in 2004 for Christian Rock Album of the Year. Music videos were created for each of their No. 1 Singles as well as for the song \"Rainy Day.\"\n",
      "The \"Believe\" album for Wind-Up received critical acclaim but failed to sell well. Front man Eric Durrance eventually announced that the band have split. Eric Durrance then became a member of Tobacco Rd Band.  In February 2015 the band announced that they had reformed and a new EP would be available later in the year.\n"
   ],
   "infobox": {
      "Origin": [
         "Florida"
      ],
      "Genres": [
         "Christian rock"
      ],
      "Years active": [
         "2003–present"
      ],
      "Labels": [
         "Wind-Up"
      ],
      "Members": [
         "Eric Durrance",
         "Chuck Shea",
         "Gary Sobel",
         "Corey Lane"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band featuring vocalist [PERSON_NAME_FULL_1_MALE], guitarist Chuck Shea, bassist [PERSON_NAME_FULL_0_MALE], and drummer Corey Lane. Before the band found its way to Wind-Up, it was essentially just [PERSON_NAME_LAST_1], toiling away in Tallahassee's local scene. Eventually, his solo recordings (and Christian beliefs) sparked the interest of the label, and with the addition of his supporting players renamed the project [BAND_NAME]. Believe, the official debut, appeared in [MONTH] [YEAR]. It showcased a familiar and faith-based post-grunge sound similar to Creed or 3 Doors Down.\n",
      "Rolling Stone named [BAND_NAME] one of [SONG_NAME]\n",
      "The [SONG_NAME] album for Wind-Up received critical acclaim but failed to sell well. Front man [PERSON_NAME_FULL_0_MALE] eventually announced that the band have split. [PERSON_NAME_FULL_0_MALE] then became a member of Tobacco Rd Band.  In [MONTH] [YEAR] the band announced that they had reformed and a new EP would be available later in the year.\n"
   ]
}