{
   "Name": "Blindside (band)",
   "Sections": [
      "1 History",
      "1.1 Beginnings, Self titled album and A Thought Crushed My Mind (1994-2001)",
      "1.2 Silence and About a Burning Fire (2002-2004)",
      "1.3 The Great Depression and The Black Rose EP (2005-2007)",
      "1.4 Hiatus (2008-2010)",
      "1.5 With Shivering Hearts We Wait (2011-present)",
      "2 Discography",
      "3 Singles",
      "4 Videography",
      "5 Further reading",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Blindside is a Swedish post-hardcore band from the southern suburbs of Stockholm, Sweden.[3] They formed in Stockholm in 1994 as Underfree. In 1996, they changed their name to Blindside and released the Blindside album in 1997 through Swedish independent record company Day-Glo Records.  Another album, A Thought Crushed My Mind, came out in 2000. The group received greater attention in 2001 when they toured with P.O.D., resulting in a contract with Elektra. In 2002 they released the album Silence and in 2003 they toured in support of Hoobastank. A 2004 headlining tour suffered equipment theft but then Blindside released About a Burning Fire. Losing support from their label, the next year Blindside released The Great Depression independently, and they put out the DVD Ten Years Running Blind.[4]\n",
         "Blindside independently released another EP in 2007 – The Black Rose – but then they ceased most band activity until 2011 when they released With Shivering Hearts We Wait.\n"
      ]
   },
   "History": {
      "Beginnings, Self titled album and A Thought Crushed My Mind (1994-2001)": {
         "text": [
            "Blindside was formed in 1994 by the original line up. In 1997, Blindside debuted in Sweden with their self-titled debut, a collection of old and new songs that were based on singer Christian Lindskog's life at the time. In 1998 Blindside released the Empty Box EP on Day-Glo Records as a follow up to their self-titled debut. In 1997, Tooth & Nail Records got a hold of their debut album and signed a licensing deal with Blindside.  The US debut was released later that year by Tooth & Nail and featured songs both from the Swedish full-length debut and from the EP Empty Box. In 2000, A Thought Crushed My Mind was released.  A Thought Crushed My Mind was more harsh and hardcore than the band's debut, and vocalist/chief lyricist Christian Lindskog also voiced his pain of missing his wife, Elina, while touring.  It would be Blindside's final album with Solid State. Fellow group P.O.D. began actively endorsing Blindside and signed them to Elektra Records under the imprint 3 Points.\n"
         ]
      },
      "Silence and About a Burning Fire (2002-2004)": {
         "text": [
            "In 2002 Blindside released  Silence. It generated hits such as \"Sleepwalking\", \"Pitiful,\" and \"Caught a Glimpse.\" They appeared on Late Night with Conan O'Brien and performed their hit song \"Pitiful\".\nIn 2003, they toured with Hoobastank to support the album. Also in 2003, the band appeared in the skateboarding film Grind, performing the song \"Pitiful\" at a skate competition. In 2003, the Warner Music Group was sold to private investors, Blindside decided to part ways with Elektra due to ending up in a catalogue with hundreds of artists under Atlantic Records. The Blindside Union and P.O.D. Warriors, the two bands' street teams, stepped in to help in promotion. Blindside sold out five of the shows they headlined in 2004. However, the headlining tour was marred by several incidents. First, their tour bus crashed and was in disrepair, forcing the band to rent a van. Secondly, their last show in Bartlesville, OK had to be canceled. After dining in a restaurant in Dallas, TX, they found everything in their rental van stolen, including passports and money.\n",
            "In 2004, About a Burning Fire was released. It debuted on the Billboard album chart at #39 and generated a minor hit in \"All of Us.\"  The album showed the band toying with their diversity, as they threw in techno elements in \"Where The Sun Never Dies\" and yodeling Swedish vocals in the ethereal \"Shekina\". \"Shekina\" is a Jewish and Christian name for the outer presence of God's glory, and this song title expresses Blindside's spiritual side in their music. \"Shekina\" was used on WWE DVD, Cheating Death, Stealing Life - The Eddie Guerrero Story. The track \"Hooray, It's L.A.\" features the guitar and back up vocals of Billy Corgan, recorded during his recession from The Smashing Pumpkins. Following in 2005, Blindside re-released their two Solid State LPs with bonus tracks and new cover art. A DVD titled Ten Years Running Blind was released on 21 June 2005.\n"
         ]
      },
      "The Great Depression and The Black Rose EP (2005-2007)": {
         "text": [
            "The Great Depression, was released on 2 August 2005. The Great Depression showcased Blindside experimenting with multiple new genres.  Many jazzy elements were incorporated, such as  \"My Alibi\" and \"City Lights.\"  Guest vocalists were incorporated, namely Ilkka from Benea Reach and Selfmindead, as well as J. Jamte. Ilkka sang alongside Christian Lindskog in \"Come To Rest\", while J. Jamte contributed to \"You Must Be Bleeding Under Your Eyelids.\"\n",
            "Blindside released The Black Rose EP, on 27 June 2007[5] and toured the United States in support of it in late 2007. This EP included five new songs and three live songs, and is only available for purchase in Sweden, Blindside concerts, and online.\n"
         ]
      },
      "Hiatus (2008-2010)": {
         "text": [
            "Blindside has been performing a new song called \"Remember December\" from their upcoming album.[6]\nChristian and Simon have also been performing in a side project named Lindforest (The English translation of Christian's Swedish lastname \"Lindskog\").[7]\nBlindside took some time off throughout 2008 but also has written new songs and is expected to release a new album.[8][9]\n",
            "On 1 May 2009 it was announced that Blindside would be performing at a free showcase that will be held in Las Vegas at the Thomas and Mack Center on 29 August 2009, along with Flyleaf, Brian Welch and P.O.D., among others.[10]\n",
            "On 29 July 2009 Blindside announced that they were going to be making a new album, to be produced by Howard Benson.[11]\n",
            "On 21 November 2010 Blindside tweeted: \"Hung out with our friends from Papa Roach this week in Stockholm and played them the new record. Cant wait for all you guys to hear it!\"  Papa Roach claimed the album would be released in March 2011.[12]\n"
         ]
      },
      "With Shivering Hearts We Wait (2011-present)": {
         "text": [
            "On 7 February 2011 Blindside posted an image on their Facebook and Twitter accounts with a possible Album Title and a date \"028/002/011\".[11]\n",
            "A short video with a clip of a new song was added to their official website on 28 February 2011. The underground release date for With Shivering Hearts We Wait was 6 May 2011. The worldwide release date was 7 June 2011.[11]\n",
            "On 11 March 2011 at 9:05 CET Blindside released their new single \"Monster on the Radio,\" on Swedish airwaves.\n",
            "On 1 April 2011 Blindside released a promotional website containing songs from the new album. A new song was released each week leading to the album's release.\n",
            "On 3 April 2012 it was reported that Blindside had signed a new contract with BMG European Distribution Company.\n",
            "On 3 July 2019, the band released the song \"Gravedigger\".\n"
         ]
      }
   },
   "Discography": {},
   "Singles": {},
   "Videography": {},
   "Further reading": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Blindside is a Swedish post-hardcore band from the southern suburbs of Stockholm, Sweden.[3] They formed in Stockholm in 1994 as Underfree. In 1996, they changed their name to Blindside and released the Blindside album in 1997 through Swedish independent record company Day-Glo Records.  Another album, A Thought Crushed My Mind, came out in 2000. The group received greater attention in 2001 when they toured with P.O.D., resulting in a contract with Elektra. In 2002 they released the album Silence and in 2003 they toured in support of Hoobastank. A 2004 headlining tour suffered equipment theft but then Blindside released About a Burning Fire. Losing support from their label, the next year Blindside released The Great Depression independently, and they put out the DVD Ten Years Running Blind.[4]\n",
      "Blindside independently released another EP in 2007 – The Black Rose – but then they ceased most band activity until 2011 when they released With Shivering Hearts We Wait.\n",
      "Blindside was formed in 1994 by the original line up. In 1997, Blindside debuted in Sweden with their self-titled debut, a collection of old and new songs that were based on singer Christian Lindskog's life at the time. In 1998 Blindside released the Empty Box EP on Day-Glo Records as a follow up to their self-titled debut. In 1997, Tooth & Nail Records got a hold of their debut album and signed a licensing deal with Blindside.  The US debut was released later that year by Tooth & Nail and featured songs both from the Swedish full-length debut and from the EP Empty Box. In 2000, A Thought Crushed My Mind was released.  A Thought Crushed My Mind was more harsh and hardcore than the band's debut, and vocalist/chief lyricist Christian Lindskog also voiced his pain of missing his wife, Elina, while touring.  It would be Blindside's final album with Solid State. Fellow group P.O.D. began actively endorsing Blindside and signed them to Elektra Records under the imprint 3 Points.\n",
      "In 2002 Blindside released  Silence. It generated hits such as \"Sleepwalking\", \"Pitiful,\" and \"Caught a Glimpse.\" They appeared on Late Night with Conan O'Brien and performed their hit song \"Pitiful\".\nIn 2003, they toured with Hoobastank to support the album. Also in 2003, the band appeared in the skateboarding film Grind, performing the song \"Pitiful\" at a skate competition. In 2003, the Warner Music Group was sold to private investors, Blindside decided to part ways with Elektra due to ending up in a catalogue with hundreds of artists under Atlantic Records. The Blindside Union and P.O.D. Warriors, the two bands' street teams, stepped in to help in promotion. Blindside sold out five of the shows they headlined in 2004. However, the headlining tour was marred by several incidents. First, their tour bus crashed and was in disrepair, forcing the band to rent a van. Secondly, their last show in Bartlesville, OK had to be canceled. After dining in a restaurant in Dallas, TX, they found everything in their rental van stolen, including passports and money.\n"
   ]
}