{
   "Name": "Calibretto 13",
   "rawData": [
      "Calibretto 13 (later, simply Calibretto) was a Christian folk punk band from Kokomo, Indiana, United States.  The acoustic punk style of the band and the peculiar vocal style of singer Joe Whiteford gives the band their signature sound.  Another signature mark of the band is themes in their lyrics, which often are about B-movies and problems in pop culture and Christianity.  The band also incorporates a bit of influence from folk music.\n",
      "The trio of Joseph Whiteford (guitar and vocals), Aaron Richardson (bass) and Christopher Thomas (drums) came together in 1998 and released Sibling Rivalry, a split album with No More Droids, in 1999.  In 2000 the band put out Enter the Danger Brigade with Tooth and Nail Records.  After the band's initial recording sessions for the album, Tooth & Nail thought that some of the submitted songs were too questionable in content and asked the band to reconvene with producer Barry Poynter and record several more.  In all, Calibretto 13 recorded 19 songs for Enter the Danger Brigade, and only 11 songs were included on the debut album.  Seven of the remaining songs were released as an EP titled From the Secret Files of the Danger Brigade (2000).  In the liner notes for From the Secret Files..., Chris Thomas wrote: \" were kept from being on the album for one reason or another, and because we consider some of these to be our best songs we tried to make sure that you got to hear them.  Of course, some of these songs are pretty crappy, too.\"  Calibretto 13 released a second full-length album on Tooth & Nail titled Adventures in Tokyo in 2002.  This was the band's final release on Tooth & Nail.  After the release of Adventures in Tokyo, the band made several changes.\n",
      "The remaining song from the Enter the Danger Brigade recording sessions, which was not on From the Secret Files of the Danger Brigade, is titled \"Uncle Sam\".  It was, however, available for download off of the Calibretto website for a short time, along with many other demos, live, and rare tracks.  With Joe Whiteford's permission, the rarities have been made available through the link below.  Oddly enough, an image of Uncle Sam, which was later used by Calibretto on merchandise, was included in the interior art of From the Secret Files of the Danger Brigade, despite the song not being present.\n"
   ],
   "infobox": {
      "Origin": [
         "Kokomo, Indiana, United States"
      ],
      "Genres": [
         "Acoustic punk, Christian punk, hardcore punk"
      ],
      "Years active": [
         "1997 – 2004"
      ],
      "Labels": [
         "Tooth and Nail Records, Standard Recording Company"
      ]
   },
   "albums": [
      "Sibling Rivalry",
      "Enter the Danger Brigade",
      "From the Secret Files of the Danger Brigade",
      "Adventures in Tokyo",
      "Dead by Dawn",
      "All Of These Things Do Not Belong",
      "In The Dark"
   ],
   "prunedData": [
      "[BAND_NAME] (later, simply Calibretto) was a [GENRE] band from Kokomo, Indiana, United States.  The acoustic punk style of the band and the peculiar vocal style of singer [PERSON_NAME_FULL_0_MALE] gives the band their signature sound.  Another signature mark of the band is themes in their lyrics, which often are about B-movies and problems in pop culture and Christianity.  The band also incorporates a bit of influence from folk music.\n",
      "The trio of Joseph Whiteford (guitar and vocals), [PERSON_NAME_FULL_1_MALE] (bass) and Christopher Thomas (drums) came together in [YEAR] and released Sibling Rivalry, a split album with No More Droids, in [YEAR].  In [YEAR] the band put out Enter the Danger Brigade with Tooth and [PERSON_NAME_FULL_2_MALE].  After the band's initial recording sessions for the album, Tooth & [PERSON_NAME_FIRST_2] thought that some of the submitted songs were too questionable in content and asked the band to reconvene with producer [PERSON_NAME_FULL_0_MALE] and record several more.  In all, [BAND_NAME] recorded 19 songs for Enter the Danger Brigade, and only 11 songs were included on the debut album.  Seven of the remaining songs were released as an EP titled From the Secret Files of the Danger Brigade ([YEAR]).  In the liner notes for From the Secret Files..., Chris Thomas wrote: [SONG_NAME]  [BAND_NAME] released a second full-length album on Tooth & [PERSON_NAME_FIRST_2] titled Adventures in Tokyo in [YEAR].  This was the band's final release on Tooth & [PERSON_NAME_FIRST_2].  After the release of Adventures in Tokyo, the band made several changes.\n",
      "The remaining song from the Enter the Danger Brigade recording sessions, which was not on From the Secret Files of the Danger Brigade, is titled [SONG_NAME].  It was, however, available for download off of the Calibretto website for a short time, along with many other demos, live, and rare tracks.  With [PERSON_NAME_FULL_0_MALE]'s permission, the rarities have been made available through the link below.  Oddly enough, an image of Uncle Sam, which was later used by Calibretto on merchandise, was included in the interior art of From the Secret Files of the Danger Brigade, despite the song not being present.\n"
   ]
}