{
   "Name": "Candlefuse",
   "rawData": [
      "Candlefuse are an American Christian alternative rock band from Rainsville, Alabama, where the group started making music in 1999. Their first release, Candlefuse, an extended play, was released in 2005. They have also released a studio album, Never Go Unheard, in 2006.\n",
      "The group started in 1999, in Rainsville, Alabama, where they are vocalist, Ben Honeycutt, guitarist, Drew Garrett, bassist, Steven Howell, and drummer, Brian Hechler. Their name comes from the bible verses, Matthew 5:14 and Psalm 133:1, in order to portray and reflect a solidarity of light to a darkened world.\n",
      "They released an independently-made extended play, Candlefuse, in 2005. Their first studio album, Never Go Unheard, was released on October 17, 2006, from Infinity Records.\n"
   ],
   "infobox": {
      "Origin": [
         "Rainsville, Alabama"
      ],
      "Genres": [
         "Christian alternative rock, hard rock"
      ],
      "Years active": [
         "1999 (1999)–present"
      ],
      "Labels": [
         "Infinity"
      ],
      "Members": [
         "Ben Honeycutt",
         "Drew Garrett",
         "Steven Howell",
         "Brian Hechler"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band from Rainsville, Alabama, where the group started making music in [YEAR]. Their first release, [BAND_NAME], an extended play, was released in [YEAR]. They have also released a studio album, Never Go Unheard, in [YEAR].\n",
      "The group started in [YEAR], in Rainsville, Alabama, where they are vocalist, Ben Honeycutt, guitarist, [PERSON_NAME_FULL_1_MALE], bassist, [PERSON_NAME_FULL_0_MALE], and drummer, [PERSON_NAME_FULL_2_MALE]. Their name comes from the bible verses, Matthew 5:14 and Psalm 133:1, in order to portray and reflect a [GENRE] a darkened world.\n",
      "They released an independently-made extended play, [BAND_NAME], in [YEAR]. Their first studio album, Never Go Unheard, was released on [MONTH] 17, [YEAR], from Infinity Records.\n"
   ]
}