{
   "Name": "The Classic Crime",
   "rawData": [
      "The Classic Crime is an American rock band from Seattle, Washington formed in 2004. The band's current lineup consists of Matt MacDonald (vocals, guitar), Alan Clark (bass), Robert \"Cheeze\" Negrin (guitar), and Paul \"Skip\" Erickson (drums, vocals). They have released three albums and an EP on Tooth & Nail Records, two of which, The Silver Cord (2008) and Vagabonds (2010), charted in the Billboard 200. In July 2011, the band left Tooth & Nail to produce a fourth album with the help of fan donations via Kickstarter, called Phoenix (2012). In April 2016, the Classic Crime created a Kickstarter to raise funds for a sixth studio album. Within three hours they acquired the necessary $30,000 for the album. On April 28, 2017 they released their sixth studio album titled How to Be Human (2017).\n",
      "Their debut album Albatross was released on May 23, 2006. The band currently has an estimated 10 million plays on Myspace. Albatross had the highest debut sales in the history of Tooth & Nail records with over 4,000 sales in the first week it was released. The band's second full-length record, The Silver Cord  was released July 22, 2008. They also released an EP, Acoustic Seattle Sessions. They finished their third record Vagabonds, which was released April 6, 2010.\n",
      "The band has toured with A Change Of Pace, A Static Lullaby, Quietdrive, I Am Ghost, Relient K, So They Say, Just Surrender, Powerspace, Mest, Allister, Aiden, and Scary Kids Scaring Kids. They have also toured with fellow Tooth & Nail bands Anberlin, Emery, MxPx, Project 86, the Fold, and Run Kid Run. The band was on both the 2006 and 2008 Warped Tour. The Classic Crime is also going on a Headlining ATTICUS tour with A Change of Pace, Lower Definition, Tyler Read, Jet Lag Gemini, and Artist vs Poet. They toured in 2009 with Relient K and Owl City.\n"
   ],
   "infobox": {
      "Origin": [
         "Seattle, Washington, US"
      ],
      "Genres": [
         "Alternative rock,[1] post-grunge,[2] post-hardcore,[3] pop punk[3][4]"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Tooth & Nail"
      ],
      "Associated acts": [
         "Vocal Few"
      ],
      "Website": [
         "www.theclassiccrime.com"
      ],
      "Members": [
         "Matt MacDonald",
         "Paul \"Skip\" Erickson",
         "Alan Clark",
         "Robert \"Cheeze\" Negrin"
      ],
      "Past members": [
         "Justin DuQue"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Seattle, Washington formed in [YEAR]. The band's current lineup consists of Matt MacDonald (vocals, guitar), [PERSON_NAME_FULL_0_MALE] (bass), Robert \"Cheeze\" Negrin (guitar), and Paul \"Skip\" Erickson (drums, vocals). They have released three albums and an EP on Tooth & Nail Records, two of which, The Silver Cord ([YEAR]) and Vagabonds ([YEAR]), charted in the Billboard 200. In [MONTH] [YEAR], the band left Tooth & Nail to produce a fourth album with the help of fan donations via Kickstarter, called Phoenix ([YEAR]). In [MONTH] [YEAR], the Classic Crime created a Kickstarter to raise funds for a sixth studio album. Within three hours they acquired the necessary $30,000 for the album. On [MONTH] 28, [YEAR] they released their sixth studio album titled How to Be Human ([YEAR]).\n",
      "Their debut album Albatross was released on [MONTH] 23, [YEAR]. The band currently has an [GENRE] band's second full-length record, The Silver Cord  was released [MONTH] 22, [YEAR]. They also released an EP, Acoustic Seattle Sessions. They finished their third record Vagabonds, which was released [MONTH] 6, [YEAR].\n",
      "The band has toured with A Change Of Pace, A Static Lullaby, Quietdrive, I Am Ghost, Relient K, So They Say, [PERSON_NAME_FULL_2_MALE], Powerspace, Mest, Allister, Aiden, and Scary [PERSON_NAME_LAST_1]s Scaring [PERSON_NAME_LAST_1]s. They have also toured with fellow Tooth & Nail bands Anberlin, Emery, MxPx, Project 86, the Fold, and [PERSON_NAME_FULL_1_MALE]. The band was on both the [YEAR] and [YEAR] Warped Tour. [BAND_NAME] is also going on a Headlining ATTICUS tour with A Change of Pace, Lower Definition, [PERSON_NAME_FULL_0_MALE], Jet Lag Gemini, and Artist vs Poet. They toured in [YEAR] with Relient K and Owl City.\n"
   ]
}