{
   "Name": "Code of Ethics (band)",
   "rawData": [
      "Code of Ethics was a primarily 1990s Contemporary Christian music band that wrote and performed many genres including new wave and pop.\n",
      "Code of Ethics formed in the early '90s with Barry Blaze and Eric Switzer. The duo released Visual Paradox as a self-published project, which was later picked up by indie label R.E.X. Records in 1991. In the early 1990s, the band's music was quite unique in that they were one of the few Christian music artists performing a Europop style. With their early sound being largely reminiscent of New Order, their later works became simultaneously more progressive and more tame in nature. Many fans believe their mid-1990s pop-leanings were forced by their involvement with major label ForeFront Records, as evidenced by the underground release of an industrial-leaning mix of the \"Satellite Babies\" project which was obscured by the mainstream release of the same recording in tamed-down form.\n",
      "With a new label came new pressures and Eric decided to exit the band. Rick Brainer, Scott \"Skippy\" Chapman, and Scot Kifer then joined for a self-titled second album released in 1993. During the recording of the album, Code of Ethics asked to be released from R.E.X. Records based on a default in payment from them. Don Wrenn, the band manager, spearheaded the move and negotiated a deal with ForeFront Records with attorney Sam Chappel. Code of Ethics then went back into the studio to remix the album in Nashville and Memphis under the direction of John Jaszcz. After getting the self-titled album remixed, then went to Chicago and filmed a video for \"Satellite Babies\" that was never released by ForeFront, and garnered their first No. 1 single at radio, \"Something Real\". Kifer left by the end of the year. Later, Jeff Anderson would join for 1995's Arms Around the World, an album that would not only give Code two more No. 1's, but also let Code of Ethics receive its first Gospel Music Awards nomination in 1997.\n"
   ],
   "infobox": {
      "Genres": [
         "Christian pop, Europop, new wave"
      ],
      "Years active": [
         "1991–2001, 2008–present"
      ],
      "Labels": [
         "R.E.X., ForeFront"
      ],
      "Associated acts": [
         "Ian Eskelin"
      ],
      "Members": [
         "Barry Blaze",
         "Rick Brainer",
         "Scott \"Skippy\" Chapman",
         "Charles Garrett",
         "Jerry Mowery",
         "Steve Dale"
      ],
      "Past members": [
         "Eric Switzer",
         "Scot Kifer",
         "Jeff Anderson"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a primarily [YEAR]s Contemporary Christian music band that wrote and performed many genres including new wave and pop.\n",
      "[BAND_NAME] formed in the early '90s with Barry Blaze and [PERSON_NAME_FULL_0_MALE]. The duo released Visual Paradox as a self-published project, which was later picked up by indie label R.E.X. Records in [YEAR]. In the early [YEAR]s, the band's music was quite unique in that they were one of the few Christian music artists performing a Europop style. With their early sound being largely reminiscent of New Order, their later works became simultaneously more progressive and more tame in nature. Many fans believe their mid-[YEAR]s pop-leanings were forced by their involvement with major label ForeFront Records, as evidenced by the underground release of an industrial-leaning mix of the \"Satellite Babies\" project which was obscured by the mainstream release of the same recording in tamed-down form.\n",
      "With a [GENRE] band. Rick Brainer, [PERSON_NAME_FIRST_2]t \"Skippy\" Chapman, and [PERSON_NAME_FULL_2_MALE] then joined for a self-titled second album released in [YEAR]. During the recording of the album, [BAND_NAME] asked to be released from R.E.X. Records based on a default in payment from them. Don Wrenn, the band manager, spearheaded the move and negotiated a deal with ForeFront Records with attorney [PERSON_NAME_FULL_1_MALE]. [BAND_NAME] then went back into the studio to remix the album in Nashville and Memphis under the direction of John Jaszcz. After getting the self-titled album remixed, then went to Chicago and filmed a video for \"Satellite Babies\" that was never released by ForeFront, and garnered their first No. 1 single at radio, \"Something Real\". [PERSON_NAME_LAST_2] left by the end of the year. Later, [PERSON_NAME_FULL_0_MALE] would join for [YEAR]'s Arms Around the World, an album that would not only give Code two more No. 1's, but also let [BAND_NAME] receive its first Gospel Music Awards nomination in [YEAR].\n"
   ]
}