{
   "Name": "Consider the Thief",
   "Sections": [
      "1 History",
      "1.1 Early beginnings and Soldiers and Saints (2007–2008)",
      "1.2 Signs and Wonders (2009)",
      "1.3 Back From the Grave (2012-present)",
      "2 Members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Consider The Thief is an experimental rock band from Sacramento, California that formed in 2007 and broke up in 2009. In August 2012, they announced a reunion and a future record. However, as of 2017, no further announcements have been made.\n"
      ]
   },
   "History": {
      "Early beginnings and Soldiers and Saints (2007–2008)": {
         "text": [
            "Consider the Thief was formed when members of local Sacramento act Heartshed started a new group with ex-Dance Gavin Dance guitarist Sean O'Sullivan, whose writing credits include Whatever I Say Is Royal Ocean and Downtown Battle Mountain. In 2008 they released their EP Soldiers and Saints.\n"
         ]
      },
      "Signs and Wonders (2009)": {
         "text": [
            "According to the bands' blog,[2] the recording process for Signs and Wonders began in November 2008. According to guitarist Sean O'Sullivan, \"[they] decided [they] wanted to take a leap of faith and write songs that didn’t rely on what had become a crutch for [them]: screaming and busy guitar/drum work\".[3]\n",
            "The record, which came out on June 16, 2009 leaked on various sites on June 12, 2009, and is currently available for digital download via digital retailers such as Amazon.\n",
            "The band announced their break-up in August 2009 with a final show in September. Guitarist Sean O'Sullivan went on to play for Early States for a brief period and drummer Luke Allen joined Equal Vision Records band Mozart Season. Dryw Owens runs a studio in Sacramento, California called Real Sound Studios. In 2010, Dance Gavin Dance announced that Sean O'Sullivan would be joining the rest of the members to perform a reunion show of the original line up at the Sactown Awards, but would not be returning to the band or recording on future releases.\n"
         ]
      },
      "Back From the Grave (2012-present)": {
         "text": [
            "As of August 3, 2012, Consider the Thief was rumored to be staging a reunion along with new material. It wasn't until November until the band released an official statement from their Facebook:\n",
            "It's been more than three years since we announced our hiatus - a lot has happened since then. A few of us got married, moved, changed jobs, got dogs, etc. Life is good, but it's time for us to make a new album.",
            "Sean O'Sullivan went on to reveal that Consider the Thief is indeed making new music, and much like previous releases, will be self-released and engineered in Dryw's studio. With bassist, Zack Walkingstick, having moved to Seattle with his wife, and drummer, Luke Allen, pursuing other life goals, Joey Vannucchi of the band From Indian Lakes will be joining the band as a drummer and will do \"other things\" as well on the future release.\n",
            "However, as of 2017, the band has released no further statements regarding an album or live performances.\n"
         ]
      }
   },
   "Members": {},
   "Discography": {
      "text": [
         "Studio albums\n",
         "EPs\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Consider The Thief is an experimental rock band from Sacramento, California that formed in 2007 and broke up in 2009. In August 2012, they announced a reunion and a future record. However, as of 2017, no further announcements have been made.\n",
      "Consider the Thief was formed when members of local Sacramento act Heartshed started a new group with ex-Dance Gavin Dance guitarist Sean O'Sullivan, whose writing credits include Whatever I Say Is Royal Ocean and Downtown Battle Mountain. In 2008 they released their EP Soldiers and Saints.\n",
      "According to the bands' blog,[2] the recording process for Signs and Wonders began in November 2008. According to guitarist Sean O'Sullivan, \"[they] decided [they] wanted to take a leap of faith and write songs that didn’t rely on what had become a crutch for [them]: screaming and busy guitar/drum work\".[3]\n",
      "The record, which came out on June 16, 2009 leaked on various sites on June 12, 2009, and is currently available for digital download via digital retailers such as Amazon.\n"
   ]
}