{
   "Name": "Consider the Thief",
   "rawData": [
      "Consider The Thief is an experimental rock band from Sacramento, California that formed in 2007 and broke up in 2009. In August 2012, they announced a reunion and a future record. However, as of 2017, no further announcements have been made.\n",
      "Consider the Thief was formed when members of local Sacramento act Heartshed started a new group with ex-Dance Gavin Dance guitarist Sean O'Sullivan, whose writing credits include Whatever I Say Is Royal Ocean and Downtown Battle Mountain. In 2008 they released their EP Soldiers and Saints.\n",
      "According to the bands' blog, the recording process for Signs and Wonders began in November 2008. According to guitarist Sean O'Sullivan, \" decided  wanted to take a leap of faith and write songs that didn’t rely on what had become a crutch for : screaming and busy guitar/drum work\".\n"
   ],
   "infobox": {
      "Origin": [
         "Sacramento, California, United States"
      ],
      "Genres": [
         "Indie rock",
         "Post-Hardcore (Earlier material)[1]",
         "Experimental Rock (later material)"
      ],
      "Years active": [
         "2007–2009, 2012 (on hiatus)"
      ],
      "Labels": [
         "None"
      ],
      "Associated acts": [
         "Dance Gavin Dance, Atherton, From Indian Lakes, Nuoro"
      ]
   },
   "albums": [
      "Signs and Wonders"
   ],
   "prunedData": [
      "Consider The Thief is an [GENRE] band from Sacramento, California that formed in [YEAR] and broke up in [YEAR]. In [MONTH] [YEAR], they announced a reunion and a future record. However, as of [YEAR], no further announcements have been made.\n",
      "[BAND_NAME] was formed when members of local Sacramento act Heartshed started a new group with ex-Dance Gavin Dance guitarist [PERSON_NAME_FULL_0_MALE], whose writing credits include Whatever I Say Is Royal Ocean and Downtown Battle Mountain. In [YEAR] they released their EP Soldiers and Saints.\n",
      "According to the bands' blog, the recording process for Signs and Wonders began in [MONTH] [YEAR]. According to guitarist Sean O'Sullivan, [SONG_NAME].\n"
   ]
}