{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "Cool Hand Luke was formed by Brandon Morgan and Jason Hammil in 1998 while attending Middle Tennessee State University. The band's early music had a punk rock influence, although the range and scope of Cool Hand Luke's sound changed quickly after Mark Nicks joined the band.[1] With Nicks on drums and lead vocals, Cool Hand Luke became known for playing with their backs to the crowd, lengthy, emotively expressive songs, and introspective lyrics. The band signed to Floodgate Records in 2002 and released two full-length albums (2003's Wake Up, O Sleeper and 2004's The Fires of Life).[1] After an extended hiatus (during which  Nicks played drums for The Chariot), Cool Hand Luke released The Balancing Act, a career retrospective that fulfilled their contract with Floodgate. The Balancing Act contained songs from the band's early independent releases plus its Floodgate discography.\n",
         "In October 2008, Cool Hand Luke released The Sleeping House on Lujo Records. The album, produced by Matt Goldman and showing such diverse influences as Shudder to Think and Keane, comprises twelve piano-based songs of a depth, intensity, and relative darkness unseen before in Cool Hand Luke's work. The artwork-intensive album, complete with an enhanced CD, featured lyrics, explorations of each song, a music video, and in-depth exploration of the meanings contained within the artwork. \n",
         "On March 22, 2009, Mark Nicks (the sole remaining member of the band) announced that he was working to complete what he at the time said would be the final album under the \"Cool Hand Luke\" name. The album, Of Man, was released on March 25, 2011. Nicks said, \"The album tells the story of Jesus’ final days, from the perspective of the people in His life. Part rock, part classical, part film score, this is the capstone of Cool Hand Luke’s 13-year career. Over 30 friends contributed to the making of this album, including members of Underoath, Elliott, Quiet Science, Aireline, and the Kopecky Family Band.\" Only 500 physical copies of the album were pressed.[2]\n",
         "After a lengthy hiatus, in 2017, Nicks announced a Kickstarter project for funding a new Cool Hand Luke album titled Cora.[3]\n"
      ]
   },
   "Members": {
      "Former": {},
      "Present": {}
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Members",
      "2.1 Present",
      "2.2 Former",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Cool Hand Luke is a Christian band variously classified as alternative rock, progressive pop, indie, and emo and signed to Lujo Records on March 16, 2008.\n"
      ]
   },
   "Title": "Cool Hand Luke (band) - Wikipedia"
}