{
   "Name": "Creed (band)",
   "rawData": [
      "Creed is an American rock band from Tallahassee, Florida, formed in 1994. For the majority of its existence, the band consisted of lead vocalist Scott Stapp, guitarist and vocalist Mark Tremonti, bassist Brian Marshall, and drummer Scott Phillips. Creed released two studio albums, My Own Prison in 1997 and Human Clay in 1999, before Marshall left the band in 2000. The band's third album, Weathered, was released in 2001, with Tremonti handling bass guitar. Creed disbanded in 2004; Stapp pursued a solo career while Tremonti, Marshall, and Phillips went on to found the band Alter Bridge with Myles Kennedy in 2004.\n",
      "In 2009, after months of speculation, Creed reunited for a fourth album, Full Circle, and actively toured until 2012. Since then, Creed has been on hiatus while the instrumental members have remained active with Alter Bridge; Stapp has continued his solo career and joined the band Art of Anarchy in 2016. Tremonti also formed his own band, Tremonti, in 2011.\n",
      "Creed is often recognized as one of the prominent acts of the post-grunge movement that began in the mid-1990s. Becoming popular in the late 1990s and early 2000s, Creed released three consecutive multi-platinum albums, with their album Human Clay being certified diamond. Creed has sold over 28 million records in the United States, has sold over 53 million albums worldwide, and was the ninth best-selling artist of the 2000s. However, Creed has been negatively received by some critics and listeners, with the band having been listed by readers of Rolling Stone magazine as the worst artist of the 1990s.\n"
   ],
   "infobox": {
      "Origin": [
         "Tallahassee, Florida, U.S."
      ],
      "Genres": [
         "Post-grunge",
         "alternative metal",
         "hard rock",
         "alternative rock"
      ],
      "Years active": [
         "1994–2004",
         "2009–2012 (hiatus)"
      ],
      "Labels": [
         "Wind-up"
      ],
      "Associated acts": [
         "Alter Bridge"
      ],
      "Members": [
         "Brian Marshall",
         "Scott Phillips",
         "Scott Stapp",
         "Mark Tremonti"
      ],
      "Past members": [
         "Brian Brasher"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Tallahassee, Florida, formed in [YEAR]. For the majority of its existence, the band consisted of lead vocalist [PERSON_NAME_FIRST_0] Stapp, guitarist and vocalist [MONTH]k Tremonti, bassist Brian [MONTH]shall, and drummer [PERSON_NAME_FULL_0_MALE]. [BAND_NAME] released two studio albums, My Own Prison in [YEAR] and Human Clay in [YEAR], before [MONTH]shall left the band in [YEAR]. The band's third album, Weathered, was released in [YEAR], with Tremonti handling bass guitar. [BAND_NAME] disbanded in [YEAR]; Stapp pursued a solo career while Tremonti, [MONTH]shall, and [PERSON_NAME_LAST_0] went on to found the band Alter Bridge with [PERSON_NAME_FULL_1_MALE] in [YEAR].\n",
      "In [YEAR], after months of speculation, [BAND_NAME] reunited for a fourth album, Full Circle, and actively toured until [YEAR]. Since then, [BAND_NAME] has been on hiatus while the instrumental members have remained active with [PERSON_NAME_FULL_0_MALE]; Stapp has continued his solo career and joined the band Art of Anarchy in [YEAR]. Tremonti also formed his own band, Tremonti, in [YEAR].\n",
      "[BAND_NAME] is often recognized as one of the prominent acts of the post-grunge movement that began in the mid-[YEAR]s. Becoming popular in the late [YEAR]s and early [YEAR]s, [BAND_NAME] released three consecutive multi-platinum albums, with their album Human Clay being certified diamond. [BAND_NAME] has sold over 28 million records in the United States, has sold over 53 million albums worldwide, and was the ninth best-selling artist of the [YEAR]s. However, [BAND_NAME] has been negatively received by some critics and listeners, with the band having been listed by readers of Rolling Stone magazine as the worst artist of the [YEAR]s.\n"
   ]
}