{
   "Name": "Day of Fire",
   "Sections": [
      "1 History",
      "1.1 Formation & Day of Fire",
      "1.2 Cut & Move",
      "1.3 Losing All and Current Events",
      "2 Influences",
      "3 Members",
      "4 Discography",
      "4.1 Studio albums",
      "5 Singles",
      "6 Awards",
      "6.1 GMA Dove Awards",
      "6.2 Grammy Awards",
      "7 References"
   ],
   "Summary": {
      "text": [
         "Day of Fire is a Christian rock band from Nashville, Tennessee. The band announced an indefinite hiatus in June 2010, leaving open the possibility for a return to the music scene.  They were first signed to Essential Records, and later to Razor & Tie Records. Their last album Losing All was released January 26, 2010 and was produced by Rogers Masson.\n"
      ]
   },
   "History": {
      "Formation & Day of Fire": {
         "text": [
            "Day of Fire's lead vocalist, Josh Brown, was formerly the vocalist for Full Devil Jacket.  Signed to Island/Def Jam Records, Full Devil Jacket enjoyed a successful, though short, career. They made one album and one EP, and toured with Nickelback and Creed.  In 2000, while in Full Devil Jacket, Brown nearly died of a heroin overdose but was able to recover through a drug rehabilitation program. While recording the second Full Devil Jacket album he decided to leave the music industry and turn his life around, embracing Christianity. Several years later, he started Day of Fire, and signed to an imprint of Sony Music.\n",
            "Day of Fire's 2004 self-titled debut album featured hits like \"Cornerstone\" and \"Detainer\".  The album was produced by Scott Humphrey, who has also worked with Metallica and Rob Zombie.  It won a Dove Award for Rock Album of the Year and was also nominated for a Grammy Award.\n"
         ]
      },
      "Cut & Move": {
         "text": [
            "Their second album, called Cut & Move, was released on June 6, 2006.  \"Run\", a track from Cut & Move, was the theme song for WWE Unforgiven 2006.  Other hit songs from the album include \"Love\", \"Hole In My Hand\", and \"Frustrating\".\n",
            "In the fall of 2006, Day of Fire supported Pillar on their \"Days of the Reckoning Tour\".  The tour lasted from October to November 2006 and also featured the rock/metal bands The Showdown and Decyfer Down.\n",
            "In early 2007, Day of Fire announced they were no longer signed to Essential Records, but that they had made plans to record a new album sometime in 2008.\n"
         ]
      },
      "Losing All and Current Events": {
         "text": [
            "Throughout 2008 and 2009 Day of Fire toured with bands like Days of the New, Daughtry, and others and wrote a few songs with Chris Daughtry and Brian Cradock to be on their next record.\n",
            "Day of Fire recorded an album independently with producer Rogers Masson, using financial support from fans in late 2008.\n",
            "In early 2009, Day of Fire announced they had signed a Record Deal with Razor and Tie Records.  On January 26, 2010, Day of Fire released their new album with Razor and Tie Records titled Losing All.\nThe first single \"Lately\" was a hit on rock radio stations and reached No. 33 on Billboard's Active Rock Chart.\nThe live performance of \"Lately\" from this album is now selling as a music video on iTunes.\n",
            "In support of the new record, Day of Fire toured with Cold, Nonpoint, Edisun, 16 Second Stare, Sevendust, Papa Roach, Saving Abel, and Hail the Villain, and played several festival dates with likes of Thousand Foot Krutch, Pop Evil, We the Kings, After Midnight Project, and Trapt.\n",
            "The band announced in early June 2010 that they are on an indefinite hiatus from touring and recording.\n",
            "On June 19, Josh Brown played a one-time reunion show with Full Devil Jacket to benefit the James Michael Reaves Medical Expense Fund, after that show the band decided to reunite and plans to release new material.  Reaves died in 2011.\n",
            "In October 2010 it was announced that Josh Brown and his Full Devil Jacket bandmate and former Saliva guitarist Jonathan Montoya formed a new band called A New Rebel with David Fraizer of Outspoken, Jarred Mankin of Bobaflex, and Jason Null of Saving Abel.\n",
            "In April 2013, the band posted a picture on Facebook hinting at a reunion, however given the schedule of Full Devil Jacket, no reunion happened.\n"
         ]
      }
   },
   "Influences": {
      "text": [
         "Day of Fire cites some of their major musical influences as Stone Temple Pilots,  Soundgarden, AC/DC, Led Zeppelin, The Beatles, and Booker T and the MG's [2]\n"
      ]
   },
   "Members": {},
   "Discography": {
      "Studio albums": {}
   },
   "Singles": {},
   "Awards": {
      "GMA Dove Awards": {},
      "Grammy Awards": {}
   },
   "References": {},
   "coreData": [
      "Day of Fire is a Christian rock band from Nashville, Tennessee. The band announced an indefinite hiatus in June 2010, leaving open the possibility for a return to the music scene.  They were first signed to Essential Records, and later to Razor & Tie Records. Their last album Losing All was released January 26, 2010 and was produced by Rogers Masson.\n",
      "Day of Fire's lead vocalist, Josh Brown, was formerly the vocalist for Full Devil Jacket.  Signed to Island/Def Jam Records, Full Devil Jacket enjoyed a successful, though short, career. They made one album and one EP, and toured with Nickelback and Creed.  In 2000, while in Full Devil Jacket, Brown nearly died of a heroin overdose but was able to recover through a drug rehabilitation program. While recording the second Full Devil Jacket album he decided to leave the music industry and turn his life around, embracing Christianity. Several years later, he started Day of Fire, and signed to an imprint of Sony Music.\n",
      "Day of Fire's 2004 self-titled debut album featured hits like \"Cornerstone\" and \"Detainer\".  The album was produced by Scott Humphrey, who has also worked with Metallica and Rob Zombie.  It won a Dove Award for Rock Album of the Year and was also nominated for a Grammy Award.\n",
      "Their second album, called Cut & Move, was released on June 6, 2006.  \"Run\", a track from Cut & Move, was the theme song for WWE Unforgiven 2006.  Other hit songs from the album include \"Love\", \"Hole In My Hand\", and \"Frustrating\".\n"
   ]
}