{
   "Name": "Day of Fire",
   "rawData": [
      "Day of Fire is a Christian rock band from Nashville, Tennessee. The band announced an indefinite hiatus in June 2010, leaving open the possibility for a return to the music scene.  They were first signed to Essential Records, and later to Razor & Tie Records. Their last album Losing All was released January 26, 2010 and was produced by Rogers Masson.\n",
      "Day of Fire's lead vocalist, Josh Brown, was formerly the vocalist for Full Devil Jacket.  Signed to Island/Def Jam Records, Full Devil Jacket enjoyed a successful, though short, career. They made one album and one EP, and toured with Nickelback and Creed.  In 2000, while in Full Devil Jacket, Brown nearly died of a heroin overdose but was able to recover through a drug rehabilitation program. While recording the second Full Devil Jacket album he decided to leave the music industry and turn his life around, embracing Christianity. Several years later, he started Day of Fire, and signed to an imprint of Sony Music.\n",
      "Day of Fire's 2004 self-titled debut album featured hits like \"Cornerstone\" and \"Detainer\".  The album was produced by Scott Humphrey, who has also worked with Metallica and Rob Zombie.  It won a Dove Award for Rock Album of the Year and was also nominated for a Grammy Award.\n"
   ],
   "infobox": {
      "Origin": [
         "Nashville, Tennessee, United States"
      ],
      "Genres": [
         "Hard rock, post-grunge, Christian rock,[1] alternative metal"
      ],
      "Years active": [
         "2003–2010 (indefinite hiatus)"
      ],
      "Labels": [
         "Razor & Tie, Essential"
      ],
      "Associated acts": [
         "Full Devil Jacket, Daughtry"
      ],
      "Website": [
         "facebook.com/dayoffire"
      ],
      "Members": [
         "Josh Brown",
         "Joe Pangallo",
         "Chris Pangallo",
         "Zach Simms"
      ],
      "Past members": [
         "Gregg Hionis",
         "Dusty Beach"
      ]
   },
   "albums": [
      "Day of Fire",
      "Cut & Move",
      "Losing All"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Nashville, Tennessee. The band announced an indefinite hiatus in [MONTH] [YEAR], leaving open the possibility for a return to the music scene.  They were first signed to Essential Records, and later to Razor & Tie Records. Their last album Losing All was released [MONTH] 26, [YEAR] and was produced by Rogers Masson.\n",
      "[BAND_NAME]'s lead vocalist, Josh Brown, was formerly the vocalist for Full Devil Jacket.  Signed to Island/Def Jam Records, Full Devil Jacket enjoyed a successful, though short, career. They made one album and one EP, and toured with Nickelback and Creed.  In [YEAR], while in Full Devil Jacket, Brown nearly died of a heroin overdose but was able to recover through a drug rehabilitation program. While recording the second Full Devil Jacket album he decided to leave the music industry and turn his life around, embracing Christianity. Several years later, he started [BAND_NAME], and signed to an imprint of Sony Music.\n",
      "[BAND_NAME]'s [YEAR] self-titled debut album featured hits like [SONG_NAME].  The album was produced by Scott Humphrey, who has also worked with Metallica and [PERSON_NAME_FULL_0_MALE].  It won a [GENRE] a Grammy Award.\n"
   ]
}