{
   "Name": "Dead Poetic",
   "rawData": [
      "Dead Poetic is an American rock band formed in Dayton, Ohio in 1997. Their most recent lineup consisted of vocalist Brandon Rike, guitarist Zach Miles, and drummer Jesse Sprinkle. They released three albums and a greatest hits album, The Finest, on Tooth & Nail Records. The band lapsed into inactivity in 2007 due to internal strife and inability to tour, though Rike has stated that the band plans to record a fourth album.\n",
      "Dead Poetic was first formed when members Zach Miles, Brandon Rike, and Chad Shellabarger were at the age of 13. Josh Shellabarger was then 15. The band formed in their local Church, and each taught themselves. Their first show was at the three teenagers' Middle School's annual \"Talent Show.\" The band went by the name MindSet, before changing it to Ded Poetic. Later they changed the name to Dead Poetic.\n",
      "The band first garnered attention in the underground music scene following the release of their first full-length record Four Wall Blackmail, which was released by Tooth & Nail subsidiary Solid State Records, and single \"August Winterman.\" Their second release, 2004's New Medicines, heightened the band's profile considerably, however. Produced by Aaron Sprinkle (Emery, Acceptance), the album's sales were buoyed by the title track, which became a hit on MTV2 and Fuse TV. On these first two albums, music critics had a hard time classifying the band's music: genres from emo to post-hardcore to alternative rock were all tossed around with little consensus.\n"
   ],
   "infobox": {
      "Also known as": [
         "Mindset, DP or dp"
      ],
      "Origin": [
         "Dayton, Ohio, United States"
      ],
      "Genres": [
         "Post-hardcore, Christian Rock, hard rock, emo, alternative rock"
      ],
      "Years active": [
         "1997–2007 (on hiatus)"
      ],
      "Labels": [
         "Tooth & Nail, Solid State"
      ],
      "Associated acts": [
         "At Night We Strike",
         "The Almost",
         "Beloved",
         "Demon Hunter",
         "Poor Old Lu"
      ],
      "Website": [
         "deadpoetic.com"
      ],
      "Members": [
         "Brandon Rike",
         "Zach Miles",
         "Jesse Sprinkle"
      ],
      "Past members": [
         "John Brehm",
         "Chad Shellabarger",
         "Josh Shellabarger",
         "Todd Osborn",
         "Dusty Redmon"
      ]
   }
}