{
   "Biography": {
      "text": [
         "Decyfer Down was originally formed in 1999 as Allysonhymn by guitarist Brandon Mills and drummer Josh Oliver, who met in high school. Formerly an acoustic outfit, the group eventually switched to a more rock-oriented sound after Josh's brother, Caleb, joined the band. Caleb Oliver started out doing percussion with Josh, up until their bassist left the band. Caleb stated \"After our bass player left, we found ourselves needing someone to carry the low end. So, I picked up the bass and had a quick crash course.\" In 2002 guitarist Christopher Clonts joined, cementing their sound. Clonts met Caleb, Brandon and Josh at Morehead City, after graduating from high school, and later on, joined Allysonhymn.[2] The band changed their name to Decyfer shortly afterwards. In June 2003, the band released two singles named \"Fallen\" and \"Reflections\" on their website unofficially, for free. In early 2005, the band independently released their first EP, called \"Decyfer EP\".\n",
         "The band was first signed by SRE Recordings in mid-2005. In an interview, Brandon Mills claimed that \"marketing-wise, it was a little challenging to have bands named Decyfer and Disciple on the same label\". Hence, they changed their name to Decyfer Down.[3]\n",
         "A record deal with INO Records led to the band's debut album, End of Grey, which was released in June 2006. The album had five singles \"Fight Like This\", \"Break Free\", \"Burn Back the Sun,\" \"No Longer\" and \"Life Again\" all of which reached No. 1 on the Christian rock charts. The album peaked at No. 43 on the Billboard Top Christian Albums.[4] \"Fight Like This\" was featured in  UFC promo which aired on September 7, 2007 for twelve hours on the front page of YouTube. After that, they toured with artists such as Puddle of Mudd, Breaking Benjamin, Crossfade and Adema.  The band has shared the stage with acts such as Pillar, Thousand Foot Krutch, Day of Fire, The Showdown, Skillet, Disciple, Hawk Nelson, and many more.[5] In 2008, Caleb, appeared with Skillet on their \"Comatose Comes Alive\" tour and played the Bass for them.\n",
         "On February 20, 2008, Caleb Oliver made an announcement on Decyfer Down's official website, saying that the band has started working on a new album. On May 2, 2008, Caleb posted updates, saying that the entire album has been recorded. The initial release date was announced as September 16, 2008.\n",
         "On July 7, 2008 Decyfer Down's released the lead single off their upcoming album; \"Crash\" to radio. \"Crash\" went on to peak at the No. 1 spot on the Christian Rock charts and No. 20 on the ChristianRock.net end of year charts.[6]\nThe song was also used to promote the Jeff Hardy vs. Matt Hardy match at WrestleMania XXV.\n",
         "On August 1, 2008, the band announced on their website that the release date was postponed to early 2009. In support of their upcoming album, the band released a 3-track EP to iTunes on September 30, 2008. The EP contained \"Crash\" as well as two other new songs entitled \"Best I Can\" and \"Now I'm Alive\". Some claim that Decyfer Down had already started selling signed, physical copies of the entire Crash album (containing all songs except \"Desperate\" and \"Moving On\") before its release, during their live shows. However, no legitimate proof exists on the internet, and Decyfer Down hasn't said anything about it.\n",
         "In October 2008, the band announced that Caleb Oliver had left the band. On October 27, 2008, Josh Oliver announced on Decyfer Down's website that TJ Harris (formerly of Fighting Instinct) had joined the band as the new lead singer and bassist. On February 3, the second single \"Fading\" was released. Fading peaked at No. 1 on the Christian Rock Charts, making it their second No. 1 single from their new album and sixth consecutive No. 1 single. It is their first official public studio recording TJ Harris. On February 17, the band released an updated EP with TJ's vocals, containing the songs \"Crash\", \"Fading\", and \"Moving On\".\n",
         "On May 5, 2009 Decyfer Down's second studio album, \"Crash\" was released. It debuted at No. 66 on the Billboard 200 in its first week, selling nearly 9,000 copies, and stayed for three weeks, dropping to No. 128 and then to No. 181 before falling off the chart.[7] Drummer Josh Oliver stated in an interview in July that the record had sold upwards of 30,000 copies in three months.[citation needed]\n",
         "On October 27, 2009, Decyfer Down appeared on Air 1 radio station. TJ Harris, along with Christopher Clonts, performed an acoustic version of \"Best I Can\", live.[8]\n",
         "On December 3, 2009 it was announced that Crash had been nominated for a Grammy for Best Rock or Rap Gospel album of the year, which they did not win, but being nominated was a huge success for the band.[9]\n",
         "In March 2010, the band announced that they had begun writing for a third album. In November 2010, the band posted a short video of them in the studio, working on writing new songs for their upcoming album, with the help of Gavin Brown.[10] On August 27, 2013, the band released their third album called Scarecrow.\n",
         "On July 12, 2014, Decyfer Down announced on their Facebook page the release of \"Black and White\" EP by Revely. Josh and Brandon were the producers of that EP.[11]\n",
         "On October 27, 2014, the band released a compilation of their songs in an anthology, called \"Anthology\", which was released under the label of Fair Trade Services. This compilation consisted of songs from their previous albums. There were no new songs on this record.[12]\n",
         "On May 12, 2015, original member and drummer Josh Oliver announced that he would be stepping down from the band.[13]\n",
         "During City Rockfest 2015, the band's guitarist, Chris Clonts, was unable to tour with the band due to business in his hometown. While he no longer tours on a regular basis with Decyfer Down, he is still considered a member of the band, continues to help the band in studio recording sessions and played in live performances at North Carolina.\n",
         "On September 26, 2015, Decyfer Down announced an upcoming EP consisting of six songs which would be their first independent EP.[14] They started a campaign on IndieGogo to get some support via Crowd Funding.[15] On October 23, 2015, Decyfer Down announced that they have added 4 bonus tracks to the project, and converted the EP to an album, consisting of ten songs.[16] The estimated release date of this album is in February, 2016. On November 14, 2015, Decyfer Down revealed the name of their new album to be \"The Other Side of Darkness\".\n",
         "On November 27, 2015, they released a single from the album, called \"Nothing More\", which went on to peak the Christian Rock chart.\n",
         "On February 18, 2016, Decyfer Down announced the release date of their new album, The Other Side of Darkness, to be released on April 1, 2016.[17] While there were short previews of the album on YouTube by March 2016, a full preview of the album was released on NewReleaseToday a week before the album's official release.\n",
         "On April 1, 2016, the album was released on iTunes and in stores. Decyfer Down (along with Christopher Clonts) toured with the bands Disciple, Children 18:3, Seventh Day Slumber and Spoken on City Rockfest 2016 after the album's release. After the end of the tour, Decyfer Down announced that they will be headlining their next tour, \"The Other Side of Darkness 2016\".\n",
         "In a promo video, TJ Harris announced that \"The Other Side of Darkness 2016\" tour will commence on October 20, 2016, and that the tour will kick off at Jamestown, NC.[18] The band was accompanied by Ilia, Jeremy Greene and The Protest on this tour. Set for the Fall also jumped in during the last few shows. The tour ended on November 14, 2016.[19]\n"
      ]
   },
   "Discography": {
      "Compilations": {},
      "EPs": {},
      "Singles": {},
      "Studio albums": {}
   },
   "External links": {},
   "Members": {
      "text": [
         "Current members\n",
         "Former members\n",
         "Touring musicians\n",
         "Timeline\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Biography",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 EPs",
      "2.3 Compilations",
      "2.4 Singles",
      "3 Members",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Decyfer Down is an American Christian rock band formed in 1999 and based in Morehead City, North Carolina, United States. Until 2002 – the year that Christopher Clonts joined the band – they went by the moniker Allysonhymn (pronounced All-eyes-on-Him). Decyfer Down is well known in Christian music, but the band is also known for their mainstream success, having toured with bands like Puddle of Mudd and Breaking Benjamin.\n"
      ]
   },
   "Title": "Decyfer Down - Wikipedia"
}