{
   "Name": "Decyfer Down",
   "rawData": [
      "Decyfer Down is an American Christian rock band formed in 1999 and based in Morehead City, North Carolina, United States. Until 2002 – the year that Christopher Clonts joined the band – they went by the moniker Allysonhymn (pronounced All-eyes-on-Him). Decyfer Down is well known in Christian music, but the band is also known for their mainstream success, having toured with bands like Puddle of Mudd and Breaking Benjamin.\n",
      "Decyfer Down was originally formed in 1999 as Allysonhymn by guitarist Brandon Mills and drummer Josh Oliver, who met in high school. Formerly an acoustic outfit, the group eventually switched to a more rock-oriented sound after Josh's brother, Caleb, joined the band. Caleb Oliver started out doing percussion with Josh, up until their bassist left the band. Caleb stated \"After our bass player left, we found ourselves needing someone to carry the low end. So, I picked up the bass and had a quick crash course.\" In 2002 guitarist Christopher Clonts joined, cementing their sound. Clonts met Caleb, Brandon and Josh at Morehead City, after graduating from high school, and later on, joined Allysonhymn. The band changed their name to Decyfer shortly afterwards. In June 2003, the band released two singles named \"Fallen\" and \"Reflections\" on their website unofficially, for free. In early 2005, the band independently released their first EP, called \"Decyfer EP\".\n",
      "The band was first signed by SRE Recordings in mid-2005. In an interview, Brandon Mills claimed that \"marketing-wise, it was a little challenging to have bands named Decyfer and Disciple on the same label\". Hence, they changed their name to Decyfer Down.\n"
   ],
   "infobox": {
      "Also known as": [
         "Allysonhymn",
         "Decyfer"
      ],
      "Origin": [
         "Morehead City, North Carolina, United States"
      ],
      "Genres": [
         "Christian rock, hard rock,[1] post-grunge, alternative metal"
      ],
      "Years active": [
         "1999–present"
      ],
      "Labels": [
         "Fair Trade Services",
         "INO Records",
         "Columbia Records",
         "Fuel Music"
      ],
      "Website": [
         "www.decyferdown.com"
      ],
      "Members": [
         "Brandon Mills",
         "Christopher Clonts",
         "TJ Harris",
         "Ben Millhouse"
      ],
      "Past members": [
         "Caleb Oliver",
         "Josh Oliver",
         "Chris Furr"
      ]
   },
   "albums": [
      "studio only",
      "studio only since 2015",
      "studio only"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in [YEAR] and based in Morehead City, North Carolina, United States. Until [YEAR] – the year that Christopher Clonts joined the band – they went by the moniker Allysonhymn (pronounced All-eyes-on-Him). [BAND_NAME] is well known in Christian music, but the band is also known for their mainstream success, having toured with bands like Puddle of Mudd and Breaking Benjamin.\n",
      "[BAND_NAME] was originally formed in [YEAR] as Allysonhymn by guitarist Brandon Mills and drummer [PERSON_NAME_FULL_0_MALE], who met in high school. Formerly an [GENRE] a more rock-oriented sound after [PERSON_NAME_FIRST_0]'s brother, Caleb, joined the band. Caleb [PERSON_NAME_LAST_0] started out doing percussion with [PERSON_NAME_FIRST_0], up until their bassist left the band. Caleb stated [SONG_NAME].\n",
      "The band was first signed by SRE Recordings in mid-[YEAR]. In an interview, Brandon Mills claimed that [SONG_NAME]. Hence, they changed their name to [BAND_NAME].\n"
   ]
}