{
   "Name": "Animosity (band)",
   "rawData": [
      "Animosity was an American death metal band from San Francisco, California, formed in 2000. The band released three studio albums, toured in United States, Europe and disbanded in 2009. The classic lineup of Animosity consisted of vocalist Leo Miller, guitarists Frank Costa and Chase Fraser, bassist Evan Brewer and drummer Navene Koperweis.\n",
      "Animosity formed in  2000 in San Francisco, California. They released their debut album, Shut It Down, on Tribunal Records in 2003, when the members of the band were 16 and 17 years old. In 2005, they released their second disc, Empires, on Black Market Activities (with distribution through Metal Blade Records) and toured the United States with Origin and Malevolent Creation. Their third album, Animal, was produced by Kurt Ballou of Converge and released in October 2007. They have also toured Europe with Converge and Belgian hardcore/punk band Rise and Fall. Animosity disbanded officially after nearly a year of non-activity in October 2009. The band's frontman Leo Miller stated that their \"musical and experiential goals have been exceeded\" and: \"If you haven't gotten enough of Animosity, please rest assured that we have.\"\n",
      "According to Blabbermouth.net, on their debut album, Shut It Down, Animosity \"mixed a death metal based sound with thrash and hardcore, (...) incorporating the brutal aspects of  styles with accomplished musicianship and little concern for mass appeal\", while their following album, Empires, went into an even more death metal-oriented direction.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, U.S."
      ],
      "Genres": [
         "Death metal, deathgrind, deathcore"
      ],
      "Years active": [
         "2000–2009"
      ],
      "Labels": [
         "Tribunal, BMA, Metal Blade"
      ],
      "Associated acts": [
         "Entheos, The Faceless, Fleshwrought, Animals as Leaders, Realms Of Vision"
      ],
      "Past members": [
         "See band members section"
      ]
   }
}