{
   "Name": "digHayZoose",
   "rawData": [
      "\nDigHayZoose was a Christian funk and modern rock band from Kansas City, Missouri. The Encyclopedia of Contemporary Christian Music describes them as \"One of the first Christian alternative rock bands of the 1990s\". Their name, when spoken, is audibly similar to saying \"Dig Jesus\" in Spanish.\n",
      "The band signed to Brainstorm Artists International in 1991 and produced their first album, StruggleFish, with Terry Scott Taylor. The album was widely described as essentially a clone of the Red Hot Chili Peppers or Janes Addiction. They subsequently toured nationally with bands such as Scaterd Few and played festivals including the Cornerstone Festival. The band found their own groove by their second album, MagentaMantaLoveTree. Magenta was co-produced with Gene Eugene and is considered more emotional than their first. The bands' sound fuses punk rock and freestyle jazz to create their own brand of neo-psychedelic rock, as in the songs \"Black-Eyed Pea\" and \"Secret.\" They also covered Steve Taylor's \"I Want To Be A Clone\" for the 1994 tribute I Predict A Clone. In later concerts, Taylor's version came to resemble DigHayZoose's more than his own. (1) (2)\n",
      "DigHayZoose was released from their contract in 1994 and announced their breakup at the Cornerstone festival that year. At the same time Ascension 7: Rocketship to Heaven, their final release, was recorded. Ascension 7 includes guests Dan Michaels of The Choir and Allan Aguirre of Scaterd Few. They began to search for a new record label, and in 1995 added David Coonce (known as \"Zoop\") as a fifth member. An underproduced demo, which consisted of five songs of modern praise, received what the band later characterized as a \"lukewarm reception.\" When David Andersen left the band in 1996 they reformed under the name Infrared and recorded a demo before disbanding in 1997.\n"
   ],
   "infobox": {
      "Origin": [
         "Kansas City, MO, Missouri, United States"
      ],
      "Genres": [
         "Christian alternative"
      ],
      "Years active": [
         "1990–1996"
      ],
      "Labels": [
         "Brainstorm Artists International"
      ],
      "Associated acts": [
         "Hot Pink Turtle"
      ],
      "Past members": [
         "Phil Schlotterer",
         "David G. Andersen",
         "Jim Florez",
         "Bil Brown",
         "David \"Zoop\" Coonce"
      ]
   }
}