{
   "Discography": {
      "text": [
         "Other Releases:\n"
      ]
   },
   "External links": {},
   "History": {
      "text": [
         "The band signed to Brainstorm Artists International in 1991 and produced their first album, StruggleFish, with Terry Scott Taylor. The album was widely described as essentially a clone of the Red Hot Chili Peppers or Janes Addiction.[2][3] They subsequently toured nationally with bands such as Scaterd Few and played festivals including the Cornerstone Festival. The band found their own groove by their second album, MagentaMantaLoveTree. Magenta was co-produced with Gene Eugene and is considered more emotional than their first. The bands' sound fuses punk rock and freestyle jazz[4] to create their own brand of neo-psychedelic rock, as in the songs \"Black-Eyed Pea\" and \"Secret.\" They also covered Steve Taylor's \"I Want To Be A Clone\" for the 1994 tribute I Predict A Clone. In later concerts, Taylor's version came to resemble DigHayZoose's more than his own. (1) (2)\n",
         "DigHayZoose was released from their contract in 1994[5] and announced their breakup at the Cornerstone festival that year. At the same time Ascension 7: Rocketship to Heaven, their final release, was recorded. Ascension 7 includes guests Dan Michaels of The Choir and Allan Aguirre of Scaterd Few. They began to search for a new record label, and in 1995 added David Coonce (known as \"Zoop\") as a fifth member.[6] An underproduced demo, which consisted of five songs of modern praise, received what the band later characterized as a \"lukewarm reception.\"[6] When David Andersen left the band in 1996 they reformed under the name Infrared and recorded a demo before disbanding in 1997.\n",
         "In 2005 the band reunited to rerecord their Infrared era material.[7]\n"
      ]
   },
   "Members": {},
   "References": {},
   "Related projects": {
      "text": [
         "Bil Brown also participated in the initial forming of \"neopsychedelic\" Christian Kansas City group Hot Pink Turtle.[8] Hot Pink Turtle released one album, Ticklewigglejigglepickle, in 1993 on R.E.X. Music, and covered Steve Taylor's \"A Principled Man\" on the same Steve Taylor tribute album as DigHayZoose. One reviewer concisely described its diversity as \"a hodgepoge of music and meanings\".[9] Bil's other efforts include the rockabilly band Silvermen, and most recently, leading worship and creative arts at Desperation Church in Liberty, MO. The Silvermen formed in 1998, signed to Ashland Records, and released one album with Bil on bass, Pioneers of the Intergalactic Frontier, in 2000. Pioneers was a science fiction based album with a variety of sounds,[10] much like DigHayZoose.\n",
         "Hot Pink Turtle also included Dion Tyler on bass, who formed a band called Dev Null with Dave Anderson in 1997.[6] They released one album and disbanded in about 1999.[6] Phil Schlotterer founded a band called The Sky Kings (later changed to The Day Birds) which was reported to have a strong local following in 2000.[6] They released at least one album, turnstyle (1999) and an EP, you rock, in 2002.[11] Phil left the band by 2004.\n",
         "Florez, Andersen, Tyler, and Donovan White also formed a band called Sundowner. They had not recorded material as of 2000.[6] Later 2010 White formed a band known as \"Mavens\" with Tyler in the band along with a few others they\nwon recording time from a band competition and earned 1st Place.\n"
      ]
   },
   "Sections": [
      "1 History",
      "2 Related projects",
      "3 Members",
      "4 Discography",
      "5 External links",
      "6 References"
   ],
   "Summary": {
      "text": [
         "\nDigHayZoose was a Christian funk and modern rock band from Kansas City, Missouri. The Encyclopedia of Contemporary Christian Music describes them as \"One of the first Christian alternative rock bands of the 1990s\".[1] Their name, when spoken, is audibly similar to saying \"Dig Jesus\" in Spanish.\n"
      ]
   },
   "Title": "digHayZoose - Wikipedia"
}