{
   "Name": "Disperse",
   "rawData": [
      "Disperse was a Christian rock band from Southern Indiana active from 1996 to 2004.  The band was formerly known, with an adjusted roster, as \"Stuff.\"\n",
      "Formed in early 1996 under the name of \"Stuff,\" the band consisted of members Chelsey Pieratt, Chris Billings, brothers Andy and Nic Higham, and Dustin Sanders, all members of a Christian youth group who wanted to promote their faith through their various musical talents.  Under the guidance of the youth minister at their local church, the band began to play at a nearby Christian coffeehouse called the Solid Rock Cafe as an opening act for more notable bands, including Satellite Soul and Just Visiting (now known as the award-winning, world-renowned group The Elms.)  Eventually the group began performing solo and headlining their own shows at the Solid Rock Cafe, as well as performing shows at various teen-oriented Christian clubs and coffeehouses across Southern Indiana.  In the spring of 2000, because of personal conflict between the members of the band, coupled with tensions between the group and the church leadership that brought them together, the group canceled its upcoming gigs and declared an \"indefinite hiatus\" and Stuff stopped performing.\n",
      "In fall of 2000, the group reformed (with lead singer Regina Mullikan replacing Pieratt) and began performing again, with an edgier, less conservative sound and lyrics that incorporated more adult topics, including suicide, teenage pregnancy, relationships, drug and alcohol abuse, and other obstacles encountered by teenagers and young adults growing up in the midwest United States.  It was during this time they took the name Disperse, suggested by Andy for its meaning and the related imagery of \"spreading the word and the faith\"\n"
   ],
   "infobox": {
      "Genres": [
         "Rock, garage rock"
      ],
      "Labels": [
         "Route7Records"
      ],
      "Members": [
         "Chelsey Pieratt",
         "Andy Higham",
         "Nic Higham",
         "Chris Billings",
         "Dustin Sanders"
      ],
      "Past members": [
         "Erin Davidson",
         "Regina Mullikan",
         "Amber Hillen"
      ]
   },
   "albums": []
}