{
   "Name": "Dizmas",
   "rawData": [
      "Dizmas is an American Christian rock band from Lancaster, California.\n",
      "Nick Aranda, Clayton Hunt and brothers Zach and Josh Zegan began playing together as teenagers in 1998 while attending Desert Christian High School in Lancaster, California. They were later joined by Jon Howard, who is from Mechanicsburg, Pennsylvania.\n",
      "Their debut album \"On a Search in America\" was released on June 21, 2005. Jon Howard's younger brother, Joey, joined Dizmas as a roadie/merch guy/techie in 2006, now serving as tour manager. On May 3, 2006 their song \"Revolution\" aired on \"CSI: NY – Season 2: Stealing Home\". Their second album \"Tension\" was produced by Steve Wilson and released on May 5, 2007. On July 10, 2007 their song \"Shake It Off\" aired on ESPN. Soon after their hit single \"Play It Safe\" reached No. 1 on Radio & Records Christian Rock National Airplay chart of national broadcasters in the United States for the week ending Aug 03, 2007. In fall 2008, the band had their last tour in Czech Republic which led to a break. In response to their rising success, The Miami New Times noted Dizmas's unique talents in their \"2007 Music Year in Review\" piece.\n"
   ],
   "infobox": {
      "Origin": [
         "Lancaster, California, United States"
      ],
      "Genres": [
         "Christian rock, post-hardcore,[1] alternative rock"
      ],
      "Years active": [
         "2002–2009 (on hiatus)"
      ],
      "Labels": [
         "Credential, ForeFront"
      ],
      "Website": [
         "dizmas.com"
      ],
      "Members": [
         "Zach Zegan",
         "Kevin Dickson",
         "Tomaš Samiec",
         "Jeňa Pospíšil",
         "Jaime Hays"
      ],
      "Past members": [
         "Josh Zegan",
         "Jon Howard",
         "Nick Aranda",
         "Clayton Hunt"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Lancaster, California.\n",
      "Nick Aranda, Clayton Hunt and brothers Zach and [PERSON_NAME_FULL_0_MALE] began playing together as teenagers in [YEAR] while attending Desert Christian High School in Lancaster, California. They were later joined by [PERSON_NAME_FULL_1_MALE], who is from Mechanicsburg, Pennsylvania.\n",
      "Their debut album \"On a Search in America\" was released on [MONTH] 21, [YEAR]. Jon Howard's younger brother, Joey, joined [BAND_NAME] as a roadie/merch guy/techie in [YEAR], now serving as tour manager. On [MONTH] 3, [YEAR] their song \"Revolution\" aired on \"CSI: NY – Season 2: Stealing Home\". Their second album \"Tension\" was produced by [PERSON_NAME_FULL_0_MALE] and released on [MONTH] 5, [YEAR]. On [MONTH] 10, [YEAR] their song \"Shake It Off\" aired on ESPN. Soon after their hit single \"Play It Safe\" reached No. 1 on Radio & Records Christian Rock National Airplay chart of national broadcasters in the United States for the week ending [MONTH] 03, [YEAR]. In fall [YEAR], the band had their last tour in Czech Republic which led to a break. In response to their rising success, The Miami New Times noted [BAND_NAME]'s unique talents in their \"[YEAR] Music Year in Review\" piece.\n"
   ]
}