{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "The ensemble consisted of up to four part vocals led by Matthew McQueen, backed by pianist Karl Brown, with violin, flute/sax, and a string bassist and drummer from the San Francisco Lesbian/Gay Freedom Band.\n",
         "With an acoustic parody of punk rock as a starting point, writers Brown and McQueen incorporated elements of jazz, classical, theater and the avant-garde into somewhat twisted song structures that are both interesting and accessible. Their sound, dubbed \"erotic jazz wave\" has been compared to cartoon music, klezmer, and Frank Zappa. Automatic Pilot anticipated the queercore bands by a decade. The post-punk genre fits best due to the time period, punk influence and experimental bent.\n",
         "Automatic Pilot continued to perform in San Francisco at various venues including the Castro Street Fair, the On Broadway Theater and the Valencia Rose gay performance space, venturing as far as the Chute II Bar in Reno.\n",
         "Automatic Pilot was covered regularly by local media including the San Francisco Chronicle.[3][4] The Bay Area Reporter published four full length articles on the band between 1982 and 1985.[5][6][7][8] Their music was featured on regional radio shows including KPFA's Fruit Punch. Nationally, they appeared in the New York Native[9] and The Advocate, which singled them out along with the band Orquestra Sabrosita as vibrant independent artists in contrast to \"the financial concerns and artistic reserve of the larger gay cultural institutions\"  of San Francisco in 1982.[10] They were played on the nationally syndicated Dr. Demento radio show.\n",
         "In 1983, vocalist Tony Kramedas set out to produce an album for major label release.  These recordings, done over time as budget permitted, had a more electric 80's sound with guitars, synthesizers and drum machines. The project came to a halt when Kramedas became ill; he died in 1985, as have several other band members. During Automatic Pilot's final months, Brown and McQueen became involved in writing and performing music for the original 1984 Theatre Rhinoceros production of The AIDS Show.\n",
         "The master tapes sat on a shelf until 2002 when the Automatic Pilot website was launched, with many complete recordings in mp3 and ogg format of live performances and studio works, and a detailed history. The site also features music from The AIDS Show and newly rediscovered video (in both H.264/MPEG-4 AVC and MPEG-1 format) from Automatic Pilot's December 1982 performance at the Valencia Rose. The CDs were released in 2005.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Automatic Pilot was a San Francisco, California band.  Created in 1980 by members of the San Francisco Gay Men's Chorus, they were described by The Advocate as \"a non-official offshoot\" of SFGMC along with three official subgroups.[1] Automatic Pilot soon came into their own as an independent force, creating a niche at the fringe of the nascent gay musical movement and a new musical style.\n",
         "They achieved notoriety early on with songs such as \"Sit On My Face\" and \"Killer Purses\" performed at benefits for the SFGMC, Theatre Rhinoceros, and the Sisters of Perpetual Indulgence.  They derived their name from psychiatric testimony[2] at Dan White's trial for killing Mayor George Moscone and Supervisor Harvey Milk.\n"
      ]
   },
   "Title": "Automatic Pilot - Wikipedia"
}