{
   "Name": "Fighting Instinct",
   "rawData": [
      "Fighting Instinct was a Christian rock band formed in Winston-Salem/Greensboro, North Carolina. It was founded by TJ Harris and Dallas Farmer. They played together for several years before they met up with Jason Weekly in the Winston-Salem/Greensboro area. Jason Weekly came up with the band's name.\n",
      "They released their first CD, Fighting Instinct, in mid-2006. The first single off this album, \"I Found Forever,\" was featured on both rock and Christian radio stations. \"I Found Forever\" rose to No. 31 on the active rock charts with virtually no touring. The band's Christian single, \"Back to You\", reached No. 5 on the Christian CHR charts. \"Back to You\" and \"Just to Please You\" were only released to Christian radio stations. In October 2008, the band announced on their MySpace that they were releasing a five-song EP, but also announced they were going to disband at the end of the year.\n",
      "Their Lead Vocalist, TJ Harris, joined the band Decyfer Down in 2008.\n"
   ],
   "infobox": {
      "Origin": [
         "United States"
      ],
      "Genres": [
         "Christian rock[1][2][3][4][5]",
         "Southern rock[6][7]",
         "Christian alternative rock[1]",
         "Christian metal[6]",
         "alternative rock[1]",
         "alternative metal[5]",
         "hard rock[6]",
         "grunge[6]",
         "post-grunge[3]"
      ],
      "Years active": [
         "2004–2008"
      ],
      "Labels": [
         "Gotee"
      ],
      "Website": [
         "fightinginstinct.com"
      ],
      "Past members": [
         "TJ Harris",
         "Jason Weekly",
         "Chris Burrow",
         "Derek Drye",
         "Dallas Farmer"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band formed in Winston-Salem/Greensboro, North Carolina. It was founded by TJ Harris and Dallas Farmer. They played together for several years before they met up with [PERSON_NAME_FULL_0_MALE] in the Winston-Salem/Greensboro area. [PERSON_NAME_FULL_0_MALE] came up with the band's name.\n",
      "They released their first CD, [BAND_NAME], in mid-[YEAR]. The first single off this album, \"I Found Forever,\" was featured on both rock and Christian radio stations. \"I Found Forever\" rose to No. 31 on the active rock charts with virtually no touring. The band's Christian single, \"Back to You\", reached No. 5 on the Christian CHR charts. \"Back to You\" and \"Just to Please You\" were only released to Christian radio stations. In [MONTH] [YEAR], the band announced on their MySpace that they were releasing a [GENRE]",
      "Their Lead Vocalist, TJ Harris, joined the band [MONTH]yfer Down in [YEAR].\n"
   ]
}