{
   "Name": "Fono (band)",
   "rawData": [
      "Fono is a rock band, originally from the United Kingdom but later based out of San Diego, California.\n",
      "Fono formed under the name Seven (and originally from Milton Keynes), and released one album and one EP under this name; they also opened for a UK concert by Bon Jovi before changing their name to Fono in 1998. Lead singer Del Currie had previously played with Split Level and Tribe of Dan, and went on a year-long hiatus from songwriting and performing before putting the group together. The band has stated that the name \"Fono\" has no significance; in an interview, Currie said \"It means absolutely nothing\".  Following the name change, the group was featured in Kerrang! magazine as one of their Best Unsigned Bands. Not long after, they did sign with a label, and the group released their debut full-length, Goesaroundcomesaround, in 1999. Album reviewers noted the album's American, as opposed to British, rock sound and the group's general appeal to audiences outside the world of Christian rock. In America, the group scored two Christian radio hits with the singles \"Now She's 24\" (No. 7, 1999) and \"Drift Away\" ( 16, 2000). They also toured with Robert Plant, The Goo Goo Dolls, Third Eye Blind, and Audio Adrenaline.\n",
      "After the release of the album, the band relocated permanently to the United States, settling in  San Diego, California in 2000. That year, a restructuring at their record label resulted in their becoming embroiled in a lawsuit which took over two years to resolve; during this time the band was prevented from recording any music. They then began recording a new album, but the studio where they were recording and all of their equipment and masters were destroyed in the Cedar Fire of 2003. The group re-recorded the material and independently released It's the Way That You Use It in 2004 and Too Broken to Break in 2007.\n"
   ],
   "infobox": {
      "Also known as": [
         "Seven"
      ],
      "Origin": [
         "United Kingdom"
      ],
      "Genres": [
         "Alternative rock, Christian rock"
      ],
      "Years active": [
         "1996–?"
      ],
      "Website": [
         "fono.net"
      ]
   }
}