{
   "Name": "Further Seems Forever",
   "rawData": [
      "Further Seems Forever is an American rock band formed in 1998 in Pompano Beach, Florida. Over its initial eight-year run the band experienced several lineup changes, resulting in a different lead vocalist performing on each of their first three studio albums. Original singer Chris Carrabba recorded The Moon Is Down (2001) with the group before leaving to start Dashboard Confessional. He was replaced by Jason Gleason, who performed on How to Start a Fire (2003) but left the band the following year. Former Sense Field vocalist Jon Bunch joined Further Seems Forever for Hide Nothing (2004). The band broke up in 2006 but reunited four years later with Carrabba on vocals. Their fourth studio album, Penny Black, was released in 2012.\n",
      "The band's music is often classified as indie rock and is frequently associated with the emo genre. They have also been classified as a Christian rock act due to the individual band members' religious beliefs, frequent themes of Christianity in their lyrics, their association with the predominantly Christian Tooth & Nail Records label, and their performances at Christian-themed festivals such as Cornerstone. Despite these associations, the group has claimed not to be an explicitly Christian band, but rather a rock band with Christian members.\n",
      "The band formed in 1998 in Pompano Beach, Florida after the breakup of the Christian hardcore band Strongarm. Strongarm guitarists Josh Colbert and Nick Dominguez, bassist Chad Neptune, and drummer Steve Kleisath recruited Vacant Andys vocalist Chris Carrabba to form Further Seems Forever. The first song the new band released was \"Vengeance Factor\" on the Deep Elm Records compilation An Ocean of Doubt: The Emo Diaries, Chapter Four, which contributed to the band's association with the emo genre. Their first release was a split EP with fellow Floridians Recess Theory entitled From the 27th State, released by Takehold Records, and soon the band had signed a recording contract with Seattle-based Christian label Tooth and Nail Records. By 2000, however, Carrabba had begun working on his own project Dashboard Confessional and recorded the album The Swiss Army Romance, essentially a solo release which he considered too personal for Further Seems Forever. At this time the band struggled with interpersonal squabbles and difficulties touring, as Dominguez had a young family and was reluctant to tour outside the state. This forced the group to search for several fill-in guitarists to replace him on tour. After returning from a solo tour in August 2000 Carrabba announced that he was leaving the group in order to focus on Dashboard Confessional full-time:\n"
   ],
   "infobox": {
      "Origin": [
         "Pompano Beach, Florida, U.S."
      ],
      "Genres": [
         "Emo, indie rock"
      ],
      "Years active": [
         "1998–2006, 2010–present"
      ],
      "Labels": [
         "Takehold, Tooth & Nail, 567, Rise"
      ],
      "Associated acts": [
         "Strongarm, Vacant Andys, Shai Hulud, Dashboard Confessional, Affinity, Sense Field, Fields Forever, ActionReaction"
      ],
      "Website": [
         "www.furtherseemsforever.com"
      ],
      "Members": [
         "Chris Carrabba",
         "Josh Colbert",
         "Nick Dominguez",
         "Steve Kleisath",
         "Chad Neptune"
      ],
      "Past members": [
         "Jason Gleason",
         "James Paul Wisner",
         "Derick Cordoba",
         "Jon Bunch"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in [YEAR] in Pompano Beach, Florida. Over its initial eight-year run the band experienced several lineup changes, resulting in a different lead vocalist performing on each of their first three studio albums. Original singer [PERSON_NAME_FULL_1_MALE] recorded The Moon Is Down ([YEAR]) with the group before leaving to start Dashboard Confessional. He was replaced by [PERSON_NAME_FULL_0_MALE], who performed on How to Start a Fire ([YEAR]) but left the band the following year. Former Sense Field vocalist Jon Bunch joined [BAND_NAME] for Hide Nothing ([YEAR]). The band broke up in [YEAR] but reunited four years later with [PERSON_NAME_LAST_1] on vocals. Their fourth studio album, Penny Black, was released in [YEAR].\n",
      "The band's music is often classified as indie rock and is frequently associated with the emo genre. They have also been classified as a [GENRE] band members' religious beliefs, frequent themes of Christianity in their lyrics, their association with the predominantly Christian Tooth & [PERSON_NAME_FULL_0_MALE] label, and their performances at Christian-themed festivals such as Cornerstone. Despite these associations, the group has claimed not to be an explicitly Christian band, but rather a rock band with Christian members.\n",
      "The band formed in [YEAR] in Pompano Beach, Florida after the breakup of the [PERSON_NAME_FIRST_3]tian hardcore band Strongarm. Strongarm guitarists Josh Colbert and [PERSON_NAME_FULL_0_MALE], bassist Chad Neptune, and drummer [PERSON_NAME_FULL_2_MALE] recruited Vacant Andys vocalist [PERSON_NAME_FULL_3_MALE] to form [BAND_NAME]. The first song the new band released was \"Vengeance Factor\" on the Deep Elm [PERSON_NAME_LAST_1] compilation An Ocean of Doubt: The Emo Diaries, Chapter Four, which contributed to the band's association with the emo genre. Their first release was a split EP with fellow Floridians Recess Theory entitled From the 27th State, released by Takehold [PERSON_NAME_LAST_1], and soon the band had signed a recording contract with Seattle-based [PERSON_NAME_FIRST_3]tian label Tooth and [PERSON_NAME_FULL_1_MALE]. By [YEAR], however, [PERSON_NAME_LAST_3] had begun working on his own project Dashboard Confessional and recorded the album The Swiss Army Romance, essentially a solo release which he considered too personal for [BAND_NAME]. At this time the band struggled with interpersonal squabbles and difficulties touring, as [PERSON_NAME_LAST_0] had a young family and was reluctant to tour outside the state. This forced the group to search for several fill-in guitarists to replace him on tour. After returning from a solo tour in [MONTH] [YEAR] [PERSON_NAME_LAST_3] announced that he was leaving the group in order to focus on Dashboard Confessional full-time:\n"
   ]
}