{
   "Name": "Ghoti Hook",
   "rawData": [
      "Ghoti Hook was an American punk band from Fairfax, Virginia. The band formed in 1991, signed to Tooth & Nail Records in 1996, and disbanded in 2002.\n",
      "Joel Bell, Adam Neubauer, and Justin Levy formed the group in 1991. Conrad Tolosa and Christian Ergueta, who also went to the same youth group, joined the band shortly after. Justin Levy left the band after one year to pursue other interests. Conrad's cousin, Jamie Tolosa, was asked to join the band soon after. In 1994 they started to develop their pop-punk sound. The group released two independent EPs in 1994 and 1995, both produced by Kevin 131 at Assembly Line Studios. They built a following primarily in central Pennsylvania. Ghoti Hook signed to Tooth and Nail Records in 1996, then released four albums: Sumo Surprise, Banana Man, Songs We Didn't Write, and Two Years To Never.\n",
      "Conrad, the guitarist and a primary songwriter of the band, decided to leave Ghoti Hook after the release of \"Banana Man\" and the subsequent tour promoting its release.  He left the band when the band began to tour full-time so he could finish seminary and continue with his accounting career. His last show was in the fall of 1997 at a show promoted by Javacasa in Lebanon, PA. Mark Lacasse joined on lead guitar in 1998 and helped to  write and record \"Two Years to Never\". Christian Ergueta left the band sometime after the recording of \"Two Years to Never\" with Mark leaving a few months later.\n"
   ],
   "infobox": {
      "Origin": [
         "Fairfax, Virginia, United States"
      ],
      "Genres": [
         "punk rock, Pop punk"
      ],
      "Years active": [
         "1990–2002, 2009"
      ],
      "Labels": [
         "Tooth and Nail Records"
      ],
      "Past members": [
         "Joel Bell",
         " Justin Levy",
         " Adam Neubauer",
         " Mark Lacasse",
         " Christian Ergueta",
         " Conrad Tolosa",
         " Jamie Tolosa"
      ]
   },
   "albums": [
      "No Date",
      "Boca Grande",
      "Sumo Surprise",
      "Banana Man",
      "Songs We Didn't Write",
      "Two Years to Never",
      "Ep",
      "Retrospective",
      "Rest in Peace"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Fairfax, Virginia. The band formed in [YEAR], signed to Tooth & Nail Records in [YEAR], and disbanded in [YEAR].\n",
      "Joel Bell, Adam Neubauer, and [PERSON_NAME_FULL_2_MALE] formed the group in [YEAR]. Conrad [PERSON_NAME_LAST_0] and [PERSON_NAME_FULL_1_MALE], who also went to the same youth group, joined the band shortly after. [PERSON_NAME_FULL_2_MALE] left the band after one year to pursue other interests. Conrad's cousin, [PERSON_NAME_FULL_0_FEMALE], was asked to join the band soon after. In [YEAR] they started to develop their pop-punk sound. The group released two independent EPs in [YEAR] and [YEAR], both produced by Kevin 131 at Assembly Line Studios. They built a following primarily in central Pennsylvania. [BAND_NAME] signed to Tooth and Nail Records in [YEAR], then released four albums: Sumo Surprise, Banana Man, Songs We Didn't Write, and Two Years To Never.\n",
      "Conrad, the guitarist and a [GENRE] band, decided to leave [BAND_NAME] after the release of [SONG_NAME] with [MONTH]k leaving a few months later.\n"
   ]
}