{
   "Name": "Glowin' Moses",
   "Sections": [
      "1 Early history",
      "2 Lineup changes",
      "3 2006 and beyond",
      "4 The name",
      "5 Band members",
      "6 Discography",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Glowin’ Moses was a Christian rock band formed in the late 1990s. The band took their name from the Biblical story of Moses. The band released four albums during the eight years they were together.\n"
      ]
   },
   "Early history": {
      "text": [
         "The band was formed in October 1999 in Newport News, Virginia as part of the First Baptist Church Music Ministry. Their music is best described as an amalgam of structured pop-rock and freewheeling jam band stylings. The original lineup consisted of Ron Mason on guitar, Michael J. Adams on drums, Ray Fowler, Jr. on bass, and lead singer Nathan \"Nate\" Milton. In addition to solid musicianship, the band employed the songwriting team of Adams and Milton. Mirroring the songwriting arrangement of the great Lennon–McCartney writing team, Milton and Adams composed over 60 songs during their four year partnership. The band began by playing at numerous churches, youth rallies, coffee houses, & nightclubs. They were a part of various festivals and conferences, quickly garnering local and regional attention for their modern music and stage presence. One of the band's highlights occurred in 2001, when they opened for Christian music legends Petra in Waynesboro, VA. In 2003 another moment happened when they appeared on \"The Local Connection\".  A popular radio show that aired on WJLZ.  The show was broadcast both locally and nationally via the internet. The band has released four albums to date (including \"Soul Food\", which was produced by David \"Pic\" Conley of the R&B group Surface).\n"
      ]
   },
   "Lineup changes": {
      "text": [
         "Besides their music, Glowin' Moses most notable trait was their ever-changing roster. In 2000 the band expanded their roster from four to seven members. In addition to adding saxophonist Curtis Brown (who had already begun playing with the band in several concerts), the band added \"The Philipino Phenom\" Alden Lumagui on bass and \"Sugar\" Shawn Moseley on keyboards. This is the \"classic\" GM lineup that would remain intact for the next three years. In 2003 the band went through a series of lineup changes. Bassist Alden Lumagui left the band to pursue other personal and musical opportunities (he eventually resurfaced with the band Simple Life). Lumagui was \"replaced\" by a pastiche of fill-in bass players, including Michael Adams' brother, Brian. The band eventually settled on a steady lineup which featured Michael Adams on lead guitar, Ron Mason on bass guitar and Shawn Moseley on drums. In the Summer of 2003, the band added Shawn Downey as the permanent bass player. But the lineup changes weren't finished for the band. At the end of 2003 founding members Ray Fowler and Nathan Milton both departed the band for personal and professional reasons. Milton eventually returned to the music scene with his R&B/Soul collective, Mosaic. Following Milton's departure, Curtis Brown assumed the duties of lead singer and the band continued to record new music, resulting in the CD \"Grey\" (which included the final nine Adams-Milton collaborations).  In October 2005, Shawn Moseley and Shawn Downey decided to part ways with the band.  Brian Adams returned on Bass guitar, reducing GM back to its original number of four members. In 2005 the band also added keyboard player Vladimir Barrios. After a year of being in the band, Barrios left the group to return to his native home of California. In 2007, after eight years and four albums, the band decided to take an \"Indefinite Hiatus\".\n"
      ]
   },
   "2006 and beyond": {
      "text": [
         "In 2006 the band appeared as part of The Inspiration Network (INSP) channel program  \"CATS\" (Christian Artist Talent Search) this was the band's final televised performance. In 2007, after eight years and four albums, the band decided to take an \"indefinite hiatus\".  In 2008 the remaining members finally decided to part ways for good, effectively ending the band. Rumors persisted of a reunion in 2009 (10 years after the band's initial formation), but the rumors were not addressed by any of the band's former members.\n",
         "As of 2010, several members are still in pursuit of their musical ambitions. Curtis Brown plays saxophone in the Michael Clark Band. Michael J. Adams is playing and writing for the Ben Phelps Project. Ron Mason continues to play guitar for First Baptist Church. While many of the members have departed from the band, most of the guys remain in contact. In 2013, Alden Lumagui, after almost 8 years of musical abstinence, dusted off the ol' 5 string EdgeQ Hammer with the DR Neon strings and auditioned for the Waters Edge Church production team at their Yorktown, VA campus. \"I was worried about auditions and not having picked up a bass in soo long, but overall it went great!\" said Lumagui of his audition experience. As of 2015, Lumagui continues to play bass for WEC in Yorktown, VA and still manages to keep in touch with his former Glowin' Moses band mates.\n"
      ]
   },
   "The name": {
      "text": [
         "The band took their name from a Biblical scripture passage, Exodus 34:29-35.\nThe passage tells of Moses coming into the presence of God on Mount Sinai.\n",
         "\"29 When Moses came down from Mount Sinai with the two tablets of the Testimony in his hands, he was not aware that his face was radiant because he had spoken with the LORD. 30 When Aaron and all the Israelites saw Moses, his face was radiant, and they were afraid to come near him. 31 But Moses called to them; so Aaron and all the leaders of the community came back to him, and he spoke to them. 32 Afterward all the Israelites came near him, and he gave them all the commands the LORD had given him on Mount Sinai.\n33 When Moses finished speaking to them, he put a veil over his face. 34 But whenever he entered the LORD's presence to speak with him, he removed the veil until he came out. And when he came out and told the Israelites what he had been commanded, 35 they saw that his face was radiant. Then Moses would put the veil back over his face until he went in to speak with the Lord.\" - NIV Version\n"
      ]
   },
   "Band members": {
      "text": [
         "The band's original lineup consisted of:\n",
         "\nFormer band members\n",
         "\nThe band's final lineup consisted of:\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "coreData": [
      "Glowin’ Moses was a Christian rock band formed in the late 1990s. The band took their name from the Biblical story of Moses. The band released four albums during the eight years they were together.\n",
      "The band was formed in October 1999 in Newport News, Virginia as part of the First Baptist Church Music Ministry. Their music is best described as an amalgam of structured pop-rock and freewheeling jam band stylings. The original lineup consisted of Ron Mason on guitar, Michael J. Adams on drums, Ray Fowler, Jr. on bass, and lead singer Nathan \"Nate\" Milton. In addition to solid musicianship, the band employed the songwriting team of Adams and Milton. Mirroring the songwriting arrangement of the great Lennon–McCartney writing team, Milton and Adams composed over 60 songs during their four year partnership. The band began by playing at numerous churches, youth rallies, coffee houses, & nightclubs. They were a part of various festivals and conferences, quickly garnering local and regional attention for their modern music and stage presence. One of the band's highlights occurred in 2001, when they opened for Christian music legends Petra in Waynesboro, VA. In 2003 another moment happened when they appeared on \"The Local Connection\".  A popular radio show that aired on WJLZ.  The show was broadcast both locally and nationally via the internet. The band has released four albums to date (including \"Soul Food\", which was produced by David \"Pic\" Conley of the R&B group Surface).\n",
      "Besides their music, Glowin' Moses most notable trait was their ever-changing roster. In 2000 the band expanded their roster from four to seven members. In addition to adding saxophonist Curtis Brown (who had already begun playing with the band in several concerts), the band added \"The Philipino Phenom\" Alden Lumagui on bass and \"Sugar\" Shawn Moseley on keyboards. This is the \"classic\" GM lineup that would remain intact for the next three years. In 2003 the band went through a series of lineup changes. Bassist Alden Lumagui left the band to pursue other personal and musical opportunities (he eventually resurfaced with the band Simple Life). Lumagui was \"replaced\" by a pastiche of fill-in bass players, including Michael Adams' brother, Brian. The band eventually settled on a steady lineup which featured Michael Adams on lead guitar, Ron Mason on bass guitar and Shawn Moseley on drums. In the Summer of 2003, the band added Shawn Downey as the permanent bass player. But the lineup changes weren't finished for the band. At the end of 2003 founding members Ray Fowler and Nathan Milton both departed the band for personal and professional reasons. Milton eventually returned to the music scene with his R&B/Soul collective, Mosaic. Following Milton's departure, Curtis Brown assumed the duties of lead singer and the band continued to record new music, resulting in the CD \"Grey\" (which included the final nine Adams-Milton collaborations).  In October 2005, Shawn Moseley and Shawn Downey decided to part ways with the band.  Brian Adams returned on Bass guitar, reducing GM back to its original number of four members. In 2005 the band also added keyboard player Vladimir Barrios. After a year of being in the band, Barrios left the group to return to his native home of California. In 2007, after eight years and four albums, the band decided to take an \"Indefinite Hiatus\".\n",
      "In 2006 the band appeared as part of The Inspiration Network (INSP) channel program  \"CATS\" (Christian Artist Talent Search) this was the band's final televised performance. In 2007, after eight years and four albums, the band decided to take an \"indefinite hiatus\".  In 2008 the remaining members finally decided to part ways for good, effectively ending the band. Rumors persisted of a reunion in 2009 (10 years after the band's initial formation), but the rumors were not addressed by any of the band's former members.\n"
   ]
}