{
   "Name": "Grammatrain",
   "rawData": [
      "Grammatrain is an alternative rock band from Seattle, Washington who were active in the Christian rock industry in the 1990s. After disbanding in 1998, the group reunited as a mainstream act in 2009 and released their third full-length album entitled Imperium the following year.\n",
      "Singer/guitarist Pete Stewart, bassist Dalton Roraback and his drummer brother Paul Roraback recorded a self-titled three-song demo tape in 1994. After hearing the demo, ForeFront Records label executive Eddie DeGarmo signed the band.  Before releasing their first major album, Grammtrain released a CD containing four studio recordings and five live acoustic numbers. In 1995 they released their first studio album, Lonely House, produced by Aaron Sprinkle. The album achieved success on Christian Radio.\n",
      "Their second full-length album, Flying was released in 1997. Critics cited the album's \"lighter, more polished feel\" when compared to Lonely House. At the end of a tour promoting the album, Grammatrain officially broke up following their final live performance on 12/7/1998 in Germany. An announcement of the breakup can be heard on the band's live album.\n"
   ],
   "infobox": {
      "Origin": [
         "Seattle, Washington, U.S."
      ],
      "Genres": [
         "Alternative rock, post-grunge, grunge"
      ],
      "Years active": [
         "1994–1998, 2009–present"
      ],
      "Labels": [
         "Forefront, independent"
      ],
      "Members": [
         "Pete Stewart",
         "Dalton Roraback",
         "Paul Roraback"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Seattle, Washington who were active in the Christian rock industry in the [YEAR]s. After disbanding in [YEAR], the group reunited as a mainstream act in [YEAR] and released their third full-length album entitled Imperium the following year.\n",
      "Singer/guitarist Pete Stewart, bassist Dalton [PERSON_NAME_LAST_2] and his drummer brother [PERSON_NAME_FULL_2_MALE] recorded a self-titled three-song demo tape in [YEAR]. After hearing the demo, ForeFront Records label executive [PERSON_NAME_FULL_1_MALE] signed the band.  Before releasing their first major album, Grammtrain released a CD containing four studio recordings and five live acoustic numbers. In [YEAR] they released their first studio album, Lonely House, produced by [PERSON_NAME_FULL_0_MALE]. The album achieved success on Christian Radio.\n",
      "Their second full-length album, Flying was released in [YEAR]. Critics cited the album's \"lighter, more polished feel\" when compared to Lonely House. At the end of a tour promoting the album, [BAND_NAME] officially broke up following their final live performance on 12/7/[YEAR] in Germany. An announcement of the breakup can be heard on the band's live album.\n"
   ]
}