{
   "Name": "Gretchen (band)",
   "Sections": [
      "1 Music",
      "2 Biography",
      "3 Equipment",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Gretchen were an American female-fronted alternative rock band from Bristol, Tennessee, United States, featuring heavy guitar tones and emotional, ethereal melodies led by husband and wife team of Dave and Mia Richards. Mia took on bassist duties after the Mouth Full of Nails album, due to the difficulty of keeping a regular bass player.\n"
      ]
   },
   "Music": {
      "text": [
         "According to their website, the band describes their music as \"Heavy-Melodic-Happy-Gothic-Chick-Rock\" or \"female-fronted rock.\" Gretchen's sound has a somewhat ethereal but upbeat rock sound described as a cross between several different artists. However, they excel with a style all their own by balancing heavy guitar tones and ethereal melodic melodies with radio-friendly song writing and catchy hooks.[citation needed] The band's name was partly taken from an album titled Gretchen Goes to Nebraska by King's X.\n"
      ]
   },
   "Biography": {
      "text": [
         "Gretchen has shared the stage with Crossbreed, Everclear, Copper, Flyleaf, The Showdown, Thousand Foot Krutch, Disciple, Pillar, and Stryper.\n",
         "Both of the first two singles \"Fading\" and \"Passion\" (from the CD In the Mean Time) were top 20 hits on Christian rock chart.[citation needed]\n",
         "In the Mean Time was produced by three time Dove Award winner Travis Wyrick. Wyrick is highly acclaimed for his production with the bands P.O.D., Pillar, Disciple, and 10 years.[2]\n",
         "Four songs from Gretchen's first CD Mouth Full of Nails have also received national recognition. The song \"Star\" was used in a Ford Motor Company Ford Ranger promotion and three other songs have received an honorable mention in the 12th annual Billboard International Songwriting Contest (in the rock/alternative category).\n",
         "Gretchen was featured on the cover of Heaven's Metal Magazine's January/February 2005 issue.\n",
         "Gretchen was one of six finalist winners (out of 1000 entries) who competed in the 2005 IMWS Competition sponsored by Billboard Magazine.\n",
         "Since their second album, the band has not released anything new nor posted any news, insinuating that they have disbanded. Since 2004, Mia has been a realtor.[3]\n"
      ]
   },
   "Equipment": {
      "text": [
         "Mia's Basses:\nTwo ESP (not LTD) 4 String B2's (one black tuned DADG and one white tuned BEAD)\n",
         "Mia's Rig:\nSKB Rack, two Ampeg Pro 4x10 2000w cabs, Gallien-Krueger 1000w head, Korg strobe tuner, Bass Balls pedal, Boss Bass Distortion Pedal, Boss Chorus Pedal, Boss Tuner Pedal\n",
         "Dave's Guitars:\nIbanez 7-String in purple, Dean 7-String in black, Gibson Studio LesPaul 6-String in black, PRS 6-String sunburst\n",
         "Dave's Rig:\nMesa 18 Space Shock Rack, Mesa 90/90 Tube Amp (Grove Tubes), Mesa Triaxis Preamp (also Grove Tubes), Rocktron All-Access Pedalboard, \ntwo Ernie Ball volume pedals (used for midi controls with All-Access), Dunlop Cry-Baby Rack mounted WAH, Samson power conditioner with custom Gretchen logo, Korg strobe tuner, Rocktron rack mounted stereo mixer, Line 6 Echo Pro, Line 6 Filter Pro, Line 6 Mod Pro, Decimator Noice Gate, GCX Patch Switcher, DigiTech Midi Whammy Pedal, Boss Acoustic Simulator.\n[4]\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Gretchen were an American female-fronted alternative rock band from Bristol, Tennessee, United States, featuring heavy guitar tones and emotional, ethereal melodies led by husband and wife team of Dave and Mia Richards. Mia took on bassist duties after the Mouth Full of Nails album, due to the difficulty of keeping a regular bass player.\n",
      "According to their website, the band describes their music as \"Heavy-Melodic-Happy-Gothic-Chick-Rock\" or \"female-fronted rock.\" Gretchen's sound has a somewhat ethereal but upbeat rock sound described as a cross between several different artists. However, they excel with a style all their own by balancing heavy guitar tones and ethereal melodic melodies with radio-friendly song writing and catchy hooks.[citation needed] The band's name was partly taken from an album titled Gretchen Goes to Nebraska by King's X.\n",
      "Gretchen has shared the stage with Crossbreed, Everclear, Copper, Flyleaf, The Showdown, Thousand Foot Krutch, Disciple, Pillar, and Stryper.\n",
      "Both of the first two singles \"Fading\" and \"Passion\" (from the CD In the Mean Time) were top 20 hits on Christian rock chart.[citation needed]\n"
   ]
}