{
   "Background": {
      "text": [
         "The song's main riff was written by Joe Perry on a Fender Bass VI, which gives the song its distinctive \"growl\".  Brad Whitford plays the lead guitar part.  \"Back in the Saddle\" also features one of the heaviest and most noticeable bass lines by Tom Hamilton.  The song is also notable for the slow buildup of the drum beat and guitar riff in the beginning of the song, as well as the sound effects of a galloping horse and whips, and screams and yodeling by Steven Tyler at the end of the song.  A real bullwhip was intended to be used for the whip effects and hours were spent trying to get it to crack.  The band members ended up cut up and hurt without making any progress.  Eventually, the band decided the whip effects would be created by whirling a 30-foot cord from the studio, then by firing a cap gun to create the crack of the whip (the sound effects are more prominent in the Quadraphonic mix of the album (Columbia CAQ 34165)).  When the song is performed in concert, Tyler often makes more noticeable lyrical and visible references to sex.  Although the lyrics, by Tyler, were written with the simple idea of cowboys and sex, this song took on new meaning after Aerosmith reunited in 1984 and embarked on their Back in the Saddle Tour.\n",
         "Today, the song remains a staple on classic rock radio and in concert.  It is arguably one of the heaviest songs of Aerosmith's Top 40 singles, and is cited by rock musicians Slash and James Hetfield as among their favorite rock songs.\n",
         "The \"saddle\" Tyler refers to in the song is metaphorical to several sexual positions.\n"
      ]
   },
   "Cover versions": {
      "text": [
         "Sebastian Bach covered the song on his 2007 solo album Angel Down as a duet with Guns N' Roses frontman Axl Rose.\n",
         "Mark Slaughter, Albert Lee, Rudy Sarzo and Frankie Banali covered the song for the Aerosmith tribute album Not the Same Old Song and Dance (Eagle Records, 1999). Additional guitars were by the album's producers, Bob Kulick and Bruce Bouillet.\n"
      ]
   },
   "In other media": {},
   "References": {},
   "Sections": [
      "1 Background",
      "2 Cover versions",
      "3 In other media",
      "4 References"
   ],
   "Summary": {
      "text": [
         "\"Back in the Saddle\" is a song by American hard rock band Aerosmith.  It was written by Steven Tyler and Joe Perry.  It is the first track on Aerosmith's hard rock album Rocks released in 1976.  The song was also released as the third single from the album in 1977.  It peaked at #38 on the Billboard Hot 100.\n"
      ]
   },
   "Title": "Back in the Saddle - Wikipedia"
}