{
   "Name": "Roper (band)",
   "rawData": [
      "Roper was a Christian pop-punk band formed in Denver, Colorado. The band consisted of Reese Roper (lead singer of Five Iron Frenzy) on lead vocals, Jonathan Byrnside on lead guitar, Jonathan Till on bass, Matt Emmett on rhythm guitar, and Nick White on drums.\n",
      "Guerilla Rodeo\nGuerilla Rodeo was a short-lived project founded by Reese Roper, meant to follow his prior band Five Iron Frenzy. In addition to vocalist Reese Roper, the band was formed by fellow Five Iron member Sonnie Johnston (guitar), Ethan Luck (guitar), John Warne (bass, background vocals), and Josh Abbott (drums). The project yielded only a three-track EP, Ride, Rope and Destroy, released in 2004. It has been confirmed by both Ethan Luck and Reese Roper that there never was a fourth, unreleased song recorded for the EP. Reese Roper often compared the sound of the band to Letters to Cleo. Their name was a play on the Rage Against the Machine single \"Guerrilla Radio\".\n",
      "When the Guerilla Rodeo project came to an end, Reese reformed the band under his own name, Roper. Roper's full-length album, Brace Yourself for the Mediocre, was produced before the band was officially together and released on Five Minute Walk Records. All songs on the album with the exception of \"Day of Pigs\" and \"You're Still The One\" were written by Reese Roper, Masaki Liu, and Ethan Luck. Because of the incomplete state of the band at the time of the album's release, the only official member appearing on the CD is Reese Roper. As a result, the album features many additional musicians such as Frank Lenz (drums), Elijah Thomson (bass), Phil Bennett (organ), Bob Schiveley (guitar), Masaki Liu (guitar), Jason White (additional drums), Ethan Luck (guitar), and many additional vocalists. Some of the songs on the album were originally written for Guerilla Rodeo.  One of the online forums spawned by this group is the Roper Board in which many fans of both Roper and Reese's previous band Five Iron Frenzy congregate.\n"
   ],
   "infobox": {
      "Origin": [
         "Denver, Colorado, US"
      ],
      "Genres": [
         "Pop punk"
      ],
      "Years active": [
         "2004–2005"
      ],
      "Labels": [
         "Five Minute Walk"
      ],
      "Associated acts": [
         "Five Iron Frenzy, Guerilla Rodeo, Brave Saint Saturn"
      ],
      "Past members": [
         "Reese Roper",
         "Jonathan Byrnside",
         "Matt \"Emo\" Emmett",
         "Jonathan Till",
         "Nick White",
         "Stephen Till"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band formed in Denver, Colorado. The band consisted of Reese [BAND_NAME] (lead singer of Five Iron Frenzy) on lead vocals, [PERSON_NAME_FULL_0_MALE] on lead guitar, [PERSON_NAME_FIRST_0] Till on bass, [PERSON_NAME_FULL_1_MALE] on rhythm guitar, and Nick White on drums.\n",
      "Guerilla Rodeo\nGuerilla Rodeo was a short-lived project founded by Reese [BAND_NAME], meant to follow his prior band [PERSON_NAME_FULL_1_MALE]. In addition to vocalist Reese [BAND_NAME], the band was formed by fellow [PERSON_NAME_FIRST_1] [PERSON_NAME_LAST_1] member Sonnie Johnston (guitar), [PERSON_NAME_FULL_2_MALE] (guitar), John Warne (bass, background vocals), and [PERSON_NAME_FULL_0_MALE] (drums). The project yielded only a three-track EP, Ride, Rope and Destroy, released in [YEAR]. It has been confirmed by both [PERSON_NAME_FULL_2_MALE] and Reese [BAND_NAME] that there never was a fourth, unreleased song recorded for the EP. Reese [BAND_NAME] often compared the sound of the band to Letters to Cleo. Their name was a play on the Rage Against the Machine single [SONG_NAME].\n",
      "When the Guerilla Rodeo project came to an [GENRE] band under his own name, [BAND_NAME]. [BAND_NAME]'s full-length album, Brace Yourself for the Mediocre, was produced before the band was officially together and released on [PERSON_NAME_FIRST_3] Minute Walk Records. All songs on the album with the exception of [SONG_NAME] were written by Reese [BAND_NAME], [PERSON_NAME_FULL_2_MALE], and Ethan Luck. Because of the incomplete state of the band at the time of the album's release, the only official member appearing on the CD is Reese [BAND_NAME]. As a result, the album features many additional musicians such as [PERSON_NAME_FULL_0_MALE] (drums), Elijah Thomson (bass), [PERSON_NAME_FULL_1_MALE] (organ), Bob Schiveley (guitar), [PERSON_NAME_FULL_2_MALE] (guitar), [PERSON_NAME_FULL_4_MALE] (additional drums), Ethan Luck (guitar), and many additional vocalists. Some of the songs on the album were originally written for Guerilla Rodeo.  One of the online forums spawned by this group is the [BAND_NAME] Board in which many fans of both [BAND_NAME] and Reese's previous band [PERSON_NAME_FULL_3_MALE] congregate.\n"
   ]
}