{
   "Name": "Halo (Christian rock band)",
   "rawData": [
      "Halo was a Christian rock band formed in Alabama in 1980. Touring in the South for almost a decade before a chance meeting with an encouraging Bob Hartman of Petra fame, Halo was signed by Pakaderm Records and recorded their first album in 1989. Another album followed in 1992 before the group disbanded in 1993.\n",
      "Said to be an acronym for \"Heavenly Angelic Light Orchestra,\" Halo began in Alabama in 1980 when drummer Mike Graham, age 14, was introduced to vocalist and bass player Scott Springer and guitarist Keith Mims, both seven years older than Graham.  Mims and Springer made it clear to Graham that their interest was in pursuing Christian music. Graham, who had already played drums in a Southern Gospel group for two years without taking up the Christian faith, had his reservations, but he liked the music Springer and Mims were playing and assumed he could play with them, just like he had in the Southern Gospel group, without any conflicts of interest.\n",
      "After playing in Halo for only two years, Graham was won over to the Christian faith in January 1982, and, with a unified mission to be a Christian band with a ministry, it was at this point that the group really started to take form.  Working to get their stride, Halo toured the Southern United States, performing mostly in Alabama, Tennessee, Florida and Georgia.  While playing the circuit, members of the band and friend Ken Headley (acting booking agent) were asked to attend a Petra concert in hope to meet the band and discuss Halo's desire to possible pursue ministry full-time.  The guys were told the band was on a tight schedule and could not make a meeting.  Ken, who had attended Samford University, ran into a past little sister in his fraternity, Kim Whisonant Hartman, now Bob Harmon's wife.  She was able to get a brief meeting and the guys handed him a demo tape.   A short time after the band received a call from Bob Hartman, founder and guitarist for perennial favorites in the Christian music industry, Petra. Hartman acted as a mentor to Halo, providing advice on song-writing as well as sound equipment. Despite their efforts and advice, Halo was still unsigned after nine years of touring, and their performances were effectively equal to a diversion that consumed many hours.\n"
   ],
   "infobox": {}
}