{
   "Beginning with reservations": {
      "text": [
         "Said to be an acronym for \"Heavenly Angelic Light Orchestra,\" Halo began in Alabama in 1980 when drummer Mike Graham, age 14, was introduced to vocalist and bass player Scott Springer and guitarist Keith Mims, both seven years older than Graham.  Mims and Springer made it clear to Graham that their interest was in pursuing Christian music. Graham, who had already played drums in a Southern Gospel group for two years without taking up the Christian faith, had his reservations, but he liked the music Springer and Mims were playing and assumed he could play with them, just like he had in the Southern Gospel group, without any conflicts of interest.[2]\n"
      ]
   },
   "Concerts": {
      "text": [
         "Halo's concerts were said to have included a powerful, aggressive, and energetic air; a compact sound and light system that was surprisingly impressive without overpowering the show; vocalist Scott Springer's comments about the songs' messages before playing them; sermons about living a pure life without sex and drugs; prayer; altar calls while getting the audience to join in praise choruses, and the distribution of Bibles.  Despite the band's evangelistic tone, Springer was reported as humbly saying, at least once, that he could not force anyone to live a life of Christ, but that it must be a person's own decision.[9]\n"
      ]
   },
   "Debut imbues confidence, connections": {
      "text": [
         "By 1990, Halo had released their self-titled debut album, featuring ten tracks written and played by Springer, Mims, Graham, and the Elefante brothers, with arrangements by Bob Hartman and session players, guitarist Tony Palacios (Guardian) and keyboardist John Andrew Schreiner (Carman, Steve Camp, Petra).[3][4] Altogether, the album is said to exude the \"sound of a cohesive power pop band\", drawing likenesses to both secular and Christian artists, such as Foreigner, Journey, Kansas, Petra, and Mastedon.[1]\n"
      ]
   },
   "Full-time ministry, part of the Pak": {
      "text": [
         "In 1989, Springer announced that God was calling him to full-time ministry. Originally, it appeared that he was going to head off to seminary to become a youth pastor. However, around the same time, Bob Hartman told Graham that he had given a Halo demo tape, recorded in Hartman's studio, to brothers John Elefante and Dino Elefante, owners of Pakaderm Records in Los Alamos, CA and the producers of the last few Petra albums. Not long thereafter, Pakaderm offered Halo a recording contract.[2]\n"
      ]
   },
   "Heaven Calling: 1991": {
      "text": [
         "In 1991, Halo released their second album with Pakaderm: Heaven Calling. Following work with Rick Cua, Barry Graul (later to become a frequent session player in the Christian music industry and member of MercyMe)[5] replaced Keith Mims on guitar, and Scott Springer and John Elefante teamed up to write lyrics and music, respectively, for all the songs on Heaven Calling, except \"It's Your Decision\" and \"Secret to Love\", to which Mike Graham contributed.[6][7] This musical pairing proved to be successful because on November 2, 1991, the title-cut, \"Heaven Calling,\" debuted on Billboard's Top Contemporary Christian chart at No. 21.[2][8] Additionally, online reports show that Halo had four number one Christian Rock hits in its career,[citation needed] and although no verification has been found at the time of this writing to prove it, high probability is that a majority of those hits came from Heaven Calling. The album also garnered success outside the U.S. In touring, Halo found an amazingly receptive audience in South America in places like Guatemala, where they played in Christmas 1991.[2]\n"
      ]
   },
   "Life after Halo": {
      "text": [
         "After 1993, no other Halo albums or tours are reported, but Scott Springer continued to tour as a self-proclaimed artist and preacher—although an executive hand in the business is also suspected considering its name—for Halo Productions, a booking agency representing ministry-minded Christian recording artists and bands.[11] As Springer began touring with Hello Forever, he took a part-time Student Minister position at a small church. This eventually led him to a full-time youth ministry position, where he took a break from the road, was ordained as a minister, and began teaching and evangelizing youth in his community. He also became chaplain of local youth sports teams.[citation needed] In 2004, Springer became head pastor of a new church with a casual atmosphere in Clanton, AL called New Life Community Church.[12]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Beginning with reservations",
      "2 Unified mission, separate from signing",
      "3 Full-time ministry, part of the Pak",
      "4 Debut imbues confidence, connections",
      "5 Heaven Calling: 1991",
      "6 Concerts",
      "7 Third album?",
      "8 Life after Halo",
      "9 References"
   ],
   "Summary": {
      "text": [
         "Halo was a Christian rock band formed in Alabama in 1980. Touring in the South for almost a decade before a chance meeting with an encouraging Bob Hartman of Petra fame, Halo was signed by Pakaderm Records and recorded their first album in 1989. Another album followed in 1992 before the group disbanded in 1993.[1][2]\n"
      ]
   },
   "Third album?": {
      "text": [
         "In an interview in February 1993, drummer Mike Graham is reported talking about their new guitarist P.J. Marx and the recording of Halo's third album that, at the time of the interview, Springer was working on in Pakaderm's studios, laying down vocal tracks. Graham says the album was slated for release in May or June of that same year;[2] however, no records show that the album ever came to fruition. Rather, Scott Springer put out a solo album in 1993 called Hello Forever that credited Graham on drums but no mention of a P.J. Marx. The compositions on this solo effort, like Heaven Calling before, were the work primarily of Springer and the Elefantes.,[10] and again, the combination gave Springer four No. 1 songs on Christian Hit Radio.[citation needed]\n",
         "As of April 2020 Halo's CD's have been remastered and reissued by Girder Music. Also for the first time there's a CD of Halo demos. Lastly, Scott Springer's solo CD is also reissued.  They can be found here https://girdermusic.com/products/halo-heaven-calling-life-goes-on-jesus-music-4-cd-bundle?_pos=6&_sid=6cdf3cb00&_ss=r\n"
      ]
   },
   "Title": "Halo (Christian rock band) - Wikipedia",
   "Unified mission, separate from signing": {
      "text": [
         "After playing in Halo for only two years, Graham was won over to the Christian faith in January 1982, and, with a unified mission to be a Christian band with a ministry, it was at this point that the group really started to take form.  Working to get their stride, Halo toured the Southern United States, performing mostly in Alabama, Tennessee, Florida and Georgia.  While playing the circuit, members of the band and friend Ken Headley (acting booking agent) were asked to attend a Petra concert in hope to meet the band and discuss Halo's desire to possible pursue ministry full-time.  The guys were told the band was on a tight schedule and could not make a meeting.  Ken, who had attended Samford University, ran into a past little sister in his fraternity, Kim Whisonant Hartman, now Bob Harmon's wife.  She was able to get a brief meeting and the guys handed him a demo tape.   A short time after the band received a call from Bob Hartman, founder and guitarist for perennial favorites in the Christian music industry, Petra. Hartman acted as a mentor to Halo, providing advice on song-writing as well as sound equipment. Despite their efforts and advice, Halo was still unsigned after nine years of touring, and their performances were effectively equal to a diversion that consumed many hours.[2]\n"
      ]
   }
}