{
   "Name": "Harvest (band)",
   "rawData": [
      "Harvest was a Christian band founded in Lindale, Texas by Jerry Williams in 1977.  The vision of Harvest was to see 100 million people come to know Jesus Christ personally through the band's music ministry.\n",
      "Jerry Williams had come from a nightclub entertainment background and music had been a major part of his life.  In an interview, Williams stated that \" realized there had to be more to life than sports cars and dating beauty queens . . . I became a Christian.\"  Williams spent some time playing the guitar on Texas streets before becoming a pastor in Bloomington, Indiana.  Along with Jerry Williams, the original members of Harvest were Ed Kerr and Paul Wilbur - both music students.  Wilbur had met Williams at a church where Williams was the youth pastor, and Williams had been influential in Wilbur's decision to become a Christian.  Ed Kerr was a mutual friend of both Williams and Wilbur.  Kerr had met Williams at a rally at Indiana University in Bloomington, and made a decision to become a Christian afterwards.  The three men collaborated on the first two albums created by Harvest:  Harvest and Morning Sun. \n",
      "Later in 1981, personal problems forced Williams to disband the original Harvest group - which at one time had numbered five.  The group was reformed as a duo of Williams and Kerr.  Williams and Kerr were together for the production of many records, including It's Alright Now, Send Us to the World, Voices, Only the Overcomers, Give Them Back, Holy Fire and Carry On. In 1982 the magazine CCM took notice of the duo in its article, \"A Bountiful Harvest.\"\nThe writer praised the group's vocal harmonies and was especially fond of the song \"Because I Am\" (found on the album It's Alright Now).\n"
   ],
   "infobox": {
      "Also known as": [
         "Jerry Williams and Harvest"
      ],
      "Origin": [
         "Lindale, Texas"
      ],
      "Genres": [
         "Contemporary Christian music, Gospel"
      ],
      "Years active": [
         "1977–1995"
      ],
      "Labels": [
         "Everlasting Spring",
         "Milk & Honey",
         "Greentree",
         "Benson"
      ],
      "Past members": [
         "Jerry Williams",
         "Ed Kerr",
         "Paul Wilbur",
         "Tommy Hoeser",
         "Ben Ketting",
         "Wes Aarum",
         "Jeff Seighman",
         "Jim Meyer",
         "Elisa Meyer",
         "Mike Coker"
      ]
   },
   "albums": [
      "Harvest"
   ],
   "prunedData": [
      "[BAND_NAME] was a [PERSON_NAME_LAST_0]ian band founded in Lindale, Texas by Jerry Williams in [YEAR].  The vision of [BAND_NAME] was to see 100 million people come to know [PERSON_NAME_FULL_0_MALE] personally through the band's music ministry.\n",
      "Jerry Williams had come from a [GENRE] a major part of his life.  In an interview, Williams stated that [SONG_NAME]  Williams spent some time playing the guitar on Texas streets before becoming a pastor in Bloomington, Indiana.  Along with Jerry Williams, the original members of [BAND_NAME] were [PERSON_NAME_FULL_0_MALE] and Paul Wilbur - both music students.  Wilbur had met Williams at a church where Williams was the youth pastor, and Williams had been influential in Wilbur's decision to become a Christian.  [PERSON_NAME_FULL_0_MALE] was a mutual friend of both Williams and Wilbur.  [PERSON_NAME_LAST_0] had met Williams at a rally at Indiana University in Bloomington, and made a decision to become a Christian afterwards.  The three men collaborated on the first two albums created by [BAND_NAME]:  [BAND_NAME] and Morning Sun. \n",
      "Later in [YEAR], personal problems forced Williams to disband the original [BAND_NAME] group - which at one time had numbered five.  The group was reformed as a duo of Williams and Kerr.  Williams and Kerr were together for the production of many records, including It's Alright Now, Send Us to the World, Voices, Only the Overcomers, Give Them Back, Holy Fire and Carry On. In [YEAR] the magazine CCM took notice of the duo in its article, [SONG_NAME]\nThe writer praised the group's vocal harmonies and was especially fond of the song [SONG_NAME] (found on the album It's Alright Now).\n"
   ]
}