{
   "Name": "The Insyderz",
   "Sections": [
      "1 Band history",
      "1.1 Post break up",
      "2 Reunion",
      "3 Members",
      "4 Discography",
      "4.1 Charts",
      "5 References",
      "5.1 Further reading",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Insyderz were an American Christian ska-punk band from Detroit, Michigan. They formed in 1996 and disbanded in 2005. The band reformed in 2009, but have not been actively playing shows in the last few years. The Insyderz are one of the \"big three\" bands which represented the Christian ska scene, alongside the Supertones and Five Iron Frenzy.[1][2]\n"
      ]
   },
   "Band history": {
      "Post break up": {
         "text": [
            "Nate Sjogren has played drums in several other projects including Dead By Sunday, The Paper Sound, and the singer/songwriter James Stephen.\n",
            "In December 2007, Todd, along with wife Sarah, welcomed their first child, a girl named Harper Rose Miesch. Both mother and baby are doing fine.\n",
            "In January 2008 Todd Miesch received his first official teaching job teaching for Stoney Creek High School in Rochester, Michigan.\n",
            "Michael Lloyd now lives in Los Angeles, and is currently working in the film industry. Nate and Beau work together at the Genesis church in Royal Oak, MI. Joe works as a police officer now.\n"
         ]
      },
      "text": [
         "The Insyderz began from Joe Yerke and Nate Sjogren who led worship together at their church.[3] Many members have associations with the Salvation Army, and throughout the life of the band support has been reciprocal, with the band playing at SA sponsored youth rallies.[4] The band found their break at the 1996 Cornerstone Festival.[5] They began playing on their campsite, and wound up garnering the attention of Michael Sean Black and Gene Eugene, who signed them to his label Brainstorm Artists International. While that label folded soon after, the band's first album, Motor City Ska (1997), effectively established a presence in the Christian music marketplace and garnered the attention of Steve Taylor's Squint Entertainment.[6]\n",
         "Their subsequent release, Skalleluia, became their most successful album and ranked the highest in record sales for the band. The album consists of contemporary praise and worship songs in ska and ska-punk renditions. Guest performances include Gene Eugene, Terry Scott Taylor, and Steve Taylor.[7] Despite the fact that their initial formation centered around turning praise and worship songs into ska[8][9] the album faced criticism for \"jumping on the bandwagon\" on praise and worship music's growing commercial appeal.[8] Beyond charting on Billboard's \"Hot 200\" and \"Heatseekers\" charts and spending six months on their \"Top Contemporary Christian\" chart,[10] their rendition of Rich Mullins' song \"Awesome God\" won the band a Dove Award for \"Hard Music Recorded Song of the Year\" in 1999.[11] Some commercial success for the album was due in part to the use of recently written and widely known contemporary worship songs.[1] Covers on the album include Twila Paris's \"We will Glorfiy\" and Keith Green's \"Oh, Lord, You're Beautiful\".\n",
         "—Joe Yerke, on the band's purpose.[2]\n",
         "Skalleluia became an unexpected hit for the band but differs from the sound the Insyderz had displayed on their own original material.[2] Skalleluia broke the band into the national limelight, but somewhat restricted their audience to the church. For the Insyderz this was somewhat problematic; their stated goal was to attract a mainstream audience in order to, in the words of Joe Yerke, \"reach the unsaved.\"[2] In mid-1998 trombonist Mike Rowland got married and left the band; he was replaced by Sang Kim, who appeared on their next release.[12] Later the same year they released their third album, Fight of My Life, which contains original songs and returned the sound of their debut release.\n",
         "In support of Skalleluia! the band toured with Plankeye and Morella's Forest.[9] In 1999 they made an appearance on The 700 Club[13] and embarked on an all-ska tour with the Skeletones and Jeffries Fan Club. On this tour the band held daily Bible studies where two members of the Skeletones converted to Christianity.[8] Also following this tour Jeffries Fan Club guitarist Sonnie Johnston left to join Five Iron Frenzy.[8] Late that year they were a part of the \"Holy Roller Tour\", which was held in roller skating rinks across the nation. Other bands involved included Five Iron, The W's, and Justin McRoberts.[14]\n",
         "In 2000 Skalleluia Too! was released. Within the next few years the band's website featured rare updates and touring seemed to halt which led to rumors of the band's demise. However, The Insyderz had become tired of record label politics and until business had been sorted out continued to perform on a much smaller scale. Many of the members of the band married including Nate Sjogren (drums), Bram Roberts (Trumpet), Beau McCarthy (Bass), Kyle Wasil (Guitar), and Joe Yerke (vocals). The band decided to spend more time working and ministering through other projects while never fully disbanding. Nate Sjogren, for instance, left to start a youth oriented church in Michigan with the help of the Salvation Army.[15]\n",
         "In 2001 a compilation CD entitled The Greatest & The Rarest (or alternately Tails of a Comet) was released, which consists of fifteen popular songs from their first four albums and six rare songs.\n",
         "In 2003 they re-activated, appearing at Cornerstone,[16] and releasing an album entitled Soundtrack to a Revolution. After the release the Insyderz went through another lineup change adding Royce Nunley (Suicide Machines) and Dan Powers (Blueprint 76) on bass.\n",
         "In the first half of 2005, the band announced on their website that they would be playing their last three shows in August and September of that year, which led to confusion on whether they were the band's last three shows or the tour's last three. Later, in August of the same year, the site was updated to announce that the band would be breaking up after their final show on September 24, 2005, as a part of the I'll Fight Fest presented by The Salvation Army. The show was performed with The O.C. Supertones who were also in the midst of a final tour. In 2009, the band got back together and in 2012, they released The Sinner's Songbook. In 2012, they did a short tour with Five Iron Frenzy, but have remained inactive in the past several years due to the band member's work schedules and family life. \n"
      ]
   },
   "Reunion": {
      "text": [
         "In August 2009, The Insyderz played a reunion show at the I'll Fight Festival,[citation needed] and have recently started a Facebook page which states that the band is back together, and they have been playing many shows locally.[citation needed] In October/November 2010 The Insyderz went on a short European tour, playing shows in Germany, Switzerland, and Austria.[citation needed]\n",
         "During 2011, The Insyderz launched a kickstarter campaign to fund their next album, The Sinner's Songbook, and succeeded in raising the funds to do so.[17][better source needed] In April 2012 The Insyderz began recording at Al Sutton's Rustbelt Studio in Royal Oak, MI with Producer/Engineer Eric Hoegemeyer, and released The Sinner's Songbook publicly on Labor Day, September 3, 2012. The band played some sporadic local shows during this time, which sometimes featured fill-in trombone players, including Kenny Plont, formerly of A Billion Ernies. However, trombone duties were usually performed by Tim Reynolds. Matt Darcie and John Miller played guitar and bass in the band during their reunion as well. [18][better source needed]\n"
      ]
   },
   "Members": {},
   "Discography": {
      "Charts": {}
   },
   "References": {
      "Further reading": {}
   },
   "External links": {},
   "coreData": [
      "The Insyderz were an American Christian ska-punk band from Detroit, Michigan. They formed in 1996 and disbanded in 2005. The band reformed in 2009, but have not been actively playing shows in the last few years. The Insyderz are one of the \"big three\" bands which represented the Christian ska scene, alongside the Supertones and Five Iron Frenzy.[1][2]\n",
      "The Insyderz began from Joe Yerke and Nate Sjogren who led worship together at their church.[3] Many members have associations with the Salvation Army, and throughout the life of the band support has been reciprocal, with the band playing at SA sponsored youth rallies.[4] The band found their break at the 1996 Cornerstone Festival.[5] They began playing on their campsite, and wound up garnering the attention of Michael Sean Black and Gene Eugene, who signed them to his label Brainstorm Artists International. While that label folded soon after, the band's first album, Motor City Ska (1997), effectively established a presence in the Christian music marketplace and garnered the attention of Steve Taylor's Squint Entertainment.[6]\n",
      "Their subsequent release, Skalleluia, became their most successful album and ranked the highest in record sales for the band. The album consists of contemporary praise and worship songs in ska and ska-punk renditions. Guest performances include Gene Eugene, Terry Scott Taylor, and Steve Taylor.[7] Despite the fact that their initial formation centered around turning praise and worship songs into ska[8][9] the album faced criticism for \"jumping on the bandwagon\" on praise and worship music's growing commercial appeal.[8] Beyond charting on Billboard's \"Hot 200\" and \"Heatseekers\" charts and spending six months on their \"Top Contemporary Christian\" chart,[10] their rendition of Rich Mullins' song \"Awesome God\" won the band a Dove Award for \"Hard Music Recorded Song of the Year\" in 1999.[11] Some commercial success for the album was due in part to the use of recently written and widely known contemporary worship songs.[1] Covers on the album include Twila Paris's \"We will Glorfiy\" and Keith Green's \"Oh, Lord, You're Beautiful\".\n",
      "—Joe Yerke, on the band's purpose.[2]\n"
   ]
}