{
   "Name": "The Insyderz",
   "rawData": [
      "The Insyderz were an American Christian ska-punk band from Detroit, Michigan. They formed in 1996 and disbanded in 2005. The band reformed in 2009, but have not been actively playing shows in the last few years. The Insyderz are one of the \"big three\" bands which represented the Christian ska scene, alongside the Supertones and Five Iron Frenzy.\n",
      "The Insyderz began from Joe Yerke and Nate Sjogren who led worship together at their church. Many members have associations with the Salvation Army, and throughout the life of the band support has been reciprocal, with the band playing at SA sponsored youth rallies. The band found their break at the 1996 Cornerstone Festival. They began playing on their campsite, and wound up garnering the attention of Michael Sean Black and Gene Eugene, who signed them to his label Brainstorm Artists International. While that label folded soon after, the band's first album, Motor City Ska (1997), effectively established a presence in the Christian music marketplace and garnered the attention of Steve Taylor's Squint Entertainment.\n",
      "Their subsequent release, Skalleluia, became their most successful album and ranked the highest in record sales for the band. The album consists of contemporary praise and worship songs in ska and ska-punk renditions. Guest performances include Gene Eugene, Terry Scott Taylor, and Steve Taylor. Despite the fact that their initial formation centered around turning praise and worship songs into ska the album faced criticism for \"jumping on the bandwagon\" on praise and worship music's growing commercial appeal. Beyond charting on Billboard's \"Hot 200\" and \"Heatseekers\" charts and spending six months on their \"Top Contemporary Christian\" chart, their rendition of Rich Mullins' song \"Awesome God\" won the band a Dove Award for \"Hard Music Recorded Song of the Year\" in 1999. Some commercial success for the album was due in part to the use of recently written and widely known contemporary worship songs. Covers on the album include Twila Paris's \"We will Glorfiy\" and Keith Green's \"Oh, Lord, You're Beautiful\".\n"
   ],
   "infobox": {
      "Origin": [
         "Detroit, Michigan, U.S."
      ],
      "Genres": [
         "Christian ska, Ska punk"
      ],
      "Years active": [
         "1996–2005; 2009–2013"
      ],
      "Labels": [
         "Squint Entertainment, KMG, Floodgate"
      ],
      "Associated acts": [
         "BUCK Enterprises"
      ],
      "Past members": [
         "Joe Yerke",
         "Beau McCarthy",
         "Bram Roberts",
         "Pedro Zapata Hernandez",
         "Michael Lloyd",
         "Nate Sjogren",
         "Alan Brown",
         "Kyle Wasil",
         "Sang Kim",
         "Mike Rowland",
         "Todd Miesch"
      ]
   },
   "prunedData": [
      "[BAND_NAME] were an [GENRE] band from Detroit, Michigan. They formed in [YEAR] and disbanded in [YEAR]. The band reformed in [YEAR], but have not been actively playing shows in the last few years. [BAND_NAME] are one of the \"big three\" bands which represented the Christian ska scene, alongside the Supertones and Five Iron Frenzy.\n",
      "[BAND_NAME] began from [PERSON_NAME_FULL_0_MALE] and Nate Sjogren who led worship together at their church. Many members have associations with the Salvation Army, and throughout the life of the band support has been reciprocal, with the band playing at SA sponsored youth rallies. The band found their break at the [YEAR] Cornerstone Festival. They began playing on their campsite, and wound up garnering the attention of Michael Sean Black and Gene Eugene, who signed them to his label Brainstorm Artists International. While that label folded soon after, the band's first album, Motor City Ska ([YEAR]), effectively established a [GENRE]",
      "Their subsequent release, Skalleluia, became their most successful album and ranked the highest in record sales for the band. The album consists of contemporary praise and worship songs in ska and ska-punk renditions. Guest performances include Gene Eugene, [PERSON_NAME_FULL_1_MALE], and Steve Taylor. Despite the fact that their initial formation centered around turning praise and worship songs into ska the album faced criticism for \"jumping on the bandwagon\" on praise and worship music's growing commercial appeal. Beyond charting on Billboard's \"Hot 200\" and \"Heatseekers\" charts and spending six months on their \"Top Contemporary Christian\" chart, their rendition of [PERSON_NAME_FULL_2_MALE]' song \"Awesome God\" won the band a Dove Award for \"Hard Music Recorded Song of the Year\" in [YEAR]. Some commercial success for the album was due in part to the use of recently written and widely known contemporary worship songs. Covers on the album include Twila Paris's \"We will Glorfiy\" and [PERSON_NAME_FULL_0_MALE]'s \"Oh, Lord, You're Beautiful\".\n"
   ]
}