{
   "Name": "Ivoryline",
   "rawData": [
      "Ivoryline is an American Christian rock band from Tyler, Texas, formerly signed to Tooth & Nail Records.\n",
      "Ivoryline formed in 2003 under the name Dead End Driveway, releasing an EP and an album under this name before changing the name to Ivoryline in 2005. Soon after the name change, the band was selected to play at the 2006 Vans Warped Tour. While on the tour, they were scouted by Tooth & Nail Records, who signed them in 2007 and released their debut full-length, There Came a Lion, in February 2008. The album hit No. 25 on the Billboard Top Christian Albums chart and No. 15 on the Top Heatseekers Chart.\n",
      "The group toured with Automatic Loveletter in July 2008. In the fall of that year, Ivoryline toured with Family Force 5 and The Maine, before they embarked on their first headlining tour (called \"There Came a Tour\") with There For Tomorrow, In:Aviate, and The Lives of Famous Men. The band is currently a four-piece and working on new material.\n"
   ],
   "infobox": {
      "Also known as": [
         "Dead End Driveway"
      ],
      "Origin": [
         "Tyler, Texas, United States"
      ],
      "Genres": [
         "Pop punk, alternative rock, Christian rock,[1][2][3][4] post-hardcore[5]"
      ],
      "Years active": [
         "2003–present"
      ],
      "Labels": [
         "Tooth & Nail"
      ],
      "Members": [
         "Jeremy Gray",
         "Dusty Kittle",
         "Wes Hart",
         "Shane Rivette",
         "Brandon Crabtree"
      ],
      "Past members": [
         "Robert Woodward",
         "Scott Socia",
         "Michael Bethancourt",
         "Eric Meeks"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Tyler, Texas, formerly signed to Tooth & Nail Records.\n",
      "[BAND_NAME] formed in [YEAR] under the name Dead End Driveway, releasing an [GENRE] an album under this name before changing the name to [BAND_NAME] in [YEAR]. Soon after the name change, the band was selected to play at the [YEAR] Vans Warped Tour. While on the tour, they were scouted by Tooth & Nail Records, who signed them in [YEAR] and released their debut full-length, There Came a Lion, in [MONTH] [YEAR]. The album hit No. 25 on the Billboard Top Christian Albums chart and No. 15 on the Top Heatseekers Chart.\n",
      "The group toured with Automatic Loveletter in [MONTH] [YEAR]. In the fall of that year, [BAND_NAME] toured with Family Force 5 and The Maine, before they embarked on their first headlining tour (called \"There Came a Tour\") with There For Tomorrow, In:Aviate, and The Lives of Famous Men. The band is currently a four-piece and working on new material.\n"
   ]
}