{
   "Name": "Jacob's Trouble",
   "rawData": [
      "Jacob's Trouble was an American Christian rock band formed in Atlanta, Georgia in the 1980s. The group originally consisted of members Jerry Davison (drums, lead vocals), Mark Blackburn (guitar, lead vocals), and Steve Atwell (bass).\n",
      "In 1989, Jacob's Trouble released their debut, Terry Taylor-produced album, The Door Into Summer, a mixture of original numbers and cover versions of songs by The Beatles and The Monkees.\n",
      "A year later the band released their second album, Knock, Breathe, Shine. The band received notice at the time for the song \"About Sex\", a song about the proper role of sex in society from a Christian perspective. Fearing a fundamentalist label, the band opted to remove the song from the album and replaced it with the more ambiguous \"About Sex, Part 2\". Despite this, the album was the group's best-selling record. They performed \"About Sex\" during a concert at Dellinger Park in Cartersville, GA.\n"
   ],
   "infobox": {
      "Origin": [
         "Atlanta, Georgia, US"
      ],
      "Genres": [
         "Christian rock"
      ],
      "Years active": [
         "1989–1998"
      ],
      "Labels": [
         "¡Alarma!"
      ],
      "Associated acts": [
         "Janah, sideways8"
      ],
      "Past members": [
         "Jerry Davison ",
         "Mark Blackburn ",
         " Steve Atwell ",
         " Ron Cochran ",
         " Keith Johnston"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band formed in Atlanta, Georgia in the [YEAR]s. The group originally consisted of members Jerry Davison (drums, lead vocals), [MONTH]k Blackburn (guitar, lead vocals), and [PERSON_NAME_FULL_0_MALE] (bass).\n",
      "In [YEAR], [BAND_NAME] released their debut, Terry Taylor-produced album, The Door Into Summer, a [GENRE]",
      "A year later the band released their second album, Knock, Breathe, Shine. The band received notice at the time for the song \"About Sex\", a [GENRE] a Christian perspective. Fearing a fundamentalist label, the band opted to remove the song from the album and replaced it with the more ambiguous \"About Sex, Part 2\". Despite this, the album was the group's best-selling record. They performed \"About Sex\" during a concert at Dellinger Park in Cartersville, GA.\n"
   ]
}