{
   "Name": "JAG (band)",
   "rawData": [
      "\nJAG was a Christian rock band that recorded during the early 1990s.  The band's name is an acronym for the band's founder and lead singer, John Allen Garies.\n",
      "John \"Johnny\" Allen Garies, Jr. (November 11, 1952 – August 5, 2007) was born in Houston, Texas to John A. \"Oscar\" Garies, Sr. and Shirley A. (Gray) Garies, one of three children (Michael and Wendy, his two siblings).  Garies started playing drums at age 10 and taught himself to play guitar and piano. Graduating in 1971 from Channelview High School in Harris County, Texas, John attended Texas A&M University. He married his wife, Ricka Cox around 1973, with whom he had two children, John Joel and Annie Grace.\n",
      "Building on his passion for music, Garies formed JAG in the late 1980s. JAG's original lineup for their 1990 debut, The Longest Road included guitarist J. Paul Brittain, guitarist and keyboardist Joel McCreight, bassist Tim Hall, drummer Chuck Connor, and Garies on lead vocals. Their 1991 follow up The Only World in Town traded McCreight for Michael Lusk and featured additional help from drummer Chris McHugh  and guitarists, Jim Williams, Dale Oliver (originally of Geoff Moore's band) and Giant's Dann Huff. Produced by frequent CCM-session keyboardist Blair Masters, JAG's final album, Fire in the Temple, featured songs written by Garies, and the likes of Billy Smiley and Mark Gersmehl and performed by players Gordon Kennedy, Chris McHugh and Tommy Sims, all of whom were current or former members of the group Whiteheart, a band's sound to which JAG is oft-compared.\n"
   ],
   "infobox": {},
   "prunedData": [
      "\n[BAND_NAME] was a [GENRE] band that recorded during the early [YEAR]s.  The band's name is an acronym for the band's founder and lead singer, John Allen Garies.\n",
      "[PERSON_N[PERSON_NAME_LAST_0]ME_FIRST_0] \"[PERSON_N[PERSON_NAME_LAST_0]ME_FIRST_0]ny\" [PERSON_NAME_LAST_0]llen Garies, Jr. ([MONTH] 11, [YE[PERSON_NAME_LAST_0]R] – [MONTH] 5, [YE[PERSON_NAME_LAST_0]R]) was born in Houston, Texas to [PERSON_N[PERSON_NAME_LAST_0]ME_FULL_0_M[PERSON_NAME_LAST_0]LE]. \"Oscar\" Garies, Sr. and Shirley [PERSON_NAME_LAST_0]. (Gray) Garies, one of three children (Michael and Wendy, his two siblings).  Garies started playing drums at age 10 and taught himself to play guitar and piano. Graduating in [YE[PERSON_NAME_LAST_0]R] from Channelview High School in Harris County, Texas, [PERSON_N[PERSON_NAME_LAST_0]ME_FIRST_0] attended Texas [PERSON_NAME_LAST_0]&M University. He married his wife, Ricka Cox around [YE[PERSON_NAME_LAST_0]R], with whom he had two children, [PERSON_N[PERSON_NAME_LAST_0]ME_FIRST_0] Joel and [PERSON_NAME_LAST_0]nnie [PERSON_NAME_LAST_1].\n",
      "Building on his passion for music, Garies formed [BAND_NAME] in the late [YEAR]s. [BAND_NAME]'s original lineup for their [YEAR] debut, The Longest Road included guitarist J. Paul Brittain, guitarist and keyboardist [PERSON_NAME_FULL_1_MALE], bassist Tim Hall, drummer [PERSON_NAME_FULL_0_MALE], and Garies on lead vocals. Their [YEAR] follow up The Only World in Town traded [PERSON_NAME_LAST_1] for Michael Lusk and featured additional help from drummer [PERSON_NAME_FULL_2_MALE]  and guitarists, Jim Williams, [PERSON_NAME_FULL_4_MALE] (originally of Geoff Moore's band) and Giant's Dann Huff. Produced by frequent CCM-session keyboardist Blair Masters, [BAND_NAME]'s final album, Fire in the Temple, featured songs written by Garies, and the likes of [PERSON_NAME_FULL_3_MALE] and [MONTH]k Gersmehl and performed by players Gordon Kennedy, [PERSON_NAME_FULL_2_MALE] and [PERSON_NAME_FULL_5_MALE], all of whom were current or former members of the group Whiteheart, a band's sound to which [BAND_NAME] is oft-compared.\n"
   ]
}