{
   "Background": {
      "text": [
         "Liberation Suite formed early in the Jesus Music era, prior to 1971 in San Marcos, Texas.[4] The group got their start as a backup band for a choral group called Sound 70 based in San Marcos, Texas, but began traveling with evangelist Bill Lowery and the Christ is the Answer tent ministry in 1973.[5]\n",
         "In 1974 they moved for six months to Northern Ireland,[4] which was at that time war-torn by The Troubles. Here they ran what was essentially a street concert ministry, as well as playing many concerts in schools, colleges, and large concert halls.[5] During this time they also played at the inaugural Greenbelt Festival in England. They then moved to London after being signed to Word Records' Myrrh label. Throughout 1975 the band toured with Malcolm and Alwyn, Barry McGuire, and Jamie Owens.[4] In 1976 they toured Europe with Chuck Girard before moving back to Texas until 1979, when they relocated to Los Angeles.\n",
         "During a brief reunification period in 1980 they recorded their second album, Stride For Stride, and again toured Europe.[5] \nThey moved back to Texas in 1981, members moving into other types of ministry or work, regrouping from time to time for a few concerts or recording. \nSeveral other versions of the band lineup toured parts of America and Europe, and recorded in 1990–92.  \n",
         "In 2008 they released Live In Europe, a live concert from 1976, recorded in Sweden.[6]\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "Members": {},
   "References": {},
   "Sections": [
      "1 Background",
      "2 Discography",
      "3 Members",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Liberation Suite (sometimes LibSuite) was a Jesus Music era Christian rock band. They originated in San Marcos, Texas but soon moved to Great Britain, where they found their greatest success.[1] Cross Rhythms characterizes the band as having a \"special relationship\" with the United kingdom and a straightforward approach to music and ministry.[2] Typical of Jesus music, they played songs in a variety of styles including country, new wave, and rock.[3]\n"
      ]
   },
   "Title": "Liberation Suite - Wikipedia"
}