{
   "Break up": {
      "text": [
         "Failure to obtain a recording contract put pressure on individual members to find more profitable enterprises, and the group played its final concert in Davis, California on Friday, January 14, 1972.\n"
      ]
   },
   "External links": {},
   "Notable members": {
      "text": [
         "Members included later solo recording artist and film composer Mark Isham on trumpet and soprano saxophone, and Barry Finnerty on electric guitar and some lead vocals, who was later a performing/recording artist with Miles Davis, the Crusaders and the Brecker Brothers among many others. Finnerty, as the group's arranger, also wrote horn charts for the band.[4]\n"
      ]
   },
   "Other members": {
      "text": [
         "Other members included the late John Whitelaw (died 2006) on electric bass and some lead vocals, the late Irwin Goldfeld (aka Eric Gold, died circa 1991) on tenor saxophone, the late Ned Appleby (died 2000) on trumpet, Jim Checkley on electric guitar, Kirk Willat on Hammond Organ and some lead vocals, the late James (Jim) Preston (died 2014) [6]on drums and some lead vocals (like Isham, a later member of the Sons of Champlin, Preston also performed with Moby Grape and other groups), Bruce Saxton on tenor saxophone, L.B. 'Kyle' Keilman on harmonica (whose guest appearance on a later Sons of Champlin album was called \"great harmonica\" in Rolling Stone #200; he also recorded on several tracks on CD's by Ed Mann), Phil Wood on flugelhorn (yet another of the Beefy Red alumni who performed and recorded with The Sons Of Champlin), and Jim Carraway on percussion.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Notable members",
      "2 Other members",
      "3 Break up",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Beefy Red was an American, San Francisco Bay Area music band (1969–1972) based in Marin County, California, United States, which played at various Bay Area venues, including Bill Graham's Fillmore West from October 22–25 in 1970.[1] Beefy Red performed frequently at San Anselmo's 'The Lion's Share', a club often cited as one of the most historic in the history of the Marin County music scene.[2][3] The group was most noted for playing \"swinging R&B\" [4] but played other syles like blues and jazz.\n",
         "In 2008 Beefy Red was included by Paul Liberatore, of the Marin Independent Journal, on a list of potential nominees for a proposed 'Marin Music Museum'.[5]\n"
      ]
   },
   "Title": "Beefy Red - Wikipedia"
}