{
   "Discography": {},
   "External links": {},
   "Members": {
      "text": [
         "2000–2012\n",
         "Band Members\n"
      ]
   },
   "Musical career": {
      "History": {
         "text": [
            "In 2000, Luna Halo was fronted by former Reality Check front man Nathan Barlowe and released their debut CD Shimmer on Christian music label Sparrow Records. Even though Shimmer was praised by critics and they booked many church gigs, Luna Halo left Sparrow Records and the Christian music industry before recording their next album due to creative differences. Macintosh was a worship leader at his father's megachurch Horizon Christian Fellowship in San Diego, California.\n",
            "The final version of Luna Halo contained different members from earlier versions, and although several of the band members claim to be Christians, they say they left the \"Christian band\" moniker behind.\n",
            "Within two years, the band lineup had changed leaving Barlowe the only member remaining from the original band. Barlowe replaced guitarist MacIntosh with his younger brother Cary Barlowe, Aaron Jenkins replaced bassist Brad Minor, and drummer Chris Coleman replaced Jonathan Smith, completing the lineup for the new Luna Halo.\n",
            "Rumors of an imminent major label deal began to surface in 2004, and a deal with DreamWorks,[2] was announced prematurely, but later proved to be untrue (the band had not officially signed.) The band released another EP, Wasting Away (originally recorded as a demo for DreamWorks) and opened a few shows for artists Velvet Revolver, Hoobastank, Collective Soul, Ours, Needtobreathe and Family Force 5.\n",
            "In 2005, Luna Halo were signed to American Recordings and began work on their second album, Luna Halo. Originally scheduled for a Summer 2006 release, the album was plagued with delays. This was due to American Recordings owner Rick Rubin's departure from Warner Bros to Columbia Records. The album was finally released in late 2007.\n",
            "On June 18, 2008, the band released a statement stating that drummer Chris Coleman was leaving the band to take a break from music and go back to school. In November, Jonathan Smith (the original Luna Halo drummer) rejoined the band.\n",
            "In May 2008, the band shot a music video for the song \"World On Fire\", directed by Chris Grieder alongside Flying Dog Films.\n",
            "On November 24, 2008, the band released a statement via MySpace stating that Aaron Jenkins would be leaving the band, because he was expecting the birth of his second child. On December 16, the band announced Victor Broden as their new bass player.\n",
            "On November 13, 2012, lead singer Nathan Barlowe announced that Luna Halo would be playing their final show on December 8, 2012 at 12th and Porter in Nashville, TN. This show would mark not only the band's final show, but also their twelve-year anniversary celebration.[3]\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 Musical career",
      "1.1 History",
      "2 Members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Luna Halo was a rock band formed in 1999 by Nathan Barlowe and Jonny MacIntosh, as a replacement for their former band, Reality Check, which was known for its hip-hop and rock blend, its dancers, and its trumpet player.\n"
      ]
   },
   "Title": "Luna Halo - Wikipedia"
}