{
   "Name": "Mad at the World",
   "Sections": [
      "1 History",
      "2 Post-breakup",
      "3 Controversy Over \"Isn't Sex a Wonderful Thing?\"",
      "4 Touring",
      "5 Videos",
      "6 Legacy",
      "7 Reunion",
      "8 Discography",
      "9 Band members",
      "10 References",
      "11 External links"
   ],
   "Summary": {
      "text": [
         "Mad at the World is a Christian rock band from Southern California. The band originally consisted of brothers Roger Rose and Randy Rose and their friend Mike Pendleton, later joined by Brent Gordon. Pendleton and Gordon left the band in 1992 and were replaced by Mike Link and Ben Jacobs. The band produced seven studio albums, one compilation package and two double reissues of previous albums.\n"
      ]
   },
   "History": {
      "text": [
         "Roger Rose was a mail carrier in southern California when he formed the band in 1987. The job gave him a chance to work out songs in his head, writing ideas down when he got back to his Jeep.[1] He also already owned a lot of synthesizers, drum machines and recording equipment.[2] One day while on his route, he stuck a tape in a Frontline Records executive's mailbox.\n",
         "When asked to explain the name of the band, Roger cites 1 John 2:16, \"love not the world, neither the things of the world.\"[1]\n",
         "In 1987 the band, consisting of Roger Rose, his brother Randy (who was only fifteen years old at the time)[3][4] and their friend Mike Pendleton, released Mad at the World. The disc was unique in christian music for featuring a synthpop style of dance music[5] heavily influenced by bands like Tears for Fears and especially Depeche Mode.[4] This was at a time when the Christian music scene was dominated by Amy Grant and Stryper was breaking out.[4] Roger's personal taste ran towards the sounds of Ultravox and Depeche Mode, a sound that no Christian band was playing at that time, prompting him to create the band and write the music. He attempted to \"avoid church talk and cliche, (resulting) in some fresh, invigorating images.\"[1]\nAlthough not the best-selling album by the band,[6] it is fondly remembered by many fans.[7]\n",
         "Although Roger has stated that Mad at the World was the band's first and last disc not recorded entirely at Roger's home studio,[5] the drum tracks for Through the Forest and The Ferris Wheel were both recorded at Randy's studio, Rose Studios.\n",
         "Released in 1988, Flowers in the Rain, their second disc, was still \"techno-rock\" but \"the guitars are much more aggressive and the songs provide more variation\".[8] It was their first to chart and the second-highest charting album they produced.[9] The songs dealt with issues like self-image (\"Fearfully and Wonderfully\"), putting trust in God instead of other people or Satan (\"Holding the Puppet Strings\"), and people's use of excuses to hold on to bad habits (\"This Lie\").[8]\n",
         "One of the things that stood out for many people about the first two albums was Roger's faux British accent.[5]\n",
         "Because the synthpop sound of the first two albums was difficult to emulate live[5] the band decided to change direction. Beginning with their third disc, Seasons of Love, and in order to have a sound more amiable for live performances,[10] the band's musical style shifted to hard rock for the next three albums. Seasons of Love, released in 1990 and the first disc to feature Brent Gordon on guitar, was the band's highest charting album, reaching number 18 on the Billboard Top Contemporary Christian chart.[9] The band's switch to hard rock was jarring for some people.[11] It features some very aggressive and energetic songs, including \"Promised Land\" and \"So Insane\", both of which deal with drug abuse. The album in general had the band being compared to The Cult, Danzig and The Cure.[11]\n",
         "In 1991 the band released Boomerang which included what has been called \"the most controversial MATW song of all time,\"[12] \"Isn't Sex a Wonderful Thing?\" (see below) The disc continued the trend of a heavier sound, with \"If You Listen\" rendering an atmosphere that can \"make one envision a mysterious haunted mansion complete with a graveyard.\" The song \"Sunday\" drew comparisons to Alice In Chains and \"Don't Give Up\" \"generates a sort of race car feel similar to songs by Stone Temple Pilots.\" Lyrically it focuses on sin, redemption, and God's love for people.[13]\n",
         "Through the Forest was released in 1992, the band's fifth studio album and the last to feature founding member Mike Pendleton and guitarist Brent Gordon. The two would leave the band following this disc. Why Pendleton and Gordon left is unclear, Gordon makes little reference to the band on his blog and no mention of why he joined or left. In an interview, Roger said, \"they didn't really quit the band--they kinda quit and got fired all at the same time.\"[1] Roger thanked them in the liner notes for the next disc.\n",
         "1993 saw the release of The Ferris Wheel. This was the first disc to feature Ben Jacobs on guitar and Mike Link on bass. They joined that year to replace Mike Pendleton and Brent Gordon. The two were in Randy's solo band, Rose, and while Roger was trying to decide whether to pursue a solo career or find new band members, they were suggested by Randy as good replacements.[14]\nThe band's style changed radically on this disc, going from the hard rock of the previous three discs to a more retro, power pop, Beatles-esque sound.[5]\n",
         "In the liner notes for the disc, Roger writes; \"Extra Special Thanks To: Brent Gordon and Mike Pendleton for your friendship, years of hard work and musical contribution to M.A.T.W. with such little reward.\"\n",
         "The Dreamland Café was released in 1995, the band's final studio album. It continued the trend of softer, Beatleseque powerpop-oriented rock.[1] This is also the only disc where Roger plays drums. In an interview, Roger said that there were songs where he did everything, and it was the result of a small budget and having a hard time getting everybody together. Thematically, he said the album could be interpreted \"as a metaphor for the Church, or...Christianity or Christ...it's a little metaphor for...the optimistic, hopeful side of Christianity.\"[1]\n",
         "The Dreamland Café was also the final album for Frontline Records.\n"
      ]
   },
   "Post-breakup": {
      "text": [
         "In 1998, KMG Records released World History, a collection of songs from the first six albums, but not The Dreamland Café. It \"downplayed the heavy guitars\" and \"brought to the forefront the picturesque vocal flair of Roger Rose.\"[15] In the liner notes it states: \"The unifying thread is the Rose brothers' great writing, vocals, arrangements and spiritual challenges to take control of your life by following God's plan.\"[16] Writing for Phantom Tollbooth, Sam Hagadorn listed it as one of his ten best albums of 1998.[17]\n",
         "KMG also reissued Seasons of Love and Mad at the World as a single disc in 1998. In 1999 the same company reissued Flowers in the Rain and Boomerang as a single disc.\n",
         "Roger Rose became a worship leader, singing and writing songs for his church. He and his wife Julia also adopted two girls.[5]\n",
         "Randy Rose has concentrated on solo work. It is unlikely for there to be a reunion, although Roger has expressed that it \"might be fun.\"[5]\n",
         "Neither the band collectively nor Roger Rose himself owns the catalogue of the band's music. This makes it unlikely for there to be any more re-issues, even on iTunes.[5]\n"
      ]
   },
   "Controversy Over \"Isn't Sex a Wonderful Thing?\"": {
      "text": [
         "The 1991 disc Boomerang included what has been called \"the most controversial MATW song of all time,\"[12] and one with which they \"courted their share of controversy,\"[18] \"Isn't Sex a Wonderful Thing?\" The band debuted the song at Cornerstone '89 and had planned to include the song on Seasons of Love but, according to Roger Rose, \"(t)the record company thought it was too controversial, they thought the only thing anyone would remember is the hook line which says 'isn't sex a wonderful thing?' People might assume I was promoting promiscuity, and not get the point.\" The song, which deals with incest in one stanza, \"is a statement,\" according to Rose, \"but it's actually more of a question. I have known a Christian who had been sexually molested when she was younger and I had heard how this created all these emotional scars in her.\" He went on to say, \"In the song I talk about the bad side of sex as it's been misused in our world, and in the last verse I go back to the idea that it's given by God...sex is a wonderful thing if it follows God's rules -- which is purity before marriage, fidelity after marriage -- where sex gets God's blessing.\"[19] Nonetheless, because of that song, some of the band's albums were not sold at some Christian bookstores.[20] This includes one in the town where the Rose Brothers' parents were living.[1]\n"
      ]
   },
   "Touring": {
      "text": [
         "Mad at the World was not known as a touring band and it affected their sales. In an interview after the release of The Dreamland Café Roger commented on this. The band were not willing to quit their day jobs and tour extensively because the Christian music market was and remains a small piece of the overall music market and rarely intersects with secular music. One time the band did tour several states for approximately a month and found it encouraging, but because it burned up vacation time it was not repeated. Other than that, the band played sporadically, even in their home-base of southern California.[1]\n"
      ]
   },
   "Videos": {
      "text": [
         "The band produced only one concept video, for the song \"Eyes of Heaven\" from The Ferris Wheel. There are also two concert-footage videos, for \"No More Innocence\" and \"Marshmallow Land\", both shot in 1995.\n"
      ]
   },
   "Legacy": {
      "text": [
         "Mad at the World was never a huge selling band. Their biggest selling disc only reached 18 on Billboard's Top Contemporary Christian chart.[9] They were never the focus of intensive marketing or promotion and did no national tours. For an interview with Roger after release of The Dreamland Cafe, the interviewer could only get a one-page biography from Frontline Records.[1] And because the band had three distinctive musical phases, the fanbase can be splintered, with groups concentrating on the sound of one or two albums (Firestream Music Vault has a page devoted to the band, but it concentrates on the middle three albums.)[21] There are also no online reviews available, either professional or by fans, of their last three studio discs.\n",
         "The guestbook on their website, however, continues to be signed by people claiming to have just discovered them, and their respective MySpace pages, although a notoriously unreliable source, draw fans from people claiming to still love their music. Anecdotal evidence claims that their music is played on the radio (albeit internet radio.)[22] Roger has stated that he has \"countless letters\" from fans claiming that his songs \"defined what they felt.\"[5] And the two double-reissue discs in the late 1990s suggest that an audience willing to buy their music still exists. They were also admired for creating quality albums on a very low budget,[1] and have been cited for singing about subjects not generally talked about in Christian music.[18] Roger has stated that \"if a person was to look at the majority of the whole Mad at the World musical career...it's probably more optimism through sort of the darker-side-of-life issues.\"[1]\n"
      ]
   },
   "Reunion": {
      "text": [
         "Roger and Randy Rose reunited in 2017 to record a new Mad at the World album after 22 years, funded by a successful Kickstarter campaign.[23] Two songs on the album were co-written with Mad at the World fans who pledged $2,500 each, helping the campaign meet its goal. The 2017 album is mostly electronic/analog. The band said in their Kickstarter video that they plan to do more Mad at the World albums, echoing the various styles of some of their original albums.[citation needed]\n"
      ]
   },
   "Discography": {
      "text": [
         "Mad at the World\n",
         "Flowers in the Rain\n",
         "Seasons of Love\n",
         "Boomerang\n",
         "Through the Forest\n",
         "The Ferris Wheel\n",
         "The Dreamland Café\n",
         "World History\n",
         "Seasons of Love/Mad at the World review (a 2-for-1 re-release)\n",
         "Flowers in the Rain/Boomerang (a 2-for-1 re-release)\n",
         "Hope\n"
      ]
   },
   "Band members": {
      "text": [
         "Frontman Roger Rose, was a mail carrier in southern California, although his MySpace page currently lists him as living in Dallas/Ft. Worth, TX. He started MATW as a synthpop band due to the absence of this type of music in the Christian market (he has cited Depeche Mode as an influence). Because of difficulties in playing this music live, Roger then turned the band toward a more hard rock type of music. Finally, he settled on an alternative rock style of music for the last two studio releases.\nRoger married Julia in 1992.[1]\n",
         "Roger Rose was the main lyricist of the group. He did the vocals and guitars throughout most of the songs. He was also the primary songwriter. In an interview, he stated, \"I think in most of my songs when I talk about things I'm always careful to point out the hope, or the answer, or the possibilities through some of (the) issues (of life).\"[1] Musically, Roger stated in a 2009 interview that his primary influence is \"simple English pop rock.\"[5]\n",
         "Randy Rose was a member of MATW during its entire existence as a band from 1987-1998. When MATW was a synthpop band during its first two years, Randy played percussion, worked on the drum programming, and sang backup vocals. Randy continued with drums and vocals as the band transitioned to a hard rock band in early 1990. He also formed his own metal band soon after, named Rose. After his tenure in MATW, Randy went on to make various demos under different names until forming his current band Mothership in 1998.\n",
         "Mike Pendleton played the guitar, keyboards, and percussion on the first two albums, Mad at the World and Flowers in the Rain. He then switched over to bass guitar for the third through fifth albums, Seasons of Love, Boomerang, and Through the Forest.\n",
         "Brent Gordon climbed on board for the third album in 1990, and he played lead and rhythm guitars up through the band's fifth album. He co-wrote the song \"Draggin' the Chains\" on the Boomerang album. He also provided artwork for various albums.[5]\n",
         "As of 2007 Brent was playing guitar for a worship band at a church in California. He also works in the field of animation for Disney. His artwork can be viewed at his website.[1] He also has a blog that has many photos, including a couple with MATW.[24]\n",
         "Brent Gordan left MATW in 1992, Ben Jacobs took over as lead guitarist for the band. He was in Randy's other band, Rose at the time and was suggested by Randy.[1] He performed on the albums The Ferris Wheel and The Dreamland Cafe. He also was for a brief time a member of ROSE for the albums 'Healing', 'Intense Live Series Volume 3', 'Crazy Little World' and 'Into The Unknown'. After the disbandment of MATW and ROSE, Jacobs went on and formed the band The Jolly Lamas.[25][26] Benjamin Jacobs and The Jolly Lamas music has had numerous independent cuts played on regular rotation on Radio Stations across America and Canada as well and local and regional attention in their homebase in Southern California. The Jolly Lamas are currently writing and recording for their third album. They occasionally perform at various venues throughout Southern California. The Jolly Lamas songs have appeared on The Conan O'Brien Show, the independent film The Others and an Episode of Dog the Bounty Hunter and have been nominated several times at the San Diego Music Awards. In 2007 Benjamin Jacobs teamed up with Tim Bedley a teacher and drummer and started the successful educational rock band titled Rockin' the Standards[27] Their first offering titled Math has hit number 1 on Amazon.com and Digstation under MP3 Albums - Children Category. Their Language Arts album is due out in early 2009.\n",
         "Mike Link replaced Mike Pendleton as bassist in 1992. Like Ben Jacobs, he was in Randy's other band, Rose, at the time and was suggested by Randy.[1] He performed on the albums The Ferris Wheel, The Dreamland Cafe and World History. He also was a member of Rose for the albums Healing, Intense Live Series Volume 3, Crazy Little World and Into The Unknown and played bass on Randy's Mood Ring project. After the disbandment of MATW and Rose, Link moved to Idaho and recruited to play bass for metal band, Paylface. He has also recorded/toured with other notable artists Factory Air, Oscar Ortega, Casey Corum, The Wannabes and Abel's Cry.\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Mad at the World is a Christian rock band from Southern California. The band originally consisted of brothers Roger Rose and Randy Rose and their friend Mike Pendleton, later joined by Brent Gordon. Pendleton and Gordon left the band in 1992 and were replaced by Mike Link and Ben Jacobs. The band produced seven studio albums, one compilation package and two double reissues of previous albums.\n",
      "Roger Rose was a mail carrier in southern California when he formed the band in 1987. The job gave him a chance to work out songs in his head, writing ideas down when he got back to his Jeep.[1] He also already owned a lot of synthesizers, drum machines and recording equipment.[2] One day while on his route, he stuck a tape in a Frontline Records executive's mailbox.\n",
      "When asked to explain the name of the band, Roger cites 1 John 2:16, \"love not the world, neither the things of the world.\"[1]\n",
      "In 1987 the band, consisting of Roger Rose, his brother Randy (who was only fifteen years old at the time)[3][4] and their friend Mike Pendleton, released Mad at the World. The disc was unique in christian music for featuring a synthpop style of dance music[5] heavily influenced by bands like Tears for Fears and especially Depeche Mode.[4] This was at a time when the Christian music scene was dominated by Amy Grant and Stryper was breaking out.[4] Roger's personal taste ran towards the sounds of Ultravox and Depeche Mode, a sound that no Christian band was playing at that time, prompting him to create the band and write the music. He attempted to \"avoid church talk and cliche, (resulting) in some fresh, invigorating images.\"[1]\nAlthough not the best-selling album by the band,[6] it is fondly remembered by many fans.[7]\n"
   ]
}