{
   "Background": {
      "text": [
         "Led by the duo Jerome Fontamillas and Jyro Xhan, Mortal was one of the first Christian bands to play industrial metal.[4] While not actually the first to do so, Mortal enjoyed significant success, and, along with other early contemporaries such as Circle of Dust and Argyle Park, played a notable role in paving the way for future Christian industrial and industrial metal bands.\n",
         "The group began in 1988 as Mortal Wish, and  produced a six-song demo with additional members Ray Tongpo and Wilson Peralta.[5] They shortened their name, signed a record deal with Intense Records and released their first album Lusis in 1992, produced by Terry Scott Taylor[5] and Allan Aguirre of Scaterd Few.[citation needed] It was well received by the critics, with CCM Magazine dubbing Lusis the \"strongest debut project to enter the Christian market in years.\"[6] The second album Fathom (1993) was Mortal's most guitar-driven, and became one of the band's most popular releases.[7] The song ”Rift” was rearranged later and a music video was shot for it in 1994. The video dealt with the horrors of child abuse.\n",
         "Mortal later experimented with a live band,[3] and a grunge sound on 1994's Wake,[8]  as well as with a dance-based meditational sound on their follow-up, Pura.[9]\n",
         "During this time, the band became mired in legal issues involving their label, leading to on-again, off-again attempts to retire the name Mortal. As Jyro would report to True Tunes News in 1994: \"I have peace with the fact that Mortal will permanently quit... There are legal things happening with our label that will end Mortal as a name.\"[10] The duo formed Fold Zandura partly to get around these issues, partly to carve out a more alternative rock sound. Fold Zandura released one album and three EPs.\n",
         "The Mortal moniker was revived in order to release  a self-titled album on 5 Minute Walk Records in 1996. According to the liner notes, three songs were originally Fold Zandura songs. In 1998 they released a best of called Godspeed. It featured 13 album songs and 2 non-album songs.\n",
         "In 2000 Jerome joined Switchfoot as a session musician and later joined them full-time.\n",
         "In 2002 Jyro and Jerome released a Mortal reunion album called Nu-En-Jin with Tooth & Nail Records, featuring an updated industrial sound, consisting mostly of heavily distorted looping electronics. Lyrically, the songs have a very sci-fi flare, with the liner notes detailing the various fictional alternative universes in which they are supposedly set.\n"
      ]
   },
   "Charts": {},
   "Discography": {},
   "External links": {},
   "Members": {
      "text": [
         "Last Known Lineup\n",
         "Former\n",
         "Live and session\n"
      ]
   },
   "References": {
      "Further reading": {}
   },
   "Sections": [
      "1 Background",
      "2 Members",
      "3 Discography",
      "4 Charts",
      "5 References",
      "5.1 Further reading",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Mortal was a Christian industrial/dance band fronted by Jerome Fontamillas and Jyro Xhan. Both members went on to found the alternative rock group Fold Zandura, and for a time were members of both bands simultaneously. The band is known for its lyrical intelligence, incorporating advanced theology with what has been billed as \"Industrial Praise and Worship.\"[2] According to CCM Magazine \"Mortal has had a much greater influence... on industrial music than its modest output would suggest.\"[3]\n"
      ]
   },
   "Title": "Mortal (band) - Wikipedia"
}