{
   "Name": "Beulah (band)",
   "rawData": [
      "Beulah was an American indie rock band from San Francisco, California, often associated with The Elephant 6 Recording Company.\n",
      "The band was formed by Miles Kurosky and Bill Swan in San Francisco in 1996, while the pair were both working in the same office. The pair discovered that they shared similar musical tastes and, disregarding some mutual dislike, decided to form a band. This early incarnation of Beulah recorded a song every 6 weeks for 16 months, on their 4-track recorder. The band received attention from The Apples in Stereo frontman and Elephant 6 member Robert Schneider, who expressed interest on releasing what was to be their first single, A Small Cattle Drive in a Snow Storm, on Elephant 6 records. Their first album, Handsome Western States, was released in the same year, also on Elephant 6 and mastered by Schneider. The record soon sold out. This association with the collective has continued throughout their career, despite the fact that they did not release anything more on the label - they are listed as being part of the close family of Elephant 6 bands, on the official Elephant 6 website, and they have toured with other collective members, such as Dressy Bessy, Ladybug Transistor, The Olivia Tremor Control and of Montreal. In order to tour in support of the album, Steve La Follette, Steve St. Cin, and Pat Noel joined the band, with the band playing their first shows in support of the Apples.\n",
      "Their second album, When Your Heartstrings Break, followed two years later to critical acclaim. The sound of the band had shifted — as Kurosky put it, the band's production values had shifted \"from lo-fi to mid-fi\", and it incorporated a very wide range of instruments, utilising eighteen additional musicians — strings and horns were heavily incorporated, along with more exotic instrumentation, the instruments totalling a number of several dozen. Also, at this time, the band added keyboardist Bill Evans to their line-up. Shifty Disco Records, an Oxford, UK based label, also released two UK-only singles in 1999, namely Sunday Under Glass and Score From Augusta, with Emma Blowgun's Last Stand released the following year. These singles featured b-sides culled from Handsome Western States, which remained unreleased in the UK, and had fallen out of print in the U.S., until 2000 further copies were made available by the band in 1999, with different artwork. Emma Blowgun's Last Stand was also released in Australia by Elastic Records, this time with two exclusive bonus tracks.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Indie rock"
      ],
      "Years active": [
         "1996–2004"
      ],
      "Labels": [
         "Elephant Six, Velocette, Sugar Free"
      ],
      "Past members": [
         "Miles Kurosky",
         "Bill Swan",
         "Pat Noel",
         "Danny Sullivan",
         "Eli Crews",
         "Pat Abernathy",
         "Steve La Follette",
         " Steve St. Cin",
         " Bill Evans"
      ]
   },
   "albums": [
      "Handsome Western States",
      "When Your Heartstrings Break",
      "The Coast Is Never Clear",
      "Yoko"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from San Francisco, California, often associated with The Elephant 6 Recording Company.\n",
      "The band was formed by Miles Kurosky and [PERSON_NAME_FULL_0_MALE] in San Francisco in [YEAR], while the pair were both working in the same office. The pair discovered that they shared similar musical tastes and, disregarding some mutual dislike, decided to form a band. This early incarnation of [BAND_NAME] recorded a song every 6 weeks for 16 months, on their 4-track recorder. The band received attention from The Apples in [PERSON_NAME_LAST_1]reo frontman and Elephant 6 member Robert Schneider, who expressed interest on releasing what was to be their first single, A Small Cattle Drive in a Snow [PERSON_NAME_LAST_1]rm, on Elephant 6 records. Their first album, Handsome Western [PERSON_NAME_LAST_1]tes, was released in the same year, also on Elephant 6 and mastered by Schneider. The record soon sold out. This association with the collective has continued throughout their career, despite the fact that they did not release anything more on the label - they are listed as being part of the close family of Elephant 6 bands, on the official Elephant 6 website, and they have toured with other collective members, such as Dressy Bessy, Ladybug Transistor, The Olivia Tremor Control and of Montreal. In order to tour in support of the album, [PERSON_NAME_FIRST_1] La Follette, [PERSON_NAME_FULL_1_MALE], and Pat Noel joined the band, with the band playing their first shows in support of the Apples.\n",
      "Their second album, When Your Heartstrings Break, followed two years later to critical acclaim. The sound of the band had shifted — as Kurosky put it, the band's production values had shifted [SONG_NAME], and it incorporated a [GENRE] a number of several dozen. Also, at this time, the band added keyboardist Bill Evans to their line-up. Shifty Disco Records, an Oxford, UK based label, also released two UK-only singles in [YEAR], namely Sunday Under Glass and Score From [MONTH]a, with [PERSON_NAME_FULL_0_FEMALE]'s Last Stand released the following year. These singles featured b-sides culled from Handsome Western States, which remained unreleased in the UK, and had fallen out of print in the U.S., until [YEAR] further copies were made available by the band in [YEAR], with different artwork. [PERSON_NAME_FULL_0_FEMALE]'s Last Stand was also released in Australia by Elastic Records, this time with two exclusive bonus tracks.\n"
   ]
}