{
   "Name": "Plankeye",
   "rawData": [
      "Plankeye was a Christian alternative rock band and one of Tooth & Nail Records' greatest successes during the 1990s and early 2000s.  Plankeye's style could be defined as melodic post-grunge combined with indie and alternative elements. Their first few albums also incorporated a fair amount of punk rock elements, but this aspect faded when original singer Scott Silletta left the band.\n",
      "In 1994, Plankeye released Spill, their first album, which was able to garner enough sales to catch the interest of Tooth and Nail Records.  Spill was re-released on Tooth and Nail, as Plankeye went into the studio again to record a slightly less aggressive album, The Spark.  In 1996, Plankeye released Commonwealth, which introduced a more polished and mature sound.  Over the course of the next year, the group toured constantly, opening for the Newsboys. In November 1997, the group released their best selling album, The One & Only.  To promote this album, Plankeye headlined \"The One & Only Tour\", featuring opening act, the Insyderz.  One year later, lead singer Scott Silletta and drummer Adam Ferry left Plankeye. Adam Ferry left to become a youth pastor and Scott Silletta left to form the short-lived pop-punk band Fanmail. Silletta later formed a record label called \"Vanishing Point Records\" with a lineup including his new band \"The Franchise\".  He also created his own recording studio called Orange Crush Studio located in Orange, California.  \n",
      "In 1999, Balmer and Garcia released Relocation on a new record label, BEC Recordings.  This album featured Plankeye's heartfelt single, \"Goodbye\".  Some wondered if this song was subtly referencing Scott and Adam's departure from the band, something which Eric and Luis refuted.  \n"
   ],
   "infobox": {
      "Genres": [
         "Christian rock, alternative rock, punk rock"
      ],
      "Years active": [
         "1994 (1994)–2002 (2002)"
      ],
      "Labels": [
         "Tooth & Nail, BEC"
      ]
   },
   "albums": [
      "Spill",
      "Spill",
      "The Spark",
      "Commonwealth",
      "The One and Only",
      "Relocation",
      "HM Magazine",
      "Strange Exchange",
      "Wings to Fly"
   ]
}