{
   "Awards and recognition": {
      "text": [
         "National Billboard Mainstream Rock Chart National Airplay Chart\n",
         "Christian Festival Association National Talent Competition\n",
         "KBPI Best Band in Denver Competition\n",
         "United States Air Force's Guardian Challenge\n",
         "National BDS Christian Rock Radio Charts National Airplay Chart'\n"
      ]
   },
   "Band members": {
      "text": [
         "Current\n",
         "\nFormer\n"
      ]
   },
   "Discography": {
      "text": [
         "This is a list of major releases only. Additional releases including live albums, singles, compilation albums and videos may be found at the full discography article.\n"
      ]
   },
   "External links": {},
   "History": {
      "text": [
         "Random Hero started in 2005. With original members Joshua Bertrand, Derek Arosemena, Robert Higdon (Drums), Nick Pearson (Keyboards) and Kat Barnes (Vocalist).  In the early years, the band was gaining a lot of recognition, being compared to Evanescence due to Kat Barnes' haunting vocals, alongside Nick Pearson and Josh Bertrand's orchestral- based powerhouse writing.\n",
         "In April 2006, now lead vocalist, Aaron Watkins, replaced Kat Barnes.\n",
         "In August 2007, Random Hero entered the KBPI Best Band in Denver competition. KBPI is owned by Clear Channel, and is the fourth largest rock radio station in the United States.  Hundreds of bands entered the contest. Random Hero finished the contest in the top three.\n",
         "In March 2008, drummer Rob Higdon left the band and the remaining members auditioned Josh Tarrant who joined the band. \n",
         "For the remainder of 2008, the band continued to play to large and growing crowds, not only headlining shows, but playing in direct support of national & International bands.\n",
         "In January 2009, Random Hero was approached by MTV as potential coaches for the MTV reality show \"Made\".  Random Hero, and more specifically Joshua Bertrand, was chosen to film an episode of Made with a 9th grade student from Estes Park, Colorado.[1] The completed Made episode aired more than fifty times in the US and an equal number over seas.\n",
         "For the remainder of 2009, Random Hero played a heavy schedule of shows and toured to AgapeFest, and Cornerstone in Illinois.  The band also performed a spot on the Van's Warped Tour. The band following continued to grow rapidly, and they were asked to play at the Six Flags Elitch's \"Faith Day\" with Relient K.\n",
         "Random Hero's drummer Josh Tarrant is an active member of the United States Air Force.  An opportunity was given to the band to write a song for the US Air Force's Guardian Challenge.  Bertrand and Watkins wrote the song \"Guardians of Freedom\" with Josh Tarrant acting as producer.  The song was chosen as the theme song for the Buckley Air Force Base entry into the Guardian Challenge.[2] What followed was a number of performances for thousands of US Air Force members, including some of the nations top Air Force Generals, officers, and the Assistant Undersecretary of the Air Force.\n",
         "In December 2009, Random Hero became one of the first bands in the United States to release an iPhone app.[3]\n",
         "In 2010, Random Hero released the Black EP, and the White EP to rave reviews.  The band traveled to Illinois to play an AgapeFest kickoff show.  Two months later, Random Hero made their main stage debut in just their second year at AgapeFest.  Random Hero was overwhelmed by fans after their performance, and immediately invited back to AgapeFest in 2011.\n",
         "During the remainder of the summer, Random Hero played Cornerstone.  For the first time, the band performed at Hills Alive Festival in Rapid City, SD. In addition, the band was invited to perform at Colorado's largest Christian music festival Heaven Fest, and for the second time in as many years, the Elitch Gardens Theme Park's \"Faith Day\"…This time with Skillet.\n",
         "At the conclusion of Random Hero's set, both John Cooper and Ben Kasica of Skillet approached the band to inquire whether or not the band was signed to a label.  Over the following months, Random Hero signed an exclusive production contract with Kasica. \"It is a great honor that Ben has chosen to work with Random Hero,\" said front man Aaron Watkins.  Watkins went on to say, \"not only is Ben highly respected for his producing talents, but all the members of Random Hero are huge fans of Skillet.\"[citation needed]  Pre-production on a number of songs started in September 2010.  On November 1, 2010, the band began recording the new songs at Kasiaca's, Skies Fall Studios, in Kenosha, Wisconsin.\n",
         "In January 2011, Random Hero brought on a second guitarist, Alex Salinas in early February 2011, Salinas left the band not long after.\n",
         "The \"Breakdown EP\" was released in May 2011, by Skies Fall Records. Also in May, Random Hero performed, once again on the main stage at AgapeFest. Ben Kasica joined the band on stage to perform the song 'Freakshow\".\n",
         "In June 2011, Random Hero signed a co-publishing contract with Ben Kasica and Joe Snyder's Skies Fall Media Group. Random Hero was also signed with SESAC for performing rights.\n",
         "In July 2011, Random Hero once again finished in the top three in the KBPI Best Band in Denver competition.  Program Director Willie B had this to say about the band \"The whole EP is great, but the song Breakdown is absolutely amazing, and in my opinion is a huge hit.  It could easily be playing on the radio in regular rotation right now.  Bottom line, this band is fantastic, and if people would just listen to the song, they would get immediately hooked on the band.\"[citation needed]\n",
         "In early 2012, Random Hero's drummer Josh Tarrant was accepted into the US Air Force's exclusive entertainment troupe \"Tops in Blue\". With Tarrant's forthcoming one-year absence, the band began to search for a new drummer. During their search, Andrew Whiteman (Red Tide Rising) filled in for live shows already scheduled. After a lengthy search, the band chose Jon Cornella as the new drummer.  Jon was found playing in the worship band at a local mega church called Southeast Christian Church.\n",
         "Shortly after Tarrant's departure, long time bass player Derek Arosemena felt he was being called in a different direction that would render him unable to tour for any length of time.  He was replaced within a few days by Rob \"Los\" McDonough. Though new to Random Hero as a musician, McDonough has been part of the Random Hero family from the beginning of Aaron Watkins joining the band.  He is not only the graphic design artist behind all of the band's images and logos, he is also Aaron's brother in law. McDonough fit seamlessly into the band and made his festival debut at the 2012 Agapefest.\n",
         "In 2013, Random Hero signed to Redcord Records/Sony Music and released Oceans Of Change, that went on to have multiple Top 5 Billboard Hits such as \"Not Alone\" and \"Burn Up The Night\". During that time the band found their present drummer, Patrick Madsen. The band toured heavily on the Oceans Of Change record and went into the studio in 2016 to record their follow up record independently The Covering which also had multiple Top 5 Billboard Christian Rock Chart hits including, \"Mirror Mirror\", \"Running\" and \"Impossible\". Both \"Running\" and \"Impossible charted on the Billboard Mainstream Rock Charts in the top 30. \n",
         "In 2018, the band signed to Rockfest Records/ Capitol / Universal Music Group and released Tension on August 22, 2019. Tension charted on three major Billboard Charts: #13 Billboard Christian Album Sales, #21 Billboard Heatseekers Chart and #26 Billboard New Hard Rock Album sales Chart.[4]\n",
         "In mid 2019, Joshua Bertrand left the band to be more at home with his family, and the band picked up Micah Labrosse who had previously been a contract player for Disciple and Spoken.\n",
         "In September 2019, Random Hero released the music video for Tension, issued via Rockfest Records. \n",
         "On December 2, 2019, Tension was nominated for the 8th Annual We Love Christian Music Awards, \"Amp Award\" (Rock/Alternative Album of the year) along side, Skillet, Disciple, Manafest and Seventh Day Slumber. \n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Band members",
      "3 Discography",
      "4 Awards and recognition",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Random Hero is an American rock band formed in Denver, Colorado, United States. Random Hero is Aaron Watkins (Vocals), And Rob “Los” McDonough (Bass). Earning a #1 Christian Rock single, for eight weeks straight, with Tension, two Top 25 Billboard Mainstream Rock singles, along with six Top 5 Billboard Christian rock singles. The band has worked with Kellen McGregor (Memphis May Fire), Josiah Prince (Disciple), Ben Kasica (Skillet), co-headlined two major European festivals; Loud & Proud & Christmas Rock Night, featured on the \"Today In Nashville Show\",  MTV's “Made,” multiple stops on the Vans Warped Tour and Christian music’s top rock outing, the City Rock Fest Tour. Random Hero continues to be a mainstay on national tours and festivals around the country and internationally.\n",
         "Discography includes The Breakdown EP, Carry Me, Bury Me, Oceans of Change and The Covering. Their latest release Tension (Rockfest Records) is the band’s largest release to date, providing a musical foundation squarely focused on elevating Random Hero’s urgent message of hope and healing.\n"
      ]
   },
   "Title": "Random Hero (band) - Wikipedia"
}