{
   "Name": "Random Hero (band)",
   "rawData": [
      "Random Hero is an American rock band formed in Denver, Colorado, United States. Random Hero is Aaron Watkins (Vocals), And Rob “Los” McDonough (Bass). Earning a #1 Christian Rock single, for eight weeks straight, with Tension, two Top 25 Billboard Mainstream Rock singles, along with six Top 5 Billboard Christian rock singles. The band has worked with Kellen McGregor (Memphis May Fire), Josiah Prince (Disciple), Ben Kasica (Skillet), co-headlined two major European festivals; Loud & Proud & Christmas Rock Night, featured on the \"Today In Nashville Show\",  MTV's “Made,” multiple stops on the Vans Warped Tour and Christian music’s top rock outing, the City Rock Fest Tour. Random Hero continues to be a mainstay on national tours and festivals around the country and internationally.\n",
      "Discography includes The Breakdown EP, Carry Me, Bury Me, Oceans of Change and The Covering. Their latest release Tension (Rockfest Records) is the band’s largest release to date, providing a musical foundation squarely focused on elevating Random Hero’s urgent message of hope and healing.\n",
      "Random Hero started in 2005. With original members Joshua Bertrand, Derek Arosemena, Robert Higdon (Drums), Nick Pearson (Keyboards) and Kat Barnes (Vocalist).  In the early years, the band was gaining a lot of recognition, being compared to Evanescence due to Kat Barnes' haunting vocals, alongside Nick Pearson and Josh Bertrand's orchestral- based powerhouse writing.\n"
   ],
   "infobox": {
      "Origin": [
         "Denver, Colorado, United States"
      ],
      "Genres": [
         "Christian Rock"
      ],
      "Years active": [
         "2005–present"
      ],
      "Members": [
         "Aaron Watkins",
         "Rob \"Los\" McDonough"
      ],
      "Past members": [
         "Kat Barnes",
         "Nick Pearson",
         "Robert Higdon",
         "Derek Arosemena",
         "Joshua Bertrand",
         "Josh Tarrant",
         "Alex Salinas",
         "Jon Cornella",
         "Patrick Madden",
         "Micah Labrosse"
      ]
   }
}