{
   "Name": "Remedy Drive",
   "rawData": [
      "Remedy Drive is an American alternative rock band found in 1998 in Lincoln, Nebraska. They are now based on Nashville, Tennessee.  The band is currently of lead vocalist and guitarist David Zach, bassist Corey Horn, and drummer Timmy Jones (with an extended appearance by Nashville-based drummer Tim Buell, and with occasional appearances by other drummers including Michael Sturd and Zach Hunter). They have recorded ten studio albums (six of them independent), one independent live album, and two EPs. The band was founded as a quartet consisting of the four Zach brothers. Three of the four brothers left the band in late 2010.\n",
      "Remedy Drive were formed as The Aslan Band in 1995 as a three-piece all-brother group, before a fourth brother, Paul, joined in 1998. They released their first album, Remedy, in 1998 under their original name. After changing their name to Remedy, they released four more independent albums: Remedy (The Blue One) (1999), Remedy (The Red One) (2001), Remedy: A Live Album (2003), and Magnify (2004). They changed their name again in 2004, this time to \"Remedy Drive\". They released Rip Open the Skies, which was released on April 25, 2006 and which has sold over 20,000 copies to date. The band toured primarily in the Midwest and West Coast of the United States, playing over 200 concerts per year. \n",
      "In 2008, the band was signed with Word Records and on August 28, 2008, they released Daylight Is Coming which was produced by Ian Eskelin followed by an Expanded Edition and an EP released on March 30, 2010. \n"
   ],
   "infobox": {
      "Also known as": [
         "Remedy"
      ],
      "Origin": [
         "Lincoln, Nebraska, United States"
      ],
      "Genres": [
         "Christian rock, pop rock, indie rock"
      ],
      "Years active": [
         "1995 (1995)–present (present)"
      ],
      "Labels": [
         "Word, Centricity"
      ],
      "Associated acts": [
         "The Silver Pages, Arrows and Sound, A Thousand Fires"
      ],
      "Website": [
         "www.remedydrive.com"
      ],
      "Members": [
         "David Zach",
         "Corey Horn",
         "Zach Hunter"
      ],
      "Past members": [
         "Daniel Zach",
         "Philip Zach",
         "Paul Zach",
         "Timmy Jones",
         "Dave Mohr",
         "Tim Buell",
         "Michael Sturd"
      ]
   },
   "albums": [
      "Remedy"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band found in [YEAR] in Lincoln, Nebraska. They are now based on Nashville, Tennessee.  The band is currently of lead vocalist and guitarist David [PERSON_NAME_FIRST_0], bassist [PERSON_NAME_FULL_2_MALE], and drummer [PERSON_NAME_FIRST_1]my Jones (with an extended appearance by Nashville-based drummer [PERSON_NAME_FULL_1_MALE], and with occasional appearances by other drummers including Michael Sturd and [PERSON_NAME_FULL_0_MALE]). They have recorded ten studio albums (six of them independent), one independent live album, and two EPs. The band was founded as a quartet consisting of the four [PERSON_NAME_FIRST_0] brothers. Three of the four brothers left the band in late [YEAR].\n",
      "[BAND_NAME] were formed as The Aslan Band in [YEAR] as a [GENRE] a fourth brother, Paul, joined in [YEAR]. They released their first album, Remedy, in [YEAR] under their original name. After changing their name to Remedy, they released four more independent albums: Remedy (The Blue One) ([YEAR]), Remedy (The Red One) ([YEAR]), Remedy: A Live Album ([YEAR]), and Magnify ([YEAR]). They changed their name again in [YEAR], this time to [SONG_NAME]. They released Rip Open the Skies, which was released on [MONTH] 25, [YEAR] and which has sold over 20,000 copies to date. The band toured primarily in the Midwest and West Coast of the United States, playing over 200 concerts per year. \n",
      "In [YEAR], the band was signed with Word Records and on [MONTH] 28, [YEAR], they released Daylight Is Coming which was produced by [PERSON_NAME_FULL_0_MALE] followed by an [GENRE] an EP released on [MONTH] 30, [YEAR]. \n"
   ]
}