{
   "Name": "Remedy Drive",
   "Sections": [
      "1 History",
      "1.1 Daylight is Coming",
      "1.2 Light Makes A Way EP",
      "1.3 Resuscitate",
      "1.4 Commodity",
      "1.5 Hope's Not Giving Up",
      "1.6 The North Star",
      "2 Band members",
      "2.1 Former members",
      "3 Discography",
      "3.1 Albums",
      "3.2 EPs",
      "3.3 Singles",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Remedy Drive is an American alternative rock band found in 1998 in Lincoln, Nebraska. They are now based on Nashville, Tennessee.  The band is currently of lead vocalist and guitarist David Zach, bassist Corey Horn, and drummer Timmy Jones (with an extended appearance by Nashville-based drummer Tim Buell, and with occasional appearances by other drummers including Michael Sturd and Zach Hunter). They have recorded ten studio albums (six of them independent), one independent live album, and two EPs. The band was founded as a quartet consisting of the four Zach brothers. Three of the four brothers left the band in late 2010.\n"
      ]
   },
   "History": {
      "Daylight is Coming": {
         "text": [
            "The band signed on with Word Records in early 2008 after being an independent band for nearly ten years. Their first non-independent studio album, Daylight is Coming, was released on August 26, 2008 on Word Records.[6] The album was produced by Ian Eskelin.[6] Remedy Drive's first official single \"Daylight\" was released to Christian CHR radio stations on May 23, 2008.[6] Lead singer David Zach said about the song: \"In Lord of the Rings, Gandalf said, ‘At dawn, look to the East’, and that’s the message we’re offering here: even in the most desperate times, each new day provides a glimmer of hope.\"[6] On March 30, 2010, an Expanded Edition with three additional songs, and an EP with those three songs along with two remixes were released.\n",
            "The Remedy Drive song \"Hope\" was used for the Vancouver Olympic Games commercial in 2009 - 2010. In early 2010, Remedy Drive's official website said that the band was creating new songs for an upcoming project, possibly a second album for Word Records. In 2010, Remedy Drive toured with the Rock and Worship Roadshow with artists such as David Crowder Band, MercyMe, Family Force 5, Fee, and Sidewalk Prophets.\n"
         ]
      },
      "Light Makes A Way EP": {
         "text": [
            "On May 2, 2011, a five-song EP was released entitled Light Makes A Way.\n"
         ]
      },
      "Resuscitate": {
         "text": [
            "Remedy Drive signed with Centricity Music, and began working on their seventh studio album, entitled Resuscitate, which was released on September 18, 2012. On June 19, 2012, the band released their first single off the album, \"Better Than Life,\" along with a lyric music video. The album has had good reviews so far. The title song \"Resuscitate\" spent significant time at the top of Christian rock charts.[7]\n"
         ]
      },
      "Commodity": {
         "text": [
            "In 2014, David Zach stated that Commodity would be a counter-trafficking album to fight for freedom. The album was inspired by David Zach's work with the Exodus Road and his undercover work in Southeast Asia to deliver impoverished youth from child slavery.[1]  The album also marked the first time David Zach had spoken to his brother Philip Zach in almost three years, who would also act as the producer and collaborator for the new album.[1]  This new album saw the band moving towards an independent path.[8] Kickstarter was utilized to raise funding for the new album to reach listeners. Donations started on May 1 and the end of the donation period was May 31. The Commodity Kickstarter page was seeking $20,000 and the goal was surpassed and concluded having made $27,710.[9] The first single was Commodity released on April 9 and it spent 16 weeks at number 1 on Christian rock radio.[10] The album was released on September 23, 2014. In 2014 Dave Mohr left the band and was followed by Tim Buell in 2015.\n"
         ]
      },
      "Hope's Not Giving Up": {
         "text": [
            "Hope's Not Giving Up was released independently on September 2, 2016 and consisted of new recordings of alternate versions 10 of their songs.\n"
         ]
      },
      "The North Star": {
         "text": [
            "In 2017, the band started another Kickstarter campaign to raise $20,000 to produce a second counter-trafficking album. It was [11] having raised $37,361. It was released on January 12, 2018.[12]\n"
         ]
      },
      "text": [
         "Remedy Drive were formed as The Aslan Band in 1995 as a three-piece all-brother group, before a fourth brother, Paul, joined in 1998.[1] They released their first album, Remedy, in 1998 under their original name. After changing their name to Remedy, they released four more independent albums: Remedy (The Blue One) (1999), Remedy (The Red One) (2001), Remedy: A Live Album (2003), and Magnify (2004).[2] They changed their name again in 2004, this time to \"Remedy Drive\". They released Rip Open the Skies, which was released on April 25, 2006[3] and which has sold over 20,000 copies to date.[4] The band toured primarily in the Midwest and West Coast of the United States,[1][5] playing over 200 concerts per year. \n",
         "In 2008, the band was signed with Word Records and on August 28, 2008, they released Daylight Is Coming which was produced by Ian Eskelin followed by an Expanded Edition and an EP released on March 30, 2010. \n",
         "On April 6, 2011, the band's website announced that all of the Zach brothers except David (Daniel, Philip and Paul Zach) would be leaving the band, to be replaced by Dave Mohr, Timmy Jones, and Corey Horn. The departure of the three brothers was heavily driven by feuding between the brothers, primarily between Philip and David, as well as Philip's declining singing ability following vocal surgery and scarring.[1] The departure also marked the band's relocation to Nashville, Tennessee. Philip started his own recording studio in Lincoln, Nebraska, named the Grid Studio, and started his own solo act (Arrows and Sound). Philip collaborated with Paul Zach and local Lincoln musicians (The Silver Pages), and started a two-man project with musician Coury Palermo (A Thousand Fires). The departure of the three brothers marked the beginning of a three year, self-imposed silence between brothers, specifically between Philip and David.[1]\n",
         "On May 2, 2011 they independently released Light Makes a Way EP.\n",
         "In 2012, they signed with Centricity Music and on August 18, 2012, they released Resuscitate. Drummer Timmy Jones left in 2013 to join For King and Country, and Nashville-based drummer Tim Buell stepped in. Tim left the band in 2015, which prompted appearances by Michael Sturd and Zach Hunter. Timmy rejoined Remedy Drive in 2016.\n",
         "Since 2014, the band's albums have been produced by former band member, Philip Zach at The Grid Studio in Lincoln, Nebraska. On August 23, 2014, they released Commodity. On September 2, 2016, they released Hope's Not Giving Up. The North Star was released on January 12, 2018. Philip Zach is listed in the liner notes as being part of the band, along with Timmy Jones on drums.\n"
      ]
   },
   "Band members": {
      "Former members": {}
   },
   "Discography": {
      "Albums": {
         "text": [
            "As The Aslan Band\n",
            "As Remedy\n",
            "As Remedy Drive\n"
         ]
      },
      "EPs": {},
      "Singles": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Remedy Drive is an American alternative rock band found in 1998 in Lincoln, Nebraska. They are now based on Nashville, Tennessee.  The band is currently of lead vocalist and guitarist David Zach, bassist Corey Horn, and drummer Timmy Jones (with an extended appearance by Nashville-based drummer Tim Buell, and with occasional appearances by other drummers including Michael Sturd and Zach Hunter). They have recorded ten studio albums (six of them independent), one independent live album, and two EPs. The band was founded as a quartet consisting of the four Zach brothers. Three of the four brothers left the band in late 2010.\n",
      "Remedy Drive were formed as The Aslan Band in 1995 as a three-piece all-brother group, before a fourth brother, Paul, joined in 1998.[1] They released their first album, Remedy, in 1998 under their original name. After changing their name to Remedy, they released four more independent albums: Remedy (The Blue One) (1999), Remedy (The Red One) (2001), Remedy: A Live Album (2003), and Magnify (2004).[2] They changed their name again in 2004, this time to \"Remedy Drive\". They released Rip Open the Skies, which was released on April 25, 2006[3] and which has sold over 20,000 copies to date.[4] The band toured primarily in the Midwest and West Coast of the United States,[1][5] playing over 200 concerts per year. \n",
      "In 2008, the band was signed with Word Records and on August 28, 2008, they released Daylight Is Coming which was produced by Ian Eskelin followed by an Expanded Edition and an EP released on March 30, 2010. \n",
      "On April 6, 2011, the band's website announced that all of the Zach brothers except David (Daniel, Philip and Paul Zach) would be leaving the band, to be replaced by Dave Mohr, Timmy Jones, and Corey Horn. The departure of the three brothers was heavily driven by feuding between the brothers, primarily between Philip and David, as well as Philip's declining singing ability following vocal surgery and scarring.[1] The departure also marked the band's relocation to Nashville, Tennessee. Philip started his own recording studio in Lincoln, Nebraska, named the Grid Studio, and started his own solo act (Arrows and Sound). Philip collaborated with Paul Zach and local Lincoln musicians (The Silver Pages), and started a two-man project with musician Coury Palermo (A Thousand Fires). The departure of the three brothers marked the beginning of a three year, self-imposed silence between brothers, specifically between Philip and David.[1]\n"
   ]
}