{
   "Name": "Big Brother and the Holding Company",
   "rawData": [
      "Big Brother and the Holding Company is an American rock band that formed in San Francisco in 1965 as part of the same psychedelic music scene that produced the Grateful Dead, Quicksilver Messenger Service, and Jefferson Airplane. They are best known as the band that featured Janis Joplin as their lead singer. Their 1968 album Cheap Thrills is considered one of the masterpieces of the psychedelic sound  of San Francisco; it reached number one on the Billboard charts, and was ranked number 338 in Rolling Stone's the 500 greatest albums of all time. The album is also included in the book 1001 Albums You Must Hear Before You Die.\n",
      "Leader Peter Albin, a country-blues guitarist who had played with future Grateful Dead founders Jerry Garcia and Ron McKernan, met Sam Andrew, a professional rock guitarist with a jazz and classical background. After playing together at Albin's home, Andrew suggested they form a band. The pair approached guitarist James Gurley, the resulting threesome playing open jam sessions hosted by entrepreneur Chet Helms in 1965. Helms found them a drummer, Chuck Jones, and Big Brother and the Holding Company was formed at their first gig, the Trips Festival in January 1966. In the audience was painter and jazz drummer David Getz, who soon displaced Jones.\n",
      "Big Brother went on to become the house band at the Avalon Ballroom, playing a progressive style of instrumental rock. Feeling a need for a strong vocalist, Helms contacted Janis Joplin, who at the time was considering joining up with Roky Erickson of The 13th Floor Elevators. She traveled to San Francisco from Austin, Texas and debuted with Big Brother at the Avalon on June 10, 1966.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California"
      ],
      "Genres": [
         "Psychedelic rock,[1] acid rock,[2] blues rock[3]"
      ],
      "Years active": [
         "1965–1968, 1969–1972, 1987–present"
      ],
      "Labels": [
         "Columbia, Mainstream, Warner"
      ],
      "Associated acts": [
         "Country Joe and the Fish, Full Tilt Boogie Band, Kozmic Blues Band"
      ],
      "Website": [
         "www.bbhc.com"
      ],
      "Members": [
         "Peter Albin",
         "Dave Getz",
         "Tom Finch",
         "Darby Gould",
         "David Aguilar",
         "Kate Russo Thompson"
      ],
      "Past members": [
         "Sam Andrew",
         "James Gurley",
         "Chuck Jones",
         "Janis Joplin",
         "Nick Gravenites",
         "Kathi McDonald",
         "Dave Schallock",
         "Mike Finnigan",
         "Ben Nieves",
         "Cathy Richardson",
         "Tommy Odetto"
      ]
   },
   "albums": [
      "Big Brother & the Holding Company: Live in San Francisco 1966",
      "In Concert",
      "Cheaper Thrills",
      "Joseph's Coat",
      "Live at Winterland '68",
      "Hold Me",
      "The Lost Tapes",
      "Live at the Carousel Ballroom 1968"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band that formed in San Francisco in [YEAR] as part of the same psychedelic music scene that produced the Grateful Dead, Quicksilver Messenger Service, and [PERSON_NAME_FULL_0_MALE]. They are best known as the band that featured [MONTH]is Joplin as their lead singer. Their [YEAR] album Cheap Thrills is considered one of the masterpieces of the psychedelic sound  of San Francisco; it reached number one on the Billboard charts, and was ranked number 338 in Rolling Stone's the 500 greatest albums of all time. The album is also included in the book [YEAR] Albums You Must Hear Before You Die.\n",
      "Leader Peter Albin, a country-blues guitarist who had played with future Grateful Dead founders [PERSON_NAME_FULL_1_MALE] and Ron McKernan, met [PERSON_NAME_FULL_0_MALE], a professional rock guitarist with a jazz and classical background. After playing together at Albin's home, [PERSON_NAME_LAST_0] suggested they form a band. The pair approached guitarist James Gurley, the resulting threesome playing open jam sessions hosted by entrepreneur [PERSON_NAME_FULL_3_MALE] in [YEAR]. [PERSON_NAME_LAST_3] found them a drummer, Chuck Jones, and [BAND_NAME] was formed at their first gig, the Trips Festival in [MONTH] [YEAR]. In the audience was painter and jazz drummer [PERSON_NAME_FULL_2_MALE], who soon displaced Jones.\n",
      "Big Brother went on to become the house band at the Avalon Ballroom, playing a [GENRE] a need for a strong vocalist, Helms contacted [MONTH]is Joplin, who at the time was considering joining up with Roky Erickson of The 13th Floor Elevators. She traveled to San Francisco from Austin, Texas and debuted with Big Brother at the Avalon on [MONTH] 10, [YEAR].\n"
   ]
}