{
   "Name": "Rock n Roll Worship Circus",
   "rawData": [
      "The Rock 'n' Roll Worship Circus is a band from Kelso, Washington, U.S.\n",
      "The band began as worship team members in a church undergoing changes in the mid-1990s. Their transition to a nationally touring act came in 2001 after the release of their first full-length album, entitled Big Star Logistics.  In 2002, the band signed with Vertical Music, a subsidiary of Integrity Label Group, and released \"Welcome to the Rock 'n' Roll Worship Circus\", a 60's flavored blend of congregational, humorous, and personal worship songs.  The album was nominated for 4 GMA Dove Awards, and won the award for \"Best Art Packaging\". It peaked at #31 on Billboard's Top Contemporary Christian Albums chart. In 2003, the band's contract was given to INO Records, another subsidiary of Integrity Label Group, and the band's second album titled A Beautiful Glow was released. The band was dropped after lack of radio play and album sales had failed label expectations.  In 2004, the band released their last recorded work titled The Listening EP, toured internationally with Delirious?, and played major festivals worldwide.\n",
      "Some remaining members of the Worship Circus continue on in music today. Bobby Love has joined BEC Records band Telecast.  Mark and Terry Nelson have formed Portland based band The Shiny Things.  Zurn P. Praxair performs under the identities of P. The Clown, and Zwasco.  Gabriel Wilson, Chris Greely, Eric Lemiere, and Josiah Sherman went on to form The Listening, releasing The Listening LP in 2005.\n"
   ],
   "infobox": {
      "Origin": [
         "Kelso, Washington, United States"
      ],
      "Genres": [
         "CCM"
      ],
      "Years active": [
         "1999–2004"
      ],
      "Labels": [
         "Vertical, INO"
      ]
   },
   "prunedData": [
      "The Rock 'n' Roll Worship Circus is a [GENRE]",
      "The band began as worship team members in a church undergoing changes in the mid-[YEAR]s. Their transition to a nationally touring act came in [YEAR] after the release of their first full-length album, entitled Big Star Logistics.  In [YEAR], the band signed with Vertical Music, a subsidiary of Integrity Label Group, and released \"Welcome to the Rock 'n' Roll Worship Circus\", a 60's flavored blend of congregational, humorous, and personal worship songs.  The album was nominated for 4 GMA Dove Awards, and won the award for \"Best Art Packaging\". It peaked at #31 on Billboard's Top Contemporary Christian Albums chart. In [YEAR], the band's contract was given to INO Records, another subsidiary of Integrity Label Group, and the band's second album titled A Beautiful Glow was released. The band was dropped after lack of radio play and album sales had failed label expectations.  In [YEAR], the band released their last recorded work titled The Listening EP, toured internationally with Delirious?, and played major festivals worldwide.\n",
      "Some remaining members of the Worship Circus continue on in music today. Bobby Love has joined BEC Records band Telecast.  [MONTH]k and [PERSON_NAME_FULL_2_MALE] have formed Portland based band The Shiny Things.  Zurn P. Praxair performs under the identities of P. The Clown, and Zwasco.  Gabriel Wilson, [PERSON_NAME_FULL_0_MALE], [PERSON_NAME_FULL_1_MALE], and Josiah Sherman went on to form The Listening, releasing The Listening LP in [YEAR].\n"
   ]
}