{
   "Name": "Rocketboy",
   "rawData": [
      "Rocketboy was an American Christian rock band formed in Covington, Georgia, in 1993. Commonly categorized simply as Christian rock, Rocketboy's musical style was heavily influenced by a hodge-podge of mainstream artists such as Nirvana, Pearl Jam, R.E.M., Jimmy Buffett and Vigilantes of Love.\n",
      "The band initially performed under the name \"The Pain\" (also known as \"Cain's Pain\"). After signing a record contract with R.E.X. Records in 1995, the name \"Rocketboy\" was formally adopted.\n",
      "Rocketboy was an offshoot of the Covington band Steel Water, which included a line-up of several local musicians who performed together mainly at churches and private events. After the group dissolved, the three remaining members — Trey Bailey, Slade Curtis and Jason Parker — regrouped to form Cain's Pain.\n"
   ],
   "infobox": {
      "Origin": [
         "Covington, Georgia, United States"
      ],
      "Genres": [
         "Alternative rock"
      ],
      "Years active": [
         "1993–1997"
      ],
      "Labels": [
         "R.E.X. Records"
      ],
      "Associated acts": [
         "The Pain",
         "Cain's Pain",
         "Steel Water"
      ],
      "Website": [
         "http://rocketboylives.com/"
      ],
      "Past members": [
         "Trey Bailey (vocals, guitar)",
         "Slade Curtis (bass)",
         "Kip Bell (lead guitar)",
         "Tim \"Yogi\" Watts (drums, 1996-1997)",
         "Rob Jones (drums, 1994-1996)",
         "Joe Coleman (drums, 1994)",
         "Jason Parker (drums, 1993-1994)"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band formed in Covington, Georgia, in [YEAR]. Commonly categorized simply as Christian rock, [BAND_NAME]'s musical style was heavily influenced by a hodge-podge of mainstream artists such as Nirvana, Pearl Jam, R.E.M., [PERSON_NAME_FULL_0_MALE] and Vigilantes of Love.\n",
      "The band initially performed under the name [SONG_NAME] was formally adopted.\n",
      "[BAND_NAME] was an [GENRE] band Steel Water, which included a line-up of several local musicians who performed together mainly at churches and private events. After the group dissolved, the three remaining members — [PERSON_NAME_FULL_0_MALE], Slade Curtis and [PERSON_NAME_FULL_1_MALE] — regrouped to form Cain's Pain.\n"
   ]
}