{
   "Name": "Rocketboy",
   "Sections": [
      "1 History",
      "2 Reunion",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Rocketboy was an American Christian rock band formed in Covington, Georgia, in 1993. Commonly categorized simply as Christian rock, Rocketboy's musical style was heavily influenced by a hodge-podge of mainstream artists such as Nirvana, Pearl Jam, R.E.M., Jimmy Buffett and Vigilantes of Love.\n",
         "The band initially performed under the name \"The Pain\" (also known as \"Cain's Pain\"). After signing a record contract with R.E.X. Records in 1995, the name \"Rocketboy\" was formally adopted.\n"
      ]
   },
   "History": {
      "text": [
         "Rocketboy was an offshoot of the Covington band Steel Water, which included a line-up of several local musicians who performed together mainly at churches and private events. After the group dissolved, the three remaining members — Trey Bailey, Slade Curtis and Jason Parker — regrouped to form Cain's Pain.\n",
         "Cain's Pain added the Atlanta-area lead guitarist Kip Bell and performed regularly at local churches, clubs and theaters. The band's early schedule included regular shows at The Strand Theater in Marietta, Georgia.\n",
         "Between 1993 and 1995, the band toured the southeastern United States extensively as a modest but faithful fan base formed. In 1994, Joe Coleman (later of Teia Perma fame) replaced the original drummer Jason Parker. Soon thereafter, the band recorded and self-released Smile. Singles from Smile appeared on the Cranial Captivity Records release of Cranial Captivity: Fettered in the Mind's Eye and the Floppy Fish Records release of Fish Faves Vol. 1.\n",
         "In December 1994, Coleman left the band and the local drummer Rob Jones became the permanent drummer. In early 1995, the band signed a record contract with the now defunct Nashville label R.E.X. Records. This marked a milestone for the band and their small-town garage rock style and modest exposure gave way to a punchier sound and a growing fan base in cities across the eastern United States. To signify this coming of age, the band dropped \"The Pain\" and adopted the name \"Rocketboy\".\n",
         "In November 1995, Rocketboy recorded their first album with R.E.X. Records, No Sign of Intelligent Life (1996), at OMNIsound Studios in Nashville. The album was produced by Armand John Petri who had previously worked with The Goo Goo Dolls and 10,000 Maniacs.  Though the album was a critical success among fans, the financial troubles of R.E.X. Records hindered marketing support of the release. Despite a lack of label support, the band continued to play shows across the eastern United States, sharing the bill with such groups as Third Day, MxPx and Plankeye.\n",
         "Tim \"Yogi\" Watts became the drummer when Jones left in March 1996. Rocketboy also hired David Mardis to manage the band's affairs and the recording of their follow-up album Now That We Have Your Attention (1997). Mardis had previously managed and produced albums for Third Day. Now That We Have Your Attention was recorded at Furies Studios in Atlanta, Georgia, and was produced by Mardis.\n",
         "The band's 1997 schedule included a tour with Bride in support of Now That We Have Your Attention, but once again had little label support. The band subsequently requested an unconditional release from their record contract. Touring continued through the end of 1997. On December 31, 1997, Rocketboy played their final show at The Warehouse in Lexington, South Carolina.\n"
      ]
   },
   "Reunion": {
      "text": [
         "In 2007, Rocketboy reunited for a short tour, and in 2008 announced that they were reforming to begin writing a new album, more than a decade after their previous release.[1]\n"
      ]
   },
   "Discography": {
      "text": [
         "Smile (Independent release, 1994)\n",
         "\nNo Sign of Intelligent Life (R.E.X. Records, 1996)\n",
         "\nNow That We Have Your Attention (R.E.X. Records, 1997)\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Rocketboy was an American Christian rock band formed in Covington, Georgia, in 1993. Commonly categorized simply as Christian rock, Rocketboy's musical style was heavily influenced by a hodge-podge of mainstream artists such as Nirvana, Pearl Jam, R.E.M., Jimmy Buffett and Vigilantes of Love.\n",
      "The band initially performed under the name \"The Pain\" (also known as \"Cain's Pain\"). After signing a record contract with R.E.X. Records in 1995, the name \"Rocketboy\" was formally adopted.\n",
      "Rocketboy was an offshoot of the Covington band Steel Water, which included a line-up of several local musicians who performed together mainly at churches and private events. After the group dissolved, the three remaining members — Trey Bailey, Slade Curtis and Jason Parker — regrouped to form Cain's Pain.\n",
      "Cain's Pain added the Atlanta-area lead guitarist Kip Bell and performed regularly at local churches, clubs and theaters. The band's early schedule included regular shows at The Strand Theater in Marietta, Georgia.\n"
   ]
}