{
   "Name": "Rojo (band)",
   "rawData": [
      "Rojo was a Christian rock band from Mexico. The band was formed in 2000 by bassist Emmanuel Espinosa, with their eponymous debut album released in 2001.\n",
      "Since their youth in the early 1990s, Emmanuel Espinosa and Rubén González thought about starting their own band. By the end of the century, they recruited guitarist Oswaldo Burruel as they started to shape up a band. Finally, joined by Annette Moreno, the band Rojo was officially formed in 2000. Rojo debuted in Los Angeles, California during a Youth Congress led by Luis Enrique Espinosa, brother of Emmanuel.\n",
      "In 2001, they released their eponymous debut album and started touring through Latin America, United States, Spain, and Japan. During this time, lead singer Annette Moreno, decided to start a solo career and left the band. She was replaced with Emmanuel's wife, Linda. After almost two years of touring, the band released their second album, titled 24/7 in 2003, which featured songwriting collaborations by Juan Salinas and Jesús Adrián Romero. \n"
   ],
   "infobox": {
      "Origin": [
         "Mexico"
      ],
      "Genres": [
         "CCM, rock, pop"
      ],
      "Years active": [
         "2000–2012"
      ],
      "Labels": [
         "Grupo CanZion, ReyVol"
      ],
      "Associated acts": [
         "Os Burruel, Emmanuel Y Linda"
      ],
      "Website": [
         "www.rojoweb.com"
      ],
      "Members": [
         "Emmanuel Espinosa",
         "Rubén González",
         "Oswaldo Burruel",
         "Linda Moreno",
         "Emma Curiel"
      ],
      "Past members": [
         "Annette Moreno",
         "Edith Sánchez"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band from Mexico. The band was formed in [YEAR] by bassist [PERSON_NAME_FULL_0_MALE], with their eponymous debut album released in [YEAR].\n",
      "Since their youth in the early [YEAR]s, [PERSON_NAME_FULL_3_MALE] and [PERSON_NAME_FULL_2_MALE] thought about starting their own band. By the end of the century, they recruited guitarist [PERSON_NAME_FULL_0_MALE] as they started to shape up a band. Finally, joined by [PERSON_NAME_FULL_4_FEMALE], the band [BAND_NAME] was officially formed in [YEAR]. [BAND_NAME] debuted in Los Angeles, California during a Youth Congress led by [PERSON_NAME_FULL_1_MALE], brother of [PERSON_NAME_FIRST_3].\n",
      "In [YEAR], they released their eponymous debut album and started touring through Latin America, United States, Spain, and Japan. During this time, lead singer [PERSON_NAME_FULL_1_FEMALE], decided to start a [GENRE] band. She was replaced with Emmanuel's wife, Linda. After almost two years of touring, the band released their second album, titled 24/7 in [YEAR], which featured songwriting collaborations by Juan Salinas and [PERSON_NAME_FULL_0_MALE]. \n"
   ]
}