{
   "Name": "Seabird (band)",
   "rawData": [
      "Seabird is an American alternative rock band from Independence, Kentucky. The band formed when Aaron Morgan, Micah Landers, and Aaron Hunt began playing songs with each other in 2004. The band soon added accordion player David Smith. After playing together for a little under a year both Landers and Smith left to pursue other interests. Soon after Chris Kubik joined the band to take the place of Landers on bass and Morgan began playing two keyboards to make up for the loss of the accordion. After adding Morgan's brother (Ryan) to play guitar, the band recorded their debut EP, Spread Your Broken Wings and Try, in one of the band members' rooms.\n",
      "Their EP was passed to EMI and, after a personal showcase, the band was signed in 2005. However, a year later, the band switched from EMI to Credential Records. They continued to record material for a possible studio album from 2006 through most of 2007 and released a second EP, Let Me Go On, in mid-December 2007. This time, their second EP was used as a teaser for their upcoming debut studio album, 'Til We See the Shore, which was released on June 24, 2008. Their latest album Rocks into Rivers was released on December 15, 2009. On June 17, 2012 they completed their Kickstarter project which raised funds for a self-produced third full-length album. On May 13, 2013 the band announced the name of the Kickstarter project album to be Troubled Days with release date of July 16, 2013.\n",
      "Seabird's songs were recently heard on Pushing Daisies, Numb3rs, and Grey's Anatomy. Seabird's song \"Don't You Know You're Beautiful\" was played at the beginning of the Ghost Whisperer Season 5 episode On Thin Ice.\n"
   ],
   "infobox": {
      "Origin": [
         "Independence, Kentucky"
      ],
      "Genres": [
         "Alternative rock, pop rock, indie rock, Christian rock"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Credential"
      ],
      "Website": [
         "SeabirdMusic.com"
      ],
      "Members": [
         "Aaron Morgan",
         "Brandon Weaver",
         "Preston Lane",
         "Ryan Morgan"
      ],
      "Past members": [
         "Micah Landers",
         "David Smith",
         "Aaron Hunt",
         "Chris Kubik"
      ]
   },
   "albums": [
      "Spread Your Broken Wings and Try",
      "Let Me Go On",
      "Purevolume.com Acoustic Sessions",
      "The Silent Night EP",
      "Over the Hills and Everywhere EP: A Christmas EP"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Independence, Kentucky. The band formed when Aaron Morgan, [PERSON_NAME_FULL_2_MALE], and Aaron Hunt began playing songs with each other in [YEAR]. The band soon added accordion player [PERSON_NAME_FULL_0_MALE]. After playing together for a little under a year both [PERSON_NAME_LAST_2] and [PERSON_NAME_LAST_0] left to pursue other interests. Soon after [PERSON_NAME_FULL_1_MALE] joined the band to take the place of [PERSON_NAME_LAST_2] on bass and Morgan began playing two keyboards to make up for the loss of the accordion. After adding Morgan's brother (Ryan) to play guitar, the band recorded their debut EP, Spread Your Broken Wings and Try, in one of the band members' rooms.\n",
      "Their EP was passed to EMI and, after a [GENRE] band was signed in [YEAR]. However, a year later, the band switched from EMI to Credential Records. They continued to record material for a possible studio album from [YEAR] through most of [YEAR] and released a second EP, Let Me Go On, in mid-[MONTH] [YEAR]. This time, their second EP was used as a teaser for their upcoming debut studio album, 'Til We See the Shore, which was released on [MONTH] 24, [YEAR]. Their latest album Rocks into Rivers was released on [MONTH] 15, [YEAR]. On [MONTH] 17, [YEAR] they completed their Kickstarter project which raised funds for a self-produced third full-length album. On [MONTH] 13, [YEAR] the band announced the name of the Kickstarter project album to be Troubled Days with release date of [MONTH] 16, [YEAR].\n",
      "[BAND_NAME]'s songs were recently heard on Pushing Daisies, Numb3rs, and Grey's Anatomy. [BAND_NAME]'s song [SONG_NAME] was played at the beginning of the Ghost Whisperer Season 5 episode On Thin Ice.\n"
   ]
}