{
   "Name": "Los Sírex",
   "rawData": [
      "Los Sírex is a Spanish rock band started in 1959 in Barcelona and was active until 1972. In 1977 they got together again and were active until 2012. It was initially formed by three musicians: Guillermo Rodríguez Holgado, Antonio Miers and Manuel Madruga (Manolo), then briefly joined by the vocalist Santi Carulla in 1960. By the end of 1960, the band consisted of Antoni Miquel Cerveró (\"Leslie\" or \"L'Anxoveta\") as lead vocalist, Lluís Gomis (Lluís Gomis de Prunera, 1944-2012, RIP) on the drums, Josep Fontseré Portolés (Pepe or Pep, Barcelona, 1945) on the rhythm guitar, Guillermo Rodríguez Holgado on the bass and Manolo Madruga (RIP 2012) on the lead guitar. They named the band after a component of eyeglasses: Guillermo worked at his father's glasses factory, where they used a filament called Sírex to adjust the lenses to the frames of the glasses. They became identified with a pure rock and roll style with daring lyrics that caused them trouble with the Spanish censorship of the time. They sang in Spanish.\n",
      "Their training began in June 1959 in Barcelona, when three friends and neighbors living on the street called Gran Via (Guillermo Rodríguez Holgado, Antonio Miers and Manolo Madruga, 15–17 years old at the time) decided to play music under the influence of Elvis Presley. To complete their apprenticeship, they would listen to other bands at the Spanish University Union (Sindicato Español Universitario) on Carrer Canuda or the CAPSA theatre on Aragon Street, where other groups like Estrellas Fugaces or Los Cocodrilos played. In 1960, Santi Carulla, a classmate of Guillermo, briefly joined the band before moving on to be the lead singer of the rival band Los Mustang: both bands participated in a contest for young talent on Ràdio Barcelona, after which the rival band asked Carulla to be their singer. The first performance of Los Sirex was at a Barça football fan club (Penya barcelonista) at Casp Street. That would be followed by concerts at the \"Tropical\" in Castelldefels. After Carulla left, Antoni Miquel Cerveró, from the band Los Meteors, then joined as lead singer, and Josep Fontseré joined as rhythm guitarist.\n"
   ],
   "infobox": {}
}