{
   "Name": "Bracket (band)",
   "rawData": [
      "Bracket is an American rock band from Forestville, California formed in 1992.  The lineup consists of lead vocalist and guitarist Marty Gregori, bassist and backing vocalist Zack Charlos, drummer Ray Castro, and guitarist and backing vocalist Angelo Celli, who replaced Larry Tinney in 1998.  Bracket has issued numerous albums, EPs and singles since its inception, including many releases for Caroline Records and Fat Wreck Chords.  Their sound could most easily be described as power pop influenced punk rock with a continued focus on vocal harmonies.\n",
      "Bracket emerged during the pop punk resurgence of the early 1990s and released its first two albums 924 Forestville St. (1994) and 4-Wheel Vibe (1995) on Caroline Records.  Following a staff shake-up, the label dropped the group and cancelled the release of its third album Like You Know in 1996.  Bracket's next two albums Novelty Forever (1997) and When All Else Fails (2000) were put out by Fat Wreck Chords, who had previously issued 7-inch vinyl for the band.  Having completed multiple tours of the United States and trips to Canada, Europe and Japan throughout their career, Bracket released Live in a Dive (2002) which gathered some of the band's best-known material into one performance.  After building their own studio, the group took several years to write, record and self-produce its sixth album Requiem (2006), released by Takeover Records.  Bracket began work on a new album in 2011, detailing each stage of the recording process on its official Facebook page. Like You Know and the three volume rarities collection Rare Cuts were issued as digital downloads in 2013 to help fund the band's upcoming projects.  Bracket's seventh studio album, Hold Your Applause was released in August 2014.August 2016 saw the release of Bracket's eighth full-length album, The Last Page. The 70 minute album consisted of one “song”, the 28th installment of their “Warren’s Song” series. The band recorded nearly 100 short fragments of songs, with the intention of piecing them together to create the 70 minute “Warren’s Song Pt. 28”. Bracket completed work on their ninth studio album in late 2018, with a release planned for early 2019.\n",
      "In the late 1980s while attending El Molino High in Forestville, California, friends Marty Gregori and Larry Tinney bonded over a mutual admiration for rock band AC/DC and began teaching each other guitar chords.  After joining up with schoolmates Zack Charlos and Ray Castro they formed High Output, an early incarnation of the band that would later become known as Bracket.  During these initial stages, the group played cover songs by Tom Petty, Creedence Clearwater Revival and the Rolling Stones, with its earliest performances appearing at weddings, bar mitzvahs and high school parties.  In the fall of 1991, Gregori and Charlos penned their first original song, \"Why Should Eye\", just before relocating to Los Angeles where they made an attempt at starting a new project.  Following an unsuccessful two months, Charlos moved back home and reconnected with Tinney and Castro.  Gregori stayed behind for another year but continued to exchange song ideas with Tinney through telephone answering machine messages.\n"
   ],
   "infobox": {
      "Origin": [
         "Forestville, California, United States"
      ],
      "Genres": [
         "Punk rock, power pop, pop punk, alternative rock, melodic hardcore, indie rock, folk rock, baroque pop"
      ],
      "Years active": [
         "1992–present"
      ],
      "Labels": [
         "Caroline, Fat Wreck Chords, Hi-Rise, Too Hep, Takeover"
      ],
      "Associated acts": [
         "High Output, The Good Life Crisis"
      ],
      "Website": [
         "bracket.bandcamp.com"
      ],
      "Members": [
         "Marty Gregori",
         "Zack Charlos",
         "Ray Castro",
         "Angelo Celli"
      ],
      "Past members": [
         "Larry Tinney"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Forestville, California formed in [YEAR].  The lineup consists of lead vocalist and guitarist [MONTH]ty Gregori, bassist and backing vocalist Zack Charlos, drummer Ray Castro, and guitarist and backing vocalist [PERSON_NAME_FULL_1_MALE], who replaced [PERSON_NAME_FULL_0_MALE] in [YEAR].  [BAND_NAME] has issued numerous albums, EPs and singles since its inception, including many releases for Caroline Records and Fat Wreck Chords.  Their sound could most easily be described as power pop influenced punk rock with a continued focus on vocal harmonies.\n",
      "[BAND_NAME] emerged during the pop punk resurgence of the early [YEAR]s and released its first two albums 924 Forestville St. ([YEAR]) and 4-Wheel Vibe ([YEAR]) on Caroline Records.  Following a staff shake-up, the label dropped the group and cancelled the release of its third album Like You Know in [YEAR].  [BAND_NAME]'s next two albums [MONTH]elty Forever ([YEAR]) and When All Else Fails ([YEAR]) were put out by Fat Wreck Chords, who had previously issued 7-inch vinyl for the band.  Having completed multiple tours of the United States and trips to Canada, Europe and Japan throughout their career, [BAND_NAME] released Live in a Dive ([YEAR]) which gathered some of the band's best-known material into one performance.  After building their own studio, the group took several years to write, record and self-produce its sixth album Requiem ([YEAR]), released by Takeover Records.  [BAND_NAME] began work on a new album in [YEAR], detailing each stage of the recording process on its official Facebook page. Like You Know and the three volume rarities collection Rare Cuts were issued as digital downloads in [YEAR] to help fund the band's upcoming projects.  [BAND_NAME]'s seventh studio album, Hold Your Applause was released in [MONTH] [YEAR].[MONTH] [YEAR] saw the release of [BAND_NAME]'s eighth full-length album, The Last Page. The 70 minute album consisted of one “song”, the 28th installment of their “Warren’s Song” series. The band recorded nearly 100 short fragments of songs, with the intention of piecing them together to create the 70 minute “Warren’s Song Pt. 28”. [BAND_NAME] completed work on their ninth studio album in late [YEAR], with a release planned for early [YEAR].\n",
      "In the late [YEAR]s while attending El Molino High in Forestville, California, friends [MONTH]ty Gregori and [PERSON_NAME_FULL_1_MALE] bonded over a [GENRE] band AC/DC and began teaching each other guitar chords.  After joining up with schoolmates [PERSON_NAME_FULL_0_MALE] and Ray Castro they formed High Output, an early incarnation of the band that would later become known as [BAND_NAME].  During these initial stages, the group played cover songs by Tom Petty, Creedence Clearwater Revival and the Rolling Stones, with its earliest performances appearing at weddings, bar mitzvahs and high school parties.  In the fall of [YEAR], Gregori and [PERSON_NAME_LAST_0] penned their first original song, [SONG_NAME], just before relocating to Los Angeles where they made an attempt at starting a new project.  Following an unsuccessful two months, [PERSON_NAME_LAST_0] moved back home and reconnected with [PERSON_NAME_LAST_1] and Castro.  Gregori stayed behind for another year but continued to exchange song ideas with [PERSON_NAME_LAST_1] through telephone answering machine messages.\n"
   ]
}