{
   "Name": "Shaded Red",
   "rawData": [
      "Shaded Red was a Christian alternative rock band from Denver, Colorado, in the United States. It was formed in 1993 by brothers Jamie Roberts (vocals and guitar) and Jonathan Roberts (guitars, bass, trumpet, piano). In 1997 they released their debut self-titled album through Cadence. On January 17, 1998, the band was struck by tragedy when their van hit a patch of black ice returning from a concert. Drummer Chris Yeoman was killed and Jon Roberts was left with a shattered pelvis. It was at this time the band considered calling it quits but decided to press on instead.\n",
      "In 1999, the band released their second album, Red Revolution. The album was a moderate success and features a remake of the Benny Hester song \"When God Ran\". The band has since broken up, and brothers Jamie and Jonathan currently reside in Los Angeles.\n"
   ],
   "infobox": {
      "Origin": [
         "Colorado, U.S."
      ],
      "Genres": [
         "Alternative rock, Christian rock"
      ],
      "Years active": [
         "1993–2000"
      ],
      "Labels": [
         "Cadence"
      ],
      "Past members": [
         "Jamie Roberts",
         "Jonathan Roberts"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band from Denver, Colorado, in the United States. It was formed in [YEAR] by brothers Jamie [PERSON_NAME_LAST_0] (vocals and guitar) and [PERSON_NAME_FULL_0_MALE] (guitars, bass, trumpet, piano). In [YEAR] they released their debut self-titled album through Cadence. On [MONTH] 17, [YEAR], the band was struck by tragedy when their van hit a patch of black ice returning from a concert. Drummer Chris Yeoman was killed and [PERSON_NAME_FIRST_1] [PERSON_NAME_LAST_0] was left with a shattered pelvis. It was at this time the band considered calling it quits but decided to press on instead.\n",
      "In [YEAR], the band released their second album, Red Revolution. The album was a [GENRE] a remake of the Benny Hester song \"When God Ran\". The band has since broken up, and brothers Jamie and Jonathan currently reside in Los Angeles.\n"
   ]
}