{
   "Name": "Sherwood (band)",
   "rawData": [
      "Sherwood is an indie rock band from San Luis Obispo, California, specializing in upbeat pop rock. Members of the band cite The Beatles and The Beach Boys as some of their main influences. The band broke up in 2012 after ten years together. On September 28, 2015, the band announced via their Facebook page that they would be starting an Indiegogo account in order to crowdfund their fourth album, Some Things Never Leave You, which was released on June 17, 2016.\n",
      "The band began in late 2002 while several of its founding members were attending Cal Poly in San Luis Obispo, California. The band first formed with Nate Henry on vocals and bass, Dan Koch on drums, and Chris Armstrong on guitar. The name Sherwood comes from an inside band joke about creating a concept album that synced with the 1973 Disney Robin Hood cartoon in the same way that Pink Floyd's The Dark Side of the Moon is said to sync with The Wizard of Oz. In April 2003, the lineup was changed with the addition of drummer Joe Greenetz. Koch became the band's second guitarist and principal songwriter. October of the same year saw the addition of keyboardist Chris Keene. Mike Leibovich joined to play keyboards months later after Keene left Sherwood to play for Number One Gun. After years of touring with a \"Do-it-yourself\" attitude, the band chose to sign with Militia Group side-label Sidecho Records, who would release their debut LP. Entitled Sing, But Keep Going and produced at Sonikwire Studios in Irvine, CA by Michael Rosas (singer/guitarist for the band Satisfaction), it sold over 20,000 copies and helped stir up even more attention for the group.\nIn 2005 it was announced that founding guitarist Chris Armstrong was leaving the band. His role was filled on tour first by (former Terminal, now Oh, Sleeper bassist) Lucas Starr and later by their friend Gabe Dutton from Michigan in the summer of '06 and finally by David Provenzano (formerly of the band Fighting Jacks) in February 2007.\n",
      "As Sing, But Keep Going continued to gain traction, the band began receiving interest from other labels as they went on to play the Vans Warped Tour and sold-out shows across the country. Pushing the envelope even further was AbsolutePunk.net, who released a free downloadable EP in early 2006 that has since been downloaded some 30,000 times. After holding out for the best possible deal, the band surprised its fans and announced that they had signed to the newly formed MySpace Records.  Following another summer stint on the Warped Tour, Sherwood spent six weeks in a beach house near Ensenada, Mexico writing for their next LP. The songs written during this time, along with the material they'd released on the Summer EP, were compiled to form a new full-length album, later entitled A Different Light, which was recorded in December 2006 at Motor Studios in San Francisco with producer Lou Giordano and features his daughter Joanna as a violinist in \"I'm Asking Her to Stay\".\n"
   ],
   "infobox": {
      "Origin": [
         "San Luis Obispo, California, United States"
      ],
      "Genres": [
         "Indie rock, pop punk, pop rock"
      ],
      "Years active": [
         "2002–2012, 2015-present"
      ],
      "Labels": [
         "Myspace Records (2006–2012)",
         "Sidecho Records"
      ],
      "Website": [
         "www.sherwoodmusic.net"
      ],
      "Members": [
         "Nate Henry",
         "Dan Koch",
         "Joe Greenetz",
         "Mike Leibovich",
         "David Provenzano"
      ],
      "Past members": [
         "Chris Armstrong",
         "Chris Keene",
         "Billy Dunaway",
         "Gabe Dutton"
      ]
   }
}