{
   "Name": "Slick Shoes",
   "rawData": [
      "Slick Shoes is an American punk rock band from Antelope Valley, California, United States. Their name comes from the hit 1985 movie, The Goonies, 'slick shoes' being one of the character Data's many gadgets. The band formed in 1994 and made their first release as a self-titled EP in 1997. They released six full-length CDs, four of them on Seattle-based Tooth & Nail Records. They also released an EP, a split with Autopilot Off and a greatest hits CD entitled The Biggest & The Best, featuring three previously unreleased songs.\n",
      "The band had gone through numerous line-up changes over the years, but singer Ryan Kepke and Joe Nixon (drums) performed on every release, while Jeremiah Brown (bass) played on all except their final album, Far From Nowhere. This was their first release without Tooth and Nail Records. Far From Nowhere was released on SideOneDummy Records in the summer of 2003.\n",
      "The band was particularly successful in the Christian punk scene in the late 1990s and early 2000s and toured alongside their peers, both secular and Christian (most notably bands such as Face to Face and MxPx, respectively). They also played certain legs of the Vans Warped Tour in 2003.\n"
   ],
   "infobox": {
      "Origin": [
         "Antelope Valley, California, United States[1]"
      ],
      "Genres": [
         "Punk rock, pop punk, skate punk"
      ],
      "Years active": [
         "1994–2004, 2007–2008, 2011–2012, 2015-present"
      ],
      "Labels": [
         "SideOneDummy, Tooth & Nail, Fueled by Ramen"
      ],
      "Members": [
         "Ryan Kepke",
         "Joe Nixon",
         "Jackson Mould",
         "Jeremiah Brown",
         "Jonah Peterson"
      ],
      "Past members": [
         "Dale Yob",
         "Greg Togawa",
         "David Stoltenberg",
         "Adam Stiletto",
         "Kevin Clark",
         "Josh Kleven",
         "Bill Lanz",
         "Jordan Mould"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Antelope Valley, California, United States. Their name comes from the hit [YEAR] movie, The Goonies, 'slick shoes' being one of the character Data's many gadgets. The band formed in [YEAR] and made their first release as a self-titled EP in [YEAR]. They released six full-length CDs, four of them on Seattle-based Tooth & Nail Records. They also released an EP, a split with Autopilot Off and a greatest hits CD entitled The Biggest & The Best, featuring three previously unreleased songs.\n",
      "The band had gone through numerous line-up changes over the years, but singer [PERSON_NAME_FULL_0_MALE] and Joe Nixon (drums) performed on every release, while [PERSON_NAME_FULL_2_MALE] (bass) played on all except their final album, Far From Nowhere. This was their first release without Tooth and [PERSON_NAME_FULL_1_MALE]. Far From Nowhere was released on SideOneDummy [PERSON_NAME_LAST_1] in the summer of [YEAR].\n",
      "The band was particularly successful in the Christian punk scene in the late [YEAR]s and early [YEAR]s and toured alongside their peers, both secular and Christian (most notably bands such as Face to Face and MxPx, respectively). They also played certain legs of the Vans Warped Tour in [YEAR].\n"
   ]
}