{
   "Name": "Sonseed",
   "Sections": [
      "Summary"
   ],
   "Summary": {
      "text": [
         "Sonseed was an American Roman Catholic pop band formed at the Church of Our Lady of Perpetual Help in Brooklyn, New York in the late 1970s.[1] The line-up included Sal Polichetti (bass, vocals); his then-wife Patricia Costagliola (keyboards, vocals; deceased); Frank Franco (guitar, vocals); and Nicky Sciarra (deceased, drums). Anne Lessing (vocals) was also involved in the band from the start. There were others including Jim Archer (vocals) and Karen Archer (acoustic guitar), Tom Zawacki (tambourine, percussion and vocals), Brother John Weiners, CSC (deceased, vocals), and Melody Sorrentino (vocals). Their sole album, First Fruit, was released in 1981, with only 1,000 copies printed.[2] In 2009 Sonseed released an EP on Arena Rock Records which includes selections from the original First Fruit album.[3]  A proposed follow-up, Just Can't Get Enough (Of Jesus!!!), with more new wave and New Romantic elements, never saw official release, but some bootleg tracks have surfaced. Sonseed disbanded in 1983.[2]\n",
         "As Patricia Costa, Costagliola recorded two albums, Walk Forward and Give Your Love Away, with Polichetti, Franco and Sciarra as the backing band.[4]\n",
         "Nicky Sciarra became district manager of Community Board 7 in Sunset Park, Brooklyn. He died in 1993 after apparently choking on a sandwich.[5]\n",
         "The band came back into the spotlight in 2008 when a recording of them performing their song \"Jesus Is a Friend of Mine\", from a religious TV show called The First Estate, appeared on the Dougsploitation blog, and subsequently became a YouTube hit,[1][6][7][8] where it spawned several parodies. Polichetti performed the song live at the Bowery Poetry Club in New York City on November 14, 2009 with the ska-swing band Tri-State Conspiracy.[9]\n",
         "In mid to late 2009 the band's 1983 album became a recurring subject of theological scrutiny by Todd Friel of the FamilyNet radio program called Wretched Radio. Friel eventually aired every track of the album over a several week period, the last song being aired on September 17, 2009.\n",
         "In 2010, the internet video makers Smosh made a parody of the song \"Jesus Is a Friend of Mine\" called \"Vader is my Friend\" in their video \"Vader and Me\".\n",
         "In 2011, Fox Television's hit show Glee also did a cover of the song \"Jesus Is a Friend of Mine\". During the Regional competition, the group \"Aural Intensity\" sang the song.[1][10]\n",
         "Nina Hagen made a German cover  of \"Jesus Is a Friend of Mine\" (\"Jesus ist ein Freund von mir\") for her 2011 album Volksbeat.[11]\n"
      ]
   },
   "coreData": [
      "Sonseed was an American Roman Catholic pop band formed at the Church of Our Lady of Perpetual Help in Brooklyn, New York in the late 1970s.[1] The line-up included Sal Polichetti (bass, vocals); his then-wife Patricia Costagliola (keyboards, vocals; deceased); Frank Franco (guitar, vocals); and Nicky Sciarra (deceased, drums). Anne Lessing (vocals) was also involved in the band from the start. There were others including Jim Archer (vocals) and Karen Archer (acoustic guitar), Tom Zawacki (tambourine, percussion and vocals), Brother John Weiners, CSC (deceased, vocals), and Melody Sorrentino (vocals). Their sole album, First Fruit, was released in 1981, with only 1,000 copies printed.[2] In 2009 Sonseed released an EP on Arena Rock Records which includes selections from the original First Fruit album.[3]  A proposed follow-up, Just Can't Get Enough (Of Jesus!!!), with more new wave and New Romantic elements, never saw official release, but some bootleg tracks have surfaced. Sonseed disbanded in 1983.[2]\n",
      "As Patricia Costa, Costagliola recorded two albums, Walk Forward and Give Your Love Away, with Polichetti, Franco and Sciarra as the backing band.[4]\n",
      "Nicky Sciarra became district manager of Community Board 7 in Sunset Park, Brooklyn. He died in 1993 after apparently choking on a sandwich.[5]\n",
      "The band came back into the spotlight in 2008 when a recording of them performing their song \"Jesus Is a Friend of Mine\", from a religious TV show called The First Estate, appeared on the Dougsploitation blog, and subsequently became a YouTube hit,[1][6][7][8] where it spawned several parodies. Polichetti performed the song live at the Bowery Poetry Club in New York City on November 14, 2009 with the ska-swing band Tri-State Conspiracy.[9]\n"
   ],
   "infobox": {}
}