{
   "Name": "Southbound Fearing",
   "rawData": [
      "Southbound Fearing are an American Christian rock band, who primarily plays Christian alternative rock with rock and roll. They come from Toledo, Ohio. The band started making music in 2006.  They have released three studio albums and two extended plays, with Red Cord Records. The group have charted eight songs on the Billboard magazine Christian rock songs chart.\n",
      "They formed in April 2006 in Toledo, Ohio, while their members are lead vocalist and guitarist, Brady Leonard, leading guitarist, Eric Ade, bassist, Eric Nelson Wheatley, and drummer, Nathan Ball. The group are a Christian rock band, where they play a rock and roll style of Christian alternative rock inspirational music. Their group got the name from a street in their hometown.\n",
      "The band commenced as a musical entity in April 2006, with their first extended play, The Arduous Task, that was released on May 16, 2010, with Red Cord Records. Their song, \"Miles\", peaked at No. 17 on the Billboard magazine Christian rock chart. The subsequent extended play, Safe and Sound, was released on September 30, 2010, from Red Cord Records. They released, Southbound Fearing, on August 2, 2011, with Red Cord Records. Their songs, \"Irresistible\" and \"Fighting Words\", peaked on the Billboard magazine Christian Rock chart, at Nos. 6 and 9, correspondingly. The third studio album, Bad Dreams and Melodies, was released by Record Cord Records, on October 9, 2012. This album saw three songs, \"The Love That Never Fails\", \"I Heard the River\", and \"Vale Tudo\", peak on the Billboard magazine Christian rock songs chart, at Nos. 10, 17, and 21, respectively. Their subsequent studio album, Undefeated, was released on May 27, 2014, from Red Cord Records. This album got two singles, \"Easy Way Out\" and \"Brave New World\", to chart on the Billboard magazine Christian rock chart, where they peaked at Nos. 6 and 7, correspondingly.\n"
   ],
   "infobox": {
      "Origin": [
         "Toledo, Ohio"
      ],
      "Genres": [
         "Christian rock, rock and roll, Christian alternative rock, indie rock, alternative rock"
      ],
      "Years active": [
         "2006 (2006)–present"
      ],
      "Labels": [
         "Red Cord"
      ],
      "Website": [
         "southboundfearing.com"
      ],
      "Members": [
         "Brady Leonard",
         "Eric Nelson Wheatley",
         "Nathan Ball"
      ]
   },
   "albums": [
      "Southbound Fearing",
      "Bad Dreams and Melodies",
      "Undefeated"
   ],
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band, who primarily plays Christian alternative rock with rock and roll. They come from Toledo, Ohio. The band started making music in [YEAR].  They have released three studio albums and two extended plays, with Red Cord Records. The group have charted eight songs on the Billboard magazine Christian rock songs chart.\n",
      "They formed in [MONTH] [YEAR] in Toledo, Ohio, while their members are lead vocalist and guitarist, Brady Leonard, leading guitarist, [PERSON_NAME_FULL_1_MALE], bassist, [PERSON_NAME_FIRST_1] Nelson Wheatley, and drummer, [PERSON_NAME_FULL_0_MALE]. The group are a [GENRE] band, where they play a rock and roll style of Christian alternative rock inspirational music. Their group got the name from a street in their hometown.\n",
      "The band commenced as a musical entity in [MONTH] [YEAR], with their first extended play, The Arduous Task, that was released on [MONTH] 16, [YEAR], with Red Cord Records. Their song, [SONG_NAME], to chart on the Billboard magazine [PERSON_NAME_FIRST_0] rock chart, where they peaked at Nos. 6 and 7, correspondingly.\n"
   ]
}