{
   "Name": "Spy Glass Blue",
   "rawData": [
      "Spy Glass Blue is an American post-punk/new wave/Britpop band formed by Allan Aguirre of Scaterd Few, is credited for legitimizing and authenticating the post-punk genre in Christian alternative music (ACM) much in the same way that Scaterd Few defined punk rock in Contemporary Christian music (CCM). In the words of the Encyclopedia of Contemporary Christian Music, Spy Glass Blue is a \"rare example of Christian goth music.\" As Allan's solo effort shows Allan's artier (\"mellower, artistic\") side where Scaterd Few showed his edgier side. Aguirre likens the band's presence to the restructuring of other Christian Alternative bands: Mortal to Fold Zandura or the Crucified to Stavesacre.\n",
      "Spy Glass Blue was founded in 1995 and immediately released a self-titled vinyl EP. Their first album was released the next year, but because of record label issues did not achieve widespread distribution until 1997. Shadows contain a gothic rock musical style that swings between \"light and airy\", \"dark, haunting, moody\", and psychedelic. Spy Glass Blue originally intended to have more of a pop based sound, like \"Sade and Seal meets Peter Murphy,\" of the goth scene Aguirre comments \"gothic is one tenth of what we do.\"\n",
      "According to one reviewer \"Shadows plays mind games with the listener\" with its music and deep lyrics. Lyrically it hides its deep meanings in a way that is \"sometimes hard to follow.\" An example is in the song \"Stygan\", which hides the dangers of stumbling in faith in the words \"apostolic apostasy\". The overall theme of the album is \"the confusion of life without Christ.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Dallas, Texas, United States"
      ],
      "Genres": [
         "Post-punk, new wave"
      ],
      "Years active": [
         "1995–present"
      ],
      "Labels": [
         "Accidental Sirens, Organic Records, Pinnacle Records, Flying Tart"
      ],
      "Members": [
         "Allan Aguirre"
      ]
   },
   "albums": [
      "Spy Glass Blue",
      "Shadows",
      "Loud As Feathers",
      "The Blue EP"
   ]
}