{
   "Name": "Butch Engle & the Styx",
   "rawData": [
      "\nNot to be confused with Styx (band)\n",
      "Butch Engle & the Styx was an American rock band formed in 1963 in Mill Valley, California. Originally named The Showmen, the members were Butch Engle (vocals), Bob Zamora (lead guitar), Mike Pardee (organ), Harry \"Happiness\" Smith (bass), and Rich Morrison (drums). The band released three singles before breaking up in 1968. A compilation album featuring all of the band's recordings, No Matter What You Say: The Best of Butch Engle & the Styx, was released in 2000.\n",
      "Butch Engle formed The Showmen—not to be confused with the 1960s pop group of the same name— in 1963 after he took over and renamed an earlier incarnation of the band, whose roster had included Bill Champlin. \nThe group consisted of Engle, guitarist Bob Zamora, organist Mike Pardee, bassist Harry \"Happiness\" Smith, and drummer Rich Morrison. \nIn 1964 the Showmen released the British Invasion-influenced single \"You Know All I Want\". \nThe band changed their name in 1965 to Butch Engle & the Styx. \nWith the exception of their debut single, all material recorded by the band was written or co-written by Ron Elliott of The Beau Brummels. \nAccording to Engle, \"Ron, Sly Stewart ,  Tom Donahue and Bobby Mitchell would choose which songs would go on  album, and then we could take what we wanted from whatever was left\". \nButch Engle & the Styx released a single, \"I'm a Girl\", in 1966 on the Warner Bros. Records subsidiary, Loma Records. \nThe band shortened their name to The Styx and released another single, \"Hey, I'm Lost\", in 1967, \nbefore breaking up the following year. \nIn 2000, Sundazed Records released No Matter What You Say: The Best of Butch Engle & the Styx, a compilation album which contained the band's three singles—including B-sides—along with 11 previously unreleased recordings. \n\"Hey, I'm Lost\" appeared on the 2007 Love Is the Song We Sing: San Francisco Nuggets 1965–1970 box set.\n"
   ],
   "infobox": {
      "Also known as": [
         "The Showmen, The Styx"
      ],
      "Origin": [
         "Mill Valley, California, United States"
      ],
      "Genres": [
         "Pop rock, folk rock, garage rock"
      ],
      "Years active": [
         "1963–1968"
      ],
      "Past members": [
         "Butch Engle",
         "Rob Zamora",
         "Mike Pardee",
         "Harry \"Happiness\" Smith",
         "Rich Morrison",
         "Larry Gerughty",
         "Barry Lewis"
      ]
   }
}