{
   "Name": "Subseven",
   "rawData": [
      "Subseven (styled as subseven) is a Christian rock band formed in 1999 in Weatherford, Oklahoma. They played in the Midwest for four years as an independent, where they released one album and one EP and gained a large local fan base. In 2003, they signed a record deal with Flicker Records and soon after released subseven: the EP. One year later they released their final album, Free to Conquer. \n",
      "The band's members included Wesley Fite, Clint McManaman, Reed Corbin, Caleb Wilkerson and Jake Sullivan before their breakup in December 2005. Ever since their breakup in 2005, the band members engaged in other musical activities, including bands and solo projects.  In November 2007, their bass guitarist, Reed Corbin, died from a heart attack at the age of 33.\n",
      "In 2015, the band announced that they would be reuiniting.\n"
   ],
   "infobox": {
      "Origin": [
         "Weatherford, Oklahoma, U.S."
      ],
      "Genres": [
         "Christian rock, emo, post-hardcore"
      ],
      "Years active": [
         "1999–2005; 2015-"
      ],
      "Labels": [
         "Flicker Records"
      ],
      "Past members": [
         "Wesley \"Wes\" Fite",
         "Clint McManaman",
         "Shaun Brown",
         "Evan Crowley",
         "Reed Corbin"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] (styled as subseven) is a [GENRE] band formed in [YEAR] in Weatherford, Oklahoma. They played in the Midwest for four years as an independent, where they released one album and one EP and gained a large local fan base. In [YEAR], they signed a record deal with Flicker Records and soon after released subseven: the EP. One year later they released their final album, Free to Conquer. \n",
      "The band's members included Wesley Fite, [PERSON_NAME_FULL_1_MALE], Reed Corbin, [PERSON_NAME_FULL_0_MALE] and Jake Sullivan before their breakup in [MONTH] [YEAR]. Ever since their breakup in [YEAR], the band members engaged in other musical activities, including bands and solo projects.  In [MONTH] [YEAR], their bass guitarist, Reed Corbin, died from a [GENRE]",
      "In [YEAR], the band announced that they would be reuiniting.\n"
   ]
}