{
   "Name": "The Throes (band)",
   "rawData": [
      "The Throes is an indie band formed in 1988 in Northern Virginia.\n",
      "The original lineup consisted of singer and guitarist Bill Campbell, percussionist Harry Evans and bassist Joy Gewalt. Friends from the suburbs of Greater Washington, D.C., the Throes released an independent cassette in 1989, The Era of Condolence, featuring seven songs written by Campbell and Evans of \"youth, love and unanswered questions.\"\n",
      "In 1990, they were the first alternative pop band to sign with R.E.X. Records, an indie label based out of New York City and known mostly for its speed and death metal acts. In September 1990, they released All The Flowers Growing In Your Mother's Eyes. Reviewer J. Edward Keyes wrote, Flowers \"creates moody, dour pop akin to REM and The Smiths\" with \"sparkling guitar\" driven by \"idiosyncratic percussion.\" On the whole, Keyes says, the album is \"charged with the unmistakable energy of possibility, the sound of a young band who still believes they can change the world.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Washington, D.C. and Northern Virginia, U.S."
      ],
      "Genres": [
         "Indie Band"
      ],
      "Years active": [
         "1988–present"
      ],
      "Labels": [
         "R.E.X.",
         "Glasshouse",
         "Rode Dog/BMG",
         "Brainstorm Artists International"
      ],
      "Members": [
         "Bill Campbell",
         "Harry Evans",
         "Jeff Booth",
         "Dean Nitz",
         "Harv Evans"
      ],
      "Past members": [
         "Joy Gewalt",
         "David Lash",
         "David Cooper"
      ]
   },
   "albums": [
      "All the Flowers Growing in Your Mother’s Eyes",
      "Fall on Your World",
      "12 Before 9",
      "Ameroafriasiana"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in [YEAR] in Northern Virginia.\n",
      "The original lineup consisted of singer and guitarist Bill Campbell, percussionist [PERSON_NAME_FULL_0_MALE] and bassist Joy Gewalt. Friends from the suburbs of Greater Washington, D.C., the Throes released an independent cassette in [YEAR], The Era of Condolence, featuring seven songs written by Campbell and [PERSON_NAME_LAST_0] of [SONG_NAME]\n",
      "In [YEAR], they were the first alternative pop band to sign with R.E.X. Records, an indie label based out of New York City and known mostly for its speed and death metal acts. In [MONTH] [YEAR], they released All The Flowers Growing In Your Mother's Eyes. Reviewer J. Edward Keyes wrote, Flowers [SONG_NAME]\n"
   ]
}