{
   "Discography": {},
   "External links": {},
   "Members": {},
   "References": {},
   "Sections": [
      "1 Discography",
      "2 Members",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "\nTwothirtyeight was an American indie rock band from Pensacola, Florida. They were active from 1995 to 2003, though they have reunited for performances in the years since their disbandment. \n",
         "Formed in 1995, Twothirtyeight released three independently produced EP albums before signing with the now-defunct Takehold Records.  In 1999, Twothirtyeight released their first full-length album Missing You Dearly on Takehold Records.  The band line-up featured Chris Staples, Kevin Woerner, Owen Grabo, and DJ Stone. The album was dedicated to Kevin Glass, the band's former bass guitarist, who died in a tragic car accident in 1997. Weeks before Glass was killed, he taught Owen Grabo the bass parts for most of the songs in the band's catalogue.\n",
         "In 2000, with Owen Grabo having left the band, Twothirtyeight recorded their next EP, Matter Has a Breaking Point, as a three-piece outfit with Chris Staples on bass guitar and lead vocals. With the addition of Jake Brown, former frontman of the band Driven, on bass guitar, Twothirtyeight wrote and recorded their second full-length album Regulate the Chemicals.  Chris Carrabba, notable as the former lead vocalist of Further Seems Forever and principal artist of Dashboard Confessional, contributed backing vocals to two of the songs from Regulate the Chemicals, \"This Town Will Eat You\" and \"Coin Laundry Loser.\"  Following the album's release DJ Stone, who had played drums for the group since the beginning, left the group to focus on his family.  Regulate the Chemicals was released on Takehold Records and followed by a summer of extensive touring. In January 2001, Jake Brown left the band.\n",
         "In 2002, Takehold was acquired by Tooth & Nail Records, and the record label would re-release the band's second album, remastered with additional tracks added. You Should Be Living, was the group's final album.\n",
         "In April 2003, Twothirtyeight officially disbanded. Lead vocalist Chris Staples went on to front the indie rock band Discover America and embarked on a solo career. \n",
         "On April 17, 2012, Chris Staples announced via his official Facebook page that Twothirtyeight would be reuniting to play the Deluna Festival in Pensacola, Florida, which took place September 21 to 23, 2012.[1][non-primary source needed][2] The band fully reunited on September 21 to play a show in Atlanta,[3] followed by an appearance at Deluna Festival on the 23rd, and a special-late night show in Pensacola the same night.[4][non-primary source needed]\n"
      ]
   },
   "Title": "Twothirtyeight - Wikipedia"
}