{
   "Compilation Contributions": {},
   "Discography": {},
   "External links": {},
   "References": {},
   "Sections": [
      "1 Discography",
      "2 Compilation Contributions",
      "3 References",
      "4 External links",
      "5 Wikipedia Updates"
   ],
   "Summary": {
      "text": [
         "The Waiting is a Christian alternative pop rock band, consisting of Brad Olsen (vocals), Todd Olsen (guitar), Clark Leake (bass), and Brandon Thompson (drums, percussion, loops). Since the members focus time on other aspects of their lives and take their time recording the band does not produce and perform as frequently as some other bands.\n",
         "Early albums by \"The Waiting\" were guitar driven alternative rock that drew fans with clever songwriting and introspective lyrics that stood out from most Christian rock of the day.  The band's later albums moved towards a more polished pop sound.\n",
         "In August 2003, The Waiting hit the stage in Georgia where they played a sold-out show after which they quit touring full-time to be at home more and pursue other endeavors. Even though they do not tour full-time, they never officially broke up. The Waiting still plays occasional spot dates.\n",
         "In May 2009 Brad Olsen released his solo album titled The More I Think I Understand The Less I Can Explain, It was produced by \"Oats\", aka Todd Olsen. Brad Olsen continues to write and record music. He resides in Atlanta, GA with his family. He is available for booking.\n",
         "Todd Olsen also resides in Atlanta where he works as a music producer. In November 2011, he released a solo album under his nickname \"Oats\" entitled A Tear and a Sneer.\n",
         "Clark Leake received a Masters in Theology from St. Vladimir Orthodox Seminary in May 2007. He lives in Louisville, KY with his wife.\n",
         "Brandon Thompson resides in the Atlanta Georgia area with his wife and two sons and has produced a couple of bands in his home studio as well as taking a job at Mount Paran North Church of God in Marietta, GA, at which he remained until mid-2006. In 2006, Brandon moved to another local church, His Hands Church where he was the Technical Director. In 2011 Brandon became the main auditorium Production Director for Woodstock City Church, (formerly Watermarke Church), a campus of North Point Ministries in Woodstock, GA. Brandon maintains and occasionally updates his personal website at BranThomps.com, btec.cc, wazzit.com and his wife's personal page TeaTimeWithTiffany.com and TeaOfLifePodcast.com. He can be found on Twitter at @BranThomps.\n",
         "Latest Release: In 2010, The Waiting announced that they had been working on a new album and released a new single, \"Name\" and were playing limited spot dates. In 2011, the band released three more singles. In June 2012, the new album Mysteriet became fully funded by 119 backers on Kickstarter, when it was estimated to release in September 2012.[1] The band's last Facebook entry (as of April 2016), written by Todd Olson on March 23, 2016 stated that Brad Olson is doing vocals for the album (Todd mailed him a mic). In 2013, Todd said, \"our new album Mysteriet is written but we are still working on getting the music right- no surprise bc how does one make music that evokes the mystery and majesty of the Trinity? I can best describe what we are doing by saying what we are not doing. We are NOT making a follow up to wonderfully made or unfazed- tho unfazed was very successful. what we are attempting to do is make a follow up to the song Hands In The Air musically and spiritually. if we are making a follow up at all.\"[2]  \"Mysteriet\" is the Norwegian word for \"The Mystery\". This is quite fitting, since the actual release date of the band's first album in over twelve years has yet to be announced.[3]\n"
      ]
   },
   "Title": "The Waiting (band) - Wikipedia",
   "Wikipedia Updates": {}
}