{
   "Name": "Blossom Toes",
   "rawData": [
      "Blossom Toes were a British psychedelic pop band active between 1966 and 1970. Initially known as The Ingoes, they were renamed and signed to the Marmalade record label of manager Giorgio Gomelsky. The original line-up comprised Brian Godding (born 19 August 1945, Monmouth, South Wales) (guitar, vocals, keyboards), Jim Cregan (born James Cregan, 9 March 1946, Yeovil, Somerset) (guitar, vocals), Brian Belshaw (born 25 February 1944, Wigan, Lancashire) (bass, vocals), and Kevin Westlake (born Kevin Patrick Westlake, 5 March 1947, Dublin, Co Dublin, Ireland (drums).\n",
      "The band's debut album, We Are Ever So Clean is a classic example of quintessentially English psychedelia. On release, it was presented in the UK music magazine Melody Maker as \"Giorgio Gomelsky's Lonely Hearts Club Band\". Although not a major commercial success, tracks such as \"What On Earth\" or \"Look At Me, I'm You\" have helped give the album something of a cult period status as it is unearthed by successive generations of 1960s retro fans. It was included in Record Collector's list of the \"100 Greatest Psychedelic Records\".\n",
      "If Only For A Moment saw the band taking a noticeably heavier and rockier direction, with Cregan and Godding's distinctive two-part guitar harmonies playing a prominent role. At this point Westlake left, and was replaced by John \"Poli\" Palmer, and then Barry Reeves.\n"
   ],
   "infobox": {
      "Origin": [
         "London, England"
      ],
      "Genres": [
         "Psychedelic rock, acid rock, freakbeat, hard rock"
      ],
      "Years active": [
         "1966–1970"
      ],
      "Labels": [
         "Marmalade (Polydor)"
      ],
      "Associated acts": [
         "Family, B.B. Blunder"
      ],
      "Website": [
         "blossomtoes.co.uk"
      ],
      "Past members": [
         "Brian Godding",
         "Jim Cregan",
         "Brian Belshaw",
         "Kevin Westlake",
         "John \"Poli\" Palmer",
         "Barry Reeves"
      ]
   }
}