{
   "Name": "King Crimson",
   "rawData": [
      "King Crimson are  an English progressive rock band formed in London in 1968. They have exerted a strong influence both on the early 1970s progressive rock movement and on more recent rock and experimental artists. Although the band has consistently undergone changes in personnel throughout its history, guitarist and primary composer Robert Fripp, the only remaining founding member, has acted as a driving creative force. Though he is often seen as the band's leader, Fripp himself tends to shun this label. King Crimson has earned a large cult following. They were ranked No. 87 on VH1's 100 Greatest Artists of Hard Rock. Although initially considered a seminal force in progressive rock (a genre originally characterised by lengthy compositions featuring extended instrumental sections), Fripp in particular has often distanced himself from the genre: King Crimson has drawn influence from a wide variety of genres and approaches. Classical music, jazz, folk, heavy metal, gamelan and experimental music have all been reinterpreted and explored by the band, and they have exerted influence on several generations of progressive, psychedelic, alternative metal, hardcore and noise bands and composers.\n",
      "Developed from the unsuccessful psychedelic pop trio Giles, Giles and Fripp, the initial King Crimson were key to the formation of early progressive rock, strongly influencing and altering the music of contemporaries such as Yes and Genesis. Their debut album, In the Court of the Crimson King (1969), remains their most successful and influential release, with its elements of jazz, classical and experimental music. Their success increased following an opening act performance for the Rolling Stones at Hyde Park, London, in 1969. Following In the Wake of Poseidon (1970) and the less successful chamber jazz-inspired Lizard (1970), and Islands (1971), the group reformatted and changed their instrumentation (swapping out saxophone in favour of violin and unusual percussion) in order to develop their own take on European rock improvisation, reaching a new creative peak on Larks' Tongues in Aspic (1973), Starless and Bible Black (1974) and Red (1974). Fripp disbanded the group in 1974.\n",
      "In 1981, King Crimson reformed with another change in musical direction and instrumentation (incorporating, for the first time, a mixture of British and American personnel plus doubled guitar and influences taken from gamelan, post-punk and New York minimalism as well was tape loop system). This lasted for three years, resulting in the trio of albums Discipline (1981), Beat (1982) and Three of a Perfect Pair (1984). Following a decade-long hiatus, Fripp revived the group as an expanded \"Double Trio\" sextet in 1994, mingling its mid-'70s and 1980s approaches with new creative options available via MIDI technology. This resulted in another three-year cycle of activity including the release of Thrak (1995). King Crimson reunited again in 2000 as a more industrial-oriented quartet (or \"Double Duo\"), releasing The Construkction of Light in 2000 and The Power to Believe in 2003: after further personnel shuffles, the band expanded to a double-drummer quintet for a 2008 tour celebrating their 40th anniversary.\n"
   ],
   "infobox": {
      "Origin": [
         "London, England"
      ],
      "Genres": [
         "Progressive rock",
         "art rock",
         "post-progressive"
      ],
      "Years active": [
         "1968–1974",
         "1981–1984",
         "1994–2003",
         "2008–2009",
         "2013–present"
      ],
      "Labels": [
         "Island",
         "Atlantic",
         "Vertigo",
         "Polydor",
         "EG",
         "Virgin",
         "Warner Bros.",
         "Caroline",
         "Discipline Global Mobile"
      ],
      "Associated acts": [
         "Giles, Giles and Fripp",
         "Emerson, Lake & Palmer",
         "Yes",
         "McDonald and Giles",
         "U.K.",
         "ProjeKcts",
         "21st Century Schizoid Band",
         "Porcupine Tree",
         "HoBoLeMa",
         "Crimson Jazz Trio",
         "Asia"
      ],
      "Website": [
         "dgmlive.com"
      ],
      "Members": [
         "Robert Fripp",
         "Mel Collins",
         "Tony Levin",
         "Pat Mastelotto",
         "Gavin Harrison",
         "Jakko Jakszyk",
         "Jeremy Stacey"
      ],
      "Past members": [
         "Peter Sinfield",
         "Greg Lake",
         "Michael Giles",
         "Ian McDonald",
         "Gordon Haskell",
         "Andy McCulloch",
         "Ian Wallace",
         "Boz Burrell",
         "Bill Bruford",
         "John Wetton",
         "David Cross",
         "Jamie Muir",
         "Adrian Belew",
         "Trey Gunn",
         "Bill Rieflin"
      ]
   }
}