{
   "Name": "The Charlatans (American band)",
   "rawData": [
      "The Charlatans were an American folk rock and psychedelic rock band that played a role in the development of the San Francisco Haight-Ashbury music scene during the 1960s. They are often cited by critics as being the first group to play in the style that became known as the San Francisco Sound.\n",
      "Exhibiting more pronounced jug band, country and blues influences than many bands from the same scene, the Charlatans' rebellious attitude and distinctive late 19th-century fashions exerted a strong influence on the Summer of Love in San Francisco. The band's recorded output was small. Following difficulties with various record labels, their only album, The Charlatans, was recorded and released by a reconstituted lineup (with only two members of the original group) in 1969.\n",
      "Original drummer Dan Hicks went on to form Dan Hicks & His Hot Licks, a more commercially successful ensemble that amalgamated elements of country, folk and jazz in a predominantly acoustic setting.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, U.S."
      ],
      "Genres": [
         "Folk rock[2]",
         "psychedelic rock[3]",
         "acid rock[4]",
         "blues[5]"
      ],
      "Years active": [
         "1964–1969",
         "1997",
         "2005",
         "2015"
      ],
      "Labels": [
         "Kapp",
         "Philips"
      ],
      "Associated acts": [
         "Dan Hicks and his Hot Licks",
         "Loose Gravel",
         "Tongue and Groove",
         "The Flamin' Groovies"
      ],
      "Past members": [
         "George Hunter",
         "Richard Olsen",
         "Mike Wilhelm",
         "Mike Ferguson",
         "Dan Hicks",
         "Sam Linde",
         "Patrick Gogerty",
         "Terry Wilson",
         "Darrell DeVore"
      ]
   },
   "albums": [
      "The Charlatans"
   ],
   "prunedData": [
      "[BAND_NAME] were an [GENRE] band that played a role in the development of the San Francisco Haight-Ashbury music scene during the [YEAR]s. They are often cited by critics as being the first group to play in the style that became known as the San Francisco Sound.\n",
      "Exhibiting more pronounced jug band, country and blues influences than many bands from the same scene, the Charlatans' rebellious attitude and distinctive late 19th-century fashions exerted a [GENRE] band's recorded output was small. Following difficulties with various record labels, their only album, [BAND_NAME], was recorded and released by a reconstituted lineup (with only two members of the original group) in [YEAR].\n",
      "Original drummer Dan Hicks went on to form Dan Hicks & His Hot Licks, a [GENRE] a predominantly acoustic setting.\n"
   ]
}