{
   "Name": "Pentangle (band)",
   "rawData": [
      "Pentangle (or The Pentangle) are a British folk-jazz band with an eclectic mix of folk, jazz, blues and folk rock influences. The original band was active in the late 1960s and early 1970s, and a later version has been active since the early 1980s. The original line-up, which was unchanged throughout the band's first incarnation (1967–1973), was: Jacqui McShee (vocals); John Renbourn (vocals and guitar); Bert Jansch (vocals and guitar); Danny Thompson (double bass); and Terry Cox (drums).\n",
      "The name Pentangle was chosen to represent the five members of the band, and is also the device on Sir Gawain's shield in the Middle English poem Sir Gawain and the Green Knight which held a fascination for Renbourn.\n",
      "In 2007, the original members of the band were reunited to receive a Lifetime Achievement award at the BBC Radio 2 Folk Awards and to record a short concert that was broadcast on BBC radio. The following June, all five original members embarked on a twelve-date UK tour.\n"
   ],
   "infobox": {
      "Also known as": [
         "Jacqui McShee's Pentangle"
      ],
      "Origin": [
         "United Kingdom"
      ],
      "Genres": [
         "Folk-jazz",
         "folk",
         "folk rock",
         "British folk rock",
         "folk baroque"
      ],
      "Years active": [
         "1967–1973; 1981–present"
      ],
      "Labels": [
         "Transatlantic, Warner Bros./Reprise"
      ],
      "Associated acts": [
         "The John Renbourn Group"
      ],
      "Members": [
         "Jacqui McShee",
         "Gerry Conway",
         "Spencer Cozens",
         "Alan Thomson",
         "Gary Foote"
      ],
      "Past members": [
         "Bert Jansch",
         "Terry Cox",
         "Danny Thompson",
         "John Renbourn",
         "Mike Piggott",
         "Nigel Portman Smith",
         "Rod Clements",
         "Peter Kirtley",
         "Jerry Underwood"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (or The [BAND_NAME]) are a [GENRE] band with an eclectic mix of folk, jazz, blues and folk rock influences. The original band was active in the late [YEAR]s and early [YEAR]s, and a later version has been active since the early [YEAR]s. The original line-up, which was unchanged throughout the band's first incarnation ([YEAR]–[YEAR]), was: [PERSON_NAME_FULL_1_FEMALE] (vocals); John Renbourn (vocals and guitar); Bert [MONTH]sch (vocals and guitar); [PERSON_NAME_FULL_0_MALE] (double bass); and Terry Cox (drums).\n",
      "The name [BAND_NAME] was chosen to represent the five members of the band, and is also the device on Sir Gawain's shield in the Middle English poem Sir Gawain and the Green Knight which held a [GENRE]",
      "In [YEAR], the original members of the band were reunited to receive a [GENRE] a short concert that was broadcast on BBC radio. The following [MONTH], all five original members embarked on a twelve-date UK tour.\n"
   ]
}