{
   "Awards": {
      "text": [
         "In January 2007, the five original members of Pentangle were presented with a Lifetime Achievement award at the BBC Radio 2 Folk Awards by David Attenborough. Producer John Leonard said \"Pentangle were one of the most influential groups of the late 20th century and it would be wrong for the awards not to recognise what an impact they had on the music scene.\" Pentangle played together for the event, for the first time in over 20 years. Their performance was broadcast on BBC Radio 2 on Wednesday 7 February 2007.[34]\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Compilations": {},
      "DVDs": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "Commercial success": {
         "text": [
            "The first public concert by Pentangle was a sell-out performance at the Royal Festival Hall, on 27 May 1967.  Later that year, they undertook a short tour of Denmark — in which they were disastrously billed as a rock'n'roll band — and a short UK tour, organised by Nathan Joseph of Transatlantic Records. By this stage, their association with Bruce Dunnett had ended and, early in 1968, they acquired Jo Lustig as a manager. With his influence, they graduated from clubs to concert halls and from then on, as Colin Harper puts it, \"the ramshackle, happy-go-lucky progress of the Pentangle was going to be a streamlined machine of purpose and efficiency\".[8]\n",
            "Pentangle signed up with Transatlantic Records and their eponymous debut LP was released in May 1968. This all-acoustic album was produced by Shel Talmy, who has claimed to have employed an innovative approach to recording acoustic guitars to deliver a very bright \"bell-like\" sound.[9] On 29 June of that year they performed at London's Royal Festival Hall. Recordings from that concert formed part of their second album, Sweet Child (released in November 1968), a double LP comprising live and studio recordings.\n",
            "Basket of Light, which followed in mid-1969, was their greatest commercial success, thanks to a surprise hit single, \"Light Flight\" which became popular through its use as theme music for the television series Take Three Girls (the BBC's first drama series to be broadcast in colour) for which the band also provided incidental music.[10] The album went all the way to number five in the charts.[11] By 1970, they were at the peak of their popularity, recording a soundtrack for the film Tam Lin, making at least 12 television appearances, and undertaking tours of the UK (including the Isle of Wight Festival) and America (including a concert at the Carnegie Hall).[12] However, their fourth album, Cruel Sister, released in October 1970, was a commercial disaster.[13] This was an album of traditional songs that included a 18 1/2-minute-long version of \"Jack Orion\", a song that Jansch and Renbourn had recorded previously as a duo. It failed to go higher than number 51 in the charts.[11]\n"
         ]
      },
      "Continued interest in the original band": {
         "text": [
            "Whilst the new Pentangle incarnations and personnel changes took the band in various musical directions, interest in the original Pentangle line-up continued, with at least nineteen compilation albums being released between 1972 and 2016. For example, in 2007 The Time Has Come 1967 – 1973 was issued. It is a 4-CD collection of rarities, outtakes and live performances. The liner notes were by Colin Harper and Pete Paphides.\n",
            "In 2004, the 1968–1972 Lost Broadcasts album was released. Jo Lustig's influence had secured numerous radio appearances for the band — at least eleven broadcasts by the BBC in 1968, for example.[23] The album was a 2-CD compilation of recordings from these sessions. It includes a recording of \"The Name of the Game\", which had been used by the BBC as a theme song for some of the Pentangle broadcasts, but had never appeared on record.\n",
            "The original Pentangle formally reformed in 2008. They appeared on the BBC TV music programme Later... with Jools Holland on 29 April 2008, with \"Let No Man Steal Your Thyme\", and on 2 May 2008, performing \"Light Flight\" and \"I've Got a Feeling\". They went on to undertake a UK tour, including a return to the Royal Festival Hall, where they had recorded the Sweet Child album forty years earlier. They went on to headline at the Green Man Festival in August 2008.  The live double-CD album Finale - An Evening with Pentangle contains 21 songs recorded during their 2008 tour, and was released by Topic Records in October 2016.[24]\n",
            "In 2011 the original Pentangle played some limited concerts (including RFH, Glastonbury and Cambridge). There were delays in playing again due to Jansch's throat cancer. The band recorded new material in 2011. Bert Jansch died of cancer on 5 October 2011, aged 67.[25]  John Renbourn was found dead at his home on 26 March 2015 after a suspected heart attack.[26]\n",
            "Film director, Ben Wheatley included Pentangle's song \"Let No Man Steal Your Thyme\" in the Netflix adaptation of Rebecca_(2020_film).\n"
         ]
      },
      "Formation": {
         "text": [
            "The original group formed in 1967. Renbourn and Jansch were already popular musicians on the British folk scene, with several solo albums each and a duet LP, Bert and John. Their use of complex inter-dependent guitar parts, referred to as \"folk baroque\", had become a distinctive characteristic of their music. They also shared a house in St John's Wood, London.[3]\n",
            "Jacqui McShee had begun as an (unpaid) \"floor singer\" in several of the London folk clubs, and then, by 1965, ran a folk club at the Red Lion in Sutton, Surrey, establishing a friendship with Jansch and Renbourn when they played there. She sang on Renbourn's Another Monday album and performed with him as a duo, debuting at Les Cousins club in August 1966.[4]\n",
            "Thompson and Cox were well known as jazz musicians and had played together in Alexis Korner's band. By 1966, they were both part of Duffy Power's Nucleus (a band which also included John McLaughlin on electric guitar). Thompson was well-known to Renbourn through appearances at Les Cousins and working with him on a project for television.[5]\n",
            "In 1967, the Scottish entrepreneur Bruce Dunnet, who had recently organised a tour for Jansch, set up a Sunday night club for him and Renbourn at the (now defunct) Horseshoe Hotel in Tottenham Court Road.[6] McShee began to join them as a vocalist and, by March of that year, Thompson and Cox were being billed as part of the band. Renbourn claims to be the \"catalyst\" that brought the band together but credits Jansch with the idea \"to get the band to play in a regular place, to knock it into shape\".[7]\n",
            "Although nominally a 'folk' group, the members shared catholic tastes and influences. McShee had a grounding in traditional music, Cox and Thompson a love of jazz, Renbourn a growing interest in early music, and Jansch a taste for blues and contemporaries such as Bob Dylan.\n"
         ]
      },
      "Jacqui McShee's Pentangle": {
         "text": [
            "In 1995, McShee formed a trio with Conway on percussion and Spencer Cozens on keyboards. The trio's first album, About Thyme, featured guests Ralph McTell, Albert Lee, Mike Mainieri, and John Martyn. The album reached the top of fRoots magazine's British folk chart. The album was released on their own label – GJS (Gerry Jacqui Spencer). With the addition of saxophonist Jerry Underwood and bassist/guitarist Alan Thomson, the band was renamed (with the agreement of the original Pentangle members) Jacqui McShee's Pentangle. The new five-piece band's first album Passe Avant was released on the Park Records label in 1998. Their April 2000 concert at Chipping Norton, Oxfordshire was recorded and released by Park Records under the title At the Little Theatre. \n",
            "In August 2002, saxophonist Jerry Underwood died after an illness. His place in Jacqui McShee's Pentangle was taken by flautist/saxophonist Gary Foote[21] in 2004.  In 2005, they released Feoffees' Lands, (a feoffee is a medieval term for a trustee) on GJS. The 2011 album Live In Concert, released on GJS Records, features several of their best performances over the years between 1997 and 2011.\n",
            "The \"new\" 2002 Jacqui McShee's Pentangle line-up continued to play regularly in Great Britain in most years from 2002 through the present, as of 2018.[22]\n"
         ]
      },
      "Later years of original band": {
         "text": [
            "The band returned to a mix of traditional and original material on Reflection, recorded in March 1971. This was received without enthusiasm by the music press. By this time, the strains of touring and of working together as a band were readily apparent. Bill Leader, who produced the album, said \"It seems to me, in retrospect, that each day a different member of the group had decided that this was it: 'Sod this for a game of soldiers, I'm leaving the group!'\"[14] Pentangle withdrew from Transatlantic, in a bitter dispute with Joseph regarding royalties. Transatlantic had apparently concluded that they were within their contractual rights to withhold royalty payments from the Pentangle albums.[15] Joseph pointed out that his company had covered all the costs, such as recording costs, entailed in making the albums.[16] Jo Lustig, their manager, who had agreed to the Transatlantic contract, made it clear that their contract with him included a clause that they could not sue him \"for anything under any circumstances.\"[17] In order to make some money out of the work they were doing, Pentangle established their own music publishing company, Swiggeroux Music, in 1971.\n",
            "The final album of the original lineup was Solomon's Seal, released by Warner Brothers/Reprise in 1972. Its release was accompanied by a UK tour, in which Pentangle were supported by Wizz Jones and Clive Palmer's band COB. The last few dates of the tour had to be cancelled owing to Thompson becoming ill.\n",
            "On New Year's Day, 1973, Jansch decided to leave the band. \"Pentangle Split\" was the front-page headline of the first issue of Melody Maker of the year.[18]\n"
         ]
      },
      "Subsequent incarnations": {
         "text": [
            "In the early 1980s, a reunion of the band was planned. By this time, Jansch and Renbourn had re-established their solo careers, McShee had a young family, Thompson was mainly doing session work, and Cox was running a restaurant in Minorca. The re-formed Pentangle debuted at the 1982 Cambridge Folk Festival, but without a drummer, as Cox had broken his leg in a road accident. They completed a tour of Italy, Australia and some venues in Germany, with Cox initially playing in a wheelchair.[19]\n",
            "Renbourn left the band to pursue a long-term ambition of studying classical music, taking up a place at Dartington College of Arts. There then followed a series of replacement personnel. Mike Piggott replaced Renbourn in 1982, and subsequently Nigel Portman Smith replaced Thompson and Gerry Conway (who had worked with Fotheringay, Cat Stevens, Jethro Tull, Richard Thompson and John Martyn) replaced Cox (in 1986 and 1987 respectively); leaving McShee and Jansch as the only remaining members from the original line-up. In 1989 Rod Clements of Lindisfarne fame replaced Piggott before he left and Peter Kirtley assumed the role of guitarist in the following year. The incarnation consisting of Jansch, McShee, Portman Smith, Kirtley and Conway survived almost as long as the original Pentangle and recorded three albums: Think of Tomorrow, One More Road and Live 1994. This line-up completed their final tour in March–April 1995, after which Jansch left to pursue his solo work, particularly his residency at the 12 Bar Club in London's Denmark Street.[20]\n"
         ]
      }
   },
   "Members": {
      "text": [
         "\n",
         "\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation",
      "1.2 Commercial success",
      "1.3 Later years of original band",
      "1.4 Subsequent incarnations",
      "1.5 Jacqui McShee's Pentangle",
      "1.6 Continued interest in the original band",
      "2 Style",
      "3 Awards",
      "4 Members",
      "5 Discography",
      "5.1 Albums",
      "5.2 Singles",
      "5.3 Compilations",
      "5.4 DVDs",
      "6 References",
      "7 External links"
   ],
   "Style": {
      "text": [
         "Pentangle are often characterised as a folk-rock band. Danny Thompson preferred to describe the group as a \"folk-jazz band.\"[27] John Renbourn also rejected the \"folk-rock\" categorisation, saying, \"One of the worst things you can do to a folk song is inflict a rock beat on it. . . Most of the old songs that I have heard have their own internal rhythm. When we worked on those in the group, Terry Cox worked out his percussion patterns to match the patterns in the songs exactly. In that respect he was the opposite of a folk-rock drummer.\"[28] This approach to songs led to the use of unusual time signatures: \"Market Song\" from Sweet Child moves from 7/4 to 11/4 and 4/4 time,[29] and \"Light Flight\" from Basket of Light includes sections in 5/8, 7/8 and 6/4.[30]\n",
         "Writing in The Times, Henry Raynor struggled to characterise their music: \"It is not a pop group, not a folk group and not a jazz group, but what it attempts is music which is a synthesis of all these and other styles as well as interesting experiments in each of them individually.\"[31] Even Pentangle's earliest work is characterised by that synthesis of styles. Songs such as \"Bruton Town\" and \"Let No Man Steal Your Thyme\" from 1968's The Pentangle include elements of folk, jazz, blues, and early music. Pete Townshend described their sound as \"fresh and innovative.\"[32] By the release of their fourth album, Cruel Sister, in 1970, Pentangle had moved closer to traditional folk music and begun using electric guitars. By this time, folk music had itself moved towards rock and the use of electrified instruments, so Cruel Sister invited comparison with such works as Fairport Convention's Liege and Lief and Steeleye Span's Hark! The Village Wait. Pentangle is thus often described as one of the progenitors of British folk rock.[33]\n",
         "In their final two albums, Pentangle returned to their folk-jazz roots, but by then the predominant musical taste had moved to British folk rock. Colin Harper commented that Pentangle's \"increasingly fragile music was on borrowed time and everyone knew it.\"[17]\n"
      ]
   },
   "Summary": {
      "text": [
         "Pentangle (or The Pentangle[1]) are a British folk-jazz band with an eclectic mix of folk, jazz, blues and folk rock influences. The original band was active in the late 1960s and early 1970s, and a later version has been active since the early 1980s. The original line-up, which was unchanged throughout the band's first incarnation (1967–1973), was: Jacqui McShee (vocals); John Renbourn (vocals and guitar); Bert Jansch (vocals and guitar); Danny Thompson (double bass); and Terry Cox (drums).\n",
         "The name Pentangle was chosen to represent the five members of the band, and is also the device on Sir Gawain's shield in the Middle English poem Sir Gawain and the Green Knight which held a fascination for Renbourn.[2]\n",
         "In 2007, the original members of the band were reunited to receive a Lifetime Achievement award at the BBC Radio 2 Folk Awards and to record a short concert that was broadcast on BBC radio. The following June, all five original members embarked on a twelve-date UK tour.\n"
      ]
   },
   "Title": "Pentangle (band) - Wikipedia"
}