{
   "Name": "Gnidrolog",
   "rawData": [
      "Gnidrolog was a British progressive rock band, with a sound that was compared with better known bands such as Van der Graaf Generator, Jethro Tull and Gentle Giant.\n",
      "The band was founded in 1969 by twin brothers Colin and Stewart Goldring, who were joined by drummer Nigel Pegrum from Spice (the band that would later evolve into Uriah Heep) and Peter \"Mars\" Cowling on bass. John Earle joined the band on sax and flute for their second album.  They came up with the strange band name by reversing and slightly rearranging the brothers' surname, adding in an extra 'o'.  In May 1972, the British music magazine NME reported that Gnidrolog was to appear at the Great Western Express Lincoln Festival on 26 May that year.  Other acts to perform in the Giants of Tomorrow marquee included Budgie, Skin Alley, Tea & Symphony, John Martyn, and Warhorse.  In 1972, Gnidrolog released both their first and second albums, In Spite of Harry's Toe-Nail and Lady Lake, before disbanding due to a lack of commercial success.  Despite having played gigs with fairly well known acts such as David Bowie,  Colosseum, King Crimson, Gentle Giant, Wishbone Ash, Soft Machine, and Magma in their brief career, they have always remained relatively obscure.\n",
      "Cowling began working with Pat Travers in 1975, and was able to achieve a respectable amount of success during his long relationship with Travers.\n"
   ],
   "infobox": {
      "Origin": [
         "London, England"
      ],
      "Genres": [
         "Progressive rock, art rock, experimental rock, folk rock"
      ],
      "Years active": [
         "1969 (1969)–1972, 1999 (1999)–2000"
      ],
      "Labels": [
         "Snails Records, RCA, Audio Archives"
      ],
      "Associated acts": [
         "Pork Dukes, Spice, Pat Travers, Steeleye Span, The Small Faces, Lee Grant And The Capitols, The Syndicate, The Flying Hat Band, Maddy Prior"
      ],
      "Past members": [
         "Stewart Goldring",
         "Colin Goldring",
         "Nigel Pegrum",
         "John Earle",
         "Peter \"Mars\" Cowling",
         "Rick Kemp",
         "Nessa Glen"
      ]
   },
   "albums": [
      "In Spite of Harry's Toenail",
      "Lady Lake",
      "Live 1972",
      "Gnosis"
   ],
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band, with a sound that was compared with better known bands such as Van der Graaf Generator, Jethro Tull and Gentle Giant.\n",
      "The band was founded in [YEAR] by twin brothers Colin and Stewart Goldring, who were joined by drummer [PERSON_NAME_FULL_1_MALE] from Spice (the band that would later evolve into Uriah Heep) and Peter [SONG_NAME] Cowling on bass. [PERSON_NAME_FULL_0_MALE] joined the band on sax and flute for their second album.  They came up with the strange band name by reversing and slightly rearranging the brothers' surname, adding in an extra 'o'.  In [MONTH] [YEAR], the British music magazine NME reported that [BAND_NAME] was to appear at the Great Western Express Lincoln Festival on 26 [MONTH] that year.  Other acts to perform in the Giants of Tomorrow marquee included Budgie, Skin Alley, Tea & Symphony, [PERSON_NAME_FIRST_0] [MONTH]tyn, and Warhorse.  In [YEAR], [BAND_NAME] released both their first and second albums, In Spite of Harry's Toe-Nail and Lady Lake, before disbanding due to a lack of commercial success.  Despite having played gigs with fairly well known acts such as David Bowie,  Colosseum, King Crimson, Gentle Giant, Wishbone Ash, Soft Machine, and Magma in their brief career, they have always remained relatively obscure.\n",
      "Cowling began working with Pat Travers in [YEAR], and was able to achieve a [GENRE]"
   ]
}