{
   "Name": "Bullet (band)",
   "rawData": [
      "Bullet was a one-hit wonder American rock band. Their only hit, \"White Lies, Blue Eyes\", peaked at #28 on the Billboard Hot 100 chart in January 1972. \n",
      "According to vocalist Ernie Sorrentino, he was asked to provide a lead vocal for the Lanny Lambert and Bobby Flax song, \"White Lies, Blue Eyes,\" which had been recorded with studio instrumentalists some weeks before with Flax and Lambert singing harmony vocals. The producers, satisfied with the result, asked Sorrentino to record \"Changes of Mind\" for the B side, a song that he and drummer Mike Micara had written for their current band. The record was released on the Big Tree Records label under the name \"Bullet\" in December 1971. As \"White Lies\" quickly ran up the charts, guitarist Paul Granato was recruited along with keyboard/trumpet player Roget Pontbriand, and other members of the New York band Riverside Drive, to fill out a touring band. Pontbriand relates that \"a booking agent named John Apostle was asked to put a band together. At that time, I had been playing with Joey Stann and the late George Ruiz at an upper-Manhattan club called Churchill's Plum. John knew us and asked us to be part of Bullet along with Sorrentino and a drummer named Mike Micara. ... We shot the promotional photos for Bullet in Central Park the day after we met Ernie.\" The new band appeared on American Bandstand on March 11, 1972 performing \"White Lies\" and \"Willpower Weak, Temptation Strong.\"\n",
      "Although the group toured for two years and recorded three more singles, only \"Willpower Weak, Temptation Strong,\" another Lambert and Flax song, broke into the Billboard Top 100. Bullet disbanded some time before 1975. Pontbriand later played trombone for K.C. and the Sunshine Band and trumpet for Wild Cherry, and is now Director of the Popular Music in the Music Department of Palm Beach Atlantic University in West Palm Beach, FL. Micara went on to record and tour with Gary U.S. Bonds and play drums on film soundtracks before changing careers to public-school teaching. He died in 2017. Granato and Sorrentino are both musically active in South Florida. Stann performs in Edison, NJ with the artist Southside Johnny.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1971 (1971)-1972 (1972)"
      ],
      "Labels": [
         "Big Tree Records"
      ],
      "Past members": [
         "Ernie Sorrentino ",
         " Paul Granato ",
         " Mike Micara ",
         " Roget Pontbriand ",
         "  George Ruiz ",
         " Joey Stann"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band. Their only hit, \"White Lies, Blue Eyes\", peaked at #28 on the Billboard Hot 100 chart in [MONTH] [YEAR]. \n",
      "According to vocalist [PERSON_NAME_FULL_2_MALE], he was asked to provide a lead vocal for the Lanny Lambert and Bobby Flax song, \"White Lies, Blue Eyes,\" which had been recorded with studio instrumentalists some weeks before with Flax and Lambert singing harmony vocals. The producers, satisfied with the result, asked [PERSON_NAME_LAST_2] to record \"Changes of Mind\" for the B side, a song that he and drummer Mike Micara had written for their current band. The record was released on the Big Tree Records label under the name \"[BAND_NAME]\" in [MONTH] [YEAR]. As \"White Lies\" quickly ran up the charts, guitarist [PERSON_NAME_FULL_0_MALE] was recruited along with keyboard/trumpet player Roget Pontbriand, and other members of the New York band Riverside Drive, to fill out a touring band. Pontbriand relates that \"a booking agent named John Apostle was asked to put a band together. At that time, I had been playing with [PERSON_NAME_FULL_1_MALE] and the late George Ruiz at an upper-Manhattan club called Churchill's Plum. John knew us and asked us to be part of [BAND_NAME] along with [PERSON_NAME_LAST_2] and a drummer named Mike Micara. ... We shot the promotional photos for [BAND_NAME] in Central Park the day after we met [PERSON_NAME_FIRST_2].\" The new band appeared on American Bandstand on [MONTH] 11, [YEAR] performing \"White Lies\" and \"Willpower Weak, Temptation Strong.\"\n",
      "Although the group toured for two years and recorded three more singles, only \"Willpower Weak, Temptation Strong,\" another Lambert and Flax song, broke into the Billboard Top 100. [BAND_NAME] disbanded some time before [YEAR]. Pontbriand later played trombone for K.C. and the Sunshine Band and trumpet for Wild Cherry, and is now Director of the Popular Music in the Music Department of Palm Beach Atlantic University in West Palm Beach, FL. Micara went on to record and tour with Gary U.S. Bonds and play drums on film soundtracks before changing careers to public-school teaching. He died in [YEAR]. Granato and Sorrentino are both musically active in South Florida. Stann performs in Edison, NJ with the artist Southside Johnny.\n"
   ]
}