{
   "Name": "Chrome (band)",
   "rawData": [
      "Chrome is an American rock band founded in San Francisco in 1976 by musician Damon Edge and associated with the 1970s post-punk movement. The group's raw sound blended elements of punk, psychedelia, and early industrial music, incorporating science-fiction themes, tape experimentation, distorted acid rock guitar, and  electronic noise. They have been cited as forerunners of the 1980s industrial music boom.\n",
      "They found little commercial success as part of San Francisco's 1970s music scene, but developed a cult following in the United Kingdom and Germany following the release of the LPs Alien Soundtracks (1977) and Half Machine Lip Moves (1979). Edge died in 1995; subsequently, guitarist Helios Creed has revived the Chrome name for recordings and performances.\n",
      "Chrome was formed in 1975 by Damon Edge (real name Thomas Wisse: drums, vocals, synths, production) and Gary Spain (bass guitar, violin) in San Francisco. While studying at the California Institute of the Arts, Edge became influenced in making unusual sounds; this progressed after a trip to Morocco where he heard a lot of Arabic music. In his head, he began putting a beat behind the music and started coming up with ideas for songs. Chrome's music contained a lot of atmosphere in the sound production, featuring three- and eight-note melodies, usually layered with an atonal drone backed by a rhythm section. This sort of atmosphere was influenced by the music he had heard in Morocco. About six months after that trip, Edge began forming a band and recording his new music.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, U.S."
      ],
      "Genres": [
         "Post-punk",
         "industrial rock",
         "acid-punk[1]",
         "experimental rock[2]",
         "Space rock"
      ],
      "Years active": [
         "1976–present"
      ],
      "Labels": [
         "Siren, Beggars Banquet, Don't Fall Off the Mountain, Subterranean, Expanded Music, Mosquito, Atonal, Dossier, Touch & Go, Man's Ruin, Cleopatra, Gearhead, King of Spades"
      ],
      "Members": [
         "Helios Creed",
         "Tommy Grenas",
         "Aleph Omega",
         "Lux Vibratus",
         "Lou Minatti",
         "Steve Fishman",
         "Tommy L. Cyborg"
      ],
      "Past members": [
         "Damon Edge",
         "Gary Spain",
         "John Lambdin",
         "Mike Low",
         "John Stench",
         "Hilary Stench",
         "Fabienne Shine",
         "Renaud Thorez",
         "Patrick Imbert",
         "Remy Devilla",
         "Olivier Caudron",
         "Bab",
         "Plume",
         "Cliff Martin",
         "Pierre Roussel",
         "Philippe Sautour",
         "Paul Della Pelle",
         "Nova Cain",
         "Z. Silver",
         "Buz Deadwaxx",
         "Rodney Dangerous",
         "Anne Dromeda"
      ]
   },
   "albums": [
      "The Visitation"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band founded in San Francisco in [YEAR] by musician Damon Edge and associated with the [YEAR]s post-punk movement. The group's raw sound blended elements of punk, psychedelia, and early industrial music, incorporating science-fiction themes, tape experimentation, distorted acid rock guitar, and  electronic noise. They have been cited as forerunners of the [YEAR]s industrial music boom.\n",
      "They found little commercial success as part of San Francisco's [YEAR]s music scene, but developed a cult following in the United Kingdom and Germany following the release of the LPs Alien Soundtracks ([YEAR]) and Half Machine Lip Moves ([YEAR]). Edge died in [YEAR]; subsequently, guitarist Helios Creed has revived the [BAND_NAME] name for recordings and performances.\n",
      "[BAND_NAME] was formed in [YEAR] by Damon Edge (real name [PERSON_NAME_FULL_0_MALE]: drums, vocals, synths, production) and Gary Spain (bass guitar, violin) in San Francisco. While studying at the California Institute of the Arts, Edge became influenced in making unusual sounds; this progressed after a [GENRE] a lot of Arabic music. In his head, he began putting a beat behind the music and started coming up with ideas for songs. [BAND_NAME]'s music contained a lot of atmosphere in the sound production, featuring three- and eight-note melodies, usually layered with an atonal drone backed by a rhythm section. This sort of atmosphere was influenced by the music he had heard in Morocco. About six months after that trip, Edge began forming a band and recording his new music.\n"
   ]
}