{
   "Discography": {
      "Damon Edge period": {
         "text": [
            "Produced by Damon Edge in Europe.\n"
         ]
      },
      "Edge/Creed period": {
         "text": [
            "The works of Edge and Creed together, in San Francisco.\n"
         ]
      },
      "Helios Creed period": {
         "text": [
            "After Edge's death, Creed reformed Chrome with previous and new members.\n"
         ]
      },
      "Original period": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Chrome was formed in 1975 by Damon Edge (real name Thomas Wisse: drums, vocals, synths, production) and Gary Spain (bass guitar, violin) in San Francisco. While studying at the California Institute of the Arts, Edge became influenced in making unusual sounds; this progressed after a trip to Morocco where he heard a lot of Arabic music.[8] In his head, he began putting a beat behind the music and started coming up with ideas for songs. Chrome's music contained a lot of atmosphere in the sound production, featuring three- and eight-note melodies, usually layered with an atonal drone backed by a rhythm section.[8] This sort of atmosphere was influenced by the music he had heard in Morocco. About six months after that trip, Edge began forming a band and recording his new music.[8]\n",
         "Chrome took part of their inspiration for their rough and sometimes chaotic music from punk pioneers like the Stooges.[9] They recorded and released their first album, The Visitation, along with John Lambdin (guitar) and Mike Low (guitar, vocals).[10] After recording The Visitation, Edge sent the album to Warner Brothers to see if they wanted to release the album. A Warner Brothers A&R representative told Edge that the album sounded like a \"messed up Doors album\"; to Damon Edge, this was a compliment. The label did not release the album, so Edge set up his own label, Siren Records.[3] After the recording of the first album, singer Mike Low left the band, to be replaced by new guitarist Helios Creed.[10]\n",
         "Chrome's commercial and artistic breakthrough came in 1977 with their second album, Alien Soundtracks. The album began as Ultra Soundtrack, a soundtrack for a radical San Francisco strip show, but was rejected for being too radical.[11] During recording, Chrome, aided by Creed's input, largely abandoned conventional rock compositions, instead employing cut-up and collage techniques and heavily processed sound to create a kind of sci-fi punk style. The album was given 4 out of 5 stars in the UK music paper Sounds, and Chrome began gradually to gain a cult reputation in the UK and in Europe.\n",
         "After recording Alien Soundtracks, John Lambdin left the band. Their third studio album, Half Machine Lip Moves, was released in 1979. Half Machine Lip Moves continued in the vein of the previous album, but heavier, with Creed's feedback guitar more to the fore. Edge's rough and ready drumming on this album included hitting pieces of scrap metal. Half Machine Lip Moves remains their best-known work. It was listed at No. 62 in The Wire list of \"100 Records That Set the World on Fire (While No One Was Listening)\",[12] and was cited as the \"beginning of industrial rock\".[13]\n",
         "Half Machine Lip Moves and their 1979 EP Read Only Memory cemented the band's growing reputation in the UK and led to the band being signed to Beggars Banquet Records for their fourth album, Red Exposure. By this time Chrome consisted solely of Edge and Creed. The album marked a move away from the more frenetic style of the two previous albums, with more use of drum machines and synthesizers.\n",
         "In 1980, Edge met singer Fabienne Shine, formerly of the band Shakin' Street, and married her two months later.[14] She went on to collaborate with him on several Chrome albums; her vocals appear on the album 3rd from the Sun.\n",
         "After a further EP and single, Chrome again expanded to a quartet with the addition of the new rhythm section of John and Hilary Stench (real surname: Haines). This lineup existed circa 1980–1983, and produced the albums Blood on the Moon (1981) and 3rd from the Sun (1982), and the new material comprising the fifth LP of the 1982 Chrome Box set (subtitled Chronicles I and Chronicles II). The Chronicles material was also released in France as an album titled Raining Milk, and would later be reissued in much longer versions on the distinct albums Chronicles I and Chronicles II. The title track from 3rd from the Sun was covered by the band Prong on their 1989 album Beg to Differ.\n",
         "In 1983, Edge moved to Paris. Shine introduced him to her band and a new lineup of Chrome was formed. Edge and his wife would later separate. Edge continued to release albums with various (mainly Europe-based) musicians under the Chrome moniker over the next decade.\n",
         "In August 1995, Edge was found dead in his Redondo Beach apartment in California; the cause of death was heart failure. Edge had been in contact with Creed and talked about reforming Chrome.[8]\n",
         "After she and Edge separated, Shine continued to compose songs. In 1997, after Edge's death, she released an album titled No Mad Nomad. The title referred to her late husband. In 2004, she began working and touring again with Creed.[14]\n",
         "A Creed-led version of Chrome that featured previous members John and Hilary Stench released a series of albums and toured between 1997 and 2001. Creed later reactivated the Chrome name again, issuing a new album, Feel It Like a Scientist, in 2014.\n",
         "The group's next album, Techromancy, was released April 21, 2017, followed by a US tour.[15][16]\n",
         "As of 2018, Chrome's current line-up consisted on Creed, Tommy Grenas, Aleph Omega, Lux Vibratus, Lou Minatti and Steve Fishman.[17]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Original period",
      "2.2 Edge/Creed period",
      "2.3 Damon Edge period",
      "2.4 Helios Creed period",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Chrome is an American rock band founded in San Francisco in 1976 by musician Damon Edge and associated with the 1970s post-punk movement.[3] The group's raw sound blended elements of punk, psychedelia, and early industrial music,[4] incorporating science-fiction themes, tape experimentation, distorted acid rock guitar, and  electronic noise.[5] They have been cited as forerunners of the 1980s industrial music boom.[6]\n",
         "They found little commercial success as part of San Francisco's 1970s music scene, but developed a cult following in the United Kingdom and Germany following the release of the LPs Alien Soundtracks (1977) and Half Machine Lip Moves (1979).[7][8] Edge died in 1995; subsequently, guitarist Helios Creed has revived the Chrome name for recordings and performances.[6]\n"
      ]
   },
   "Title": "Chrome (band) - Wikipedia"
}