{
   "Name": "String Driven Thing",
   "rawData": [
      "String Driven Thing are a folk rock band from Scotland, originally formed in the 1960s and led by husband and wife Chris Adams and Pauline Adams. The band also featured the electric violin of Graham Smith.\n",
      "String Driven Thing formed in Glasgow in 1967 as a three part harmony folk band with the Adamses and guitarist John Mannion. After paying their dues on the Scottish folk circuit they put out an eponymous album on the independent Concord label (copies of which are collectable and difficult to find) although a long way from their later Charisma label output. The group moved to London in 1972 and Chris Adams began to steer the band towards the electric folk-rock genre where his song writing abilities, which often feature hard-bitten and bitter observations capturing the harsher side of life, would be seen to better effect. By 1972 he had recruited classically trained violinist Graham Smith and guitarist Colin Wilson on bass, but soon afterwards Mannion left, citing musical differences.\n",
      "Adams then secured a deal with Tony Stratton-Smith's Charisma label and another eponymous album came out, produced by Shel Talmy at London's IBC Studios, with the songs \"Circus\", \"Jack Diamond\" and \"Easy To Be Free\" among the standout tracks. With Smith's high octane violin and Pauline Adams' distinctive lispy vocals, the band toured the UK and Europe with Charisma stablemates Lindisfarne and Genesis. This exposure raised their profile and led to TV appearances and an American tour. A second album, The Machine That Cried, was recorded in February 1973 at IBC, but now with the addition of a drummer, Billy \"The Kid\" Fairley. This was a much bleaker and rockier offering and though reviews were mixed at the time, it is now regarded as a forgotten classic. Standout tracks include \"Heartfeeder\", \"The Machine That Cried\" and \"Sold Down The River\". The song \"Night Club\", which opened Side Two, was inspired by the cover of their first Charisma album, designed by Hipgnosis, famous for their work with Pink Floyd. Recorded while Chris Adams was suffering health problems, including a collapsed lung and depression, the album is on the whole a very dark affair. Despite its cult status, it did not sell well at the time.\n"
   ],
   "infobox": {
      "Origin": [
         "Scotland"
      ],
      "Genres": [
         "Folk rock, progressive folk"
      ],
      "Years active": [
         "1967–1975",
         "1991",
         "2001–present"
      ],
      "Labels": [
         "Concord Records",
         "Charisma Records",
         "ozit morpheus Records",
         "Backshop Records"
      ],
      "Website": [
         "www.stringdriventhing.co.uk"
      ],
      "Members": [
         "Pauline Adams",
         "Graham Smith",
         "Robin Adams",
         "Andy Allan",
         "Dick Drake"
      ],
      "Past members": [
         "Chris Adams",
         "John Mannion",
         "Colin Wilson",
         "Billy Fairley",
         "Bill Hatje",
         "Colin Fairley",
         "Kim Beacon",
         "Andy Roberts",
         "James Exell",
         "George Tucker",
         "John Bradley",
         "Bob Cairns"
      ]
   },
   "albums": [
      "String Driven Thing",
      "String Driven Thing",
      "The Machine That Cried",
      "Please Mind Your Head",
      "Keep Yer 'and On It",
      "Dischotomy: The Rarities 1971—1974",
      "The Early Years 1968—1972",
      "Suicide (Live in Berlin)",
      "Studio '72 Plus Live In Switzerland '73 And London '95",
      "The Machine That Cried Band’s Official Version",
      "Moments of Truth",
      "Songs From Another Country",
      "Live on the Foxtrot tour 40th Anniversary"
   ]
}