{
   "Name": "Golden Earring",
   "Sections": [
      "1 History",
      "1.1 Early years (1961–1969)",
      "1.2 International fame (1970s and 1980s)",
      "1.3 Later years (1990s–2021)",
      "2 Personnel",
      "2.1 Members",
      "2.2 Lineups",
      "2.3 Timeline",
      "3 Discography",
      "4 References",
      "5 Other references",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Golden Earring was a Dutch rock band, founded in 1961 in The Hague as The Golden Earrings (the definite article was dropped in 1967, while the \"s\" was dropped in 1969).[1] They achieved worldwide fame with their international hit songs  \"Radar Love\" in 1973, which went to number one on the Dutch charts, reached the top ten in the United Kingdom, and went to number thirteen on the United States charts,[1][2] \"Twilight Zone\" in 1982, and \"When the Lady Smiles\" in 1984.[1] During their career they have had nearly 30 top-ten singles on the Dutch charts while releasing 25 studio albums.\n",
         "The band's lineup consisted of co-founders Rinus Gerritsen (bass and keyboards) and George Kooymans (vocals and guitar), along with Barry Hay (vocals, guitar, flute and saxophone), and Cesar Zuiderwijk (drums and percussion). All musicians in the last lineup of the band have been continuous members of the band since 1970, although other musicians have joined and left the band during the intervening years.\n",
         "The band announced on 5 February 2021 that it would stop playing after founding band member George Kooymans was diagnosed with ALS.\n"
      ]
   },
   "History": {
      "Early years (1961–1969)": {
         "text": [
            "What became Golden Earring was formed in 1961 in The Hague by 13-year-old George Kooymans and his 15-year-old neighbor, Rinus Gerritsen.[3] Originally called \"the Tornados\", the name was changed to the Golden Earrings when they discovered that the name the Tornados was already in use by another group.[3] The name \"the Golden Earrings\" was taken from an instrumental called \"Golden Earrings\" performed by the British group the Hunters, for whom they served as opening and closing act. Initially a pop-rock band with Frans Krassenburg on lead vocals and Jaap Eggermont on drums, the Golden Earrings had their first chart success with their debut single \"Please Go\", recorded in 1965. It became a hit on the charts in the Netherlands.[4] Dissatisfied with Dutch recording studios, the band's manager and co-discoverer Fred Haayen arranged for the next single to be recorded at the Pye Records studios in London. The record cut at Pye, \"That Day\", reached number two on the Dutch charts.\n",
            "In 1967, Barry Hay joined the band, replacing Krassenburg as frontman. The following year, the band earned their first number one hit in the Netherlands with the song \"Dong Dong Diki Digi Dong\". In the United States, ground work for entering the U.S. market was being laid by East Coast FM radio disc jockey and music critic Neil Kempfer-Stocker, who is credited as the first radio DJ to play the band in the U.S. This single was followed by a successful psychedelic album Eight Miles High, which featured an 18-minute version of the title track, a cover of the 1966 hit song by the Byrds.[3] The live version, which could last 45 minutes, was played during their first and second American tours in 1969. The band's American records at this time period were issued by the Perception Records label in New York, and the band's Golden Earring LP, known as Wall of Dolls, and single \"Back Home\" performed poorly in the U.S. but became a number 1 hit in the Netherlands.\n"
         ]
      },
      "International fame (1970s and 1980s)": {
         "text": [
            "In 1970, drummer Cesar Zuiderwijk joined the band, completing what has become Golden Earring's classic lineup. The band enjoyed brief international fame in the 1970s when the single version of \"Radar Love\" (1973), from the Gold-certified album Moontan became a hit in both Europe and the U.S.[1] Golden Earring embarked on their first major U.S. tour in 1969–1970. Owing to American influences, their music evolved towards hard rock, and they performed along with Jimi Hendrix, Led Zeppelin, Procol Harum, and Eric Clapton. Between 1969 and 1984, Golden Earring completed 13 U.S. tours. During this period, they performed as the opening act for Santana, King Crimson, the Doobie Brothers, Rush and .38 Special. During 1973–74, when \"Radar Love\" was a hit, they had Kiss and Aerosmith as their opening acts. While signed to the UK Track Records label, the band rented the superb quadraphonic sound system normally used exclusively by the Who.\n",
            "Golden Earring enjoyed a brief period of U.S. stardom but were unable to secure further chart success until 1982's \"Twilight Zone\". The music video of the song, directed by Dick Maas, was played on the recently launched MTV in the United States, and helped the song to become a Top Ten hit.\n",
            "\"When the Lady Smiles\" became an international hit in 1984, reaching No. 3 in Canada and becoming the band's fifth number one hit in their native country, but was not successful in the United States. The music video was banned from MTV, because of nudity and a scene portraying sexual abuse of a nun.[citation needed] An edited version of the video was shown, but failed to catch on. While touring the U.S. in 1984, the band played at the Great Arena Six Flags Great Adventure in New Jersey on May 11 and were in the midst of their performance when a fire broke out at the Haunted Castle on the opposite side of the theme park, killing eight teenagers. Following this tour, Golden Earring turned their focus toward Europe where they continue to attract standing-room-only crowds. The group paused briefly after the release of The Hole in 1986 to focus on other projects, with Hay and Kooymans both releasing solo albums (Victory of Bad Taste and Solo, respectively) the following year.  The group then reconvened to record their final album of the 1980s, releasing Keeper of the Flame in 1989.\n"
         ]
      },
      "Later years (1990s–2021)": {
         "text": [
            "In 1991, Golden Earring had another hit in the Netherlands with \"Going to the Run\", a rock-ballad about a Hells Angels motorcycle gang member who was a friend of the band and died in a crash. The Russian rock band Aria made a successful cover of \"Going to the Run\" as \"Беспечный ангел\" (\"Careless Angel\"). From 1992 to 2004, the band released three acoustic live unplugged albums, which became  quick successes. Since 1992 up until the end of their active career in 2021 they performed acoustic unplugged theater-shows which usually sold out. The acoustic albums feature unplugged versions of famous hits of the band, and have been some of the band's best-selling albums, such as The Naked Truth, which sold over 500,000 copies in the Netherlands.\n",
            "Known for their live performances, Golden Earring performed over 200 concerts a year, mainly in their home country of the Netherlands and occasionally in Belgium, Germany and the UK. These energetic live performances have been recorded on several live albums—Live, recorded at London's Rainbow Theater in 1977; 2nd Live, 1981; Something Heavy Going Down, 1984 (also released on DVD as Live from the Twilight Zone); and Last Blast of the Century, a live recording of their last concert of the 20th century (available on both CD and DVD). Furthermore, the band's acoustic live albums include The Naked Truth (1992), Naked II (1997) and Naked III (2005). Their latest live album, Live from Ahoy 2006, is a DVD with bonus CD.\n",
            "In 2003 the band briefly returned to the U.S. to record the studio album Millbrook USA. Recording took place in Millbrook, New York, at the studio of fellow musician Frank Carillo. March 2009 Golden Earring did two gigs in the UK for the first time in 30 years, with one show at Ipswich Regent Theatre on March 13, 2009, and one concert on 14 March 2009 at The Shepherd's Bush Empire in London. Golden Earring celebrated their 50th anniversary in 2011. On October 10, 2011, at the Historical Museum of The Hague, PostNL presented the first postage stamp with music. This stamp was issued in honour of the 50th anniversary of the band. When a smartphone with a special app is held up to the music stamp, Golden Earring's \"Radar Love\" plays. This stamp is the first in a series of music stamps encoding real sound highlighting the most successful pop albums released in the Netherlands. Band member and co-founder Rinus Gerritsen accepted the first sheetlet from PostNL. Moontan has been, internationally, Golden Earring's most successful album. In celebration of the band’s 50th anniversary, PostNL has selected Moontan as the subject of the first stamp in this series. The 50th anniversary of Golden Earring was celebrated at the Hague Historical Museum in their hometown The Hague, with a special temporary exhibition on the band, their music, lifetime and influences. On display were singles, albums, posters, T-shirts, instruments, handwritings and portraits. The nightlife scene of the 1960s and 1970s was also highlighted, as well as a remake of a typical teenage bedroom of the 1960s. The expo was called 'Golden Earring—Back Home' and ran until February 2012.\n",
            "On 11 May 2012 the band released their latest studio album Tits 'n Ass. The album was recorded in London during summer of 2011 with producer Chris Kimsey and peaked at #1 in the Dutch album charts twice. In order to produce a more intense sound on stage and on this album the band has been augmented with singer and keyboard player Johnny Rooymans. The album features the song \"Still Got the Keys to My First Cadillac\" which was marketed as their latest single. A video for the song featured young impersonators of Golden Earring.\n",
            "To celebrate the fiftieth anniversary of the band (the name of the band was changed to The Golden Earring in 1969 - before that the name was Golden Earrings), Golden Earring recorded a new track in October 2019, titled \"Say When\".[5]\n",
            "On 25 June 2019, The New York Times Magazine listed Golden Earring among hundreds of artists whose material was reportedly destroyed in the 2008 Universal fire.[6]\n",
            "On 5 February 2021, the band's manager announced to the Dutch press their active career was over, due to George Kooymans' illness [7][8]\n"
         ]
      }
   },
   "Personnel": {
      "Members": {
         "text": [
            "\n"
         ]
      },
      "Lineups": {},
      "Timeline": {}
   },
   "Discography": {},
   "References": {},
   "Other references": {},
   "External links": {},
   "coreData": [
      "Golden Earring was a Dutch rock band, founded in 1961 in The Hague as The Golden Earrings (the definite article was dropped in 1967, while the \"s\" was dropped in 1969).[1] They achieved worldwide fame with their international hit songs  \"Radar Love\" in 1973, which went to number one on the Dutch charts, reached the top ten in the United Kingdom, and went to number thirteen on the United States charts,[1][2] \"Twilight Zone\" in 1982, and \"When the Lady Smiles\" in 1984.[1] During their career they have had nearly 30 top-ten singles on the Dutch charts while releasing 25 studio albums.\n",
      "The band's lineup consisted of co-founders Rinus Gerritsen (bass and keyboards) and George Kooymans (vocals and guitar), along with Barry Hay (vocals, guitar, flute and saxophone), and Cesar Zuiderwijk (drums and percussion). All musicians in the last lineup of the band have been continuous members of the band since 1970, although other musicians have joined and left the band during the intervening years.\n",
      "The band announced on 5 February 2021 that it would stop playing after founding band member George Kooymans was diagnosed with ALS.\n",
      "What became Golden Earring was formed in 1961 in The Hague by 13-year-old George Kooymans and his 15-year-old neighbor, Rinus Gerritsen.[3] Originally called \"the Tornados\", the name was changed to the Golden Earrings when they discovered that the name the Tornados was already in use by another group.[3] The name \"the Golden Earrings\" was taken from an instrumental called \"Golden Earrings\" performed by the British group the Hunters, for whom they served as opening and closing act. Initially a pop-rock band with Frans Krassenburg on lead vocals and Jaap Eggermont on drums, the Golden Earrings had their first chart success with their debut single \"Please Go\", recorded in 1965. It became a hit on the charts in the Netherlands.[4] Dissatisfied with Dutch recording studios, the band's manager and co-discoverer Fred Haayen arranged for the next single to be recorded at the Pye Records studios in London. The record cut at Pye, \"That Day\", reached number two on the Dutch charts.\n"
   ]
}