{
   "Name": "Golden Earring",
   "rawData": [
      "Golden Earring was a Dutch rock band, founded in 1961 in The Hague as The Golden Earrings (the definite article was dropped in 1967, while the \"s\" was dropped in 1969). They achieved worldwide fame with their international hit songs  \"Radar Love\" in 1973, which went to number one on the Dutch charts, reached the top ten in the United Kingdom, and went to number thirteen on the United States charts, \"Twilight Zone\" in 1982, and \"When the Lady Smiles\" in 1984. During their career they have had nearly 30 top-ten singles on the Dutch charts while releasing 25 studio albums.\n",
      "The band's lineup consisted of co-founders Rinus Gerritsen (bass and keyboards) and George Kooymans (vocals and guitar), along with Barry Hay (vocals, guitar, flute and saxophone), and Cesar Zuiderwijk (drums and percussion). All musicians in the last lineup of the band have been continuous members of the band since 1970, although other musicians have joined and left the band during the intervening years.\n",
      "The band announced on 5 February 2021 that it would stop playing after founding band member George Kooymans was diagnosed with ALS.\n"
   ],
   "infobox": {
      "Origin": [
         "The Hague, Netherlands"
      ],
      "Genres": [
         "Hard rock, progressive rock, psychedelic rock, glam rock, Nederbeat"
      ],
      "Years active": [
         "1961–2021"
      ],
      "Labels": [
         "Polydor, MCA, Track, Universal, Columbia, Capitol, 21, Polygram, Atlantic, Atco, First Quake, Red Bullet"
      ],
      "Website": [
         "www.goldenearring.nl"
      ],
      "Past members": [
         "Rinus Gerritsen",
         "George Kooymans",
         "Barry Hay",
         "Cesar Zuiderwijk ",
         "Fred van der Hilst",
         "Hans van Herwerden",
         "Peter de Ronde",
         "Frans Krassenburg",
         "Jaap Eggermont",
         "Sieb Warner",
         "Bertus Borgers",
         "Eelco Gelling",
         "Robert Jan Stips",
         "John Legrand",
         "Philip van Boom"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band, founded in [YEAR] in The Hague as The [BAND_NAME]s (the definite article was dropped in [YEAR], while the \"s\" was dropped in [YEAR]). They achieved worldwide fame with their international hit songs  \"Radar Love\" in [YEAR], which went to number one on the Dutch charts, reached the top ten in the United Kingdom, and went to number thirteen on the United States charts, \"Twilight Zone\" in [YEAR], and \"When the Lady Smiles\" in [YEAR]. During their career they have had nearly 30 top-ten singles on the Dutch charts while releasing 25 studio albums.\n",
      "The band's lineup consisted of co-founders [PERSON_NAME_FULL_1_MALE] (bass and keyboards) and George Kooymans (vocals and guitar), along with [PERSON_NAME_FULL_0_MALE] (vocals, guitar, flute and saxophone), and [PERSON_NAME_FULL_2_MALE] (drums and percussion). All musicians in the last lineup of the band have been continuous members of the band since [YEAR], although other musicians have joined and left the band during the intervening years.\n",
      "The band announced on 5 [MONTH] [YEAR] that it would stop playing after founding band member George Kooymans was diagnosed with ALS.\n"
   ]
}