{
   "Name": "Premiata Forneria Marconi",
   "Sections": [
      "1 History",
      "1.1 1966–1970",
      "1.2 Italian and international success (1971–1975)",
      "1.3 1975–1978",
      "1.4 1979–1987",
      "1.5 Reformation (1997–present)",
      "2 Members",
      "2.1 Current members",
      "2.2 Former members",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Live albums",
      "3.3 Compilations",
      "4 Singles",
      "5 See also",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Premiata Forneria Marconi (PFM) (translation: Award-winning Marconi Bakery) is an Italian progressive rock band founded in 1970 and which continues to the present day. They were the first Italian group to have success internationally. The group recorded five albums with English lyrics between 1973 and 1977. During this period they entered both the British and American charts. They also had several successful European and American tours, playing at the popular Reading Festival in England and on a very popular national television program in the United States.\n",
         "PFM introduced new sounds, such as the synthesizer, to the Italian musical world.  They were also among the first to combine symphonic classical and traditional Italian musical influences in a rock music context.  Such innovations and their longevity have earned PFM a place among the most important bands in the Progressive rock genre.\n"
      ]
   },
   "History": {
      "1966–1970": {
         "text": [
            "The original core members of PFM were Franco Mussida (guitars, vocals), Flavio Premoli (keyboards), Luciano Dovesi (bass), who preceded Giorgio Piazza (bass), and Franz Di Cioccio (drums, vocals). They came together in the mid-1960s while playing together as backup musicians for many different Italian pop, rock and folk singers such as Lucio Battisti, Mina, Adriano Celentano and Fabrizio De André. They appeared on many recordings for other artists during this period and quickly established themselves as top players on the Italian scene before forming the group 'I quelli' (deliberately ungrammatical, roughly translates to 'The Them', or 'Those Guys') in 1968. I Quelli released one album and some successful Italian singles.\n",
            "Premiata Forneria Marconi was officially formed in Milan in 1970 when the members of I Quelli met Mauro Pagani from the group Dalton. Pagani helped the group expand their sound to include violin and flute. By this time they were already highly experienced musicians who could play the kind of complex progressive heavy rock played by the leading English and American groups. Their early live performances included songs by groups such as King Crimson and Jethro Tull.[1] Other early influences included Chicago, Ekseption, and The Flock.\n",
            "After rejecting Isotta Fraschini (an Italian car maker) as a name the group finally settled on Pagani's suggestion, 'Forneria Marconi' (meaning 'Marconi Bakery'), borrowed from the sign of a shop in the small town of Chiari, near Brescia. However, record producer and friend Alessandro Colombini suggested the name was not strong enough, so the title 'Premiata' (award-winning) was added. Some objected that 'Premiata Forneria Marconi' was too long a name, but the group's philosophy stated that the more difficult to remember a band's name, the more difficult it was to forget it. Italian progressive bands tended to have long names back then (Banco del Mutuo Soccorso, Raccomandata con Ricevuta di Ritorno, etc.), and so they were usually referred to as 'La Premiata', and later 'PFM'.\n"
         ]
      },
      "Italian and international success (1971–1975)": {
         "text": [
            "In June 1971, PFM entered a competition-cum-music festival called the first 'Festival d'Avanguardia e Nuove Tendenze' in Viareggio, which they won, along with Osanna and Mia Martini. Later in 1971 the group signed with the Numero Uno division of RCA Records in Italy, and released their first single, \"Impressioni di settembre\"/\"La carrozza di Hans\". It received wide recognition as the first Italian hit record to feature the synthesizer. The group still regularly performs both songs. Flavio Premoli also did a special demonstration of the capabilities of his Minimoog during a PFM television performance broadcast by RAI.\n",
            "In early 1972, PFM released their first album, Storia di un minuto. The album topped the Italian charts in its first week and was the first by an Italian rock group to achieve this kind of success. It contained re-recorded versions of songs from the first single, as well as \"È Festa\" and \"Dove... Quando...\" which remain concert favorites. Later in 1972 saw the release of their second LP, Per un amico. This album opened the way to broader audience recognition all across Europe. It featured a more sophisticated 16-track production and allowed the group to refine their sound.\n",
            "PFM came to the attention of Greg Lake of Emerson, Lake & Palmer while ELP was on an Italian tour. ELP arranged for PFM sign to their own label, Manticore Records. The first album on Manticore, Photos of Ghosts was released all across Europe, Japan, the USA and Canada and was the first time an Italian rock band found success in foreign markets. It was also one of the first recordings by a mainland European rock group to have chart success in the United States, peaking at #180 on the Billboard 200 albums chart in November 1973.  The album contained mostly re-recordings of songs from Per un amico in English. New lyrics (not translations) were written by former King Crimson member (and ELP lyricist) Peter Sinfield, who helped produce the new recording and mixing at Advision Studios in London.  Sinfield also suggested that the band abbreviate their name to PFM, starting with this album.  Songs included \"Celebration\" (a remake of \"È Festa\"), which received considerable airplay on album-oriented rock stations in the USA and Canada.\n",
            "Following the release of Photos of Ghosts bass player Giorgio Piazza left the group, being replaced by Patrick Djivas, who has remained with the group since. The next PFM album release in Italy was L'isola di niente in 1974. Highlights of the album include \"Dolcissima Maria\" (English title: \"Just Look Away\") and the instrumental \"Via Lumiere\" (English title: \"Have Your Cake and Beat It\".) Again a similar English language version of the album was released by Manticore as The World Became the World (1974). The English album included another re-recording of \"Impressioni di settembre\" as the title track. This was their last collaboration with Peter Sinfield, as the group were not entirely pleased with his English lyrics.\n",
            "On the 1974 U.S. tour PFM played concerts with Little Feat, The Beach Boys, The Allman Brothers Band, Aerosmith, ZZ Top, Peter Frampton and Dave Mason. They were a victim of theft just before the concert with Santana on July 25 at the Paramount Theatre in Seattle. The stolen items included a 1969 Gibson Les Paul and a Gibson ES-335 (with three pickups, which had \"Altaloma\" engraved on them) as well as two bass guitars.\n",
            "1974 concerts were recorded in Toronto, Canada (Convocation Hall) on August 22nd, and the Schaeffer Music Festival show in Central Park NYC on August 31st. Tracks from these shows were released as PFM's final album for Manticore, titled, Cook. The album spent eight weeks on the Billboard 200 chart, and peaked at #154 in January 1975. The same recordings were used with different artwork for the next European album titled Live in USA. PFM reached their biggest American audience when they appeared on NBC's Midnight Special program on February 21, 1975. Their nationally televised performance included \"Celebration\" and the instrumental \"Alta Loma Nine 'till Five\".\n"
         ]
      },
      "1975–1978": {
         "text": [
            "The lack of a strong lead vocalist had always been considered PFM's biggest liability, so they enrolled Bernardo Lanzetti, who was previously with the group Acqua Fragile. While a college student, Lanzetti had lived in Austin, Texas for a few years. Most importantly, he had a powerful and distinctive voice, and could speak fluent English.\n",
            "The first release by the six-piece band was Chocolate Kings in 1975. Featuring a harder rock sound, it had modest success at home but was their least popular album in Italy so far. The same album was released with different cover art by Manticore in the UK and by Asylum Records in the US. The controversial US/UK cover showed a chocolate bar in a partially peeled Stars and Stripes wrapper on the front, along with the crumpled and discarded wrapper on the back. PFM appeared on the BBC television show The Old Grey Whistle Test in 1976 performing the title track to the album. The album reached the UK top 20 but was less successful internationally. Mauro Pagani left the group following Chocolate Kings to pursue a solo career.\n",
            "Lanzetti also appeared on Jet Lag (1977), an album highly influenced by the Jazz-fusion movement, which was recorded in Los Angeles. This was their last album with English lyrics and the last album released in the U.S., also on Asylum. Violinist Gregory Bloch, previously with the group It's a Beautiful Day, replaced Mauro Pagani and helped the band acquire notoriety in the US before leaving to join the Saturday Night Live Band in 1979.\n",
            "For Passpartù (1978) PFM added two new percussion players and shifted stylistic direction once again.  The album contains seven songs in Italian and one instrumental, characterized by an international pop music style; an early example of what today is known as 'Worldbeat'.  The album's sound emphasizes acoustic, rather than electric guitar, and draws from Italian folk and Latin music as well as Jazz-Pop styles, somewhat like Steely Dan. This was the last album to feature Lanzetti, who then left to pursue a solo career.  \n"
         ]
      },
      "1979–1987": {
         "text": [
            "In 1979, PFM once again played as the backup group for Fabrizio De André. The group contributed new arrangements for De André's songs and the ensemble toured Italy and Europe to packed concert halls. De André and PFM released two albums during this period, entitled In Concerto - Arrangiamenti PFM (1979), and In Concerto - Arrangiamenti PFM, Vol. 2 (1980).\n",
            "During the 1980s PFM enjoyed continued success at home while concentrating on commercial rock music for the mainstream Italian audience. In 1980 Flavio Premoli left the group and built a successful career writing and performing music for Italian films and television. Multi-instrumentalist Lucio Fabbri joined adding skills on violin, keyboards, and rhythm guitar. Albums during this period were Suonare Suonare (1980), Performance (1981), Come ti va in riva alla città (1981), and PFM? PFM! (1984). The title track of their 1987 album Miss Baker was written in honor of the American dancer Josephine Baker.  Though PFM stopped performing in 1987 they never officially broke up.\n"
         ]
      },
      "Reformation (1997–present)": {
         "text": [
            "In 1997 Flavio Premoli reunited with other core members (DiCioccio, Djivas, Mussida) and released the comeback album Ulisse.  Though not as progressive as some of their 1970s work, this album brought PFM back to the attention of the international progressive rock audience. Ulisse is a song cycle based on the Odyssey legend by Homer, with the contributions of noted Italian lyricist Vincenzo Incenzo. A double disc live album www.pfmpfm.it (1998) was recorded with two additional musicians on their sellout Italian tour the next year.\n",
            "Serendipity (2001) is a studio collection of new songs in Italian. Live in Japan 2002 was released in both a double CD and DVD edition. The double CD edition contains two new studio tracks including a collaboration with Peter Hammill of Van der Graaf Generator. Hammill wrote lyrics and sings on the group's first recording in English since 1977, titled \"Sea of Memory\". Live album Piazza del Campo (2005) was released in both a single CD and CD+DVD edition. It captures a live performance with the one time only return of Mauro Pagani, filmed outdoors in the main square of Siena. Italian rock singer Piero Pelù also appears on the DVD.\n",
            "Keyboard player Flavio Premoli left the group for a second time in early 2005. PFM then returned to the USA for the first time since 1977 to play the Progressive Arts Showcase at Bethlehem, Pennsylvania on July 8, 2005. This concert was held in conjunction with the 7th annual NEARfest progressive rock event. Other shows on this tour included dates in Canada, Brazil, Mexico, Panama, and Venezuela. Premoli's last work with the group, Dracula, was released late in the year. It is an original Rock opera based on the Dracula legend.\n",
            "Stati di immaginazione (2006) is an entirely instrumental effort and has an accompanying DVD of video images made for each song. Following the pattern of earlier works, the music alternates between serene and calming sections of acoustic guitar and sections of sharper-edged hard rock. The video content ranges from fantasy-style vignettes made with computer graphics to archival black and white historic films.\n",
            "PFM was the first confirmed act for the NEARfest 2009 festival which was held June 20–21.\n",
            "In 2010 PFM released their new album A.D.2010 - La buona novella, a reworking of the Fabrizio de André's 1970 album La buona novella. The group included sections of their own music within the original De André's folk songs, adding instrumental progressive rock passages. In 2009 PFM performed for the first time at the Sanremo Music Festival.  In 2011 they appeared at Sanremo again with Roberto Vecchioni. 2011 also saw the group release Amico Faber, a box set containing the live album PFM canta De André (2008) and A.D.2010 - La buona novella, as well as a 16-page booklet, dedicated to Fabrizio de André.\n",
            "A 2-CD album, called \"PFM IN CLASSIC, DA MOZART A CELEBRATION\", was released in 2013. CD #1 comprises somewhat creative \"arrangements\" by PFM of famous classical works, such as \"Il flauto magico\" (Mozart), \"Danza macabra\" (C. Saint-Saëns), and \"Romeo & Giulietta\" (Prokofiev). CD #2 offers \"classical renditions\" of some of PFM's best known titles, including  \"La luna nuova\"; \"Dove....Quando....\"; \"Maestro della voce\"; and \"Impressioni di Settembre\". \n",
            "In March of 2015, the band announced on their official Facebook page that guitarist/founder Franco Mussida had left the band to concentrate on other artistic endeavors and his long-standing presidency of the CPM Music Institute. He was replaced by Marco Sfogli on guitar. \n",
            "A new studio album, Emotional Tattoos, was released both in Italian and English on October 27, 2017. Of the original band, only Di Cioccio remains. The band is now led by and revolves around Di Cioccio (drums, singing) and Patrick Djivas (bass guitar).\n"
         ]
      }
   },
   "Members": {
      "Current members": {},
      "Former members": {}
   },
   "Discography": {
      "Studio albums": {},
      "Live albums": {},
      "Compilations": {}
   },
   "Singles": {},
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Premiata Forneria Marconi (PFM) (translation: Award-winning Marconi Bakery) is an Italian progressive rock band founded in 1970 and which continues to the present day. They were the first Italian group to have success internationally. The group recorded five albums with English lyrics between 1973 and 1977. During this period they entered both the British and American charts. They also had several successful European and American tours, playing at the popular Reading Festival in England and on a very popular national television program in the United States.\n",
      "PFM introduced new sounds, such as the synthesizer, to the Italian musical world.  They were also among the first to combine symphonic classical and traditional Italian musical influences in a rock music context.  Such innovations and their longevity have earned PFM a place among the most important bands in the Progressive rock genre.\n",
      "The original core members of PFM were Franco Mussida (guitars, vocals), Flavio Premoli (keyboards), Luciano Dovesi (bass), who preceded Giorgio Piazza (bass), and Franz Di Cioccio (drums, vocals). They came together in the mid-1960s while playing together as backup musicians for many different Italian pop, rock and folk singers such as Lucio Battisti, Mina, Adriano Celentano and Fabrizio De André. They appeared on many recordings for other artists during this period and quickly established themselves as top players on the Italian scene before forming the group 'I quelli' (deliberately ungrammatical, roughly translates to 'The Them', or 'Those Guys') in 1968. I Quelli released one album and some successful Italian singles.\n",
      "Premiata Forneria Marconi was officially formed in Milan in 1970 when the members of I Quelli met Mauro Pagani from the group Dalton. Pagani helped the group expand their sound to include violin and flute. By this time they were already highly experienced musicians who could play the kind of complex progressive heavy rock played by the leading English and American groups. Their early live performances included songs by groups such as King Crimson and Jethro Tull.[1] Other early influences included Chicago, Ekseption, and The Flock.\n"
   ]
}