{
   "Name": "Premiata Forneria Marconi",
   "rawData": [
      "Premiata Forneria Marconi (PFM) (translation: Award-winning Marconi Bakery) is an Italian progressive rock band founded in 1970 and which continues to the present day. They were the first Italian group to have success internationally. The group recorded five albums with English lyrics between 1973 and 1977. During this period they entered both the British and American charts. They also had several successful European and American tours, playing at the popular Reading Festival in England and on a very popular national television program in the United States.\n",
      "PFM introduced new sounds, such as the synthesizer, to the Italian musical world.  They were also among the first to combine symphonic classical and traditional Italian musical influences in a rock music context.  Such innovations and their longevity have earned PFM a place among the most important bands in the Progressive rock genre.\n",
      "The original core members of PFM were Franco Mussida (guitars, vocals), Flavio Premoli (keyboards), Luciano Dovesi (bass), who preceded Giorgio Piazza (bass), and Franz Di Cioccio (drums, vocals). They came together in the mid-1960s while playing together as backup musicians for many different Italian pop, rock and folk singers such as Lucio Battisti, Mina, Adriano Celentano and Fabrizio De André. They appeared on many recordings for other artists during this period and quickly established themselves as top players on the Italian scene before forming the group 'I quelli' (deliberately ungrammatical, roughly translates to 'The Them', or 'Those Guys') in 1968. I Quelli released one album and some successful Italian singles.\n"
   ],
   "infobox": {
      "Origin": [
         "Milan, Italy"
      ],
      "Genres": [
         "Progressive rock"
      ],
      "Years active": [
         "1970–present"
      ],
      "Members": [
         "Franz Di Cioccio",
         "Marco Sfogli",
         "Patrick Djivas",
         " Lucio Fabbri",
         "Gianluca Tagliavini",
         "Piero Monterisi"
      ],
      "Past members": [
         "Franco Mussida",
         "Flavio Premoli",
         "Mauro Pagani",
         "Giorgio Piazza",
         "Bernardo Lanzetti",
         "Gregory Bloch",
         "Walter Calloni",
         "Roberto Gualdi"
      ]
   }
}