{
   "Name": "Magma (band)",
   "Sections": [
      "1 History",
      "1.1 Beginnings (1967–1971)",
      "1.2 Mëkanïk Dëstruktïẁ Kömmandöh, to Üdü Wüdü (1972–1977)",
      "1.3 Changing sound and breakup (1978–1984)",
      "2 Style and influences",
      "2.1 Legacy",
      "2.1.1 Fandom",
      "3 Discography",
      "4 Personnel",
      "4.1 Members",
      "4.2 Timeline",
      "5 See also",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Magma is a French progressive rock band founded in Paris in 1969 by classically trained drummer Christian Vander, who claimed as his inspiration a \"vision of humanity's spiritual and ecological future\" that profoundly disturbed him. In the course of their first album, the band tells the story of a group of people fleeing a doomed Earth to settle on the planet Kobaïa. Later, conflict arises when the Kobaïans—descendants of the original colonists—encounter other Earth refugees. The style of progressive rock that Vander developed with Magma is termed Zeuhl, and has been applied to other bands in France operating in the same period, and to some recent Japanese bands.[2]\n",
         "Vander created a fictional language, Kobaïan, in which most lyrics are sung.[3] In a 1977 interview with Vander and long-time Magma vocalist Klaus Blasquiz, Blasquiz said that Kobaïan is a \"phonetic language made by elements of the Slavonic and Germanic languages to be able to express some things musically. The language has of course a content, but not word by word.\"[4] Vander himself has said, \"When I wrote, the sounds [of Kobaïan] came naturally with it—I didn't intellectualise the process by saying 'Ok, now I'm going to write some words in a particular language', it was really sounds that were coming at the same time as the music.\"[5] Later albums tell different stories set in more ancient times; however, the Kobaïan language remains an integral part of the music.\n",
         "In 1986, the French label Seventh Records was founded to (re-)publish Magma's and Vander's work. Over the years, Seventh has also released albums by related artists such as Stella Vander, Patrick Gauthier and Collectif Mu.[6]\n"
      ]
   },
   "History": {
      "Beginnings (1967–1971)": {
         "text": [
            "In early 1967, drummer Christian Vander played in the Wurdalaks and Cruciferius Lobonz, two rhythm and blues bands. With these groups, he wrote his first compositions, \"Nogma\" and \"Atumba\". The death of John Coltrane saddened Vander, who left the groups and traveled to Italy. He returned to France in 1969 and met saxophonist Rene Garber and bassist and conductor Laurent Thibault. Together with singer Lucien Zabuski and organist Francis Moze, they created the group Uniweria Zekt Magma Composedra Arguezdra, shortened to Magma.[7]\n",
            "After their first tour, Magma experienced significant lineup turnover. Vocalist Lucien Zabuski was replaced with Klaus Blasquiz, and pianist Eddie Rabin, double bassist Jacky Vidal, and guitarist Claude Engel also joined the group. The group worked on material for three months in a house in the Chevreuse Valley. Eddie Rabin was replaced by François Cahen on keyboards, and Laurent Thibault abandoned bass to devote himself to production. Francis Moze became the new bassist. The band also expanded with a brass section, consisting of Teddy Lasry on saxophone and clarinet, Richard Raux on saxophone and flute, and Paco Charlery on trumpet. The group's first album, Magma, was released in the spring of 1970 by Phillips Records. The group caused a sensation but audience reactions were mixed.[7]\n",
            "After the album was released, Claude Engel, Richard Raux, and Paco Charlery left the group. Jeff Seffer replaced Raux on saxophone, and Louis Toesca replaced Charlery on trumpet. Their second album, 1001° Centigrades, was released in April 1971. The album won the band more exposure, including a performance at the Montreux Jazz Festival.[7]\n"
         ]
      },
      "Mëkanïk Dëstruktïẁ Kömmandöh, to Üdü Wüdü (1972–1977)": {
         "text": [
            "In August 1972, Magma released the album The Unnamables, under the alias Univeria Zekt. However, the album sold only 1,500 copies. Many musicians left the band that year, including François Cahen, Louis Toesca, Jeff Seffer, Francis Moze, and Teddy Lasry.[7] That same year, Christian Vander recorded the soundtrack for Yvan Lagrange's film Tristan et Iseult.[7]\n",
            "In 1973, Vander formed a new lineup of the band, adding Stella Vander as a second vocalist, Claude Olmos on guitar, Jannick Top replacing Francis Moze on bass, Rene Garber on saxophone and clarinet, and Jean-Luc Manderlier on keyboards, among others. This new version of the band would release their most famous work Mëkanïk Dëstruktïẁ Kömmandöh, which would later become their most acclaimed album, and gave them international fame,[7] including a spot at the prestigious Newport Jazz Festival, their first American performance. In 1974, under Vander's name, the band released a soundtrack album accompanying Yvan Lagrange's 1972 film Tristan et Iseult, also known as Ẁurdah Ïtah; under Magma's name, they followed up with Köhntarkösz, which was successful among fans, but not received as well among the public as Mëkanïk Dëstruktïẁ Kömmandöh.[7] The band would then go on a long, year-and-a-half long tour of France, and after another member shakeup (Bernard Paganotti replacing Jannick Top on bass, Didier Lockwood added as a violinist, Jean-Pol Asseline and Benot Widemann replacing Gerard Bikialo on keyboards, and Gabriel Federow replacing Claude Olmos on guitar), released their first live album, Live / Hhaï, in December 1975, recorded at the Taverne de l'Olympia in Paris.[8]\n",
            "In 1976, Top briefly rejoined the band for the recording of the album Üdü Ẁüdü, but left soon after due to strained relations with frontman Christian Vander. More lineup turnover followed in 1977, with Jean DeAntoni replacing Gabriel Federow on guitar, Guy Delacroix replacing Bernard Paganotti on bass, and Clement Bailly hired as a second drummer.\n"
         ]
      },
      "Changing sound and breakup (1978–1984)": {
         "text": [
            "In 1978, Magma released the album Attahk. Vying for more commercial success,[9] the album included elements of soul, rhythm & blues, and funk music.\n",
            "Celebrating 10 years as a band, in 1980, Magma performed three nights at L'Olympia in Paris, with guest appearances from many of the group's past musicians. These were recorded and released as Retrospektïẁ (Parts I+II) and Retrospektïẁ (Part III). The concerts were successful, and allowed Magma to play a number of shows around France, including a three-week residency at Paris's Bobino in 1981, which was recorded and filmed, and later released as Concert Bobino 1981.\n",
            "In 1984, the band recorded the album Merci, and disbanded shortly afterwards. Christian Vander formed other projects such as Offering, and various jazz projects including the Christian Vander Trio.\n"
         ]
      }
   },
   "Style and influences": {
      "Legacy": {
         "Fandom": {
            "text": [
               "The band has a number of high-profile fans. Punk rock singer Johnny Rotten,[28] metal musician Kristoffer Rygg,[29] Steven Wilson formerly of Porcupine Tree,[30] Mikael Åkerfeldt of Opeth,[31] Cattle Decapitation vocalist Travis Ryan,[32] magician Penn Jillette, and Chilean filmmaker Alejandro Jodorowsky have all stated their admiration of the band.\n",
               "In the 1980s, British World champion snooker player Steve Davis declared himself a passionate follower of the band since his youth and used some of his winnings to promote a series of concerts by Magma in London.[33]\n",
               "Television journalist Antoine de Caunes wrote a biography of the band entitled Magma.[34][35]\n",
               "In 2017, documentary filmmaker Laurent Goldstein directed To Life, Death and Beyond – The Music of Magma. Interviewees include Christian Vander, Stella Vander, James MacGaw, Trey Gunn, Robert Trujillo, and Jello Biafra.[36]\n"
            ]
         },
         "text": [
            "The band is widely considered to be musically adventurous and imaginative[21][22][23] among music critics. Magma uses choirs extensively in a way reminiscent of the composer Carl Orff.[24] Magma's music is also highly influenced by jazz saxophone player John Coltrane, and Vander has said that \"it is still Coltrane who actually gives me the real material to work on, to be able to move on\".[25]\n",
            "Many of the musicians who have played with Magma have also formed solo projects or spinoff acts. The Kobaïan term Zeuhl has come to refer to the musical style of these bands and the French jazz fusion/symphonic rock scene that grew around them.[2] Besides Christian Vander, other well-known Magma alumni include the violinist Didier Lockwood, bassist-composer Jannick \"Janik\" Top,[26] and spinoff act Weidorje.[27]\n"
         ]
      },
      "text": [
         "\nChristian Vander has described the style of progressive rock that he developed with Magma in France from 1969 onwards as \"zeuhl\".[10] Dominique Leone, writing for Pitchfork, says the style is \"about what you'd expect an alien rock opera to sound like: massed, chanted choral motifs, martial, repetitive percussion, sudden bursts of explosive improv and just as unexpected lapses into eerie, minimalist trance-rock.\"[11] The term comes from Kobaïan,[12] the fictional language created by Vander for Magma.[13] He has said that it means celestial;[12] that \"Zeuhl music means 'vibratory music'\"[14] and that zeuhl is \"L'esprit au travers de la matière. That is Zeuhl. Zeuhl is also the sound which you can feel vibrating in your belly. Pronounce the word Zeuhl very slowly, and stress the letter 'z' at the beginning, and you will feel your body vibrating.\"[15]\n",
         "Originally applied solely to the music of Magma, the term \"zeuhl\" was eventually used to describe the similar music produced by French bands beginning in the 1970s.[16] In addition to Magma, bands who are associated with the term include: Happy Family,[17] Kōenji Hyakkei,[18] and Ruins[19] from Japan, and French band Zao.[20]\n",
         "Vander was musically influenced by John Coltrane and Carl Orff.\n"
      ]
   },
   "Discography": {},
   "Personnel": {
      "Members": {
         "text": [
            "The following musicians are not on the record sold:\n"
         ]
      },
      "Timeline": {}
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Magma is a French progressive rock band founded in Paris in 1969 by classically trained drummer Christian Vander, who claimed as his inspiration a \"vision of humanity's spiritual and ecological future\" that profoundly disturbed him. In the course of their first album, the band tells the story of a group of people fleeing a doomed Earth to settle on the planet Kobaïa. Later, conflict arises when the Kobaïans—descendants of the original colonists—encounter other Earth refugees. The style of progressive rock that Vander developed with Magma is termed Zeuhl, and has been applied to other bands in France operating in the same period, and to some recent Japanese bands.[2]\n",
      "Vander created a fictional language, Kobaïan, in which most lyrics are sung.[3] In a 1977 interview with Vander and long-time Magma vocalist Klaus Blasquiz, Blasquiz said that Kobaïan is a \"phonetic language made by elements of the Slavonic and Germanic languages to be able to express some things musically. The language has of course a content, but not word by word.\"[4] Vander himself has said, \"When I wrote, the sounds [of Kobaïan] came naturally with it—I didn't intellectualise the process by saying 'Ok, now I'm going to write some words in a particular language', it was really sounds that were coming at the same time as the music.\"[5] Later albums tell different stories set in more ancient times; however, the Kobaïan language remains an integral part of the music.\n",
      "In 1986, the French label Seventh Records was founded to (re-)publish Magma's and Vander's work. Over the years, Seventh has also released albums by related artists such as Stella Vander, Patrick Gauthier and Collectif Mu.[6]\n",
      "In early 1967, drummer Christian Vander played in the Wurdalaks and Cruciferius Lobonz, two rhythm and blues bands. With these groups, he wrote his first compositions, \"Nogma\" and \"Atumba\". The death of John Coltrane saddened Vander, who left the groups and traveled to Italy. He returned to France in 1969 and met saxophonist Rene Garber and bassist and conductor Laurent Thibault. Together with singer Lucien Zabuski and organist Francis Moze, they created the group Uniweria Zekt Magma Composedra Arguezdra, shortened to Magma.[7]\n"
   ]
}