{
   "Name": "Clover (band)",
   "Sections": [
      "1 History",
      "2 After Clover",
      "3 Reunions",
      "4 Band members",
      "4.1 Founding members (1967–1978)",
      "4.2 Later members",
      "5 Discography",
      "5.1 Singles",
      "5.2 Albums",
      "5.3 Compilations",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Clover was an American country rock band formed in Mill Valley, California, United States and active from 1967 to 1978.[1] Clover are best known as the backing band for Elvis Costello's 1977 debut album My Aim Is True (recorded in the UK), and for its members going into greater success with Huey Lewis and the News, The Doobie Brothers, Toto, and Lucinda Williams.\n"
      ]
   },
   "History": {
      "text": [
         "Formed by members of the band Tiny Hearing Aid Company,[1] Clover's sound moved on from Bay Area psychedelia to the burgeoning country rock sound, similar to Creedence Clearwater Revival. The original line-up was based out of San Francisco, and was a quartet consisting of Alex Call (lead vocals, guitar), John McFee (guitar, pedal steel), John Ciambiotti (bass) and Mitch Howie (drums).[1] 1970 saw their debut self-titled album released on Fantasy Records.  A 1971 follow-up entitled Fourty Niner  [sic] also appeared on the same label.[1]\n",
         "Later the band moved to the UK, and the line-up was shuffled somewhat.  By late 1976, Clover's new drummer was Mickey Shine.  As well, the group had added Huey Lewis (then billing himself as \"Huey Louis\") as a second lead vocalist and harmonica player, and Sean Hopper was keyboard player.  This sextet (Call, Louis, McFee, Hopper, Ciambotti and Shine) signed to the UK's Vertigo label, and worked with producer Robert John \"Mutt\" Lange on Clover's 1976 non-LP single \"Chicken Funk\", and the group's early 1977 album entitled Unavailable.  Later that year, McFee, Ciambotti, Hopper and Shine (but not Louis or Call) backed Elvis Costello on his debut album My Aim Is True.[1]  These musicians were not credited on the release for contractual reasons; some contemporary publicity for the album identified Costello's backing band as \"The Shamrocks\".\n",
         "Clover's Unavailable album was retitled Clover for North American release.  Later in 1977, Mickey Shine left the group.  For the group's second album of 1977, Love on the Wire,[1] session drummer Tony Braunagel was employed, but was not an official member of the band.  This album was also produced by Lange, who co-wrote a few songs.  However, as with all other Clover releases, the album spun off no hits and did not chart.\n",
         "Clover toured as the support group for Lynyrd Skynyrd, Thin Lizzy and Graham Parker and the Rumour in the UK during the late 1970s.\n"
      ]
   },
   "After Clover": {
      "text": [
         "After Clover originally disbanded in 1978 the ex-members returned home to the USA.[1]  Alex Call recorded as a solo artist and wrote hits for Huey Lewis and many other artists, including Tommy Tutone's \"867-5309/Jenny\".  Lewis and Hopper formed Huey Lewis and the News; a few of their hits were written or co-written by Lange.[1] McFee joined Southern Pacific and The Doobie Brothers,[1] and also played sessions for Elvis Costello. Ciambotti played sessions for Lucinda Williams, John Prine, and Carlene Carter, and became a chiropractor in Toluca Lake, California. Porcaro had a prolific career as a session musician and co-founded the band Toto.  Shine briefly became a member of Tommy Tutone but left the band before they recorded Call's \"867-5309\".\n",
         "Carlene Carter covered two of Clover's songs (\"Love Is Gone\" and \"Mr. Moon,\" both written by Call), then later recorded two songs, \"Ring Of Fire\" and \"Too Proud,\" with McFee, Ciambotti and Hopper.\n",
         "Founding member Dr. John P. Ciambotti died on March 24, 2010, in Glendale, California, at the age of 67.  He had undergone surgery for an abdominal aneurysm.[2]\n"
      ]
   },
   "Reunions": {
      "text": [
         "John McFee, John Ciambotti, and Sean Hopper reunited for two concerts backing Elvis Costello in San Francisco on November 8, 2007.  The drummer for the occasion was Pete Thomas of The Attractions.  The concerts raised funds for the Richard de Lone Special Housing Fund, a non-profit organization designed to help those with Prader-Willi Syndrome.[3]\n",
         "In 2016, founding members Alex Call, Mitch Howie, and John McFee were working on a new album entitled \"Homestead Redemption.\"  The album was released on July 17, 2018.  It includes 12 re-recordings of songs from Clover's first two albums on Fantasy Records plus one new recording \"Go Raise Hell Up In Heaven.\"  Gia Ciambotti provides vocals in place of her late father John Ciambotti.[4]  The album includes guest appearances by Huey Lewis, Sean Hopper, Pete Thomas and Elvis Costello.[5][6][7]\n"
      ]
   },
   "Band members": {
      "Founding members (1967–1978)": {},
      "Later members": {}
   },
   "Discography": {
      "Singles": {},
      "Albums": {},
      "Compilations": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Clover was an American country rock band formed in Mill Valley, California, United States and active from 1967 to 1978.[1] Clover are best known as the backing band for Elvis Costello's 1977 debut album My Aim Is True (recorded in the UK), and for its members going into greater success with Huey Lewis and the News, The Doobie Brothers, Toto, and Lucinda Williams.\n",
      "Formed by members of the band Tiny Hearing Aid Company,[1] Clover's sound moved on from Bay Area psychedelia to the burgeoning country rock sound, similar to Creedence Clearwater Revival. The original line-up was based out of San Francisco, and was a quartet consisting of Alex Call (lead vocals, guitar), John McFee (guitar, pedal steel), John Ciambiotti (bass) and Mitch Howie (drums).[1] 1970 saw their debut self-titled album released on Fantasy Records.  A 1971 follow-up entitled Fourty Niner  [sic] also appeared on the same label.[1]\n",
      "Later the band moved to the UK, and the line-up was shuffled somewhat.  By late 1976, Clover's new drummer was Mickey Shine.  As well, the group had added Huey Lewis (then billing himself as \"Huey Louis\") as a second lead vocalist and harmonica player, and Sean Hopper was keyboard player.  This sextet (Call, Louis, McFee, Hopper, Ciambotti and Shine) signed to the UK's Vertigo label, and worked with producer Robert John \"Mutt\" Lange on Clover's 1976 non-LP single \"Chicken Funk\", and the group's early 1977 album entitled Unavailable.  Later that year, McFee, Ciambotti, Hopper and Shine (but not Louis or Call) backed Elvis Costello on his debut album My Aim Is True.[1]  These musicians were not credited on the release for contractual reasons; some contemporary publicity for the album identified Costello's backing band as \"The Shamrocks\".\n",
      "Clover's Unavailable album was retitled Clover for North American release.  Later in 1977, Mickey Shine left the group.  For the group's second album of 1977, Love on the Wire,[1] session drummer Tony Braunagel was employed, but was not an official member of the band.  This album was also produced by Lange, who co-wrote a few songs.  However, as with all other Clover releases, the album spun off no hits and did not chart.\n"
   ]
}