{
   "Name": "Clover (band)",
   "rawData": [
      "Clover was an American country rock band formed in Mill Valley, California, United States and active from 1967 to 1978. Clover are best known as the backing band for Elvis Costello's 1977 debut album My Aim Is True (recorded in the UK), and for its members going into greater success with Huey Lewis and the News, The Doobie Brothers, Toto, and Lucinda Williams.\n",
      "Formed by members of the band Tiny Hearing Aid Company, Clover's sound moved on from Bay Area psychedelia to the burgeoning country rock sound, similar to Creedence Clearwater Revival. The original line-up was based out of San Francisco, and was a quartet consisting of Alex Call (lead vocals, guitar), John McFee (guitar, pedal steel), John Ciambiotti (bass) and Mitch Howie (drums). 1970 saw their debut self-titled album released on Fantasy Records.  A 1971 follow-up entitled Fourty Niner   also appeared on the same label.\n",
      "Later the band moved to the UK, and the line-up was shuffled somewhat.  By late 1976, Clover's new drummer was Mickey Shine.  As well, the group had added Huey Lewis (then billing himself as \"Huey Louis\") as a second lead vocalist and harmonica player, and Sean Hopper was keyboard player.  This sextet (Call, Louis, McFee, Hopper, Ciambotti and Shine) signed to the UK's Vertigo label, and worked with producer Robert John \"Mutt\" Lange on Clover's 1976 non-LP single \"Chicken Funk\", and the group's early 1977 album entitled Unavailable.  Later that year, McFee, Ciambotti, Hopper and Shine (but not Louis or Call) backed Elvis Costello on his debut album My Aim Is True.  These musicians were not credited on the release for contractual reasons; some contemporary publicity for the album identified Costello's backing band as \"The Shamrocks\".\n"
   ],
   "infobox": {
      "Origin": [
         "Mill Valley, California, United States"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1967 (1967)–1978 (1978)"
      ],
      "Labels": [
         "Fantasy Records, Mercury Records"
      ],
      "Associated acts": [
         "Elvis Costello, Huey Lewis and the News, The Doobie Brothers, Toto, Lucinda Williams"
      ],
      "Past members": [
         "Alex Call",
         "John McFee",
         "John Ciambotti",
         "Mitch Howie",
         "Huey Lewis",
         "Jeff Porcaro",
         "Sean Hopper",
         "Marcus Grossman (aka Marcus David)",
         "Kirk Harwood",
         "Micky Shine",
         "Tony Braunagel",
         "Kevin Wells",
         "Daniel Lenard"
      ]
   },
   "albums": [
      "Unavailable"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band formed in Mill Valley, California, United States and active from [YEAR] to [YEAR]. [BAND_NAME] are best known as the backing band for [PERSON_NAME_FULL_1_MALE]'s [YEAR] debut album My Aim Is True (recorded in the UK), and for its members going into greater success with Huey Lewis and the News, The Doobie Brothers, Toto, and [PERSON_NAME_FULL_0_FEMALE].\n",
      "Formed by members of the band Tiny Hearing Aid Company, [BAND_NAME]'s sound moved on from [PERSON_NAME_FULL_0_MALE] psychedelia to the burgeoning country rock sound, similar to Creedence Clearwater Revival. The original line-up was based out of San Francisco, and was a quartet consisting of Alex Call (lead vocals, guitar), [PERSON_NAME_FULL_1_MALE] (guitar, pedal steel), [PERSON_NAME_FIRST_1] Ciambiotti (bass) and [PERSON_NAME_FULL_2_MALE] (drums). [YEAR] saw their debut self-titled album released on Fantasy Records.  A [YEAR] follow-up entitled Fourty Niner   also appeared on the same label.\n",
      "Later the band moved to the UK, and the line-up was shuffled somewhat.  By late [YEAR], [BAND_NAME]'s new drummer was Mickey Shine.  As well, the group had added [PERSON_NAME_FULL_1_MALE] (then billing himself as [SONG_NAME].\n"
   ]
}