{
   "Name": "Oasis (American band)",
   "Sections": [
      "Summary",
      "Members"
   ],
   "Summary": {
      "text": [
         "Oasis was an American rock band from Marin County, California, active in the 1970s.\n",
         "Their sound has been described as psychedelic folk rock, progressive folk and psychedelic pop, characterized by male/female harmonies. With the encouragement of David Crosby, they were signed personally by Ahmet Ertegun, managed by David Geffen and Elliot Roberts, and recorded their first album produced by Stephen Barncard in the space of one month. The album was shelved two months later due to management malfunction and was never released.\n",
         "Later two member of the band formed a spinoff electric band and recorded one album, Oasis, again produced by Barncard, released on the Cranbus label in 1973.[1]\n"
      ]
   },
   "Members": {
      "text": [
         "Sherry Fox was previously in Cookin Mama. Stephen Barncard worked with the Grateful Dead, Seals and Crofts, The Doobie Brothers, Crosby and Nash, Chet Nichols and David Crosby. Kelly Bryan had earlier been in the short-lived Grootna, and later played on a couple of albums by Jesse Colin Young.\n",
         "Between 1971 and 1978, members of Oasis also recorded under the name RJ Fox and completed an album for Atlantic in 1971 which was never released. A double disc collection of Oasis and RJ Fox material was compiled by the Black Bamboo label in 1998. RJ Fox: Retrospective Dreams included the lost LP, tracks from the Oasis album and many others.\n"
      ]
   },
   "coreData": [
      "Oasis was an American rock band from Marin County, California, active in the 1970s.\n",
      "Their sound has been described as psychedelic folk rock, progressive folk and psychedelic pop, characterized by male/female harmonies. With the encouragement of David Crosby, they were signed personally by Ahmet Ertegun, managed by David Geffen and Elliot Roberts, and recorded their first album produced by Stephen Barncard in the space of one month. The album was shelved two months later due to management malfunction and was never released.\n",
      "Later two member of the band formed a spinoff electric band and recorded one album, Oasis, again produced by Barncard, released on the Cranbus label in 1973.[1]\n",
      "Sherry Fox was previously in Cookin Mama. Stephen Barncard worked with the Grateful Dead, Seals and Crofts, The Doobie Brothers, Crosby and Nash, Chet Nichols and David Crosby. Kelly Bryan had earlier been in the short-lived Grootna, and later played on a couple of albums by Jesse Colin Young.\n"
   ],
   "infobox": {}
}