{
   "Discography": {
      "Compilations": {},
      "DVDs": {},
      "Live albums": {},
      "Other compilations": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Initially signing to a Dutch record company, SI Music, then forming their own label, Synergy Records, the band have established themselves within the world of progressive rock, though their style may also extend into album-oriented rock, melodic rock, hard rock and even a slightly jazz edge.\n",
         "Vocalist Damian Wilson left the band after three very well received albums to concentrate on his solo career and the band found a replacement in Ian 'Moon' Gould. 'Moon' spent a year with the band, playing various gigs in the UK and the Netherlands, before deciding to move on. It was at this point that Landmarq decided to go for a radical change to their sound and recruited the long-time friend of the band, Tracy Hitchings, who formerly sang with Quasar.\n",
         "Landmarq have played concerts in the UK, the Netherlands, Germany, Belgium, France, Poland, Italy, the US and Mexico; both as support and as headliners at various festivals and music venues. The band have worked with many well-known artists including Marillion, Focus, John Wetton (Asia, King Crimson, Roxy Music), Steve Hackett (Genesis), Hugh McDowell (ELO, Wizzard), Nik Turner (Hawkwind), Annie Haslam (Renaissance), IQ, Pendragon, Arena and even Suzi Quatro.\n",
         "Apart from making strong in-roads into Europe and America, Landmarq have reached further territories worldwide, as far afield as Russia, eastern Europe, the Far East, and Australia through various magazine/webzine articles, interviews, radio air-play and also compilation CDs from various music magazines.\n",
         "The band's first DVD was released in March 2006. Entitled Turbulence – Live In Poland, it features Landmarq filmed in concert at the Wyspianski Theatre, Katowice, in November 2005. The DVD was released by the Polish label Metal Mind Productions and has received some of the band's best reviews to date. The DVD also comprises a wealth of bonus material including audio and video archive tracks, an interview with the band, a huge photo gallery and much more.\n",
         "Following an enforced break for a few years, Landmarq re-emerged on to the Prog scene early in 2012 with the release of their eagerly-anticipated fifth album, Entertaining Angels, a Special Edition double-CD set. This proved to be a triumphant return for the band as they received many glowing reviews from fans and music press alike. This was followed up with \"Angels On Tour\", a series of live dates through 2012-2013, that saw Landmarq performing in various festivals and venues again in the UK, the Netherlands, Belgium and Germany. Also to much acclaim and some excellent reviews.\n",
         "A few review snippets for Entertaining Angels:\n",
         "\"...a triumph...full of power and passion...\"\nGeoff Barton, 'Classic Rock' magazine, UK - May 2012\n",
         "\"...Without doubt, \"Entertaining Angels\" is the strongest album of their career...\"\nNick Shilton, 'PROG' magazine, UK - March 2012\n",
         "\"...I can only congratulate Landmarq on such an outstanding band performance and highly recommend it to all...\"\nUli (Magic Dragon Music), Germany - February 2012\n"
      ]
   },
   "Personnel": {
      "Lineups": {},
      "Members": {
         "text": [
            "\n",
            "\n"
         ]
      }
   },
   "Sections": [
      "1 History",
      "2 Personnel",
      "2.1 Members",
      "2.2 Lineups",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Live albums",
      "3.3 Compilations",
      "3.4 Other compilations",
      "3.5 DVDs",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Landmarq are a UK-based neo-progressive rock band. Since forming in 1990, they have so far released a total of ten albums, four of which were recorded live at various concerts in the UK and elsewhere in Europe, plus two full concert DVDs.\n"
      ]
   },
   "Title": "Landmarq - Wikipedia"
}