{
   "Summary": {
      "text": [
         "Musafir (Hindi: मुसाफ़िर, Urdu: مسافر‎) is an Indian rock band from Delhi. The name of the band, Musafir, means \"traveler\" in Hindi.[1]  Its members include Ashutosh Jain, Rakesh Mandal and Kundan Messey. Being named one of the top five Hindi bands of India, Musafir is becoming a popular band in South Asia.[2][3]\n",
         "Hailing from New-Delhi India, Musafir-the-band streamlines the contemporary Hindi pop and folk sound, adding an arena-rock sincerity that’s well consented by its fans as ‘Indian-Pop-Rock’.\nThe band’s youthful attitude and emotive style, personified by front man Ashutosh’s dulcet vocals, and steady strings of radio-friendly rocks and manly ballads give Musafir’s music a presence, relished by the listeners of diverse genres.\n",
         "The group came together in the 2006. Lead singer Ashutosh Jain returning from Fame Gurkul – 2, set up a Music studio, joined by Rakesh Mandal and Kundan Messey, the experts who also had immense industry experience, just like Ashutosh. Amazed by the output, they decided to take music-business forward and created a live band line-up. The band completed when joined Arjun Desai on Guitars and Ravi Singh on Drums.\n",
         "Playing live since 3 years and performed nearly 200 shows, Musafir is also known for on-stage skills and Sensational Live acts. Their brand of fresh rock sound blends to create an experience, which is being hailed by many as the Next BIG THING in the Indian music scene.\n",
         "Musafir is led by Fame gurukul part 2 (Fame X) fame Ashutosh, who has learned the tricks of the trade from the industrial big shots like Palash Sen, Daler Mehndi, Soumya Rao and Ganesh Hegde.\n",
         "Musafir describing their music:\n",
         "“We are nothing unusual, we do not sing about Death, graves or blood, we are experimental only up to the mark of positivity. We believe in beauty, happiness and talent. Our songs are beautiful with amazing lyrics, great motif lines and an element of Rock, adoptable by every one. We have kept balance among innovation, saleability and originality of our thoughts.”\n",
         "Ashutosh, on his energy level while performing:\n",
         "”I’d do anything. I’d damn run across the audience in the stadium, to fix the microphone on the mouth of last man in the last row, to sing along with me. I’ve climbed lighting gears, I’ve jumped from the 8-10 ft elevated stages, I’ve laid down my guitar and picked a Dhol, singing for 4 hrs continuously nearly kills you, that’s crazy, but that’s what I like, bringing smile on their faces.”\n"
      ]
   }
}