{
   "Name": "Flat Earth Society (band)",
   "Sections": [
      "1 Biography",
      "2 Members (update 2020)",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Flat Earth Society (FES) is a Belgian big band ensemble founded and led by Peter Vermeersch. They mix the rich Belgian brass band (HaFaBra) tradition with characteristic topsy-turvy creativity.\n"
      ]
   },
   "Biography": {
      "text": [
         "Their earliest gig took place in 1997, when they performed a composition by Peter Vermeersch to accompany a circus act by De Circusplaneet during the Oorsmeer festival. They also performed on the song Porqué te Vas by A Group, Peter Vermeersch' avant-garde pop band.\n",
         "Wider attention came thanks to the Flemish radio station Radio 1, where they performed on the show Levende Lijven. The entire gig was recorded and later released under the title Live at the Beursschouwburg 1999, containing compositions by Peter Vermeersch and covers of jazz numbers. Unfortunately the Viakra label that released this CD went bankrupt, preventing a wide distribution. This prompted Peter Vermeersch to found his own record company, Zonk!Records.\n",
         "The year 2000 was a busy one, with a Belgian tour, a new appearance in the last broadcast of the Levende Lijven radio show, and the first release on Zonk!Records: Bonk. The track list contains new and old compositions by Vermeersch and other members of the big band, but ends with two covers of songs by The Residents. FES also played in the theatre play Larf by Josse De Pauw, the music of this performance being released the same year. Meanwhile Peter Vermeersch also composed the music for Minoes, a children's movie by Dutch film director Vincent Bal on a story by Annie M.G. Schmidt (released in 2001).\n",
         "In 2002, the Flat Earth Society was the house band of the Brugge2002 festival, where they participated in the Benenwerk project, turning the centre of the city of Bruges into a large ballroom. Trap became the second regular studio recording, and in August the Flat Earth Society premiered their Louis Armstrong project The Armstrong Mutations at the last night of the free Brussels festival Boterhammen in de Stad. A tour and a CD release followed in 2003.\n",
         "Meanwhile Peter Vermeersch was also commissioned by Gerard Mortier to write a big band opera on the libretto Heliogabal by Thomas Jonigk, with stage directions by Roy Faudré. The opera premiered on May 8, 2003 in Duisburg during the Ruhr Triennale festival. In 2005, the opera toured Belgium in a new setting provided by Josse De Pauw.\n",
         "In 2003 Peter had met with jazz composer and pianist Uri Caine, and the two decided to work together. Old compositions were re-orchestrated and new pieces were written. FES toured with Uri Caine in 2004.\n",
         "International success was now assured, and FES was able to sign distribution deals with Ipecac, who released the compilation FESisms, and later with Crammed Discs who released Psychoscout in 2006[1] and Cheer Me, Perverts! in 2009.[2]  In May 2011 they toured the USA for the first time in their career.  Starting in Tampa, they went from Washington and Philadelphia to New York, where they performed at the Lincoln Center and the Museum of the Moving Image.\n"
      ]
   },
   "Members (update 2020)": {
      "text": [
         "Guests:\n",
         "Ex-members:\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Flat Earth Society (FES) is a Belgian big band ensemble founded and led by Peter Vermeersch. They mix the rich Belgian brass band (HaFaBra) tradition with characteristic topsy-turvy creativity.\n",
      "Their earliest gig took place in 1997, when they performed a composition by Peter Vermeersch to accompany a circus act by De Circusplaneet during the Oorsmeer festival. They also performed on the song Porqué te Vas by A Group, Peter Vermeersch' avant-garde pop band.\n",
      "Wider attention came thanks to the Flemish radio station Radio 1, where they performed on the show Levende Lijven. The entire gig was recorded and later released under the title Live at the Beursschouwburg 1999, containing compositions by Peter Vermeersch and covers of jazz numbers. Unfortunately the Viakra label that released this CD went bankrupt, preventing a wide distribution. This prompted Peter Vermeersch to found his own record company, Zonk!Records.\n",
      "The year 2000 was a busy one, with a Belgian tour, a new appearance in the last broadcast of the Levende Lijven radio show, and the first release on Zonk!Records: Bonk. The track list contains new and old compositions by Vermeersch and other members of the big band, but ends with two covers of songs by The Residents. FES also played in the theatre play Larf by Josse De Pauw, the music of this performance being released the same year. Meanwhile Peter Vermeersch also composed the music for Minoes, a children's movie by Dutch film director Vincent Bal on a story by Annie M.G. Schmidt (released in 2001).\n"
   ],
   "infobox": {}
}