{
   "Name": "The Thad Jones/Mel Lewis Orchestra",
   "rawData": [
      "The Thad Jones/Mel Lewis Jazz Orchestra was a jazz big band formed by trumpeter Thad Jones and drummer Mel Lewis in New York in 1965. The band performed for twelve years in its original incarnation, including a 1972 tour of the Soviet Union during the height of the Cold War. The band won a Grammy Award for the album Live in Munich and in 2009 for the album Monday Night Live at the Village Vanguard. The collaboration ended in 1978 with Jones suddenly moving to Copenhagen, Denmark, after which the band became the Mel Lewis Jazz Orchestra. Since the death of Lewis in 1990 it has been known as the Vanguard Jazz Orchestra. They have maintained a Monday-night residency at the Village Vanguard jazz club in New York for five decades.\n",
      "Thad Jones played trumpet and cornet. His older brother was Hank Jones, a jazz pianist, and his younger brother was Elvin Jones, a jazz drummer. Thad Jones had worked as a professional since he was 16, when he played with Hank. After leaving the military in 1946, he performed with territory bands and later with Charles Mingus. From 1954–1963, he was a member of the Count Basie Orchestra, for whom he composed and arranged.\n",
      "Mel Lewis, a jazz drummer, had been playing in big bands since he was 15, first with Boyd Raeburn, then Alvino Rey, Stan Kenton, Terry Gibbs, and Gerald Wilson. In 1961, he toured the Soviet Union with veteran big band leader Benny Goodman. After Lewis moved to New York City, he met Thad Jones and started the Thad Jones/Mel Lewis Orchestra at the end of 1965. Beginning in February 1966, the band played every Monday night at the Village Vanguard. \nSince Lewis's death in 1990, the band has been called the Vanguard Jazz Orchestra, continuing its tradition as the Village Vanguard's house band.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City"
      ],
      "Genres": [
         "Jazz"
      ],
      "Years active": [
         "1965–present"
      ],
      "Labels": [
         "Solid State/RCA, A&M, Pausa, Telarc, Atlantic, New World, Planet Arts, Resonance"
      ],
      "Associated acts": [
         "Mel Lewis, Thad Jones, Max Gordon, Bob Brookmeyer, Jim McNeely, John Mosca"
      ],
      "Website": [
         "www.vanguardjazzorchestra.com"
      ]
   },
   "prunedData": [
      "The [PERSON_NAME_FULL_0_MALE]/Mel Lewis Jazz Orchestra was a [GENRE] band formed by trumpeter [PERSON_NAME_FULL_0_MALE] and drummer Mel Lewis in New York in [YEAR]. The band performed for twelve years in its original incarnation, including a [YEAR] tour of the Soviet Union during the height of the Cold War. The band won a Grammy Award for the album Live in Munich and in [YEAR] for the album Monday Night Live at the Village Vanguard. The collaboration ended in [YEAR] with [PERSON_NAME_LAST_0] suddenly moving to Copenhagen, Denmark, after which the band became the Mel Lewis Jazz Orchestra. Since the death of Lewis in [YEAR] it has been known as the Vanguard Jazz Orchestra. They have maintained a Monday-night residency at the Village Vanguard jazz club in New York for five decades.\n",
      "Thad [PERSON_NAME_LAST_1] played trumpet and cornet. His older brother was Hank [PERSON_NAME_LAST_1], a jazz pianist, and his younger brother was [PERSON_NAME_FULL_1_MALE], a jazz drummer. Thad [PERSON_NAME_LAST_1] had worked as a professional since he was 16, when he played with Hank. After leaving the military in [YEAR], he performed with territory bands and later with [PERSON_NAME_FULL_0_MALE]. From [YEAR]–[YEAR], he was a member of the Count Basie Orchestra, for whom he composed and arranged.\n",
      "Mel Lewis, a [GENRE] bands since he was 15, first with [PERSON_NAME_FULL_1_MALE], then [PERSON_NAME_FULL_0_MALE], [PERSON_NAME_FULL_4_MALE], Terry Gibbs, and [PERSON_NAME_FULL_3_MALE]. In [YEAR], he toured the Soviet Union with veteran big band leader Benny Goodman. After Lewis moved to New York City, he met [PERSON_NAME_FULL_2_MALE] and started the [PERSON_NAME_FULL_2_MALE]/Mel Lewis Orchestra at the end of [YEAR]. Beginning in [MONTH] [YEAR], the band played every Monday night at the Village Vanguard. \nSince Lewis's death in [YEAR], the band has been called the Vanguard Jazz Orchestra, continuing its tradition as the Village Vanguard's house band.\n"
   ]
}