{
   "Band history": {
      "text": [
         "The name of the band, according to the fictional description given in their first album Cowboy Bebop, derives from how the performers wear seatbelts to be safe while they play hardcore jam sessions.[5]\n",
         "The band performed the entire soundtrack of the anime series Cowboy Bebop and produced a total of seven albums (three new songs in Cowboy Bebop Tank! THE! BEST!) and one live DVD.[6]\n",
         "The band reformed virtually in the midst of the COVID-19 pandemic in 2020 to participate in new projects. In collaboration with Funimation, Sunrise, and composer Mason Lieberman, the band rerecorded the ending theme of Cowboy Bebop, The Real Folk Blues to raise proceeds for COVID-19 relief.[7]\n",
         "In addition, the band began the Session Starducks project on a newly founded YouTube channel in April 2020. In collaboration with musicians as well as with the original members of the band, the project aims to virtually record new interpretations of various songs composed by Yoko Kanno. These include songs from Cowboy Bebop and Macross Frontier.[8]\n",
         "It was confirmed in April 2020 that Yoko Kanno will be returning to compose the upcoming live-action adaption of Cowboy Bebop for Netflix. It is currently unknown if the Seatbelts will be contributing to the soundtrack.[9]\n"
      ]
   },
   "Discography": {
      "As a featured artist": {},
      "Live albums": {},
      "Remixes and compilation albums": {},
      "Singles": {},
      "Studio albums": {}
   },
   "External links": {},
   "References": {},
   "Sections": [
      "1 Band history",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Live albums",
      "2.3 Remixes and compilation albums",
      "2.4 Singles",
      "2.5 As a featured artist",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Seatbelts (シートベルツ, Shītoberutsu, also known as Seat Belts or SEATBELTS) is a Japanese band led by composer and instrumentalist Yoko Kanno.[1][2][3] An international ensemble comprising both a stable lineup of musicians and various collaborators, the band was assembled by Kanno in 1998 to perform the soundtrack music for the Cowboy Bebop anime series. Their repertoire covered and blended many different genres, mainly jazz, but also a wide variety of rock, electronic, funk, blues, J-pop and other styles of genres.[4]\n"
      ]
   },
   "Title": "Seatbelts (band) - Wikipedia"
}