{
   "Name": "Aeternus",
   "rawData": [
      "Aeternus is a Norwegian blackened death metal band from Bergen, Norway. It was formed in 1993 as an idea of Ronny Hovland, calling himself Ares, and Erik Heggernes, a.k.a. Vrolok. Later in 1996 Nicola Trier, a.k.a. Morrigan, joined the duo as a bass player, forming the core trio that created the band's first two albums. Morrigan also created the logo picture of ravens and axes that still exists as one of the band's trademarks.\n",
      "For the first two albums, the band called their own style \"Dark Metal\". They released their debut album, Beyond the Wandering Moon, in 1997 on Hammerheart Records (now Karmageddon Media), and toured that year with black metal bands Emperor and Limbonic Art through Europe. Their second album, ...And So the Night Became was released in 1998, accompanied by a tour supporting Deicide, and was later re-released in several different formats.\n",
      "In 1999, they added guitarist Radek, and their sound moved from darkened black metal toward a faster and more aggressive death metal sound for 1999's Shadows of Old. Morrigan left the group in 2001 for personal reasons and was later replaced by V'gandr, head of the Norwegian Viking metal band Helheim. Later that year they released their fourth full-length album called Ascension of Terror and did some live shows. They then departed from Hammerheart Records and also split way with guitarist Radek. Their next album A Darker Monument was released on the new Nocturnal Art Productions label in 2003. After the release of their sixth full-length HeXaeon, long-time member Vrolok left the band and was replaced by S. Winter on drums early in 2006. The group toured Europe later that year to support their new album. In September 2007, S. Winter was no longer in the group.\n"
   ],
   "infobox": {
      "Origin": [
         "Bergen, Norway"
      ],
      "Genres": [
         "Blackened death metal[1]"
      ],
      "Years active": [
         "1993 (1993)–present"
      ],
      "Labels": [
         "Hammerheart Records, Nocturnal Art Prod., DARK ESSENCE RECORDS"
      ],
      "Associated acts": [
         "Immortal, Gorgoroth, Helheim"
      ],
      "Website": [
         "www.aeternus.no"
      ],
      "Members": [
         "Ares",
         "Gorm",
         "Phobos",
         "Eld"
      ],
      "Past members": [
         "Morrigan",
         "Vrolok",
         "Radek",
         "Stian",
         "S. Winter",
         "V'gandr"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Bergen, Norway. It was formed in [YEAR] as an idea of [PERSON_NAME_FULL_1_MALE], calling himself [PERSON_NAME_FULL_4_MALE], and [PERSON_NAME_FULL_0_MALE], a.k.a. Vrolok. Later in [YEAR] Nicola Trier, a.k.a. Morrigan, joined the duo as a bass player, forming the core trio that created the band's first two albums. Morrigan also created the logo picture of ravens and axes that still exists as one of the band's trademarks.\n",
      "For the first two albums, the band called their own style \"Dark Metal\". They released their debut album, Beyond the Wandering Moon, in [YEAR] on Hammerheart Records (now Karmageddon Media), and toured that year with black metal bands Emperor and Limbonic Art through Europe. Their second album, ...And So the Night Became was released in [YEAR], accompanied by a [GENRE]",
      "In [YEAR], they added guitarist [PERSON_NAME_FULL_0_MALE], and their sound moved from darkened black metal toward a faster and more aggressive death metal sound for [YEAR]'s Shadows of Old. Morrigan left the group in [YEAR] for personal reasons and was later replaced by V'gandr, head of the Norwegian Viking metal band Helheim. Later that year they released their fourth full-length album called Ascension of Terror and did some live shows. They then departed from Hammerheart Records and also split way with guitarist [PERSON_NAME_FULL_0_MALE]. Their next album A Darker Monument was released on the new Nocturnal Art Productions label in [YEAR]. After the release of their sixth full-length HeXaeon, long-time member Vrolok left the band and was replaced by S. Winter on drums early in [YEAR]. The group toured Europe later that year to support their new album. In [MONTH] [YEAR], S. Winter was no longer in the group.\n"
   ]
}