{
   "Name": "Alastis",
   "rawData": [
      "Alastis was a Swiss extreme metal band formed in 1987 in Sion, Valais.\n",
      "The band formed in 1987 with the name Fourth Reich, playing death metal. The initial line-up was War D. on guitar, Zumof on vocals, Acronoise on drums, and Masmiseim (b. Christophe Mermod, Acronoise's brother) on bass. In 1989 Fourth Reich changed name to Alastis, a derivation of Alastor, the executioner of hell, and moved towards black metal; two years later Masmiseim left in order to join Samael, with Zumof departing soon after. Samael’s current vocalist/guitarist Vorph did guest vocals on one track from the demo Black Wedding, and the band issued their debut album, The Just Law, on Head Not Found. After several more line-up changes, they signed to Adipocere Records, who issued their second album, ...And Death Smiled, in 1995. The same year, Alastis toured with bands Anathema and Theatre of Tragedy in support of the album.\n",
      "Much like their fellow countrymen Samael, gothic and industrial musical elements played an important role in their sound during their later career, starting as a raw black metal before signing to Century Media Records in 1996, who began distributing the group's output in the United States. The Other Side was released in 1997 and promoted with a gig at the Wacken Open Air heavy metal festival in Germany. The band released their fourth album, Revenge, in 1998. The musician line-up at this stage was War D. on guitar/synthesizer/vocals, Acronoise on drums, Nick on second guitar, and Raff on bass.\n"
   ],
   "infobox": {
      "Also known as": [
         "Fourth Reich"
      ],
      "Origin": [
         "Sion, Switzerland"
      ],
      "Genres": [
         "Black metal[1]",
         "Gothic metal[2]"
      ],
      "Years active": [
         "1987–2004"
      ],
      "Labels": [
         "Head Not Found",
         "Adipocere Records",
         "Century Media Records"
      ],
      "Associated acts": [
         "Samael"
      ],
      "Website": [
         "www.alastis.ch"
      ],
      "Members": [
         "War D.",
         "Nick",
         "Raff",
         "Sebastian",
         "Graven X"
      ]
   },
   "albums": [
      "Fatidical Date",
      "Black Wedding"
   ],
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band formed in [YEAR] in Sion, Valais.\n",
      "The band formed in [YEAR] with the name Fourth Reich, playing death metal. The initial line-up was War D. on guitar, Zumof on vocals, Acronoise on drums, and Masmiseim (b. Christophe Mermod, Acronoise's brother) on bass. In [YEAR] Fourth Reich changed name to [BAND_NAME], a [GENRE] band issued their debut album, The Just Law, on Head Not Found. After several more line-up changes, they signed to Adipocere Records, who issued their second album, ...And Death Smiled, in [YEAR]. The same year, [BAND_NAME] toured with bands Anathema and Theatre of Tragedy in support of the album.\n",
      "Much like their fellow countrymen Samael, gothic and industrial musical elements played an [GENRE] a raw black metal before signing to Century Media Records in [YEAR], who began distributing the group's output in the United States. The Other Side was released in [YEAR] and promoted with a gig at the Wacken Open Air heavy metal festival in Germany. The band released their fourth album, Revenge, in [YEAR]. The musician line-up at this stage was War D. on guitar/synthesizer/vocals, Acronoise on drums, [PERSON_NAME_FULL_1_MALE] on second guitar, and Raff on bass.\n"
   ]
}