{
   "Name": "Amon Amarth",
   "Sections": [
      "1 History",
      "1.1 Formation (1988–1991)",
      "1.2 Early recordings (1992–1997)",
      "1.3 Signed with Metal Blade (1998–2007)",
      "1.4 Renewed contract with Metal Blade (2008–2014)",
      "1.5 Departure of Fredrik Andersson and Jomsviking (2015–2017)",
      "1.6 Berserker (2018–present)",
      "2 Musical style and lyrics",
      "3 Discography",
      "4 Members",
      "4.1 Timeline",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Amon Amarth (/əˈmɒn əˈmɑːrθ/) is a Swedish melodic death metal band from Tumba, formed in 1992. The band takes its name from the Sindarin name of Mount Doom, a volcano in J. R. R. Tolkien′s Middle-earth. Their lyrics mostly deal with Viking mythology and history, and so they have been linked with Viking metal, although the band themselves prefer to be referred to as melodic death metal. The band is composed of lead guitarist Olavi Mikkonen, vocalist Johan Hegg, bassist Ted Lundström, rhythm guitarist Johan Söderberg, and drummer Jocke Wallgren. Amon Amarth has released eleven studio albums, one compilation album, one EP, one video album, and ten music videos. Their first studio album, Once Sent from the Golden Hall, debuted in 1998. Five more studio releases followed, before the band saw its breakthrough with the 2008 album Twilight of the Thunder God, which debuted at No. 10 on the Swedish album charts and No. 50 on the US Billboard 200. Four more albums, Surtur Rising, Deceiver of the Gods, Jomsviking, and Berserker followed in 2011, 2013, 2016, and 2019 respectively.\n"
      ]
   },
   "History": {
      "Formation (1988–1991)": {
         "text": [
            "The band emerged from the previous death metal band Scum, founded in 1988 by Paul \"Themgoroth\" Mäkitalo (Dark Funeral) on vocals, Olavi Mikkonen on lead guitar, Petri Tarvainen on bass and Vesa Meriläinen rhythm guitar.\n"
         ]
      },
      "Early recordings (1992–1997)": {
         "text": [
            "After a 1991 demo, Scum broke up  and Amon Amarth formed in 1992. Hegg replaced Mäkitalo on vocals, Anders Hansson joined on guitar, and Ted Lundström replaced Tarvainen on bass, before recording its first demo Thor Arise (1993). Raw and uneven in sound and execution, it was never officially released due to low quality standards,[1][2] but the band caught the attention of extreme metal fans with its own \"infectious brand of epic-sounding brutality and unadorned conviction\".[1] In 1994 another demo entitled The Arrival of the Fimbul Winter was recorded; this time 1,000 copies were indeed issued.\n",
            "In 1996, they signed with Pulverised Records, on which they released their first MCD, Sorrow Throughout the Nine Worlds, which sold 6000 copies.[3]\n"
         ]
      },
      "Signed with Metal Blade (1998–2007)": {
         "text": [
            "They then signed with Metal Blade Records which released the debut album Once Sent from the Golden Hall. Described as \"a compelling fusion of buzzsaw riff work, melodic harmonies and soul-crushing rhythms punctuated by Hegg’s callous black/death roar and accounts of Norse battles and treachery\" it made sure Amon Amarth's popularity rose internationally.[1] According to Allmusic, the song that bore the group's namesake was the most memorable, containing \"the chaotic noises of battle, the screams of the dying, and much sword-clashing to boot.\"[4] Since then they have performed at multiple Canada and US tours, festival appearances, eight music videos, and appearances in over 100 metal magazines.[3]\n",
            "In June 1998, as the band was about to commence a tour alongside Deicide, Six Feet Under and Brutal Truth, guitarist Anders Hansson left and was replaced by Johan Soderberg. After the tour Martin Lopez quit to join Opeth[4] and Fredrik Andersson (ex-A Canorous Quintet) came in. With him in Spring 1999 the band recorded and released its second full-length, The Avenger. The release was supported by the X-Mas Massacre Festivals Tour with Morbid Angel headlining.[3]\n",
            "The Crusher, released in 2001, was considered[according to whom?] to be its most aggressive album. In support of it the band went on tour with Marduk and Vader, taking part in No Mercy Festival. its first American tour in autumn 2001 though had to be cancelled (due to the September 11 attacks) and was held later, in January 2002, without Marduk, Amon Amarth headlining. In April 2002 the band toured Europe with Vomitory and in August performed at Wacken Open Air before 12.000 metal fans. In Berno Studio in Malmo Versus The World was recorded and came out, The Viking Edition comprising a bonus CD which included demos Thor Arise and Arrival Of The Fimbul Winter. Touring continued up until Spring 2004 when the band started working on Fate of Norns album which was released on 6 September 2004.[3] The follow-up, With Oden on Our Side (2006), has shown (according to AllMusic) that \"Amon Amarth continue to be champions of the worldwide death metal tournament\"[5] and rose to number 26 in the US Top Independent album charts.[6] The album's material though was not included in the DVD Wrath Of The Norsemen (the song of the same title would be found in the 2011 album)[7] which was released in May 2006, having turned gold in US (platinum - in Canada) ever since.[8]\n",
            "In early January 2008, its first tour of Australia and New Zealand took place, supporting Dimmu Borgir, after finishing a US and Canadian tour with Sonic Syndicate and Himsa.[citation needed]\n"
         ]
      },
      "Renewed contract with Metal Blade (2008–2014)": {
         "text": [
            "Amon Amarth extended its record deal with Metal Blade Records for three more albums.[9] After extending its record deal, the band released Twilight of the Thunder God, which featured guest appearances by Lars Göran Petrov of Entombed, Roope Latvala of Children of Bodom, and the cello metal band Apocalyptica. Accompanying the release of the album was an eight-page comic strip based on Norse mythology which was released by magazines in Europe. Twilight of the Thunder God which is considered its breakthrough album,[10] reached number 50 in the US,[6] number 6 in Germany, number 10 in Finland, number 11 in Sweden, number 14 in Austria, number 21 in Switzerland. It ended up at the number 7 position in Revolver Magazine’s Top 20 Albums that year.[3]\n",
            "Amon Amarth embarked on a North American headlining tour in October 2008, with support from Ensiferum, Belphegor, and The Absence.[11] In 2009 the band returned to the States for another successful series of dates with Goatwhore, Skeletonwitch and Lazarus AD and later in 2010 with Holy Grail and Eluveitie. In between, Amon Amarth were named \"Best Breakthrough Act\" at Metal Hammer's prestigious Golden Gods Awards.[3] The band also supported Slayer in its Unholy Alliance Chapter III European tour. Amon Amarth played its first show in India, headlining the Deccan Rock Festival in Bangalore on 5 December 2009.[12]\n",
            "On 30 November 2010, Amon Amarth confirmed its next album entitled Surtur Rising would be released in Spring 2011.[13] The drums were recorded at Park Studios, while bass and guitars were recorded at Fascination Street Studios.[14] On 27 January 2011 Metal Blade Records released the new album's first single, titled \"War of the Gods\", on YouTube.  On 29 March 2011, Surtur Rising was released in North America.[citation needed] To support the album, the band embarked on a 4-month world tour with Children Of Bodom and Ensiferum, among others.\n",
            "Amon Amarth performed at Wacken Open Air in 2012,[15] Hellfest 2013, Download Festival 2013, Sweden Rock Festival and Mayhem Festival 2013.\n",
            "On 25 June 2013 Amon Amarth released its ninth studio album, Deceiver of the Gods. The album cover, according to the band, depicted Ragnarök the last battle between the Æsir gods and Loki, accompanied by the army of the dead.[16]\n"
         ]
      },
      "Departure of Fredrik Andersson and Jomsviking (2015–2017)": {
         "text": [
            "On 19 March 2015 Amon Amarth posted on its Facebook page that it had parted ways with drummer Fredrik Andersson after 17 years of collaboration.[17]\n",
            "The band released its 10th album Jomsviking on 25 March 2016. A session drummer, Tobias Gustafsson, was recruited for completion of the album.\n",
            "From 22 March to 25 March, the band performed four intimate album release shows in London, Paris, Tilburg and Berlin, to mark the release of Jomsviking. They also supported Megadeth, Suicidal Tendencies and Metal Church on the Dystopia tour in the United States in September and October 2016,[18] and headlined a tour in the UK and Ireland with Testament as special guests.[19]\n",
            "On 30 September 2016 Amon Amarth announced Jocke Wallgren is now the full-time drummer.\n",
            "In an August 2017 interview at Bloodstock Open Air festival, guitarist Johan Söderberg stated that Amon Amarth would begin working on their eleventh studio album after the end of the Jomsviking tour. He is quoted as saying, \"After this summer, we're done touring with this album. That's when we're gonna start to write stuff for the next one.\"[20]\n",
            "In October 2017, Johan Hegg joined the DJ roster for Gimme Radio, promoting his involvement with Amon Amarth as well as his favorite music and playlists on the show, \"Hammer of the North.\" [21]\n",
            "In November 2017, Ride & Crash Games partnered with Amon Amarth to release a self-titled video game centered around the band's songs and lyrics. It is currently available on iOS and Android.[22][23]\n"
         ]
      },
      "Berserker (2018–present)": {
         "text": [
            "On January 7, 2019 the band announced that they had finished recording their 11th studio album with producer Jay Ruston, tentatively due in the Spring. Vocalist Johan Hegg stated that he waited for the music to be completed entirely before writing any lyrics, a different approach compared to previous albums.[24] While saying that it is not a concept album, Hegg also revealed that one of the new tracks is titled \"Berserker At Stamford Bridge\" and \"The Shield Wall\". He stated, “It’s also about sticking together in the face of adversity. Then there's more introverted stuff, as well – songs that relate to my private life, and I got the ideas for those songs from my wife.\"[25]\n",
            "In May 2019, Amon Amarth embarked on a North American tour as part of Slayer's final world tour, also featuring Lamb of God and Cannibal Corpse.[26]\n",
            "On March 19, 2019 the band released a new song called \"Raven's Flight\" and revealed the name of their next album was Berserker, and will be released on May 3, 2019.[27]\n",
            "On April 15, 2019 Amon Amarth announced a headlining tour of North America to begin in September in support of Berserker alongside fellow Swedish bands Arch Enemy, At The Gates and Grand Magus.\n",
            "On April 17, 2019 the band released the music video for Berserker's second single \"Crack The Sky\".[28]\n",
            "On May 3, 2019 the band released the album Berserker.\n"
         ]
      }
   },
   "Musical style and lyrics": {
      "text": [
         "Under their original name Scum, the band played grindcore.[29] However, in 1992 the band changed their name to Amon Amarth and started to play melodic death metal.[29][30]\n",
         "The band bases most of its song lyrics on Norse mythology, the Viking Age, and the pre-Christian world, which thematically comprise a heavy metal style known as Viking metal. Viking metal originally emerged in the late 1980s and early 1990s as an ideological offshoot of black metal, made popular by such bands as Bathory and Enslaved. Amon Amarth, though a death metal band, is often labeled as Viking metal due to its lyrical themes.[31][32][33]\n",
         "\nIn regard to the band's reputation as a Viking metal band, Imke von Helden writes in \"Barbarians and Literature: Viking Metal and its Links to Old Norse Mythology\" that \"During the 1990s, Swedish Amon Amarth added a new dimension to the definition of viking metal by means of its death metal style of music.\"[34] She further explains in \"Scandinavian Metal Attack: The Power of Northern Europe in Extreme Metal\" that ",
         "Though most Viking metal bands have a black metal background, Viking metal is defined by topics rather than music. That is why death metal bands like Amon Amarth and Unleashed are often included in the league of Viking metal bands.",
         "\nWhen asked to comment on the band's genre, vocalist Johan Hegg remarked:",
         "We play death metal. We write about Vikings so, therefore, some refer us to Viking metal, but I have no idea what that is. I can't imagine the Vikings were into metal at all except on the swords and stuff. And musically, I guess they only played these strange lip instruments and some bongos or whatever.",
         "\nHegg has also addressed the band's relationship to the pagan metal phenomenon and its choice of subject matter:",
         "We don't really see ourselves as one of those bands doing pagan folklore music. The reason we took the Viking theme and mythology theme as a lyrical theme for the band was, perhaps, more accidental from the start. When we wrote the first song with Viking lyrics, we felt it was a topic that suited the music that we wanted to write really well...It was something different, as well, from a lot of other bands. In Sweden, I think only Bathory and Unleashed had done anything like it. For us, it was to do something different, to stand out a little bit, to use those lyrics."
      ]
   },
   "Discography": {},
   "Members": {
      "Timeline": {},
      "text": [
         "\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Amon Amarth (/əˈmɒn əˈmɑːrθ/) is a Swedish melodic death metal band from Tumba, formed in 1992. The band takes its name from the Sindarin name of Mount Doom, a volcano in J. R. R. Tolkien′s Middle-earth. Their lyrics mostly deal with Viking mythology and history, and so they have been linked with Viking metal, although the band themselves prefer to be referred to as melodic death metal. The band is composed of lead guitarist Olavi Mikkonen, vocalist Johan Hegg, bassist Ted Lundström, rhythm guitarist Johan Söderberg, and drummer Jocke Wallgren. Amon Amarth has released eleven studio albums, one compilation album, one EP, one video album, and ten music videos. Their first studio album, Once Sent from the Golden Hall, debuted in 1998. Five more studio releases followed, before the band saw its breakthrough with the 2008 album Twilight of the Thunder God, which debuted at No. 10 on the Swedish album charts and No. 50 on the US Billboard 200. Four more albums, Surtur Rising, Deceiver of the Gods, Jomsviking, and Berserker followed in 2011, 2013, 2016, and 2019 respectively.\n",
      "The band emerged from the previous death metal band Scum, founded in 1988 by Paul \"Themgoroth\" Mäkitalo (Dark Funeral) on vocals, Olavi Mikkonen on lead guitar, Petri Tarvainen on bass and Vesa Meriläinen rhythm guitar.\n",
      "After a 1991 demo, Scum broke up  and Amon Amarth formed in 1992. Hegg replaced Mäkitalo on vocals, Anders Hansson joined on guitar, and Ted Lundström replaced Tarvainen on bass, before recording its first demo Thor Arise (1993). Raw and uneven in sound and execution, it was never officially released due to low quality standards,[1][2] but the band caught the attention of extreme metal fans with its own \"infectious brand of epic-sounding brutality and unadorned conviction\".[1] In 1994 another demo entitled The Arrival of the Fimbul Winter was recorded; this time 1,000 copies were indeed issued.\n",
      "In 1996, they signed with Pulverised Records, on which they released their first MCD, Sorrow Throughout the Nine Worlds, which sold 6000 copies.[3]\n"
   ]
}