{
   "Name": "Anthrax (American band)",
   "rawData": [
      "Anthrax is an American heavy metal band from New York City, formed in 1981 by rhythm guitarist Scott Ian and bassist Dan Lilker. The group is considered one of the leaders of the thrash metal scene from the 1980s and is part of the \"Big Four\" of the genre, along with Metallica, Megadeth and Slayer. They were also one of the first thrash metal bands (along with Overkill and Nuclear Assault) to emerge from the East Coast. The band has released 11 studio albums, several other albums, and 26 singles, including collaborating on a single with American hip hop group Public Enemy. According to Nielsen SoundScan, Anthrax sold 2.5 million records in the United States from 1991 to 2004, with worldwide sales of 10 million. Four of the band's studio albums have also achieved gold certifications by the RIAA, including their third full-length record Among the Living (1987), which cemented Anthrax's reputation as one of the most successful thrash metal bands.\n",
      "Anthrax's lineup has changed numerous times over their career, leaving Ian as the only constant member of the band. The band has had a revolving cast of singers and lead guitarists, including Neil Turbin, John Bush, Dan Spitz and Rob Caggiano. Since 2013, the band has consisted of Ian, drummer Charlie Benante, bassist Frank Bello, vocalist Joey Belladonna and lead guitarist Jonathan Donais. Ian and Benante (who replaced one-time drummer Greg D'Angelo in 1983) are the only two members to appear on every album, while Bello has been a member of Anthrax since 1984, replacing original bassist Dan Lilker. After two stints in Anthrax, from 1984 to 1992 and again from 2005 to 2007, Belladonna returned to the band in 2010.\n",
      "Anthrax was formed in Queens, New York City, on July 18, 1981, by guitarists Scott Ian and Dan Lilker. The band was named after the disease of the same name which Ian saw in a biology textbook, chosen because it sounded \"sufficiently evil\". Lilker originally intended for Scott Setari to play bass in the band, during their early phases as a cover band. Anthrax's initial line-up was completed by singer John Connelly, drummer Dave Weiss and bassist Paul Kahn. Kahn was briefly replaced by bassist Kenny Kushner before Lilker took over on bass and Greg Walls joined as lead guitarist. Weiss was then replaced early on by Greg D'Angelo, who was recommended to the band by Greg Walls. Scott Ian's younger brother Jason Rosenfeld was a temporary vocalist until Ian's former schoolmate Neil Turbin joined the band in late August 1982. The band recorded its first demo tape during this time.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, U.S."
      ],
      "Genres": [
         "Heavy metal",
         "thrash metal",
         "speed metal",
         "groove metal",
         "alternative metal"
      ],
      "Years active": [
         "1981–present"
      ],
      "Labels": [
         "Megaforce",
         "Island",
         "Elektra",
         "Sanctuary",
         "Nuclear Blast"
      ],
      "Associated acts": [
         "Stormtroopers of Death",
         "Armored Saint",
         "Nuclear Assault"
      ],
      "Website": [
         "anthrax.com"
      ],
      "Members": [
         "Scott Ian",
         "Charlie Benante",
         "Frank Bello",
         "Joey Belladonna",
         "Jonathan Donais"
      ],
      "Past members": [
         "See Members"
      ]
   },
   "albums": [
      "Fistful of Metal",
      "Spreading the Disease",
      "Among the Living",
      "State of Euphoria",
      "Persistence of Time",
      "Sound of White Noise",
      "Stomp 442",
      "Volume 8: The Threat Is Real",
      "We've Come for You All",
      "Worship Music",
      "For All Kings"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from New York City, formed in [YEAR] by rhythm guitarist Scott Ian and bassist [PERSON_NAME_FULL_0_MALE]. The group is considered one of the leaders of the thrash metal scene from the [YEAR]s and is part of the [SONG_NAME] of the genre, along with Metallica, Megadeth and Slayer. They were also one of the first thrash metal bands (along with Overkill and Nuclear Assault) to emerge from the East Coast. The band has released 11 studio albums, several other albums, and 26 singles, including collaborating on a single with American hip hop group Public Enemy. According to Nielsen SoundScan, [BAND_NAME] sold 2.5 million records in the United States from [YEAR] to [YEAR], with worldwide sales of 10 million. Four of the band's studio albums have also achieved gold certifications by the RIAA, including their third full-length record Among the Living ([YEAR]), which cemented [BAND_NAME]'s reputation as one of the most successful thrash metal bands.\n",
      "[BAND_NAME]'s lineup has changed numerous times over their career, leaving Ian as the only constant member of the band. The band has had a revolving cast of singers and lead guitarists, including [PERSON_NAME_FULL_3_MALE], John Bush, [PERSON_NAME_FULL_1_MALE] and Rob Caggiano. Since [YEAR], the band has consisted of Ian, drummer [PERSON_NAME_FULL_4_MALE], bassist Frank Bello, vocalist [PERSON_NAME_FULL_0_MALE] and lead guitarist Jonathan Donais. Ian and [PERSON_NAME_LAST_4] (who replaced one-time drummer [PERSON_NAME_FULL_2_MALE] in [YEAR]) are the only two members to appear on every album, while Bello has been a member of [BAND_NAME] since [YEAR], replacing original bassist [PERSON_NAME_FIRST_1] [PERSON_NAME_LAST_5]. After two stints in [BAND_NAME], from [YEAR] to [YEAR] and again from [YEAR] to [YEAR], [PERSON_NAME_LAST_0] returned to the band in [YEAR].\n",
      "[BAND_NAME] was formed in Queens, New York City, on [MONTH] 18, [YEAR], by guitarists Scott Ian and [PERSON_NAME_FULL_5_MALE]. The band was named after the disease of the same name which Ian saw in a biology textbook, chosen because it sounded [SONG_NAME]. [PERSON_NAME_LAST_5] originally intended for Scott Setari to play bass in the band, during their early phases as a cover band. [BAND_NAME]'s initial line-up was completed by singer [PERSON_NAME_FULL_2_MALE], drummer Dave Weiss and bassist [PERSON_NAME_FULL_4_MALE]. [PERSON_NAME_LAST_4] was briefly replaced by bassist [PERSON_NAME_FULL_3_MALE] before [PERSON_NAME_LAST_5] took over on bass and [PERSON_NAME_FIRST_0] Walls joined as lead guitarist. Weiss was then replaced early on by [PERSON_NAME_FULL_0_MALE], who was recommended to the band by [PERSON_NAME_FIRST_0] Walls. Scott Ian's younger brother Jason Rosenfeld was a temporary vocalist until Ian's former schoolmate [PERSON_NAME_FULL_1_MALE] joined the band in late [MONTH] [YEAR]. The band recorded its first demo tape during this time.\n"
   ]
}