{
   "Name": "Behemoth (band)",
   "Sections": [
      "1 History",
      "1.1 Early career and first five albums (1991–2000)",
      "1.2 Zos Kia Cultus (Here and Beyond), Demigod and The Apostasy (2001–2008)",
      "1.3 Evangelion (2009–2010)",
      "1.4 Nergal's illness, recovery and The Satanist (2010–2016)",
      "1.5 I Loved You at Your Darkest (2017–present)",
      "2 Controversy",
      "3 Members",
      "3.1 Current",
      "3.2 Session/touring musicians",
      "3.3 Former",
      "3.4 Former session/touring musicians",
      "3.5 Touring musicians",
      "3.6 Timeline",
      "4 Discography",
      "5 Awards",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Behemoth is a Polish extreme metal band from Gdańsk, formed in 1991. They are considered to have played an important role in establishing the Polish extreme metal underground.[2]\n",
         "Until the late 1990s, the band played a traditional black metal style with heathen lyrical content, but soon changed to that of occult and thelemic themes written by their lead vocalist Nergal and Krzysztof Azarewicz. With the 1999 release of Satanica, the band demonstrated their presence in the death metal scene, while retaining their own signature style characterized by the drum work of Inferno and multi-layered vocals. Despite Behemoth having been labeled as death metal or thrash metal-influenced, Nergal has mentioned that he does not like the band to be labeled.[3][4]\n"
      ]
   },
   "History": {
      "Early career and first five albums (1991–2000)": {
         "text": [
            "Behemoth was formed in 1991 as a trio, with Nergal on guitar and vocals, Baal on the drums, and Desecrator on the guitar. They started with the demos Endless Damnation, and The Return of the Northern Moon.[5] The most significant however, was the fourth demo—...From the Pagan Vastlands (1994). This tape was released by Polish label Pagan Records, and later on through Wild Rags. Their next release was Sventevith (Storming Near the Baltic) in 1995. A year later, they recorded their second album Grom, which was released in 1996. Grom features many different influences and musical styles, using female vocals as well as acoustic guitars and synthesizers. At the same time, Behemoth finally got a chance to play live shows in its native country and finally tour around Europe, gaining stage experience. Two years later, the band recorded a third album, titled Pandemonic Incantations. The culmination of their increasing presence and metal media set a new standard for them.[6] However, due to a lack of promotion, the album was not well-publicized. After another extensive tour, Behemoth signed a two-album deal with Italy's Avantgarde Music in the fall of 1998. The first result of this new collaboration was the successful[7] album Satanica, on which the black metal sound had evolved into blackened death metal.\n",
            "The label also secured two European tours for the band in support of Deicide and Satyricon respectively. During that period, Behemoth had to go through some line-up changes and had problems with their ex-Polish label. By the time Satanica came out, Inferno and Les were out of the band. Nergal began looking for new members but could not find a new drummer. Inferno returned to the band in early 2000, along with new members Novy (formerly known from Devilyn, Vader and Dies Irae), who handled the bass duties, and Havok, who became the band's guitarist. After the line-up changes Behemoth signed with the Polish label Mystic Production. The follow-up release to Satanica was Thelema.6. Massive guitar parts and precise drumming, with influences from different sources, saw them progress further towards[8][9] blackened death metal.\n",
            "Thelema.6 was supported by the worldwide press and media,[2] including official releases in Russia and Brazil for the first time. Continuing the support for Thelema.6, Behemoth appeared in several prestigious live events like Wacken Open Air, With Full Force, Inferno Metal Festival, Mystic Festival, and Mind Over Matter Autumn. They started their first headlining tour alongside Carpathian Forest and Khold, followed by a festival tour in Poland (Thrash em All Fest. with Vader and Krisiun, among others).\n"
         ]
      },
      "Zos Kia Cultus (Here and Beyond), Demigod and The Apostasy (2001–2008)": {
         "text": [
            "In 2001, Behemoth focused on writing new material for a sixth studio album. Meantime, they completed their second headlining tour in Russia, Belarus and Ukraine. Having completed the recording of their new songs, Behemoth entered Hendrix Studio for the second time, with help of their friend and sound engineer Arkadiusz Malczewski, and produced Zos Kia Cultus (Here and Beyond).\n",
            "In February 2003, the band started their first tour in Norway, playing in cities such as Bergen, Oslo and Stavanger. On March 11, 2003, the American premiere, scheduled by Century Media Records, headlined Behemoth's first appearance in the American continent. The tour started on the 9th of March at the New Jersey's Metalfest and continued with a decent number[10] of shows across America and Canada, with the company of Deicide, Revenge, Vehemence and Amon Amarth. Shortly after doing their first US tour the band was invited to join the Blackest of the Black Tour by Glenn Danzig. The already legendary festival included acts like Danzig, Superjoint Ritual, Nile, and Opeth. In fall 2003, Behemoth flew to the US to complete their third tour with Six Feet Under, Skinless and The Black Dahlia Murder. The band then played at the Tuska Festival in Finland with Ministry, Soulfly, among others. At that time, due to some line up difficulties, Nergal parted his ways with Havok and Novy, who decided to focus on activities with their own bands. Eventually, the band resumed touring in the UK and Europe.\n",
            "In 2004, their seventh studio album, Demigod, was released to good critical response. Recorded at the Hendrix Studios, the album debuted at number 15 on the national Polish album charts. Music videos for the songs \"Conquer All\" and \"Slaves Shall Serve\" were also shot. In fall 2005, the band headlined the Demigod supremacy Canadian tour 2005 with Necronomicon.\n",
            "In 2007, the band toured Europe alongside Napalm Death, Moonspell and Dew-Scented. Behemoth released their eighth studio album The Apostasy in July of that year. It was recorded at Radio Gdańsk studio in December, 2006. Shortly after the release of The Apostasy, the band was featured as one of Ozzfest 2007's second stage headliners, one of the four non-US bands playing that year.[11] In October/November 2007, they played their first US headlining tour alongside Job for a Cowboy, Gojira, and Beneath the Massacre.[12] In October/November 2007 the band toured Europe alongside Canadian death metal combo Kataklysm and Belgium's Aborted.\n",
            "In February 2008, Behemoth began a headlining tour along with Suicide Silence. In April/May 2008 the band toured North America as part of \"The Invaluable Darkness\" tour with Keep of Kalessin and headliner Dimmu Borgir. Behemoth spent the summer playing a number of prominent festivals all over Europe.\n",
            "In October 2008, Behemoth released their first live album, At the Arena ov Aion – Live Apostasy. Also, an EP called Ezkaton was released featuring a re-recorded version of Chant for Eschaton 2000, one new song, two covers (Master's Hammer, together with Root members Igor Hubik and Big Boss, and Ramones), and three live songs. The EP has been released in North America on November 11.\n"
         ]
      },
      "Evangelion (2009–2010)": {
         "text": [
            "In March 2009, the band suggested that the new album, due in the summer, be produced by British producer Colin Richardson.[13] Behemoth released its 9th full-length album entitled Evangelion on August 9 via Nuclear Blast in Europe and August 11 via Metal Blade in US.[14] \"Shemhamforash\", a track from this album, was released in July 2009 on their MySpace profile.[15]\n",
            "In July and August 2009, Behemoth participated in the Rockstar Mayhem Festival alongside a variety of metal bands such as Slayer, Bullet for My Valentine, All That Remains, Trivium, Marilyn Manson, Cannibal Corpse and Job for a Cowboy. In September 2009 Behemoth headlined the \"New Evangelion\" Polish tour alongside Azarath, Black River and Hermh.[16]\n",
            "In January 2010, Behemoth toured North America during \"Evangelia Amerika Tour\". In March they toured Europe with shows in Scandinavia, Greece and Turkey. In April, Behemoth toured Japan, Australia and New Zealand. In May they started European \"Evangelion Summer Campaign 2010\" with shows on open-air festivals in Austria, Switzerland, Germany, Sweden, Denmark and Poland. In June and July they toured France, Spain, Portugal, Italy, Belgium, Switzerland, Turkey, Serbia and Croatia with Decapitated and Ex Deo. In July and August they performed on next open-air festivals, in Czech Republic and Poland.\n"
         ]
      },
      "Nergal's illness, recovery and The Satanist (2010–2016)": {
         "text": [
            "In August 2010, Nergal was rushed to a hospital and was diagnosed with leukemia. It was reported that his leukemia was so advanced that chemotherapy couldn't help him; however, that has been proven false. Doda, his girlfriend at that time, offered her bone marrow for a transplant but tests showed she wasn't a match.[17] A donor was subsequently found. Behemoth was forced to cancel all upcoming shows in August, including the Sonisphere Festival in Finland, concerts in Russia, Belarus and Baltic States in September and October, and their North American tour \"Lawless States of Heretika\" with Watain, Withered and Black Anvil in November and December.\n",
            "Behemoth's live DVD Evangelia Heretika was released on November 9, 2010.[18] The DVD package includes two DVDs featuring Live in Warsaw 2009, Live in Paris 2008, Documentaries, Bonus Material and an Audio CD.[19]\n",
            "On January 17, 2011, Nergal left the hematology division of Uniwersyteckie Centrum Kliniczne, four weeks after he underwent a bone marrow transplant procedure. He said that he would take several months of recovery while living in his flat in one of the Gdańsk's districts in order to restore his physical condition. He also announced that he was eager to resume playing the guitar again, its having been six months since he last played. He also said that he had a huge motivation and desire to continue his work with the band, thanking all people who helped him.[20]\n",
            "According to Nergal, a new album and tour for 2012 were both in the works.[21]\n",
            "In an April 18, 2012 interview with Blabbermouth, Nergal stated that the new album's possible release date to be in the middle of 2013, and also stated that \"But, I can tell you that there are at least three or four rough sketches of songs, just ideas. Main riffs, main themes. We will be building around these ideas, so about one-third of the album is underway.\"[22]\n",
            "The band was slated to play the 2013 Mayhem Festival, alongside Amon Amarth, Rob Zombie, Mastodon, Children of Bodom and others,[23] but cancelled due to drummer Inferno taking ill and needing appendix surgery.[24]\n",
            "On May 30, 2013, Behemoth announced that the title of their tenth studio album would be The Satanist; it was released on February 3, 2014 and received widespread acclaim by both critics and audiences. On February 26, 2014 the band was announced to be playing Download Festival in June. On July 27, 2014 Behemoth performed live on Carpathian Alliance Open Air Metal Festival in Ukraine as a headliner. Behemoth have also scheduled a North American tour to take place in early 2015, co-headlining with Cannibal Corpse with support from Aeon and Tribulation.\n",
            "On August 9, 2015, Behemoth were announced as the special guests at Bloodstock Open Air in 2016, playing The Satanist in its entirety on Friday, August 12, 2016.\n",
            "Due to Inferno becoming a father in July 2017, Jon Rice replaced him on drums at the American summer tour with Slayer and Lamb of God.[25]\n"
         ]
      },
      "I Loved You at Your Darkest (2017–present)": {
         "text": [
            "In 2016, the band announced that they would start working on the follow-up to The Satanist.[26] In early 2017, Nergal started posting clips of riffs on his Instagram account. He also revealed that the band would release a new \"live DVD\", recorded in Warsaw, later that year.[27] In a May 2017 interview, Nergal said that the band had \"ten or thirteen, already, sketches of new songs\" for the new album, with an estimated release date in the fall of 2018.[28] The band entered the studio in November 2017 to record their eleventh studio album.[29]\n",
            "On January 22, 2018, Behemoth was announced as one of the supporting acts for Slayer's final world tour.[30]\n",
            "On April 13, 2018, the live concert DVD Messe Noire was released as a conclusion to The Satanist touring cycle.[31]\n",
            "On August 2, 2018, the band released \"God = Dog\", the first single from I Loved You at Your Darkest, which came out on October 5, 2018.[32] With the album releases, the band is set to go on the North American Tour on October 20, 2018.[33]\n",
            "In August 2019, the band was announced as the support act for Slipknot's 2020 European tour. \n",
            "In March 2021 Nergal announced that the band was preparing a new album to celebrate their 30th anniversary.[34]\n"
         ]
      }
   },
   "Controversy": {
      "text": [
         "In July 2007, the All-Polish Committee for Defense Against Sects distributed to many Polish officials a list of bands that allegedly promote Satanism and murder. Critics of this policy primarily see this as a violation of free speech. The list has not gone into effect, and Behemoth were allowed to play in Poland freely.[35][36] In October 2014 this changed when Behemoth was banned from performing in Poznań.[37]\n",
         "Nergal has repeatedly been on trial in Poland for tearing up the Bible in a 2007 incident.[38]\n",
         "In May 2014, Russia expelled Behemoth for 4 – 5 years because of visa issues.[39]\n",
         "In 2019, Nergal sparked controversy by posting a picture of himself wearing a \"Black Metal against ANTIFA\" shirt on Instagram.[40]\n"
      ]
   },
   "Members": {
      "Current": {},
      "Session/touring musicians": {},
      "Former": {
         "text": [
            "\n"
         ]
      },
      "Former session/touring musicians": {},
      "Touring musicians": {
         "text": [
            "\n"
         ]
      },
      "Timeline": {}
   },
   "Discography": {
      "text": [
         "Studio albums\n",
         "EPs\n",
         "Demos\n",
         "Live albums\n"
      ]
   },
   "Awards": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Behemoth is a Polish extreme metal band from Gdańsk, formed in 1991. They are considered to have played an important role in establishing the Polish extreme metal underground.[2]\n",
      "Until the late 1990s, the band played a traditional black metal style with heathen lyrical content, but soon changed to that of occult and thelemic themes written by their lead vocalist Nergal and Krzysztof Azarewicz. With the 1999 release of Satanica, the band demonstrated their presence in the death metal scene, while retaining their own signature style characterized by the drum work of Inferno and multi-layered vocals. Despite Behemoth having been labeled as death metal or thrash metal-influenced, Nergal has mentioned that he does not like the band to be labeled.[3][4]\n",
      "Behemoth was formed in 1991 as a trio, with Nergal on guitar and vocals, Baal on the drums, and Desecrator on the guitar. They started with the demos Endless Damnation, and The Return of the Northern Moon.[5] The most significant however, was the fourth demo—...From the Pagan Vastlands (1994). This tape was released by Polish label Pagan Records, and later on through Wild Rags. Their next release was Sventevith (Storming Near the Baltic) in 1995. A year later, they recorded their second album Grom, which was released in 1996. Grom features many different influences and musical styles, using female vocals as well as acoustic guitars and synthesizers. At the same time, Behemoth finally got a chance to play live shows in its native country and finally tour around Europe, gaining stage experience. Two years later, the band recorded a third album, titled Pandemonic Incantations. The culmination of their increasing presence and metal media set a new standard for them.[6] However, due to a lack of promotion, the album was not well-publicized. After another extensive tour, Behemoth signed a two-album deal with Italy's Avantgarde Music in the fall of 1998. The first result of this new collaboration was the successful[7] album Satanica, on which the black metal sound had evolved into blackened death metal.\n",
      "The label also secured two European tours for the band in support of Deicide and Satyricon respectively. During that period, Behemoth had to go through some line-up changes and had problems with their ex-Polish label. By the time Satanica came out, Inferno and Les were out of the band. Nergal began looking for new members but could not find a new drummer. Inferno returned to the band in early 2000, along with new members Novy (formerly known from Devilyn, Vader and Dies Irae), who handled the bass duties, and Havok, who became the band's guitarist. After the line-up changes Behemoth signed with the Polish label Mystic Production. The follow-up release to Satanica was Thelema.6. Massive guitar parts and precise drumming, with influences from different sources, saw them progress further towards[8][9] blackened death metal.\n"
   ],
   "infobox": {
      "Origin": [
         "Gdańsk, Poland"
      ],
      "Genres": [
         "Blackened death metal[1]",
         "death metal[2]",
         "black metal (early)"
      ],
      "Years active": [
         "1991–present"
      ],
      "Labels": [
         "Metal Blade",
         "Nuclear Blast",
         "Wild Rags",
         "Pagan",
         "Avantgarde",
         "Regain",
         "Century Media",
         "Mystic Production"
      ],
      "Associated acts": [
         "Blindead"
      ],
      "Website": [
         "www.behemoth.pl"
      ],
      "Members": [
         "Nergal",
         "Inferno",
         "Orion",
         "Seth"
      ],
      "Past members": [
         "Baal Ravenlock",
         "Desecratorx",
         "Frost",
         "Orcus",
         "Les",
         "Mefisto",
         "Havoc"
      ]
   }
}