{
   "Name": "Crime (band)",
   "rawData": [
      "Crime was an early American punk band from San Francisco, California, United States. The band was formed in 1976 by Johnny Strike (vocals, guitar), Frankie Fix (vocals, guitar), Ron \"The Ripper\" Greco (bass; ex-Flamin' Groovies), and Ricky Tractor (Ricky Williams) (drums). Their debut, the self-financed double A-side, \"Hot Wire My Heart\" and \"Baby You're So Repulsive\", appeared at the end of 1976, and is the first single released by a U.S. punk act from the West Coast.\n",
      "The band's sound was characterized by simple rock-and-roll arrangements played at intensely high volumes. Michael Goldberg, critic for New York Rocker magazine, wrote in 1978: \"Crime play loud. So loud that the plate glass window at the opposite end of the club shakes, tables tremble and people hang onto their drinks. Loudness may be Crime's only musical raison d'etre. This band is a literal translation of the concept 'minimal.' Drummer Hank Rank thumps out a simple Bo Diddley beat that is only adequate in the context of the rest of the band. Bassist Ron the Ripper coaxes a thick rumble from his amp that reminds one of the thunder of a bulldozer rolling over rugged terrain. And the guitar playing of  Strike and Frankie Fix make you feel like you've been forcefully held underwater for the full 25 minutes of the set.\"\n",
      "In Issue #13 of Ugly Things Magazine, critic Mike Stax wrote: \"CRIME's music didn't conform to the norm either.  They didn't use the standard-issue highspeed buzzsaw guitar approach.  Instead their noisy attacks were an unpredictable stew of clanging, howling guitars and shuddering rhythms - more of an intense sonic RUMBLE than anything else.\"\n"
   ],
   "infobox": {
      "Genres": [
         "Punk rock"
      ],
      "Years active": [
         "1976–1982",
         "2006–2017"
      ],
      "Labels": [
         "Crime Music",
         "B-Square",
         "Solar Lodge",
         "Swami",
         "FYBS",
         "Kitten Charmer",
         "Superior Viaduct"
      ],
      "Associated acts": [
         "Flamin' Groovies",
         "Flipper",
         "Toiling Midgets",
         "Vector Command",
         "TVH",
         "Remote Viewers",
         "Doctor D."
      ],
      "Past members": [
         "Johnny Strike",
         "Hank Rank",
         "Mickey Tractor",
         "Count Fink",
         "Frankie Fix",
         "Ron \"The Ripper\" Greco",
         "Ricky Tractor",
         "Brittley Black",
         "Joey D'Kaye",
         "Pat 'Mosignor' Ryan"
      ]
   },
   "albums": [
      "San Francisco's Doomed",
      "Terminal Boredom",
      "Hate Us or Love Us, We Don't Give a Fuck",
      "Piss On Your Turntable",
      "San Francisco's Doomed",
      "Cadillac Faggot",
      "San Francisco's Still Doomed",
      "Exalted Masters",
      "Murder by Guitar"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from San Francisco, California, United States. The band was formed in [YEAR] by Johnny Strike (vocals, guitar), [PERSON_NAME_FULL_0_FEMALE] (vocals, guitar), Ron [SONG_NAME], appeared at the end of [YEAR], and is the first single released by a U.S. punk act from the West Coast.\n",
      "The band's sound was characterized by simple rock-and-roll arrangements played at intensely high volumes. Michael Goldberg, critic for New York Rocker magazine, wrote in [YEAR]: [SONG_NAME]\n",
      "In Issue #13 of Ugly Things Magazine, critic [PERSON_NAME_FULL_0_MALE] wrote: [SONG_NAME]\n"
   ]
}