{
   "Name": "Celtic Frost",
   "Sections": [
      "1 History",
      "1.1 Formation & first recordings (1984–1987)",
      "1.2 Stylistic changes, internal struggles, and first breakup (1987–1993)",
      "1.3 Post-breakup (1993–2001)",
      "1.4 Reunion (2001–2008)",
      "1.5 Definitive breakup, Triptykon and Martin Eric Ain's death (2008–present)",
      "2 Style and influences",
      "3 Legacy",
      "4 Band members",
      "4.1 Timeline",
      "5 Discography",
      "6 Music videos",
      "7 Bibliography",
      "8 References",
      "9 Sources",
      "10 External links"
   ],
   "Summary": {
      "text": [
         "Celtic Frost (/ˈkɛltɪk frɒst/)[1] were a Swiss extreme metal band from Zürich. They are known for their strong influence on the development of extreme metal[2][3] and avant-garde metal.[4] Formed in 1981 as Hellhammer, the band became Celtic Frost in 1984 and released their debut, Morbid Tales, that year. This was followed by To Mega Therion (1985) and the highly experimental Into the Pandemonium (1987), all of which were widely praised.[2] Their next album Cold Lake (1988) saw a new lineup and a radical change of style, which was widely derided.[2][4] After the release of Vanity/Nemesis (1990), the group disbanded. It re-formed in 2001 and released the critically acclaimed Monotheist (2006), before disbanding following frontman Tom Gabriel Fischer's departure in 2008.[5]\n",
         "Their music included elements of various extreme metal styles. Their earlier music was mostly classified as thrash metal and black metal with an experimental streak, while their last album was more akin to doom metal and gothic metal. Celtic Frost were inspired by metal bands such as Black Sabbath, Judas Priest and Venom as well as gothic rock groups like Bauhaus, Siouxsie and the Banshees and Christian Death[6] and by the hardcore punk of Discharge.[7]\n"
      ]
   },
   "History": {
      "Formation & first recordings (1984–1987)": {
         "text": [
            "Celtic Frost's frontman, guitarist and singer Tom Gabriel Fischer, adopted the alias Tom Warrior. With Steve Warrior on bass, he formed one of the earliest extreme metal bands, Hellhammer, in 1981. Steve Warrior was later replaced by Martin Eric Ain – also a pseudonym. The band attracted a small international fan-base, got signed to Noise Records in Germany and recorded their debut EP Apocalyptic Raids in March 1984, now a rare find on eBay or second-hand record stores around the world.\n",
            "Metal publications were also skeptical of Hellhammer's musical endeavor. Metal Forces loathed the group; that started a long-lasting feud between that zine and Warrior, which kept Celtic Frost from playing in England for a couple of years.[8] Rock Power was not fond of Hellhammer either – they considered it \"the most terrible, abhorrent, and atrocious thing ‘musicians’ were ever allowed to record\".[9] In fact, they were \"receiving miserable reviews everywhere\", Warrior concluded.[10]\n",
            "Regarding the controversial status of his former band, Thomas said:\n",
            "Way back in 1984 and 85, when Martin Eric Ain and I recorded Celtic Frost's first two albums Morbid Tales and To Mega Therion, Hellhammer lasted on us almost like a curse. Even though Hellhammer was the very reason we had thought over our goals and conceived the Frost, HH's left-overs kept being mighty rocks in our way. Many voices saw Frost as the same band with just a name-change. The lack of musical quality in HH made it almost impossible for us to get an unbiased reaction for Frost. To make a long story short, it almost killed all our work and dreams.[11]",
            "By May 1984, Hellhammer had disbanded. Fischer and Ain, along with session drummer Stephen Priestly, regrouped as Celtic Frost.  Their 1984 debut EP, Morbid Tales[12] was a hit in the underground metal scene, and the band set out on its first tour, through Germany and Austria. This was followed with an EP Emperor's Return. Both early releases are now available on one CD.\n",
            "One of their more influential recordings was 1985's To Mega Therion which did not feature Ain on bass, but stand-in Dominic Steiner. The cover artwork is a painting by H.R. Giger entitled Satan I. The album was a major influence on the then-developing death metal and black metal genres.[13] Ain did return after the album was recorded however. \n",
            "These albums were some of the pivotal LPs for underground metal and introduced a new and more varied sound. Celtic Frost, along with Venom and Bathory were pioneers in the still underground black metal scene, although Celtic Frost were much more experimental with the addition of classical instruments, operatic female vocals and sampling. \n"
         ]
      },
      "Stylistic changes, internal struggles, and first breakup (1987–1993)": {
         "text": [
            "In 1987 followed Into the Pandemonium. The album is more varied than many of Celtic Frost's past LPs, with unlikely covers (Wall of Voodoo's \"Mexican Radio\"), emotionally charged love songs, the album's recurring industrial-influenced rhythmic songs of demons and destruction, traditional Frost styled songs about dreams and fear, and a dark, classical piece with female vocals.\n",
            "The album is vastly different from the band's previous work and cemented its late 80s avant-garde metal term; it is also a departure from the extreme style found on the band's previous albums, Morbid Tales and To Mega Therion that Celtic Frost had become known for. However, it does have the recurring symphonic elements found on previous albums. The album has a more classic heavy metal style within the songs with elements of industrial, classical and gothic rock, and even has an industrial/electronic body music (EBM)-inspired rhythm in \"One in Their Pride\". It does have a few black metal elements remaining in Warrior's vocals, though, and some thrash-influenced guitar riffs.\n",
            "After a subsequent North American tour (which saw the addition of a second guitarist, Ron Marks to the group's ranks), financial trouble, personal tension between the band members and an ill-fated relationship with their record label led to a dissolution of the band. Six months later, Warrior reformed the band with Stephen Priestly back on drums, Oliver Amberg on guitars and Curt Victor Bryant on bass and recorded the fourth studio album Cold Lake, released on 1 September 1988 by Noise Records. Despite it being marketed to exploit the mass appeal of glam metal, the album has more of a traditional heavy metal sound.\n",
            "Bryant fired Amberg and former live show guitarist Ron Marks returned for the recording of Vanity/Nemesis in 1990. The most significant change, however, was the return of early bassist Martin Eric Ain, but Celtic Frost's reputation did not fully recover. The group's next (and, as it would turn out, last for several years) album was a collection of rare recordings called Parched with Thirst Am I and Dying (1992). The compilation's title was inspired by an old Roman prayer.[14] It featured unreleased material, re-recorded versions of older songs and some studio session versions.[14]\n",
            "A final proposed album titled \"Under Apollyon's Sun\" was never made under that title, although Fischer co-founded a new group called Apollyon Sun.\n"
         ]
      },
      "Post-breakup (1993–2001)": {
         "text": [
            "Several years following the disbanding of Celtic Frost, and after quite some time spent away from the music industry, Fischer co-founded a new group called Apollyon Sun with his close friend Erol Unala on guitars in the mid-1990s and recorded an EP God Leaves (And Dies) and a full-length album Sub. Although clearly based on Celtic Frost's dark and more adventurous music, Apollyon Sun was an industrial metal project. During his hiatus from music, Fischer had also finished work on an autobiographical book, called Are You Morbid?, which was published by London-based Sanctuary Publishing to fan acclaim in 2000. Currently averaging a 3.73 rating on Goodreads.[15]\n"
         ]
      },
      "Reunion (2001–2008)": {
         "text": [
            "In late 2001, Fischer and Ain began to write music together again, along with Unala on guitar and, from late 2002, experienced Swiss drummer Franco Sesa (also known within the group under the stage name Inverted Cross). The aim was to develop and record a new, very dark and heavy album. The completion of the project took far longer than anticipated (in part due to the DIY nature of the project and the project's financing) but finally resulted, in late 2005, in what Fischer and Ain describe as \"perhaps the darkest album Celtic Frost have ever recorded\", based on a combination of the musical aura of To Mega Therion and Into the Pandemonium.\n",
            "The newest and seventh Celtic Frost album was financed by the group itself through its own label, Prowling Death Records, and publishing imprint, Diktatur des Kapitals. Prowling Death Records originally was the self-founded underground label which released the Hellhammer demos and managed Hellhammer's career in 1983 and 1984. The album was produced by Celtic Frost with Peter Tägtgren (of Bloodbath/Hypocrisy/Pain) and mixed by Fischer and Ain. Celtic Frost and Prowling Death Records subsequently entered into a worldwide licensing deal with Century Media Records. The album, titled Monotheist, was released on May 29, 2006.\n",
            "On May 29, 2006, Celtic Frost embarked on the most extensive tour of the band's career, the \"Monotheist Tour\", initially headlining festivals (e.g. the Wacken Open Air festival, in front of an audience of 50,000) across Europe the United States and Canada in 2006, and the group's first ever shows in Japan in January 2007. In early 2007 the European leg of the tour took place and a return to the United States as a special guest to Type O Negative. Further festival appearances and concerts followed in mid-2007.\n",
            "On stage, Celtic Frost play with an additional tour guitar player, who plays rhythm guitar and provides a fuller sound. This position was initially filled by Anders Odden (Cadaver, Satyricon, Magenta), and later by V Santura (of Dark Fortress).\n",
            "In early 2007, Celtic Frost began writing material for a new album.[citation needed]\n",
            "Metalunderground posted a statement from Tom Fischer regarding the new album.\n",
            "Only a few hours until I am to depart to Norway for a few weeks to participate in the production of a black metal project with close friends and peers. In early March I shall return to Switzerland to take further steps towards the realization of my own black metal/doom side project, the idea for which has taken an increasingly defined shape during the past months.",
            "Fischer spoke to Spanish metal webzine Hall of Metal[when?] about new material: \"I'm actually working on a new album of Celtic Frost and I think it's going to be really extreme and dark. Celtic Frost has its own style, its own sound and it expresses a lot of emotions. The music I write shows the state of my life, and now I feel very comfortable with such dark music.\"[citation needed]\n",
            "As of Celtic Frost's announcement of their second breakup in September 2008,[5] there is no talk of recording and releasing the new album. The last shows of Celtic Frost were in Mexico, one on October 12, 2007, in Monterrey, and the last one on October 13, 2007, in Mexico City.\n"
         ]
      },
      "Definitive breakup, Triptykon and Martin Eric Ain's death (2008–present)": {
         "text": [
            "Fischer tendered his resignation from Celtic Frost on April 9, 2008, with this message displayed on the band's official website:\n",
            "Celtic Frost singer and guitarist Tom Gabriel Fischer has left Celtic Frost due to the irresolvable, severe erosion of the personal basis so urgently required to collaborate within a band so unique, volatile, and ambitious.",
            "Bassist Ain stated that the band was \"still alive, albeit in a coma of sorts.\" He went on further to say that the remainder of the band is \"not going to continue recording or touring,\" saying this \"would be preposterous\" without Fischer.[16] Fischer has himself gone on to form a new band called Triptykon, featuring Celtic Frost touring guitarist V Santura, original Celtic Frost drummer Reed St. Mark (although he has since departed and was replaced by Norman Lonhard), as well as bassist Vanja Slajh. Fischer has also said that his new band will sound similar to the direction Celtic Frost took on their 2006 album, Monotheist.[17]\n",
            "On September 9, 2008, Celtic Frost members Martin Eric Ain and Tom Gabriel Fischer confirmed on Celtic Frost's official website that the band had \"jointly decided to lay Celtic Frost to rest for good\".[5]\n",
            "On October 21, 2017, Martin Eric Ain died from a heart attack.[18]\n"
         ]
      }
   },
   "Style and influences": {
      "text": [
         "Celtic Frost's style gradually changed over the years. The band's early work has been described as thrash metal[19][20] and death metal.[20] Celtic Frost has also been described as avant-garde metal due to their use of classical and electronica elements in some of their music, such as on their album To Mega Therion.[20] Although Celtic Frost are often described as black metal, according to authors Axl Rosenberg and Christopher Krovatin, the band's \"music was too tight, and its connection to old school rock 'n' roll music too readily apparent, to be black metal.\"[21] Celtic Frost's later work has been described as doom metal.[22]\n",
         "Tom G. Warrior said that there were two types of music that influenced him: heavy metal and new wave. \"In Heavy Metal, it's fair to say bands like Black Sabbath, Angel Witch and Venom influenced us. Martin and I were heavily influenced by the New Wave music of the time too, such as Bauhaus, Siouxsie and the Banshees, Christian Death and I think it's a mix of these musical directions that influenced the sound of Celtic Frost\".[23] Ain was also marked by Joy Division while Warrior also came from a jazz and classical background. \"I loved the ‘70s prog bands like Emerson, Lake & Palmer, early Roxy Music\". [24]\n"
      ]
   },
   "Legacy": {
      "text": [
         "Celtic Frost have influenced a number of black metal, death metal, thrash metal, and standard heavy metal bands. The band Therion, for example, took its band name from the album To Mega Therion.[25] Other bands that have cited Celtic Frost as an influence, or have covered Celtic Frost, include Anthrax, Obituary, Death, Benediction, Brutal Truth, Neurosis, Eyehategod, Cradle of Filth, Marduk, Dimmu Borgir, Goatwhore, Sepultura, Cancer, Asphyx, Pro-Pain, Gorgoroth, Gallhammer, Paradise Lost, Evoken, Napalm Death, and many others. Kurt Cobain and Krist Novoselic from Nirvana were fans of Celtic Frost.\n",
         "Dave Grohl (ex-Nirvana, Foo Fighters) and Mark Tremonti (Alter Bridge, Creed) have both stated on several occasions that Celtic Frost were an influence. Grohl subsequently invited Celtic Frost singer Tom Gabriel Fischer to participate in the recordings of his 2004 solo project, Probot, resulting in the co-written song \"Big Sky\". Alternative country singer Ryan Adams has also claimed influence from Celtic Frost, amongst many other metal bands.\n",
         "In 1996, Dwell Records released In Memory of Celtic Frost, a collection of songs covered by other bands. Notable bands that appeared on this tribute collection include Enslaved, covering the song \"Procreation (of the Wicked)\"; Opeth, covering the song \"Circle of the Tyrants\"; Swedish death metal band Grave, covering the song \"Mesmerized\"; Canadian thrash metal band Slaughter, covering the song \"Dethroned Emperor\"; Apollyon Sun (featuring Tom G. Warrior himself), covering the song \"Babylon Fell\"; and the Norwegian black metal bands Emperor, covering \"Massacra\", and Mayhem, covering the song \"Visual Aggression\". The tribute album also features Celtic Frost songs covered by several lesser known and now defunct metal bands. The hard to find CD is now out of print.\n",
         "Despite this, when Fischer was asked to comment on their influence on heavy metal, he replied: \"No, I try to stay away from that. I'm a musician, I don't want to get involved with all that. It's not healthy. I want to do good albums. I'm still alive and I feel there's still so much in front of me. I don't want to be bothered with who has influence and where we stand and all that. I think it's a negative thing.\"[26]\n",
         "In 2015, Corpse Flower Records released a tribute of their own entitled Morbid Tales! A Tribute to Celtic Frost. Notably, it compiles a number of Celtic Frost covers by other bands, including Child Bite (featuring Phil Anselmo), Acid Witch, Municipal Waste, Hayward (featuring members of Neurosis), among others.[27]\n",
         "In 2018, British deathcore band, Black Tongue covered the song, A Dying God Coming Into Human Flesh, on their second album, Nadir which was released on Halloween of 2018.[28]\n"
      ]
   },
   "Band members": {
      "Timeline": {},
      "text": [
         "\n",
         "\n",
         "\n",
         "\n"
      ]
   },
   "Discography": {
      "text": [
         "Studio albums\n",
         "EPs\n",
         "Singles\n",
         "Compilations\n",
         "Video albums\n"
      ]
   },
   "Music videos": {},
   "Bibliography": {},
   "References": {},
   "Sources": {},
   "External links": {},
   "coreData": [
      "Celtic Frost (/ˈkɛltɪk frɒst/)[1] were a Swiss extreme metal band from Zürich. They are known for their strong influence on the development of extreme metal[2][3] and avant-garde metal.[4] Formed in 1981 as Hellhammer, the band became Celtic Frost in 1984 and released their debut, Morbid Tales, that year. This was followed by To Mega Therion (1985) and the highly experimental Into the Pandemonium (1987), all of which were widely praised.[2] Their next album Cold Lake (1988) saw a new lineup and a radical change of style, which was widely derided.[2][4] After the release of Vanity/Nemesis (1990), the group disbanded. It re-formed in 2001 and released the critically acclaimed Monotheist (2006), before disbanding following frontman Tom Gabriel Fischer's departure in 2008.[5]\n",
      "Their music included elements of various extreme metal styles. Their earlier music was mostly classified as thrash metal and black metal with an experimental streak, while their last album was more akin to doom metal and gothic metal. Celtic Frost were inspired by metal bands such as Black Sabbath, Judas Priest and Venom as well as gothic rock groups like Bauhaus, Siouxsie and the Banshees and Christian Death[6] and by the hardcore punk of Discharge.[7]\n",
      "Celtic Frost's frontman, guitarist and singer Tom Gabriel Fischer, adopted the alias Tom Warrior. With Steve Warrior on bass, he formed one of the earliest extreme metal bands, Hellhammer, in 1981. Steve Warrior was later replaced by Martin Eric Ain – also a pseudonym. The band attracted a small international fan-base, got signed to Noise Records in Germany and recorded their debut EP Apocalyptic Raids in March 1984, now a rare find on eBay or second-hand record stores around the world.\n",
      "Metal publications were also skeptical of Hellhammer's musical endeavor. Metal Forces loathed the group; that started a long-lasting feud between that zine and Warrior, which kept Celtic Frost from playing in England for a couple of years.[8] Rock Power was not fond of Hellhammer either – they considered it \"the most terrible, abhorrent, and atrocious thing ‘musicians’ were ever allowed to record\".[9] In fact, they were \"receiving miserable reviews everywhere\", Warrior concluded.[10]\n"
   ]
}