{
   "Name": "Celtic Frost",
   "rawData": [
      "Celtic Frost (/ˈkɛltɪk frɒst/) were a Swiss extreme metal band from Zürich. They are known for their strong influence on the development of extreme metal and avant-garde metal. Formed in 1981 as Hellhammer, the band became Celtic Frost in 1984 and released their debut, Morbid Tales, that year. This was followed by To Mega Therion (1985) and the highly experimental Into the Pandemonium (1987), all of which were widely praised. Their next album Cold Lake (1988) saw a new lineup and a radical change of style, which was widely derided. After the release of Vanity/Nemesis (1990), the group disbanded. It re-formed in 2001 and released the critically acclaimed Monotheist (2006), before disbanding following frontman Tom Gabriel Fischer's departure in 2008.\n",
      "Their music included elements of various extreme metal styles. Their earlier music was mostly classified as thrash metal and black metal with an experimental streak, while their last album was more akin to doom metal and gothic metal. Celtic Frost were inspired by metal bands such as Black Sabbath, Judas Priest and Venom as well as gothic rock groups like Bauhaus, Siouxsie and the Banshees and Christian Death and by the hardcore punk of Discharge.\n",
      "Celtic Frost's frontman, guitarist and singer Tom Gabriel Fischer, adopted the alias Tom Warrior. With Steve Warrior on bass, he formed one of the earliest extreme metal bands, Hellhammer, in 1981. Steve Warrior was later replaced by Martin Eric Ain – also a pseudonym. The band attracted a small international fan-base, got signed to Noise Records in Germany and recorded their debut EP Apocalyptic Raids in March 1984, now a rare find on eBay or second-hand record stores around the world.\n"
   ],
   "infobox": {
      "Origin": [
         "Zürich, Switzerland"
      ],
      "Genres": [
         "Thrash metal, black metal, doom metal"
      ],
      "Years active": [
         "1984–1987, 1988–1993, 2001–2008"
      ],
      "Labels": [
         "Century Media, Noise, Metal Blade"
      ],
      "Associated acts": [
         "Hellhammer, Apollyon Sun, Mind Funk, Triptykon, Kharma, Coroner, Tar Pond"
      ],
      "Website": [
         "celticfrost.com"
      ],
      "Past members": [
         "Thomas Gabriel Fischer",
         "Martin Eric Ain",
         "Franco Sesa",
         "Isaac Darso",
         "Stephen Priestly",
         "Reed St. Mark",
         "Ron Marks",
         "Dominic Steiner",
         "Curt Victor Bryant",
         "Oliver Amberg",
         "Erol Unala"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (/ˈkɛltɪk frɒst/) were a [GENRE] band from Zürich. They are known for their strong influence on the development of extreme metal and avant-garde metal. Formed in [YEAR] as Hellhammer, the band became [BAND_NAME] in [YEAR] and released their debut, Morbid Tales, that year. This was followed by To Mega Therion ([YEAR]) and the highly experimental Into the Pandemonium ([YEAR]), all of which were widely praised. Their next album Cold Lake ([YEAR]) saw a new lineup and a radical change of style, which was widely derided. After the release of Vanity/Nemesis ([YEAR]), the group disbanded. It re-formed in [YEAR] and released the critically acclaimed Monotheist ([YEAR]), before disbanding following frontman [PERSON_NAME_FULL_0_MALE]'s departure in [YEAR].\n",
      "Their music included elements of various extreme metal styles. Their earlier music was mostly classified as thrash metal and black metal with an experimental streak, while their last album was more akin to doom metal and gothic metal. [BAND_NAME] were inspired by metal bands such as Black Sabbath, Judas Priest and Venom as well as gothic rock groups like Bauhaus, Siouxsie and the Banshees and Christian Death and by the hardcore punk of Discharge.\n",
      "[BAND_NAME]'s frontman, guitarist and singer [PERSON_NAME_FIRST_1] Gabriel Fischer, adopted the alias [PERSON_NAME_FULL_1_MALE]. With Steve [PERSON_NAME_LAST_1] on bass, he formed one of the earliest extreme metal bands, Hellhammer, in [YEAR]. Steve [PERSON_NAME_LAST_1] was later replaced by [MONTH]tin [PERSON_NAME_FULL_0_MALE] – also a [GENRE] band attracted a small international fan-base, got signed to Noise Records in Germany and recorded their debut EP Apocalyptic Raids in [MONTH] [YEAR], now a rare find on eBay or second-hand record stores around the world.\n"
   ]
}