{
   "Name": "Converge (band)",
   "Sections": [
      "1 History",
      "1.1 Early years and Halo in a Haystack (1990–1994)",
      "1.2 Petitioning the Empty Sky, When Forever Comes Crashing and line-up changes (1995–1999)",
      "1.3 Jane Doe (2000–2003)",
      "1.4 You Fail Me and No Heroes (2004–2007)",
      "1.5 Axe to Fall (2008-2011)",
      "1.6 All We Love We Leave Behind (2012–2016)",
      "1.7 The Dusk In Us and Beautiful Ruin (2017–present)",
      "2 Artistry",
      "2.1 Musical style and influences",
      "2.2 Lyrics and vocal delivery",
      "2.3 Artwork",
      "3 Collaborations",
      "3.1 With Cave In",
      "3.2 Blood Moon",
      "4 Members",
      "4.1 Timeline",
      "5 Discography",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Converge is an American  hardcore punk band formed by vocalist Jacob Bannon and guitarist Kurt Ballou in Salem, Massachusetts in 1990.[2][3] During the recording of their seminal fourth album Jane Doe, the group became a four-piece with the departure of guitarist Aaron Dalbec and the addition of bassist Nate Newton and drummer Ben Koller. This lineup has remained intact since. They have released nine studio albums, three live albums, and numerous EPs. The band's sound is rooted in both hardcore punk and heavy metal, and they are considered pioneers of metalcore as well as its subgenre mathcore.[4]\n",
         "Converge have enjoyed a relatively high level of recognition. According to AllMusic, they are \"regarded as one of the most original and innovative bands to emerge from the punk underground.\"[4] Their popularity rose with the release of Jane Doe, which was ranked as the best album of the decade by Sputnikmusic, the best album of 2001 by Terrorizer and later as the 61st best metal album of all time by Rolling Stone.[5][6] Subsequently, Converge moved from Equal Vision Records to the considerably larger label Epitaph Records and their records gradually became more elaborate and expensive to produce. Special releases have traditionally been handled by Deathwish Inc., established by Bannon in 1999. The band's ninth studio album, The Dusk in Us, was released in November 2017 through Deathwish and Epitaph.[7]\n"
      ]
   },
   "History": {
      "Early years and Halo in a Haystack (1990–1994)": {
         "text": [
            "Converge was formed in the winter of 1990 by Bannon and Ballou, they were later joined by high school friends Jeff Feinberg and Damon Bellorado in 1991.[8] They started by playing covers of hardcore punk, punk rock and heavy metal songs. The band soon graduated to playing live performances in mid-1991, after recording some demos on a 4-track recorder. The band started writing and playing what they consider \"relevant\" music in 1994.[8]\n",
            "In 1994 the band became a five piece when Dalbec was recruited as a second guitarist. Later in the year Converge released their debut album, Halo in a Haystack, released through Earthmaker Records. This was only released as a vinyl record and was limited to 1000 copies. The album has not been reprinted since its release.[9] The record was funded by Bannon through money he saved up from working at a nursing home.[10]\n"
         ]
      },
      "Petitioning the Empty Sky, When Forever Comes Crashing and line-up changes (1995–1999)": {
         "text": [
            "In 1995 Converge released their first compilation album, Caring and Killing. The album featured tracks from the band's early work from the years 1991 to 1994. The album was originally released as a European exclusive through Lost & Found Records.[11] However, Converge became dissatisfied with the way the label was handling the release and overcharging fans for their hard-to-find older songs. The album was re-released through Hydra Head Records on November 17, 1997 in America to \"make an overpriced release obsolete\".[12]\n",
            "In 1996 Converge released a four-song EP, Petitioning the Empty Sky. It was released through Ferret Music, and was one of the earliest releases through the newly-formed label. Later that same year the record was re-released with four additional new tracks. Two years later, the record was reissued through Converge's new label Equal Vision Records on January 20, 1998. This version contained the previous eight tracks as well as three newly added live tracks, recorded during a radio broadcast. Due to the addition of the new tracks, fans and sources consider this to be Converge's second studio album, while the band considers it a compilation album because it is a collection of songs recorded at different times.[13]\n",
            "In early 1997 the band's original bassist, Feinburg, left the band, and was replaced with Stephen Brodsky. Also that year, the band signed to Equal Vision Records.[14] On December 22, 1997, recording for the band's third studio album When Forever Comes Crashing began at Ballou's GodCity Studio; it finished on January 3, 1998.[15] On April 14, 1998 Converge released When Forever Comes Crashing through Equal Vision.\n",
            "In 1998, Brodsky left the band and was replaced by Newton, who initially joined the band as a part-time member while he was still active in another band, Jesuit. Jesuit later disbanded in 1999, allowing Newton to make Converge his main focus. In early 1999, the original drummer Bellorado left the band and was quickly replaced with John DiGiorgio,[16] who also left the band in the same year. Koller joined Converge in late 1999, replacing DiGiorgio.[16] Ballou selected Koller to temporarily fill in while Converge searched for a more permanent replacement for Bellorado, as he was familiar with his work in previous bands, Force Fed Glass and Blue/Green Heart, a band that Ballou and Koller played in together.[17][18] After working well with the band during some local shows in Boston, Converge made him an official member.[19][20] Newton and Koller remain in the band to this day.\n"
         ]
      },
      "Jane Doe (2000–2003)": {
         "text": [
            "In mid-2000 Converge self-released a three-track demo record titled Jane Doe Demos.[11] This was released on tour and was limited to 100 copies.[citation needed] It contained unreleased demo versions of \"Bitter & Then Some\" and \"Thaw\" from their upcoming album Jane Doe. Converge entered the studio to begin recording in the summer of 2001.\n",
            "On September 4, 2001, Converge released their fourth studio album, Jane Doe. It was met with immediate critical acclaim, with critics praising its poetic lyrics, dynamic range, ferocity and production.[21][22][23] The album was a commercial success in comparison to Converge's previous outings, and both the band and the album have developed a cult following since its release.\n",
            "It is the band's first studio album to feature Newton and Koller, and the last to feature Dalbec, who was asked to leave the band due to his devotion to his side project Bane.[24] Converge's first tour in support of Jane Doe was in September, 2001 with Drowningman and Playing Enemy,[25] however Drowningman later dropped out of the tour to work on a new album.[26]\n",
            "In 2002 a music video was released for the track/tracks \"Concubine/Fault and Fracture\" from the album Jane Doe; the music video was directed by Zach Merck.[14]\n",
            "On January 28, 2003 Converge released their second compilation album, Unloved and Weeded Out. The album was originally released as a three track EP in 1995.[13] The 2003 album version contains all three tracks from the 1995 EP but in total features 14 tracks, some of which were previously released rarities while others were previously unreleased.\n",
            "On February 25, 2003 Converge released their first official DVD, The Long Road Home. It is modeled after band home videos such as Metallica's Cliff 'Em All.[27] Deathwish Inc describes the DVD as a \"two disc collection that is as energetic and exciting as the moments the release captures\".[27] The DVD also comes with a bonus disk that included three full live sets from the band.\n"
         ]
      },
      "You Fail Me and No Heroes (2004–2007)": {
         "text": [
            "In early 2004 the band announced that they were signing to Epitaph Records, having previously been signed to Equal Vision. Bannon stated, \"We are confident as artists and genuinely happy about the move. We are part of a diverse, quality roster with Epitaph, rich in both history and integrity. We've struggled for years looking for a supportive label to call home and after a decade we have found it.\"[28]\n",
            "Converge began writing for You Fail Me after they recorded Jane Doe; they wrote on the road during sound checks of shows.[29] Converge entered the studio to begin recording in March 2004 mainly at GodCity Studio. On September 20, 2004 Converge released their fifth studio album, You Fail Me. It was the band's first to chart commercially, reaching number 171 on the Billboard 200.[30]\n",
            "On February 14, 2005 a music video was released for the track \"Eagles Become Vultures\", directed by Zach Merck.[31] Converge's first tour in support of You Fail Me started in September 2004 with Cave In and Between the Buried and Me.[32]\n",
            "In 2005 Equal Vision reissued Petitioning the Empty Sky and When Forever Comes Crashing. These reissues gave the albums one new bonus track each; Petitioning the Empty Sky received an alternate version of the song \"Love as Arson\" and When Forever Comes Crashing received a demo version of the song \"Bitter and Then Some\". These reissues also came with new album artwork by Aaron Turner of Isis. Ballou said in an interview that he wanted to remix and remaster the albums because the quality of Converge's recordings had improved so much that the original recordings were \"becoming distracting\".[33] These reissues became the standard versions of these albums.\n",
            "In early July, 2006 Converge's official website announced the title of their upcoming album, No Heroes, as well as the meaning behind it: \"These days, cowards outnumber the heroes, and the begging souls outweigh the calloused hands of the hardest of workers. Both in life and in art, the lack of passion is sickening, and the lust for complacency is poisonous. This album is the artistic antithesis of that sinking world; a thorn in the side of their beast. It's for those who move mountains one day at a time. It's for those who truly understand sacrifice. In our world of enemies, we will walk alone...\"[34]\n",
            "On October 24, 2006 Converge released their sixth studio album, No Heroes. This was the first Converge album to be self-produced by Ballou with no input from other producers, at his own GodCity Studio.[35]\n",
            "The same day as the album's release, Converge released a music video for the title track, directed by Ryan Zunkley.[36]\n",
            "Converge's first tour in support of No Heroes started in November 2006 with Some Girls, Modern Life Is War, Blacklisted, Kylesa and Gospel.[37] Despite their growing prominence, Converge continued to appear at small independent events such as Fluff Fest in the Czech Republic, which they played in 2007.[38]\n"
         ]
      },
      "Axe to Fall (2008-2011)": {
         "text": [
            "In November 2008 Converge began writing Axe to Fall. Following a short tour in March 2009 with Ceremony, Coliseum, Pulling Teeth and Rise and Fall, Converge entered the studio to begin recording in May 2009. During this short tour, the band debuted a few new songs live, and footage could be seen online.[39]\n",
            "The album was produced by Ballou, at GodCity Studio. In August 2009, two months prior to the release of Axe to Fall, Converge made the opening track, \"Dark Horse\", available for streaming and as a free download. It was noted for being one of the few tracks lacking guest musicians, and was met with a very positive reaction from reviewers. The title track was also made available for free download in September 2009. The entire album was available for streaming on Converge's MySpace page one week before the official release date. On October 14, 2009, a music video was released for the title track of the album, directed by Craig Murray.[40]\n",
            "On October 20, 2009 Converge released their seventh studio album, Axe to Fall. On November 7, the \"Axe to Fall\" video debuted on MTV2's heavy metal music program, Headbangers Ball.[41]\n",
            "Converge's first tour in support of Axe to Fall was the Metalocalypse tour in late 2009, sponsored by Cartoon Network's Adult Swim. Alongside High on Fire, Converge held an opening slot for co-headliners Mastodon and Dethklok.[42] Converge's first headlining tour in support of the album started in April 2010 with Coalesce, Harvey Milk, Gaza, Lewd Acts and Black Breath. Converge began the European part of their world tour in July 2010 with Kylesa, Gaza and Kvelertak.[43]\n",
            "In July 2010 the band released a limited-edition 7-inch vinyl single, On My Shield. It was released in three different colors, with each limited to 1,000 copies. One version was sold during Converge's 2010 European tours, one was sold through the band's Epitaph web store, and the final version was distributed to various vinyl retailers.[44][45]\n"
         ]
      },
      "All We Love We Leave Behind (2012–2016)": {
         "text": [
            "In January 2012 Converge completed writing for their eighth studio album, All We Love We Leave Behind.[46][47] The following day, Ballou announced plans via his Facebook page to begin recording with the band in January. On August 28, 2012 a music video was released for the track \"Aimless Arrow\" from the upcoming album, directed by Max Moore.[48][49] On the same day, Converge revealed the album's artwork, depicting a lunar cycle. On October 3, 2012, the album was available to stream in its entirety on YouTube, a week before its official release.[50]\n",
            "On October 9, 2012 Converge released their eighth studio album, All We Love We Leave Behind. It peaked at number 70 on the Billboard 200,[30] surpassing Axe to Fall in terms of commercial success. Converge's first headlining tour in support of All We Love We Leave Behind started in October 2012 with Torche, Kvelertak, Nails and Whips/Chains.[51]\n",
            "On April 17, 2014 another music video was released for the track \"Precipice / All We Love We Leave Behind\", directed by Craig Murray.[52]\n",
            "On October 15, 2015 Deathwish's YouTube channel released a trailer for Converge's Blu-ray set, Thousands of Miles Between Us. This was released on November 27, 2015.[53] The set was described by Deathwish as the long-awaited sequel to their landmark 2003 DVD release, The Long Road Home. The footage includes a full 20-song Converge set and over 15 hours of live, rare, and previously unseen footage, which is claimed to span over a decade in the life of the band.\n",
            "On April 29, 2016 Converge announced plans to reissue the album You Fail Me (12 years after the original release); it was made available for pre-order the same day.[54] On May 2, 2016 the title track from the upcoming version of the album was made available to stream on SoundCloud.[55] On June 17, 2016 Converge reissued the album under the name You Fail Me Redux through Epitaph and Deathwish. Ballou remixed the album and Alan Douches remastered it. The album was also repackaged by Bannon. Ballou explained in an interview with Noisey that after he recorded and mixed the album No Heroes, he wanted to go back and remix You Fail Me, because he and the rest of the band were \"never quite content with the original mix\".[56][57]\n"
         ]
      },
      "The Dusk In Us and Beautiful Ruin (2017–present)": {
         "text": [
            "On January 16, 2017 the band announced they would release a live album of their Jane Doe set from the Netherlands Roadburn Festival in 2016, titled Jane Live.[58] The album was put up for pre-order the same day. Deathwish's SoundCloud put the live version of the track \"Jane Doe\" up for streaming. Jane Live was released on March 3, 2017.[59]\n",
            "Koller announced during an interview that the band was planning to start tracking for a new album in the spring of 2017.[60] Following their tour on April 8, Converge planned to promptly head into the studio to record their next album.[61] On May 27, 2017 DigBoston published an interview with the band's vocalist Jacob Bannon, who revealed that the band had 18 songs already written. He stated the album is \"very powerful\" and will be a \"progression of something [they] did previously.\"[62]\n",
            "On July 25, 2017 Converge released the single \"I Can Tell You About Pain\", accompanied by a video directed by Tony Wolski. The single also contained the non-album track “Eve” as a b-side.[63]\n",
            "On August 15, Converge released the new track \"Under Duress\", available for streaming. It was described by Bannon as his \"emotional reaction to the complex world in which we live\". With the announcement of the song, the album's tracklist and cover art were revealed.[64] The band toured in Europe in August 2017 prior to the release.[64]\n",
            "The following month another track, “Reptilian”, was made available for streaming.[65] \"A Single Tear\" was made available for streaming on October 31, accompanied by a video directed by Max Moore. The video was described by having \"heavy with symbolism about parenthood and connection.\"[66] The Dusk in Us was released in the through Epitaph and Deathwish on November 3, 2017.\n",
            "On June 28, 2018, the band uploaded a short series of images to their Instagram page, alluding to a new release.[67] On June 29, the band released the Beautiful Ruin EP via Epitaph and Deathwish, along with a music video for the song \"Melancholia\", directed by Tony Wolski.[68] The EP consists of four tracks recorded during the sessions for The Dusk in Us which did not make the cut.\n",
            "Under the name Shattered Void, Converge contributed the new song \"I Won't Let You Go\" to the soundtrack for Cyberpunk 2077, a 2020 video game.[1]\n"
         ]
      }
   },
   "Artistry": {
      "Musical style and influences": {
         "text": [
            "Converge's music is rooted in both hardcore punk and heavy metal[69] and they are considered one of the earliest and most influential metalcore bands.[70][71][72] Their sound has also been described as mathcore,[69][73][74][75][76] post-hardcore,[77][78][79] noisecore,[80][81][82] experimental hardcore,[83] or simply hardcore.[81][84][85][86]\nAllMusic describes them as a \"revered punk metal band that combined the aggression of hardcore and metal with the complexity and polyrhythms of jazz.\"[4] Their 2001 album Jane Doe, which has become their most acclaimed work,[87][88][89] introduced an experimental approach and emphasis on rhythmical complexity, which are defining features of mathcore. However Bannon has stated: \"I really don't know what mathcore is. Converge is an aggressive band. We have elements of hardcore, punk, and metal for sure. But I think trying to define our efforts and other bands with a generic subgenre name is counter productive. We all have something unique to offer and should be celebrated for those qualities rather than having them generalized for easy consumption.\"[90]\n",
            "Converge started writing and playing what they consider \"relevant\" music in 1994. At that time they started incorporating influences like Starkweather,[91] The Accüsed,[91] Rorschach,[91] Born Against,[91][92] Moss Icon,[92] Universal Order of Armageddon,[92] Heroin,[92] and Mohinder[92] into their approach.\n",
            "In a 2012 interview, Bannon told Jonny Cohn of The Aquarian that the band \"don’t really look to any outside influences all that much anymore. We kind of haven’t for a long time. We have been a band for over two decades. We’re more introverted. We’re used to writing and creating in our own little bubble. We love and appreciate all different kinds of music and at times you can hear little subtle things come out but for the most part, they’re just an extension and exploration of things that we’ve done in the past.\"[93]\n",
            "Kurt Ballou has produced (and co-produced) the majority of Converge's albums at his own GodCity Studio. He has always been involved in the production of Converge's albums, but it was not until their 2006 album, No Heroes, that he was involved in the entire recording and mixing process.[56] This became the standard for Converge releases afterwards. One reason Ballou claimed to get into the studio side of music was to have \"maximum control over our music\". He stated, \"When we were starting out, no one wanted to help us anyway, so if we didn't take control, nothing was going to get done.\"[94]\n"
         ]
      },
      "Lyrics and vocal delivery": {
         "text": [
            "Scott Butterworth of Noisey has described Bannon's vocals \"as just another sonic element—more percussive and tonal than lyrical—allowing listeners to develop an emotional understanding of the material even without a precise knowledge of the words.\"[95] Sammy O'Hagar of Metalsucks stated Bannon's vocals \"[are] as much a part of Converge's uniqueness as is Ballou's nimble riffing\".[96]\n"
         ]
      },
      "Artwork": {
         "text": [
            "Bannon has designed all of Converge's artwork since their 1996 release, Petitioning the Empty Sky. Although reissues of older albums have had artwork done by Aaron Turner such as the 2005 reissues of Petitioning the Empty Sky and When Forever Comes Crashing, Bannon still took part in the design process of these reissues. In an interview with Revolver, Bannon shared his art process, saying, \"When I work I usually start out with a sketch of some kind, either in my process book or on a scrap of paper,\" he explains. \"I also did this with the Jane Doe album. By doing that, I work through ideas, write about them, and force them to evolve into something more refined. Process is extremely important for me--it allows me to have a log of my ideas, whether they're successful or not. That said, I sketched the basic cover and started building it in layers, using acrylic, ink, and spray paint. Because of the nature of the work and the need for flexibility in the imagery, I decided to build it in physical layers and scan certain elements for future use.\"[97]\n",
            "Since the release of Converge's 2001 album Jane Doe, the cover art of the woman simply known as \"Jane\" has become Converge's icon, in a similar vain to Iron Maiden's Eddie or Motörhead's Snaggletooth.[97]\n"
         ]
      }
   },
   "Collaborations": {
      "With Cave In": {
         "text": [
            "After touring together in 2004, every member of Cave In and Converge entered Ballou's GodCity Studio to lay the foundation for what was intended to become a full-length collaborative album between the two bands. Tentatively dubbed the \"Verge-In\" sessions (an amalgamation of the bands' names), the project was described as sounding \"like this freaky mix of Ride the Lightning-era Metallica meets Mars Volta meets the Allman Brothers.\"[100] Due to both groups growing busier with their primary bands, as well as creative differences, the project eventually fizzled out.[100][101] Brodsky described the sessions as being a \"bigger project than anyone had anticipated taking on... The idea was to put out some sort of release at some point. But as with anything that has too many cooks in the kitchen, the project got delayed, and certain people felt one way or another about the pieces we came up with, and in the end, there was a very small portion of material that everyone could agree on.\"[100] Tracks from the abandoned Verge-In sessions were reworked and transformed years later into the Converge songs \"Plagues\" from No Heroes and \"Effigy\", \"Cruel Bloom\", and \"Wretched World\" from Axe to Fall, the latter of which were heavily reworked by members of Genghis Tron.[102] Bannon said he believes there are only two unused and half-finished tracks from these sessions that could end up being reworked into new Cave In songs down the road.[103] Brodsky said what became \"Effigy\" was some of the best material from the sessions and expressed interest in going back and finishing the remaining unreleased tracks at some point.[100]\n",
            "Cave In and Converge members have collaborated numerous times, Brodsky had been the bassist of Converge from 1997 to 1998. Ballou produced Cave In's first two records, Beyond Hypothermia and Until Your Heart Stops. Koller became a temporary drummer for Cave In during their support tour of their fourth studio album, Perfect Pitch Black. Cave In also recorded two songs with Koller, \"Dead Already\" and \"Shapeshifter\"; these songs were released together on a limited-edition cassette single.[104] Bands that feature both members of Cave In and Converge include Kid Kilowatt, Old Man Gloom, Doomriders, Mutoid Man and Bannon's Wear Your Wounds live band.[105] The relationship between the two bands has been described as \"incestuous\" by members of each band.[106][107] The bands even went as far to joke with each other about hosting a festival titled \"IncestFest\", which would only feature bands and side-projects that are related to Cave In and Converge.[108]\n"
         ]
      },
      "Blood Moon": {
         "text": [
            "In April 2016, all four members of Converge, and guests Chelsea Wolfe, Ben Chisholm also of Chelsea Wolfe, Stephen Brodsky of Cave In and Steve Von Till of Neurosis, collaborated for four limited European performances titled Blood Moon. The collective performed \"ambient/post-rock interpretations\"[109] of various tracks from Converge's discography, particularly their \"lesser-heard and slower work.\"[110]\n",
            "The first Blood Moon set took place at Postbahnhof in Berlin on April 11.[111] The second took place at La Cartonnerie in Reims on April 12.[111] The third took place at Electric Brixton in London on April 13.[111] The fourth and final Blood Moon show took place after a special one-off Converge set where they played their 2001 album Jane Doe in its entirety for the first and presumably last time, to celebrate its 15-year anniversary. This took place at the Roadburn Festival in the Netherlands on April 14.[112] The following Blood Moon set took place at Roadburn on April 16.[111]\n",
            "In Tom Hartley of NME's review of their London performance, he said: \"As one of only four European cities visited by Converge on this tour, it felt truly fortunate to witness such a unique show and once again reaffirmed they are crushingly brilliant with whatever they choose to do.\"[110] In Kim Kelly of Noisey's review of Blood Moon's Roadburn Festival performance, she said: \"I hadn't realized Converge's Jacob Bannon had such a powerful clean voice, or just how well it would mesh with Chelsea Wolfe's; I stood rooted to the spot for a good half hour if not more, totally sucked in by what was happening onstage. It was obvious that the musicians involved had put a lot of thought into what they were presenting up there.\"[109]\n"
         ]
      },
      "text": [
         "Converge have collaborated with numerous musicians throughout their work such as members of Cave In, The Hope Conspiracy, Genghis Tron, Neurosis and Disfear. Most of these bands are featured on the band's collaborative album Axe to Fall. However, with the exception of Axe to Fall, Converge tend not to include many guests on their albums, and the guests that are included have minor roles such as backing vocals. The band have also worked with Tomas Lindberg (of At the Gates, Skitsystem, The Great Deceiver, and Disfear),[98] Aaron Turner (of Isis and Old Man Gloom),[98] and Kevin Baker (of All Pigs Must Die and The Hope Conspiracy),[98] all of whom provided vocals for a cover of Entombed's \"Wolverine Blues\" performed by Converge.[99]\n"
      ]
   },
   "Members": {
      "Timeline": {},
      "text": [
         "\n",
         "\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Converge is an American  hardcore punk band formed by vocalist Jacob Bannon and guitarist Kurt Ballou in Salem, Massachusetts in 1990.[2][3] During the recording of their seminal fourth album Jane Doe, the group became a four-piece with the departure of guitarist Aaron Dalbec and the addition of bassist Nate Newton and drummer Ben Koller. This lineup has remained intact since. They have released nine studio albums, three live albums, and numerous EPs. The band's sound is rooted in both hardcore punk and heavy metal, and they are considered pioneers of metalcore as well as its subgenre mathcore.[4]\n",
      "Converge have enjoyed a relatively high level of recognition. According to AllMusic, they are \"regarded as one of the most original and innovative bands to emerge from the punk underground.\"[4] Their popularity rose with the release of Jane Doe, which was ranked as the best album of the decade by Sputnikmusic, the best album of 2001 by Terrorizer and later as the 61st best metal album of all time by Rolling Stone.[5][6] Subsequently, Converge moved from Equal Vision Records to the considerably larger label Epitaph Records and their records gradually became more elaborate and expensive to produce. Special releases have traditionally been handled by Deathwish Inc., established by Bannon in 1999. The band's ninth studio album, The Dusk in Us, was released in November 2017 through Deathwish and Epitaph.[7]\n",
      "Converge was formed in the winter of 1990 by Bannon and Ballou, they were later joined by high school friends Jeff Feinberg and Damon Bellorado in 1991.[8] They started by playing covers of hardcore punk, punk rock and heavy metal songs. The band soon graduated to playing live performances in mid-1991, after recording some demos on a 4-track recorder. The band started writing and playing what they consider \"relevant\" music in 1994.[8]\n",
      "In 1994 the band became a five piece when Dalbec was recruited as a second guitarist. Later in the year Converge released their debut album, Halo in a Haystack, released through Earthmaker Records. This was only released as a vinyl record and was limited to 1000 copies. The album has not been reprinted since its release.[9] The record was funded by Bannon through money he saved up from working at a nursing home.[10]\n"
   ]
}