{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "In 1994, Eike Freese, André Schumann and Oliver Fliegel formed a death metal band called Dyer's Eve. One year later the name was changed to Dark Age. The new name was inspired by a Vader songtitle, while their older one was inspired by a Metallica songtitle. In autumn 1995, they recorded their first demo Doubtful Existence. In December 1995, keyboarder Martin Reichert and in January 1996 guitarist Finn Dierks joined the band. Oliver Fliegel left the band in 1996. After Finn Dierks moved to the U.S. he was replaced by Jörn Schubert.\n",
         "In Summer 1998, Dark Age recorded their first album entitled, The Fall, which was released after a contract with Remedy Records. In 2000, the album Insurrection followed and they played at Wacken Open Air.[1] In 2002, the album The Silent Republic was recorded in the Stage One-studio. In 2003, they founded their own studio[2] and played again at Wacken Open Air.[3]\n",
         "In 2003 Dark Age released their demo songs collection EP Remonstrations. They re-recorded their first demo songs. As a comparison they also included the original demo versions of the songs. Except for the first song which is a re-recording of a track from The Fall.\n",
         "In 2004, their self-titled album Dark Age was recorded and released. One year later, the DVD Live, So Far... was recorded in the Markthalle in Hamburg. In 2006, Thorsten Eggert left the band and Alex Henke joined. In 2008 the album Minus Exitus was released.\n",
         "Their sixth full-length album Acedia was released in November 2009. Their seventh full-length album A Matter of Trust was released on 6 September 2013 through AFM Records.[4]\n",
         "On November 19, 2015, the band announced that they would go on an indefinite hiatus for personal reasons.[5]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Dark Age is a German metal band from Hamburg, Germany formed in 1995 by Eike Freese (guitar, vocals), André Schumann (drums) and Oliver Fliegel (bass guitar).\n"
      ]
   },
   "Title": "Dark Age (band) - Wikipedia"
}