{
   "Name": "Death (metal band)",
   "rawData": [
      "Death was an American death metal band formed in Altamonte Springs, Florida in 1984 by guitarist and vocalist Chuck Schuldiner. Death is considered to be among the most influential bands in heavy metal and a pioneering force in the extreme metal subgenre of death metal. Their debut album, Scream Bloody Gore, has been widely regarded as the first death metal record (although there is some dispute to that claim as Possessed's debut album Seven Churches and Necrophagia's debut album Season of the Dead were released before).\n",
      "Death had a revolving lineup, with Schuldiner being the sole consistent member. The group's style also progressed, from the raw sound on its first two albums to a more sophisticated one in its later stage. The band ceased to exist after Schuldiner died of glioma and pneumonia in December 2001, but remains an enduring influence on heavy metal.\n",
      "Founded in 1984 by Chuck Schuldiner under the original name of Mantas in Altamonte Springs, Florida, Death was among the more widely known early pioneers of the death metal sound, along with California's Possessed. In the late 80s, the band was both a part of and integral in defining the death metal scene which gained international recognition with the release of albums by a number of area acts.\n"
   ],
   "infobox": {
      "Also known as": [
         "Mantas (1983–1984)"
      ],
      "Origin": [
         "Altamonte Springs, Florida, U.S."
      ],
      "Genres": [
         "Death metal",
         "technical death metal",
         "melodic death metal",
         "progressive metal"
      ],
      "Years active": [
         "1984–1996",
         "1998–2001"
      ],
      "Labels": [
         "Combat",
         "Roadrunner",
         "Nuclear Blast",
         "Relativity",
         "Relapse"
      ],
      "Associated acts": [
         "Charred Walls of the Damned",
         "Control Denied",
         "Massacre",
         "Repulsion",
         "Cynic",
         "Iced Earth",
         "Obituary",
         "Testament",
         "Autopsy"
      ],
      "Website": [
         "emptywords.org"
      ],
      "Past members": [
         "Final lineup:",
         "Chuck Schuldiner",
         "Shannon Hamm",
         "Richard Christy",
         "Scott Clendenin"
      ]
   },
   "albums": [
      "Scream Bloody Gore",
      "Leprosy",
      "Spiritual Healing",
      "Human",
      "Individual Thought Patterns",
      "Symbolic",
      "The Sound of Perseverance"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band formed in Altamonte Springs, Florida in [YEAR] by guitarist and vocalist Chuck Schuldiner. [BAND_NAME] is considered to be among the most influential bands in heavy metal and a pioneering force in the extreme metal subgenre of death metal. Their debut album, Scream Bloody Gore, has been widely regarded as the first death metal record (although there is some dispute to that claim as Possessed's debut album Seven Churches and Necrophagia's debut album Season of the Dead were released before).\n",
      "[BAND_NAME] had a [GENRE] a more sophisticated one in its later stage. The band ceased to exist after Schuldiner died of glioma and pneumonia in [MONTH] [YEAR], but remains an enduring influence on heavy metal.\n",
      "Founded in [YEAR] by Chuck Schuldiner under the original name of Mantas in Altamonte Springs, Florida, [BAND_NAME] was among the more widely known early pioneers of the death metal sound, along with California's Possessed. In the late 80s, the band was both a [GENRE] a number of area acts.\n"
   ]
}