{
   "Name": "Death (metal band)",
   "Sections": [
      "1 History",
      "1.1 Early history (1984–1987)",
      "1.2 Mid-era (1988–1992)",
      "1.3 The final years and Schuldiner's death (1993–2001)",
      "1.4 The aftermath (2001–onwards)",
      "2 Musical style and legacy",
      "3 Members",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Death was an American death metal band formed in Altamonte Springs, Florida in 1984 by guitarist and vocalist Chuck Schuldiner. Death is considered to be among the most influential bands in heavy metal and a pioneering force in the extreme metal subgenre of death metal. Their debut album, Scream Bloody Gore, has been widely regarded as the first death metal record (although there is some dispute to that claim as Possessed's debut album Seven Churches and Necrophagia's debut album Season of the Dead were released before).\n",
         "Death had a revolving lineup, with Schuldiner being the sole consistent member. The group's style also progressed, from the raw sound on its first two albums to a more sophisticated one in its later stage.[1] The band ceased to exist after Schuldiner died of glioma and pneumonia in December 2001, but remains an enduring influence on heavy metal.[2]\n"
      ]
   },
   "History": {
      "Early history (1984–1987)": {
         "text": [
            "Founded in 1984 by Chuck Schuldiner under the original name of Mantas in Altamonte Springs, Florida,[3][4] Death was among the more widely known early pioneers of the death metal sound, along with California's Possessed. In the late 80s, the band was both a part of and integral in defining the death metal scene which gained international recognition with the release of albums by a number of area acts.\n",
            "Together with Kam Lee, and Rick Rozz, Schuldiner started to compose songs that were released on several rehearsal tapes in 1984.[3][4] These tapes, along with the Death by Metal demo, circulated through the tape-trader world, quickly establishing the band's name. In 1984, Schuldiner dissolved Mantas and quickly started a new band under the name Death. Tim Aymar, in an article written in December 2010, states that Chuck Schuldiner renamed the band Death in order to turn his experience of the death of his brother Frank years earlier into \"something positive\".[5] Its members again included Rick Rozz and Kam Lee. Another demo was released, called Reign of Terror.[4]\n",
            "In 1985, the Infernal Death tape was recorded and released. Rick Rozz was out of the band by early 1985. Kam Lee played with Scott Carlson and Matt Olivo, bassist and guitarist respectively, of the band Genocide (later to be renamed Repulsion) for a short time. However, Kam had some \"personal problems\" that caused him to be ejected from the band. Olivo and Carlson left soon afterward.[4] Schuldiner moved to the San Francisco Bay Area and recruited Dirty Rotten Imbeciles drummer Eric Brecht, then recorded the Back from the Dead demo. However, Chuck was not happy with this incarnation of Death and moved back to Florida without a band. In 1986, Schuldiner got an invitation from early Canadian thrash metal band Slaughter to play on their album, which he accepted, moving to Canada. However, this only lasted two weeks, and he returned to the States. He returned to Florida, then moved back to the San Francisco Bay Area again, where he joined with 17-year-old drummer Chris Reifert. They recorded the Mutilation demo, which led to a deal with Combat Records, owned by Important Distribution (later becoming Relativity, and subsequently Sony), that enabled them to record the first LP.\n",
            "Scream Bloody Gore was released in 1987, widely considered a genre template for death metal. The band briefly had a second guitar player, John Hand, but he did not appear on the album (though his photo did). By this time Schuldiner had moved back to Florida, splitting with Reifert who had chosen to remain in California, where he went on to form Autopsy. There, Schuldiner teamed up with former bandmate Rick Rozz and two members of Rozz's band Massacre, Terry Butler and Bill Andrews.\n"
         ]
      },
      "Mid-era (1988–1992)": {
         "text": [
            "In 1988, that line-up recorded Leprosy. After much touring in support of the album, including a quick and ill-planned tour of Europe, Rick Rozz was fired in 1989. After a tour of Mexico featuring guitarist Paul Masvidal (later to re-emerge in the Death camp), a replacement was found in James Murphy, with whom the third album Spiritual Healing was recorded in Tampa in the summer of 1989. Murphy left the band relatively quickly. By this time Schuldiner abandoned the \"gore\" lyrical theme for more social critique and melody was added to the band's sound.[6]\n",
            "In 1990, on the eve of a European tour, Schuldiner decided against traveling, claiming at the last minute that he felt the tour was not adequately organized (and citing the group's previous disorganized European tour in 1988) as well as having some personal problems. Andrews and Butler continued with the tour of Europe as 'Death' to fulfill the band's contractual obligations, and recruited roadies Walter Trachsler (guitar) and Louie Carrisalez (vocals) to replace Schuldiner, much to Schuldiner's shock and disgust.\n",
            "Schuldiner abandoned the idea of a band set-up altogether and began working with session musicians only. Schuldiner hired Steve Di Giorgio and recruited Sean Reinert and Paul Masvidal from underground Florida band Cynic. In 1991, Death released Human, which is considered a more technical and progressive album than their previous works, incorporating complex rhythms, riffs and song structures. Human was Death's best-selling album yet, receiving many accolades and some MTV play for the group's first video, directed by David Bellino, for the track \"Lack of Comprehension\". Due to obligations with his primary band Sadus, Di Giorgio was forced to depart after the recording of Human and new bassist Skott Carino did Death's extensive world tour, from October 1991 until March 1992, in addition to appearing in the music video for \"Lack of Comprehension\".\n",
            "Schuldiner fired his manager Eric Greif after Spiritual Healing but settled and re-hired him before the recording of Human.[7] Although there were at least two lawsuits between Greif and Schuldiner, Schuldiner was characteristically mellow in an interview with Thrash 'n Burn about what the writer referred to as his \"gruesome collaboration\" with Greif: \"We just came to the conclusion that it was stupid just fighting all the time, taking each other to court and all that stupid shit.\"[8] \"Fate has an interesting way of working these things out ... Yes, we had a falling out, but we're working together again and it takes a lot of worries off my mind knowing Eric is the man for us\", Schuldiner told the Milwaukee Journal Sentinel.[9]\n"
         ]
      },
      "The final years and Schuldiner's death (1993–2001)": {
         "text": [
            "In 1993, Reinert and Masvidal left the group to continue with the band Cynic, as they were working on a full-length album at the time. Schuldiner, unable to persuade them otherwise, replaced them with drummer Gene Hoglan of the recently dissolved thrash metal band Dark Angel,[10] and guitarist Andy LaRocque from King Diamond for Individual Thought Patterns. Since LaRocque was obligated to his band, Schuldiner hired a then-unknown Ralph Santolla as touring guitarist. Death was arguably at the peak of their commercial and popular culture success, and the video for the track \"The Philosopher\" even made it on to an episode of Beavis & Butt-head in 1994 (Beavis also parodies Schuldiner's vocals in a mock 'drive-thru' order of 'tacos, to go!' in death-metal style). Also in 1994, Death abandoned its eight-year relationship with Relativity and signed with Roadrunner Records, their European distributor. For 1995's Symbolic, Santolla and Di Giorgio were exchanged for underground Florida musicians Kelly Conlon and Bobby Koelble. For the Symbolic tour Brian Benson was brought in on bass (Conlon having left the band prior to the tour).\n",
            "After Symbolic, Schuldiner broke up Death after tension with Roadrunner Records.[11] Schuldiner focused on Control Denied following the break up of Death.[12] The seventh Death release, titled The Sound of Perseverance, included Florida musicians Richard Christy, Shannon Hamm and Scott Clendenin, and the album was completed at Morrisound Recording in Tampa and released on Nuclear Blast in 1998.\n",
            "After the album and two supporting tours, Schuldiner put Death aside to pursue Control Denied with Christy and Hamm. Clendenin was dropped in favor of Steve Di Giorgio, who was once again available, and an underground power metal singer named Tim Aymar. Although the line-up and writing style was largely the same, Schuldiner created Control Denied in large part because he was displeased with the harsher vocals for Death. He opted to create a new band in order to avoid betraying what Death meant and sounded like to fans, remarking: \"For me, it is just a matter of evolving, doing it the right way. I didn't put out a Death record with this stuff on it. I made the right choice and changed the name of the band. I tried to do everything the right way.\"[13] As Schuldiner finished Control Denied's debut album, he was diagnosed with brain cancer, forcing the band to scrap plans for a U.S. and Canadian tour. As he worked on the second release, Schuldiner's condition improved, but the tumor left him in a weakened, vulnerable state. He contracted pneumonia and was placed in a hospital. On December 13, 2001, Schuldiner was released and returned home an hour later, where he died.\n"
         ]
      },
      "The aftermath (2001–onwards)": {
         "text": [
            "The second Control Denied release was not completed. Mired in legal problems involving its Dutch label, the musicians and Schuldiner's sister Beth, the former of whom have publicly stated their desire to complete the album, and former manager Eric Greif representing the Estate. In 2004, Hammerheart Records released a two-part bootleg made up of old, pre-Scream Bloody Gore demos, along with partial demos of the unfinished album and live Death recordings from 1990. This was issued under the name Chuck Schuldiner, not Death or Control Denied, but its markedly unfinished state and lack of vocals led to the release not being successful, aided by Schuldiner's mother Jane's pleas for fans to stay away from it. In October 2009, Greif litigated against Hammerheart, representing Schuldiner's estate, and all matters were settled by December, theoretically allowing for the Control Denied album to be completed by the other musicians.\n",
            "Members of Death have since stayed active as musicians. Gene Hoglan from Dark Angel and Andy LaRocque from King Diamond had already made a name for themselves, with LaRocque continuing to work with King Diamond while Hoglan has done stints with a wide variety of bands including Strapping Young Lad, Old Man's Child, Opeth, Zimmers Hole, Unearth, Pitch Black Forecast, Dethklok, Fear Factory, and most recently, Testament. Paul Masvidal found success with Cynic alongside fellow Death member Sean Reinert, who continue to release albums and tour in the present. Richard Christy went on to gigs with Acheron and Iced Earth before joining The Howard Stern Show, though he has recently resurfaced on the metal scene with Charred Walls of the Damned and guesting on a Crotchduster album. Ralph Santolla has also played with Iced Earth, as well as Sebastian Bach; both are bands which Steve DiGiorgio played in as well. Santolla was in Obituary and he was previously in Deicide. Di Giorgio also played for Testament and is still active with his original band Sadus. Bobby Koelble founded the Orlando rock-funk-Latin fusion group JunkieRush in 2000. He joined the Jazz faculty of the University of Central Florida (UCF) in 2007, and performs and records with The Jazz Professors. James Murphy was also in Testament, formed projects such as Disincarnate, as well as having stints with death metal bands Obituary and Cancer. Murphy was also stricken with a noncancerous brain tumor, for which he received treatment, and, along with Deron Miller of CKY, attempted to organize a Death tribute album. Kam Lee became well known as the frontman and face of the band Massacre, and formed the band Denial Fiend with Terry Butler, who has also found success in Six Feet Under and is currently in Obituary. Lee also continues to perform and record today with numerous underground projects, including Bone Gnawer and The Grotesquery. Scott Clendenin died on March 24, 2015 at the age of 48.[14]\n",
            "On May 12, 2010, it was announced that Perseverance Holdings Ltd. had partnered with Relapse Records to re-master and re-issue the Death and Control Denied releases, as well as his earlier work in Mantas.[15] On December 13 of the same year, it was announced that The Sound of Perseverance would be the first Death album to receive this treatment, and was released February 2011 in a 2-CD and 3-CD format.[16] The Human album has been remixed, with Schuldiner's intellectual property lawyer Eric Greif stating that Sony had lost the tapes of the original mixes,[17] and was reissued in 2-CD and 3-CD formats as well as a digital release. Shortly after, the Individual Thought Patterns album was reissued. In February 2012, Relapse Records released a 2 CD live album entitled Vivus! that included the previously released 1998 concerts Live in L.A. and Live in Eindhoven, including liner notes by drummer Christy and manager/lawyer Greif. The Relapse deal does not include Death's acclaimed 1995 album Symbolic, whose rights are still retained by Roadrunner Records as of 2008[update].\n",
            "On March 16, 2012, it was announced by Sick Drummer Magazine and the Schuldiner's corporation, Perseverance Holdings Ltd, that musicians who previously played in Death would take part in a benefit tour titled \"Death to All\" for the Sweet Relief Musicians Fund.[18] The former Death members slated to participate were drummers Gene Hoglan and Sean Reinert, bassists Steve Di Giorgio and Scott Clendenin, guitarists Paul Masvidal, Shannon Hamm and Bobby Koelble. It was later announced that Obscura vocalist Steffen Kummerer and Abysmal Dawn/Bereft frontman Charles Elliott would assume vocal and guitar duties for the tour,[19] but visa issues made Kummerer's participation impossible and he was replaced by Exhumed vocalist/guitarist Matt Harvey. After the tour, Eric Greif, acting as President of Perseverance Holdings Ltd. (PHL), alleged that the owners of Sick Drummer Magazine, Ian Macdonald and Anton Hefele, had not paid the charity, the musicians, PHL, the crew or the booking agency despite the five shows of the tour being successful.[20] However, dates for a second edition of the tour were announced in February 2013, with no involvement from Sick Drummer Magazine,[21] and a successful tour of North America in April 2013 was followed by a sold out three-week European tour in November 2013, featuring Masvidal, Reinert, Di Giorgio and vocalist/guitarist Max Phelps. The Death To All moniker was altered to Death (DTA).[22]\n"
         ]
      }
   },
   "Musical style and legacy": {
      "text": [
         "Death is considered to be one of the most influential bands in heavy metal and a pioneering force in death metal.[2] Death is also now recognized as one of the most acclaimed music groups of all time, held in high praise by critics, metal musicians, and fans.[23][24] Scream Bloody Gore is widely regarded as the first death metal album.[25] Music biographer Garry Sharpe-Young considered Death \"a genre-breaking band centered upon frontman Chuck Schuldiner\" and that the band \"would become one of the prime instigators of the death metal movement\".[26] However, Schuldiner dismissed such attributions by stating, in an interview with Metal-Rules.com, \"I don't think I should take the credits for this death metal stuff. I'm just a guy from a band, and I think Death is a metal band\".[27] In Death's later output, the band's music became more technical and melodic, moving to a technical death metal, progressive metal and melodic death metal style.[28][29][30][31][32] In January 2001, Mahyar Dean, an Iranian musician, wrote Death, a book about Death and Schuldiner, and released it in Iran. The book includes bilingual lyrics and many articles about the band. The book was sent through the site keepers of emptywords.org to Schuldiner, who in his words was \"truly blown away and extremely honored by the obvious work and devotion he put into bringing the book to life\".[33] A documentary entitled Death by Metal was released in 2016.[34]\n",
         "Regarding percussion styles, Gene Hoglan is recognised as a percussionist using double kick drum equipment and one of a crop who \"set new standards in speed and endurance\".[35] During an interview he described Sean Reinert's drumming on Human as \"godly\", and praised it as \"the fastest double bassing around at the time\" and \"a template which we tried to match on Individual Thought Patterns\".[36]\n",
         "Schuldiner designed the Death logo and its various incarnations during the length of his career. In 1991, before the release of Human, he cleaned up the logo; he took out more intricate details, and the \"T\" in the logo was swapped from an inverted cross to a more regular-looking \"T\", one reason being to quash any implication of being anti-religious.[citation needed] The logo was changed again, between Symbolic and The Sound of Perseverance, to a more streamlined look; also, a hooded reaper was removed above the \"H\".\n"
      ]
   },
   "Members": {
      "text": [
         "Final lineup\n"
      ]
   },
   "Discography": {
      "text": [
         "Studio albums\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Death was an American death metal band formed in Altamonte Springs, Florida in 1984 by guitarist and vocalist Chuck Schuldiner. Death is considered to be among the most influential bands in heavy metal and a pioneering force in the extreme metal subgenre of death metal. Their debut album, Scream Bloody Gore, has been widely regarded as the first death metal record (although there is some dispute to that claim as Possessed's debut album Seven Churches and Necrophagia's debut album Season of the Dead were released before).\n",
      "Death had a revolving lineup, with Schuldiner being the sole consistent member. The group's style also progressed, from the raw sound on its first two albums to a more sophisticated one in its later stage.[1] The band ceased to exist after Schuldiner died of glioma and pneumonia in December 2001, but remains an enduring influence on heavy metal.[2]\n",
      "Founded in 1984 by Chuck Schuldiner under the original name of Mantas in Altamonte Springs, Florida,[3][4] Death was among the more widely known early pioneers of the death metal sound, along with California's Possessed. In the late 80s, the band was both a part of and integral in defining the death metal scene which gained international recognition with the release of albums by a number of area acts.\n",
      "Together with Kam Lee, and Rick Rozz, Schuldiner started to compose songs that were released on several rehearsal tapes in 1984.[3][4] These tapes, along with the Death by Metal demo, circulated through the tape-trader world, quickly establishing the band's name. In 1984, Schuldiner dissolved Mantas and quickly started a new band under the name Death. Tim Aymar, in an article written in December 2010, states that Chuck Schuldiner renamed the band Death in order to turn his experience of the death of his brother Frank years earlier into \"something positive\".[5] Its members again included Rick Rozz and Kam Lee. Another demo was released, called Reign of Terror.[4]\n"
   ]
}