{
   "Name": "Eisregen",
   "Sections": [
      "1 History",
      "2 Style",
      "3 Censorship",
      "4 Side projects",
      "5 Reception",
      "6 Particulars",
      "7 Current lineup",
      "8 Former members",
      "9 Discography",
      "10 References",
      "11 External links"
   ],
   "Summary": {
      "text": [
         "Eisregen is a German death metal and dark metal band which formed in 1995. The members are from Tambach-Dietharz, a village in Thuringia.\n"
      ]
   },
   "History": {
      "text": [
         "In English, Eisregen translates to \"Ice Rain\". By using morbid German lyrics unlike those of other bands of this genre, they got the attention of German authorities, causing the indexing of three of their albums.\n",
         "Eisregen originally planned to disband after releasing a final album called  \"Menschenmaterial\" (Human Resources, as in mineral/natural Resources, a dehumanizing reference to \"spendable\" humans), but announced that they will continue to work together.\n"
      ]
   },
   "Style": {
      "text": [
         "Eisregen's old albums were more black metal influenced than the newer ones. The violin parts, now typical for the band, came with \"Krebskolonie\" (Cancer Colony), considered as their best album by many of their fans.\n"
      ]
   },
   "Censorship": {
      "text": [
         "Unlike \"normal\" indexing (which means playing the songs in public, publicity and selling to minors are forbidden), \"Krebskolonie\" is not allowed to be sold at all in Germany (\"Verbreitungsverbot\"). The reason given was the lyrics, described as \"grausam, menschenverachtend, frauenfeindlich und verrohend\" (cruel, inhuman, misogynistic, brutalising). The band could not fight the indexing as their label Last Episode (which they left afterwards) did not inform them.\n",
         "Interviews show the reasons giving for indexing differ from lyricist Michael Roth's intentions. As an example, an excerpt from the indexing report referring to the song \"Futter für die Schweine\" (translates to \"food for the pigs\"):\n",
         "Singer and lyricist Roth himself stated:\n",
         "This indexing report shows the singer and the narrator as one person although this not the same thing.\n",
         "The indexing of the album \"Farbenfinsternis\" (Color Darkness), which was along with \"Krebskolonie\" one of their most important releases, inflicted a financial damage to \"Eisregen\". The album \"Menschenmaterial\", originally thought to be their sixth and last album, was not released. The band announced to release one more album called \"Blutbahnen\" (Bloodlines) before, as they found a new motivation to make music.\n",
         "On February 1, 2007 their release \"Wundwasser\" (Water from wounds) was indexed due to \"youth endangering and condemnable contents\" although the band tried to stop the indexing by engaging their attorneys.\n"
      ]
   },
   "Side projects": {
      "text": [
         "Ronny Fimmel founded a gothic metal band called Ewigheim in 1999 (Michael Roth and Theresa Trenks were featured as session musicians). Michael Roth and Michael Lenz play in a melodic death metal band called \"Eisblut\" since 2004, and Ronny Fimmel and Theresa Trenks founded Transilvanian Beat Club in 2005.\n"
      ]
   },
   "Reception": {
      "text": [
         "Although Eisregen were criticized for their horror and splatter lyrics, their songs also have a certain (morbid and humoristic) background and sometimes even deal with social or historical topics (e. g. \"Schwarze Rose\", \"vom Muttermord\", \"Ripper von Rostow\", \"Eisenkreuzkrieger\", \"17 Kerzen am Dom\") in a fictional way.\n"
      ]
   },
   "Particulars": {
      "text": [
         "In order to circumvent the indexing rules, Eisregen retitle songs when playing them live. \"Meine tote Russische Freundin\" and \"Futter für die Schweine\" became \"Meine schwedische Freundin\" and \"Nonnen für die Schweine\". \"Krebskolonie\" (Cancer Colony) is often played as \"Leprakolonie\" (Leper Colony).\n"
      ]
   },
   "Current lineup": {},
   "Former members": {},
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Eisregen is a German death metal and dark metal band which formed in 1995. The members are from Tambach-Dietharz, a village in Thuringia.\n",
      "In English, Eisregen translates to \"Ice Rain\". By using morbid German lyrics unlike those of other bands of this genre, they got the attention of German authorities, causing the indexing of three of their albums.\n",
      "Eisregen originally planned to disband after releasing a final album called  \"Menschenmaterial\" (Human Resources, as in mineral/natural Resources, a dehumanizing reference to \"spendable\" humans), but announced that they will continue to work together.\n",
      "Eisregen's old albums were more black metal influenced than the newer ones. The violin parts, now typical for the band, came with \"Krebskolonie\" (Cancer Colony), considered as their best album by many of their fans.\n"
   ],
   "infobox": {
      "Origin": [
         "Tambach-Dietharz, Germany"
      ],
      "Genres": [
         "Death metal,[1] black metal[2]"
      ],
      "Years active": [
         "1995–present"
      ],
      "Labels": [
         "Massacre"
      ],
      "Associated acts": [
         "Ewigheim, Transilvanian Beat Club, Eisblut, Marienbad, Panzerkreutz"
      ],
      "Website": [
         "Fleischhaus"
      ],
      "Members": [
         "Michael \"Blutkehle\" Roth",
         "Michael \"Bursche\" Lenz",
         "Franzi „Dr. Franzenstein“",
         "Ronny \"Yantit\" Fimmel"
      ],
      "Past members": [
         "K. Matthes",
         "Michael \"Der Hölzer\" Brill",
         "Sebastian \"Berg\" Morbach",
         "Theresa \"2T\" Trenks",
         "Daniel \"DF\" Fröbing"
      ]
   }
}