{
   "Bibliography": {},
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "Entombed are rooted in the band Nihilist who were formed by drummer Nicke Andersson, guitarist Alex Hellid and bassist Leif Cuzner, who formed in 1987. After using a number of temporary vocalists for their initial shows, the band eventually recruited L.G. Petrov, who was the drummer for the band Morbid, which featured Mayhem vocalist Dead. The band also recruited Morbid's session guitarist Uffe Cederlund as a second guitarist, and recorded a number of demos with tracks that would eventually appear on Entombed's debut album. Following increased tensions between band members, the majority of the band decided to rename themselves as Entombed rather than force these members out.[4]\n",
         "Entombed's debut album Left Hand Path was released in 1990, a cult favorite that established them as a popular Swedish death metal band.[5] Left Hand Path and its follow-up, Clandestine, were unique in that they featured what was sometimes referred to as a \"buzz saw\" guitar sound.[5] Prior to the recording of Clandestine, Petrov was fired from the band due to personal disputes. The vocals on the album were recorded by Andersson instead, and for the tour following the album's release in 1991, the band hired vocalist Johnny Dordevic, previously a member of the band Carnage.[6]\n",
         "Petrov eventually reconciled with the band after releasing an album with the band Comecon, and the band eventually released Wolverine Blues in 1993. The album featured a departure of sound from the band's previous work, with a greater influence of hard rock and heavy metal alongside their initial death metal stylings, in a style now often referred to as death 'n' roll.[7][8] Although the release was divisive amongst the band's fanbase, it established their mainstream and critical reputation.[9] Wolverine Blues is considered a classic of early 1990s death metal.[9]\n",
         "1998's Same Difference was the band's first album without drummer and founding member Nicke Andersson, who left the band to concentrate on his new project The Hellacopters.[10] He was replaced by Peter Stjärnvind.[10] In 2000, Entombed released Uprising'[10] with follow-up titled Morning Star released the following year.[11]\n",
         "In 2001, the band worked with performance artists Carina Reich and Bogdan Szyberb, and the Royal Swedish Ballet.[12] The production was entitled Unreal Estate.[12]\n",
         "2003 saw the release of Inferno, followed by Serpent Saints – The Ten Amendments, which was released on July 9, 2007.[10] The album featured a greater influence from traditional death metal and is the band's first release with drummer Olle Dahlstedt (of Alpha Safari and ex–Misery Loves Co.), who replaced Stjärnvind in 2006, and also the first without guitarist Uffe Cederlund who joined Disfear.\n",
         "In 2014, L.G. Petrov parted with the remainder of the band, who in turn formed Entombed A.D. as a result of the band's trademark being held by Hellid.[13]\n",
         "Hellid, Cederlund, and Säfström reunited to perform \"Clandestine\" in its entirety with a symphony orchestra, in February 2014.[14] Nicke Andersson  intended to participate, but was prevented by scheduling conflicts.\n",
         "Hellid, Andersson and Cederlund reunited to perform as Entombed in 2016.\n"
      ]
   },
   "Personnel": {
      "Timeline": {},
      "text": [
         "\n",
         "\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Personnel",
      "2.1 Timeline",
      "3 Discography",
      "4 References",
      "5 Bibliography",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Entombed is a Swedish death metal band formed in 1987 under the name of Nihilist. Entombed began their career as an early pioneer of Scandinavian death metal which initially differed from its American counterpart by its distinct \"buzzsaw\" guitar tone. However, by the early 1990s their sound had broadened to include garage rock and other influences. This new style would eventually be described as death 'n' roll. Entombed has been influenced by bands such as Slayer, Exodus, Black Sabbath, Celtic Frost, Autopsy, Repulsion, Kiss, The Misfits, Motörhead, Discharge, Death and Testament.[1][2] Along with Dismember, Grave and Unleashed, Entombed has been referred to as one of the \"big four\" of Swedish death metal.[3]\n"
      ]
   },
   "Title": "Entombed (band) - Wikipedia"
}