{
   "Name": "Entombed (band)",
   "rawData": [
      "Entombed is a Swedish death metal band formed in 1987 under the name of Nihilist. Entombed began their career as an early pioneer of Scandinavian death metal which initially differed from its American counterpart by its distinct \"buzzsaw\" guitar tone. However, by the early 1990s their sound had broadened to include garage rock and other influences. This new style would eventually be described as death 'n' roll. Entombed has been influenced by bands such as Slayer, Exodus, Black Sabbath, Celtic Frost, Autopsy, Repulsion, Kiss, The Misfits, Motörhead, Discharge, Death and Testament. Along with Dismember, Grave and Unleashed, Entombed has been referred to as one of the \"big four\" of Swedish death metal.\n",
      "Entombed are rooted in the band Nihilist who were formed by drummer Nicke Andersson, guitarist Alex Hellid and bassist Leif Cuzner, who formed in 1987. After using a number of temporary vocalists for their initial shows, the band eventually recruited L.G. Petrov, who was the drummer for the band Morbid, which featured Mayhem vocalist Dead. The band also recruited Morbid's session guitarist Uffe Cederlund as a second guitarist, and recorded a number of demos with tracks that would eventually appear on Entombed's debut album. Following increased tensions between band members, the majority of the band decided to rename themselves as Entombed rather than force these members out.\n",
      "Entombed's debut album Left Hand Path was released in 1990, a cult favorite that established them as a popular Swedish death metal band. Left Hand Path and its follow-up, Clandestine, were unique in that they featured what was sometimes referred to as a \"buzz saw\" guitar sound. Prior to the recording of Clandestine, Petrov was fired from the band due to personal disputes. The vocals on the album were recorded by Andersson instead, and for the tour following the album's release in 1991, the band hired vocalist Johnny Dordevic, previously a member of the band Carnage.\n"
   ],
   "infobox": {
      "Origin": [
         "Stockholm, Sweden"
      ],
      "Genres": [
         "Death 'n' roll",
         "death metal"
      ],
      "Years active": [
         "1987–2014, 2016–present"
      ],
      "Labels": [
         "Threeman Recordings",
         "Candlelight",
         "Music for Nations",
         "Earache",
         "Combat",
         "Relativity",
         "Columbia",
         "Sony"
      ],
      "Associated acts": [
         "Nihilist",
         "Disfear",
         "The Hellacopters",
         "Death Breath",
         "Entombed A.D."
      ],
      "Website": [
         "www.entombed.org"
      ],
      "Members": [
         "Alex Hellid",
         "Nicke Andersson",
         "Uffe Cederlund",
         "Robert Andersson",
         "Edvin Aftonfalk"
      ]
   },
   "albums": [
      "Left Hand Path",
      "Clandestine",
      "Wolverine Blues",
      "DCLXVI: To Ride Shoot Straight and Speak the Truth",
      "Same Difference",
      "Uprising",
      "Morning Star",
      "Inferno",
      "Serpent Saints – The Ten Amendments"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band formed in [YEAR] under the name of Nihilist. [BAND_NAME] began their career as an early pioneer of Scandinavian death metal which initially differed from its American counterpart by its distinct [SONG_NAME] of [GENRE].\n",
      "[BAND_NAME] are rooted in the band Nihilist who were formed by drummer Nicke Andersson, guitarist [PERSON_NAME_FULL_0_MALE] and bassist [PERSON_NAME_FULL_1_MALE], who formed in [YEAR]. After using a [GENRE] band eventually recruited L.G. Petrov, who was the drummer for the band Morbid, which featured [MONTH]hem vocalist Dead. The band also recruited Morbid's session guitarist [PERSON_NAME_FULL_2_MALE] as a second guitarist, and recorded a number of demos with tracks that would eventually appear on [BAND_NAME]'s debut album. Following increased tensions between band members, the majority of the band decided to rename themselves as [BAND_NAME] rather than force these members out.\n",
      "[BAND_NAME]'s debut album Left Hand Path was released in [YEAR], a [GENRE] a popular Swedish death metal band. Left Hand Path and its follow-up, Clandestine, were unique in that they featured what was sometimes referred to as a [SONG_NAME] guitar sound. Prior to the recording of Clandestine, Petrov was fired from the band due to personal disputes. The vocals on the album were recorded by Andersson instead, and for the tour following the album's release in [YEAR], the band hired vocalist [PERSON_NAME_FULL_0_MALE], previously a member of the band Carnage.\n"
   ]
}