{
   "Name": "Gorgoroth",
   "Sections": [
      "1 History",
      "1.1 Early years (1992–1995)",
      "1.2 With Pest (1995–1997)",
      "1.3 Tenure with Nuclear Blast (1997–2003)",
      "1.4 Controversy in Kraków (2004)",
      "1.5 Ad Majorem Sathanas Gloriam (2005–2007)",
      "1.6 Quantos Possunt ad Satanitatem Trahunt (2007–2011)",
      "1.7 Instinctus Bestialis and Bøddel's death (2012–present)",
      "2 Suppression of lyrics and tablature",
      "3 Lyrics and satanism",
      "4 Band members",
      "4.1 Current members",
      "4.2 Current live members",
      "4.3 Former members",
      "4.3.1 Vocals",
      "4.3.2 Guitars",
      "4.3.3 Bass",
      "4.3.4 Drums",
      "4.4 Timeline",
      "5 Discography",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Gorgoroth is a Norwegian black metal band based in Bergen. It was formed in 1992 by guitarist Infernus, who is also the only original member remaining, and the band have since released nine studio albums. Gorgoroth are a Satanic band and have drawn controversy due to some of their concerts, which have featured impaled sheep heads and mock crucifixions. The band is named after the dead plateau of darkness in the land of Mordor from J. R. R. Tolkien's fantasy novel The Lord of the Rings.\n"
      ]
   },
   "History": {
      "Early years (1992–1995)": {
         "text": [
            "Gorgoroth was founded in 1992 by guitarist Infernus.[5] In 1993, the band released their first demo, entitled A Sorcery Written in Blood.[6] On January 7, 1994, Firda, the major newspaper in the county of Sogn og Fjordane where the band originated from, ran a cover story on the demo, with the headline \"Local music with Satanic symbolism\". According to the article, the release of the demo and flyers with Satanic symbols led to \"concerned parents contacting the Sheriff's Office in Fjaler\".[7] After the demo was released, Gorgoroth signed a record deal with Embassy Productions and started work on their debut full-length Pentagram.[8] When bassist Kjettar left the band in 1993, Samoth of Emperor joined Gorgoroth as their new bassist, and participated in the recording of the album. After Pentagram was completed and released in 1994, drummer Goat left the band and was replaced by Frost from Satyricon. The band performed their first concert at Lusa Lottes Pøbb in Oslo, Norway, on May 3, 1994, at a four-day Black Metal Nights festival with bands such as Dark Funeral (who also made their live debut), Dissection, Enslaved, Marduk (who played their first gig abroad), Gehenna and Hades Almighty.[9][10]\n",
            "This was followed by gigs with Enslaved in Bergen (in June and September) and in Haugesund (in November), and the band performed their first gig abroad in Annaberg-Buchholz in Germany on December 10, 1994. The same year, the band commenced the recording of Antichrist (originally titled Død), their second full-length album.\n"
         ]
      },
      "With Pest (1995–1997)": {
         "text": [
            "Vocalist Hat decided to leave Gorgoroth in September 1995, but agreed to finish recording the vocal tracks for Antichrist. After Hat left, Infernus recruited vocalist Pest from Obtained Enslavement as Gorgoroth's new vocalist. In December 1995, the band supported Cradle of Filth at the London Astoria, a show which also included the band Primordial.[11] This marked the first Gorgoroth live appearance of both vocalist Pest and bassist Ares. In 1995 the band had been offered a record deal with Moonfog Productions, but this offer was rejected in favour of an offer made by German label Malicious Records. Malicious Records released the band's second album, Antichrist, in 1996, and also re-released the debut album Pentagram. The band went on a European tour with Satyricon and Dissection in April 1996,[9] followed by a one-off gig in Bergen with Hades Almighty and Gehenna, at which the live EP The Last Tormentor was recorded. The band also played a one-off gig in the fall in Bischofswerda, Germany, with Behemoth. Soon the name Gorgoroth was commonplace in the black metal underground, both in Norway and in the rest of Europe, if somewhat overshadowed by some of the more famous black metal bands such as Mayhem or Emperor. The band's third full-length album, Under the Sign of Hell, was recorded in spring 1996, and guitarist Tormentor joined the band later in the year. Under the Sign of Hell was released in 1997, and Gorgoroth went on their first headlining European tour in fall 1997, with support by Mystic Circle.[12] It was on this tour that Infernus and Tormentor were approached by the major German heavy metal record label Nuclear Blast, who wanted to sign the band. The band accepted the offer in late 1997.[citation needed]\n"
         ]
      },
      "Tenure with Nuclear Blast (1997–2003)": {
         "text": [
            "The move to Nuclear Blast was controversial among many black metal enthusiasts who pertained to the tenets of an 'underground black metal scene'.[13] The first album recorded and released for Nuclear Blast was Destroyer (1998). New singer Gaahl joined the band at this time, but was heard on only one song, the title track \"Destroyer\". The music and lyrics on the album were mainly written by Infernus, but guitarist Tormentor also contributed as composer, most notably on the title track, and former vocalist Pest wrote the lyrics on 4 tracks. In May 1998, Gorgoroth played five dates in Germany on Cradle of Filth's European tour, with support from Old Man's Child and Einherjer.[14][15] Gorgoroth also performed at Wacken Open Air in summer 1998,[16] and performed at the Tuska Open Air Metal Festival in Helsinki, Finland, and in Oslo, Norway with Gehenna and Dødheimsgard.[17]\n",
            "In 1999, Gorgoroth began journeying into unknown territory with the recording of Incipit Satan. Though mainly written by Infernus once again, the album delved into musical ideas not expanded upon by the group in previous recordings. Songs such as \"Will to Power\" showcased strong industrial, dark ambient, and noise influences (more so than on Destroyer and Under the Sign of Hell, both of which showed signs of experimentation). The song \"When Love Rages Wild in My Heart\" featured clean, bluesy vocals. Overall, the album displayed progressive tendencies, yet still retained a traditional black metal edge and Infernus' signature sound. The album was recorded during 1999, after drummer Vrolok and bassist T-Reaper had left the band and been replaced by drummer Erlend Erichsen (a.k.a. Sjt. Erichsen) and bassist King ov Hell. Drummer Erlend Erichsen left the band after the recordings were finished, and Incipit Satan was released in 2000, preceded by a European tour in December 1999, supporting Morbid Angel.[18] In May, 2000, Gorgoroth headlined a European tour, with bands like Old Man's Child and Krisiun as supporting acts.[19] In early June 2000, Gorgoroth performed at the first Hole in the Sky festival in Bergen, Norway. This festival was arranged in memory of former Gorgoroth drummer Grim, and also included bands such as Immortal, Enslaved, Obtained Enslavement, Hades Almighty and Aeternus. On June 23, 2000, Gorgoroth headlined the \"Knüppelnacht\" stage at the With Full Force festival in Leipzig, Germany.[20]\n",
            "After a couple of Norwegian concerts in 2000 and 2001, Gorgoroth made their hitherto only live appearance in the US, at the Milwaukee Metalfest in August 2001. In September and October 2001, the band went on two mini tours of Mexico and Colombia. In 2001 Gorgoroth was also featured on a tribute album to the Norwegian black metal band Mayhem, with a cover version of that band's \"Life Eternal\" from the De Mysteriis Dom Sathanas album. This song had been recorded in 1998, and featured Gaahl on vocals, as well as Infernus and Tormentor on rhythm guitars, T-Reaper on lead guitar and bass, and Vrolok on drums.[21] This is the only released Gorgoroth recording which has not appeared on a full-length Gorgoroth album. In February 2002, vocalist Gaahl was taken into custody after being accused of having beaten a man at an after-party.[22] This led to him having to serve 9 months in prison in 2002, due to an already existing unserved 1-year sentence for previously committed acts of violence. He was released from prison in December 2002.[23]\n",
            "In 2002, Tormentor decided to quit the band due to no longer being able to cooperate with King,[24][25] ending the stable 5-piece line-up of Gaahl, Infernus, Tormentor, King ov Hell and Kvitrafn, which had been formed in 2000. After Tormentor's departure, Gorgoroth began writing their new album, Twilight of the Idols. The album showed a return to a more solidified black metal style, but was still quite different from early Gorgoroth releases, mainly due to the fact that most of the album's songs were written by bassist King and drummer Kvitrafn rather than Infernus. The band played their first live gig in a year and a half at Garage in Bergen in April 2003, with Tormentor returning as guitarist for a one-off show.[26] Twilight of the Idols was released by Nuclear Blast in May 2003,[27] and the band subsequently performed at the Hole in the Sky festival in Bergen in August 2003. This marked the first Gorgoroth live appearance of session guitarist Apollyon of Aura Noir.[28]\n"
         ]
      },
      "Controversy in Kraków (2004)": {
         "text": [
            "On February 1, 2004, during a concert being recorded for a DVD in Kraków, Poland, the band displayed sheep heads on stakes, a bloodbath of 80 litres of sheep's blood, Satanic symbols, and four naked crucified models on stage. A police investigation took place with allegations of religious offence (which is prosecutable under Polish law) and cruelty to animals.[29] Though these charges were considered, the band was not charged as it was ruled that they were unaware of the fact that what they were doing was illegal, although the concert organiser was eventually fined 10,000 zł in 2007 as he knew about it and neither informed the band that it was against the law nor intervened.[30] The whole controversy led to the band being dropped from the roster of the Nuclear Blast Tour and the footage of the concert being confiscated by the police.[31] Following this controversy – and with Gorgoroth also having achieved a larger degree of worldwide recognition through Nuclear Blast's distribution facilities – the contract between both parties was bilaterally terminated. Gorgoroth further secured a reputation as a band with a vehement anti-Right Hand Path agenda, regarding which certain employees in the company were alleged to have felt uneasy due to their own personal beliefs.[13]\n",
            "After a successful South American tour of Brazil, Chile and Argentina, and a performance at Norway's Inferno Festival, it was announced in April 2004 that drummer Kvitrafn had decided to leave the band.[32] For the band's European and Central American headlining tours of October and November 2004, drummer Dirge Rep (ex-Enslaved, Gehenna) and guitarist Teloch (Nidingr) were recruited.\n"
         ]
      },
      "Ad Majorem Sathanas Gloriam (2005–2007)": {
         "text": [
            "After various shows around Europe in the first half of 2005, including the With Full Force Festival in July, Gorgoroth then went out on a month-long European tour with 1349 in November 2005, this time with Skagg (Gaahlskagg) replacing Teloch as live guitarist. On December 10, 2005, Gorgoroth played live in Trondheim, Norway, a gig which was to be their last live performance until summer 2007.\n",
            "Gorgoroth released Ad Majorem Sathanas Gloriam in June 2006 through Regain Records. This was only the second Gorgoroth album to be released since 2000's Incipit Satan – a noticeable reduction in productivity from a band that had previously released 2 demos, 5 full-length albums and 1 live EP between 1993 and 2000. For the recording of the new album, Frost again performed on the drums. This album helped the band to expand its fan base. A short time after the album was released, bassist King quit the band. According to the official website, King left because he \"had problems fronting some of the ideological aspects of his band GORGOROTH's agenda\".[33][34] In an interview made shortly after quitting the band, he confirmed he had problems with the ideology in public, but not in his private life.[35] Gorgoroth was nominated in the \"Metal\" category at the 35th annual Spellemann Awards for this album (the Norwegian equivalent to the Grammy Awards). Gaahl served a sentence in jail from spring to December 2006 for the assault which happened in February 2002, and Infernus served a 4-month sentence for 'gross negligent rape' between October 2006 and March 2007, for an incident which took place in 2003.[36][37] When the latter was released, it was reported that Infernus had started 'working on new material, both music and lyrics for an upcoming album, title yet undecided'.[38]\n",
            "In January 2007, it was reported that Gaahl was under investigation by Norwegian Police for his comments in an interview in Metal: A Headbanger's Journey (2005), which had been broadcast on Norway's Lydverket NRK 1 on January 24, 2007, where he said 'church burnings are things that I support one-hundred percent, and they should have been done much more and will be done much more in the future'.[39] In April 2007, a 5-part series entitled True Norwegian Black Metal, produced by Peter Beste for Vice, aired on VBS.tv, covering some of the aspects of Gaahl's life. With King back in the band, the video for 'Carving a Giant' off Ad Majorem Sathanas Gloriam was also filmed and broadcast on Norwegian MTV that month.\n",
            "In July and August 2007, Gorgoroth returned to the live arena with performances at festivals in Norway, Germany and the Czech Republic. In September 2007, the band went on a South American tour of Brazil, Colombia, Argentina, Ecuador and Chile with Belphegor.[40] These would be the last Gorgoroth concerts to feature Gaahl and King.\n"
         ]
      },
      "Quantos Possunt ad Satanitatem Trahunt (2007–2011)": {
         "text": [
            "In October 2007, Infernus announced the decision of Gaahl and King ov Hell to part ways on the band's official Myspace page.[41] Gaahl and King claimed that they had \"fired\" Infernus from Gorgoroth and claimed the rights to the name of the band, with King having made a trademark application the previous month.[41][42][43] This dispute was concluded in March 2009 when a court verdict was announced, which recognised Infernus as the legitimate user of the name and that Gaahl and King had excluded themselves from Gorgoroth upon attempting to remove the founding member.[44][45]\n",
            "Shortly after parting ways with Gaahl and King, Infernus said that he was in the process of finishing and preparing the material he reportedly started in October 2006 and was first reported writing when he was released on parole in March 2007, declaring the title to be Quantos Possunt ad Satanitatem Trahunt, to be released on Regain Records. He also stated that future live performances would minimise use of the Gorgoroth songs written between 2002 and 2004[46] (although only three songs by King ov Hell and two by Kvitrafn – four of which had lyrics written by Gaahl – were ever performed live), and that priority would be given to both older and brand new material.[47][48] In December 2007, he revealed Tomas Asklund and Frank Watkins had joined Gorgoroth as drummer and bassist, respectively.[49] Watkins later took the stage name \"Bøddel\", which is the Norwegian word for \"Executioner\", the old name of Obituary.[50]\n",
            "In April 2008, Infernus announced he was to depart for Stockholm, Sweden,[51] where the next few months were spent rehearsing the material for Quantos Possunt ad Satanitatem Trahunt in Tomas Asklund's Monolith Studio.[52]\n",
            "The controversial 2004 Kraków concert was finally released on DVD in June 2008, more than 4 years after its recording. It was released by Metal Mind Productions under the title Black Mass Krakow 2004, and entered the Norwegian music DVD chart at position 4 in its first week of release.[53] It remained in the charts for five weeks, peaking at a number 3 position.[54]\n",
            "On May 30, 2008, Regain Records announced the June 2008 release of True Norwegian Black Metal - Live in Grieghallen, a new Gorgoroth album which had been recorded live in studio in mid-October 2007.[55][56] The recording line-up consisted of Infernus on guitars and bass, Gaahl on vocals, Teloch on session guitars, and Garghuf on session drums.[57] However, ostensibly in part due to the circumstances of the ongoing name dispute, the distribution of the album was temporarily halted in July 2008, with the final decision to be made in a yet-to-be announced trial in Sweden.[52]\n",
            "Infernus also announced in August that a pre-recording for Quantos Possunt ad Satanitatem Trahunt was made with guitars, bass and drums. After having spent the previous few months rehearsing in Monolith Studio, Infernus said that he was working on arrangements with assistance from former Gorgoroth guitarist Tormentor.[52]\n",
            "In September 2008, Infernus announced Tormentor had accepted his offer to rejoin Gorgoroth, together with Tomas Asklund and Bøddel.[58] On December 4, 2008, it was announced that Pest had returned as the vocalist.[56]\n",
            "Shortly after the conclusion of the Gorgoroth name dispute, recording of Quantos Possunt ad Satanitatem Trahunt began when Tomas Asklund commenced with the drum tracks in Monolith Studio.[59][60] Infernus \"manually recorded six basic guitars\" for the album,[61] and Bøddel and Pest recorded bass and vocals respectively in June.\n",
            "In May 2009, it was announced that Gorgoroth would play live again on August 29, 2009, at the 10th anniversary edition of the Hole in the Sky festival in Bergen, Norway.[62] This would be the band's first live appearance since September 2007.\n",
            "In late June 2009, it was announced that the vocals on True Norwegian Black Metal - Live in Grieghallen were rerecorded by Pest.[63] A week later the release dates and track listing for Quantos Possunt ad Satanitatem Trahunt were revealed.[64]\n",
            "At the band's headlining concert at the Hole in the Sky festival on August 29 the set list consisted mainly of older material, including two songs off the Pentagram album which had not been performed live since October 1997. The band also performed live, for the very first time, the new song \"Aneuthanasia\" off Quantos Possunt ad Satanitatem Trahunt.[65] Gorgoroth also performed at UKA 2009 in Trondheim, Norway, on October 19, 2009. This concert coincided with the release of Quantos Possunt ad Satanitatem Trahunt.[66]\n",
            "Upon its release the album was well received, with many reviewers commenting on the band's return to its roots, comparing the album with earlier releases like Antichrist (1996).[67][68] It was revealed in October 2009 that work on the follow-up to Quantos Possunt ad Satanitatem Trahunt, including rehearsals by Infernus and Tomas Asklund in Stockholm, had taken place around that time.[69] On April 1, 2010, it was officially announced that half of the yet-to-be-titled new album had been prerecorded in pre-production form, and that work on the album would continue through the year in between touring and festival appearances, with a tentative 2011 release date.[70]\n",
            "In April 2010 Gorgoroth embarked on a mini-tour of Europe consisting of five dates in Germany as well as one each in France, Belgium, Italy and the Netherlands, to promote Quantos Possunt ad Satanitatem Trahunt.[71] The band also performed at five European festivals in summer 2010: Germany's Summer Breeze Open Air festival,[72]\nthe Ragnarök Festival in Germany,[73] Brutal Assault in the Czech Republic,[74] Bloodstock Open Air in the UK,[75] and the Finnish festival Jalometalli.[76] In September 2010, Gorgoroth embarked on a mini-tour in South America and were announced to be touring Europe again in November 2010 after switching to Massive Music booking agency.\n",
            "It was announced in October 2010 that the band was about to put the finishing touches on a re-recording of their 1997 release Under the Sign of Hell.[77] The re-recording, with Pest on vocals and Tomas Asklund on drums, was released as Under the Sign of Hell 2011 in December 2011.\n"
         ]
      },
      "Instinctus Bestialis and Bøddel's death (2012–present)": {
         "text": [
            "In August 2012, Pest notified the band members that he would not be able to take part in Gorgoroth's September 2012 tour of Latin America. In response, Infernus kicked Pest out of the band. Taake's vocalist Hoest performed vocals for the Latin America tour. Atterigner of the Serbian band Triumfall was announced as vocalist for the next Gorgoroth studio album, Instinctus Bestialis.[78] The mixing of the album was completed by June 2014 and mastering of it was to be done the next month.[78] As of March 6, 2015, the album artwork and track listing was revealed and the release date of June 12, 2015 was confirmed. It is to be sold through Soulseller Records.[79] On October 18, 2015, bassist Bøddel (Frank Watkins) died from cancer.[80]\n"
         ]
      }
   },
   "Suppression of lyrics and tablature": {
      "text": [
         "Gorgoroth not only refuses to publish their lyrics but also actively suppresses any public showings of fan-written reconstructions. The reason for this suppression is not fully known, though Infernus has expressed disdain towards the prospect of material being covered by other bands, among other reasons.[81] The metal-lyric website Darklyrics.com contains the message \"Gorgoroth lyrics removed due to copyright complaint by the band\", in lieu of any actual lyrics. Lyricsondemand.com displays a cease-and-desist message from Arne Beckmann of Prophecies Publishing which reads as follows:[82]\n",
         "Dear siteowners,\n",
         "Please note that I am writing on behalf of Prophecies Publishing (PP) and as their business manager. PP is the official music publishing company of the band Gorgoroth.\n",
         "The band has requested us to take care of a removal of their lyrics from your website.\n",
         "Herewith we request you to remove any lyrics of the band Gorgoroth from your systems immediately, but not later than 18th Feb 2004.\n",
         "Please be aware that we will undertake any necessary steps (even legal steps) to enforce this.\n",
         "This is nothing against you and your business or dedication, but you will understand that we as music publisher of the band will have to enforce the copyright as desired by the songwriters.\n",
         "Since you did not license the lyrics you violate international copyright laws and conventions.\n",
         "With best regards,\n",
         "\nArne BeckmannProphecies Publishing"
      ]
   },
   "Lyrics and satanism": {
      "text": [
         "Gorgoroth are known for their satanic-themed and anti-Christian lyrics.[1] The band's founder and guitarist Infernus is openly a theistic satanist and considers himself \"Satan's minister on Earth\". He formed Gorgoroth to express his Satanist beliefs.[83][84] The band's former vocalist Gaahl is openly anti-Christian. In an interview for the 2005 heavy metal documentary Metal: A Headbanger's Journey, Gaahl was asked what inspired Gorgoroth's music and his reply was simply \"Satan\". When asked what he believes Satan represents, he said \"Freedom\".[85]\n",
         "Gaahl explained his use of Satanic and anti-Christian themes: \"We live in a Christian world and we have to speak their language ... When I use the word 'Satan' it means the natural order, the will of a man, the will to grow, the will to become the superman and not to be oppressed by any law such as the church, which is only a way to control the masses.\"[86]\n",
         "Gaahl and Infernus were openly supportive of the church burnings perpetrated by members of the black metal scene in the early 1990s. Gaahl further said, \"there should have been more of them, and there will be more of them\".[85]\n"
      ]
   },
   "Band members": {
      "Current members": {},
      "Current live members": {},
      "Former members": {
         "Vocals": {
            "text": [
               "\n"
            ]
         },
         "Guitars": {
            "text": [
               "\n"
            ]
         },
         "Bass": {
            "text": [
               "\n"
            ]
         },
         "Drums": {
            "text": [
               "\n"
            ]
         }
      },
      "Timeline": {}
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Gorgoroth is a Norwegian black metal band based in Bergen. It was formed in 1992 by guitarist Infernus, who is also the only original member remaining, and the band have since released nine studio albums. Gorgoroth are a Satanic band and have drawn controversy due to some of their concerts, which have featured impaled sheep heads and mock crucifixions. The band is named after the dead plateau of darkness in the land of Mordor from J. R. R. Tolkien's fantasy novel The Lord of the Rings.\n",
      "Gorgoroth was founded in 1992 by guitarist Infernus.[5] In 1993, the band released their first demo, entitled A Sorcery Written in Blood.[6] On January 7, 1994, Firda, the major newspaper in the county of Sogn og Fjordane where the band originated from, ran a cover story on the demo, with the headline \"Local music with Satanic symbolism\". According to the article, the release of the demo and flyers with Satanic symbols led to \"concerned parents contacting the Sheriff's Office in Fjaler\".[7] After the demo was released, Gorgoroth signed a record deal with Embassy Productions and started work on their debut full-length Pentagram.[8] When bassist Kjettar left the band in 1993, Samoth of Emperor joined Gorgoroth as their new bassist, and participated in the recording of the album. After Pentagram was completed and released in 1994, drummer Goat left the band and was replaced by Frost from Satyricon. The band performed their first concert at Lusa Lottes Pøbb in Oslo, Norway, on May 3, 1994, at a four-day Black Metal Nights festival with bands such as Dark Funeral (who also made their live debut), Dissection, Enslaved, Marduk (who played their first gig abroad), Gehenna and Hades Almighty.[9][10]\n",
      "This was followed by gigs with Enslaved in Bergen (in June and September) and in Haugesund (in November), and the band performed their first gig abroad in Annaberg-Buchholz in Germany on December 10, 1994. The same year, the band commenced the recording of Antichrist (originally titled Død), their second full-length album.\n",
      "Vocalist Hat decided to leave Gorgoroth in September 1995, but agreed to finish recording the vocal tracks for Antichrist. After Hat left, Infernus recruited vocalist Pest from Obtained Enslavement as Gorgoroth's new vocalist. In December 1995, the band supported Cradle of Filth at the London Astoria, a show which also included the band Primordial.[11] This marked the first Gorgoroth live appearance of both vocalist Pest and bassist Ares. In 1995 the band had been offered a record deal with Moonfog Productions, but this offer was rejected in favour of an offer made by German label Malicious Records. Malicious Records released the band's second album, Antichrist, in 1996, and also re-released the debut album Pentagram. The band went on a European tour with Satyricon and Dissection in April 1996,[9] followed by a one-off gig in Bergen with Hades Almighty and Gehenna, at which the live EP The Last Tormentor was recorded. The band also played a one-off gig in the fall in Bischofswerda, Germany, with Behemoth. Soon the name Gorgoroth was commonplace in the black metal underground, both in Norway and in the rest of Europe, if somewhat overshadowed by some of the more famous black metal bands such as Mayhem or Emperor. The band's third full-length album, Under the Sign of Hell, was recorded in spring 1996, and guitarist Tormentor joined the band later in the year. Under the Sign of Hell was released in 1997, and Gorgoroth went on their first headlining European tour in fall 1997, with support by Mystic Circle.[12] It was on this tour that Infernus and Tormentor were approached by the major German heavy metal record label Nuclear Blast, who wanted to sign the band. The band accepted the offer in late 1997.[citation needed]\n"
   ]
}