{
   "Name": "Gorgoroth",
   "rawData": [
      "Gorgoroth is a Norwegian black metal band based in Bergen. It was formed in 1992 by guitarist Infernus, who is also the only original member remaining, and the band have since released nine studio albums. Gorgoroth are a Satanic band and have drawn controversy due to some of their concerts, which have featured impaled sheep heads and mock crucifixions. The band is named after the dead plateau of darkness in the land of Mordor from J. R. R. Tolkien's fantasy novel The Lord of the Rings.\n",
      "Gorgoroth was founded in 1992 by guitarist Infernus. In 1993, the band released their first demo, entitled A Sorcery Written in Blood. On January 7, 1994, Firda, the major newspaper in the county of Sogn og Fjordane where the band originated from, ran a cover story on the demo, with the headline \"Local music with Satanic symbolism\". According to the article, the release of the demo and flyers with Satanic symbols led to \"concerned parents contacting the Sheriff's Office in Fjaler\". After the demo was released, Gorgoroth signed a record deal with Embassy Productions and started work on their debut full-length Pentagram. When bassist Kjettar left the band in 1993, Samoth of Emperor joined Gorgoroth as their new bassist, and participated in the recording of the album. After Pentagram was completed and released in 1994, drummer Goat left the band and was replaced by Frost from Satyricon. The band performed their first concert at Lusa Lottes Pøbb in Oslo, Norway, on May 3, 1994, at a four-day Black Metal Nights festival with bands such as Dark Funeral (who also made their live debut), Dissection, Enslaved, Marduk (who played their first gig abroad), Gehenna and Hades Almighty.\n",
      "This was followed by gigs with Enslaved in Bergen (in June and September) and in Haugesund (in November), and the band performed their first gig abroad in Annaberg-Buchholz in Germany on December 10, 1994. The same year, the band commenced the recording of Antichrist (originally titled Død), their second full-length album.\n"
   ],
   "infobox": {
      "Origin": [
         "Sunnfjord, Sogn og Fjordane, Norway"
      ],
      "Genres": [
         "Black metal[1]"
      ],
      "Years active": [
         "1992–present"
      ],
      "Labels": [
         "Soulseller[2]",
         "Embassy Productions",
         "Malicious",
         "Candlelight",
         "Century Media",
         "Nuclear Blast",
         "Season of Mist[3]",
         "Forces of Satan[4]",
         "Regain"
      ],
      "Associated acts": [
         "1349",
         "Aeternus",
         "Audrey Horne",
         "Borknagar",
         "Dark Funeral",
         "Daudur",
         "Dawn",
         "Desekrator",
         "Dissection",
         "Emperor",
         "Gaahlskagg",
         "God Seed",
         "I",
         "Immortal",
         "Jotunspor",
         "Malignant Eternal",
         "Norwegian Evil",
         "Obituary",
         "Obtained Enslavement",
         "Orcustus",
         "Ov Hell",
         "Sahg",
         "Satyricon",
         "Sigfader",
         "Trelldom",
         "Wardruna"
      ],
      "Website": [
         "www.gorgoroth.info"
      ],
      "Members": [
         "Infernus",
         "Tomas Asklund",
         "Atterigner"
      ],
      "Past members": [
         "Hat",
         "Goat Pervertor",
         "Kjettar",
         "Samoth",
         "Grim",
         "Storm",
         "Ares",
         "Vrolok",
         "T-Reaper",
         "Sjt. Erichsen",
         "Kvitrafn",
         "Frost",
         "Gaahl",
         "King ov Hell",
         "Pest",
         "Tormentor",
         "Bøddel"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band based in Bergen. It was formed in [YEAR] by guitarist Infernus, who is also the only original member remaining, and the band have since released nine studio albums. [BAND_NAME] are a Satanic band and have drawn controversy due to some of their concerts, which have featured impaled sheep heads and mock crucifixions. The band is named after the dead plateau of darkness in the land of Mordor from J. R. R. Tolkien's fantasy novel The Lord of the Rings.\n",
      "[BAND_NAME] was founded in [YEAR] by guitarist Infernus. In [YEAR], the band released their first demo, entitled A Sorcery Written in Blood. On [MONTH] 7, [YEAR], Firda, the major newspaper in the county of Sogn og Fjordane where the band originated from, ran a cover story on the demo, with the headline \"Local music with Satanic symbolism\". According to the article, the release of the demo and flyers with Satanic symbols led to \"concerned parents contacting the Sheriff's Office in Fjaler\". After the demo was released, [BAND_NAME] signed a record deal with Embassy Productions and started work on their debut full-length Pentagram. When bassist Kjettar left the band in [YEAR], Samoth of Emperor joined [BAND_NAME] as their new bassist, and participated in the recording of the album. After Pentagram was completed and released in [YEAR], drummer Goat left the band and was replaced by Frost from Satyricon. The band performed their first concert at Lusa Lottes Pøbb in Oslo, Norway, on [MONTH] 3, [YEAR], at a four-day Black Metal Nights festival with bands such as Dark Funeral (who also made their live debut), Dissection, Enslaved, [MONTH]duk (who played their first gig abroad), Gehenna and Hades Almighty.\n",
      "This was followed by gigs with Enslaved in Bergen (in [MONTH] and [MONTH]) and in Haugesund (in [MONTH]), and the band performed their first gig abroad in Annaberg-Buchholz in Germany on [MONTH] 10, [YEAR]. The same year, the band commenced the recording of Antichrist (originally titled Død), their second full-length album.\n"
   ]
}