{
   "Name": "Kataklysm",
   "rawData": [
      "Kataklysm is a Canadian death metal band. They have released fourteen studio albums, one EP and two DVDs as of 2020. Kataklysm won their first Juno Award (Canadian equivalent of the Grammy) for best album of the year in the \"heavy metal\" category for their 2015 album Of Ghosts & Gods. The band's albums have charted throughout the world, including the Billboard Top 100 in the United States.\n",
      "Kataklysm was formed in Montreal, Quebec in September 1991. At the beginning of their career, they were known for their fast and technical brand of death metal, known as the \"Northern Hyperblast\". Nuclear Blast Records soon took notice of the band in 1992 after noticing the band's debut demo The Death Gate Cycle of Reincarnation, which gained significant praise from the underground metal scene. In 1994, Kataklysm signed to Nuclear Blast and released their first EP The Mystical Gate of Reincarnation, followed by their debut album Sorcery in 1995. This was followed in 1996 by their second full-length album Temple of Knowledge, which they accompanied with their first music video for the album's track, \"The Awakener\". Following the release of this album however, founding member and lead vocalist Sylvain Houde departed from the band. This, as Houde himself confessed, was due to the emotional effects surrounding the end of his romantic relationship. Subsequently, the band's bassist Maurizio Iacono replaced Houde as vocalist, ceding his duties as bassist to Stephane Barbe. The band's musical direction shifted from being primarily spearheaded by Houde to both Iacono and founding guitarist JF Dagenais instead.\n",
      "In 1998, the band released their third studio album Victims of this Fallen World, (Iacono's first as vocalist) which has been noted as incorporating a more groove-oriented and melodic musical style of death metal. The following album The Prophecy (Stigmata of the Immaculate) released in 2000 consolidated this style, lessening the chaotic nature of their work thus far and incorporating greater influences from thrash metal. The band's 2001 album Epic: The Poetry of War added further melody to the band's approach to death metal and the band continued to gain attention and positive critical reception. In the following year, the band released Shadows & Dust, which has been viewed by critics as one of the band's most successful releases because of the overwhelmingly positive reception the band received and the increase in sales compared to the band's prior releases, being the first album to chart in countries such as Germany, Austria and Switzerland, and featured one of the band's most recognisable tracks: \"In Shadows & Dust\".\n"
   ],
   "infobox": {
      "Origin": [
         "Montreal, Quebec, Canada"
      ],
      "Genres": [
         "Death metal, melodic death metal"
      ],
      "Years active": [
         "1991 (1991)–present"
      ],
      "Labels": [
         "Nuclear Blast"
      ],
      "Associated acts": [
         "Ex Deo"
      ],
      "Website": [
         "kataklysm.ca"
      ],
      "Members": [
         "Maurizio Iacono",
         "Jean-François Dagenais",
         "Stephane Barbe",
         "James Payne"
      ],
      "Past members": [
         "Sylvain Houde",
         "Martin Maurais",
         "Nick Miller",
         "Ariel Saied Martinez",
         "Max Duhamel",
         "Oli Beaudoin"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band. They have released fourteen studio albums, one EP and two DVDs as of [YEAR]. [BAND_NAME] won their first [MONTH]o Award (Canadian equivalent of the Grammy) for best album of the year in the \"heavy metal\" category for their [YEAR] album Of Ghosts & Gods. The band's albums have charted throughout the world, including the Billboard Top 100 in the United States.\n",
      "[BAND_NAME] was formed in Montreal, Quebec in [MONTH] [YEAR]. At the beginning of their career, they were known for their fast and technical brand of death metal, known as the \"Northern Hyperblast\". Nuclear Blast Records soon took notice of the band in [YEAR] after noticing the band's debut demo The Death Gate Cycle of Reincarnation, which gained significant praise from the underground metal scene. In [YEAR], [BAND_NAME] signed to Nuclear Blast and released their first EP The Mystical Gate of Reincarnation, followed by their debut album Sorcery in [YEAR]. This was followed in [YEAR] by their second full-length album Temple of Knowledge, which they accompanied with their first music video for the album's track, \"The Awakener\". Following the release of this album however, founding member and lead vocalist [PERSON_NAME_FULL_1_MALE] departed from the band. This, as [PERSON_NAME_LAST_1] himself confessed, was due to the emotional effects surrounding the end of his romantic relationship. Subsequently, the band's bassist [PERSON_NAME_FULL_0_MALE] replaced [PERSON_NAME_LAST_1] as vocalist, ceding his duties as bassist to Stephane Barbe. The band's musical direction shifted from being primarily spearheaded by [PERSON_NAME_LAST_1] to both [PERSON_NAME_LAST_0] and founding guitarist JF Dagenais instead.\n",
      "In [YEAR], the band released their third studio album Victims of this Fallen World, (Iacono's first as vocalist) which has been noted as incorporating a more groove-oriented and melodic musical style of death metal. The following album The Prophecy (Stigmata of the Immaculate) released in [YEAR] consolidated this style, lessening the chaotic nature of their work thus far and incorporating greater influences from thrash metal. The band's [YEAR] album Epic: The Poetry of War added further melody to the band's approach to death metal and the band continued to gain attention and positive critical reception. In the following year, the band released Shadows & Dust, which has been viewed by critics as one of the band's most successful releases because of the overwhelmingly positive reception the band received and the increase in sales compared to the band's prior releases, being the first album to chart in countries such as Germany, Austria and Switzerland, and featured one of the band's most recognisable tracks: \"In Shadows & Dust\".\n"
   ]
}