{
   "Name": "Katatonia",
   "rawData": [
      "Katatonia are a Swedish metal band formed in Stockholm in 1991 by Jonas Renkse and Anders Nyström. The band started as a studio-only project for the duo, as an outlet for the band's love of death metal. Increasing popularity led them to add more band members for live performances, though outside of the band's founders, the lineup was a constantly changing, revolving door of musicians throughout the 1990s, notably including Mikael Åkerfeldt of the band Opeth for a period. After two death/doom albums, Dance of December Souls (1993) and Brave Murder Day (1996), problems with Renkse's vocal cords coupled with new musical influences led the band away from the screamed vocals of death metal to a more traditional, melodic form of heavy metal music. \n",
      "The band released two more albums, Discouraged Ones (1998) and Tonight's Decision (1999), before settling into a stable quintet lineup for all of the 2000s. The band released four more albums with said lineup: Last Fair Deal Gone Down (2001), Viva Emptiness (2003), The Great Cold Distance (2006), and Night Is the New Day (2009), with the band slowly moving away from their metal sound while adding more progressive rock sounds to their work over time. While lineup changes started up again into the 2010s, Renkse and Nyström persisted, and the band continued on to release their ninth and tenth studio albums, Dead End Kings (2012) and  The Fall of Hearts (2016). After touring in support of the album through 2017, the band entered a hiatus at the beginning of 2018. The band returned from their hiatus in February 2019, with their eleventh studio album, City Burials, released in April 2020.\n",
      "The band was first formed in 1991 by Jonas Renkse and Anders Nyström as a two piece studio-based project. Renkse would provide clean and screamed vocals and drums, while Nystrom would provide all bass and guitars. Renkse was the primary lyricist, while Nystrom was the primary music composer. The duo had been working together with music in some capacity since 1987, but became serious about making music in 1991, when they began work on their first release, the demo Jhva Elohim Meth... The Revival. The release, along with the next few subsequent releases by the band, were of the death/doom metal sound, with the members being inspired and influenced by the rise of death metal becoming popular in Europe at the time. The release was enough of a hit in the underground metal scene to garner the attention of a small music label, Vic Records, which re-released it as an EP in 1993, which helped gain more exposure for the duo. The newfound popularity found them recruiting a bass guitarist, Guillaume Le Huche, so the trio could play live performances, and returning to the studio to recreate a debut full-length album. The resulting work, Dance of December Souls, was released in late 1993. The album's bleak melancholy and despair of their sound, continued to give them the classification of death/doom.\n"
   ],
   "infobox": {
      "Origin": [
         "Stockholm, Sweden"
      ],
      "Genres": [
         "Progressive rock[1][2]",
         "dark rock[3][4]",
         "progressive metal[5][6]",
         "doom metal[7][8]",
         "death-doom (early)[9][10][11]"
      ],
      "Years active": [
         "1991–1994",
         "1996–2018",
         "2019–present"
      ],
      "Labels": [
         "Avantgarde Music",
         "No Fashion",
         "Peaceville",
         "Vic"
      ],
      "Associated acts": [
         "Bloodbath",
         "Opeth",
         "October Tide"
      ],
      "Website": [
         "www.katatonia.com"
      ],
      "Members": [
         "Jonas Renkse",
         "Anders Nyström",
         "Niklas Sandin",
         "Daniel Moilanen",
         "Roger Öjersson"
      ],
      "Past members": [
         "Guillaume Le Huche",
         "Fredrik Norrman",
         "Mikael Oretoft",
         "Mattias Norrman",
         "Per Eriksson",
         "Daniel Liljekvist",
         "Mikael Åkerfeldt"
      ]
   },
   "albums": [
      "Dance of December Souls",
      "Brave Murder Day",
      "Discouraged Ones",
      "Tonight's Decision",
      "Last Fair Deal Gone Down",
      "Viva Emptiness",
      "The Great Cold Distance",
      "Night Is the New Day",
      "Dead End Kings",
      "The Fall of Hearts",
      "City Burials"
   ],
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band formed in Stockholm in [YEAR] by [PERSON_NAME_FULL_0_MALE] and [PERSON_NAME_FULL_2_MALE]. The band started as a studio-only project for the duo, as an outlet for the band's love of death metal. Increasing popularity led them to add more band members for live performances, though outside of the band's founders, the lineup was a constantly changing, revolving door of musicians throughout the [YEAR]s, notably including [PERSON_NAME_FULL_1_MALE] of the band Opeth for a period. After two death/doom albums, Dance of [MONTH] Souls ([YEAR]) and Brave Murder Day ([YEAR]), problems with [PERSON_NAME_LAST_0]'s vocal cords coupled with new musical influences led the band away from the screamed vocals of death metal to a more traditional, melodic form of heavy metal music. \n",
      "The band released two more albums, Discouraged Ones ([YEAR]) and Tonight's [MONTH]ision ([YEAR]), before settling into a stable quintet lineup for all of the [YEAR]s. The band released four more albums with said lineup: Last Fair Deal Gone Down ([YEAR]), Viva Emptiness ([YEAR]), The Great Cold Distance ([YEAR]), and Night Is the New Day ([YEAR]), with the band slowly moving away from their metal sound while adding more progressive rock sounds to their work over time. While lineup changes started up again into the [YEAR]s, Renkse and Nyström persisted, and the band continued on to release their ninth and tenth studio albums, Dead End Kings ([YEAR]) and  The Fall of Hearts ([YEAR]). After touring in support of the album through [YEAR], the band entered a hiatus at the beginning of [YEAR]. The band returned from their hiatus in [MONTH] [YEAR], with their eleventh studio album, City Burials, released in [MONTH] [YEAR].\n",
      "The band was first formed in [YEAR] by [PERSON_NAME_FULL_0_MALE] and [PERSON_NAME_FULL_2_MALE] as a two piece studio-based project. [PERSON_NAME_LAST_0] would provide clean and screamed vocals and drums, while Nystrom would provide all bass and guitars. [PERSON_NAME_LAST_0] was the primary lyricist, while Nystrom was the primary music composer. The duo had been working together with music in some capacity since [YEAR], but became serious about making music in [YEAR], when they began work on their first release, the demo Jhva Elohim Meth... The Revival. The release, along with the next few subsequent releases by the band, were of the death/doom metal sound, with the members being inspired and influenced by the rise of death metal becoming popular in Europe at the time. The release was enough of a hit in the underground metal scene to garner the attention of a small music label, [PERSON_NAME_FULL_1_MALE], which re-released it as an EP in [YEAR], which helped gain more exposure for the duo. The newfound popularity found them recruiting a bass guitarist, Guillaume Le Huche, so the trio could play live performances, and returning to the studio to recreate a debut full-length album. The resulting work, Dance of [MONTH] Souls, was released in late [YEAR]. The album's bleak melancholy and despair of their sound, continued to give them the classification of death/doom.\n"
   ]
}