{
   "Name": "Lake of Tears",
   "Sections": [
      "1 History",
      "1.1 Early years",
      "1.2 Mid-career success: A Crimson Cosmos",
      "1.3 The breakup",
      "1.4 The reunion and recent activity",
      "2 Current line-up",
      "2.1 Former members",
      "3 Discography",
      "3.1 Full length",
      "3.2 Compilations and singles",
      "3.3 Live albums",
      "4 Sources",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Lake of Tears is a Swedish heavy metal band originally formed in 1994, generally considered to play gothic metal/gothic rock[1][2][3] and doom metal. However, their sound has expanded to include psychedelic rock and progressive rock elements. The band broke up in 2000 amid creative differences, but reunited in late 2003, releasing the acclaimed album Black Brick Road. They released their eighth studio album, Illwill, in April 2011. In 2014 they released their first live album, By the Black Sea. The band's newest album, titled Ominous, was released on February 18th 2021.\n"
      ]
   },
   "History": {
      "Early years": {
         "text": [
            "Lake of Tears was founded in the early 1990s by Daniel Brennare, Jonas Eriksson, Mikael Larsson and Johan Oudhuis.  Their first album, entitled Greater Art, was released through the record label Black Mark Production in 1994. The album is doom metal featuring coarse, ragged vocals and crushing guitars. The band would subsequently steer away from such a directly categorized style, only revisiting it on their 2011 release Illwill.\n",
            "Lake of Tears wowed critics and fans alike with their second recording, Headstones, released in 1995. The music underwent important changes, expanding on the riff-base of doom metal to achieve a more melodic and melancholic sound. The lyrics also explored new territory, intensely mournful and psychedelic fantasy imagery enhancing the album's heavy, autumnal soundscapes.\n"
         ]
      },
      "Mid-career success: A Crimson Cosmos": {
         "text": [
            "1997 brought the release of the band's most popular studio effort until then, A Crimson Cosmos.  If Headstones had been a revision of their earlier sound, A Crimson Cosmos was a complete rebirth, being a hypnotically melodic album.  The release's closing track, \"A Crimson Cosmos\", reflected a marked influence by progressive/psychedelic luminaries Pink Floyd, while other tracks, such as Lady Rosenred and Raistlin and the Rose reflected popular fantasy themes.  Rhythm guitarist Jonas Eriksson had left the band before the release, being replaced by guitarist Ulrik Lindblom. After recording A Crimson Cosmos and touring with Lake of Tears until 1999, he also left the band and had to be substituted by Magnus Sahlgren, who played as lead guitarist, but only as a guest artist. Although he played on Forever Autumn and every subsequent Lake of Tears album, often composing the majority of lead guitar riffs, Sahlgren was only formally accepted as a band member following the release of 2004's Black Brick Road.\n",
            "Lake of Tears' 1999 album, Forever Autumn, did not follow the trend settled by Headstones and A Crimson Cosmos, resulting an intensely quiet and introspective album.[citation needed]  Keyboardist Christian Saarinen was briefly included as an official band member, adding an extra layer to the band's sound. Fantasy imagery was rife and the album's overall effect was sedate and sorrowful.\n"
         ]
      },
      "The breakup": {
         "text": [
            "Because of personal and creative differences, but also (and perhaps more-so) because of the lack of attention the band received from their label, the band went their separate ways shortly after the release of Forever Autumn, though they were still contractually bound to deliver one more album for Black Mark Production. This being the case, Brennare and Sahlgren retreated to the studio to record The Neonai, an electronica-influenced album relying on drum machines and uncharacteristically slick production values. The resulting album was released in 2002, and featured some of the band's most inspired songwriting and memorable melodies, regardless of the hasty manner in which it was composed and recorded.\n"
         ]
      },
      "The reunion and recent activity": {
         "text": [
            "In 2003 the band reunited out of boredom, participating in several jams.  They were quick to realize that the brief hiatus had reinvigorated their collective spirits, and began to tentatively compose the material eventually released on their 2004 endeavor, Black Brick Road.  Feeling that Black Mark Production had failed to market them appropriately, Lake of Tears began shopping for a new record label, and eventually settled on Noise Records.  The subsequent release of Black Brick Road found the band exploring fresh concepts -the majority of the songs are highly abstract in nature, focusing on emotional states and dream- like imagery over specific nods to fantasy fiction and narrative structure.[citation needed]   Following the album's release, Magnus Sahlgren was finally accepted as a member of the band, making his almost five years association official.\n",
            "Lake of Tears released their seventh studio album Moons and Mushrooms on April 26, 2007. The album featured a heavier approach to the guitar-work, unlike Black Brick Road whose melodies were primarily conceived via keyboard experimentation.[4] The music was created directly in the rehearsal room, a new approach for the band. Moons and Mushrooms has a harder rock sound, though Brennare's lyrics continued to lean towards the melancholic and conceptual.[citation needed]\n",
            "A new album titled Illwill was released on April 29, 2011. It features an even heavier, darker approach, eschewing the band's typical evocation of mournful themes in favor of bleak and disturbing imagery.[citation needed]\n",
            "Lake of Tears released their first-ever live album on January 31, 2014. The album is titled By the Black Sea, and includes a full concert with 16 songs recorded earlier this year in Bucharest, Romania. It is also available as DVD/CD set.\n",
            "On July 13, 2020, Daniel Brennare publicly disclosed that he had been diagnosed with chronic leukaemeia, and that Illwill was \"maybe a more obscure way\" of dealing with it [5] The same post suggests the name of the next album is \"Ominous\".\n"
         ]
      }
   },
   "Current line-up": {
      "Former members": {}
   },
   "Discography": {
      "Full length": {},
      "Compilations and singles": {},
      "Live albums": {}
   },
   "Sources": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Lake of Tears is a Swedish heavy metal band originally formed in 1994, generally considered to play gothic metal/gothic rock[1][2][3] and doom metal. However, their sound has expanded to include psychedelic rock and progressive rock elements. The band broke up in 2000 amid creative differences, but reunited in late 2003, releasing the acclaimed album Black Brick Road. They released their eighth studio album, Illwill, in April 2011. In 2014 they released their first live album, By the Black Sea. The band's newest album, titled Ominous, was released on February 18th 2021.\n",
      "Lake of Tears was founded in the early 1990s by Daniel Brennare, Jonas Eriksson, Mikael Larsson and Johan Oudhuis.  Their first album, entitled Greater Art, was released through the record label Black Mark Production in 1994. The album is doom metal featuring coarse, ragged vocals and crushing guitars. The band would subsequently steer away from such a directly categorized style, only revisiting it on their 2011 release Illwill.\n",
      "Lake of Tears wowed critics and fans alike with their second recording, Headstones, released in 1995. The music underwent important changes, expanding on the riff-base of doom metal to achieve a more melodic and melancholic sound. The lyrics also explored new territory, intensely mournful and psychedelic fantasy imagery enhancing the album's heavy, autumnal soundscapes.\n",
      "1997 brought the release of the band's most popular studio effort until then, A Crimson Cosmos.  If Headstones had been a revision of their earlier sound, A Crimson Cosmos was a complete rebirth, being a hypnotically melodic album.  The release's closing track, \"A Crimson Cosmos\", reflected a marked influence by progressive/psychedelic luminaries Pink Floyd, while other tracks, such as Lady Rosenred and Raistlin and the Rose reflected popular fantasy themes.  Rhythm guitarist Jonas Eriksson had left the band before the release, being replaced by guitarist Ulrik Lindblom. After recording A Crimson Cosmos and touring with Lake of Tears until 1999, he also left the band and had to be substituted by Magnus Sahlgren, who played as lead guitarist, but only as a guest artist. Although he played on Forever Autumn and every subsequent Lake of Tears album, often composing the majority of lead guitar riffs, Sahlgren was only formally accepted as a band member following the release of 2004's Black Brick Road.\n"
   ]
}