{
   "Name": "Lake of Tears",
   "rawData": [
      "Lake of Tears is a Swedish heavy metal band originally formed in 1994, generally considered to play gothic metal/gothic rock and doom metal. However, their sound has expanded to include psychedelic rock and progressive rock elements. The band broke up in 2000 amid creative differences, but reunited in late 2003, releasing the acclaimed album Black Brick Road. They released their eighth studio album, Illwill, in April 2011. In 2014 they released their first live album, By the Black Sea. The band's newest album, titled Ominous, was released on February 18th 2021.\n",
      "Lake of Tears was founded in the early 1990s by Daniel Brennare, Jonas Eriksson, Mikael Larsson and Johan Oudhuis.  Their first album, entitled Greater Art, was released through the record label Black Mark Production in 1994. The album is doom metal featuring coarse, ragged vocals and crushing guitars. The band would subsequently steer away from such a directly categorized style, only revisiting it on their 2011 release Illwill.\n",
      "Lake of Tears wowed critics and fans alike with their second recording, Headstones, released in 1995. The music underwent important changes, expanding on the riff-base of doom metal to achieve a more melodic and melancholic sound. The lyrics also explored new territory, intensely mournful and psychedelic fantasy imagery enhancing the album's heavy, autumnal soundscapes.\n"
   ],
   "infobox": {
      "Origin": [
         "Borås, Sweden"
      ],
      "Genres": [
         "Gothic metal ",
         " Doom metal ",
         " Progressive metal ",
         " Gothic rock"
      ],
      "Years active": [
         "1994–2000, 2003–present"
      ],
      "Labels": [
         "Black Mark, Noise, Dockyard1"
      ],
      "Website": [
         "lakeoftears.net"
      ],
      "Members": [
         "Daniel Brennare",
         "Mikael Larsson",
         "Johan Oudhuis",
         " Fredrik Jordanius"
      ],
      "Past members": [
         "Jonas Eriksson",
         "Christian Saarinen",
         "Ulrik Lindblom",
         "Magnus Sahlgren"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band originally formed in [YEAR], generally considered to play gothic metal/gothic rock and doom metal. However, their sound has expanded to include psychedelic rock and progressive rock elements. The band broke up in [YEAR] amid creative differences, but reunited in late [YEAR], releasing the acclaimed album Black Brick Road. They released their eighth studio album, Illwill, in [MONTH] [YEAR]. In [YEAR] they released their first live album, By the Black Sea. The band's newest album, titled Ominous, was released on [MONTH] 18th [YEAR].\n",
      "[BAND_NAME] was founded in the early [YEAR]s by Daniel Brennare, [PERSON_NAME_FULL_0_MALE], [PERSON_NAME_FULL_1_MALE] and [PERSON_NAME_FULL_2_MALE].  Their first album, entitled Greater Art, was released through the record label Black [MONTH]k Production in [YEAR]. The album is doom metal featuring coarse, ragged vocals and crushing guitars. The band would subsequently steer away from such a directly categorized style, only revisiting it on their [YEAR] release Illwill.\n",
      "[BAND_NAME] wowed critics and fans alike with their second recording, Headstones, released in [YEAR]. The music underwent important changes, expanding on the riff-base of doom metal to achieve a [GENRE]"
   ]
}