{
   "Acclaim": {
      "text": [
         "On May 16, 2010, in Erwinville, Louisiana, Lilian Axe became the first hard rock act to be inducted into the Louisiana Music Hall of Fame.\n[16]\n"
      ]
   },
   "Biography": {
      "text": [
         "The band's origins are based in the New Orleans based band Oz which guitarist Steve Blaze joined in the early 80s, which included Rick Bohrer on vocals, Orlando \"Ace\" Palacio on guitar, Michael \"Maxx\" Darby on bass guitar, and Jeff Savelle on drums. When Palacio quit, the band told Blaze that he was the new lead guitarist. The band played gigs under the Oz moniker until Blaze came up with the name Lillian Axe driving home from seeing the movie Creepshow. Blaze was inspired by a scene in the movie where a skeleton in a bridesmaid dress was floating in a window. The name \"Lillian\" came to mind as a \"creepy sounding, old lady name\" along with the word Axe to complete the name.[2] Blaze noted, \"“So, it’s like a skeleton with a veil, and it inspired me. What would that apparition’s name be? Some creepy old lady’s name, so the name Lillian came to mind. I was sitting at the red light on the corner of Houma Boulevard and Veterans when I immediately thought ‘Lillian Axe.’”\n",
         "Bohrer and Cavalier left the band and were replaced by Johnny Vines and Danny King, respectively. For the next four years, Lillian Axe toured extensively opening for bands such as Ratt, Poison and Queensryche. In 1987 at a show in Dallas, the band caught the eye of MCA Records and Marshall Berle (nephew of Milton Berle) who at the time was managing the band Ratt. MCA wanted to sign Steve, since he wrote the songs and owned the name. At the time, the band was experiencing some tensions due to addictions. Blaze recalled, “Quite honestly the way things were going at the time, some of the things had gotten so out of hand that I thought that we wouldn’t wind up lasting much longer in that capacity. It was chaotic at that time, a few of the guys had addiction issues and I had to make a decision to move forward.”[3]\n",
         "During this time, Blaze considered several singers including Jani Lane of Warrant. Marshal Berle mentioned Lane to Blaze and suggested the two meet even though Warrant was already under negotiations with Columbia Records. Jani flew down to New Orleans and spent four days with Blaze, attending Lillian Axe shows and hanging out with Blaze. While the two had a strong mutual respect for one another, it became clear that each of them were the leaders and chief songwriters of their respective bands.[4]\n",
         "The classic line-up came together when former Stiff members, Ron Taylor (lead vocals), Jon Ster (rhythm guitar, keyboards, backing vocals), and Rob Stratton (bass guitar, teamed up with Lillian Axe members Steve Blaze (lead guitar, keyboards, backing vocals),  and Danny King (drums) in 1987. The band caught the attention of Ratt's management which led to a record deal with MCA and Ratt's Robbin Crosby producing the band's first album, Lillian Axe. However, neither this nor the 1989 follow-up, Love + War, produced by Tony Platt, met commercial expectations and the group was quickly dropped. A compilation of both MCA albums, (1987-1989) Out of the Darkness - Into the Light, was released in 1991.\n",
         "The band found a new label home with Grand Slamm/I.R.S. Records for Poetic Justice, released in 1992, with Darrin DeLatte (bass guitar) and the former Dirty Looks member Gene Barnett (drums) replacing Stratton and King, respectively. The album peaked on the Billboard Top Heatseekers at No. 28,[5] the band's biggest success to date,  in part based on the strength of the single, \"True Believer\".  Returning to the studio with the Swedish producer Leif Mases, the group issued Psychoschizophrenia in 1993, with Tommy Scott replacing Barnett on drums. Unable to capitalize on their previous success, Lillian Axe disbanded in 1995. Taylor formed The Bridge, while Blaze teamed up with his brother, the drummer Craig Nunenmacher, in Near Life Experience, and Scott, aka Tommy Stewart, found success with Boston's Godsmack, appearing on the band's platinum-selling Godsmack and Awake albums.\n",
         "In 1999, Lillian Axe released Fields of Yesterday, consisting of unreleased demos and album outtakes, followed by Live 2002, recorded in May 2002 in Houston, Texas, with only Taylor and Blaze remaining from the classic MCA line-up.\n",
         "After several line-up changes, the band recruited as lead vocalist Derrick LeFevre, who appeared on Waters Rising (2007), Sad Day on Planet Earth (2009) and Deep Red Shadows (2010). On June 23, 2010, Ronny Munroe, formerly of Metal Church, replaced LeFevre, but he departed four months later before recording any material with the band. On March 7, 2011 Munroe was replaced by Brian C. Jones, who can be heard on the album XI The Days Before Tomorrow (2012).\n",
         "In 2011 it was announced that the original lineup of Steve Blaze, Johnny Vines, Danny King and Michael \"Maxx\" Darby would reunite to record an album of classic unreleased songs from the band's early days. The project, entitled Circle of Light, was named for one those early songs. The album was released in 2012.[6]\n",
         "On August 8, 2013, Lillian Axe was involved in an automobile accident. Band members were treated at local hospitals for minor and non-threatening injuries. There was extensive damage to the band's equipment.[7]\n",
         "Lillian Axe released One Night in the Temple,[8] an acoustic live album, early in 2014.[9]\n",
         "On November 29, 2014, former guitarist Jon Ster died from heart failure at the age of 52.[10]\n",
         "On January 12, 2017 Lillian Axe received the 2017 Jackson Indie Music Week Icon Award at Duling Hall in Jackson, Mississippi.[11]\n",
         "On June 4, 2017, Steve Blaze announced that the band was recording a new song entitled \"The Weeping Moon\", which was to be featured on the album The Forgotten Art of Melancholy. According to Blaze, the album would feature \"the best of the epic ballads\" and was scheduled to be released in the fall of 2017.[12]\n",
         "On November 30, 2018 Steve Blaze announced the next Lillian Axe album is in the works, tentatively entitled From Womb to Tomb, and it will be in large part an autobiographical work. Blaze also states the album will feature \"strings, piano, big vocals\" and describes it as a \"celebration type record - of life - good and bad.\"[13] The album, however, did not come to fruition.\n",
         "On February 13, 2020, Steve Blaze announced that Lillian Axe were amicably parting ways with lead vocalist Brian Jones.[14] The announcement also stated that Jones would still be a part of the Lillian Axe family in many capacities, and Blaze wished Jones luck in his solo career. On February 21, 2020, Blaze announced the new singer would be Brent Graham. Graham was the original vocalist for Blaze's side project \"Sledgehammer,\" and vocalist of the New Orleans-based band Supercharger.[15]\n"
      ]
   },
   "Discography": {
      "Compilations": {},
      "Live albums": {},
      "Studio albums": {},
      "Videos": {}
   },
   "External links": {},
   "Members": {
      "Current line-up": {},
      "Former members": {},
      "Original line-up": {}
   },
   "References": {},
   "Sections": [
      "1 Biography",
      "2 Acclaim",
      "3 Members",
      "3.1 Current line-up",
      "3.2 Original line-up",
      "3.3 Former members",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Compilations",
      "4.3 Live albums",
      "4.4 Videos",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Lillian Axe is an American hard rock band from New Orleans, Louisiana, US, best known for its major label albums, Lillian Axe, Love + War, Poetic Justice and Psychoschizophrenia.  Originally formed in 1983, the group is still active, though only the guitarist Steve Blaze and bassist Michael Max Darby remain from the original line-up.\n"
      ]
   },
   "Title": "Lillian Axe - Wikipedia"
}