{
   "Name": "Lillian Axe",
   "rawData": [
      "Lillian Axe is an American hard rock band from New Orleans, Louisiana, US, best known for its major label albums, Lillian Axe, Love + War, Poetic Justice and Psychoschizophrenia.  Originally formed in 1983, the group is still active, though only the guitarist Steve Blaze and bassist Michael Max Darby remain from the original line-up.\n",
      "The band's origins are based in the New Orleans based band Oz which guitarist Steve Blaze joined in the early 80s, which included Rick Bohrer on vocals, Orlando \"Ace\" Palacio on guitar, Michael \"Maxx\" Darby on bass guitar, and Jeff Savelle on drums. When Palacio quit, the band told Blaze that he was the new lead guitarist. The band played gigs under the Oz moniker until Blaze came up with the name Lillian Axe driving home from seeing the movie Creepshow. Blaze was inspired by a scene in the movie where a skeleton in a bridesmaid dress was floating in a window. The name \"Lillian\" came to mind as a \"creepy sounding, old lady name\" along with the word Axe to complete the name. Blaze noted, \"“So, it’s like a skeleton with a veil, and it inspired me. What would that apparition’s name be? Some creepy old lady’s name, so the name Lillian came to mind. I was sitting at the red light on the corner of Houma Boulevard and Veterans when I immediately thought ‘Lillian Axe.’”\n",
      "Bohrer and Cavalier left the band and were replaced by Johnny Vines and Danny King, respectively. For the next four years, Lillian Axe toured extensively opening for bands such as Ratt, Poison and Queensryche. In 1987 at a show in Dallas, the band caught the eye of MCA Records and Marshall Berle (nephew of Milton Berle) who at the time was managing the band Ratt. MCA wanted to sign Steve, since he wrote the songs and owned the name. At the time, the band was experiencing some tensions due to addictions. Blaze recalled, “Quite honestly the way things were going at the time, some of the things had gotten so out of hand that I thought that we wouldn’t wind up lasting much longer in that capacity. It was chaotic at that time, a few of the guys had addiction issues and I had to make a decision to move forward.”\n"
   ],
   "infobox": {
      "Origin": [
         "New Orleans, Louisiana, US"
      ],
      "Genres": [
         "Glam metal,[1] heavy metal,[1] hard rock"
      ],
      "Years active": [
         "1983–1995; 1999–present"
      ],
      "Associated acts": [
         "Angel, Apache Black, Blitz, Bon Journey, Brand New Machine, The Bridge, Catch Velvet, Circle of Light, Contraflow, Crowbar, Dirty Looks, Evildead, Far Cry, Hagan, Killian Dare, Krymson, Logan, Lowside, Madhouse, Metal Church, Moxi, Near Life Experience, Oz, Persia, Ratt Poison, Rottweiller, Savage White, Social Distortion, Stiff, Taboo, Taylor/Delatte, Velvet Poker Dogs, Veruca Salt"
      ],
      "Members": [
         "Steve Blaze",
         "Michael Darby",
         "Sam Poitevent",
         "Brent Graham",
         "Rob Hovey"
      ]
   },
   "albums": [
      "(1987-1989) Out of the Darkness - Into the Light"
   ]
}