{
   "Name": "Meshuggah",
   "Sections": [
      "1 History",
      "1.1 Formation and Contradictions Collapse (1987–1994)",
      "1.2 Destroy Erase Improve (1995–1997)",
      "1.3 Chaosphere and Nothing (1998–2002)",
      "1.4 I and Catch Thirtythree (2003–2006)",
      "1.5 obZen and Koloss (2007–2013)",
      "1.6 Pitch Black and The Violent Sleep of Reason (2013–present)",
      "2 Musical style",
      "2.1 Contradictions Collapse, Destroy Erase Improve and Chaosphere",
      "2.2 Nothing, I and Catch Thirtythree",
      "2.3 obZen and Koloss",
      "2.4 The Violent Sleep of Reason",
      "3 Reception",
      "4 Songwriting, recording, and lyrics",
      "5 Members",
      "5.1 Current",
      "5.2 Former",
      "5.3 Touring",
      "5.4 Timeline",
      "6 Awards and nominations",
      "7 Discography",
      "8 Notes and references",
      "8.1 Notes",
      "8.2 References",
      "9 External links",
      "9.1 Official",
      "9.2 Videos"
   ],
   "Summary": {
      "text": [
         "Meshuggah (/məˈʃʊɡə/)[1] Is a Swedish extreme metal band formed in Umeå in 1987. Meshuggah's current lineup consists of founding members lead vocalist Jens Kidman and lead guitarist Fredrik Thordendal, drummer Tomas Haake since 1990, rhythm guitarist Mårten Hagström since 1993 and bassist Dick Lövgren since 2004. Since its formation, the band has released eight studio albums, six EPs and eight music videos. Their latest studio album, The Violent Sleep of Reason, was released on 7 October 2016.\n",
         "Meshuggah has become known for their innovative musical style and their complex, polymetered song structures and polyrhythms. They rose to fame as a significant act in extreme underground music, became an influence for modern metal bands, and gained a cult following. The band was labelled as one of the ten most important hard rock and heavy metal bands by Rolling Stone and as the most important band in metal by Alternative Press. In the late 2000s, the band was an inspiration for the djent subgenre.\n",
         "In 2006 and 2009, Meshuggah was nominated for a Swedish Grammis Award for their albums Catch Thirtythree and obZen, respectively. In 2018, the band was nominated for a Grammy Award for their song \"Clockworks\" under the \"Best Metal Performance\" category.[2] The band has performed in various international festivals, including Ozzfest and Download, and embarked on the obZen world tour from 2008 to 2010, and also the \"Ophidian Trek\".\n"
      ]
   },
   "History": {
      "Formation and Contradictions Collapse (1987–1994)": {
         "text": [
            "In 1985, guitarist Fredrik Thordendal formed a band in Umeå,[3] a university town in northern Sweden with a population of 105,000.[4] The band, originally named Metallien, recorded a number of demo tapes, after which it disbanded. Thordendal, however, continued playing under a different name with new band members.[3]\n",
            "Meshuggah was formed in 1987[5][6] by lead vocalist and rhythm guitarist Jens Kidman,[3] and took the name Meshuggah from the Yiddish word for \"crazy\"[7] (ultimately derived from the Hebrew word מְשׁוּגָע‎). Kidman found the word in an American street slang dictionary.[8] The band recorded several demos before Kidman left, which prompted the remaining members to disband. Kidman then formed a new band, Calipash, with guitarist Thordendal, bassist Peter Nordin and drummer Niklas Lundgren.[3] Kidman, who also played guitar,[5] and Thordendal decided to restore the name Meshuggah for the new band.[3]\n",
            "On February 3, 1989, Meshuggah released the self-titled, three-song EP Meshuggah,[3] which is commonly known as Psykisk Testbild[9][10] (a title that could be translated as \"Psychological Test-Picture\").[5] This 12\" (30 cm) vinyl EP had only 1,000 copies released, sold by local record store Garageland.[9][10] The EP's back cover features the band members with cheese doodles on their faces.[10]\n",
            "After replacing drummer Niklas Lundgren with Tomas Haake in 1990, Meshuggah signed a contract with German heavy metal record label Nuclear Blast and recorded its debut full-length album, Contradictions Collapse.[11] The LP, originally entitled (All this because of) Greed,[12] was released on January 1, 1991.[3][13] The album received positive reviews, but was not a commercial success.[9] Soon after, Kidman decided to concentrate on vocals,[4] and rhythm guitarist Mårten Hagström,[3] who had already played in a band with Haake when they were in sixth grade, was recruited.[5] The new lineup recorded the EP None at Tonteknik Recordings in Umeå in 1994 for release later that year.[14][15] A Japanese version was also released, including lyrics printed in Japanese.[16]\n",
            "During this period, Thordendal, who was working as a carpenter, severed the tip of his left middle finger, while Haake injured his hand in a router accident.[3][14] As a result, the band was unable to perform for several months. Thordendal's fingertip was later reattached, and he went on to make a full recovery.[5] The Selfcaged EP was recorded in April and May 1994, but its release was delayed to later in 1995 due to the accidents.[3][5]\n"
         ]
      },
      "Destroy Erase Improve (1995–1997)": {
         "text": [
            "In January 1995, Meshuggah undertook a short European tour organized by its record label Nuclear Blast. Afterwards, the band returned to the studio in February of that year to record the album Destroy Erase Improve[5] at Soundfront Studios in Uppsala, with Daniel Bergstrand as a producer.[9] Shortly thereafter, the band went on a European tour supporting Machine Head for two months.[5] During the tour, Nordin became ill and experienced difficulties with his inner ear balance. Due to the resulting chronic dizziness and vertigo, Nordin was forced to leave the tour and travel to Sweden. Machine Head's bassist Adam Duce offered to cover his absence; however, Meshuggah decided to continue as a four-piece. Sometimes Thordendal played bass, while other times the band performed with two guitars. In this lineup, Hagström would use a pitch shifter to play his guitar at an octave lower than usual.[14]\n",
            "Destroy Erase Improve was released in May 1995, with positive response from critics for the \"heady tempos and abstract approach\".[3][17] Kidman described the album cover: \"The title fits the pictures we cut out and stole from reference books in the library.\"[18]\n",
            "In mid-1995, Meshuggah had a short tour with Swedish band Clawfinger in Scandinavia and Germany. Nordin had to leave the band because of his sickness and was replaced by bassist Gustaf Hielm during the tour.[9][19] In late 1995, Meshuggah went on a month-long tour with Hypocrisy.[9]\n",
            "During 1996 and 1997, Thordendal worked on his solo album Sol Niger Within, which was released in March 1997 in Scandinavia and in April in Japan. He also hosted Mats/Morgan Band's debut. In 1997, Meshuggah recorded an unreleased demo, toured occasionally, and played a few concerts in its hometown. In May, Meshuggah moved to Stockholm to be closer to its management and the record industry in general.[14]\n",
            "The EP The True Human Design was recorded and released in late 1997. It contained one new song entitled \"Sane\", and one live and two alternate versions of Destroy Erase Improve's opening track \"Future Breed Machine\".[14][20] Thordendal's solo album Sol Niger Within was simultaneously released in the United States, and Meshuggah started to plan its next album at the end of the year.[5]\n"
         ]
      },
      "Chaosphere and Nothing (1998–2002)": {
         "text": [
            "Hielm officially joined the band in January 1998 after more than two years as a session member. Nuclear Blast re-released Contradictions Collapse with the addition of songs from the None EP. In May 1998, the title of the next album, Chaosphere, was reported and recording was done throughout May and June. Immediately after recording the album, Meshuggah went on a short US tour, and the album was released later in November 1998. Chaosphere's sound is an almost complete departure from the thrash metal style of the band's previous releases. Shortly after the release, Meshuggah toured Scandinavia with Entombed.[14]\n",
            "In early 1999, Meshuggah joined Slayer on their U.S. tour.[4][9] After the new album and the live performances, Meshuggah was beginning to be recognized by mainstream music, guitar, drum and metal magazines.[11] In mid-1999, Meshuggah performed in several Swedish concerts. The band started to write some new material but reported in mid-2000 that \"songwriting isn't that dramatic, but we're getting there slowly\".[5] While fans were waiting for the next album, a collection of demos (from the Psykisk Testbild EP), remixes and unreleased songs from the Chaosphere sessions were released as the Rare Trax album.[3][5][21] Hielm left the band in July 2001 for unclear reasons.[14] Meshuggah joined Tool on a lengthy tour, playing for more than 100,000 people total.[4][22]\n",
            "In March 2002, Meshuggah recorded three-track demos with programmed drums in their home studio, which were based on Haake's sample Drumkit from Hell. The upcoming album was recorded in five to six weeks in May[5] and was produced by the band at Dug-Out Studios in Uppsala and at its home studio in Stockholm.[23] The last-minute decision to join 2002's Ozzfest tour forced the band to mix the album in two days and master it in one.[24] Meshuggah immediately went on another US tour after finishing the recording.[5][23]\n",
            "The album Nothing was released in August 2002,[25] selling 6,525 copies during its first week in the US and reaching No. 165 on the Billboard 200.[9][26] With this album, Meshuggah became the first band in the history of Nuclear Blast Records to crack the Billboard 200 and also became the first band signed to Nuclear Blast to be reviewed in Rolling Stone magazine.[27] Meshuggah's previous two releases, 1998's Chaosphere and 1995's Destroy Erase Improve, have sold 38,773 and 30,712 copies to that date, respectively.[26] The CD booklet of Nothing has no liner notes, lyrics, or credits, only a hint of one word: ingenting, which is Swedish for nothing. All of this information is available on the CD-ROM.[28][29] At the end of 2002, the band went on another US tour with Tool[5][30] and a headlining tour of its own.[31]\n"
         ]
      },
      "I and Catch Thirtythree (2003–2006)": {
         "text": [
            "In 2003, Hagström hinted at the direction of the band's next album by saying, \"There's only one thing I really feel that is important. We've never measured our success in terms of sales, because we're quite an extreme band. It's more that people understand where we're coming from. I get more out of a fan coming up and saying that we've totally changed their way of looking on metal music, than having like 200 kids buy it. I mean, it would be nice for the money, but that's not why we're in it. So what I'd like to see is that we keep progressing. Keeping the core of what Meshuggah has always been, but exploring the bar, so to speak. Destroy Erase Improve was like exploring the dynamics of the band, Chaosphere was exploring the aggressiveness, the all-out side, and Nothing is more of a sinister, dark, pretty slow album, actually. So honestly, now I don't know where we're going. It might be a mix of all of them.\"[32]\n",
            "In February 2004, bassist Dick Lövgren joined Meshuggah.[9][33] The band then recorded and released the I EP, which contains a single, 21-minute track, released on Fractured Transmitter Records.[34] Meshuggah spent about six months in total on recording the EP.[35] Catch Thirtythree, the only Meshuggah album on which programmed drums have been used, was released the following year in May 2005.[36] Seven thousand copies of Catch Thirtythree were sold the first week, and it debuted at No. 170 on the Billboard 200 chart in June 2005.[37] The video for the track \"Shed\" was released in June, and the previous album Nothing sold approximately 80,000 copies in the United States to that date, according to Nielsen SoundScan.[38] Catch Thirtythree earned the band a Swedish Grammy nomination.[39] In October 2005, German band Rammstein released a single of their song \"Benzin\" with a remixed version by Meshuggah.[40]\n",
            "In December 2005, 10 years after signing its first record deal with the publishing company Warner/Chappell Music Scandinavia, Meshuggah extended its cooperation with the company.[39] In November 2005, Haake said in an interview that the band was not content with the productions of Chaosphere and Nothing, because, being on tour, they had little time to devote to them.[41][42]\n",
            "A remixed and remastered version of Nothing with rerecorded guitars was released in a custom-shaped slipcase featuring a three-dimensional hologram card on October 31, 2006, via Nuclear Blast Records. The release also includes a bonus DVD featuring the band's appearance at the Download 2005 festival and the official music videos of \"Rational Gaze\", \"Shed\" and \"New Millennium Cyanide Christ\".[42][43]\n"
         ]
      },
      "obZen and Koloss (2007–2013)": {
         "text": [
            "Meshuggah returned to the studio in March 2007 to record obZen, with recording concluding in October 2007, and the album being released in March 2008.[3] The band spent almost a year on the album, its longest recording session yet. A significant portion of the year was spent learning to perform the songs they wrote; the recording itself took six months.[6] obZen reached No. 59 on the Billboard 200 chart, selling 11,400 U.S. copies in its first week of release and 50,000 copies after six months.[44][45] With obZen, Meshuggah received more media attention and attracted new fans.[19][46] The release was followed by a world tour, which started in the U.S. and proceeded to Europe, Asia and Australia.[3]\n",
            "In May 2008, Meshuggah published a music video for the song \"Bleed\", which was produced by Ian McFarland and was written, directed and edited by Mike Pecci and Ian McFarland. Killswitch Productions said: \"It's extremely cool to work with a band who is willing to allow the music and imagery to speak for itself and who does not insist on themselves being the prominent focus of the video.\"[37][47]\n",
            "In January 2009, obZen was nominated for the Swedish Grammis award in the \"Best Hard Rock\" category.[48] In February 2009, Haake announced that the band was planning a concert DVD and a studio album.[49] In April, Meshuggah was forced to cancel its Scandinavian shows in early 2009, due to Haake's herniated disc in his lower back, which was causing problems with his right foot when playing.[50] Haake later underwent a surgery and recovered for European summer festivals.[51]\n",
            "The concert DVD entitled Alive was released on February 5, 2010 in Europe and February 9 in North America.[52][53] Thordendal started to work on a second solo album in June 2010 with the Belgian drummer Dirk Verbeuren.[54][55]\n",
            "The seventh studio album, Koloss, was released on March 23, 2012 in Germany, on March 26 in the rest of Europe, and March 27 in North America.[56] Koloss reached No. 17 on the Billboard Top 200, and sold 18,342 copies in its first week.[57] In Sweden, it reached No. 12.[58]\n"
         ]
      },
      "Pitch Black and The Violent Sleep of Reason (2013–present)": {
         "text": [
            "On February 5, 2013, Meshuggah released a free two-track EP entitled Pitch Black with Scion A/V.[59] The EP features a previously unreleased track, \"Pitch Black\", that was recorded by Fredrik Thordendal in 2003 at Fear and Loathing, in Stockholm Sweden.[60] The second track is a live recording of \"Dancers to a Discordant System\" from obZen. The track was recorded at Distortion Fest in Eindhoven, Netherlands, on December 9, 2012.[60]\n",
            "On May 12, 2016, Meshuggah released a teaser video on their YouTube page and confirmed that their next studio album was to be released in late 2016. On July 28, 2016, the title was revealed to be The Violent Sleep of Reason, and was given an October 7 release date. The Violent Sleep of Reason was shortlisted by IMPALA (The Independent Music Companies Association) for the Album of the Year Award 2016, which rewards on a yearly basis the best album released on an independent European label.[61]\n",
            "On June 2, 2017, Meshuggah announced that Thordendal would take a leave from touring with the band; he will be temporarily replaced by Per Nilsson from Scar Symmetry.[62] In 2018, Meshuggah received a Grammy nomination for their song \"Clockworks\" under the \"Best Metal Performance\" category.[2]\n",
            "In a November 2019 interview, Hagström hinted that the band has begun working on a new album.[63]\n"
         ]
      }
   },
   "Musical style": {
      "Contradictions Collapse, Destroy Erase Improve and Chaosphere": {
         "text": [
            "The early work of Meshuggah, influenced mainly by Metallica, is \"simpler and more straightforward than their more recent material, but some of their more progressive elements are present in the form of time-changes and polyrhythmics, and Fredrik Thordendal's lead playing stands out\".[4][5] According to Allmusic, their debut album is a relatively immature, but original, release.[17] Double bass drums and \"angular\" riffing also defined the early work of Meshuggah.[68]\n",
            "With the groundbreaking Destroy Erase Improve, Meshuggah showed fusion of death metal, thrash metal, progressive metal.[9][17][69] Allmusic describes the style as \"weaving hardcore-style shouts amongst deceptively (and deviously) simple staccato guitar riffs and insanely precise drumming—often with all three components acting in different time signatures\".[17] Thordendal adds the melodic element with his typical lead guitar[17] and uses his \"breath controller\" device most famously on the opening track \"Future Breed Machine\".[34][70]\n",
            "Chaosphere incorporates typically fast,[34] still tempo changing death metal. Allmusic compares the genre also with grindcore fathers Napalm Death.[71][72] Rockdetector states: \"Whilst fans reveled in the maze like meanderings, critics struggled to dissect and analyze, hailing Haake's unconventional use of dual 4/4 and 23/16 rhythm, Kidman's mechanical staccato bark and Thordendal's liberal usage of avant-garde jazz\".[9]\n"
         ]
      },
      "Nothing, I and Catch Thirtythree": {
         "text": [
            "On Nothing, Meshuggah abandons the fast tempos of Chaosphere and concentrates on slow, tuned down tempos[34][73] and grooves.[24] The album was intended to be recorded using custom-made Nevborn eight-string guitars, but the prototypes were faulty so Thordendal and Hagström used detuned Ibanez seven-string guitars instead. This technique, which involved keeping the instruments untuned during the sessions, created additional problems.[74][75] When Ibanez provided Meshuggah with special eight-string guitars with two extra-low strings that worked properly after the initial release, the band re-recorded the guitar parts for Nothing and re-released it in 2006.[9][74] Hagström notes that this allowed the band to go lower sonically and to attain bass sounds on guitars.[76]\n",
            "The I EP contains a single, 21-minute song[34][65] of complex arrangements and was a hint of the forthcoming album, 2005's Catch Thirtythree.[3] The EP, which has never been played live by the band, was written and recorded during jamming sessions of Haake and Thordendal.[35] On Catch Thirtythree, Meshuggah again used eight-string guitars,[4] but utilized programmed drums for the first time also for the release,[77][78] with the exception of two songs from 2001's compilation Rare Trax.[79] The album was self-produced by the band and was recorded at the studio that Meshuggah shares with Clawfinger. Hagström notes, \"The eight-strings really have given us a whole new musical vocabulary to work with. Part of it is the restrictions they impose: you really can't play power chords with them; the sound just turns to mush. Instead, we concentrated on coming up with really unusual single-note parts, new tunings and chord voicings. We wanted to get as far away from any kind of conventions and traditions as we could on the album, so the guitars worked out beautifully.\"[4]\n",
            "Catch Thirtythree is one 47-minute song divided into 13 sections.[65] It is more mid-tempo guitar riff based, and a more straightforward and experimental full-length album than Chaosphere or Nothing.[69][80] Nick Terry of Decibel Magazine describes the album as a four-movement symphony.[81] Some songs still use Meshuggah's \"familiar template combining harsh vocals and nightmarish melodies over coarse, mechanically advancing, oddball tempos\", while others explore ambient sounds and quieter dynamics.[65] The first part of Catch Thirtythree centers around two simple riffs.[69] In the song \"In Death - Is Death\", the band uses a combination of noise and silence, which is in contrast with the atypical melodies on \"Dehumanization\". On \"Mind's Mirrors\", Meshuggah used electronics, programming and \"robotic voices\". \"Shed\" incorporates tribal percussion and whispered vocals.[65]\n"
         ]
      },
      "obZen and Koloss": {
         "text": [
            "With 2008's obZen, Meshuggah moved away from the experimentation of 2002's Nothing and 2005's Catch Thirtythree to return to the musical style of its previous albums, such as Contradictions Collapse, Destroy Erase Improve and Chaosphere,[82][83][84] while still maintaining its focus on musical and technical innovation. The album loses some of the quick, mathematical rhythmic changes of past releases and the melodic orchestration of Catch Thirty-Three[82] and uses \"angular\" riffs,[85] mid-tempo and common 4/4 beats.[73] The album is a culmination of the band's previous work.[82][86] Meshuggah decided to self-produce because it sought to retain artistic control over the recording and mixing process.[87]\n",
            "For obZen, Haake returned to the drum kit most notably with his performance on the song \"Bleed\".[82][84] In an interview for Gravemusic.com, Haake stated, \"['Bleed'] was a big effort for me to learn, I had to find a totally new approach to playing the double bass drums to be able to do that stuff. I had never really done anything like that before like the fast bursts that go all the way through the song basically. So I actually spent as much time practicing that track alone as I did with all of the other tracks combined. It's kind of a big feat to change your approach like that and I'm glad we were able to nail it for the album. For a while though we didn't even know if it was going to make it to the album.\"[37] Hagström also stated, \"obZen is one of the most highly technical offerings the band has ever put to tape\".[87] Revolver Magazine confirms this statement: \"At first listen, obZen seems less challenging to the listener than some of the band's other records, and most of the songs flow smoothly from one syncopated passage to the next. However, careful examination reveals that the material is some of the group's most complicated\".[6]\n",
            "A common quality in Koloss identified by multiple critics and outlets is the album's relatively straightforward, more groove-oriented sound, summed up by Metal Sucks as the band having \"streamlined their compositions to a great extent.\"[88] The broad style of the record has been described as \"primal\" and featuring \"less jazzy virtuosity\" than the band's previous output.[89] Pitchfork noted that the record's rawer production style advanced this \"tribal\" sound further.[90] The album invokes a greater sound of menace and \"darkness\" according to Metal Injection; additionally, Jens Kidman's vocals were described as \"exponentially more anguished\" than previous works.[91] Metal Injection further compared the sound of the Koloss's closing track \"The Last Vigil\" to works by the instrumental band Godspeed You! Black Emperor.[91] The record's guitar riffs have been noted as deviating somewhat from Meshuggah's earlier catalog, with SPIN identifying a \"an almost bluesy swing\" in the playing style.[92] SPIN further elaborated on the guitar leads, comparing the solos in \"The Demon's Name is Surveillance\" and \"Marrow\" to the (non-metal) works of experimental composer Philip Glass and jazz-guitarist Allan Holdsworth respectively.[92]\n"
         ]
      },
      "The Violent Sleep of Reason": {
         "text": [
            "For their eighth album, the band recorded live in studio, a production style they hadn't pursued in reportedly \"20, 25 years\".[93] On rejecting the computerized format of recording of their previous albums, Haake said \"Obzen and Koloss are great albums, but, to me, they are a little too perfect. It didn't really capture what we sounded like honestly. But where we recorded live, you get to hear the push and pull, one person might be a little ahead and the other might be a little behind. If you kill that, you can kill the energy.\"[93]\n"
         ]
      },
      "text": [
         "Meshuggah's experimentation, stylistic variation and changes during its career cross several musical subgenres. Heavy metal subgenres experimental metal or avant-garde metal are umbrella terms that enable description of the career of the band in general.[a] Extreme metal crosses both thrash metal and death metal (or technical death metal), which are at root of the sound of Meshuggah's music, which has also been described as groove metal.[b] The band has also been labelled as math metal and progressive metal.[c] Meshuggah also incorporates elements of experimental jazz.[3] In its review of Nothing, Allmusic describes Meshuggah as \"masterminds of cosmic calculus metal—call it Einstein metal if you want\".[25] Meshuggah's early output was also considered alternative metal.[64] Meshuggah creates a recognizable sonic imprint[65] and distinct style.[66]\n",
         "Trademarks and characteristics that define Meshuggah's sound and songwriting include polyrhythms, polymetered riff cycles, rhythmic syncopation, rapid key and tempo changes and neo-jazz chromatics.[d] Hagström notes that \"it doesn't really matter if something is hard to play or not. The thing is, what does it do to your mind when you listen to it? Where does it take you?\"[4] A trademark of Thordendal is jazz fusion-like soloing and improvisation. He is also known for the usage of a \"breath controller\" device. Haake is known for his cross-rhythm drumming with \"jazzlike cadence\".[e] The vocal style of Jens Kidman varies between hardcore-style shouts[17] and \"robotic\" death metal vocals.[25][67]\n",
         "In polymeters typically used by Meshuggah, the guitars might play in odd meters such as 5/16 or 17/16, while drums play in 4/4.[24] One particular example of Haake's use of polymeter is 4/4 against 23/16 bimeter, in which he keeps the hi-hat and ride cymbal in 4/4 time but uses the snare and double bass drums in 23/16 time.[9][34] On \"Rational Gaze\" (from Nothing), Haake plays simple 4/4 time, hitting the snare on each third beat, for 16 bars. At the same time, the guitars and bass are playing same quarter notes, albeit in a different time signature; eventually both sides meet up again at the 64th beat.[28] Hagström notes about the polymeters, \"We've never really been into the odd time signatures we get accused of using. Everything we do is based around a 4/4 core. It's just that we arrange parts differently around that center to make it seem like something else is going on.\"[4]\n"
      ]
   },
   "Reception": {
      "text": [
         "Meshuggah has become known for its innovative musical style that evolves between each release and pushes heavy metal into new territory, and for its technical prowess.[f] Hagström comments: \"We try never to repeat ourselves.\"[4] RockDetector stated about Destroy Erase Improve: \"[T]he band...stripped Metal down to the bare essentials before completely rebuilding it in a totally abstract form\".[9] The official Meshuggah biography comments on Chaosphere by noting that \"Some fans felt that Meshuggah had left their dynamic and progressive elements behind; while others thought they were only progressing naturally and focusing on their original sound.\"[5] The band's website also describes Nothing as displaying \"a very mature and convincing Meshuggah, now focusing on groove and sound...Meshuggah once again divided their fans into the 'ecstatic' and the 'slightly disappointed'\".[5] The polyrhythms can make the music sound cacophonous, like band members are playing different songs simultaneously.[28][74] Listeners perceiving a polyrhythm often either extract a composite pattern that is fitted to a metric framework, or focus on one rhythmic stream while treating others as \"noise\".[94]\n",
         "Rolling Stone labeled Meshuggah as \"one of the ten most important hard and heavy bands\",[77] and the Alternative Press named it the \"most important band in metal.\"[66] Meshuggah has been described as virtuoso or genius-bordering musicians,[g] \"recognized by mainstream music magazines, especially those dedicated to particular instruments\".[3] In 2007, Meshuggah earned an in-depth analysis by the academic journal Music Theory Spectrum.[95] Meshuggah has found little mainstream success but is a significant act in extreme underground music, an influence for modern metal bands[96] and has a cult following.[97][98] Meshuggah inspired the \"djent\" subgenre in progressive metal,[99][100][101] that describes an \"elastic, syncopated guitar riff\" with its name.[102] They were described as being \"the first djent band completely by accident\".[103]\n"
      ]
   },
   "Songwriting, recording, and lyrics": {
      "text": [
         "Meshuggah's music is written by Thordendal, Hagström and Haake with assistance from Kidman and Lövgren. During songwriting, a member programs the drums, and records the guitar and bass via computer. He presents his idea to the other members as a finished work. Meshuggah typically adheres to the original idea and rarely changes the song afterwards.[104] Hagström explains that each member has an idea of what the others are doing conceptually, and nobody thinks exclusively in terms of a particular instrument. Kidman does not play guitar in the band anymore, but he is involved in writing riffs.[4]\n",
         "Except for when Hagström needs a soloist, he and Thordendal rarely record together. Both play guitar and bass while composing. Haake says about his songwriting, \"Sometimes I'll sample guitar parts, cut them up, pitch-shift and tweak them until I've built the riffs I want, just for demoing purposes. But most of the time I'll just present the drums, and explain my ideas for the rest of the song, sing some riffs.\"[83] The band uses Cubase to record the tracks, and the guitars are routed through software amplifier modeling, because it allows them to change the amp settings even after the song was fully recorded.[105]\n",
         "Approximately once a year, Haake writes most of the band's lyrics, with the exception of finished tracks. His lyrical inspirations are derived from books and films. Aside from their album Catch Thirtythree, Meshuggah does not usually record concept albums, although the band prefers strong conceptual underpinnings in the background.[4][35][74][83]\n",
         "Often esoteric[3] and conceptual,[23] Meshuggah's lyrics explore themes such as existentialism.[25] Allmusic describes Destroy Erase Improve's lyrical focus as \"the integration of machines with organisms as humanity's next logical evolutionary step\".[17] PopMatters' review of Nothing singles out the lyrics from \"Rational Gaze\": \"Our light-induced image of truth—filtered blank of its substance / As our eyes won't adhere to intuitive lines / Everything examined. Separated, one thing at a time / The harder we stare the more complete the disintegration.\"[74] Haake explains that Catch Thirtythree's cover, title and lyrics deal with \"the paradoxes/negations/contradictions of life and death (as we see it in our finest moments of unrestrained metaphoric interpretation)\".[106]\n",
         "The main theme of obZen is \"human evil\", according to Haake. The title is a play on the words \"obscene\" and \"Zen\"; in addition, \"ob\" means \"anti\" in Latin. Therefore, the title suggests that the human species has found harmony and balance in warfare and bloodshed.[83][107] Revolver Magazine finds the lyrics of the title track from obZen representative of the entire album: \"Salvation found in vomit and blood/Where depravation, lies, corruption/War and pain is god.\" However, Haake claims, \"We don't dwell on hate and bad feelings as people. But with these songs, I think we really wanted to paint a picture lyrically that might be seen as a cautionary tale. We're going, 'Heads up. Here's what some of the parts of being human are about, and this is what we can be at our worst.' So it's more about being aware of negative feelings than actually living them all the time.\"[6]\n"
      ]
   },
   "Members": {
      "Current": {
         "text": [
            "\n"
         ]
      },
      "Former": {
         "text": [
            "\n"
         ]
      },
      "Touring": {},
      "Timeline": {}
   },
   "Awards and nominations": {
      "text": [
         "Loudwire Music Awards\n\n",
         "Metal Hammer Golden Gods Awards\n\n",
         "Revolver Golden Gods Awards\n\n",
         "Decibel Magazine\n\n",
         "IMPALA\n\n",
         "Grammy Awards\n\n"
      ]
   },
   "Discography": {},
   "Notes and references": {
      "Notes": {},
      "References": {}
   },
   "External links": {
      "Official": {},
      "Videos": {}
   },
   "coreData": [
      "Meshuggah (/məˈʃʊɡə/)[1] Is a Swedish extreme metal band formed in Umeå in 1987. Meshuggah's current lineup consists of founding members lead vocalist Jens Kidman and lead guitarist Fredrik Thordendal, drummer Tomas Haake since 1990, rhythm guitarist Mårten Hagström since 1993 and bassist Dick Lövgren since 2004. Since its formation, the band has released eight studio albums, six EPs and eight music videos. Their latest studio album, The Violent Sleep of Reason, was released on 7 October 2016.\n",
      "Meshuggah has become known for their innovative musical style and their complex, polymetered song structures and polyrhythms. They rose to fame as a significant act in extreme underground music, became an influence for modern metal bands, and gained a cult following. The band was labelled as one of the ten most important hard rock and heavy metal bands by Rolling Stone and as the most important band in metal by Alternative Press. In the late 2000s, the band was an inspiration for the djent subgenre.\n",
      "In 2006 and 2009, Meshuggah was nominated for a Swedish Grammis Award for their albums Catch Thirtythree and obZen, respectively. In 2018, the band was nominated for a Grammy Award for their song \"Clockworks\" under the \"Best Metal Performance\" category.[2] The band has performed in various international festivals, including Ozzfest and Download, and embarked on the obZen world tour from 2008 to 2010, and also the \"Ophidian Trek\".\n",
      "In 1985, guitarist Fredrik Thordendal formed a band in Umeå,[3] a university town in northern Sweden with a population of 105,000.[4] The band, originally named Metallien, recorded a number of demo tapes, after which it disbanded. Thordendal, however, continued playing under a different name with new band members.[3]\n"
   ],
   "infobox": {
      "Origin": [
         "Umeå, Sweden"
      ],
      "Genres": [
         "Extreme metal",
         "progressive metal",
         "avant-garde metal",
         "groove metal"
      ],
      "Years active": [
         "1987–present"
      ],
      "Labels": [
         "Nuclear Blast",
         "Fractured Transmitter"
      ],
      "Website": [
         "www.meshuggah.net"
      ],
      "Members": [
         "Jens Kidman",
         "Fredrik Thordendal",
         "Tomas Haake",
         "Mårten Hagström",
         "Dick Lövgren"
      ],
      "Past members": [
         "Niklas Lundgren",
         "Peter Nordin",
         "Gustaf Hielm",
         "Johan Sjögren",
         "Per Sjögren"
      ]
   }
}