{
   "Name": "Moonsorrow",
   "rawData": [
      "Moonsorrow is a Finnish pagan metal band formed in Helsinki in 1995. Musically, the band incorporates elements of black metal and folk metal in their sound.  The band call their sound \"epic heathen metal\" and try to distance themselves from the term \"Viking metal\". They have distanced themselves from other folk metal bands, emphasising that their music is pagan and spiritual and is challenging for its listeners, rather than happy or danceable. The band members have varying levels of pagan belief but they draw on pagan spirituality for lyrics and inspiration.\n",
      "The group's earliest formation consisted of cousins Ville Sorvali (vocals and bass) and Henri Sorvali (guitar and keyboards; also keyboards for Finntroll, Barathrum, and session member of Ensiferum) who released various demos that were much more characteristic of melodic black metal than future releases.\n",
      "Their debut album, Suden Uni, recorded in early 2000, was released in early 2001, along with Tämä Ikuinen Talvi (\"This Everlasting Winter\"), a re-release of a 1999 demo. Suden Uni (\"A Wolf's Dream\") combined Finnish paganism and folk elements. After recruiting Mitja Harvilahti and Markus Eurén, Moonsorrow started playing live, releasing Voimasta Ja Kunniasta (\"Of Strength and Honour\") in late 2001. It was followed by their 2003 release, Kivenkantaja (\"Stonebearer\"), and Verisäkeet (\"Blood Verses\") in 2005. The album is also their first to use ambient sounds such as birdsong and crackling fire in between tracks.\n"
   ],
   "infobox": {
      "Origin": [
         "Helsinki, Finland"
      ],
      "Genres": [
         "Folk metal, pagan metal, black metal, progressive metal"
      ],
      "Years active": [
         "1995–present"
      ],
      "Labels": [
         "Sagittarius Productions, Plasmatica Records, Spinefarm, Century Media"
      ],
      "Associated acts": [
         "Amoral, Barathrum, Finntroll, Barren Earth"
      ],
      "Website": [
         "www.moonsorrow.com"
      ],
      "Members": [
         "Ville Sorvali",
         "Henri Sorvali",
         "Mitja Harvilahti",
         "Markus Eurén",
         "Marko Tarvonen"
      ]
   },
   "albums": [
      "Suden uni",
      "Voimasta ja kunniasta",
      "Kivenkantaja",
      "Verisäkeet",
      "Viides luku – Hävitetty",
      "Varjoina kuljemme kuolleiden maassa",
      "Jumalten aika"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band formed in Helsinki in [YEAR]. Musically, the band incorporates elements of black metal and folk metal in their sound.  The band call their sound [SONG_NAME]. They have distanced themselves from other folk metal bands, emphasising that their music is pagan and spiritual and is challenging for its listeners, rather than happy or danceable. The band members have varying levels of pagan belief but they draw on pagan spirituality for lyrics and inspiration.\n",
      "The group's earliest formation consisted of cousins [PERSON_NAME_FIRST_1] [PERSON_NAME_LAST_0] (vocals and bass) and [PERSON_NAME_FULL_0_MALE] (guitar and keyboards; also keyboards for Finntroll, Barathrum, and session member of Ensiferum) who released various demos that were much more characteristic of melodic black metal than future releases.\n",
      "Their debut album, Suden Uni, recorded in early [YEAR], was released in early [YEAR], along with Tämä Ikuinen Talvi ([SONG_NAME]) in [YEAR]. The album is also their first to use ambient sounds such as birdsong and crackling fire in between tracks.\n"
   ]
}