{
   "Name": "Nails (band)",
   "rawData": [
      "Nails is an American hardcore punk band from Oxnard, California. The group was formed in 2009 by frontman Todd Jones, formerly the guitarist of Terror, along with bassist John Gianelli and drummer Taylor Young of Disgrace. They released their debut EP Obscene Humanity in 2009, followed by the studio albums Unsilent Death (2010), Abandon All Life (2013) and You Will Never Be One of Us (2016), and a split EP with Full of Hell. Gradually, Nails have achieved widespread critical acclaim for their savage, death metal-infused sound.\n",
      "The band formed in 2009. They have since released three full-length albums and two EPs. As of June 2014, the band is signed to Nuclear Blast. They released their third album, You Will Never Be One of Us, on June 17, 2016.\n",
      "On July 25, 2016, the band abruptly cancelled a European tour, with promoters claiming the band were on a hiatus and \"had no plans to play live or record again.\" This also led to cancelling their appearance at Ozzfest Meets Knotfest. Todd Jones later stated that the band had never taken a hiatus. In December 2016, the band returned by playing at The Power of the Riff festival and releasing a split 7\" with Full of Hell.\n"
   ],
   "infobox": {
      "Origin": [
         "Oxnard, California, U.S."
      ],
      "Genres": [
         "Powerviolence",
         "grindcore",
         "hardcore punk",
         "crust punk[1]",
         "D-beat",
         "death metal"
      ],
      "Years active": [
         "2009 (2009)–present"
      ],
      "Labels": [
         "Southern Lord",
         "Six Feet Under",
         "Streetcleaner",
         "Nuclear Blast"
      ],
      "Associated acts": [
         "Terror",
         "Blacklisted",
         "Impaled",
         "Harm's Way",
         "Twitching Tongues",
         "Disgrace"
      ],
      "Website": [
         "abandonalllife.com"
      ],
      "Members": [
         "Todd Jones"
      ],
      "Past members": [
         "John Gianelli",
         "Taylor Young",
         "Andrew Saba",
         "Tom Hogan",
         "Phil Sgrosso",
         "Leon del Muerte"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Oxnard, California. The group was formed in [YEAR] by frontman Todd Jones, formerly the guitarist of Terror, along with bassist [PERSON_NAME_FULL_0_MALE] and drummer Taylor Young of Disgrace. They released their debut EP Obscene Humanity in [YEAR], followed by the studio albums Unsilent Death ([YEAR]), Abandon All Life ([YEAR]) and You Will Never Be One of Us ([YEAR]), and a split EP with Full of Hell. Gradually, [BAND_NAME] have achieved widespread critical acclaim for their savage, death metal-infused sound.\n",
      "The band formed in [YEAR]. They have since released three full-length albums and two EPs. As of [MONTH] [YEAR], the band is signed to Nuclear Blast. They released their third album, You Will Never Be One of Us, on [MONTH] 17, [YEAR].\n",
      "On [MONTH] 25, [YEAR], the band abruptly cancelled a [GENRE] band were on a hiatus and \"had no plans to play live or record again.\" This also led to cancelling their appearance at Ozzfest Meets Knotfest. Todd Jones later stated that the band had never taken a hiatus. In [MONTH] [YEAR], the band returned by playing at The Power of the Riff festival and releasing a split 7\" with Full of Hell.\n"
   ]
}