{
   "Name": "Orphaned Land",
   "Sections": [
      "1 History",
      "2 Band members",
      "2.1 Timeline",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Demos",
      "3.3 EPs",
      "3.4 Live albums",
      "3.5 Other albums",
      "3.6 Music videos",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Orphaned Land is an Israeli heavy metal band, formed in 1991 under the name Resurrection (changing their name in 1992 to the current name), that combines Israeli Jewish, Mizrahi, and other West Asian influences. They are considered 'The pioneers of Oriental Metal'[by whom?]. The band has gone through several lineup changes over the years, but has retained two of the founding members, Kobi Farhi (vocals) and Uri Zelcha (bass).  They are joined by Matan Shmuely (drums), Chen Balbus (guitar/keyboard) who replaced co-founding member Matti Svatizky in 2012, and Idan Amsalem (guitars/bouzouki) who replaced co-founding member Yossi Sassi in early 2014. Their lyrics promote a message of peace and unity, particularly between the three main Abrahamic religions (Judaism, Islam, and Christianity).\n"
      ]
   },
   "History": {
      "text": [
         "In 1992, the band changed its name from the original Resurrection[1] to Orphaned Land.\nOrphaned Land fuse progressive, doom, and death metal as well as Middle-Eastern folk music and Arabic traditions in a form of Oriental metal. Each album has some concept related to two extremes: a meeting of East and West, past and present, light and darkness, and God and Satan.[2]\n",
         "The band’s first album was Sahara (1994) which was originally released as a demo. The second album, El Norra Alila (1996), had many Eastern/Oriental influences, such as \"El Norra Alila\" (\"Illustrious God\"), based on a poem sung during Yom Kippur as a plea of forgiveness. It also included songs with traditional oriental Jewish piyyut and Arabic melodies. The album explored the themes of light and darkness, as well as conveying the message of commonality between the three main Abrahamic religions (Judaism, Islam, and Christianity).[3]\n",
         "The third album, Mabool: The Story of the Three Sons of Seven (the Hebrew name for the Deluge, depicted in the Bible and Noah's story), released in 2004, was seven years in the making. It tells the story of three sons (one for each Abrahamic religion) who try to warn humanity of a flood coming as punishment for their sins. Musically, the album contains oriental instruments, two choruses, traditional Yemenite chants sung by Shlomit Levi, and quotes of biblical verses from the story of the deluge, read by vocalist Kobi Farhi. After Mabool, Orphaned Land released an EP, Ararat (2005) named after Mount Ararat. Despite their songs drawing on biblical themes, the band have said that they are not religious, with the majority of the band members identifying as atheist or agnostic.[4][5][6]\n",
         "On January, 2010, Orphaned Land released the follow-up to Mabool, entitled The Never Ending Way of ORWarriOR. ORWarriOR means \"Warrior of Light\", and the concept is the battle between light and darkness. The album has a different sound than Mabool, and was mixed by Steven Wilson of Porcupine Tree.[7] The first single from the CD was titled \"Sapari\" and was put on Myspace with two other tracks, \"Vayehi OR\" and \"Disciples of the Sacred Oath II\". In early 2011, ORWarriOR was rated the Metal Storm number one progressive metal album of 2010 by users with 421/1130 total votes.[8]\n",
         "In 2008, Orphaned Land was featured in the documentary Global Metal, a film by the creators of Metal: A Headbanger's Journey.[9]\n",
         "On May 22, 2010, Orphaned Land performed as the opening act to Metallica's show in Israel. Following this, the band went on a festival tour in the summer of 2010, promoting their latest album, The Never Ending Way of ORWarriOR, with appearances at such festivals as Wacken Open Air, Summer Breeze Open Air, Sonisphere Festival, Gods of Metal, Rock Hard Festival and more. After the summer festival tour, the band will go on a North American tour in support of Katatonia, along with Swallow the Sun. This will be followed by a tour of Europe supporting Amorphis along with Ghost Brigade.\n",
         "They performed on June 19, 2011, at the French Metal Festival Hellfest held in Clisson, near Nantes. In February 2011, they performed at the Riviera cultural festival at VIT University, Vellore, India. And in February 2012, they performed at the festival Alcheringa at Indian Institute of Technology Guwahati (IIT), India.\n",
         "On June 11, 2012, guitarist Matty Svatitzky announced his departure from the band, due to personal issues. Matti Svatitzky was replaced by Chen Balbus, a young musician who was a replacement guitar player for some live shows, before he became an official member. Chen instantly became an integral part of the composing, writing, producing and recording of the new album, \"All Is One.\"[citation needed]\n",
         "In 2012 there was an online petition for Orphaned Land to be awarded a Nobel Prize for their commitment to allowing the Arab World to listen to their music despite bans on such a thing from Arab League countries.[10]\n",
         "Orphaned Land's fifth album, entitled All is One, was released on June 21, 2013, and worldwide on the 25th. The previous vocalist, Shlomit Levy did not perform on this album, so female vocals were performed instead by Mira Awad. Despite its optimistic title, the band considers it their darkest album thematically, albeit musically their most accessible, being nearly devoid of death metal influence.\n",
         "On January 7, 2014, Orphaned Land announced on their Facebook page that it had parted ways with guitarist and co-founding member Yossi Sassi.[11] He was replaced by guitarist and musical producer Idan Amsalem.\n",
         "Orphaned Land recently won Metal Hammer award for \"Global Metal Band of the Year 2014\".[12] The band also released a new music video for the track \"Let the Truce Be Known\" which is directed by Vadim Machona.[13]\n",
         "In 2017, Genesis guitarist Steve Hackett called Kobi Farhi. He was looking for artists that work for peace between people, and unsurprisingly, he chose Orphaned Land. The two sides immediately clicked and started collaborating. Together with the highly acclaimed Israeli-Arab singer, Mira Awad, Farhi sings on Hackett’s album, “The Night Siren” and on the song, “West to East”. Later on, Hackett continued to work with Orphaned Land and recorded a guitar solo for the band’s new album,[14] which was released on January 26, 2018, entitled Unsung Prophets & Dead Messiahs.[15] In September 2018, Orphaned Land won the 'Video Of The Year’ award At the Progressive Music Awards 2018 in London, for their video, “Like Orpheus\".[16]\n"
      ]
   },
   "Band members": {
      "Timeline": {},
      "text": [
         "Current members\n",
         "\n",
         "Former members\n",
         "\n",
         "Former touring members\n",
         "\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Demos": {},
      "EPs": {},
      "Live albums": {},
      "Other albums": {},
      "Music videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Orphaned Land is an Israeli heavy metal band, formed in 1991 under the name Resurrection (changing their name in 1992 to the current name), that combines Israeli Jewish, Mizrahi, and other West Asian influences. They are considered 'The pioneers of Oriental Metal'[by whom?]. The band has gone through several lineup changes over the years, but has retained two of the founding members, Kobi Farhi (vocals) and Uri Zelcha (bass).  They are joined by Matan Shmuely (drums), Chen Balbus (guitar/keyboard) who replaced co-founding member Matti Svatizky in 2012, and Idan Amsalem (guitars/bouzouki) who replaced co-founding member Yossi Sassi in early 2014. Their lyrics promote a message of peace and unity, particularly between the three main Abrahamic religions (Judaism, Islam, and Christianity).\n",
      "In 1992, the band changed its name from the original Resurrection[1] to Orphaned Land.\nOrphaned Land fuse progressive, doom, and death metal as well as Middle-Eastern folk music and Arabic traditions in a form of Oriental metal. Each album has some concept related to two extremes: a meeting of East and West, past and present, light and darkness, and God and Satan.[2]\n",
      "The band’s first album was Sahara (1994) which was originally released as a demo. The second album, El Norra Alila (1996), had many Eastern/Oriental influences, such as \"El Norra Alila\" (\"Illustrious God\"), based on a poem sung during Yom Kippur as a plea of forgiveness. It also included songs with traditional oriental Jewish piyyut and Arabic melodies. The album explored the themes of light and darkness, as well as conveying the message of commonality between the three main Abrahamic religions (Judaism, Islam, and Christianity).[3]\n",
      "The third album, Mabool: The Story of the Three Sons of Seven (the Hebrew name for the Deluge, depicted in the Bible and Noah's story), released in 2004, was seven years in the making. It tells the story of three sons (one for each Abrahamic religion) who try to warn humanity of a flood coming as punishment for their sins. Musically, the album contains oriental instruments, two choruses, traditional Yemenite chants sung by Shlomit Levi, and quotes of biblical verses from the story of the deluge, read by vocalist Kobi Farhi. After Mabool, Orphaned Land released an EP, Ararat (2005) named after Mount Ararat. Despite their songs drawing on biblical themes, the band have said that they are not religious, with the majority of the band members identifying as atheist or agnostic.[4][5][6]\n"
   ],
   "infobox": {
      "Also known as": [
         "Resurrection (1991–1992)"
      ],
      "Origin": [
         "Petah Tikva/Bat Yam, Israel"
      ],
      "Genres": [
         "Folk metal",
         "alternative metal",
         "technical death metal",
         "death-doom"
      ],
      "Years active": [
         "1991–1997, 2001–present"
      ],
      "Labels": [
         "Century Media"
      ],
      "Associated acts": [
         "Mahavatar, Distorted, Porcupine Tree, Subterranean Masquerade"
      ],
      "Website": [
         "Orphaned-land.com"
      ],
      "Members": [
         "Kobi Farhi",
         "Uri Zelcha",
         "Matan Shmuely",
         "Chen Balbus",
         "Idan Amsalem"
      ],
      "Past members": [
         "Matti Svatizky",
         "Sami Bachar",
         "Itzik Levy",
         "Eran Asias",
         "Eden Rabin",
         "Avi Diamond",
         "Yatziv Caspi",
         "Adee Silva",
         "Yossi Sa'aron Sassi"
      ]
   }
}