{
   "Name": "Deafheaven",
   "rawData": [
      "Deafheaven is an American post-metal band formed in 2010. Originally based in San Francisco, the group began as a two-piece with singer George Clarke and guitarist Kerry McCoy, who recorded and self-released a demo album together. Following its release, Deafheaven recruited three new members and began to tour. Before the end of 2010, the band signed to Deathwish Inc. and later released their debut album Roads to Judah, in April 2011. A follow-up album, Sunbather, was released in 2013 to wide critical acclaim, becoming one of the best reviewed albums of the year in the United States. In 2015 the band released their third album, New Bermuda, and in 2018 their fourth, Ordinary Corrupt Human Love.\n",
      "Deafheaven's musical style has been described by Rolling Stone as a \"boundary-pushing blend of black metal, shoegaze and post-rock\". McCoy has cited various other influences on the band's sound, including alternative rock and early thrash metal, and said they do not consider themselves a black metal band, because, although influenced by the genre, they do not have \"the ethos, the aesthetic or really the sound of one\". In a 2017 interview with Red Bull Music Academy Daily, McCoy stated: \"The whole shoegaze/black metal, or post-black metal thing, was being done ten years before we were a band.\"\n",
      "Deafheaven formed in February 2010 in San Francisco, California with vocalist George Clarke and guitarist Kerry McCoy, who previously performed in the grindcore band Rise of Caligula together. Clarke is not sure how he arrived on the name Deafheaven, though he is aware of its appearance in William Shakespeare's Sonnet 29. The two words 'deaf' and 'heaven' were combined as a homage to Slowdive.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Black metal[1]",
         "blackgaze[2]",
         "post-metal[3][4]",
         "screamo[5][6]"
      ],
      "Years active": [
         "2010 (2010)–present"
      ],
      "Labels": [
         "Deathwish",
         "ANTI-"
      ],
      "Associated acts": [
         "Creepers",
         "Rise of Caligula",
         "Whirr",
         "Nothing",
         "Lycus",
         "Marty Friedman",
         "Baroness"
      ],
      "Website": [
         "deafheaven.com"
      ],
      "Members": [
         "George Clarke",
         "Kerry McCoy",
         "Daniel Tracy",
         "Shiv Mehra",
         "Chris Johnson"
      ],
      "Past members": [
         "Nick Bassett",
         "Trevor Deschryver",
         "Stephen Clark",
         "Derek Prine"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in [YEAR]. Originally based in San Francisco, the group began as a two-piece with singer George Clarke and guitarist [PERSON_NAME_FULL_0_FEMALE], who recorded and self-released a demo album together. Following its release, [BAND_NAME] recruited three new members and began to tour. Before the end of [YEAR], the band signed to Deathwish Inc. and later released their debut album Roads to Judah, in [MONTH] [YEAR]. A follow-up album, Sunbather, was released in [YEAR] to wide critical acclaim, becoming one of the best reviewed albums of the year in the United States. In [YEAR] the band released their third album, New Bermuda, and in [YEAR] their fourth, Ordinary Corrupt Human Love.\n",
      "[BAND_NAME]'s musical style has been described by Rolling Stone as a [GENRE] band's sound, including alternative rock and early thrash metal, and said they do not consider themselves a black metal band, because, although influenced by the genre, they do not have \"the ethos, the aesthetic or really the sound of one\". In a [YEAR] interview with Red Bull Music Academy Daily, McCoy stated: \"The whole shoegaze/black metal, or post-black metal thing, was being done ten years before we were a band.\"\n",
      "[BAND_NAME] formed in [MONTH] [YEAR] in San Francisco, California with vocalist George Clarke and guitarist [PERSON_NAME_FULL_0_FEMALE], who previously performed in the grindcore band Rise of Caligula together. Clarke is not sure how he arrived on the name [BAND_NAME], though he is aware of its appearance in William Shakespeare's Sonnet 29. The two words 'deaf' and 'heaven' were combined as a [GENRE]"
   ]
}