{
   "Name": "Psychotic Waltz",
   "Sections": [
      "1 Biography",
      "2 Band members",
      "3 Discography",
      "3.1 Demos",
      "3.2 Studio albums",
      "3.3 Supplemental releases",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Psychotic Waltz is a progressive metal band formed in El Cajon, California in 1988.[1]\n"
      ]
   },
   "Biography": {
      "text": [
         "The first incarnation of the band was under the name Aslan,[2] after a character in the novel The Lion, the Witch and the Wardrobe by C. S. Lewis.  With money earned from local shows and T-shirt sales, they recorded a self-titled demo tape in 1986. The European Metal tape trading community took notice of the demo and the band received some enthusiastic reviews from fanzines and from German metal fans. After discovering another band with the same name, they changed theirs to Psychotic Waltz and recorded a new four-song demo in 1988. This new demo also found its way to the European Metal tape trading community and the band began to build their loyal European fanbase.[citation needed]\n",
         "In 1990, they debuted with their independently financed debut A Social Grace, which was released in Europe via a licensing deal with the German label Rising Sun Productions.[3]  The album was very well received in Europe, being named album of the month in some European magazines,[citation needed]  The situation in the US was more difficult, as the album was released under the band's own Sub Sonic Records label.  With practically no promotion and minimal distribution, it remained an extremely underground item.  In May of 1991, the band appeared at the Dynamo Festival in the Netherlands.\n",
         "After the tour, the band's guitarist, Dan Rock, suffered a near-fatal accident after falling 40 feet (12 m) from the underside of a bridge while rappelling.[3] The band went on to record their second album, Into the Everflow.[4]  The album was recorded from August–October, 1992, at Phoenix Studios in Herne, Germany, and was produced by Mekong Delta's main man, Ralph Hubert. The CD was released in Europe on Dream Circle Records, and was very well received, getting album of the month honors in many European magazines.[citation needed]  After Rock recovered, the band was nominated as the Best Hard Rock band at the 1992 San Diego Music Awards.[5]\n",
         "By that time, the band was at the peak of its popularity.  They signed a deal with Intercord in Europe for their third album, Mosquito.  Recording took place in late 1994 in Record Plant and Mad Hatter studios in Los Angeles, with the help of the famous metal producer Scott Burns.  The initial response for this album was mixed, as the more conventional songwriting that the band followed divided some fans who preferred their more technical approach from earlier albums. This was the last album that was recorded with their original lineup. A few months after the completion and initial release of Mosquito, original bassist Ward Evans left the band.\n",
         "They entered the studio once again in 1996, for what proved to be their last studio work together, Bleeding.  This time, Scott Burns did the engineering, but the record was mixed by Dan Rock and engineered by Woody Barber.  Before the band started touring in support for the new album, guitarist Brian McAlpin announced that he would not be able to follow the band due to familial obligations.  He was replaced by Steve Cox for the band's final two European tours.  New bass player Phil Cuttino filmed a promotional video for the track \"Faded\".  This proved to be disastrous for the band, as an actress who appeared in the video sued the band in April 1998,[6] claiming that a light on the set caused her partial blindness.\n",
         "The lengthy court battle that followed, coupled with the different musical interests that the band members had, contributed to the band's initial demise.  Buddy Lackey was the next to leave the band.  For a short while, the remaining band members tried to continue with the band, but eventually each went his own way.  Rock recorded two instrumental albums with his project Darkstar.  Norm Leggio and Steve Cox created the band Teabag, and Buddy Lackey formed the bands Deadsoul Tribe and then The Shadow Theory, where he performed under the name Devon Graves.\n",
         "Psychotic Waltz reunited with its original line-up in 2010, touring Europe in support of Nevermore and Symphony X on The Power Of Metal tour, and have played various festival shows. Century Media Records released each of the band's four albums on vinyl individually, and also created a 6–LP box set titled \"The Architects Arise: The First Ten Years\" (limited to 500 copies) which contained the four albums plus demo recordings. The band also started to write material for a fifth studio album, which would be their first release in two decades.\n",
         "In July 2019, Psychotic Waltz signed to Inside Out Music and entered the studio to record their first album in 23 years.[7] The album, The God-Shaped Void, was released on February 14, 2020.\n"
      ]
   },
   "Band members": {
      "text": [
         "Current\n",
         "Former\n"
      ]
   },
   "Discography": {
      "Demos": {},
      "Studio albums": {},
      "Supplemental releases": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Psychotic Waltz is a progressive metal band formed in El Cajon, California in 1988.[1]\n",
      "The first incarnation of the band was under the name Aslan,[2] after a character in the novel The Lion, the Witch and the Wardrobe by C. S. Lewis.  With money earned from local shows and T-shirt sales, they recorded a self-titled demo tape in 1986. The European Metal tape trading community took notice of the demo and the band received some enthusiastic reviews from fanzines and from German metal fans. After discovering another band with the same name, they changed theirs to Psychotic Waltz and recorded a new four-song demo in 1988. This new demo also found its way to the European Metal tape trading community and the band began to build their loyal European fanbase.[citation needed]\n",
      "In 1990, they debuted with their independently financed debut A Social Grace, which was released in Europe via a licensing deal with the German label Rising Sun Productions.[3]  The album was very well received in Europe, being named album of the month in some European magazines,[citation needed]  The situation in the US was more difficult, as the album was released under the band's own Sub Sonic Records label.  With practically no promotion and minimal distribution, it remained an extremely underground item.  In May of 1991, the band appeared at the Dynamo Festival in the Netherlands.\n",
      "After the tour, the band's guitarist, Dan Rock, suffered a near-fatal accident after falling 40 feet (12 m) from the underside of a bridge while rappelling.[3] The band went on to record their second album, Into the Everflow.[4]  The album was recorded from August–October, 1992, at Phoenix Studios in Herne, Germany, and was produced by Mekong Delta's main man, Ralph Hubert. The CD was released in Europe on Dream Circle Records, and was very well received, getting album of the month honors in many European magazines.[citation needed]  After Rock recovered, the band was nominated as the Best Hard Rock band at the 1992 San Diego Music Awards.[5]\n"
   ],
   "infobox": {
      "Also known as": [
         "Aslan (1985–1988)"
      ],
      "Origin": [
         "El Cajon, California, United States"
      ],
      "Genres": [
         "Progressive metal"
      ],
      "Years active": [
         "1988–1997",
         "2010–present"
      ],
      "Labels": [
         "Inside Out Music",
         "Metal Blade",
         "Rising Sun Productions",
         "Dream Circle Records",
         "Zardoz Music"
      ],
      "Associated acts": [
         "Deadsoul Tribe",
         "Darkstar",
         "Teabag"
      ],
      "Website": [
         "psychoticwaltz.com"
      ],
      "Members": [
         "Devon Graves (aka Buddy Lackey)",
         "Dan Rock",
         "Brian McAlpin",
         "Ward Evans",
         "Norman Leggio"
      ],
      "Past members": [
         "Phil Cuttino",
         "Steve Cox"
      ]
   }
}