{
   "Name": "Psychotic Waltz",
   "rawData": [
      "Psychotic Waltz is a progressive metal band formed in El Cajon, California in 1988.\n",
      "The first incarnation of the band was under the name Aslan, after a character in the novel The Lion, the Witch and the Wardrobe by C. S. Lewis.  With money earned from local shows and T-shirt sales, they recorded a self-titled demo tape in 1986. The European Metal tape trading community took notice of the demo and the band received some enthusiastic reviews from fanzines and from German metal fans. After discovering another band with the same name, they changed theirs to Psychotic Waltz and recorded a new four-song demo in 1988. This new demo also found its way to the European Metal tape trading community and the band began to build their loyal European fanbase.\n",
      "In 1990, they debuted with their independently financed debut A Social Grace, which was released in Europe via a licensing deal with the German label Rising Sun Productions.  The album was very well received in Europe, being named album of the month in some European magazines,  The situation in the US was more difficult, as the album was released under the band's own Sub Sonic Records label.  With practically no promotion and minimal distribution, it remained an extremely underground item.  In May of 1991, the band appeared at the Dynamo Festival in the Netherlands.\n"
   ],
   "infobox": {
      "Also known as": [
         "Aslan (1985–1988)"
      ],
      "Origin": [
         "El Cajon, California, United States"
      ],
      "Genres": [
         "Progressive metal"
      ],
      "Years active": [
         "1988–1997",
         "2010–present"
      ],
      "Labels": [
         "Inside Out Music",
         "Metal Blade",
         "Rising Sun Productions",
         "Dream Circle Records",
         "Zardoz Music"
      ],
      "Associated acts": [
         "Deadsoul Tribe",
         "Darkstar",
         "Teabag"
      ],
      "Website": [
         "psychoticwaltz.com"
      ],
      "Members": [
         "Devon Graves (aka Buddy Lackey)",
         "Dan Rock",
         "Brian McAlpin",
         "Ward Evans",
         "Norman Leggio"
      ],
      "Past members": [
         "Phil Cuttino",
         "Steve Cox"
      ]
   },
   "albums": [
      "Aslan",
      "Psychotic Waltz"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band formed in El Cajon, California in [YEAR].\n",
      "The first incarnation of the band was under the name Aslan, after a [GENRE] a self-titled demo tape in [YEAR]. The European Metal tape trading community took notice of the demo and the band received some enthusiastic reviews from fanzines and from German metal fans. After discovering another band with the same name, they changed theirs to [BAND_NAME] and recorded a new four-song demo in [YEAR]. This new demo also found its way to the European Metal tape trading community and the band began to build their loyal European fanbase.\n",
      "In [YEAR], they debuted with their independently financed debut A Social Grace, which was released in Europe via a [GENRE] band's own Sub Sonic Records label.  With practically no promotion and minimal distribution, it remained an extremely underground item.  In [MONTH] of [YEAR], the band appeared at the Dynamo Festival in the Netherlands.\n"
   ]
}