{
   "Name": "Sculptured",
   "rawData": [
      "Sculptured is an American experimental death metal band, mixing melodic and atonal segments.\n",
      "Sculptured's unusual style is particularly evident on the first track of Apollo Ends, \"Washing My Hands of It\", while the track \"Snow Covers All\" uses a form of serialism, while \"Above the 60th Parallel\" features a Twelve-tone technique solo. The band also introduces classical orchestrations in some of its pieces.\n",
      "The history and fate of Sculptured is inherently related to Agalloch because of Don Anderson's significant involvement with both bands. Because of this, Sculptured left The End Records at the same time as Agalloch.\n"
   ],
   "infobox": {
      "Origin": [
         "Bellingham, Washington, United States"
      ],
      "Genres": [
         "Experimental metal, melodic death metal[1]"
      ],
      "Years active": [
         "1996–present"
      ],
      "Labels": [
         "The End Records"
      ],
      "Associated acts": [
         "Agalloch",
         "Age of Silence",
         "Estradasphere",
         "Winds"
      ],
      "Website": [
         "MySpace.com - Sculptured"
      ],
      "Members": [
         "Don Anderson",
         "Thomas Walling",
         "Jason William Walton",
         "Dave Murray",
         "Andy Winter"
      ],
      "Past members": [
         "Brian Yager",
         "Burke Harris",
         "Clint Idsinga",
         "Chris Maycock",
         "John Schlegel",
         "John Haughm"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band, mixing melodic and atonal segments.\n",
      "[BAND_NAME]'s unusual style is particularly evident on the first track of Apollo Ends, \"Washing My Hands of It\", while the track \"Snow Covers All\" uses a [GENRE] a Twelve-tone technique solo. The band also introduces classical orchestrations in some of its pieces.\n",
      "The history and fate of [BAND_NAME] is inherently related to Agalloch because of Don Anderson's significant involvement with both bands. Because of this, [BAND_NAME] left The End Records at the same time as Agalloch.\n"
   ]
}