{
   "Band members": {
      "Timeline": {},
      "text": [
         "\n",
         "\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "The group released its debut album, World Downfall, in 1989.[3] It is seen as one of the classics of early grindcore.[4] An album containing two rehearsal sessions of the band from 1987 was released in 2003.\n",
         "The band split around 1990 when Vincent offered Sandoval a spot in Morbid Angel, while Pintado was being courted to join Napalm Death; Sandoval saw Terrorizer stagnating, while Morbid Angel and Napalm Death at the time were rapidly gaining popularity. As a result, only Garcia remained; Garcia claims not to have talked to Sandoval since.[5]\n",
         "In early 2005, it was rumored that Terrorizer were to reform with their original line-up; however, of the original line up, only Jesse Pintado and Pete Sandoval returned. The band released its second studio album, Darker Days Ahead, in August 2006, on Century Media Records. Tony Norman (Morbid Angel) joined on guitar and bass, and Anthony Rezhawk joined as the new vocalist. Pintado had been recording and playing shows with Rezhawk's band Resistant Culture and asked him to join Terrorizer. In the week of the album's release, Pintado died due to complications arising from liver failure.[6]\n",
         "In 2009, Terrorizer released a new demo track, \"Hordes of Zombies\", on its MySpace page.[7] In June 2011, Terrorizer signed to Season of Mist, and released its third album, Hordes of Zombies, on February 28, 2012.[8] Resistant Culture guitarist Katina Culture replaced Pintado and David Vincent rejoined on bass.[9]\n",
         "In November 2012, drummer Pete Sandoval announced that Terrorizer started writing new material for their next album.[10] The fourth album titled Caustic Attack was released in the fall of 2018 under The End Records.[11]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Terrorizer LA",
      "3 Band members",
      "3.1 Timeline",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Terrorizer is an American grindcore[2] band formed in 1986 in Los Angeles, California, United States. After disbanding, its members gained recognition by playing in influential extreme metal bands, such as Morbid Angel (David Vincent, Pete Sandoval), Napalm Death (Jesse Pintado) and Nausea (Oscar Garcia, Alfred \"Garvey\" Estrada). To date, Terrorizer has released four studio albums, and broken up twice (once in 1989 and another in 2006). The band reunited again in 2009, this time without Pintado, who had died three years earlier.\n"
      ]
   },
   "Terrorizer LA": {
      "text": [
         "In 2014, Oscar Garcia was invited by Jesse Pintado’s sister to put together a new lineup of Terrorizer (his version known as Terrorizer LA or TLA) for a festival celebrating what would have been Jesse Pintado’s 45th birthday.[12][13] He asked fellow Nausea member Leon del Muerte (Murder Construct) to play guitar, and shortly afterward Cosmo Reveles, Rick Cortez (Sadistic Intent) and Mike Caffell (Dreaming Dead, Exhausted Prayer) were recruited to fill out the band. The band continues to play under the Terrorizer LA name.\n",
         "Before The Downfall, a collection of demos and unreleased material, was released by FOAD Records in 2015.\n"
      ]
   },
   "Title": "Terrorizer - Wikipedia"
}