{
   "Name": "Yearning (band)",
   "rawData": [
      "Yearning was an atmospheric doom metal band from Finland. During its career the band released five studio albums and one demo, the latter being released while the band was still called Flegeton.\n",
      "Yearning was formed in 1994 under the name \"Flegeton\". The original line-up consisted of Juhani Palomäki on guitars and vocals and Toni Kristian on drums. The band started to write own music and soon Tero Kalliomäki joined the band as a guitarist. Soon after, Flegeton made a 4-track tape titled \"Through the Desolate Lands\", but it was never widely distributed.\n",
      "In July 1995, Flegeton, with a new bass player, Mr. Woodland (aka Petri Salo), went into MDM studios to record their demo \"The Temple of Sagal\". The demo received praise from enthusiasts of melancholy music. It also got the attention of the French record company Holy Records, which Flegeton contracted with for two full-length studio albums.\n"
   ],
   "infobox": {
      "Origin": [
         "Riihimäki, Finland"
      ],
      "Genres": [
         "Atmospheric metal, doom metal, gothic metal[1]"
      ],
      "Years active": [
         "1994–2010"
      ],
      "Labels": [
         "Holy Records"
      ],
      "Associated acts": [
         "Azaghal",
         "Thyrane",
         "Twilight Ophera",
         "Wyrd"
      ],
      "Past members": [
         "Juhani Palomäki",
         "Toni Kristian",
         "Tero Kalliomäki",
         "Mr. Woodland",
         "Lady Tiina Ahonen",
         "Aki Kuusinen"
      ]
   },
   "albums": [
      "The Temple of Sagal"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Finland. During its career the band released five studio albums and one demo, the latter being released while the band was still called Flegeton.\n",
      "[BAND_NAME] was formed in [YEAR] under the name [SONG_NAME], but it was never widely distributed.\n",
      "In [MONTH] [YEAR], Flegeton, with a new bass player, Mr. Woodland (aka [PERSON_NAME_FULL_0_MALE]), went into MDM studios to record their demo [SONG_NAME]. The demo received praise from enthusiasts of melancholy music. It also got the attention of the French record company Holy Records, which Flegeton contracted with for two full-length studio albums.\n"
   ]
}