{
   "Name": "All-female band",
   "rawData": [
      "An all-female band is a musical group in popular music that is exclusively composed of female musicians. This is distinct from a girl group, in which the female members are solely vocalists, though this terminology is not universally followed. While all-male bands are common in many rock and pop scenes, all-female bands are less common.\n",
      "In the Jazz Age and during the 1930s, \"all-girl\" bands such as the Blue Belles, the Parisian Redheads (later the Bricktops), Lil-Hardin's All-Girl Band, the Ingenues, the Harlem Playgirls led by the likes of Neliska Ann Briscoe and Eddie Crump, the International Sweethearts of Rhythm, Phil Spitalny's Musical Sweethearts, \"Helen Lewis and Her All-Girl Jazz Syncopators\" as well as \"Helen Lewis and her Rhythm Queens   were popular. Dozens of early sound films were made of the vaudeville style all-girl groups, especially short subject promotional films for Paramount and Vitaphone. (In 1925, Lee de Forest filmed Lewis and her band in his short-lived Phonofilm process, in a film now in the Maurice Zouary collection at the Library of Congress.) Blanche Calloway, sister of Cab Calloway, led a male band, Blanche Calloway and Her Joy Boys, from 1932 to 1939, and Ina Ray Hutton led an all-girl band, the Melodears, from 1934 to 1939. Eunice Westmoreland, under the name Rita Rio, led an all-girl band appearing on NBC Radio and in short subjects for Vitaphone and RKO before changing her career to acting and her professional name to Dona Drake, appearing in numerous 1940s movies. Ivy Benson's \"All Girls Band\" was the BBC's resident dance band in 1943 and toured until the 1980s. All-girl bands active in vaudeville, variety shows, and early sound films during the 1920s to the 1950s are documented by Kristin McGee in Some Liked it Hot: Jazz Women in Film and Television. Sally Placksin, Linda Dahl, D. Antoinette Handy, and Frank Driggs along with professor Sherrie Tucker, in her book Swing Shift: \"All-Girl\" Bands of the 1940s, have also documented this era. A Polish group Filipinki was established in 1959.\n",
      "Bands composed solely of women began to emerge with the advent of rock and roll. Among the earliest all-female rock bands to be signed to a record label were Goldie and the Gingerbreads, to Atlantic Records in 1964, the Pleasure Seekers with Suzi Quatro to Hideout Records in 1964 and Mercury Records in 1968, the Feminine Complex to Athena Records in 1968, and Fanny (who pioneered the all-female band sound in the early to mid-1970s) in 1969 when Mo Ostin signed them to Warner Bros. Records. There were also others, such as the Liverbirds (1962–1967), the Ace of Cups (1967), the Heart Beats (1968), and Ariel (1968–1970) which included the three members of the Deadly Nightshade.\n"
   ],
   "infobox": {},
   "prunedData": [
      "An all-female band is a [GENRE] a girl group, in which the female members are solely vocalists, though this terminology is not universally followed. While all-male bands are common in many rock and pop scenes, all-female bands are less common.\n",
      "In the Jazz Age and during the [YEAR]s, \"all-girl\" bands such as the Blue Belles, the Parisian Redheads (later the Bricktops), Lil-Hardin's All-Girl Band, the Ingenues, the Harlem Playgirls led by the likes of Neliska Ann Briscoe and Eddie Crump, the International Sweethearts of Rhythm, [PERSON_NAME_FULL_2_MALE]'s Musical Sweethearts, \"Helen Lewis and Her All-Girl Jazz Syncopators\" as well as \"Helen Lewis and her Rhythm Queens   were popular. Dozens of early sound films were made of the vaudeville style all-girl groups, especially short subject promotional films for Paramount and Vitaphone. (In [YEAR], Lee de Forest filmed Lewis and her band in his short-lived Phonofilm process, in a film now in the Maurice Zouary collection at the Library of Congress.) [PERSON_NAME_FULL_4_FEMALE], sister of Cab [PERSON_NAME_LAST_4], led a male band, [PERSON_NAME_FULL_4_FEMALE] and Her Joy Boys, from [YEAR] to [YEAR], and [PERSON_NAME_FULL_0_FEMALE] led an all-girl band, the Melodears, from [YEAR] to [YEAR]. Eunice Westmoreland, under the name Rita Rio, led an all-girl band appearing on NBC Radio and in short subjects for Vitaphone and RKO before changing her career to acting and her professional name to [PERSON_NAME_FULL_5_FEMALE], appearing in numerous [YEAR]s movies. Ivy Benson's \"All Girls Band\" was the BBC's resident dance band in [YEAR] and toured until the [YEAR]s. All-girl bands active in vaudeville, variety shows, and early sound films during the [YEAR]s to the [YEAR]s are documented by [PERSON_NAME_FULL_3_FEMALE] in Some Liked it Hot: Jazz Women in Film and Television. [PERSON_NAME_FULL_7_FEMALE], Linda Dahl, D. [PERSON_NAME_FULL_1_FEMALE], and Frank Driggs along with professor [PERSON_NAME_FULL_6_FEMALE], in her book Swing Shift: \"All-Girl\" Bands of the [YEAR]s, have also documented this era. A Polish group Filipinki was established in [YEAR].\n",
      "Bands composed solely of women began to emerge with the advent of rock and roll. Among the earliest all-female rock bands to be signed to a record label were Goldie and the Gingerbreads, to Atlantic Records in [YEAR], the Pleasure Seekers with [PERSON_NAME_FULL_1_FEMALE] to Hideout Records in [YEAR] and Mercury Records in [YEAR], the Feminine Complex to Athena Records in [YEAR], and Fanny (who pioneered the all-female band sound in the early to mid-[YEAR]s) in [YEAR] when [PERSON_NAME_FULL_0_MALE] signed them to Warner Bros. Records. There were also others, such as the Liverbirds ([YEAR]–[YEAR]), the Ace of Cups ([YEAR]), the Heart Beats ([YEAR]), and Ariel ([YEAR]–[YEAR]) which included the three members of the Deadly Nightshade.\n"
   ]
}