{
   "Name": "Death Angel",
   "Sections": [
      "1 History",
      "1.1 Early years (1982–1988)",
      "1.2 Act III and breakup (1989–1991)",
      "1.3 Post-breakup (1991–2001)",
      "1.4 Reunion, The Art of Dying and Killing Season (2001–2008)",
      "1.5 Lineup changes, Relentless Retribution and The Dream Calls for Blood (2008–2014)",
      "1.6 The Evil Divide and Humanicide (2015–2020)",
      "1.7 Will Carroll's illness and upcoming tenth album (2020–present)",
      "2 Band members",
      "2.1 Members",
      "2.2 Timeline",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Death Angel is an American thrash metal band from Daly City, California, initially active from 1982 to 1991 and again since 2001. Death Angel has released nine studio albums, two demo tapes, one box set and two live albums. The band has gone through several line-up changes, leaving guitarist Rob Cavestany as the only constant member; he and vocalist Mark Osegueda (who joined the group in 1984) are the only members of Death Angel to appear on all of their studio albums.\n",
         "Death Angel is often referred to as one of the key bands in the Bay Area thrash metal movement of the 1980s,[3][4] and secured opening slots at club venues that decade, including opening for their peers Megadeth, Metallica, Slayer, Exodus, Testament, Overkill, D.R.I., Mercyful Fate and Possessed.[5] They are also often credited as one of the leaders of the second wave of thrash metal movement from the 1980s,[6] and considered to be one of the \"big eight\" of the genre (along with Metallica, Megadeth, Slayer, Anthrax, Testament, Exodus and Overkill).[1][7][8][9] Following the underground success of their first two studio albums, The Ultra-Violence (1987) and Frolic Through the Park (1988), Death Angel signed to Geffen Records in 1989, and released their only album for the label, Act III, the following year. While they were touring in support of Act III, then-drummer Andy Galeon was injured in a tour bus accident and needed more than a year to fully recover. This resulted in the band's break up in 1991. However, Death Angel reformed in 2001 (without original rhythm guitarist Gus Pepa) at the Thrash of the Titans benefit concert for Testament singer Chuck Billy. The band has since released six more albums, including Humanicide (2019), to which the title track gave Death Angel their first-ever Grammy Award nomination.\n"
      ]
   },
   "History": {
      "Early years (1982–1988)": {
         "text": [
            "Death Angel was formed in the San Francisco Bay Area, California, in 1982 by cousins Rob Cavestany (lead guitar, backing vocals), Dennis Pepa (lead vocals, bass), Gus Pepa (rhythm guitar), and Andy Galeon (drums) -- all of Filipino descent. After considering a number of different names for the band, including Dark Fury, Cavestany and D. Pepa settled on the name Death Angel after coming across a book by that title in a book store.[10] In 1983, the band released their first demo, Heavy Metal Insanity, with Matt Wallace serving as producer. According to Mark Osegueda, the group was then \"more like a metal band, more like Iron Maiden, Tygers of Pan Tang and stuff like that\", as the so-called Bay Area thrash movement was only just beginning to rise to prominence at the time and make its influence felt.[11]  Osegueda, a second cousin of the other four members who had been working as their roadie, became the group's lead vocalist in 1984 and performed his first show with the band on a bill with Megadeth in April of that year (at one of the four Megadeth gigs to feature Kerry King on guitars).[11]\n",
            "Death Angel continued to play club gigs in and around the San Francisco Bay area for nearly two years, writing songs and refining their stage show. In 1985, the band recorded the Kill as One demo produced by Metallica's Kirk Hammett, whom they had met at a record store signing in 1983.  The underground tape trading wave of the 1980s led to extensive distribution of the demo, bringing the band wide attention. Osegueda later recalled that prior to the release of the band's first album, \"We were playing in L.A. and New York, and the crowd was singing our songs, because there was this underground tape trading .... That's what keeps it alive, and I think that's absolutely wonderful.\" [11]\nIn 1986, Death Angel performed at their Concord, California high school, Clayton Valley High School (now known as Clayton Valley Charter High School), at lunchtime.  They famously dedicated the song \"Mistress of Pain\" to a Vice Principal.\n",
            "The success of Kill as One led to a record deal with Enigma Records, who released Death Angel's debut album, The Ultra-Violence, in 1987. The band recorded the album when all the members were still under 20 years old (with drummer Andy Galeon being the youngest at 14),[12] and subsequently embarked on its first tour, supporting such bands as Exodus, Destruction, Voivod, Sacrifice and Whiplash.[5] A video was filmed for \"Voracious Souls\", a song about a band of cannibals, but it never aired on MTV due to the nature of the lyrics.\n",
            "Death Angel released their second album, Frolic Through the Park, in 1988. It featured more diverse material than the straightforward thrash of the first album. It included a cover version of the Kiss song \"Cold Gin\". The band released a video for the single \"Bored\" which received regular airplay on MTV's Headbangers Ball, and the song appeared two years later on the soundtrack to the movie Leatherface: The Texas Chainsaw Massacre III. The song was written under the seemingly unlikely influence of U2, and the guitar playing of The Edge in particular.[10] The band toured worldwide for the first time (with the likes of Motörhead, Testament, Flotsam and Jetsam, Overkill, Rigor Mortis, Sacred Reich, Forbidden, Vio-lence and Death)[5] and found notable success in Japan, selling out two full Japanese tours.\n"
         ]
      },
      "Act III and breakup (1989–1991)": {
         "text": [
            "Geffen Records bought out the band's contract with Enigma Records in 1989 and released the third Death Angel album, Act III, in 1990. Produced by Max Norman (who had previously worked with Ozzy Osbourne, Megadeth, Savatage, Fates Warning and Loudness), the album showcased the band's newfound use of full-band backing vocals, while fusing elements of funk, thrash, and heavy metal with the use of acoustic guitars to give the album a varied feel, while staying true to the group's heavy roots. The album featured the singles \"Seemingly Endless Time\" and \"A Room with a View\" (a ballad sung mostly by guitarist Rob Cavestany), and both songs also received airplay on Headbangers Ball, but a mainstream breakthrough still proved elusive. The band released the \"A Room with a View\" video and single under the name \"D.A.\" and Cavestany explained to a reporter at the time that he now found the band's original name \"Restricting. The name Death Angel seems to imply hardcore thrash gloom-and-doom death metal, and we're not like that at all. If I were presented with 10 records, and one of them was by a band called Death Angel, and I'd never heard of them, I'd stick that one on the bottom!\"  [13]\n",
            "Also in 1990, Enigma Records, already having sold its interest in the band to the Geffen label, illegally released and distributed Fall from Grace, an unauthorized bootleg live album featuring songs from their first two releases and recorded at the Paradiso in Amsterdam, Netherlands. The album was released without any input from the band members with regard to its songs, contents, credits, concepts, or artwork. The band learned of its existence when they stumbled upon it in a record store in Tucson, Arizona, on the night prior to suffering a near-fatal auto accident. Enigma Records folded after the release, cashing in on the sales. The album was picked up, manufactured and distributed by Capitol Records, also possibly illegally.\n",
            "Death Angel had embarked on what was scheduled to be a worldwide tour in support of Act III in 1990, selling out shows at the Warfield Theatre in San Francisco, The Ritz in New York, and England's Hammersmith Odeon, and touring, or playing selected shows, with the likes of Forbidden, Vicious Rumors, Sanctuary, Sepultura, Sacred Reich, Morbid Angel, Atheist, Forced Entry, Dead Horse and former Megadeth guitarist Chris Poland.[5] While driving in Arizona en route to a show in Las Vegas, the group's tour bus crashed, and drummer Andy Galeon was critically injured, needing more than a year to recover. Cavestany said at the time that \"[i]n a way, it made perfect sense to have a major accident right now, it really fit the story line. We've been pushing so hard for 8 years and just not getting that far, and getting so frustrated with not being where we should be after so long, it was time for something climactic to happen!\" [13] The band was also slated to be the opening act for the Clash of the Titans tour featuring Megadeth, Slayer, and Anthrax in the summer of 1991, but were ultimately replaced by Alice in Chains since they were unable to perform. Additionally, Death Angel and Geffen were planning to release a live album recorded at shows in the Bay Area, and the band was intending to tour a number of other countries it had not previously visited. According to Cavestany, they were invited to tour Europe with Annihilator and Judas Priest, supporting the latter on their Painkiller tour;[14] however, due to the bus accident, Death Angel cancelled the offer and was replaced by Pantera.\n",
            "Following the accident, Geffen Records and the band's manager pressured the group to hire another drummer and immediately go back to work. The band performed a few shows in Japan with drummer Chris Kontos, but when they declined to hire a long-term replacement, Geffen Records dropped them.\n",
            "Osegueda left the group and moved to New York to pursue a life outside of music, and Cavestany later explained that \"[w]e weren't going to try to replace him and with all that stuff happening we were just totally disgusted at how things had turned out and we felt that this was a sign that the band was not going to go on.\" [15] The remaining members performed a few acoustic-only shows in the Bay Area, appearing as \"The Past.\"\n"
         ]
      },
      "Post-breakup (1991–2001)": {
         "text": [
            "In the summer of 1991, with Galeon fully recovered, Death Angel's remaining members, minus Osegueda, reformed under the name The Organization (which was the title of a song on Act III), with Cavestany taking over lead vocal duties. The band focused more on funk and alternative rock than traditional metal.  The Organization's first demo was recorded and produced at City College of San Francisco's multitrack studios by Eric Kauschen and Dana Galloway.\n",
            "The Organization toured extensively throughout the United States and Europe, including two appearances at the Dynamo Open Air Festival in the Netherlands, a support slot on Rob Halford's \"Fight\" tour, and as the main support act for Motörhead in Europe. However, both 1993's The Organization and 1995's Savor the Flavor albums, which were distributed by Metal Blade Records, failed to make waves with the record-buying public, and Cavestany and Galeon decided to disband.\n",
            "Around 1992, Osegueda was invited to audition for Anthrax after the departure of Joey Belladonna. The band eventually hired John Bush of Armored Saint, and Anthrax guitarist Scott Ian later wrote that Osegueda \"had a great voice but was strangely too metal for us.\"[16]\n",
            "In 1998, Cavestany and Galeon reunited with Osegueda for the first time since 1990. Along with bassist Michael Isaiah, they formed Swarm and released a four-track self-titled EP in 1999, and the five-song Devour EP in 2000. Swarm toured with Jerry Cantrell of Alice in Chains in 2000, and released the compilation album Beyond the End, which combined the contents of the two EPs with a cover of The Doors' \"My Eyes Have Seen You\", in 2003. Although Swarm did not become a commercial success, it did bring the core members of Death Angel back together, setting up an official reunion.\n"
         ]
      },
      "Reunion, The Art of Dying and Killing Season (2001–2008)": {
         "text": [
            "Death Angel officially reunited in August 2001 for Thrash of the Titans, a cancer benefit show for Testament frontman Chuck Billy. Original guitarist Gus Pepa could not participate in the reunion since he was out of the country. At Cavestany's suggestion, and with Pepa's blessing, the band enlisted longtime friend and fan, Ted Aguilar, to handle rhythm guitar duties. Originally planned as a one-off show, the band received such a positive response that they played a string of other well-received gigs around the San Francisco area and a pair of European tours, despite the band not having issued an album in over a decade. They also participated in Wacken Open Air and the Bang your Head 2004.\n",
            "In 2004, 14 years after their last album, the band released The Art of Dying on Nuclear Blast records. Archives and Artifacts, a box set with remastered versions of the long out-of-print The Ultra-Violence and Frolic Through The Park, along with a bonus Rarities CD and DVD, followed in 2005.\n",
            "Osegueda had since announced his involvement in the band All Time Highs, but had emphasized that he was going to remain a member of Death Angel.[17] In August 2007, Cavestany released a solo CD of acoustic songs, Lines on the Road, the material on which was written in collaboration with Gus Pepa, and performed by Cavestany (vocals, bass, guitar) Gus Pepa (guitar) and Galeon (drums).\n",
            "In April 2007, they headlined the seventh Pulp Summer Slam in the Philippines. Killing Season, recorded at Dave Grohl's Studio 606 in Northridge, California, was released on February 26, 2008. Death Angel's video for \"Dethroned\", a track off Killing Season, debuted online on Thursday, April 17, 2008, on Headbangers Blog.\n"
         ]
      },
      "Lineup changes, Relentless Retribution and The Dream Calls for Blood (2008–2014)": {
         "text": [
            "At a show at the Grand in San Francisco on October 28, 2008, Death Angel announced that founding member Dennis Pepa would be leaving the band, and that the show would be his final live performance with them. Citing creative differences, he stated: \"I've been with Death Angel since its inception in the '80s and believe it is time for me to move on. Throughout my career with the band, I've brought a punk-influenced edge to the Death Angel sound, and as an open-minded musician in need of change, I'd like to diversify and explore other opportunities within and beyond the genre of metal.\".[18] On January 10, 2009, Death Angel announced the addition of bassist Sammy Diosdado to replace Pepa. Diosdado is a Bay Area native who previously played with the San Francisco hardcore band The Sick and is a member of the rock and roll outfit All Time Highs, which is fronted by Osegueda.[19]\n",
            "Drummer and founding member Andy Galeon left Death Angel in May 2009 for family and personal reasons. He stated in a September 2009 interview: \"\"We had a tour booked, and basically, I had personal things I had to deal with — I had a newborn baby — and I just was like, 'Well, I've gotta do stuff at home.' We [the members of Death Angel] weren't communicating well or nothing. I wasn't about to ask them to not go [on the road], so I just said, 'I'll just leave then.'[20]  This left Rob Cavestany as the only founding member remaining in the band. Galeon was replaced by Will Carroll (formerly of Scarecrow, Old Grandad and Vicious Rumors).[21]\n",
            "In November 2009, Sammy Diosdado was replaced by bassist Damien Sisson, formerly of the bands Scarecrow and Potential Threat.\n",
            "The bands sixth studio album Relentless Retribution was released in September 2010. The album was recorded at Audiohammer Studios in Sanford, Florida with producer Jason Suecof (Trivium, August Burns Red, The Black Dahlia Murder, All That Remains, Whitechapel, DevilDriver).[22] It was the first Death Angel album recorded without longtime drummer Andy Galeon as well as without either of the Pepa cousins. Death Angel toured in support of Relentless Retribution for two-and-a-half years. They embarked on the European Thrashfest tour in late 2010 with Kreator, Exodus and Suicidal Angels, and supported Anthrax and Testament on the Worship Music tour in North America three times (in October–November 2011, January–February 2012 and September–October 2012).[23][24][25]\n",
            "Death Angel released their seventh album The Dream Calls for Blood on 11 October 2013. The album landed at #72 on the Billboard 200,[26] making it the band's first chart entry since 1988's Frolic Through the Park, and their first to crack the Top 100 on the American charts.[27]\n"
         ]
      },
      "The Evil Divide and Humanicide (2015–2020)": {
         "text": [
            "Death Angels eighth studio album The Evil Divide was released on May 27, 2016[28] and peaked at number 98 on the Billboard 200, giving the band their second highest chart position.[27] The band toured for two-and-a-half years in support of the album, opening for Slayer on their Repentless tour in North America,[29] Testament on their Brotherhood of the Snake tour in Europe,[30] and Sepultura on their Machine Messiah tour in Australia,[31] as well as taking part in the 2018 edition of the MTV Headbangers Ball European tour, also featuring Exodus, Sodom and Suicidal Angels.[32][33]\n",
            "In a February 2017 interview with The Void Report, Aguilar revealed that Death Angel would begin working on new material in the fall.[34] In December of that year, guitarist Rob Cavestany stated that, instead of touring extensively, they would spend much of 2018 focusing on writing and recording their ninth studio album.[35] On June 30, 2018, the band issued this statement on Facebook: \"Now it's time to head home, lock ourselves in the studio and finish writing this new album.\"[36] It was reported in September 2018 that Death Angel had been in the studio recording their new album, again teaming up with Jason Suecof (who has worked with the band since Relentless Retribution) as the producer.[37]\n",
            "Humanicide was released on May 31, 2019 via Nuclear Blast.[38] Prior to the album's release, they (along with Mothership) toured North America by supporting Overkill on their Wings of War tour.[39][40] The band also toured Europe that summer, opening for bands like Arch Enemy, Testament and Anthrax on selected dates as well as headlining their own shows,[38] and was one of the performers at Megadeth's first-ever MegaCruise in October.[41]\n",
            "In November 2019 the title track to Humanicide was nominated for the Grammy Award for \"Best Metal Performance\", becoming Death Angel's first ever Grammy nomination.[42] The award ultimately went to Tool for their song \"7empest\".\n",
            "Death Angel continued touring into 2020 in support of Humanicide, including taking part in The Bay Strikes Back European tour with Testament and Exodus in February–March.[43]\n"
         ]
      },
      "Will Carroll's illness and upcoming tenth album (2020–present)": {
         "text": [
            "Following the conclusion of the Bay Strikes Back tour, which took place as the COVID-19 pandemic was beginning to spread around the world, drummer Will Carroll contracted COVID-19 and was admitted to an intensive care unit at a Northern California hospital.[44][45] Gary Holt of Exodus and Testament members Chuck Billy and Steve Di Giorgio also fell ill after returning from the tour, as did various members of their crews.[46][47][48] On April 2, 2020, after nearly two weeks on a ventilator, Carroll posted a lengthy update on his condition, thanking his family and friends for supporting him, and revealed that he had been \"getting some new files from Mr. Rob Cavestany which will eventually be DA's 10th record.\"[49] By mid-2020, Carroll had fully recovered from COVID, and confirmed in an interview with Rock Immortal in August that he and Cavestany were already working on new material for the next Death Angel album.[50]\n",
            "On October 9, 2020, without prior announcement Death Angel released the digital EP Under Pressure. Unlike previous releases, it is almost entirely acoustic. It contains a cover of the Queen song \"Under Pressure\", one new original song \"Faded Remains\", and remakes of the tracks \"A Room with a View\" from Act III and \"Revelation Song\" from Humanicide.[51][52]\n"
         ]
      }
   },
   "Band members": {
      "Members": {
         "text": [
            "Lead guitarist Rob Cavestany\n",
            "Lead singer Mark Osegueda\n",
            "Rhythm guitarist Ted Aguilar\n",
            "Drummer Will Carroll\n",
            "Bassist Damien Sisson\n"
         ]
      },
      "Timeline": {}
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Death Angel is an American thrash metal band from Daly City, California, initially active from 1982 to 1991 and again since 2001. Death Angel has released nine studio albums, two demo tapes, one box set and two live albums. The band has gone through several line-up changes, leaving guitarist Rob Cavestany as the only constant member; he and vocalist Mark Osegueda (who joined the group in 1984) are the only members of Death Angel to appear on all of their studio albums.\n",
      "Death Angel is often referred to as one of the key bands in the Bay Area thrash metal movement of the 1980s,[3][4] and secured opening slots at club venues that decade, including opening for their peers Megadeth, Metallica, Slayer, Exodus, Testament, Overkill, D.R.I., Mercyful Fate and Possessed.[5] They are also often credited as one of the leaders of the second wave of thrash metal movement from the 1980s,[6] and considered to be one of the \"big eight\" of the genre (along with Metallica, Megadeth, Slayer, Anthrax, Testament, Exodus and Overkill).[1][7][8][9] Following the underground success of their first two studio albums, The Ultra-Violence (1987) and Frolic Through the Park (1988), Death Angel signed to Geffen Records in 1989, and released their only album for the label, Act III, the following year. While they were touring in support of Act III, then-drummer Andy Galeon was injured in a tour bus accident and needed more than a year to fully recover. This resulted in the band's break up in 1991. However, Death Angel reformed in 2001 (without original rhythm guitarist Gus Pepa) at the Thrash of the Titans benefit concert for Testament singer Chuck Billy. The band has since released six more albums, including Humanicide (2019), to which the title track gave Death Angel their first-ever Grammy Award nomination.\n",
      "Death Angel was formed in the San Francisco Bay Area, California, in 1982 by cousins Rob Cavestany (lead guitar, backing vocals), Dennis Pepa (lead vocals, bass), Gus Pepa (rhythm guitar), and Andy Galeon (drums) -- all of Filipino descent. After considering a number of different names for the band, including Dark Fury, Cavestany and D. Pepa settled on the name Death Angel after coming across a book by that title in a book store.[10] In 1983, the band released their first demo, Heavy Metal Insanity, with Matt Wallace serving as producer. According to Mark Osegueda, the group was then \"more like a metal band, more like Iron Maiden, Tygers of Pan Tang and stuff like that\", as the so-called Bay Area thrash movement was only just beginning to rise to prominence at the time and make its influence felt.[11]  Osegueda, a second cousin of the other four members who had been working as their roadie, became the group's lead vocalist in 1984 and performed his first show with the band on a bill with Megadeth in April of that year (at one of the four Megadeth gigs to feature Kerry King on guitars).[11]\n",
      "Death Angel continued to play club gigs in and around the San Francisco Bay area for nearly two years, writing songs and refining their stage show. In 1985, the band recorded the Kill as One demo produced by Metallica's Kirk Hammett, whom they had met at a record store signing in 1983.  The underground tape trading wave of the 1980s led to extensive distribution of the demo, bringing the band wide attention. Osegueda later recalled that prior to the release of the band's first album, \"We were playing in L.A. and New York, and the crowd was singing our songs, because there was this underground tape trading .... That's what keeps it alive, and I think that's absolutely wonderful.\" [11]\nIn 1986, Death Angel performed at their Concord, California high school, Clayton Valley High School (now known as Clayton Valley Charter High School), at lunchtime.  They famously dedicated the song \"Mistress of Pain\" to a Vice Principal.\n"
   ]
}