{
   "1970s": {
      "text": [
         "Several factors led to the break-up of Ace of Cups. Some of the band members were frustrated at the group's lack of commercial success. Others were interested in other pursuits. Several members had children and found it difficult to balance motherhood and a musical career.[21]\n",
         "In the early 1970s, several men joined the band to replace the women who had left. Kaufman was the last remaining member from the original line-up when the band folded in 1972.[22]\n"
      ]
   },
   "2000s": {
      "text": [
         "In 2003, Ace Records released It's Bad for You But Buy It!, a CD of \"rehearsals, demos, TV soundstage recordings, and in-concert tapes\" of Ace of Cups. The CD was generally well received.[5][6][23]\n",
         "The band's performances on the 1968 television program West Pole were released on DVD in 2008 by Eagle Vision.[24]\n"
      ]
   },
   "2010s": {
      "text": [
         "As the decades passed, band members pursued various other personal and creative endeavors, occasionally playing music both individually and collectively when opportunities arose. On May 14, 2011, Ace of Cups played Wavy Gravy’s 75th birthday party and SEVA Foundation benefit. George Baer Wallace, founder of High Moon Records, was there to talk to the band about releasing archival concert recordings. He was so moved by their spirit and spark that he offered the Ace Of Cups the opportunity to record their first ever studio album.[25]\n",
         "In 2016, the band began work on their debut studio album.[1] Four of the band's original members took part in the recording: Mary Gannon (claps), Denise Kaufman (bass, harmonica), Mary Ellen Simpson (lead guitar), and Diane Vitalich (drums). The album was produced by Dan Shea (Mariah Carey, Santana, Jennifer Lopez), and features contributions from Jorma Kaukonen and Jack Casady (Jefferson Airplane, Hot Tuna), David Freiberg (Quicksilver Messenger Service), Barry Melton (Country Joe & The Fish), Pete Sears (Jefferson Starship, Rod Stewart, Hot Tuna), David Grisman, Steve Kimock (Zero, RatDog), Terry Haggerty (Sons of Champlin), Norman Mayell (Sopwith Camel), Sid Page and Charlie Musselwhite, as well as lead vocal turns by Bob Weir (Grateful Dead), Taj Mahal, Buffy Sainte-Marie and Peter Coyote. On November 9, 2018, the band released Ace of Cups on High Moon Records.[citation needed] The Ace of Cups today is Mary Gannon, Denise Kaufman, Mary Ellen Simpson, Diane Vitalich, and Dallis Craft.\n",
         "The Ace of Cups will release their sophomore album Sing Your Dreams on October 2, 2020 via High Moon Records.[26] Sing Your Dreams is a new collection of 12 songs and stories, produced by Dan Shea (Santana, Mariah Carey, Phil Collins, Bruce Hornsby), and features collaborations with Jackson Browne (who duets on album closer ‘Slowest River’), Sheila E. and the Escovedo Family, Bakithi Kumalo (whose iconic bass-playing was integral to the sound of Paul Simon’s Graceland), jam-band guitar luminary Steve Kimock (Jerry Garcia named him his ‘favorite unknown guitarist’), peace activist and counterculture icon Wavy Gravy, Jack Casady (Jefferson Airplane, Hot Tuna), and David Freiberg (Quicksilver Messenger Service, Jefferson Airplane/Starship).\n"
      ]
   },
   "Background": {
      "Management": {
         "text": [
            "Hollingworth], who also managed Quicksilver Messenger Service became a paraplegic as a result of an automobile crash near Muir Beach, California in 1967. Hollingworth's stewardship transferred to Ron Polte. Polte was known for going to great lengths to accommodate the welfare of his musicians. When perennial studio musician Nicky Hopkins joined Quicksilver in 1969, it was the first and only band that included him in its performing and recording revenues.[12] Hollingsworth died in 1996, and Polte in 2016.[12]\n"
         ]
      },
      "text": [
         "Gannon was born in New York and moved to San Francisco in the early 1960s. She played bass for a short while in a band called Daemon Lover. Hunt, who had grown up in Los Angeles, had been playing the piano since she was three. Like Gannon, she also moved to San Francisco in the early 1960s. Hunt was introduced to Gannon through a mutual friend, and Gannon suggested that they form an all-female rock band.[7]\n",
         "Simpson was from Indio, California. She began playing the guitar when she was 12. Like Gannon and Hunt, she moved to San Francisco in the early 1960s. Vitalich, a San Francisco native, was a veteran of several bands. She once played drums with Bill Haley and the Comets. Simpson and Vitalich joined Gannon and Hunt's band around the same time.[8]\n",
         "The last woman to join Ace of Cups was Kaufman. She also had the most colorful background of the group. Kaufman had been arrested during the Free Speech Movement at Berkeley,[9] and she was involved with Ken Kesey and the Merry Pranksters (who dubbed her \"Mary Microgram\").[6] In a 1995 interview, Hunt remembered her first impression of Kaufman:\n",
         "I'll never forget when she walked in. She's wearing cowboy boots, a very short skirt, a wild fur coat and a fireman's hat. Her hair's stickin' straight out on the side. She's got these big glasses and this big guitar case—she's like 5'3\" and it's almost as big as she is. Even in San Francisco she stood out.[10]",
         "The band was named Ace of Cups by their manager, astrologer Ambrose Hollingworth, after the Ace of Cups tarot card, which shows a cup with five streams of water. He told the women that the streams represented the five of them, and that they should \"go with the flow\" to see where the music would take them.[11]\n"
      ]
   },
   "External links": {},
   "Further reading": {},
   "Late 1960s": {
      "text": [
         "Ace of Cups made their debut in the early spring of 1967. In late June, Jimi Hendrix invited the band to open for him at a free concert in Golden Gate Park.[13] In London that December, Hendrix told Melody Maker:\n",
         "\"I heard some groovy sounds last time in the States, like this girl group, Ace of Cups, who write their own songs and the lead guitarist is hell, really great.\"[14]\n",
         "In San Francisco, Polte had the Ace of Cups and Quicksilver playing regularly, the Cups headlining at smaller clubs such as The Matrix and performing as the opening act at larger venues such as the Avalon Ballroom and the Fillmore.[15] In mid-1968, the band appeared on a local television program, West Pole, along with San Francisco legends Jefferson Airplane and the Grateful Dead.[16]  In 1969, they opened for The Band's first concert as The Band along with The Sons of Champlin.[17]\n",
         "Several record companies were interested in signing Ace of Cups, but Hollingworth and then Polte felt the band was worth more than the record companies were offering. Also, some of the band members were concerned that a record contract might require the band to tour, and they were worried that family pressures would interfere. Consequently, Ace of Cups never made any professional recordings of their own,[18] although in 1969 they contributed vocals to Jefferson Airplane's Volunteers, Mike Bloomfield's It's Not Killing Me, and Nick Gravenites' My Labors.[6] At the Altamont Speedway Free Festival that December, Kaufman (who had married saxophonist Noel Jewkes and was pregnant) was hit in the head by a beer can. Nobody knows who threw the can, but Ralph J. Gleason wrote, \"Hell's Angels played catch with full beer cans all afternoon\".[19] She suffered a fractured skull and needed emergency surgery to remove a piece of bone above her eye.[20]\n"
      ]
   },
   "Notes": {},
   "Sections": [
      "1 Background",
      "1.1 Management",
      "2 Late 1960s",
      "3 1970s",
      "4 2000s",
      "5 2010s",
      "6 See also",
      "7 Notes",
      "8 Further reading",
      "9 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "Ace of Cups is an American rock band formed in San Francisco in 1967 during the Summer of Love era.[1] It has been described as one of the first all-female rock bands.[2][3][4][5]\n",
         "The members of Ace of Cups were Mary Gannon (bass), Marla Hunt (organ, piano), Denise Kaufman (guitar, harmonica), Mary Ellen Simpson (lead guitar), and Diane Vitalich (drums). Lead vocals were sung by all members of the band except Vitalich, and all five sang backup. The songwriting, too, was divided among the band members.[6]\n"
      ]
   },
   "Title": "The Ace of Cups - Wikipedia"
}