{
   "Name": "The Ace of Cups",
   "rawData": [
      "Ace of Cups is an American rock band formed in San Francisco in 1967 during the Summer of Love era. It has been described as one of the first all-female rock bands.\n",
      "The members of Ace of Cups were Mary Gannon (bass), Marla Hunt (organ, piano), Denise Kaufman (guitar, harmonica), Mary Ellen Simpson (lead guitar), and Diane Vitalich (drums). Lead vocals were sung by all members of the band except Vitalich, and all five sang backup. The songwriting, too, was divided among the band members.\n",
      "Gannon was born in New York and moved to San Francisco in the early 1960s. She played bass for a short while in a band called Daemon Lover. Hunt, who had grown up in Los Angeles, had been playing the piano since she was three. Like Gannon, she also moved to San Francisco in the early 1960s. Hunt was introduced to Gannon through a mutual friend, and Gannon suggested that they form an all-female rock band.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Rock, R&B, folk rock"
      ],
      "Years active": [
         "1967–1972, 2017–present"
      ],
      "Labels": [
         "High Moon"
      ],
      "Website": [
         "Official website "
      ],
      "Past members": [
         "Mary Gannon",
         "Marla Hunt",
         "Mary Ellen Simpson",
         "Diane Vitalich",
         "Denise Kaufman",
         "—",
         "Joe Allegra",
         "Jerry Granelli",
         "Noel Jewkes",
         "Lolly Lewis"
      ]
   },
   "albums": [],
   "prunedData": [
      "Ace of Cups is an [GENRE] band formed in San Francisco in [YEAR] during the Summer of Love era. It has been described as one of the first all-female rock bands.\n",
      "The members of Ace of Cups were [MONTH]y Gannon (bass), [MONTH]la Hunt (organ, piano), Denise Kaufman (guitar, harmonica), [MONTH]y [PERSON_NAME_FULL_0_FEMALE] (lead guitar), and [PERSON_NAME_FULL_1_FEMALE] (drums). Lead vocals were sung by all members of the band except [PERSON_NAME_LAST_1], and all five sang backup. The songwriting, too, was divided among the band members.\n",
      "Gannon was born in New York and moved to San Francisco in the early [YEAR]s. She played bass for a [GENRE] a band called Daemon Lover. Hunt, who had grown up in Los Angeles, had been playing the piano since she was three. Like Gannon, she also moved to San Francisco in the early [YEAR]s. Hunt was introduced to Gannon through a mutual friend, and Gannon suggested that they form an all-female rock band.\n"
   ]
}