{
   "Name": "The Aces (indie pop band)",
   "Sections": [
      "1 Career",
      "1.1 Origin",
      "1.2 As the Blue Aces (2012–2014)",
      "1.3 I Don't Like Being Honest (2014–2017)",
      "1.4 When My Heart Felt Volcanic (2018–2019)",
      "1.5 Under My Influence (2020–present)",
      "2 Band members",
      "3 Musical style",
      "4 Discography",
      "4.1 Albums",
      "4.2 Extended plays",
      "4.3 Singles",
      "4.4 Music videos",
      "5 Tours",
      "5.1 Headlining",
      "5.2 Opening act",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "The Aces (formerly The Blue Aces) are an American alternative pop band from Provo, Utah.[1] The band has four members: guitarist Katie Henderson, bassist McKenna Petty, and sisters Alisa Ramirez (drums) and Cristal Ramirez (lead vocals and guitars).[2]\n",
         "Their first single as The Aces, \"Stuck\", was released in 2016, eventually reaching #38 on the Billboard Alternative Songs chart in late 2017.[3][4] The band's second single, \"Physical\", was released in 2017 in advance of their debut EP I Don’t Like Being Honest.[5][6] The band is signed to Red Bull Records. The band's debut album When My Heart Felt Volcanic was released on April 6, 2018.[7] The Aces worked with six producers on the records, but Dan Gibson and Simon Oscroft were particularly influential, being involved in half of the material.[8]\n",
         "The Aces joined 5 Seconds of Summer for their Meet You There Tour, in support of their third album, Youngblood (2018). Following this tour, they embarked on their own North American headlining tour in support of When My Heart Felt Volcanic, the Waiting For You Tour.\n"
      ]
   },
   "Career": {
      "Origin": {
         "text": [
            "The Aces began when sisters Cristal and Alisa Ramirez were eight years old. Although neither sister recalls exactly when their musical career visions began, the Ramirez sisters were raised in a music-loving household where their father would dance salsa with them and their mother played 1980s pop artists like Whitney Houston and Michael Jackson.[9] With a piqued interest, they began to jam out while studying and taking notes from their favorite bands on YouTube.\n",
            "One Christmas season, the sisters asked their best friend, McKenna Petty, to ask for a bass for Christmas. Soon after, the trio, all self-taught, formed the Blue Aces. They began to jam and experiment in their neighbor's garage. In 2008 the band was officially formed when Petty's friend, Katie Henderson, joined the group.[10] Collectively, The Aces began to sharpen their talents and get their raw exposure throughout high school while performing locally at venues and bars. Over the years, as they expanded their presence within their local music scene they were listed on the “Top 10 Best Bands in Provo” by Provo Buzz and “10 Best Utah Bands You Should Know” by Paste Magazine.[11] In 2014, the girls decided to professionally pursue a musical career after watching 18 year old singer, songwriter Lorde win her first Grammy.[12]\n",
            "With no industry ties, the girls began their hunt for professional connections first starting by working with accomplished producers. Particularly the key to buzz surrounding them, record labels soon came calling for them. In 2016, Red Bull Records signed them.\n"
         ]
      },
      "As the Blue Aces (2012–2014)": {
         "text": [
            "Katie Henderson, McKenna Petty, Alisa Ramirez, and Cristal Ramirez started as the Blue Aces in 2012. They released two EPs as the Blue Aces before they changed their name to The Aces.\n"
         ]
      },
      "I Don't Like Being Honest (2014–2017)": {
         "text": [
            "In 2016, they wrote two songs independently: \"Volcanic Love\" and \"Stuck\". Soon after, The Aces were signed with Red Bull Records and the band embarked on songwriting and recording sessions.\n",
            "On June 23, 2017, the band's debut EP (under the new name), I Don't Like Being Honest, was released. Their debut single, \"Stuck\", reached No. 38 on the Billboard Alternative Songs chart.[3] During SXSW they performed at Nylon, Noisey, Rachael Ray's Feedback House, and Quantum Collective's SX Invasion. For the rest of 2017, The Aces found themselves sharing the stage with alternative bands such as Joywave and Portugal. The Man.[13]\n"
         ]
      },
      "When My Heart Felt Volcanic (2018–2019)": {
         "text": [
            "Early February 2018, The Aces teased their upcoming debut album. To celebrate, they announced their tour with indie pop band, Coin. Two months later, on April 6, 2018, The Aces released When My Heart Felt Volcanic. On May 16, 2018, The band performed on Seth Meyer's Late Night Show. Their song “Strong Enough” was featured on the soundtrack of NBA 2K20\n",
            "The Aces were announced as the opening act for 5 Seconds of Summer's Meet You There World Tour. Subsequently, they announced their first ever headlining tours in the US and Europe, When My Heart Felt Volcanic, the Waiting For You Tour. They played festival stages and larger venues for the rest of 2018 and early 2019.\n"
         ]
      },
      "Under My Influence (2020–present)": {
         "text": [
            "On March 4, 2020, The Aces released their first single of their second LP, titled \"Daydream\". A music video for the song was released on March 24, 2020.[14]\n",
            "On April 6, 2020, the second single was released, titled \"Lost Angeles\". On May 6, 2020, The Aces revealed the title and track listing of the album, Under My Influence, along with the release of a third single, \"My Phone is Trying to Kill Me\". \n",
            "Their fourth single from Under My Influence, \"Kelly\" was released on June 1, 2020. \"Kelly,\" which is explicitly queer, is the first of the band's songs to use gendered pronouns. Cristal and Alisa Ramirez commented that while they had not been consciously avoiding gendered pronouns, the band, in which three of four members are queer, had previously not been ready to \"step into that space [...] as artists.\"[15]\n",
            "Under My Influence was originally slated for release on June 12, 2020.[16][17] However, on June 7, the band announced that the album would be delayed in response to the George Floyd protests.[18] The band's official website revealed the new release date as July 17, 2020.[19]\n"
         ]
      }
   },
   "Band members": {
      "text": [
         "The Aces consists of Katie Henderson, McKenna Petty, Alisa Ramirez, and Cristal Ramirez. The band started while they were all in school together. Sisters Cristal and Alisa Ramirez, along with their best friends, decided to turn their musical after school get-togethers into a career.\n"
      ]
   },
   "Musical style": {
      "text": [
         "The Aces have cited as musical and career influences Paramore, Earth Wind and Fire, the Beatles, New Order, Depeche Mode, Michael Jackson and Weezer.[20]\n",
         "The Aces musical style has been described as indie pop and alternative pop. They are an all-girl band and members have expressed the desire to break the idea of the \"girl band/girl group\" genre. The media has often looked at gender first rather than their music when referring to The Aces. Cristal Ramirez said in an interview with Capitol Sound DC, \"we are just a band! I don’t see why people have to see gender all the time and make it a thing. But at the same time, it is unique and it is a strength of ours that we are all women. We wanna inspire other girls and we get that all the time –fans coming up to us and being like ‘oh my gosh you guys are so inspiring I wanna be in the music industry’ or ‘I wanna start a band.'\"[21]\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Extended plays": {},
      "Singles": {},
      "Music videos": {}
   },
   "Tours": {
      "Headlining": {},
      "Opening act": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Aces (formerly The Blue Aces) are an American alternative pop band from Provo, Utah.[1] The band has four members: guitarist Katie Henderson, bassist McKenna Petty, and sisters Alisa Ramirez (drums) and Cristal Ramirez (lead vocals and guitars).[2]\n",
      "Their first single as The Aces, \"Stuck\", was released in 2016, eventually reaching #38 on the Billboard Alternative Songs chart in late 2017.[3][4] The band's second single, \"Physical\", was released in 2017 in advance of their debut EP I Don’t Like Being Honest.[5][6] The band is signed to Red Bull Records. The band's debut album When My Heart Felt Volcanic was released on April 6, 2018.[7] The Aces worked with six producers on the records, but Dan Gibson and Simon Oscroft were particularly influential, being involved in half of the material.[8]\n",
      "The Aces joined 5 Seconds of Summer for their Meet You There Tour, in support of their third album, Youngblood (2018). Following this tour, they embarked on their own North American headlining tour in support of When My Heart Felt Volcanic, the Waiting For You Tour.\n",
      "The Aces began when sisters Cristal and Alisa Ramirez were eight years old. Although neither sister recalls exactly when their musical career visions began, the Ramirez sisters were raised in a music-loving household where their father would dance salsa with them and their mother played 1980s pop artists like Whitney Houston and Michael Jackson.[9] With a piqued interest, they began to jam out while studying and taking notes from their favorite bands on YouTube.\n"
   ]
}