{
   "Name": "Audrey (band)",
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Audrey is a Swedish four-piece post-rock band formed in Henån, Sweden in 2001.\n"
      ]
   },
   "History": {
      "text": [
         "The band first formed in a run-down music house that was going to be demolished during their time there. According to the band there were mice running on the floor and the pipes were frozen. In this harsh environment they started playing together. After Rebecka Kristiansson and Victoria Skoglund graduated from high school they decided to move to Gothenburg. Anna and Emelie followed shortly and Gothenburg opened up some new opportunities for them, the city providing a larger scene and audience.\n",
         "In Gothenburg they came in contact with some other musicians, whom later helped them record a demo in the studio of an artist's collective in the summer of 2003. The demo helped them get more live shows in Sweden.\n",
         "Later they recorded an EP in Gothenburg, that would set them on the path to many tours, mostly in Germany. A record company wanted to release their EP and they performed their first show in Germany in Hamburg.\n",
         "Their debut album, Visible Forms, was released in 2006.[1][2] On this album they took in some outside inspiration from Paul Bothén. He had produced other artists like Kristofer Åström and The Bear Quartet. Visible Forms was recorded at Element Studios in Gårda, Gothenburg. They held the release party at Haga Teatern in Gothenburg in May 2006. It was released on A Tenderversion Recording, a label started by Martin Lundmark (otherwise known as bassist in September Malevolence).\n",
         "The following years Audrey mostly toured around in Europe. After performing many shows they went to record yet another record and this time they wanted to do produce it themselves. But rehearsing had become a problem because the band members had moved to different cities around Sweden. Victoria Skoglund first moved to Västerås, then Emelie Molin moved to Stockholm. Still the heart of their music stayed in Gothenburg, but it would sooner rather than later be moved to Malmö. They prepared for second album by recording with a friend Nicklas Sandström, in his basement outside of Västerås. Nicklas had joined the band briefly during the first Visible Forms tour, but now he helped them with recording a demo before the real album was to be recorded with Mathias Oldén at Mission Hall Studio in Sebbarp. The Fierce and the Longing was recorded during two weeks during Christmas 2007.\n",
         "To bind together all of the cities they now lived in, Victoria having moved to Malmö, they held three release parties in Malmö, Gothenburg and Stockholm in spring 2008. A lot of touring followed this album too and they played in a lot of new countries in Europe. In April 2009 they went to Japan, where Zankyo Records released their albums.\n",
         "All of the artwork presented with the records is created by Victoria Skoglund.\n"
      ]
   },
   "Members": {},
   "Discography": {
      "text": [
         "Both albums released on the label A Tenderversion Recording, the Audrey EP and the album Visible Forms were released in Germany, Austria, Switzerland via Sinnbusrecords\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Audrey is a Swedish four-piece post-rock band formed in Henån, Sweden in 2001.\n",
      "The band first formed in a run-down music house that was going to be demolished during their time there. According to the band there were mice running on the floor and the pipes were frozen. In this harsh environment they started playing together. After Rebecka Kristiansson and Victoria Skoglund graduated from high school they decided to move to Gothenburg. Anna and Emelie followed shortly and Gothenburg opened up some new opportunities for them, the city providing a larger scene and audience.\n",
      "In Gothenburg they came in contact with some other musicians, whom later helped them record a demo in the studio of an artist's collective in the summer of 2003. The demo helped them get more live shows in Sweden.\n",
      "Later they recorded an EP in Gothenburg, that would set them on the path to many tours, mostly in Germany. A record company wanted to release their EP and they performed their first show in Germany in Hamburg.\n"
   ],
   "infobox": {
      "Origin": [
         "Henån, Orust, Sweden"
      ],
      "Genres": [
         "Post-rock, experimental rock, instrumental rock"
      ],
      "Years active": [
         "2001–present"
      ],
      "Labels": [
         "A Tenderversion Recording, Sinnbusrecords, Zankyo Records"
      ],
      "Associated acts": [
         "Kristofer Åström, The Bear Quartet, Mire Kay"
      ],
      "Website": [
         "audrey.se"
      ],
      "Members": [
         "Victoria Skoglund",
         "Anna Tomlin",
         "Emelie Molin",
         "Rebecka Kristiansson"
      ]
   }
}