{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "After playing in several bands throughout their teens, Oni with an instrumental trio called Hankoki and Pikachu with a psychedelic quartet of girls called Z, the pair started Afrirampo in the spring of 2002 at the ages of 18 and 19.[1] The band started out using a pair of Casio synthesizers before adopting the guitar/drum format that they became known for.[2]\n",
         "The period of 2002-2005 saw Afrirampo's visibility within the ranks of contemporary noise rock increasing in a manner that Matthew Murphy of Pitchfork described as \"meteoric\".[3]  This might be attributed to their powerful stage presence, and hyper-energized live performances which generated considerable interest within the alternative music press.[1]\n",
         "The duo put out a few independent releases in their in the 2002-2004 period, notably the album A.  During the same period of time, they played extensively in Japan, played their first shows in the US, toured Europe with Sonic Youth and spent some time in Cameroon with the Baka pygmy tribe.\n",
         "In 2005, they had a particularly productive year, including their major-label Japanese debut Urusa in Japan, the album Kore Ga Mayaku Da on the New Yorked-based Tzadik (record label), and a collaboration with Acid Mothers Temple entitled We Are Acid Mothers Afrirampo!  In the same year, they performed at All Tomorrow's Parties, the avant-garde music festival curated by Vincent Gallo, and joined performance artist Yoko Ono on stage for her closing piece.\n",
         "2006 saw the release of their album Baka Ga Kita, which was recorded during the 2004 Cameroon visit.  This album consisted mostly of a cappella chants recorded by Afrirampo with members of the Baka tribe, and features no electric guitar.\n",
         "In early 2007, they canceled some shows and took a break for several months, due to Oni's pregnancy. Later that year, they released Suuto Breakor, which showed their style becoming more complex, melodic and ethereal, with more noticeable African influences than their other electric releases, although the music still contained healthy doses of noise.\n",
         "The band did not release any more albums for the rest of the decade, although they did continue to play live extensively, both inside and outside of Japan.\n",
         "In 2010, they released their final studio album to date, the double album We Are Uchu No Ko. While this release saw a return to the band's original noise-punk on some songs, it also showcased the band's growing musical complexity and influenced of psychedelia and world music.  \n",
         "In June 2010, Afrirampo announced that they would be disbanding after their final show in Osaka on June 26.[4]  However, their homepage stated in Japanese that if the \"Mother of Heaven\" called upon them to play together again, they would play.  In the English version, they stated \"If our mother of monster say \"PLAY!PLAY!together!!\", then we will play,\" indicating that the door was open for future reunions.\n",
         "After breaking up, Afrirampo did a special \"Bye-bye Matsuri\" performance on July 26, 2010, a month after their supposed final show, in which members of the Osaka underground music scene appeared with them onstage. In 2011, they released a live CD/DVD entitled Never Ending Afrirampo, which consists of material from the last official performance on June 26, 2010, as well as some clips from the \"Bye-bye Matsuri\" performance on July 26, 2010.  During their hiatus, the band also maintained their website and appeared in each other's solo shows.\n",
         "It was announced on their official website that the band were reforming in March 2016 after six years of hiatus to embark on a reunion tour in Japan.[5] Since then, they have continued to play live in Japan and abroad and have introduced new songs to their sets. In August 2018, they announced their first studio album since 2010, to be entitled Afriverse. [6] The album was released on September 18, 2018.\n"
      ]
   },
   "Musical Style": {
      "text": [
         "Afrirampo's music often features call and response vocals, catchy distorted pop melodies, looping fret noise, droning feedback, guttural barks and impromptu squealing. Their early albums featured a sound that could be described as noise-punk, albeit with surprisingly melodic vocal parts, along with some longer, less melodic improvised jam pieces.  Their later albums, especially Suuto Breakor and We Are Uchu No Ko, featured a much more expansive sound, sometimes with very long songs and quieter, more ethereal passages.  The band's later albums featured noticeable elements of African music, with a tribal percussive sound and call-and-response vocals.  This derived in part from a 2004 stay with pygmy tribes in Cameroon documented on their 2006 album Baka Ga Kita.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Musical Style",
      "2 History",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Afrirampo (あふりらんぽ, Afuriranpo) is a band from Osaka, Japan. The band was active from 2002 to 2010 and announced a reform in 2016. The members are Oni (guitar, vocals) and Pikachu (drums, vocals). Afrirampo has toured with Sonic Youth and Lightning Bolt, played with Yoko Ono collaborated with Acid Mothers Temple and released several CDs on various labels.\n"
      ]
   },
   "Title": "Afrirampo - Wikipedia"
}