{
   "Name": "Afrirampo",
   "rawData": [
      "Afrirampo (あふりらんぽ, Afuriranpo) is a band from Osaka, Japan. The band was active from 2002 to 2010 and announced a reform in 2016. The members are Oni (guitar, vocals) and Pikachu (drums, vocals). Afrirampo has toured with Sonic Youth and Lightning Bolt, played with Yoko Ono collaborated with Acid Mothers Temple and released several CDs on various labels.\n",
      "Afrirampo's music often features call and response vocals, catchy distorted pop melodies, looping fret noise, droning feedback, guttural barks and impromptu squealing. Their early albums featured a sound that could be described as noise-punk, albeit with surprisingly melodic vocal parts, along with some longer, less melodic improvised jam pieces.  Their later albums, especially Suuto Breakor and We Are Uchu No Ko, featured a much more expansive sound, sometimes with very long songs and quieter, more ethereal passages.  The band's later albums featured noticeable elements of African music, with a tribal percussive sound and call-and-response vocals.  This derived in part from a 2004 stay with pygmy tribes in Cameroon documented on their 2006 album Baka Ga Kita.\n",
      "After playing in several bands throughout their teens, Oni with an instrumental trio called Hankoki and Pikachu with a psychedelic quartet of girls called Z, the pair started Afrirampo in the spring of 2002 at the ages of 18 and 19. The band started out using a pair of Casio synthesizers before adopting the guitar/drum format that they became known for.\n"
   ],
   "infobox": {
      "Origin": [
         "Osaka, Japan"
      ],
      "Genres": [
         "Punk rock",
         "Noise rock",
         "Psychedelic rock",
         "Japanoise",
         "Alternative rock",
         "Garage rock"
      ],
      "Years active": [
         "2002-2010,",
         "2016-Present"
      ],
      "Website": [
         "http://afrirampo.net"
      ],
      "Members": [
         "Oni (Beppin) ",
         " Pikachu (Yasashii)"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (あふりらんぽ, Afuriranpo) is a [GENRE] band was active from [YEAR] to [YEAR] and announced a reform in [YEAR]. The members are Oni (guitar, vocals) and Pikachu (drums, vocals). [BAND_NAME] has toured with Sonic Youth and Lightning Bolt, played with [PERSON_NAME_FULL_0_FEMALE] collaborated with Acid Mothers Temple and released several CDs on various labels.\n",
      "[BAND_NAME]'s music often features call and response vocals, catchy distorted pop melodies, looping fret noise, droning feedback, guttural barks and impromptu squealing. Their early albums featured a [GENRE] a much more expansive sound, sometimes with very long songs and quieter, more ethereal passages.  The band's later albums featured noticeable elements of African music, with a tribal percussive sound and call-and-response vocals.  This derived in part from a [YEAR] stay with pygmy tribes in Cameroon documented on their [YEAR] album Baka Ga Kita.\n",
      "After playing in several bands throughout their teens, Oni with an [GENRE] a psychedelic quartet of girls called Z, the pair started [BAND_NAME] in the spring of [YEAR] at the ages of 18 and 19. The band started out using a pair of Casio synthesizers before adopting the guitar/drum format that they became known for.\n"
   ]
}