{
   "Name": "All Girl Summer Fun Band",
   "rawData": [
      "All Girl Summer Fun Band is an American, Portland based twee-pop band, initially composed of Kim Baxter, Kathy Foster, Jen Sbragia, and Ari Douangpanya.\n",
      "Baxter met Sbragia after a Softies show, when Baxter gave Sbragia a tape of her music. That summer, Baxter asked each of the girls if they wanted to start an \"all girl summer fun band.\" Although the other three hadn't met before, they all agreed, and the band was formed. After releasing an EP and several singles, they joined K Records. K released two albums for the band, an eponymous debut and the follow-up 2, before Douangpanya left the band in 2005 to raise her son. The remaining members continued as a three-piece. On September 23, 2008, the band released their third full-length album.\n",
      "The members of AGSFB have played in various other bands, most notably Foster in The Thermals and Sbragia in The Softies, amongst others. The members of the band also work at Portland's Rock and Roll Camp for Girls.\n"
   ],
   "infobox": {
      "Also known as": [
         "AGSFB"
      ],
      "Origin": [
         "Portland, Oregon, U.S."
      ],
      "Genres": [
         "Indie pop, twee pop"
      ],
      "Years active": [
         "1998–present"
      ],
      "Labels": [
         "K Records, Magic Marker, AGSFB Music"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Kim Baxter",
         "Kathy Foster",
         "Jen Sbragia"
      ],
      "Past members": [
         "Ari Douangpanya"
      ]
   },
   "albums": [
      "All Girl Summer Fun Band",
      "2",
      "Looking Into It"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band, initially composed of [PERSON_NAME_FULL_1_FEMALE], Kathy Foster, [PERSON_NAME_FULL_0_FEMALE], and [PERSON_NAME_FULL_2_MALE].\n",
      "Baxter met Sbragia after a [GENRE] a tape of her music. That summer, Baxter asked each of the girls if they wanted to start an [SONG_NAME] Although the other three hadn't met before, they all agreed, and the band was formed. After releasing an EP and several singles, they joined K Records. K released two albums for the band, an eponymous debut and the follow-up 2, before Douangpanya left the band in [YEAR] to raise her son. The remaining members continued as a three-piece. On [MONTH] 23, [YEAR], the band released their third full-length album.\n",
      "The members of AGSFB have played in various other bands, most notably Foster in The Thermals and Sbragia in The Softies, amongst others. The members of the band also work at Portland's Rock and Roll Camp for Girls.\n"
   ]
}