{
   "Charted songs": {},
   "Discography": {},
   "History": {
      "text": [
         "The band was originally going to be called Cat Food but instead chose Dandelion due to the guitarist Carl Hinds reading Ray Bradbury's novel \"Dandelion Wine\". In 1990, Dandelion recorded a demo tape called Silver that was reviewed by CMJ magazine and received a Jackpot pick, being only the second demo to receive that honor.[citation needed] The tape attracted the attention of Ruffhouse Records, a label based in nearby Conshohocken and home to various hip-hop groups like The Goats, Cypress Hill, Schoolly D, and The Fugees. The song \"Waiting for a Ride\" was released as a single the following year. They also released two full-length albums: I Think I'm Gonna Be Sick (Columbia/Ruffhouse) in 1993, and Dyslexicon (Sony) in 1995. Bayen Butler left the band before the release of Dyslexicon and formed the band Shag.\n",
         "Dandelion's music was featured on MTV, as videos for the songs \"Waiting for a Ride\", \"Under My Skin\", and \"Weird-Out\" entered late night rotation. The band's music was also featured on MTV shows The Real World and Beavis & Butt-head, as well as the Edward Furlong movie Brainscan.[3] However, national fame eluded the band as their albums were released during the time of grunge's decline in popularity. Dandelion disbanded in 1996.\n",
         "In 1997, Kevin Morpurgo joined other Philadelphia band, Latimer, on second guitar, and Gel Caps, on bass. In 2000, he moved to London, England to form bassless noise/blues power trio The Hells.[citation needed] In 2010 he joined London noise behemoths Dethscalator.[4] Mike Morpurgo, after working on the soundtrack of Abel Ferrara's 1998 film New Rose Hotel, played bass for The Cobbs and Loog. He formed his own band Laguardia in 2000 and is also the owner of three franchises of School of Rock in Pennsylvania and New Jersey.[citation needed] Carl Hinds moved to Portland, Oregon and formed the bands Blackheart Whitenoise and The Hell Yeahs.[citation needed] Dante Cimino formed a project called Rudy & Blitz with Chad Ginsburg of CKY, which recorded an unreleased album. Cimino has also recorded three albums with the surf/rockabilly band Custom D.[citation needed]\n",
         "Both the Morpurgo brothers graduated from Neshaminy High School in Langhorne, PA. Most likely in 1986 or 1987.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Charted songs",
      "3 Discography",
      "4 References"
   ],
   "Summary": {
      "text": [
         "Dandelion was an alternative Rock band from Philadelphia, Pennsylvania formed in 1989 by vocalist/guitarist Kevin Morpurgo, bassist Mike Morpurgo, guitarist Carl Hinds, and drummer Dante Cimino.[1] Bayen Butler was also a member in 1993-94.[2] Due to their sound and image, Dandelion is often associated with the grunge movement of the late 1980s and early 1990s from Seattle.\n"
      ]
   },
   "Title": "Dandelion (American band) - Wikipedia"
}