{
   "Name": "Diego's Umbrella",
   "Sections": [
      "1 History",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Diego's Umbrella is an American gypsy rock band consisting of five members from San Francisco, California. They are celebrated as San Francisco's Ambassadors of Gypsy Rock.[1] The current members of the group include Vaughn Lindstrom (acoustic guitar, vocals), Jason Kleinberg (fiddle, vocals), Kevin Gautschi (electric guitar, vocals), Redcup (bass), and Jake Wood (drums). Former members include Tyson Maulhardt (electric guitar), Kevin Blair (bass), and Ben León (electric guitar, vocals). \n",
         "Diego's Umbrella describe their own music as \"a blend of traditional eastern European gypsy, Spanish flamenco, polka/ska rhythms, and good ol' rock & roll from the west. \n"
      ]
   },
   "History": {
      "text": [
         "The seed for Diego's Umbrella was planted by Tyson Maulhardt and Vaughn Lindstrom in 2001, who released a few albums on their own. The band slowly grew with the additions of violinist Jason Kleinberg, bassist Kevin Blair, singer Benjamin Leon, and drummer Jake Wood. With this configuration they created the signature \"gypsy pirate polka\" sound they are now known for.[2] Benjamin Leon, in an interview explained their beginnings: \"I've been playing music since I was about 6 years old, from piano to drums, and then later I picked up guitar and started singing. I’ve known Tyson and Vaughn for about ten years, but I was playing in my own group in Los Angeles for most of that time. They knew I was burning out in LA so they kidnapped me at a Pinkberry in 2008 and we’ve been riding around in a van together ever since.\"[3] Their quirky namesake comes from a friend's arm tattoo.[4]\n",
         "The group has released five full-length albums: Kung Fu Palace, Viva La Juerga, Double Panther, Proper Cowboy, and Edjka.[5] In the summer of 2011, they released Richardson b/w Downtown EP on Ninth Street Opus in conjunction with their first appearance at Outside Lands Music and Arts Festival.[6]  They have also played at the High Sierra Music Festival,[7] Musikfest,[8] SXSW,[9] and have played over 1,000 live shows.[4] They have shared the stage with Dengue Fever, Gogol Bordello, Matisyahu, MarchFourth!, Metalachi, Muse, Deadmau5, Jeff Goldblum, and the Foo Fighters.[10]\n",
         "Several of their songs were also featured in the X-Dance-award-winning documentary Sofia, the Quiksilver/Roxy surf DVD Shimmer, as well as CBSd Elimination Station. Diego’s Umbrella also performs three songs in the Lionsgate comedy Still Waiting....[4][dead link]\n",
         "The band has been likened to \"Gogol Bordello meets Muse\" by the Associated Press. Newsreview says, \"With guitars straight out of a Tarantino movie, the group seamlessly blends mariachi, gypsy, flamenco and ska into one beer-soaked fiesta, with song topics varying from heartache to revolution.\"[11]\n",
         "In an interview with Metrojolt at Outside Lands they spoke openly about Jason Kleinberg as the last living unicorn, Laura Bush's kinky disposition, cultural influences, rumors, and how two million fans might just be wrong about Diego’s Umbrella’s heterosexuality. Tyson Maulhardt spoke of their very mixed cultural influences, saying \"we've done a lot of traveling in Eastern Europe and we've traveled throughout Spain and what not. We've picked up a lot of stuff along the way and incorporated it into our Gringo-esque rock music.\"[12]\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Diego's Umbrella is an American gypsy rock band consisting of five members from San Francisco, California. They are celebrated as San Francisco's Ambassadors of Gypsy Rock.[1] The current members of the group include Vaughn Lindstrom (acoustic guitar, vocals), Jason Kleinberg (fiddle, vocals), Kevin Gautschi (electric guitar, vocals), Redcup (bass), and Jake Wood (drums). Former members include Tyson Maulhardt (electric guitar), Kevin Blair (bass), and Ben León (electric guitar, vocals). \n",
      "Diego's Umbrella describe their own music as \"a blend of traditional eastern European gypsy, Spanish flamenco, polka/ska rhythms, and good ol' rock & roll from the west. \n",
      "The seed for Diego's Umbrella was planted by Tyson Maulhardt and Vaughn Lindstrom in 2001, who released a few albums on their own. The band slowly grew with the additions of violinist Jason Kleinberg, bassist Kevin Blair, singer Benjamin Leon, and drummer Jake Wood. With this configuration they created the signature \"gypsy pirate polka\" sound they are now known for.[2] Benjamin Leon, in an interview explained their beginnings: \"I've been playing music since I was about 6 years old, from piano to drums, and then later I picked up guitar and started singing. I’ve known Tyson and Vaughn for about ten years, but I was playing in my own group in Los Angeles for most of that time. They knew I was burning out in LA so they kidnapped me at a Pinkberry in 2008 and we’ve been riding around in a van together ever since.\"[3] Their quirky namesake comes from a friend's arm tattoo.[4]\n",
      "The group has released five full-length albums: Kung Fu Palace, Viva La Juerga, Double Panther, Proper Cowboy, and Edjka.[5] In the summer of 2011, they released Richardson b/w Downtown EP on Ninth Street Opus in conjunction with their first appearance at Outside Lands Music and Arts Festival.[6]  They have also played at the High Sierra Music Festival,[7] Musikfest,[8] SXSW,[9] and have played over 1,000 live shows.[4] They have shared the stage with Dengue Fever, Gogol Bordello, Matisyahu, MarchFourth!, Metalachi, Muse, Deadmau5, Jeff Goldblum, and the Foo Fighters.[10]\n"
   ]
}