{
   "Name": "Diego's Umbrella",
   "rawData": [
      "Diego's Umbrella is an American gypsy rock band consisting of five members from San Francisco, California. They are celebrated as San Francisco's Ambassadors of Gypsy Rock. The current members of the group include Vaughn Lindstrom (acoustic guitar, vocals), Jason Kleinberg (fiddle, vocals), Kevin Gautschi (electric guitar, vocals), Redcup (bass), and Jake Wood (drums). Former members include Tyson Maulhardt (electric guitar), Kevin Blair (bass), and Ben León (electric guitar, vocals). \n",
      "Diego's Umbrella describe their own music as \"a blend of traditional eastern European gypsy, Spanish flamenco, polka/ska rhythms, and good ol' rock & roll from the west. \n",
      "The seed for Diego's Umbrella was planted by Tyson Maulhardt and Vaughn Lindstrom in 2001, who released a few albums on their own. The band slowly grew with the additions of violinist Jason Kleinberg, bassist Kevin Blair, singer Benjamin Leon, and drummer Jake Wood. With this configuration they created the signature \"gypsy pirate polka\" sound they are now known for. Benjamin Leon, in an interview explained their beginnings: \"I've been playing music since I was about 6 years old, from piano to drums, and then later I picked up guitar and started singing. I’ve known Tyson and Vaughn for about ten years, but I was playing in my own group in Los Angeles for most of that time. They knew I was burning out in LA so they kidnapped me at a Pinkberry in 2008 and we’ve been riding around in a van together ever since.\" Their quirky namesake comes from a friend's arm tattoo.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Gypsy rock"
      ],
      "Years active": [
         "2001-present"
      ],
      "Labels": [
         "Hardline Entertainment"
      ],
      "Website": [
         "www.diegosumbrella.com"
      ],
      "Members": [
         "Kevin Gautschi",
         "Vaughn Lindstrom",
         "Red Cup",
         "Jason Kleinberg",
         "Jake Wood"
      ],
      "Past members": [
         "Tyson Maulhardt",
         "Kevin Blair",
         "Ben León"
      ]
   }
}