{
   "Name": "Amiina",
   "rawData": [
      "Amiina (formerly Amína, stylized in lowercase) is an Icelandic band composed of Hildur Ársælsdóttir (born January 31, 1980), Edda Rún Ólafsdóttir (born February 3, 1978), Maria Huld Markan Sigfúsdóttir (born September 29, 1980), and Sólrún Sumarliðadóttir (born August 10, 1977). They have frequently performed live and in the studio with Sigur Rós. In 2009 Magnús Trygvason Eliassen (born November 18, 1985) and Guðmundur Vignir Karlsson (a.k.a. Kippi Kaninus) (born November 10, 1978) joined the group on a permanent basis.\n",
      "Their music is made with a great number of instruments. It contains elements of minimalistic style, contemporary classical, ambient, and electronic loops. In their performances each member will play many instruments, sometimes moving across the stage, going from one instrument to another in mid-song.\n",
      "Before adopting the name amiina the group was initially a string quartet dating back to the late 1990s when they were studying string instruments at the Reykjavík College of Music. The group started out playing classical music, but increasingly moved on to play all sorts of music with various bands in Reykjavík: María and Hildur as violinists, Edda as violist, and Sólrún as cellist.\n"
   ],
   "infobox": {
      "Also known as": [
         "Amína"
      ],
      "Origin": [
         "Reykjavík, Iceland"
      ],
      "Genres": [
         "Indie pop, Minimalism, neoclassical, folk, ambient, post-rock"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Bláskjár, Ever, Kitchen Motors, Rumraket, Speak'n'spell, The Worker's Institute, Shake,"
      ],
      "Associated acts": [
         "Sigur Rós"
      ],
      "Website": [
         "www.amiina.com"
      ],
      "Members": [
         "Hildur Ársælsdóttir",
         "Edda Rún Ólafsdóttir",
         "Maria Huld Markan Sigfúsdóttir",
         "Sólrún Sumarliðadóttir",
         "Magnús Trygvason Eliassen",
         "Kippi Kaninus (Guðmundur Vignir Karlsson)"
      ]
   },
   "albums": [
      "Kurr",
      "Puzzle",
      "Fantômas"
   ]
}