{
   "Name": "The Aquanettas",
   "rawData": [
      "The Aquanettas were an all-female band from New York City that one New York Times writer said played \"classic, basic rock-and-roll: just rugged guitar riffs and lyrics about the more bothersome aspects of romance\". Their music was influenced by classic rock such as Led Zeppelin and punk bands such as X, mixed with surf rock overtones. The band was formed in the late 1980s in New York City, New York by vocalist Deborah Schwartz and Jill Richmond along with bassist Claudine Troise and drummer Stephanie Seymour. The Aquanettas toured nationally and secured a record deal with Canadian record label Nettwerk Productions who also distributed their recordings through IRS Records in the United States. They released one album for IRS/Nettwerk, two Independent EPs and release three singles before breaking up in 1995.\n",
      "Lead vocalist Deborah Schwartz had moved from Voorheesville to Manhattan in January 1986 after spending three months in Los Angeles, California where she met guitarist Jill Richmond. Schwartz began her career in New York with an experimental/performance art group called The Summit Ensemble. When Richmond joined her in New York one year later, they formed The Aquanettas along with bassist Claudine Troise and drummer Stephanie Seymour. It is reported that the band took their name from actress Burnu Acquanetta, who supposedly attended a Phoenix, Arizona show in 1990.\n",
      "When the band played the New Music Seminar in NYC they signed a deal with Canadian record label Nettwerk Productions (who distributed their albums through IRS Records in the United States) and toured nationally, including being a support act for Nine Inch Nails. Called \"a seminal all-female group from the early '90s\" by some writers, singer Joan Osborne has covered their songs in concert and is a fan, so much so she would later make Deborah Schwartz her first signing on her Womanly Hips label. After being dissatisfied with the lack of promotion that IRS Records was giving the band they asked to be let go and toured Europe on their own in support of their Indy releases. Jill Richmond would later say she became fond of using a certain slang term used for describing female genitalia while on tour in Great Britain. Their single, \"Mind Full of Worry\" is included on the soundtrack of Hal Hartley's 1994 film, Amateur, and in 1996 a remix of their song \"Beach Party\" was included on the soundtrack for the feature film Kissed, which was distributed by MGM in the United States.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, USA"
      ],
      "Genres": [
         "Post-punk, rock, alternative rock"
      ],
      "Years active": [
         "1987–1995"
      ],
      "Labels": [
         "IRS, Nettwerk, Giant/Rockville, Mayor Label, Prize Pagoda"
      ],
      "Associated acts": [
         "Birdy, The Mike Hunt Band"
      ],
      "Past members": [
         "Deborah Schwartz",
         "Jill Richmond",
         "Claudine Troise",
         "Stephanie Seymour"
      ]
   },
   "prunedData": [
      "[BAND_NAME] were an [GENRE] band from New York City that one New York Times writer said played \"classic, basic rock-and-roll: just rugged guitar riffs and lyrics about the more bothersome aspects of romance\". Their music was influenced by classic rock such as Led Zeppelin and punk bands such as X, mixed with surf rock overtones. The band was formed in the late [YEAR]s in New York City, New York by vocalist [PERSON_NAME_FULL_1_FEMALE] and Jill Richmond along with bassist [PERSON_NAME_FULL_0_FEMALE] and drummer Stephanie Seymour. [BAND_NAME] toured nationally and secured a record deal with Canadian record label Nettwerk Productions who also distributed their recordings through IRS Records in the United States. They released one album for IRS/Nettwerk, two Independent EPs and release three singles before breaking up in [YEAR].\n",
      "Lead vocalist [PERSON_NAME_FULL_1_FEMALE] had moved from Voorheesville to Manhattan in [MONTH] [YEAR] after spending three months in Los Angeles, California where she met guitarist Jill Richmond. [PERSON_NAME_LAST_1] began her career in New York with an experimental/performance art group called The Summit Ensemble. When Richmond joined her in New York one year later, they formed [BAND_NAME] along with bassist [PERSON_NAME_FULL_0_FEMALE] and drummer Stephanie Seymour. It is reported that the band took their name from actress Burnu Acquanetta, who supposedly attended a Phoenix, Arizona show in [YEAR].\n",
      "When the band played the New Music Seminar in NYC they signed a deal with Canadian record label Nettwerk Productions (who distributed their albums through IRS Records in the United States) and toured nationally, including being a support act for [PERSON_NAME_FULL_0_FEMALE]. Called \"a seminal all-female group from the early '90s\" by some writers, singer Joan Osborne has covered their songs in concert and is a fan, so much so she would later make [PERSON_NAME_FULL_1_FEMALE] her first signing on her Womanly Hips label. After being dissatisfied with the lack of promotion that IRS Records was giving the band they asked to be let go and toured Europe on their own in support of their Indy releases. Jill Richmond would later say she became fond of using a certain slang term used for describing female genitalia while on tour in Great Britain. Their single, \"Mind Full of Worry\" is included on the soundtrack of Hal Hartley's [YEAR] film, Amateur, and in [YEAR] a remix of their song \"Beach Party\" was included on the soundtrack for the feature film Kissed, which was distributed by MGM in the United States.\n"
   ]
}