{
   "Name": "Astarte (band)",
   "rawData": [
      "Astarte was an all-female black metal band from Athens, Greece, named after the goddess Astarte.\n",
      "Astarte first formed under the name Lloth in September 1995 at Athens, Attica. The original line-up included Maria \"Tristessa\" Kolokouri (bass, guitar, keyboards), who subsequently took over on lead vocals, Nemesis (guitar), and Kinthia (vocals, guitar). They had Psychoslaughter, the drummer from Greek band Invocation, play for the sessions on their demo, Dancing in the Dark Lakes of Evil, released as Lloth in 1997. Shortly thereafter they adopted the name Astarte, named after the Semitic goddess of sexuality. Their debut full-length album, Doomed Dark Years, appeared in 1998 on Black Lotus Records; two further LPs followed on the label. After lineup changes in which Nemesis and Kinthia left to be replaced by Katharsis (keyboards) and Hybris (guitar), they released their fourth and fifth albums on Avantgarde Music, the most recent of which, Demonized, was released in 2007. In 2003 the band participated in the Celtic Frost Tribute album Order of the Tyrants, released by Black Lotus Records, covering the song \"Sorrows Of The Moon\".\n",
      "On December 30, 2013, Maria Kolokouri's husband Nick Maiis released a statement revealing that she had leukemia and was critically ill. On August 9, 2014, Maiis posted another statement on behalf of his wife, saying that, while Maria had beaten the leukemia, the complications from the disease had caused her to take a turn for the worse and she was not expected to survive the day. Shortly afterwards another post was made to Tristessa's official Facebook page saying that she had just died.\n"
   ],
   "infobox": {
      "Also known as": [
         "Lloth"
      ],
      "Origin": [
         "Athens, Greece"
      ],
      "Genres": [
         "Black metal",
         "Blackened death metal"
      ],
      "Years active": [
         "1995–2014"
      ],
      "Labels": [
         "Black Lotus",
         "Avantgarde Music"
      ],
      "Members": [
         "Derketa",
         "Hybris",
         "Ice",
         "Lycon"
      ],
      "Past members": [
         "(see below)"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Athens, Greece, named after the goddess [BAND_NAME].\n",
      "[BAND_NAME] first formed under the name Lloth in [MONTH] [YEAR] at Athens, Attica. The original line-up included [MONTH]ia \"Tristessa\" Kolokouri (bass, guitar, keyboards), who subsequently took over on lead vocals, Nemesis (guitar), and Kinthia (vocals, guitar). They had Psychoslaughter, the drummer from Greek band Invocation, play for the sessions on their demo, Dancing in the Dark Lakes of Evil, released as Lloth in [YEAR]. Shortly thereafter they adopted the name [BAND_NAME], named after the Semitic goddess of sexuality. Their debut full-length album, Doomed Dark Years, appeared in [YEAR] on Black Lotus Records; two further LPs followed on the label. After lineup changes in which Nemesis and Kinthia left to be replaced by Katharsis (keyboards) and Hybris (guitar), they released their fourth and fifth albums on Avantgarde Music, the most recent of which, Demonized, was released in [YEAR]. In [YEAR] the band participated in the Celtic Frost Tribute album Order of the Tyrants, released by Black Lotus Records, covering the song \"Sorrows Of The Moon\".\n",
      "On [MONTH] 30, [YEAR], [MONTH]ia Kolokouri's husband Nick Maiis released a statement revealing that she had leukemia and was critically ill. On [MONTH] 9, [YEAR], Maiis posted another statement on behalf of his wife, saying that, while [MONTH]ia had beaten the leukemia, the complications from the disease had caused her to take a turn for the worse and she was not expected to survive the day. Shortly afterwards another post was made to Tristessa's official Facebook page saying that she had just died.\n"
   ]
}