{
   "Name": "The Dodos",
   "Sections": [
      "1 History",
      "1.1 Dodo Bird EP",
      "1.2 Beware of the Maniacs",
      "1.3 Visiter",
      "1.4 Time to Die",
      "1.5 No Color",
      "1.6 Carrier",
      "1.7 Individ",
      "1.8 Certainty Waves",
      "2 Equipment and playing techniques",
      "3 Members",
      "4 Discography",
      "4.1 Albums",
      "4.1.1 Notes",
      "4.2 Singles",
      "4.3 Special releases",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Dodos are an American indie rock band consisting of Meric Long and Logan Kroeber.\n"
      ]
   },
   "History": {
      "Dodo Bird EP": {
         "text": [
            "Long self-released a solo EP titled Dodo Bird in March 2006, in which Long played all the instruments.  While they performed the songs from this release, Long and Kroeber met and started playing together.  They worked to blend Kroeber's training in West African Ewe drumming and Long's experience in metal bands to create music in which \"drumming could be a center role and help bring out the syncopated rhythms coming out of the acoustic guitar.\"[4]\n"
         ]
      },
      "Beware of the Maniacs": {
         "text": [
            "The duo released the 2006 album Beware of the Maniacs, which was self-released under the \"Dodo Bird\" moniker.  In support of the album, Long and Kroeber toured relentlessly for most of 2007. The band began to receive critical attention and developed a growing fan base. Fans began referring to Dodo Bird simply as \"The Dodos\", and the band decided to change their name accordingly.\n"
         ]
      },
      "Visiter": {
         "text": [
            "In December 2007, the Dodos were signed by Frenchkiss Records and they released their second album Visiter in March 2008, to critical acclaim.[5]\n",
            "In an April 2008 interview in the L.A. Record, Long revealed the origin of the name of Visiter. \"The reason it’s misspelled is that it’s from a drawing this kid gave us. We played a show for a bunch of kids in South Central L.A.—Dorsey High. A friend’s sister [Barbara Lempel] is a special-ed teacher there, so we went down there to her class and we played for the kids and it was super fun. Then it came to the kids asking us questions and then one of the kids came up to us and he gave us a drawing with that written on it. The drawing is the cover actually of the album, and just—I dunno we liked it. Actually, we used all of the drawings that the kids made in the artwork on the album. It was definitely a fun, interesting venture for us. We’d never played for kids before—we didn’t know what to expect but they were clapping and dancing.\" [6]\n",
            "In 2009, the song \"Fools,\" also from the Visiter album, was featured in an advertisement for Miller Chill.[7]\n",
            "After the release of Visiter, the band included Joe Haener (formerly of The Gris Gris and Battleship) in its touring line-up, playing xylophone, toy piano and additional percussions.\n"
         ]
      },
      "Time to Die": {
         "text": [
            "Their album Time to Die was released for digital download on July 27, 2009, in the UK and July 28, 2009, in the US. The physical LP release was on August 31, 2009, in the UK and September 15, 2009, in the US. Joe Haener was replaced by Keaton Snyder during live performances.  Snyder became a third member of the recording band during this time, performing vibraphone on Time to Die. Following this release, The Dodos performed at Lollapalooza and Bonnaroo[8] in 2010.\n"
         ]
      },
      "No Color": {
         "text": [
            "The Dodos' fourth album, No Color, was released on March 15, 2011. It features vocal contributions from Neko Case. After recording with vibraphonist Snyder again, as Long told Pitchfork Media, \"listening to the different mixes-- one with vibraphone and one without-- we all just responded to it a little bit better when the vibraphone was off.\"[9]  The decision was made for the band to return to a duo of Long and Kroeber. As of March 24, 2011 the album has peaked at No. 70 on the US charts.[10] The autumn following the release of Carrier The Dodos performed \"Don't Try and Hide It\" with their former tourmate Neko Case as their guest on Late Night with Jimmy Fallon.[11] The band was chosen by Les Savy Fav to perform at the ATP Nightmare Before Christmas festival that they co-curated with Pavement in December 2011 in Minehead, England.[12]\n"
         ]
      },
      "Carrier": {
         "text": [
            "The Dodos' fifth album, Carrier, was released August 27, 2013 via Polyvinyl Record Co. on CD, LP, cassette, and digital formats. Carrier was also released in Canada via Dine Alone Records. The album was recorded in the band's hometown of San Francisco, CA at John Vanderslice's iconic Tiny Telephone Studios. Lyrically, Carrier contains numerous references to late Women guitarist Christopher Reimer, who died in his sleep in 2012. Reimer had joined The Dodos as a touring member and was a huge influence on Meric's guitar playing. The album received multiple accolades from FILTER,[13] The Line of Best Fit,[14] Under The Radar [15] and others and performed Carriers lead single, \"Confidence\" on the Late Show with David Letterman.[16]\n"
         ]
      },
      "Individ": {
         "text": [
            "The Dodos' Sixth album, Individ, was released January 30, 2015.\n"
         ]
      },
      "Certainty Waves": {
         "text": [
            "The Dodos released a seventh album called Certainty Waves on October 12, 2018, via Polyvinyl,[17] and share new song (and video), \"Forum\"[18]\n"
         ]
      },
      "text": [
         "The Dodos began playing music together in 2005, when musician Meric Long, who had been gigging steadily in San Francisco as a solo singer-songwriter, was introduced to Logan Kroeber through a mutual friend (a college acquaintance of Long's that happened to be Kroeber's cousin). The Dodos are a band of two, clean-cut halves. One of the duo was a student of West African Ewe drumming and intricate Blues fingerpicking guitar, the other hails from a background in heavy metal bands. Going from the raw, acoustic roots-rock on their albums ‘Visiter’ and ‘No Color’ to the more expansive, pop sound of ‘Time to Die’ and ‘Carrier’; guitarist-vocalist Meric Long and drummer Logan Kroeber have spent their career seeking to blur the line between the inherently melodic nature of Long's guitar and the rhythmic, atonal clatter of Kroeber's drums. Their most recent album ‘Individ’ can be seen as a resolution of this duality, combining their old acoustic sensibilities with an expansive vision and sound, and this performance served as further proof.\n"
      ]
   },
   "Equipment and playing techniques": {
      "text": [
         "The Dodos are known for using an alternate instrumental approach. Logan Kroeber plays on the drum kit without a bass drum, playing often on the rims of the drums, and also uses a tambourine taped to his shoe. During live performances, they sometimes have a third member playing a vibraphone, a drum, and two cymbals placed on each other (like a hi-hat). Meric Long plays mainly acoustic and semi-acoustic guitars during performances, but he also owns a Springtime and a Tafelberg drum guitar built by Yuri Landman; Long has also been seen using a Fender Jazzmaster. Long has been known to favor using his fingertips instead of a guitar pick.[citation needed]\n"
      ]
   },
   "Members": {
      "text": [
         "Joe Haege - guitars, keyboards, vocals (2013–present)\n"
      ]
   },
   "Discography": {
      "Albums": {
         "Notes": {}
      },
      "Singles": {},
      "Special releases": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Dodos are an American indie rock band consisting of Meric Long and Logan Kroeber.\n",
      "The Dodos began playing music together in 2005, when musician Meric Long, who had been gigging steadily in San Francisco as a solo singer-songwriter, was introduced to Logan Kroeber through a mutual friend (a college acquaintance of Long's that happened to be Kroeber's cousin). The Dodos are a band of two, clean-cut halves. One of the duo was a student of West African Ewe drumming and intricate Blues fingerpicking guitar, the other hails from a background in heavy metal bands. Going from the raw, acoustic roots-rock on their albums ‘Visiter’ and ‘No Color’ to the more expansive, pop sound of ‘Time to Die’ and ‘Carrier’; guitarist-vocalist Meric Long and drummer Logan Kroeber have spent their career seeking to blur the line between the inherently melodic nature of Long's guitar and the rhythmic, atonal clatter of Kroeber's drums. Their most recent album ‘Individ’ can be seen as a resolution of this duality, combining their old acoustic sensibilities with an expansive vision and sound, and this performance served as further proof.\n",
      "Long self-released a solo EP titled Dodo Bird in March 2006, in which Long played all the instruments.  While they performed the songs from this release, Long and Kroeber met and started playing together.  They worked to blend Kroeber's training in West African Ewe drumming and Long's experience in metal bands to create music in which \"drumming could be a center role and help bring out the syncopated rhythms coming out of the acoustic guitar.\"[4]\n",
      "The duo released the 2006 album Beware of the Maniacs, which was self-released under the \"Dodo Bird\" moniker.  In support of the album, Long and Kroeber toured relentlessly for most of 2007. The band began to receive critical attention and developed a growing fan base. Fans began referring to Dodo Bird simply as \"The Dodos\", and the band decided to change their name accordingly.\n"
   ]
}