{
   "Name": "The Dodos",
   "rawData": [
      "The Dodos are an American indie rock band consisting of Meric Long and Logan Kroeber.\n",
      "The Dodos began playing music together in 2005, when musician Meric Long, who had been gigging steadily in San Francisco as a solo singer-songwriter, was introduced to Logan Kroeber through a mutual friend (a college acquaintance of Long's that happened to be Kroeber's cousin). The Dodos are a band of two, clean-cut halves. One of the duo was a student of West African Ewe drumming and intricate Blues fingerpicking guitar, the other hails from a background in heavy metal bands. Going from the raw, acoustic roots-rock on their albums ‘Visiter’ and ‘No Color’ to the more expansive, pop sound of ‘Time to Die’ and ‘Carrier’; guitarist-vocalist Meric Long and drummer Logan Kroeber have spent their career seeking to blur the line between the inherently melodic nature of Long's guitar and the rhythmic, atonal clatter of Kroeber's drums. Their most recent album ‘Individ’ can be seen as a resolution of this duality, combining their old acoustic sensibilities with an expansive vision and sound, and this performance served as further proof.\n",
      "Long self-released a solo EP titled Dodo Bird in March 2006, in which Long played all the instruments.  While they performed the songs from this release, Long and Kroeber met and started playing together.  They worked to blend Kroeber's training in West African Ewe drumming and Long's experience in metal bands to create music in which \"drumming could be a center role and help bring out the syncopated rhythms coming out of the acoustic guitar.\"\n"
   ],
   "infobox": {
      "Also known as": [
         "Dodo Bird"
      ],
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Indie folk[1]",
         "Psychedelic folk[2]",
         "Baroque pop[3]"
      ],
      "Years active": [
         "2005–present"
      ],
      "Labels": [
         "Polyvinyl",
         "Dine Alone Records (Canada)",
         "Frenchkiss Records",
         "Wichita Recordings"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Meric Long",
         "Logan Kroeber"
      ],
      "Past members": [
         "Keaton Snyder"
      ]
   },
   "albums": [
      "Dodo Bird (EP)",
      "The Dodos: Live at the Spiegeltent",
      "Live From Akropolis, Prague",
      "Dodos Live in Amsterdam"
   ]
}