{
   "Name": "B-Girls (band)",
   "Sections": [
      "Summary",
      "History"
   ],
   "Summary": {
      "text": [
         "The B-Girls were a Toronto punk rock band from the first wave of punk in the late 1970s and early 1980s.\n"
      ]
   },
   "History": {
      "text": [
         "The B-Girls formed in 1977 with an all-girl line-up with Lucasta Ross (A.K.A. Rochas) on vocals, Renee Chetsky (guitar), Xenia Holiday (guitar), Cynthia Ross (bass) and Rhonda Ross on drums. who would later be replaced by Marcy Saddy who had briefly played with the Demics.\n",
         "The band had a sound that was closer to that of a 1960s Mersey Beat band than the usual loud and fast punk sound of the era which was also shown in their fashions which included go-go boots, tight leggings and matching sweaters.\n",
         "The band gigged heavily locally with bands like Teenage Head, The Viletones and The Poles as well as opening for The Clash and The Undertones at an infamous O'Keefe Centre gig where a riot broke out. After getting much press attention they relocated to New York where they would play with Blondie, The B52's, The Romantics, Levi and The Rockats, Nikki and The Korvettes, Richard Hell, Lee Dorsey, The Cramps, Joey Ramone, Joan Jett, Johnny Thunders, The Dead Boys and even Allen Ginsberg. Cynthia Ross would become engaged for a time to Dead Boys singer Stiv Bators.\n",
         "In 1979 Greg Shaw, owner of Bomp! Records signed them and recordings were made produced by Bob Segarini resulting in a single \"Fun At The Beach\" b/w \"B-Side\" which was also released in Europe. They also sang backup vocals on Blondie's Autoamerican and Stiv Bator's solo album. A video was shot for \"High School Dance\" (A.K.A. \"Boys Are Drinking\"). Further demos were produced by Debbie Harry and Mick Jones but possible record or production deals with Bomp!, I.R.S. Records and Phil Spector fell through. I.R.S. would instead sign the similar sounding Go-Go's who were also fans of the B-Girls.\n",
         "Line up changes would lead to Lucasta leaving after the single and being replaced by Xenia moving to vocals, Rhonda having already left and been replaced by Marcy Saddy who had previously played in the London, Ontario band Demics. The reformed band carried on until 1981 before breaking up and returning to Toronto. Lucasta formed a new band called Minutes From Downtown who had a hit with \"Wrapped In Velvet\" breaking up a few years later. Marcy Saddy returned to London drumming in various bands and becoming an artist. The rest of the band dropped out of music although Cynthia Ross has since returned with a new band, New York Junk.\n",
         "The band's collected recordings were released in 1997, remixed by Chris Spedding, in a CD entitled Who Says Girls Can't Rock. The members of the band also appear in the documentary The Last Pogo Jumps Again.\n"
      ]
   },
   "coreData": [
      "The B-Girls were a Toronto punk rock band from the first wave of punk in the late 1970s and early 1980s.\n",
      "The B-Girls formed in 1977 with an all-girl line-up with Lucasta Ross (A.K.A. Rochas) on vocals, Renee Chetsky (guitar), Xenia Holiday (guitar), Cynthia Ross (bass) and Rhonda Ross on drums. who would later be replaced by Marcy Saddy who had briefly played with the Demics.\n",
      "The band had a sound that was closer to that of a 1960s Mersey Beat band than the usual loud and fast punk sound of the era which was also shown in their fashions which included go-go boots, tight leggings and matching sweaters.\n",
      "The band gigged heavily locally with bands like Teenage Head, The Viletones and The Poles as well as opening for The Clash and The Undertones at an infamous O'Keefe Centre gig where a riot broke out. After getting much press attention they relocated to New York where they would play with Blondie, The B52's, The Romantics, Levi and The Rockats, Nikki and The Korvettes, Richard Hell, Lee Dorsey, The Cramps, Joey Ramone, Joan Jett, Johnny Thunders, The Dead Boys and even Allen Ginsberg. Cynthia Ross would become engaged for a time to Dead Boys singer Stiv Bators.\n"
   ]
}