{
   "Name": "The Black Belles",
   "rawData": [
      "The Black Belles is an American all-female \"garage goth\" rock band found by Jack White and signed to his label Third Man Records.\n",
      "The Black Belles formed in 2009 originally with Erin Belle. Bassist Ruby Rogers said \"She helped us out in the studio, and we needed someone with more of a commitment. She's also a model. Her scheduling didn't work out. We just haven't communicated that to a lot of people.\" They quickly signed to Third Man Records and released three singles: \"Elvira\", \"What Can I Do\", and \"Charlene\" with Stephen Colbert, which they performed live on The Colbert Report. Regarding their start with Third Man Records, Olivia Jean said, \"I had a recording that I gave to Jack, and it was mostly instrumental music, but it was a jumping-off point for like, some project to begin. I did it for myself, but I didn't play anything live, because I didn't have a band. But once we all met, we kind of collaborated together and shared ideas, threw all those ideas together and we had a lot of material to work with.\"\n",
      "In 2011, they released their debut self-titled album which had two singles: \"Honky Tonk Horror\" and \"Wishing Well\". The album was produced by Jack White and recorded in the course of a few months. Rogers said \"We did it really fast, and then we recorded it really fast, too.\" It received mildly positive reviews, achieving a Metacritic score of 59.\n"
   ],
   "infobox": {
      "Origin": [
         "Nashville, Tennessee, United States"
      ],
      "Genres": [
         "Garage rock"
      ],
      "Years active": [
         "2009–2012 (hiatus)"
      ],
      "Labels": [
         "Third Man Records"
      ],
      "Website": [
         "theblackbelles.com"
      ],
      "Members": [
         "Shelby Lynne",
         "Ruby Rogers",
         "Olivia Jean"
      ],
      "Past members": [
         "Christina Norwood",
         "Erin Belle"
      ]
   },
   "albums": [
      "The Black Belles"
   ]
}