{
   "Name": "Bratmobile",
   "Sections": [
      "1 Beginnings",
      "2 Hiatus",
      "3 Reformation",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 EPs",
      "4.3 Live albums",
      "4.4 Singles",
      "4.5 Split 7-inch",
      "4.6 Compilation albums",
      "5 Notes",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Bratmobile was an American punk band. Bratmobile was a first-generation \"riot grrrl\" band, which grew from the Pacific Northwest and Washington state underground. It was influenced by several eclectic musical styles, including elements of pop, surf, and garage rock.\n"
      ]
   },
   "Beginnings": {
      "text": [
         "Bratmobile formed when University of Oregon students Allison Wolfe and Molly Neuman collaborated on an influential feminist fanzine, Girl Germs.[2]  At first, Wolfe admitted that they were \"a fake band\" because they did not play instruments, but they had written some songs which they performed a cappella. Neuman's friend Calvin Johnson, an indie musician in the Olympia scene, asked her to play a show on Valentine's Day in 1991 with Bikini Kill and Some Velvet Sidewalk. After confessing that they were not in a band in an attempt to get out of the gig, they agreed and sought the help of Some Velvet Sidewalk member Robert Christie. Christie let Bratmobile borrow rehearsal space and equipment and advised them to listen to the Ramones for inspiration. In response to that advice, Wolfe states that \"Something in me clicked. Like, okay, if most boy punk rock bands just listen to the Ramones and that's how they write their songs, then we'll do the opposite and I won't listen to any Ramones and that way we'll sound different.\"[3] With five original songs, the band played its first show as a two-woman act at Olympia's North Shore Surf Club on February 14, 1991, with Neuman and Wolfe sharing duties on guitar, drums, and vocals. Briefly, they were joined by a bass player Michelle Noel. They played only a couple shows with this line-up, including one with The Melvins and Beat Happening, also at the \"Surf Club\" on May 16, 1991.\n",
         "During spring break 1991, Neuman and Wolfe went to Washington, DC to follow Beat Happening and Nation of Ulysses on tour and try to work on a new form of Bratmobile that, at that time, included artist Jen Smith and Christina Billotte of Autoclave in the line-up.[2] Together, they recorded and released a cassette tape entitled Bratmobile DC.[4][5] Beat Happening's Calvin Johnson had previously introduced Neuman to nascent guitarist Erin Smith from Bethesda, Maryland during the Christmas holiday in December, 1990 at a Nation of Ulysses show in Washington, DC. Smith was  co-author, with her brother, of the much-revered TV pop culture fanzine Teenage Gang Debs when Neuman and Wolfe asked her to jam with them. It clicked, and in July 1991 the trio played their first show as a 3-piece with Neuman on drums, Wolfe on vocal, and Erin Smith on guitar. They were just in time to play at the historic International Pop Underground Convention in Olympia, Washington in August 1991,[2] becoming the only band to appear twice. They played the opening show \"Girl Night\"[6][7] and the show at Capitol Lake Park.\n",
         "Between 1991 and 1994 Bratmobile released an album, Pottymouth, and an EP, The Real Janelle, on Kill Rock Stars, as well as The Peel Session recording before the intense media scrutiny and inner pressures of the Riot Grrrl movement hastened the band's breakup (on stage) in 1994.[citation needed]\n"
      ]
   },
   "Hiatus": {
      "text": [
         "After the break-up, Molly Neuman moved to the San Francisco Bay Area and began working at East Bay punk record label Lookout! Records. She also played in The PeeChees and The Frumpies. Allison Wolfe moved to Washington, D.C, and she and Maryland-based Erin Smith started a new band together called Cold Cold Hearts. Wolfe has also been active in feminism and activism.[citation needed]\n"
      ]
   },
   "Reformation": {
      "text": [
         "In 1999, the band decided to reunite for a low-key show in Oakland's Stork Club and the band was relaunched to go on tour with Sleater-Kinney.\n",
         "In 2000, Bratmobile released their second full-length studio album, Ladies, Women and Girls. The album was critically acclaimed and earned Bratmobile new fans as they toured with Sleater-Kinney, The Donnas, The Locust, among others. Ladies, Women and Girls was released on Neuman's Lookout! Records and produced by Tim Green of Nation of Ulysses and The Fucking Champs. Jon Nikki (Prima Donnas, Gene Defcon, Mocket, Sarah Dougher, Sir, Puce Moment) added guitar, bass and keyboard parts to the minimal Brat sound.\n",
         "On May 7, 2002, Bratmobile released their third album, Girls Get Busy. On Girls Get Busy, Audrey Marrs, (Mocket, Gene Defcon) added keyboards that gave the album its distinctive new sound. Marty Violence (Young Pioneers) also contributed bass.\n",
         "After dedicating most of 2002 and 2003 to promoting Girls Get Busy via touring, each of the principal members went back to do other things. While the band didn't formally break up, Allison Wolfe did post a message on January 30, 2004, in the Bratmobile message board concerning the status of the band:[citation needed]\n",
         "Yeah, sorry to say i think Bratmobile is through. We never had a certain incident where anyone said \"I quit\" or whatever, so it's been vague and drawn out. Sorry if that's been confusing to people. I think all 3 of us just have different ways of doing things and different things we want to do now, in and outside of music. Molly has just been so busy with managing the Donnas and the Locust, and as co-owner of Lookout! Records. Erin is also working full time at Lookout! Records. I've been living across the country in Washington DC, working 2 part-time jobs, and now doing other musical things. I'm now in Hawnay Troof, Baby Truth, and also a new girl band in DC called Partyline."
      ]
   },
   "Discography": {
      "Studio albums": {},
      "EPs": {},
      "Live albums": {},
      "Singles": {},
      "Split 7-inch": {},
      "Compilation albums": {}
   },
   "Notes": {},
   "External links": {},
   "coreData": [
      "Bratmobile was an American punk band. Bratmobile was a first-generation \"riot grrrl\" band, which grew from the Pacific Northwest and Washington state underground. It was influenced by several eclectic musical styles, including elements of pop, surf, and garage rock.\n",
      "Bratmobile formed when University of Oregon students Allison Wolfe and Molly Neuman collaborated on an influential feminist fanzine, Girl Germs.[2]  At first, Wolfe admitted that they were \"a fake band\" because they did not play instruments, but they had written some songs which they performed a cappella. Neuman's friend Calvin Johnson, an indie musician in the Olympia scene, asked her to play a show on Valentine's Day in 1991 with Bikini Kill and Some Velvet Sidewalk. After confessing that they were not in a band in an attempt to get out of the gig, they agreed and sought the help of Some Velvet Sidewalk member Robert Christie. Christie let Bratmobile borrow rehearsal space and equipment and advised them to listen to the Ramones for inspiration. In response to that advice, Wolfe states that \"Something in me clicked. Like, okay, if most boy punk rock bands just listen to the Ramones and that's how they write their songs, then we'll do the opposite and I won't listen to any Ramones and that way we'll sound different.\"[3] With five original songs, the band played its first show as a two-woman act at Olympia's North Shore Surf Club on February 14, 1991, with Neuman and Wolfe sharing duties on guitar, drums, and vocals. Briefly, they were joined by a bass player Michelle Noel. They played only a couple shows with this line-up, including one with The Melvins and Beat Happening, also at the \"Surf Club\" on May 16, 1991.\n",
      "During spring break 1991, Neuman and Wolfe went to Washington, DC to follow Beat Happening and Nation of Ulysses on tour and try to work on a new form of Bratmobile that, at that time, included artist Jen Smith and Christina Billotte of Autoclave in the line-up.[2] Together, they recorded and released a cassette tape entitled Bratmobile DC.[4][5] Beat Happening's Calvin Johnson had previously introduced Neuman to nascent guitarist Erin Smith from Bethesda, Maryland during the Christmas holiday in December, 1990 at a Nation of Ulysses show in Washington, DC. Smith was  co-author, with her brother, of the much-revered TV pop culture fanzine Teenage Gang Debs when Neuman and Wolfe asked her to jam with them. It clicked, and in July 1991 the trio played their first show as a 3-piece with Neuman on drums, Wolfe on vocal, and Erin Smith on guitar. They were just in time to play at the historic International Pop Underground Convention in Olympia, Washington in August 1991,[2] becoming the only band to appear twice. They played the opening show \"Girl Night\"[6][7] and the show at Capitol Lake Park.\n",
      "Between 1991 and 1994 Bratmobile released an album, Pottymouth, and an EP, The Real Janelle, on Kill Rock Stars, as well as The Peel Session recording before the intense media scrutiny and inner pressures of the Riot Grrrl movement hastened the band's breakup (on stage) in 1994.[citation needed]\n"
   ],
   "infobox": {
      "Origin": [
         "Olympia, Washington, United States"
      ],
      "Genres": [
         "Riot grrrl, punk rock"
      ],
      "Years active": [
         "1991–1994, 1998–2003"
      ],
      "Labels": [
         "Kill Rock Stars, Lookout!"
      ],
      "Associated acts": [
         "Mocket[1]",
         "Sex Stains"
      ],
      "Website": [
         "killrockstars.com/.../bratmobile"
      ],
      "Past members": [
         "Allison Wolfe",
         "Erin Smith",
         "Molly Neuman"
      ]
   }
}