{
   "Name": "Broadzilla",
   "Sections": [
      "1 Biography",
      "2 Discography",
      "3 See also",
      "4 References",
      "5 External links",
      "5.1 Official websites"
   ],
   "Summary": {
      "text": [
         "Broadzilla are a heavy rock band from Detroit, Michigan. They have released two CDs, two EPs, and have won six Detroit Music Awards. The band consists of Rachel May, Kim Essiambre, and Angie Manly.\n"
      ]
   },
   "Biography": {
      "text": [
         "Broadzilla was formed as an all-female metal/punk band in 1996, by Detroit singer/guitarist Rachel May. The original lineup also consisted of bassist Michelle Chapman (then known as Michelle Fields), guitarist Marlene Hammerle, and drummer Jen Moffitt. This lineup released the four-song self-titled EP Broadzilla on cassette only in 1996. Two of the four songs, \"Bondage Boy\" and \"Seven Ways,\" would be revamped by future Broadzilla lineups.\n",
         "For the next few years, Broadzilla would experience several personnel changes. Hammerle and Moffitt were gone by 1997, with the drummer's chair being filled by Angie Manly, a former bandmate of May's. From 1997 to 1999, Broadzilla's lineup fluctuated around May, Chapman, and Manly, with the band sometimes operating as a trio and sometimes as a quartet with a series of temporary second guitarists. \n",
         "By 1999, shortly before the release of the band's first full-length album, the second guitarist spot was occupied by Melody Baetens (under the stage name Melody Licious). The band released the CD Broadzilla vs. the Tramp-o-Lean in October 1999. The album featured a revamped version of \"Bondage Boy\" and a cover of \"No More Fun\" by the band Feisty Cadavers. Melody Licious was pictured on the album and credited with guitar and backing vocals, but in reality she only contributed backing vocals to the track \"Cum Guzzlin Whore.\" Broadzilla vs. the Tramp-o-Lean is out of print and has been sold out since 2001, becoming a collector's item.\n",
         "In early 2000, Chapman left the band for a move to Florida with her new husband, and was replaced by Kim Essiambre. In March 2000, Baetens departed and was not replaced. (Baetens later joined the Detroit glam band the Sirens, and also turned up in the Detroit garage punk band Gore Gore Girls, as did another former Broadzilla guitarist, Marlene Hammerle.) After several years of unstable personnel, Broadzilla finally stabilized as a trio consisting of May, Essiambre, and Manly, and this lineup has remained intact.\n",
         "In April 2001, Broadzilla won their first of six Detroit Music Awards for best hard rock/heavy metal artist. Their second album Lady Luck was released in October 2001. To date, the album has sold more than 8.000 copies. Included on the album were the lead track \"Ecstasy\" for which a full music video was produced, a cover of the 1968 song \"Love Child\" by Diana Ross and the Supremes, and two remixes of the original track \"Liquor Snatch\" by Detroit techno DJ Sean Deason.\n",
         "In 2001-2002 May also played guitar for the Detroit punk band Queen Bee. Broadzilla released a limited edition two-track promotional EP in January 2002, containing the new song \"Drug Man\" and a cover of the AC/DC song \"Big Balls.\" Following the release of Lady Luck, Broadzilla's increasing exposure allowed them to tour throughout the eastern United States. The band also unveiled many new songs starting in 2002, including a second version of \"Seven Ways\" and a third version of \"Bondage Boy.\" In August 2003, Broadzilla toured England for the first time. Two more British tours followed in fall 2003 and summer 2004 (the two summer tours included high-profile appearances at the annual Bulldog Bash music festival), while Broadzilla toured the western United States for the first time in spring 2005. Broadzilla continued winning regularly at the Detroit Music Awards, picking up additional trophies for best hard rock/heavy metal artist in 2002, 2003, 2005, 2006, and 2007 (they were not eligible in 2004).\n"
      ]
   },
   "Discography": {},
   "See also": {},
   "References": {
      "text": [
         "Interview at Rock Pulse\nInterview at Punk & Oi in the UK\nInterview at Gravyzine\nBroadzilla at AllMusic\nBiography at official website\nVideo interview with BlaringOut.com\n"
      ]
   },
   "External links": {
      "Official websites": {}
   },
   "coreData": [
      "Broadzilla are a heavy rock band from Detroit, Michigan. They have released two CDs, two EPs, and have won six Detroit Music Awards. The band consists of Rachel May, Kim Essiambre, and Angie Manly.\n",
      "Broadzilla was formed as an all-female metal/punk band in 1996, by Detroit singer/guitarist Rachel May. The original lineup also consisted of bassist Michelle Chapman (then known as Michelle Fields), guitarist Marlene Hammerle, and drummer Jen Moffitt. This lineup released the four-song self-titled EP Broadzilla on cassette only in 1996. Two of the four songs, \"Bondage Boy\" and \"Seven Ways,\" would be revamped by future Broadzilla lineups.\n",
      "For the next few years, Broadzilla would experience several personnel changes. Hammerle and Moffitt were gone by 1997, with the drummer's chair being filled by Angie Manly, a former bandmate of May's. From 1997 to 1999, Broadzilla's lineup fluctuated around May, Chapman, and Manly, with the band sometimes operating as a trio and sometimes as a quartet with a series of temporary second guitarists. \n",
      "By 1999, shortly before the release of the band's first full-length album, the second guitarist spot was occupied by Melody Baetens (under the stage name Melody Licious). The band released the CD Broadzilla vs. the Tramp-o-Lean in October 1999. The album featured a revamped version of \"Bondage Boy\" and a cover of \"No More Fun\" by the band Feisty Cadavers. Melody Licious was pictured on the album and credited with guitar and backing vocals, but in reality she only contributed backing vocals to the track \"Cum Guzzlin Whore.\" Broadzilla vs. the Tramp-o-Lean is out of print and has been sold out since 2001, becoming a collector's item.\n"
   ],
   "infobox": {
      "Website": [
         "Official website"
      ],
      "Members": [
         "Rachel May",
         "Kim Essiambre",
         "Angie Manly"
      ],
      "Past members": [
         "Marlene Hammerle",
         "Jen Moffitt",
         "Michelle Chapman",
         "Melody Baetens"
      ]
   }
}