{
   "Name": "Broadzilla",
   "rawData": [
      "Broadzilla are a heavy rock band from Detroit, Michigan. They have released two CDs, two EPs, and have won six Detroit Music Awards. The band consists of Rachel May, Kim Essiambre, and Angie Manly.\n",
      "Broadzilla was formed as an all-female metal/punk band in 1996, by Detroit singer/guitarist Rachel May. The original lineup also consisted of bassist Michelle Chapman (then known as Michelle Fields), guitarist Marlene Hammerle, and drummer Jen Moffitt. This lineup released the four-song self-titled EP Broadzilla on cassette only in 1996. Two of the four songs, \"Bondage Boy\" and \"Seven Ways,\" would be revamped by future Broadzilla lineups.\n",
      "For the next few years, Broadzilla would experience several personnel changes. Hammerle and Moffitt were gone by 1997, with the drummer's chair being filled by Angie Manly, a former bandmate of May's. From 1997 to 1999, Broadzilla's lineup fluctuated around May, Chapman, and Manly, with the band sometimes operating as a trio and sometimes as a quartet with a series of temporary second guitarists. \n"
   ],
   "infobox": {
      "Website": [
         "Official website"
      ],
      "Members": [
         "Rachel May",
         "Kim Essiambre",
         "Angie Manly"
      ],
      "Past members": [
         "Marlene Hammerle",
         "Jen Moffitt",
         "Michelle Chapman",
         "Melody Baetens"
      ]
   },
   "albums": [
      "Broadzilla",
      "Broadzilla vs. the Tramp-o-Lean",
      "Lady Luck",
      "Broadzilla - B4 Records Song of the Month"
   ],
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band from Detroit, Michigan. They have released two CDs, two EPs, and have won six Detroit Music Awards. The band consists of Rachel [MONTH], [PERSON_NAME_FULL_0_FEMALE], and Angie Manly.\n",
      "[BAND_NAME] was formed as an [GENRE] band in [YEAR], by Detroit singer/guitarist Rachel [MONTH]. The original lineup also consisted of bassist [PERSON_NAME_FIRST_0] Chapman (then known as [PERSON_NAME_FULL_0_FEMALE]), guitarist [MONTH]lene Hammerle, and drummer [PERSON_NAME_FULL_1_FEMALE]. This lineup released the four-song self-titled EP [BAND_NAME] on cassette only in [YEAR]. Two of the four songs, [SONG_NAME] would be revamped by future [BAND_NAME] lineups.\n",
      "For the next few years, [BAND_NAME] would experience several personnel changes. Hammerle and Moffitt were gone by [YEAR], with the drummer's chair being filled by Angie Manly, a [GENRE] bandmate of [MONTH]'s. From [YEAR] to [YEAR], [BAND_NAME]'s lineup fluctuated around [MONTH], Chapman, and Manly, with the band sometimes operating as a trio and sometimes as a quartet with a series of temporary second guitarists. \n"
   ]
}