{
   "Name": "Cacadou Look",
   "rawData": [
      "Cacadou Look was a five-piece pop rock band from Opatija, Croatia that was the first Yugoslav all-female band to release a long play record.\n",
      "Cacadou Look was formed in Opatija in 1983. They were not the first all-female band in Yugoslavia — at the time, already active were Tožibabe from Ljubljana and Boye from Novi Sad — but they were the first to achieve a degree of mainstream popularity, helped by radio play of their two demo tracks, \"Sama\" and \"Kao pjesma\" (both 1987), and by TV appearances such as those on Stereovizija, a popular 1980s music show broadcast by Radio Television Zagreb.\n",
      "Their first album Tko mari za čari (Jugoton, 1987) was produced by Husein Hasanefendić and Tomo in der Mühlen, and featured a guest appearance by Vlada Divljan. The album yielded three hit songs: \"Sama\", \"Kao pjesma\" and \"Tako lako\". Apart from \"Tako lako\", a cover of Buddy Holly's \"It's So Easy\", and \"Ne dozvoli\", which was written by Divljan, all songs on the album were composed by the band. Despite these accomplishments, the band found working in the men-dominated music scene difficult at times, and occasional malicious remarks motivated them to work even harder.\n"
   ],
   "infobox": {
      "Origin": [
         "Opatija, Yugoslavia (now Croatia)"
      ],
      "Genres": [
         "Power pop[1]"
      ],
      "Years active": [
         "1983–1991"
      ],
      "Labels": [
         "Jugoton"
      ],
      "Website": [
         "Cacadou Look on Myspace"
      ],
      "Past members": [
         "Jasmina Simić",
         "Tatjana Simić",
         "Suzana Kožić",
         "Tamara Vrančić",
         "Sandra Vrančić ",
         "Giovanna Kirinić",
         "Alenka Mendiković"
      ]
   },
   "albums": [
      "Tko mari za čari",
      "Uspavanka za Zoroa"
   ],
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band from Opatija, Croatia that was the first Yugoslav all-female band to release a long play record.\n",
      "[BAND_NAME] was formed in Opatija in [YEAR]. They were not the first all-female band in Yugoslavia — at the time, already active were Tožibabe from Ljubljana and Boye from [MONTH]i Sad — but they were the first to achieve a degree of mainstream popularity, helped by radio play of their two demo tracks, [SONG_NAME] (both [YEAR]), and by TV appearances such as those on Stereovizija, a popular [YEAR]s music show broadcast by Radio Television Zagreb.\n",
      "Their first album Tko mari za čari (Jugoton, [YEAR]) was produced by [PERSON_NAME_FULL_0_MALE] and Tomo in der Mühlen, and featured a guest appearance by [PERSON_NAME_FULL_1_FEMALE]. The album yielded three hit songs: [SONG_NAME], which was written by [PERSON_NAME_LAST_1], all songs on the album were composed by the band. Despite these accomplishments, the band found working in the men-dominated music scene difficult at times, and occasional malicious remarks motivated them to work even harder.\n"
   ]
}