{
   "Discography": {
      "Albums": {},
      "Tracks on compilations": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Anne Bonafede and Sharon Cheslow began playing music in 1980, after developing friendships through the Bad Brains, Henry Rollins, Teen Idles, and Untouchables. After Cheslow saw a Bad Brains rehearsal with Rollins in March 1980, and then survived meningitis that summer, she decided to form a band. In March 1981 Chalk Circle had its first rehearsal as an all-female quartet. The group played their first show in July 1981, opening for Velvet Monkeys and R.E.M. (later Egoslavia), with Sally Ven Yu Berg from the latter group filling in on bass.[1][2][3]\n",
         "Chalk Circle's original sound was energetic, percussive, angular, and minimal, with Bonafede's drumming style sounding primitive and psychedelic. Mary Green's lyrics were existential and poetic, and she and Cheslow sometimes sang in unison or call and response. Besides punk and hardcore, their music was influenced by 1960s/70s rock music, go-go, and jazz. The group did their first studio demo in early 1982, with Tamera Lyndsay on bass, at Inner Ear Studios with Don Zientara and Howard Wuelfing (Slickee Boys, Nurses, Half Japanese). Their sound became more noisy and experimental as they progressed, while retaining a sense of melody. They recorded a second Inner Ear session with Chris Niblack on bass, and released two of those songs on the Outside Records LP compilation Mixed Nuts Don't Crack. WGNS cassettes released Chalk Circle songs on compilations between 1982-84. Although the group later slipped through the cracks of D.C. punk history, except as a sidenote in riot grrrl histories, at the time they were part of the national/international punk community.[1][2]\n"
      ]
   },
   "Legacy": {
      "text": [
         "A twelve-song collection of Chalk Circle's early 1980s studio material and some live recordings was released on the Reflection LP in 2011, with liner notes by Don Fleming. \"Reflection\" was a joint effort by Mississippi Records and Post Present Medium, the label headed by Dean Spunt of No Age. During Chalk Circle's short existence in the heydey of D.C.'s first golden era of hardcore,[4] the group broke through musical and gender barriers to create a sound that captured the joyful excitement of forgoing standard structures.[1][2]\n",
         "The group were notable as the first all-female band to emerge from D.C.'s punk scene.[1] Other than vocal girl groups, Chalk Circle were the first all-female group to record and perform in D.C. since the International Sweethearts of Rhythm in the 1940s.[2]\n",
         "Sally Berg and Tamera Lyndsay moved to New York and formed SHE with Laura Kennedy (Bush Tetras) and Claudia Summers. Lyndsay also collaborated with Adele Bertei (Contortions, Bloods), Lesley Woods (Au Pairs), Barbara Gogan (The Passions), and Clare Hirst (Belle Stars). After Chalk Circle disbanded, Sharon Cheslow joined Bloody Mannequin Orchestra, contributed to Cynthia Connolly's and Leslie Clague's 1988 book Banned in DC: Photos and Anecdotes From the DC Punk Underground (79–85), collaborated with various musicians including Kathleen Hanna in Suture, published Interrobang?!, and formed Coterie Exchange.[3] Chris Niblack toured with No Trend.\n"
      ]
   },
   "Members": {},
   "Notes": {},
   "References": {},
   "Sections": [
      "1 History",
      "2 Legacy",
      "3 Members",
      "4 Discography",
      "4.1 Albums",
      "4.2 Tracks on compilations",
      "5 Notes",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Chalk Circle were an American punk rock band formed in 1981 in Washington, DC. Their raw, rhythmic, minimal sound had more in common with post-punk or art punk than D.C. hardcore, a community they initially helped pioneer.[1] Guitarist/vocalist Sharon Cheslow and drummer Anne Bonafede were joined by guitarist/vocalist Mary Green and alternating bassists Jan Pumphrey, Tamera Lyndsay, and Chris Niblack before the group disbanded in 1983.[2]\n"
      ]
   },
   "Title": "Chalk Circle (American band) - Wikipedia"
}