{
   "Name": "Chatmonchy",
   "Sections": [
      "1 History",
      "1.1 2000–2004: Band formation",
      "1.2 2005–2008: Albums",
      "1.3 2009–2018",
      "2 Band members",
      "2.1 Timeline",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "chatmonchy (チャットモンチー, chattomonchī) was a three-piece all-female rock band which consisted of Eriko Hashimoto (guitar, vocals), Akiko Fukuoka (bass, chorus), and formerly Kumiko Takahashi (drums, chorus) who are from Tokushima Prefecture on the island of Shikoku, Japan.[1]\n",
         "Since 2005, they were signed to Sony Music Japan's Ki/oon Records record label. In November 2017, the band announced that they were disbanding.[2]\n",
         "The band had their final one-man concert on July 4, 2018, at the Nippon Budokan, and held their last \"Konason Fest\" on July 21 and 22.[3][4]\n"
      ]
   },
   "History": {
      "2000–2004: Band formation": {
         "text": [
            "In 2000, Hashimoto formed chatmonchy in the city of Tokushima, Tokushima Prefecture. Having been to see her brother perform at the first concert she attended, she became keen on forming a trio. Although part of a brass band throughout junior high and high school, her brother began teaching her guitar.[1]\n",
            "Hashimoto formed her first trio in high school, and it was then that the name chatmonchy came about. According to Hashimoto, \"one of the members insisted on using the word 'monchi,' like 'monkey'.\" The name derived from an image of a cute monkey doll named \"Monchhichi\", from the Hiroshi Jinsenji-directed animation series Futago no Monchhichi, which ran 130 episodes through 1980. The group then picked the word \"chat\" randomly from a dictionary to make the name. However, after graduation, the three members went their separate ways.[1]\n",
            "Fukuoka, then in the same grade and at the same high school as Hashimoto, joined as an acoustic duo, and performed one show when a male drummer pulled out right before a concert in April 2004. Takahashi sat in the audience of the show and at the time was in another band, but was known to the duo via the Light Music Club of their university in Tokushima, Shikoku.[1][5]\n",
            "The band independently produced an album, entitled chatmonchy ni Naritai (チャットモンチーになりたい) (out of distribution) and sold it themselves, chiefly by hand in the Tokushima area, achieving as many as 1500 sales and record label solicitations.[1]\n"
         ]
      },
      "2005–2008: Albums": {
         "text": [
            "On 23 November 2005, with Supercar's Junji Ishiwatari as producer, chatmonchy released chatmonchy has come, their first album under the Ki/oon Records label. The album sold over 20,000 copies. The group then moved permanently to Tokyo.[1]\n",
            "In March of the following year, the band released the single Koi no Kemuri (恋の煙), but it did not chart. In July 2006, the band released the album Miminari (耳鳴り) which debuted at number 10 on the Oricon album charts. The following November, the single Shangri-La (シャングリラ) debuted at number 6 on the Oricon single chart. The song was also used as the ending theme to the anime Hataraki Man.\n",
            "In April 2007, the band released the single Joshi-tachi ni Asu wa Nai (女子たちに明日はない) but it failed to chart. The following June, chatmonchy released the single Tobiuo no Butterfly / Sekai ga Owaru Yoru ni (とび魚のバタフライ/世界が終わる夜に) and it debuted at number 9 on the Oricon single chart. In September 2007, they released the single Daidai (single)|Daidai (橙), meaning bitter orange. This song was used as the 12th ending theme of the anime series Bleach. \"Daidai\" also debuted at number 12 on the Oricon single charts. In October of the same year, the band released the album Seimeiryoku (生命力), which debuted at number 2 on the Oricon album charts. In November 2007, chatmonchy released their first DVD, Chatmonchy Restaurant Appetizer (チャットモンチー レストラン 前菜).\n",
            "In February 2008, chatmonchy released the single Hira Hira Hiraku Himitsu no Tobira (ヒラヒラヒラク秘密ノ扉) and the live DVD Chatmonchy Restaurant Soup (チャットモンチー レストラン スープ;). The single debuted at number 11 on the Oricon single chart. Later that year in June, the band released the single Kaze Fukeba Koi (風吹けば恋) which debuted at number 8 on the Oricon single charts. Then in November, they released the single Somaru Yo (染まるよ), which debuted at number 10 on the Oricon single charts.\n"
         ]
      },
      "2009–2018": {
         "text": [
            "On February 4, 2009, chatmonchy released the single \"Last Love Letter\" which debuted at number 7 on the Oricon single charts. That March, they released the album Kokuhaku (告白), and the BD Chatmonchy Restaurant Main Dish (チャットモンチー レストラン メインディッシュ) The album debuted at number 2 on the Oricon album charts.\n",
            "On March 19, 2010, chatmonchy played at the prestigious SXSW festival in Austin, Texas as part of the Japan Nite tour.[6] The band also took the chance to do a mini-tour of the US, visiting New York, San Francisco and Los Angeles.[1] Later that year, their song \"Koko Dake no Hanashi\" (ここだけの話?, \"Just Between Us\") was used as the opening of the anime series Kuragehime.\n",
            "On July 29, 2011, Kumiko announced that she would be leaving the band, on friendly terms, at the end of September 2011 after the last of the band's current gigs had finished.[7] The band continue as a duo as of October 2011.[8]\n",
            "In May 2013 Eriko announced her marriage to Tacica's Shoichi Igari, and that she was six months pregnant.[9] Eriko gave birth to her son on 17 October 2013, her 30th birthday.[10]\n",
            "On May 13, 2015, chatmonchy released their sixth full album called \"Kyōmei\". This was also the first album featuring their new support band members.[11]\n",
            "On November 24, 2017, chatmonchy announced that it will be disbanding in July 2018. Their final album, \"Tanjō\" was released in June 2018.[12][13]\n",
            "Since disbanding, both band members have begun work on their own solo projects with Eriko releasing a demo CD[14] and Akiko producing for the band yonige.[15]\n"
         ]
      }
   },
   "Band members": {
      "Timeline": {},
      "text": [
         "\n",
         "\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "chatmonchy (チャットモンチー, chattomonchī) was a three-piece all-female rock band which consisted of Eriko Hashimoto (guitar, vocals), Akiko Fukuoka (bass, chorus), and formerly Kumiko Takahashi (drums, chorus) who are from Tokushima Prefecture on the island of Shikoku, Japan.[1]\n",
      "Since 2005, they were signed to Sony Music Japan's Ki/oon Records record label. In November 2017, the band announced that they were disbanding.[2]\n",
      "The band had their final one-man concert on July 4, 2018, at the Nippon Budokan, and held their last \"Konason Fest\" on July 21 and 22.[3][4]\n",
      "In 2000, Hashimoto formed chatmonchy in the city of Tokushima, Tokushima Prefecture. Having been to see her brother perform at the first concert she attended, she became keen on forming a trio. Although part of a brass band throughout junior high and high school, her brother began teaching her guitar.[1]\n"
   ]
}