{
   "Band history": {
      "text": [
         "On the band's website, Lynn commented on their start and early success:[4]\n",
         "Nordine and Lynn traveled to Cincinnati, Ohio to record their first album, The Capricorns Are Gonna Get You, a now-out of print cassette released on their own label.[3]  Jason Barnett, of Paroxysm Records, heard the record, and offered them a record contract.[3]\n",
         "Their second album, In the Zone, was described by Kotori magazine as \"All casio all the time (with occasional tambourine), they've got hooks so sweet you can't help but get addicted\".[6] and by Allmusic as \"the perfect soundtrack for when the Powerpuff Girls become the Powerpuff Late Teenagers, mixing in a touch more angst but still gleefully kicking ass and taking names.\"[2]\n",
         "The duo's last album, Pure Magical Love, was released in January 2006, and according to Jessie Nelson of the Athens Exchange, \"oozes quintessential girliness\", going on to describe it as \"girl music for women who remember being ten, dressing up in old clothes and dancing around the living room to Madonna\".[7] A winter tour that coincided with that album's release ended early after Lynn's car \"blew up\"; in an April 2006 MySpace blog entry (their most recent blog entry as of December 2007[update]), Lynn implies the duo is no longer active:[8]\n",
         "In spring of 2008, Heather Lynn created a live performance of the Pure Magical Love record that she performed at Version Festival in Chicago. This evolved into a band called Pure Magical Love. Combining performance art and live music, Pure Magical Love \"[1]\" is like the Capricorns on crack. Pure Magical Love's first record, \"Glorificus\", will be released in 2010[needs update] on Tell Me Records (home of Dandi Wind, Fe, etc.).\n"
      ]
   },
   "Discography": {
      "text": [
         "\n",
         "\n"
      ]
   },
   "External links": {},
   "References": {},
   "Sections": [
      "1 Band history",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "The Capricorns were an  indie rock band consisting of Heather Lynn and Kirsten Nordine, both of whom sing and play keyboards, with Lynn also playing tambourine.[1][2] They formed their band in the spring of 2000,[3] playing on vintage Casio keyboards purchased at garage sales.[1][4]  They write pop songs which one of their labels described as combining \"infectious hooks with 'dear diary' lyrics\".[5]  They are originally from Grayslake, Illinois.[3]\n"
      ]
   },
   "Title": "The Capricorns - Wikipedia"
}