{
   "Name": "Cibo Matto",
   "rawData": [
      "Cibo Matto (pronounced , Italian for \"crazy food\") was a Japanese-American band formed by Yuka Honda and Miho Hatori in New York City in 1994. Initially, the band's lyrics were primarily concerned with food, before expanding into broader subject matter following the addition of Sean Lennon, Timo Ellis, and Duma Love to the band for their second studio album.\n",
      "While Honda and Hatori are Japanese expatriates, the group initially did not gain as large a following in Japan as it did in the United States. Their first album Viva! La Woman sold 40,000 copies in Japan, but was more successful in the U.S., with over 74,000 copies sold. Over time, the group's following in Japan grew, which resulted in their signing to Japanese record label Commmons in 2014.\n",
      "After an almost decade-long hiatus, Honda and Hatori reunited as Cibo Matto in 2011, playing a series of concerts and recording new material. They released their third and final studio album Hotel Valentine on February 14, 2014. It peaked at number 168 on the Billboard 200. Cibo Matto announced their split in December 2017.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, U.S."
      ],
      "Genres": [
         "Trip hop",
         "alternative rock[1]",
         "art pop[2]",
         "shibuya-kei[3]",
         "hip hop[4]"
      ],
      "Years active": [
         "1994–2002, 2011–2017"
      ],
      "Labels": [
         "Chimera Music",
         "Commmons",
         "Warner Bros."
      ],
      "Associated acts": [
         "Butter 08",
         "Jon Spencer Blues Explosion",
         "Gorillaz"
      ],
      "Past members": [
         "Yuka Honda",
         "Miho Hatori",
         "Yuko Araki",
         "Sean Lennon",
         "Timo Ellis",
         "Duma Love"
      ]
   },
   "albums": [
      "Viva! La Woman",
      "Stereo Type A",
      "Hotel Valentine"
   ],
   "prunedData": [
      "[BAND_NAME] (pronounced , Italian for [SONG_NAME]) was a [GENRE] band formed by [PERSON_NAME_FULL_1_FEMALE] and [PERSON_NAME_FULL_0_MALE] in New York City in [YEAR]. Initially, the band's lyrics were primarily concerned with food, before expanding into broader subject matter following the addition of Sean Lennon, Timo Ellis, and Duma Love to the band for their second studio album.\n",
      "While Honda and Hatori are Japanese expatriates, the group initially did not gain as large a following in Japan as it did in the United States. Their first album Viva! La Woman sold 40,000 copies in Japan, but was more successful in the U.S., with over 74,000 copies sold. Over time, the group's following in Japan grew, which resulted in their signing to Japanese record label Commmons in [YEAR].\n",
      "After an almost decade-long hiatus, Honda and Hatori reunited as [BAND_NAME] in [YEAR], playing a series of concerts and recording new material. They released their third and final studio album Hotel Valentine on [MONTH] 14, [YEAR]. It peaked at number 168 on the Billboard 200. [BAND_NAME] announced their split in [MONTH] [YEAR].\n"
   ]
}