{
   "Band members": {
      "Timeline": {}
   },
   "Discography": {
      "Collections": {},
      "EPs": {},
      "Music videos": {},
      "Singles": {},
      "Studio albums": {}
   },
   "External links": {},
   "Grand Royal involvement": {
      "text": [
         "Although Cibo Matto was represented by Warner Bros. Records, they were also considered to be a major part of the Grand Royal Records family.\n"
      ]
   },
   "History": {
      "Hiatus: 2002–2010": {
         "text": [
            "Cibo Matto continued to play live and tour until disbanding in 2002.[5] Honda said: \"We felt the need to move to the next step. It was a healthy decision, though it was sad at the same time. Things just need to grow out of things sometimes.\" All of the members of Cibo Matto went on to release solo material.[5] A compilation entitled Pom Pom: The Essential Cibo Matto was released in 2007.\n"
         ]
      },
      "Reunion and Hotel Valentine: 2011–2017": {
         "text": [
            "Cibo Matto announced its reunion on March 18, 2011, to perform as part of a benefit concert for victims of the 2011 Tōhoku earthquake and tsunami. The concert, which took place on March 27 at Columbia University in New York City, also included Yoko Ono, John Zorn, Sonic Youth, and Mike Patton. Following the success of this show, a second was added, this time featuring the Plastic Ono Band and Patti Smith along with Cibo Matto.[16]\n",
            "The group appeared at the Hollywood Bowl on June 26, 2011, for another benefit, alongside Yellow Magic Orchestra.[17]\n",
            "On May 16, 2011, Cibo Matto announced its US reunion tour titled \"Yeah, Basically Cibo Matto\" with a tour Web site Wayback Machine and promotional video.[18] During the concerts, the band reportedly spoke about a new studio album that was to be released in 2012. On July 17, 2012, the band announced it would be opening for Wilco at one of its shows. The band included Yuko Araki on drums during this time.\n",
            "On June 15, 2013, the band played the Meltdown Festival in London and announced that its new album would be released in 2014. While the performance also featured Yoko Ono on \"Know Your Chicken\", the group also played new songs titled \"MFN\", \"Check In\", and \"Tenth Floor Ghost Girl\".[19] On December 11, Pitchfork reported that Hotel Valentine would be released on February 14, 2014 (Valentine's Day), and that Cibo Matto had shared its music video for \"MFN\".[9] Hotel Valentine peaked at number 168 on the Billboard 200.[10]\n",
            "In 2014, the band signed with Japanese label Commmons.[8] This new relationship resulted in several live dates in Japan including Summer Sonic Festival 2014[20] and shows at Blue Note Jazz Club Nagoya[21] and Blue Note Jazz Club Tokyo.[22]\n",
            "In September 2014, Cibo Matto announced their Fall Flavor Tour and the release of their newest music video with a teaser. Rioux opened for multiple US shows. Nels Cline (of Wilco) also performed with the group on tour.[23] The music video for \"Déjà Vu\" was released on September 18, 2014 in collaboration with New York City-based director Jean Claude Billmaier and creative house Marabigo. Pitchfork identified the video as \"a colorful, datamosh-y new video\",[24] and Spin as a \"stylish bubblegum pop-meets-digital-disaster (intentional).\"[25]\n",
            "Cibo Matto completed two small tours in 2015; an \"Avocado Tour\" of Japan and a \"Banana Split Tour\" across the eastern US and Canada.[26] On December 11, 2017, Cibo Matto announced their breakup, explaining that this was a \"necessary and positive change for [them].\"[27][28]\n"
         ]
      },
      "Stereo Type A: 1997–2001": {
         "text": [
            "In 1997, Cibo Matto released a new EP entitled Super Relax,[1] which would complete the line-up by introducing new members Sean Lennon and Timo Ellis with Duma Love joining soon thereafter.[5][1] In 1998 Lennon released his debut solo album Into the Sun, which featured Hatori (\"Into the Sun\", \"Sean's Theme\") and Ellis (\"Mystery Juice\", \"Home\", \"Spaceship\"). Into the Sun was produced and inspired by Honda (whom Lennon was dating at the time).[13] Honda, Hatori, Ellis and Love appeared in the closing scene of the video for Lennon's single \"Home\". Cibo Matto went on to release its second album Stereo Type A in 1999.[5][1] Although it was a departure from the familiar sound of Viva! La Woman, Stereo Type A was well received by music critics.[14] That year the band performed in Toronto with Luscious Jackson at The Opera House in Toronto.[15]\n"
         ]
      },
      "Viva! La Woman: 1994–1996": {
         "text": [
            "After working together in the noise rock band Leitoh Lychee,[11] Miho Hatori and Yuka Honda formed Cibo Matto in 1994[5] with Honda as the instrumentalist and Hatori as the vocalist (although occasionally Honda sang and Hatori contributed instrumentally).[1] In 1995, Cibo Matto released a self titled EP on El Diablo Records. The EP caught the attention of Warner Bros. Records, which signed Cibo Matto later in the year. Through Warner Bros. the duo released its first major album, Viva! La Woman.[1] Cibo Matto is an Italian phrase that translates to \"Crazy Food\" and many of the tracks from Viva! La Woman, which was produced by Mitchell Froom, featured lyrics related to food, including \"Know Your Chicken\", \"Apple\", and \"Birthday Cake\".[1] The album's first single, \"Sugar Water\", was a modest college radio and dance hit. The song was accompanied by an innovative split screen music video that was directed by Michel Gondry, where each side showed the same footage—one side going forward, and one backward, meeting mid-song.[12] After the music videos for \"Know Your Chicken\" and \"Sugar Water\" enjoyed success on MTV, Cibo Matto made appearances on various television shows such as Oddville, Viva Variety, and Buffy the Vampire Slayer. \"Birthday Cake\" was heavily featured in the video game Jet Set Radio Future. in 1996, Cibo Matto contributed \"Águas De Março (Waters of March)\" to the AIDS benefit album Silencio=Muerte: Red Hot + Latin, which was produced by the Red Hot Organization.\n"
         ]
      }
   },
   "In popular culture": {
      "text": [
         "The band's name appears in the lyrics of the Le Tigre song \"Hot Topic\".[30]\n",
         "They also appear in the second season of Buffy the Vampire Slayer episode \"When She Was Bad\", to play a concert in the fictional Sunnydale nightclub, the Bronze.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Viva! La Woman: 1994–1996",
      "1.2 Stereo Type A: 1997–2001",
      "1.3 Hiatus: 2002–2010",
      "1.4 Reunion and Hotel Valentine: 2011–2017",
      "2 Band members",
      "2.1 Timeline",
      "3 Grand Royal involvement",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 EPs",
      "4.3 Singles",
      "4.4 Collections",
      "4.5 Music videos",
      "5 In popular culture",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Cibo Matto (pronounced [ˈtʃiːbo ˈmatto], Italian for \"crazy food\") was a Japanese-American band formed by Yuka Honda and Miho Hatori in New York City in 1994.[5] Initially, the band's lyrics were primarily concerned with food,[1] before expanding into broader subject matter following the addition of Sean Lennon, Timo Ellis, and Duma Love to the band for their second studio album.[6]\n",
         "While Honda and Hatori are Japanese expatriates,[5] the group initially did not gain as large a following in Japan as it did in the United States. Their first album Viva! La Woman sold 40,000 copies in Japan, but was more successful in the U.S., with over 74,000 copies sold.[7] Over time, the group's following in Japan grew, which resulted in their signing to Japanese record label Commmons in 2014.[8]\n",
         "After an almost decade-long hiatus, Honda and Hatori reunited as Cibo Matto in 2011, playing a series of concerts and recording new material. They released their third and final studio album Hotel Valentine on February 14, 2014.[9] It peaked at number 168 on the Billboard 200.[10] Cibo Matto announced their split in December 2017.\n"
      ]
   },
   "Title": "Cibo Matto - Wikipedia"
}