{
   "Name": "Civet (band)",
   "Sections": [
      "1 History",
      "2 Influences and style",
      "3 Band members",
      "3.1 Current",
      "3.2 Former",
      "4 Discography",
      "5 Videography",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Civet is an American punk rock band from Long Beach, California, United States. They are signed to Hellcat Records and have recorded six releases, with the latest being Love & War (2011).\n"
      ]
   },
   "History": {
      "text": [
         "The self-described \"femme fatale punk rock\" band made a breakthrough after signing with Hellcat Records and releasing their first album under this label with the title Hell Hath No Fury.[1]\n",
         "In an interview the lead singer Liza Graves said, that the name does not only represent the animal civet, but was used after they heard it means flower in Slavic languages.[2]\n",
         "In a November 2008 interview, Liza Graves announced that the band had a new line up.  The previous rhythm section, consisting of Jackie Daniels on bass and Bombshell Brenz (Brenna Red) on drums, had been replaced by Jacqui Valentine (bass) and Cat Scandal (drums) who was later replaced by Danni Harrowyn[3]\n",
         "There was no announcement when drummer Danni Harrowyn was replaced with Roxie Darling.\n",
         "In November 2010, the band's rhythm section, Jacqui Valentine and Roxie Darling, quit the band during a tour opening for Nashville Pussy.  The band finished the tour with friends filling in for the departing musicians.[4][5][6]  Roxie Darling posted a statement about the departure on her Facebook page.[7]\n",
         "In January 2011 the band announced via their Myspace page that their new album, Love & War,  was to be released on 22 February 2011 with \"L.A Nights\" as the first single.[8] The album was released on Hellcat.[9]\n"
      ]
   },
   "Influences and style": {
      "text": [
         "Their musical style is compared to The Distillers, Bikini Kill, the Runaways[10] and Motörhead on rock’n’roll cocaine.[11] Civet themselves have stated on numerous occasions, that their biggest influence and inspiration comes from The Runaways.[12] They have toured with Social Distortion, The Mighty Mighty Bosstones, Street Dogs, Flogging Molly and Dropkick Murphys.\n"
      ]
   },
   "Band members": {
      "Current": {},
      "Former": {}
   },
   "Discography": {},
   "Videography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Civet is an American punk rock band from Long Beach, California, United States. They are signed to Hellcat Records and have recorded six releases, with the latest being Love & War (2011).\n",
      "The self-described \"femme fatale punk rock\" band made a breakthrough after signing with Hellcat Records and releasing their first album under this label with the title Hell Hath No Fury.[1]\n",
      "In an interview the lead singer Liza Graves said, that the name does not only represent the animal civet, but was used after they heard it means flower in Slavic languages.[2]\n",
      "In a November 2008 interview, Liza Graves announced that the band had a new line up.  The previous rhythm section, consisting of Jackie Daniels on bass and Bombshell Brenz (Brenna Red) on drums, had been replaced by Jacqui Valentine (bass) and Cat Scandal (drums) who was later replaced by Danni Harrowyn[3]\n"
   ]
}