{
   "Name": "The Coathangers",
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "3.1 Albums",
      "3.2 Live Albums",
      "3.3 Singles",
      "3.4 Split Singles",
      "3.5 EPs",
      "3.6 Julia Kugel (solo singles) as White Woods",
      "4 Guest appearances",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Coathangers are an American all-female punk rock/garage band band from Atlanta, Georgia featuring singer/guitarist Julia Kugel-Montoya (Crook Kid Coathanger), bassist Meredith Franco (Minnie Coathanger) and singer/drummer Stephanie Luke (Rusty Coathanger).\n",
         "Long-time keyboardist Candice Jones (Bebe Coathanger), left the band amicably in 2013.[1] \"This happened about three years ago, and it wasn't on bad terms,\" explains Stephanie Luke of the exit. \"Candice just wanted to go on to pursue college and other things. We still are friends to this day and we just found out she is engaged so we are very happy for her!\"\n",
         "The name \"Coathangers\" refers to a method of self-induced abortion and was chosen for its irreverent vulgarity; all of the band's members are pro-choice.[2]\n",
         "Flippantly formed in 2006, they were asked to open for The Hiss on the strength of their performance playing a house show. Since then they have headlined shows in the United States and abroad. In addition, several times they have appeared as the support act for fellow Atlanta band Black Lips's New York City concerts.[3]\n"
      ]
   },
   "History": {
      "text": [
         "They released a 7\" record on Atlanta’s Die Slaughterhaus label and their first full length self-titled on Rob's House Records.[4]\n",
         "After touring and putting out a second single on Seattle based Suicide Squeeze Records, the Coathangers released their second full length Scramble in April 2009.\n",
         "In 2011 their third album, Larceny & Old Lace was released (also on Suicide Squeeze),[5] to generally positive reviews.[6]\n",
         "In 2012, Julia Kugel released a solo 7\" single, \"Where Did You Go\" (Suicide Squeeze Records) under the name White Woods. A second single, \"Big Talking\", was released the following year.[7]\n",
         "March 2014 saw the release of the band's fourth full-length album entitled Suck My Shirt, for Suicide Squeeze Records.  The most critically and commercially well received to date, the band embarked on tour dates supporting fellow Atlantans the Black Lips on the heels of the release, and continued on through 2014 with festival appearances and headline dates. Also in 2014 the band provided backing vocals for \"Aunt Lisa\", a track on the Atlanta metal band Mastodon's album Once More 'Round the Sun.[8]\n",
         "On April 15, 2016 the band released their fifth studio full-length entitled Nosebleed Weekend.[1] Nosebleed Weekend debuted at #149 on the Nielsen Soundscan Top 200 sales charts (and #6 on the Top New Artist Albums and #4 on the Alternative New Artist Albums chart).  Among the press highlights of the release were two separate appearances on Last Call with Carson Daly [2]. The band quickly hit the road with the seminal punk band Refused for a tour of the U.S. in May and June 2016 \"[3]\", and toured heavily throughout 2017 in support of the album.\n",
         "On June 30, 2017, The Coathangers released Parasite EP on Suicide Squeeze Records. The five-track EP includes an alternate version of \"Down Down\" from the band's 2016 album Nosebleed Weekend.\n",
         "Suicide Squeeze Records released The Coathangers first official live album, aptlty titled Live, on June 1, 2018. The album was released on cassette and on black/red/white tri-colored vinyl, limited to 1500 copies.[9]\n",
         "During 2018, in between touring, the band worked on their 6th studio album at Valentine Studios in Hollywood, California.[10] The album was later revealed to be titled The Devil You Know, and was released on March 8, 2019.[11] The album was produced, recorded and mixed by Nic Jodoin, who produced the band's previous album, Nosebleed Weekend.\n"
      ]
   },
   "Members": {
      "text": [
         "Current members\n",
         "Former members\n",
         "Timeline\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Live Albums": {},
      "Singles": {},
      "Split Singles": {},
      "EPs": {},
      "Julia Kugel (solo singles) as White Woods": {}
   },
   "Guest appearances": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Coathangers are an American all-female punk rock/garage band band from Atlanta, Georgia featuring singer/guitarist Julia Kugel-Montoya (Crook Kid Coathanger), bassist Meredith Franco (Minnie Coathanger) and singer/drummer Stephanie Luke (Rusty Coathanger).\n",
      "Long-time keyboardist Candice Jones (Bebe Coathanger), left the band amicably in 2013.[1] \"This happened about three years ago, and it wasn't on bad terms,\" explains Stephanie Luke of the exit. \"Candice just wanted to go on to pursue college and other things. We still are friends to this day and we just found out she is engaged so we are very happy for her!\"\n",
      "The name \"Coathangers\" refers to a method of self-induced abortion and was chosen for its irreverent vulgarity; all of the band's members are pro-choice.[2]\n",
      "Flippantly formed in 2006, they were asked to open for The Hiss on the strength of their performance playing a house show. Since then they have headlined shows in the United States and abroad. In addition, several times they have appeared as the support act for fellow Atlanta band Black Lips's New York City concerts.[3]\n"
   ],
   "infobox": {
      "Origin": [
         "Atlanta, Georgia, United States"
      ],
      "Genres": [
         "Punk rock, garage punk, indie rock"
      ],
      "Years active": [
         "2006 (2006)–present"
      ],
      "Labels": [
         "Suicide Squeeze Records"
      ],
      "Website": [
         "thecoathangers.com"
      ],
      "Members": [
         "Julia Kugel-Montoya",
         "Meredith Franco",
         "Stephanie Luke"
      ],
      "Past members": [
         "Candice Jones"
      ]
   }
}