{
   "Name": "Cowboy Crush",
   "rawData": [
      "Cowboy Crush is an American country music band signed to Curb Records' Asylum/Curb division. The group is composed of Trenna Barnes (lead vocals), Debbie Johnson (bass guitar, vocals), Becky Priest (keyboards, vocals), and Renaé Truex (fiddle, mandolin). Until 2006, Darla Perlozzi (drums) was also a member of the group. Perlozzi co-wrote Big & Rich's 2007 single \"Loud\".\n",
      "All five founding members of Cowboy Crush had previously worked throughout Nashville, Tennessee before meeting at Belmont University. They held their first practice together in a garage on March 18, 2003. Cowboy Crush is also known for its high-energy concerts and backstage antics. The group's debut single, \"Nobody Ever Died of a Broken Heart\", was previously recorded by Trick Pony. Cowboy Crush's debut album was released to digital retailers on July 14, 2009.\n"
   ],
   "infobox": {
      "Origin": [
         "Nashville, Tennessee, United States"
      ],
      "Genres": [
         "Country"
      ],
      "Years active": [
         "2003-present"
      ],
      "Labels": [
         "Asylum-Curb"
      ],
      "Associated acts": [
         "Big & Rich, Trick Pony"
      ],
      "Website": [
         "http://cowboycrush.com"
      ],
      "Members": [
         "Trenna Barnes",
         "Debbie Johnson",
         "Becky Priest",
         "Renaé Truex"
      ],
      "Past members": [
         "Darla Perlozzi"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band signed to Curb Records' Asylum/Curb division. The group is composed of Trenna Barnes (lead vocals), Debbie Johnson (bass guitar, vocals), [PERSON_NAME_FULL_0_FEMALE] (keyboards, vocals), and Renaé Truex (fiddle, mandolin). Until [YEAR], [PERSON_NAME_FULL_1_FEMALE] (drums) was also a member of the group. [PERSON_NAME_LAST_1] co-wrote Big & Rich's [YEAR] single [SONG_NAME].\n",
      "All five founding members of [BAND_NAME] had previously worked throughout Nashville, Tennessee before meeting at Belmont University. They held their first practice together in a garage on [MONTH] 18, [YEAR]. [BAND_NAME] is also known for its high-energy concerts and backstage antics. The group's debut single, [SONG_NAME], was previously recorded by Trick Pony. [BAND_NAME]'s debut album was released to digital retailers on [MONTH] 14, [YEAR].\n"
   ]
}