{
   "Name": "Crucified Barbara",
   "Sections": [
      "1 Background",
      "2 Final lineup",
      "3 Former members",
      "4 Timeline",
      "5 Discography",
      "5.1 Album",
      "5.2 Singles",
      "6 Tours",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Crucified Barbara was an all-female Swedish hard rock and heavy metal band, formed in Stockholm in 1998.\n"
      ]
   },
   "Background": {
      "text": [
         "Crucified Barbara started out in 1998 as a punk rock band, but soon they changed their primary style to hard rock. They signed in 2003 with GMR Music Group of Stockholm. Recordings took place in Kristianopel, Sweden at Pama Studios/Blakk Records with producer-engineer Mankan Sedenberg during the spring of 2004. Their advance debut single from their first album In Distortion We Trust, was \"Losing the Game\". It was released on 8 December 2005 and went straight to No. 8 on the Swedish music charts. The video to accompany it was recorded and produced by M Industries. The album was released in Sweden on 19 January and is  available outside Sweden in several countries including the UK, the US, France, Germany, and Benelux. In 2006, they contributed two songs, \"Killed by Death\" and \"Please Don't Touch\", to St. Valentines Day Massacre, a tribute album to Motörhead.\n",
         "Crucified Barbara's second album, Til Death Do Us Party, was released in Scandinavia on 11 February 2009 and in the rest of Europe on 27 February.[1] It was produced in part by Mats Levén (known for producing albums by Yngwie Malmsteen, Krux, and Therion, among other bands within that genre.[2] Mats also sang vocals on the song \"Jennyfer\".\n",
         "In November 2009, Crucified Barbara went out on a six weeks European tour to promote the new album Til Death Do Us Party. They played in Germany, Belgium, the Netherlands, France, Spain, Italy, Switzerland, Czech Republic and Sweden. A documentary film was made about the tour by film-maker Mats Lundberg from Doom Films. The documentary was released in 2010.\n",
         "The Band competed in Melodifestivalen 2010 with the song Heaven or Hell, They made it to the Second Chance from their semifinal in Gothenburg but lost out to Pernilla Wahlgren in the deciding round after beating out Pauline Kamusewu in the first Round. \n",
         "The band announced their split in June 2016.[3]\n",
         "Mia announced her solo project under her new name Mia Karlsson a few days later.\n",
         "In April 2017 Nicki, Ida and Klara announced their new band The Heard on Facebook.\n"
      ]
   },
   "Final lineup": {},
   "Former members": {},
   "Timeline": {},
   "Discography": {
      "Album": {},
      "Singles": {}
   },
   "Tours": {
      "text": [
         "In November 2006, they supported Motörhead along with Clutch.[14] They played at the heavy metal festival Sweden Rock in June, 2006 and again in 2009,[15] with bands such as Heaven & Hell, In Flames and Dream Theater. In 2010 they played at Wacken Open Air. In 2013 they played at Graspop Metal Meeting and Metalfest in Czech Republic.\n",
         "In 2015, Crucified Barbara joined Girlschool on the North America 'Guilty As Sin' tour.\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Crucified Barbara was an all-female Swedish hard rock and heavy metal band, formed in Stockholm in 1998.\n",
      "Crucified Barbara started out in 1998 as a punk rock band, but soon they changed their primary style to hard rock. They signed in 2003 with GMR Music Group of Stockholm. Recordings took place in Kristianopel, Sweden at Pama Studios/Blakk Records with producer-engineer Mankan Sedenberg during the spring of 2004. Their advance debut single from their first album In Distortion We Trust, was \"Losing the Game\". It was released on 8 December 2005 and went straight to No. 8 on the Swedish music charts. The video to accompany it was recorded and produced by M Industries. The album was released in Sweden on 19 January and is  available outside Sweden in several countries including the UK, the US, France, Germany, and Benelux. In 2006, they contributed two songs, \"Killed by Death\" and \"Please Don't Touch\", to St. Valentines Day Massacre, a tribute album to Motörhead.\n",
      "Crucified Barbara's second album, Til Death Do Us Party, was released in Scandinavia on 11 February 2009 and in the rest of Europe on 27 February.[1] It was produced in part by Mats Levén (known for producing albums by Yngwie Malmsteen, Krux, and Therion, among other bands within that genre.[2] Mats also sang vocals on the song \"Jennyfer\".\n",
      "In November 2009, Crucified Barbara went out on a six weeks European tour to promote the new album Til Death Do Us Party. They played in Germany, Belgium, the Netherlands, France, Spain, Italy, Switzerland, Czech Republic and Sweden. A documentary film was made about the tour by film-maker Mats Lundberg from Doom Films. The documentary was released in 2010.\n"
   ]
}