{
   "Name": "Cypher in the Snow",
   "Sections": [
      "1 History",
      "2 Discography",
      "3 Films",
      "4 Sources",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Cypher in the Snow were an American all women queercore band from San Francisco, California, United States.\n"
      ]
   },
   "History": {
      "text": [
         "One of the band's first appearances was at the Dirtybird Queercore Festival in San Francisco in 1996.[1] This historic festival also featured Tribe 8, Sta-Prest, Behead the Prophet, No Lord Shall Live, The Need and many others. Cypher in the Snow was made up of between six and seven members, and the line-up changed twice during the band's history. The original members included Anna Joy Springer, formerly the singer for punk bands Blatz and Gr'ups on vocals; Daniela Sea (as Dan-yella Dyslexia), also from the Gr'ups, played guitar; Rusten (as Shari Lambchop) was the drummer; Ulla McKnight (as Ulla Imd) on vocals; Margaret Hitchcock was the trumpet player; Chloe Sherman (as Chloe Little Hope) played bass; and Lala Hulse on banjo and lap steel. Juliana Snapper joined as vocalist on the song \"Rock Opera\". When Rusten left the band to play with The Third Sex, Paula Cronan, who also played with Death Card 13 and The Dodge Brothers, became the new drummer. \nThe second incarnation of Cypher in the Snow featured Dorothy Wang on guitar, Elitrea Frye on guitar, and Carmen White as vocalist, lyricist, and front person. The group toured the Pacific Northwest and played local shows in this configuration before disbanding.\n",
         "Toni Gogin of Sleater-Kinney who played guest guitar with the band on tour, after the release of their first CD. The band featured a wide range of instruments including accordion, lap steel guitar, banjo and trumpet, as well as the standard drums, guitar and bass.\n",
         "Cypher in the Snow released several recordings including a single with Outpunk, the first independent record label devoted to queer punk; an album on Candy Ass Records; and a split single with Sleater-Kinney, the Free to Fight single, dedicated to self-defense for women. They also performed live and were interviewed in the film She's Real, Worse Than Queer by Lucy Thane.\n",
         "After the group parted ways Anna Joy, now Anna Joy Springer toured with Sister Spit, the all-women writers and poets touring company. She's an author and Associate Professor at University of California, San Diego in the Literature Department. Juliana Snapper and Paula Cronan began collaborations on intermedia art projects. Lala Hulse joined the band The Whoreshoes. Margaret Hitchcock started the all dyke/genderqueer bands Dyspecific and The Galloping Sea in San Francisco. Daniela Sea became an actor, appearing on the television show The L Word, as the transgender character introduced as \"Moira Sweeney\", now \"Max Sweeney\". Rusten played in several punk bands, including the all female Harum-Scarum. Ulla McKnight (Imd) was awarded a PhD in Sociology from Goldsmiths, University of London. Her research focuses on the requirements of HIV specialist antenatal care in high resource locations.[2]\n"
      ]
   },
   "Discography": {},
   "Films": {},
   "Sources": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Cypher in the Snow were an American all women queercore band from San Francisco, California, United States.\n",
      "One of the band's first appearances was at the Dirtybird Queercore Festival in San Francisco in 1996.[1] This historic festival also featured Tribe 8, Sta-Prest, Behead the Prophet, No Lord Shall Live, The Need and many others. Cypher in the Snow was made up of between six and seven members, and the line-up changed twice during the band's history. The original members included Anna Joy Springer, formerly the singer for punk bands Blatz and Gr'ups on vocals; Daniela Sea (as Dan-yella Dyslexia), also from the Gr'ups, played guitar; Rusten (as Shari Lambchop) was the drummer; Ulla McKnight (as Ulla Imd) on vocals; Margaret Hitchcock was the trumpet player; Chloe Sherman (as Chloe Little Hope) played bass; and Lala Hulse on banjo and lap steel. Juliana Snapper joined as vocalist on the song \"Rock Opera\". When Rusten left the band to play with The Third Sex, Paula Cronan, who also played with Death Card 13 and The Dodge Brothers, became the new drummer. \nThe second incarnation of Cypher in the Snow featured Dorothy Wang on guitar, Elitrea Frye on guitar, and Carmen White as vocalist, lyricist, and front person. The group toured the Pacific Northwest and played local shows in this configuration before disbanding.\n",
      "Toni Gogin of Sleater-Kinney who played guest guitar with the band on tour, after the release of their first CD. The band featured a wide range of instruments including accordion, lap steel guitar, banjo and trumpet, as well as the standard drums, guitar and bass.\n",
      "Cypher in the Snow released several recordings including a single with Outpunk, the first independent record label devoted to queer punk; an album on Candy Ass Records; and a split single with Sleater-Kinney, the Free to Fight single, dedicated to self-defense for women. They also performed live and were interviewed in the film She's Real, Worse Than Queer by Lucy Thane.\n"
   ]
}