{
   "Name": "The Devotchkas",
   "rawData": [
      "The Devotchkas were a four-piece American street punk band from Long Island, New York, United States. Their name was derived from the popular film and novel A Clockwork Orange. Devotchka in Nadsat means \"girl\", which is itself derived from the Russian word (девочка) of the same meaning.\n",
      "An all-girl group, the band was formed by three friends in 1996. The early period saw drummers come and go, including Jon from The Krays. Wanting a regular drummer, they eventually recruited Gabrielle in 1999 to complete the line-up.\n",
      "In 1998, they were signed to Punk Core Records for the release of their debut EP, which sold in excess of 5,000 copies, a surprisingly high number for a band's debut EP, especially on vinyl format. After the release of their second EP, Annihilation, in 1999 singer Stephanie left the band to be replaced by JJ. JJ sang on their 2001 album Live Fast, Die Young. At that point, with original singer Stephanie out of the fold, the band decided to change their name to the 99's. JJ left the band shortly thereafter and was replaced by Jessica. At that point the band reverted their name to The Devotchkas but split up soon after.\n"
   ],
   "infobox": {
      "Also known as": [
         "The 99's"
      ],
      "Origin": [
         "Long Island, New York, United States"
      ],
      "Genres": [
         "Street punk"
      ],
      "Years active": [
         "1996–2001"
      ],
      "Labels": [
         "Punk Core Records"
      ],
      "Associated acts": [
         "The Krays"
      ],
      "Past members": [
         "Jon",
         "Gabrielle",
         "Jessica",
         "Mande",
         "Alaine",
         "JJ",
         "Stephanie"
      ]
   },
   "prunedData": [
      "[BAND_NAME] were a [GENRE] band from Long Island, New York, United States. Their name was derived from the popular film and novel A Clockwork Orange. Devotchka in Nadsat means \"girl\", which is itself derived from the Russian word (девочка) of the same meaning.\n",
      "An all-girl group, the band was formed by three friends in [YEAR]. The early period saw drummers come and go, including [PERSON_NAME_FULL_0_MALE] from The Krays. Wanting a regular drummer, they eventually recruited [PERSON_NAME_FULL_2_FEMALE] in [YEAR] to complete the line-up.\n",
      "In [YEAR], they were signed to Punk Core Records for the release of their debut EP, which sold in excess of 5,000 copies, a [GENRE] a band's debut EP, especially on vinyl format. After the release of their second EP, Annihilation, in [YEAR] singer [PERSON_NAME_FULL_1_FEMALE] left the band to be replaced by JJ. JJ sang on their [YEAR] album Live Fast, Die Young. At that point, with original singer [PERSON_NAME_FULL_1_FEMALE] out of the fold, the band decided to change their name to the 99's. JJ left the band shortly thereafter and was replaced by [PERSON_NAME_FULL_3_FEMALE]. At that point the band reverted their name to [BAND_NAME] but split up soon after.\n"
   ]
}