{
   "Name": "The Donnas",
   "rawData": [
      "The Donnas were an American rock band formed in Palo Alto, California, United States, in 1993. The band consisted of Brett Anderson (lead vocals), Allison Robertson (guitar, backing vocals),  Maya Ford (bass guitar, backing vocals) and Amy Cesari (drums, percussion, backing vocals). Cesari replaced Torry Castellano, who left the band in 2009 due to tendonitis.  They drew inspiration from the Ramones, The Runaways, Girlschool, AC/DC, Bachman–Turner Overdrive and Kiss. Rolling Stone has stated that \"the Donnas offer a guileless take on adolescent alienation; they traffic in kicks, not catharsis, fun rather than rage\". MTV has stated that the band offers \"a good old-fashioned rock & roll party\". After gathering a cult following in the punk scene since their 1997 debut, the band achieved major label commercial success in the early 2000s and afterward as their music mixed punk, metal and classic rock sounds.\n",
      "All the founding band members were born in 1979; Brett Anderson (vocals) on May 30; Allison Robertson (guitar and vocals) on August 26; and Maya Ford (bass guitar and vocals) and Torry Castellano (drums, percussion, vocals), both on January 8. They all became friends by eighth grade and formed as a band in May 1993 to play for their school's \"Day on the Green.\" One of two all-female bands in their town Palo Alto, California, they were relatively unknown until they were out of high school. They are all self-taught musicians and practiced in Castellano's garage nearly every day during their years at Palo Alto High School. They called themselves \"Ragady Anne\" in their early days and shortly thereafter changed their name to \"The Electrocutes\".\n",
      "Towards the end of their high school days, while they were still known as The Electrocutes, they decided to create another band (with the same members) that would play softer tunes without distorting the metal queen image of The Electrocutes. To help their fans distinguish between the two bands, they all took matching \"Donna\" monikers, where all of their names were Donna and their last names were the first initial of their last name (Brett Anderson became Donna A, etc.), which they used only when performing as \"The Donnas.\"\n"
   ],
   "infobox": {
      "Also known as": [
         "The Electrocutes",
         "Ragady Anne",
         "Screen"
      ],
      "Origin": [
         "Palo Alto, California, U.S."
      ],
      "Genres": [
         "Rock",
         "hard rock",
         "pop punk",
         "garage punk (early)"
      ],
      "Years active": [
         "1993 (1993)–2012 (2012)[1]"
      ],
      "Labels": [
         "Atlantic",
         "Lookout!",
         "Sympathy for the Record Industry",
         "Radio Trash",
         "Purple Feather",
         "Super*teem![2]"
      ],
      "Past members": [
         "Brett Anderson",
         "Allison Robertson",
         "Maya Ford",
         "Amy Cesari",
         "Torry Castellano"
      ]
   }
}