{
   "Name": "Drain STH",
   "rawData": [
      "Drain STH (STH for Stockholm) was a rock band from Sweden.\n",
      "Stockholm quartet Drain STH underwent many changes in both musical style and image. Guitarist Flavia Canel and drummer Martina Axén had been together in many acts starting with punk band Livin' Sacrifice (not to be confused with the thrash metal band Living Sacrifice). As this act progressed the sound developed into more of a hard rock vein.\n",
      "Livin' Sacrifice evolved into Aphrodite with Axén, Canel, vocalist Malin Ekholm, guitarist Maria \"Mia\" Landberg, and bassist Marianne Hall. Aphrodite folded upon Ekholm's departure in 1990.\n"
   ],
   "infobox": {
      "Also known as": [
         "Drain"
      ],
      "Origin": [
         "Stockholm, Sweden"
      ],
      "Genres": [
         "Grunge",
         "alternative metal",
         "hard rock",
         "nu metal"
      ],
      "Years active": [
         "1993–2000"
      ],
      "Labels": [
         "MVG Records, Mercury, Island Def Jam Music Group"
      ],
      "Associated acts": [
         "Superfix, Blowsight, Dr. Fungus, Hanzel Und Gretyl, Snake River Conspiracy, Revolting Cocks, Opiate for the Masses"
      ],
      "Members": [
         "Maria Sjöholm – Lead vocals",
         "Anna Kjellberg – Bass",
         "Flavia Canel – Lead Guitar",
         "Martina Axen – Drums/Backing vocals"
      ]
   },
   "albums": [
      "Serve The Shame"
   ],
   "prunedData": [
      "[BAND_NAME] (STH for Stockholm) was a [GENRE] band from Sweden.\n",
      "Stockholm quartet [BAND_NAME] underwent many changes in both musical style and image. Guitarist Flavia Canel and drummer [MONTH]tina Axén had been together in many acts starting with punk band Livin' Sacrifice (not to be confused with the thrash metal band Living Sacrifice). As this act progressed the sound developed into more of a [GENRE]",
      "Livin' Sacrifice evolved into Aphrodite with Axén, Canel, vocalist [PERSON_NAME_FULL_0_FEMALE], guitarist [MONTH]ia [SONG_NAME] Landberg, and bassist [MONTH]ianne Hall. Aphrodite folded upon [PERSON_NAME_LAST_0]'s departure in [YEAR].\n"
   ]
}