{
   "Biography": {
      "text": [
         "Stockholm quartet Drain STH underwent many changes in both musical style and image. Guitarist Flavia Canel and drummer Martina Axén had been together in many acts starting with punk band Livin' Sacrifice (not to be confused with the thrash metal band Living Sacrifice). As this act progressed the sound developed into more of a hard rock vein.\n",
         "Livin' Sacrifice evolved into Aphrodite with Axén, Canel, vocalist Malin Ekholm, guitarist Maria \"Mia\" Landberg, and bassist Marianne Hall. Aphrodite folded upon Ekholm's departure in 1990.\n",
         "Axén, Canel and Anna K formed a new band called Ragdoll in 1991 that included vocalist Annie Gutå.\n",
         "With Gutås's departure, Axén, Canel and Anna K joined forces with former Necro Nancy guitarist-turned-vocalist Maria Sjöholm (later wife of Black Sabbath guitarist Tony Iommi). They changed the name to Drain and signed a deal with MVG Records in 1994. For the American market the band was known as Drain STH. Live promotion in North America included second stage appearances at the Ozzfest event in 1997 and 1999, and tours with Type O Negative, Corrosion of Conformity, Machine Head, Megadeth, Godsmack and Black Sabbath among others. The 1999 album Freaks Of Nature would be noted for the inclusion of the track \"Black\", co-written by Iommi, along with two tracks — \"Simon Says\" and \"Right Through You\" — co-written by Max Martin. In Metal Edge magazine's 1999 Readers' Choice Awards, they were voted \"Female Performers of the Year\" and \"Most Underrated Band\".[1] The single \"Simon Says\" was used as the entrance music for Extreme Championship Wrestling wrestler Simon Diamond. Despite heavy publicity, the band folded in 2000.\n",
         "Axén (switching to vocals) and Anna K created Superfix with guitarist China and drummer Sid from Sinisstar. Progress with this new unit was slow, a second demo and Los Angeles showcase gig being delivered in August 2002 with the project laid to rest soon after.\n",
         "During 2001 Canel re-emerged, touting her new project, the Brooklyn-based Anotherday. In early 2002 Axén announced the formation of a side-project dubbed Dr. Fungus, with Coal Chamber bassist Nadja Puelen, Adema drummer Kris Kohls, and Unida guitarist Arthur Seay.\n",
         "By mid-2003 Canel, working alongside vocalist / guitarist Niklas Fagerström, ex-SELPH guitarist Serban Carapancea and drummer Fabien Perreau, was touting a fresh Stockholm-based band entitled Blowsight. That summer bassist Anna K joined New York industrial band Hanzel und Gretyl for their Fukken Über tour, remaining a member until 2005. In 2006 Anna K was recruited by Al Jourgensen for the re-union tour of Revolting Cocks and in 2007 she joined the LA based Opiate for the Masses. Axén joined Snake River Conspiracy in June 2004, replacing Tobey Torres, and quit in early 2006 to focus on her solo work.[2]\n"
      ]
   },
   "Careers of members": {},
   "Chart positions": {
      "text": [
         "Album – Billboard (USA)\n",
         "Singles – Billboard (USA)\n"
      ]
   },
   "Discography": {
      "text": [
         "features tracks that will be used in the Horror Wrestling LP: \"Serve The Shame\" & \"Unreal\" (from the original edition), \"Klotera\" & \"So I Will Burn (Alone)\" (from the reissue expanded edition) and the 7 seconds long \"To Be Continued...\" (an a cappella chorus used into the song \"Someone\")[3][4]\n",
         "The expanded edition collects most of the non-album songs around that time. But some were left out: \"I Don't Mind (Clawfinger Remix)\" by Jocke Skog, \"Without Eyes\" (\"Crack The Liars Smile\" b-side) and one of the two \"Serve The Shame\" acoustic versions (the other was collected but under the generic name of \"acoustic version\" while a single featured an \"Unplugged\" and a \"Further Unplugged\" version)[5]\n",
         "A single release of \"Enter My Mind\" featured the B-side \"Down\"[8] (both are featured as the opening tracks of the sampler disc \"Ozzfest Rock Pile Sampler\"[9]\n"
      ]
   },
   "External links": {},
   "Line-Up": {},
   "References": {},
   "Sections": [
      "1 Biography",
      "2 Line-Up",
      "3 Discography",
      "4 Chart positions",
      "5 Careers of members",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Drain STH (STH for Stockholm) was a rock band from Sweden.\n"
      ]
   },
   "Title": "Drain STH - Wikipedia"
}