{
   "Name": "Dum Dum Girls",
   "Sections": [
      "1 History",
      "2 Other projects",
      "3 Band members",
      "3.1 Final line-up",
      "3.2 Former members",
      "3.3 Timeline",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 EPs",
      "4.3 Singles",
      "4.4 Compilation albums",
      "4.5 Compilation appearances",
      "4.6 Videos",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Dum Dum Girls was an American rock band, formed in 2008. It began as the bedroom recording project of singer and songwriter Dee Dee (née Kristin Gundred).[1] She is currently based in Los Angeles. The name is a double homage to the Vaselines' album Dum Dum and the Iggy Pop song \"Dum Dum Boys\".[2][3]\n"
      ]
   },
   "History": {
      "text": [
         "The first release under the Dum Dum Girls moniker was a five-song CDR on her own label, Zoo Music, in late 2008. It was followed by an EP on Captured Tracks and a 7\" on HoZac Records[4] She quickly gained attention with these releases and signed to Sub Pop in July 2009.[5]\n",
         "Dum Dum Girls' debut album, I Will Be, was released in March 2010 and was well received by critics.[6] Pitchfork described the songs as \"genuine earworms, both unfailingly hip and often wonderfully associative\".[3] Dee Dee produced the record with Richard Gottehrer, who had previously worked with Richard Hell, Blondie, the Go-Gos and the Raveonettes. Gottehrer also co-wrote the early 1960s hit songs \"My Boyfriend's Back\" and \"I Want Candy\".[7][8] The record included guest guitarists Nick Zinner of Yeah Yeah Yeahs on \"Yours Alone\"; Dee Dee's ex-husband, Brandon Welchez of Crocodiles, on \"Blank Girl\"; and Andrew Miller on multiple tracks. The cover of the album featured a college snapshot of Dee Dee's mother, who died from cancer in 2010.[9] After its release, Dee Dee assembled a touring band, and their first shows were in support of Girls.\n",
         "In 2011, the EP He Gets Me High was released, which included a cover of \"There Is a Light That Never Goes Out\" by the Smiths. This record marked the addition of Sune Rose Wagner of the Raveonettes to the production team.\n",
         "Second album Only in Dreams was released in September 2011, featuring the singles \"Coming Down\" and \"Bedroom Eyes\". This album is the only Dum Dum Girls recording to feature the full band. On December 1, 2011, Dum Dum Girls performed \"Bedroom Eyes\" on Late Night with Jimmy Fallon.[10]\n",
         "In September 2012, the EP End of Daze was released, preceded by the single \"Lord Knows\" on July 31, 2012, which Pitchfork awarded \"Best New Track\".[11] The EP received \"Best New Music\" from Pitchfork as well.[12]\n",
         "On October 31, 2013, Dum Dum Girls announced their third full-length album Too True, set for release on January 28, 2014[13] and featuring the single \"Lost Boys & Girls Club\", whose video premiered with H&M on October 31, 2013.[13][14] For this album, Dee Dee cited Suede, Blondie,  Siouxsie and the Banshees, the Pretenders, Madonna and the Stone Roses as her influences.[15]\n",
         "On December 5, 2014, Converse released a Dum Dum Girls split single, \"On Christmas\", as the third part of three digital installments of the company's holiday-themed compilation EP, Noise to the World 2.[16]\n"
      ]
   },
   "Other projects": {
      "text": [
         "The Mayfair Set, a duo with Mike Sniper of Blank Dogs, released an eponymous single followed by the Young One 12\" EP, both in 2009.[17]\n",
         "Dee Dee and Tamaryn released a cover of the Jesus and Mary Chain song \"Teenage Lust\" in 2011 under the name Les Demoniaques. Also that year, Dee Dee, Sniper and J.B. Townsend of Crystal Stilts recorded a one-sided 7\" single, \"Faraway Friend,\" under the name Zodiacs, which was given away via Captured Tracks mail order. Dee Dee and her husband released a 2013 single, \"Something That Feels Bad Is Something That Feels Good\", as Haunted Hearts,[18] followed by the Initiation full-length in 2014.\n",
         "In 2012, Dum Dum Girls drummer Sandra Vu created the band Sisu, which she described as combining \"echo-ridden, cold, distorted synth sounds—with pop melodies\".[19]\n",
         "In 2013, Dee Dee composed the opening theme for the animated series Beware the Batman.[20]\n",
         "She was also featured on \"Play for Today\", a duet from Belle and Sebastian's 2015 album, Girls in Peacetime Want to Dance.[21]\n",
         "In May 2015, Dee Dee and collaborator UUV/Andrew Miller released a single, \"Is There Any Other One?\", as HUNI.[22]She also featured on Lemonade's single \"Dancer on the Shore\"[23]in August 2015. In November 2015, Sub Pop released a collaboration 7\" single, \"Red Sun\" b/w \"Echo\", with the 4AD band Merchandise.[24]\n",
         "On January 28, 2016, Dee Dee announced the closure of the Dum Dum Girls and the creation of a new solo project, Kristin Kontrol.[25] Her debut album, X-Communicate, was released by Sub Pop on May 27, 2016.[26]\n"
      ]
   },
   "Band members": {
      "Final line-up": {},
      "Former members": {},
      "Timeline": {}
   },
   "Discography": {
      "Studio albums": {},
      "EPs": {},
      "Singles": {},
      "Compilation albums": {},
      "Compilation appearances": {},
      "Videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Dum Dum Girls was an American rock band, formed in 2008. It began as the bedroom recording project of singer and songwriter Dee Dee (née Kristin Gundred).[1] She is currently based in Los Angeles. The name is a double homage to the Vaselines' album Dum Dum and the Iggy Pop song \"Dum Dum Boys\".[2][3]\n",
      "The first release under the Dum Dum Girls moniker was a five-song CDR on her own label, Zoo Music, in late 2008. It was followed by an EP on Captured Tracks and a 7\" on HoZac Records[4] She quickly gained attention with these releases and signed to Sub Pop in July 2009.[5]\n",
      "Dum Dum Girls' debut album, I Will Be, was released in March 2010 and was well received by critics.[6] Pitchfork described the songs as \"genuine earworms, both unfailingly hip and often wonderfully associative\".[3] Dee Dee produced the record with Richard Gottehrer, who had previously worked with Richard Hell, Blondie, the Go-Gos and the Raveonettes. Gottehrer also co-wrote the early 1960s hit songs \"My Boyfriend's Back\" and \"I Want Candy\".[7][8] The record included guest guitarists Nick Zinner of Yeah Yeah Yeahs on \"Yours Alone\"; Dee Dee's ex-husband, Brandon Welchez of Crocodiles, on \"Blank Girl\"; and Andrew Miller on multiple tracks. The cover of the album featured a college snapshot of Dee Dee's mother, who died from cancer in 2010.[9] After its release, Dee Dee assembled a touring band, and their first shows were in support of Girls.\n",
      "In 2011, the EP He Gets Me High was released, which included a cover of \"There Is a Light That Never Goes Out\" by the Smiths. This record marked the addition of Sune Rose Wagner of the Raveonettes to the production team.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Indie rock, noise pop, dream pop, shoegaze, alternative rock"
      ],
      "Years active": [
         "2008–2016"
      ],
      "Labels": [
         "HoZac, Zoo Music, Captured Tracks, Sub Pop, Hell, Yes!"
      ],
      "Associated acts": [
         "Kristin Kontrol, The Mayfair Set, Les Demoniaques, Zodiacs, Haunted Hearts, Sisu, HUNI"
      ],
      "Past members": [
         "Kristin \"Dee Dee\" Gundred",
         "Jules Medeiros",
         "Sandra Vu",
         "Andrew Miller",
         "Bambi",
         "Frankie Rose",
         "Jeremy Rojas",
         "Andrew Montoya",
         "Brandon Welchez",
         "Mike Sniper",
         "Chuck Rowell",
         "Malia James"
      ]
   }
}