{
   "Name": "Exist Trace",
   "Sections": [
      "1 Biography",
      "1.1 Members",
      "1.2 Musical style and direction",
      "1.3 Career",
      "1.4 International acclaim",
      "1.5 Official fan club",
      "2 Releases",
      "2.1 Albums",
      "2.2 EPs",
      "2.3 Singles",
      "2.4 Demo tapes",
      "2.5 Omnibuses",
      "2.6 DVDs",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Exist Trace (イグジストトレイス, Iguzisuto Toreisu, stylized as exist†trace) is a Japanese visual kei rock band, consisting entirely of female members. The members originate from Tokyo, and initially formed in June 2003. The founding members are Jyou, Naoto, and Mally, who met Miko and Omi after placing an advertisement for guitarists.[1]\n",
         "To date, Exist Trace has released four albums, eight EPs, and nine singles.[2] In addition, the band has appeared on eleven compilation albums and three omnibus DVDs, plus their self-released 2012 concert DVD Just Like a Virgin.\n",
         "Exist Trace made their U.S. debut at Sakura-Con 2011 in Seattle, Washington. On June 15, 2011, they made their major label debut on Tokuma Japan Communications with the EP True. Their song \"I Feel You\" was featured in Nadeshiko Japan's official 2012 guidebook DVD.[3] Their highest charting release was Virgin, which reached number 84 on the Oricon album chart.[4]\n"
      ]
   },
   "Biography": {
      "Members": {},
      "Musical style and direction": {
         "text": [
            "Exist Trace's early music can be described as melodic death metal,[citation needed] with vocalist Jyou's growls and shouts throughout many songs, which contributes to their dark undertone. They have since added more complex sounds to the compositions, their guitar sound often featuring heavy distortion and technically virtuoso riffs and solos. The lyrics are mainly based on gothic themes, and their music style has resemblance to gothic rock. In recent work, they have experimented with different electronic and melodic approaches to their music, such as the jazz-influenced \"Ginger\", the electronic rock of \"Diamond\" and the '80s disco feel of \"Spiral Daisakusen\".\n"
         ]
      },
      "Career": {
         "text": [
            "In 2013, Exist Trace introduced their 'new world' musical direction, where long-time main lyricist/composer miko would officially be taking a dual-vocal position with Jyou. The twin vocal style was emphasized on 2013's single \"Diamond\". In 2014's \"Spiral Daisakusen\", the pair again share front billing and the center spot on the music video. The first album to fully incorporate the twin vocal style, World Maker (2014), revealed an improved duet system, where vocals are typically heavier towards Jyou in allocation, but making good use of miko's sweeter counterbalance. In 2016, the band released the This Is Now mini-album, which included re-recorded versions of the singles \"Twin Wings\" and \"Shout Out\", which had been previously released as live-show-only CDs. In Japan, the This Is Now EP sold out within a day, across such stores as ZEAL LINK, Disk Union and BRAND-X.[citation needed] On July 29, 2020, Exist Trace released the EP The Only Garden.[5]\n"
         ]
      },
      "International acclaim": {
         "text": [
            "Over time, the band has developed a dedicated international following, largely by word of mouth. In 2008, Exist Trace embarked on a tour of Europe, including the United Kingdom. The band also traveled to the US, playing Japanese culture conventions Sakura-Con in 2011,[6] Tekkoshocon X in 2012,[7] and A-Kon in 2013.[8]\n"
         ]
      },
      "Official fan club": {
         "text": [
            "2014 brought the introduction of the band's official international fan club, 'Archangel Diamond', to act as a supplement to the Japanese fan club 'Vanguard'. The club became an active presence on social networks such as Facebook, Twitter and Tumblr, featuring fan artworks and responding to fan questions. It officially opened for membership on May 19, 2014, the 19th of each month being generally used for Exist Trace announcements as it is 'Igu day'/イグの日 ( Japanese wordplay on the shortened form of the band's name).\n",
            "Archangel Diamond promised to connect international fans more closely with the band, and offered fan club exclusive merchandise, special prices on merchandise, monthly newsletters with messages from the band members, and special contests and interactions with the band.\n",
            "As of late 2017, the club changed its identification to \"International Support Team\", and ceased paid activities but continues to post English updates.\n"
         ]
      }
   },
   "Releases": {
      "Albums": {},
      "EPs": {},
      "Singles": {},
      "Demo tapes": {},
      "Omnibuses": {},
      "DVDs": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Exist Trace (イグジストトレイス, Iguzisuto Toreisu, stylized as exist†trace) is a Japanese visual kei rock band, consisting entirely of female members. The members originate from Tokyo, and initially formed in June 2003. The founding members are Jyou, Naoto, and Mally, who met Miko and Omi after placing an advertisement for guitarists.[1]\n",
      "To date, Exist Trace has released four albums, eight EPs, and nine singles.[2] In addition, the band has appeared on eleven compilation albums and three omnibus DVDs, plus their self-released 2012 concert DVD Just Like a Virgin.\n",
      "Exist Trace made their U.S. debut at Sakura-Con 2011 in Seattle, Washington. On June 15, 2011, they made their major label debut on Tokuma Japan Communications with the EP True. Their song \"I Feel You\" was featured in Nadeshiko Japan's official 2012 guidebook DVD.[3] Their highest charting release was Virgin, which reached number 84 on the Oricon album chart.[4]\n",
      "Exist Trace's early music can be described as melodic death metal,[citation needed] with vocalist Jyou's growls and shouts throughout many songs, which contributes to their dark undertone. They have since added more complex sounds to the compositions, their guitar sound often featuring heavy distortion and technically virtuoso riffs and solos. The lyrics are mainly based on gothic themes, and their music style has resemblance to gothic rock. In recent work, they have experimented with different electronic and melodic approaches to their music, such as the jazz-influenced \"Ginger\", the electronic rock of \"Diamond\" and the '80s disco feel of \"Spiral Daisakusen\".\n"
   ],
   "infobox": {
      "Origin": [
         "Tokyo, Japan"
      ],
      "Genres": [
         "Alternative metal",
         "alternative rock",
         "gothic metal",
         "melodic death metal (early)"
      ],
      "Years active": [
         "2003–present"
      ],
      "Labels": [
         "Sequence",
         "Monster's Inc.",
         "Tokuma Japan Communications"
      ],
      "Website": [
         "exist-trace.com"
      ],
      "Members": [
         "Jyou",
         " Naoto",
         "Mally",
         "Miko",
         "Omi"
      ]
   }
}