{
   "Name": "The Eyeliners",
   "rawData": [
      "The Eyeliners are an all-woman American pop punk band from Albuquerque, New Mexico, United States.\n",
      "The band formed in 1995 under the name Psychodrama by three sisters, guitarist Gel, bassist Lisa, and singer Laura Baca. The three auditioned both male and female drummers, but couldn’t find one suitable for their planned style of music. Laura began experimenting with the drum set they had been using for auditions, and soon picked up the drumbeat despite never having played the instrument. About halfway through the rendition of the song, she started to sing along. The sisters stopped auditioning and  Laura became both lead vocalist and drummer.\n",
      "The band played their first show under the name Psychodrama and released a single, \"Vivid\".  In 1996 the sisters changed their band name to The Eyeliners while touring the west coast, as more appropriate for their musical style.\n"
   ],
   "infobox": {
      "Also known as": [
         "Psychodrama"
      ],
      "Origin": [
         "Albuquerque, New Mexico, United States"
      ],
      "Genres": [
         "Pop punk"
      ],
      "Years active": [
         "1995–2005"
      ],
      "Labels": [
         "Panic Button Records, Lookout Records, Sympathy for the Record Industry, Blackheart Records"
      ],
      "Website": [
         "none"
      ],
      "Members": [
         "Lisa Baca",
         "Laura Baca",
         "Angela \"Gel\" Baca"
      ]
   },
   "albums": [
      "Confidential",
      "Broke My Heart",
      "Rock N Roll, Baby!",
      "Do The Zombie",
      "Here Comes Trouble",
      "Sealed with a Kiss",
      "No Apologies"
   ],
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band from Albuquerque, New Mexico, United States.\n",
      "The band formed in [YEAR] under the name Psychodrama by three sisters, guitarist Gel, bassist Lisa, and singer [PERSON_NAME_FULL_0_FEMALE]. The three auditioned both male and female drummers, but couldn’t find one suitable for their planned style of music. [PERSON_NAME_FIRST_0] began experimenting with the drum set they had been using for auditions, and soon picked up the drumbeat despite never having played the instrument. About halfway through the rendition of the song, she started to sing along. The sisters stopped auditioning and  [PERSON_NAME_FIRST_0] became both lead vocalist and drummer.\n",
      "The band played their first show under the name Psychodrama and released a single, [SONG_NAME].  In [YEAR] the sisters changed their band name to [BAND_NAME] while touring the west coast, as more appropriate for their musical style.\n"
   ]
}