{
   "Name": "Fabulous Disaster (band)",
   "rawData": [
      "Fabulous Disaster was an American punk rock all-female band founded in 1998 in San Francisco, California.\n",
      "Fabulous Disaster formed in San Francisco in 1998 and released their debut album, Pretty Killers (Evil Eye Records, 1998). In 2000, they signed to Fat Wreck Chords', Pink and Black imprint. They toured heavily to promote their second album, Put Out or Get Out. They released Panty Raid!, in 2003 and toured with bands such as NOFX, The Mad Caddies, The Briefs, The Real McKenzies, The Dickies and others. While on the Fat Wreck Tour of 2001, they won the SF Weekly Best Punk Band award. They released the EP, I'm a Mess, in 2004, featuring a new lineup. More touring followed. They released a few split EP's with Euro bands like OC Toons and Zinc. The band's fourth full-length album, Love At First Fight, was released in May 2007. In the latter part of 2007, the band split up.\n",
      "This article on a United States punk rock band is a stub. You can help Wikipedia by expanding it."
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Punk rock, Pop punk"
      ],
      "Years active": [
         "1998–2007"
      ],
      "Labels": [
         "I Scream, Evil Eye, Pink and Black"
      ],
      "Website": [
         "http://www.fabulous-disaster.com"
      ],
      "Members": [
         "Lynda Mandolyn",
         "Squeaky",
         "Sally Disaster",
         "Lizzie Boredom"
      ],
      "Past members": [
         "Cinder Block",
         "\"Mr Nancy\" Kravitz (bass)",
         "Laura Litter(lead vox)"
      ]
   },
   "albums": [
      "Pretty Killers",
      "Put Out or Get Out",
      "Panty Raid",
      "Im a Mess",
      "Awesome Fromage",
      "Love at First Fight"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band founded in [YEAR] in San Francisco, California.\n",
      "[BAND_NAME] formed in San Francisco in [YEAR] and released their debut album, Pretty Killers (Evil Eye Records, [YEAR]). In [YEAR], they signed to Fat Wreck Chords', Pink and Black imprint. They toured heavily to promote their second album, Put Out or Get Out. They released Panty Raid!, in [YEAR] and toured with bands such as NOFX, The Mad Caddies, The Briefs, The Real McKenzies, The Dickies and others. While on the Fat Wreck Tour of [YEAR], they won the SF Weekly Best Punk Band award. They released the EP, I'm a Mess, in [YEAR], featuring a new lineup. More touring followed. They released a few split EP's with Euro bands like OC Toons and Zinc. The band's fourth full-length album, Love At First Fight, was released in [MONTH] [YEAR]. In the latter part of [YEAR], the band split up.\n",
      "This article on a [GENRE] band is a stub. You can help Wikipedia by expanding it."
   ]
}