{
   "Discography": {
      "Albums": {},
      "Compilations": {},
      "Singles": {}
   },
   "Livin' Love": {
      "text": [
         "Two singles released from the album, \"I've Been Workin' on You\" and \"Hide & Seek\", were Top 40 hits in Nashville; a third, \"I Won't Run\", charted in Birmingham. Jonathan Marx, who researched and wrote about the band for the 1996 CD reissue of the album on Teenbeat Records, recounts: \n",
         "Lee Hazen, the engineer who recorded the band...played me the album--which, he was quick to tell me, was recorded with session musicians. And it sounded like it too: A couple of songs brimmed with feedback and psyched-out guitar solos, while others were punched up with a Memphis-style horn section. Then Lee remembered, 'Yeah, I recorded some demos with just the band too,' and a short rummage through his vast library of reel-to-reel tapes turned up the original recordings.[2]",
         "These demos were included on the 1996 Teenbeat reissue, and a subsequent 2004 reissue by Rev-Ola Records.[3] A separate CD of demos and live recordings, To Be in Love, was released by Teenbeat in 1997.[4]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 The group's career",
      "2 Livin' Love",
      "3 Discography",
      "3.1 Singles",
      "3.2 Albums",
      "3.3 Compilations",
      "4 References"
   ],
   "Summary": {
      "text": [
         "The Feminine Complex were an all-female American garage rock band in the 1960s. The band formed while the girls were attending Maplewood High School (Tennessee) in Nashville. They released only one album, Livin' Love, in 1969. The album has been reissued twice and has since developed a minor cult following.[1]\n"
      ]
   },
   "The group's career": {
      "text": [
         "The Feminine Complex consisted of Mindy Dalton on guitar and vocals, Judi Griffith on tambourine and vocals, Lana Napier on drums, Pame Stephens on keyboards and Jean Williams on bass.[1] Napier and Williams decided to form an all-female band in the fall of 1966, eventually asking Dalton and Griffith to join. All four were members of the Maplewood High School girls' basketball team, giving themselves the name of The Pivots, which was also their team's name. By the summer of 1967 they added Stephens, a friend of Williams', and changed their name to The Feminine Complex.[2] According to Napier, \n",
         "Everybody was just throwing out stuff...And somebody threw out a name, and I don't remember which one of the girls, I think it was Mindy, said, 'No, we need something feminine'--and I just added 'Complex' to it. We weren't simple![2]",
         "They played small local gigs in Nashville and surrounding areas from 1967-68. Dee Kilpatrick of Athena Records signed the group in 1968, and they recorded their debut, Livin' Love. They broke up when school began, in fall of that year. Livin' Love was released in 1969.[2]\n"
      ]
   },
   "Title": "The Feminine Complex - Wikipedia"
}