{
   "Name": "Fifth Column (band)",
   "rawData": [
      "Fifth Column was a Canadian all-female post-punk band from Toronto, formed in the early 1980s.\n",
      "They took their name Fifth Column from a military manoeuvre by fascist Francisco Franco during the Spanish Civil War, in which Nazi-aligned nationalist insurrectionists within besieged Republican Madrid, called 'the fifth column', aided the four columns (north, south, east and west) outside the perimeters.\n",
      "Soon after forming, the group became involved in the Cassette culture of the 1980s. Their first release was a selection of songs on the cassette compilation Urban Scorch released by Some Product in 1981. GB and Caroline along with Candy Parker released their own underground xerox art/ social commentary zine named Hide (5 issues) which, after its first issue, came out with audio cassettes that were compilations of music by  their punk, post-punk and experimental contemporaries, like Anti-Scrunti Faction, The Dave Howard Singers, Mydolls, The Party's Over, Really Red, Rongwrong, and Michael Phillip Wojewoda, as well as Fifth Column. It is important to note that mainstream local media/middle-of-the-road maligners of the group, were a mix of music reporters/columnists who were both female and male, uncomfortable with the sound and performance, not considered palatable at the time. The trend behind the attacks were based on the band's approach to their genderific sketch of themselves as Second Wave feminists, disrupting populist ideas of being, songwriting, language and image. The commercial and careerist alternative scenes made of hetero-normative and gay assimilationists were also most threatened. The few Canadians in the media championing were: Radio Hosts/Journalists; CKLN's Denise Benson, The Eye's Chris O'Connor, The Sun's John Sakamoto, The Globe and Mail's Liam Lacey, CBC Brave New Wave's hosts Brent Banbury and Kevin Komoda. The Fifth Column sound forged on Vinyl, would not be, without the deftness of Producers/Engineers: Peter D. Hudson (Dundrells), Walter Sobczak (Sturm Group), MP Wojewoda and the elusive Jack Freimanis. The aforementioned actualized the sound that Jones and Azar were aiming for. There were no female producers available or interested at that innate time in Toronto history and culture. There were many girls close to the group who were inspiring friends/muses, and many of them appeared in the music video \"Donna\", like Jena Von Brucker, Mic Hell, Norma Jean LeFebvre and Ottilie Mason. \n"
   ],
   "infobox": {
      "Origin": [
         "Toronto, Ontario, Canada"
      ],
      "Genres": [
         "Punk rock, post-punk, riot grrrl"
      ],
      "Years active": [
         "1981–2002"
      ],
      "Labels": [
         "K"
      ],
      "Associated acts": [
         "Phono-Comb, Shadowy Men on a Shadowy Planet, Opera Arcana"
      ],
      "Members": [
         "G.B. Jones",
         "Caroline Azar",
         "Beverly Breckenridge"
      ],
      "Past members": [
         "Charlotte Briedé, Anita Smith, Janet Martin, Kathleen Robertson, Michelle Breslin, Donna Dresch, Torry Colichio, Don Pyle, Joel Wasson, Charlie Salmon, Anne McLean"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band from Toronto, formed in the early [YEAR]s.\n",
      "They took their name [BAND_NAME] from a military manoeuvre by fascist Francisco Franco during the Spanish Civil War, in which Nazi-aligned nationalist insurrectionists within besieged Republican Madrid, called 'the fifth column', aided the four columns (north, south, east and west) outside the perimeters.\n",
      "Soon after forming, the group became involved in the Cassette culture of the [YEAR]s. Their first release was a selection of songs on the cassette compilation Urban Scorch released by Some Product in [YEAR]. GB and Caroline along with [PERSON_NAME_FULL_7_FEMALE] released their own underground xerox art/ social commentary zine named Hide (5 issues) which, after its first issue, came out with audio cassettes that were compilations of music by  their punk, post-punk and experimental contemporaries, like Anti-Scrunti Faction, The Dave Howard Singers, Mydolls, The Party's Over, Really Red, Rongwrong, and Michael Phillip Wojewoda, as well as [BAND_NAME]. It is important to note that mainstream local media/middle-of-the-road maligners of the group, were a mix of music reporters/columnists who were both female and male, uncomfortable with the sound and performance, not considered palatable at the time. The trend behind the attacks were based on the band's approach to their genderific sketch of themselves as Second Wave feminists, disrupting populist ideas of being, songwriting, language and image. The commercial and careerist alternative scenes made of hetero-normative and gay assimilationists were also most threatened. The few Canadians in the media championing were: Radio Hosts/Journalists; CKLN's [PERSON_NAME_FULL_6_FEMALE], The Eye's Chris O'Connor, The Sun's [PERSON_NAME_FULL_2_MALE], The Globe and Mail's [PERSON_NAME_FULL_0_MALE], CBC Brave New Wave's hosts Brent Banbury and [PERSON_NAME_FULL_5_MALE]. The [BAND_NAME] sound forged on Vinyl, would not be, without the deftness of Producers/Engineers: Peter D. Hudson (Dundrells), [PERSON_NAME_FULL_1_MALE] (Sturm Group), MP Wojewoda and the elusive Jack Freimanis. The aforementioned actualized the sound that Jones and Azar were aiming for. There were no female producers available or interested at that innate time in Toronto history and culture. There were many girls close to the group who were inspiring friends/muses, and many of them appeared in the music video \"Donna\", like [PERSON_NAME_FULL_4_FEMALE], Mic Hell, [PERSON_NAME_FULL_3_FEMALE][MONTH]vre and Ottilie Mason. \n"
   ]
}