{
   "Discography": {
      "Albums": {},
      "Compilation appearances": {},
      "EPs": {},
      "Singles": {},
      "Soundtrack appearances": {},
      "Soundtracks": {},
      "Videography": {}
   },
   "External links": {},
   "History": {
      "text": [
         "They took their name Fifth Column from a military manoeuvre by fascist Francisco Franco during the Spanish Civil War, in which Nazi-aligned nationalist insurrectionists within besieged Republican Madrid, called 'the fifth column', aided the four columns (north, south, east and west) outside the perimeters.[citation needed]\n",
         "Soon after forming, the group became involved in the Cassette culture of the 1980s. Their first release was a selection of songs on the cassette compilation Urban Scorch released by Some Product in 1981. GB and Caroline along with Candy Parker released their own underground xerox art/ social commentary zine named Hide (5 issues) which, after its first issue, came out with audio cassettes that were compilations of music by  their punk, post-punk and experimental contemporaries, like Anti-Scrunti Faction, The Dave Howard Singers, Mydolls, The Party's Over, Really Red, Rongwrong, and Michael Phillip Wojewoda, as well as Fifth Column. It is important to note that mainstream local media/middle-of-the-road maligners of the group, were a mix of music reporters/columnists who were both female and male, uncomfortable with the sound and performance, not considered palatable at the time. The trend behind the attacks were based on the band's approach to their genderific sketch of themselves as Second Wave feminists, disrupting populist ideas of being, songwriting, language and image. The commercial and careerist alternative scenes made of hetero-normative and gay assimilationists were also most threatened. The few Canadians in the media championing were: Radio Hosts/Journalists; CKLN's Denise Benson, The Eye's Chris O'Connor, The Sun's John Sakamoto, The Globe and Mail's Liam Lacey, CBC Brave New Wave's hosts Brent Banbury and Kevin Komoda. The Fifth Column sound forged on Vinyl, would not be, without the deftness of Producers/Engineers: Peter D. Hudson (Dundrells), Walter Sobczak (Sturm Group), MP Wojewoda and the elusive Jack Freimanis. The aforementioned actualized the sound that Jones and Azar were aiming for. There were no female producers available or interested at that innate time in Toronto history and culture. There were many girls close to the group who were inspiring friends/muses, and many of them appeared in the music video \"Donna\", like Jena Von Brucker, Mic Hell, Norma Jean LeFebvre and Ottilie Mason. \n",
         "Their first vinyl release was the 7\" Boy-Girl EP produced in 1983 by Voicepondence Records.\n",
         "The name of  their first full-length recording To Sir With Hate was a play on the theme song from the British school film, To Sir With Love, performed by Lulu. Produced by Michael Phillip Wojewoda, it is now considered a classic of Canadian music; at the 2016 Polaris Music Prize it was named a shortlisted nominee in the 1976-1985 category for the 2016 Polaris Music Prize, the 2017 Polaris Music Prize, and the 2018 Polaris Music Prize.\n",
         "A song from this LP, \"The Fairview Mall Story\" was based on true events concerning media publication of the names of men arrested after being entrapped by police and was instrumental in paving the way for the emergence of the queercore scene. Their video for the song, directed by indie feature film director Steven Rumbelow, involved 50's images of men cruising in their new cars, shopping malls, and car crashes, was intercut with the band and go-go dancer Bruce La Bruce. A video for the song \"Where Are they Now?\" was also made, directed by Marc de Guerre.\n",
         "Their live shows often included films played overtop of the band and a 'go-go' boy dancing. They were frequently accompanied by guest musicians who played instruments as varied as saxophone, trumpet, flute, or violin.\n",
         "Independent-minded, they released their recordings, including their second full-length recording All-Time Queen Of The World, themselves. A video for the song \"Like This\" from the album was directed by Bruce LaBruce with the band. The band also appeared on a number of compilations.\n",
         "In 1992 they released a single, \"All Women Are Bitches\", on the independent record label K Records. \"All Women Are Bitches\" was produced by Walter Sobczak and Fifth Column.[1]  Despite being controversial and receiving little airplay, the recording was reviewed by Everett True and voted \"Single Of The Week\" in the UK music publication Melody Maker. This song was included as well on their last full-length recording, 36C,  released in 1994. That same year a video for the song Donna was also released. It was the flipside of the 1992 single and was also on the album.\n",
         "The band's last recording was released in 2002, on the Kill Rock Stars compilation, Fields And Streams.\n",
         "Caroline Azar again teamed up with G.B. Jones to create  the installation/performance The Bruised Garden in 2013 at The Theatre Centre in Toronto, Ontario, which included music composed by the pair and credited to Fifth Column, making this their last song written together.\n",
         "Band members have performed with other groups as well. Caroline Azar has recorded with Kickstand from New York, and Jolly Tambourine Man, Shadowy Men on a Shadowy Planet, Greek Buck and Hidden Cameras from Toronto. Since the breakup of the band: Azar produces her librettos/compositions for her dramatic musicals MAN-O-REXIC and D.I.N.K and other musical commissions. In 2015, Azar combined Wilfred Owen's anti-war poem Anthem for Doomed Youth with original music she composed for Peter Hinton's play The End at Theatre 20. Azar surprised audiences with her (2018 and 2019) two-part one-woman comedy stand up walking tour/lecture on the absurdity of civics, expressly written for actress-comedienne Jamillah Ross as PEO Rita Mae Nelson entitled \"St. Peon Of The People and St. Peon of Parkdale. The third installment was entitled St. Peon Of The Planet and was slated to go to The Edinburgh Festival, also starring GB Jones and Joel Gibb. \n",
         "Beverly Breckenridge toured with The Spinnanes and was also a member of Phono-Comb.\n",
         "Prior to her involvement with Fifth Column, Jones was part of the electropunk band Bunny and the Lakers. She has collaborated with the Italian dark ambient group Mariae Nascenti and appeared on the single \"Party With The Devil\" by Agnoema. Jones now performs with Opera Arcana. In 2015, Caroline Azar teamed up with Opera Arcana to create a theatrical performance called The Bruised Spirits of Southern Ontario,  an adult gothic folk musical experience based on the music of Opera Arcana, featuring Jones and Minus Smile (formerly of Kids On TV). Azar wrote the story (inspired by Jones' and Kerr's trance-based meditations) and directed and produced the experimental multi media event for Opera Arcana at Videofag (run by Jordan Tannahill and William Ellis). Opera Arcana appeared as guest musicians on UK artist Nick Hudson's 2016 release Ganymede In A State of War. In 2017, Opera Arcana recorded an original soundtrack for the film Downroad by Kelly Wydryk, released on CD in 2019.\n",
         "Fifth Column have been nominated for a Polaris Music Prize in the Heritage section for the 2016 Polaris Music Prize, 2017 Polaris Music Prize, and 2018 Polaris Music Prize.\n"
      ]
   },
   "In popular culture": {
      "text": [
         "In 2004 the song \"All Women Are Bitches\" was covered and re-imagined by the band Lesbians On Ecstasy on their self-titled debut album, Lesbians On Ecstasy, as \"Bitchsy\".[2] in 2005, it was remixed and sampled along with \"Bitchsy\"  by Kids on TV for the compilation album Giggles In The Dark.[3]\n",
         "In 2012, a documentary film by Kevin Hegge, called She Said Boom: The Story of Fifth Column was released featuring interviews with band members Caroline Azar, G.B. Jones, and Beverly Breckenridge, with commentary on the influence of Fifth Column by Toronto artist John Brown, Vaginal Davis, Kathleen Hanna and Bruce LaBruce.[4]\n"
      ]
   },
   "Most recent line-up": {
      "Previous members": {}
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 In popular culture",
      "3 Discography",
      "3.1 Albums",
      "3.2 EPs",
      "3.3 Singles",
      "3.4 Soundtracks",
      "3.5 Compilation appearances",
      "3.6 Soundtrack appearances",
      "3.7 Videography",
      "4 Most recent line-up",
      "4.1 Previous members",
      "5 See also",
      "6 References",
      "7 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "Fifth Column was a Canadian all-female post-punk band from Toronto, formed in the early 1980s.\n"
      ]
   },
   "Title": "Fifth Column (band) - Wikipedia"
}