{
   "Name": "Frau (band)",
   "rawData": [
      "Frau is an all-female hardcore feminist punk band from London. Billboard magazine named them one of \"20 All-Female Bands You Need To Know\"; rock critic Maria Sherman compares their sound to Bikini Kill. The punkzine Maximumrocknroll describes the band's highly charged and frantic sound as equal to the flippant swagger of Teenage Jesus and the Jerks. Ashley Holland of the band, who also plays with Personnel and Good Throb, states that Frau seldom plays with other hardcore bands because the hardcore punk scene does not take female musicians seriously.  In addition to Holland, the other members of the band are Colette Rosa who sings in all female punk band Woolf, Paula and Núria who also played in the Barcelona band Las Timidas. The band's sound has been noted for the use of intense distortion with powerful, forceful vocals.\n",
      "Their EP, Punk is my Boyfriend was released by Static Shock Records in 2014; and Mira was released in 2015.\n",
      "This article on a United Kingdom band or other musical ensemble is a stub. You can help Wikipedia by expanding it."
   ],
   "infobox": {},
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from London. Billboard magazine named them one of [SONG_NAME]; rock critic [MONTH]ia Sherman compares their sound to Bikini Kill. The punkzine Maximumrocknroll describes the band's highly charged and frantic sound as equal to the flippant swagger of Teenage Jesus and the Jerks. Ashley Holland of the band, who also plays with Personnel and Good Throb, states that [BAND_NAME] seldom plays with other hardcore bands because the hardcore punk scene does not take female musicians seriously.  In addition to Holland, the other members of the band are Colette Rosa who sings in all female punk band Woolf, Paula and Núria who also played in the Barcelona band Las Timidas. The band's sound has been noted for the use of intense distortion with powerful, forceful vocals.\n",
      "Their EP, Punk is my Boyfriend was released by Static Shock Records in [YEAR]; and Mira was released in [YEAR].\n",
      "This article on a [GENRE] band or other musical ensemble is a stub. You can help Wikipedia by expanding it."
   ]
}