{
   "Name": "Free Kitten",
   "rawData": [
      "Free Kitten is an American alternative rock band formed by Sonic Youth's Kim Gordon and Pussy Galore's Julie Cafritz. Originally performing as Kitten, they changed their name after receiving threats of legal action by a heavy metal singer performing under the same name. Boredoms member Yoshimi P-We took up drums, and Pavement's Mark Ibold joined later on as bassist. They have released a handful of albums and singles, mainly on label Kill Rock Stars, including a remix 12\" featuring DJ Spooky. They toured on 1993's Lollapalooza.  A studio album, 2008's Inherit, on Thurston Moore's Ecstatic Peace label, is the group's most recently available.\n",
      "This article on a United States rock music band is a stub. You can help Wikipedia by expanding it."
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, United States"
      ],
      "Genres": [
         "Alternative rock, indie rock"
      ],
      "Years active": [
         "1992–1997, 2007–present"
      ],
      "Labels": [
         "Wiiija, Kill Rock Stars, Ecstatic Peace"
      ],
      "Website": [
         "Free Kitten at Ecstatic Peace"
      ],
      "Members": [
         "Kim Gordon",
         "Julie Cafritz",
         "Yoshimi P-We"
      ],
      "Past members": [
         "DJ Spooky",
         "Mark Ibold"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed by Sonic Youth's [PERSON_NAME_FULL_0_FEMALE] and Pussy Galore's [MONTH]ie Cafritz. Originally performing as Kitten, they changed their name after receiving threats of legal action by a heavy metal singer performing under the same name. Boredoms member Yoshimi P-We took up drums, and Pavement's [MONTH]k Ibold joined later on as bassist. They have released a handful of albums and singles, mainly on label Kill Rock Stars, including a remix 12\" featuring DJ Spooky. They toured on [YEAR]'s Lollapalooza.  A studio album, [YEAR]'s Inherit, on Thurston Moore's Ecstatic Peace label, is the group's most recently available.\n",
      "This article on a [GENRE] band is a stub. You can help Wikipedia by expanding it."
   ]
}