{
   "Name": "Frightwig",
   "rawData": [
      "Frightwig is an all-female punk rock band from San Francisco, California, formed in 1982 by Deanna Ashley and Mia Levin. After many line-up changes, Frightwig retired in 1994 to raise children and focus on other career paths.\n",
      "Frightwig reformed in 2012 with Rebecca Sevrin and Rachel Thoele. Frightwig's current line-up is Deanna Mitchell, Mia d'Bruzzi, and Eric Drew Feldman. In September, 2014, the band did a US east coast tour with Jane Lee Hooker.\n",
      "Ashley was raised by a \"hippie\" mother who introduced her to Buffy Sainte-Marie, Joan Baez, Jimi Hendrix, and the Beatles. When Ashley was 16 years old, she moved to San Francisco. She met Levin met at a movie theater in the city. Ashley later described, \"It was just one of those magic things when you meet your soul mate. But we also had a lot of angry shows. That’s like a lot of relationships: you get mad at each other, you go through all of everything. And that’s what makes a relationship.\"\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, US"
      ],
      "Genres": [
         "Punk rock"
      ],
      "Years active": [
         "1982–1994, 2012–present"
      ],
      "Labels": [
         "Caroline",
         "Subterrranean",
         "Boner",
         "Southern"
      ],
      "Website": [
         "http://frightwig.org"
      ],
      "Members": [
         "Deanna Ashley",
         "Mia Levin (aka Mia d’Bruzzi)",
         "Eric Drew Feldman",
         "Rebecca Sevrin"
      ],
      "Past members": [
         "Rachel Thoele",
         "Susan Miller",
         "Tanya",
         "Paula Frazer",
         "Lynn Perko",
         "Bambi Nonymous",
         "Alistair Shanks",
         "Anne Harney",
         "Robert Castenada",
         "Dana Ross",
         "Cecilia Kuhn"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from San Francisco, California, formed in [YEAR] by [PERSON_NAME_FULL_2_FEMALE] and [PERSON_NAME_FULL_1_FEMALE]. After many line-up changes, [BAND_NAME] retired in [YEAR] to raise children and focus on other career paths.\n",
      "[BAND_NAME] reformed in [YEAR] with Rebecca Sevrin and [PERSON_NAME_FULL_1_FEMALE]. [BAND_NAME]'s current line-up is Deanna Mitchell, Mia d'Bruzzi, and [PERSON_NAME_FULL_2_MALE]. In [MONTH], [YEAR], the band did a US east coast tour with [MONTH]e Lee Hooker.\n",
      "Ashley was raised by a \"hippie\" mother who introduced her to Buffy Sainte-[MONTH]ie, [PERSON_NAME_FULL_1_FEMALE], Jimi Hendrix, and the Beatles. When Ashley was 16 years old, she moved to San Francisco. She met Levin met at a movie theater in the city. Ashley later described, \"It was just one of those magic things when you meet your soul mate. But we also had a lot of angry shows. That’s like a lot of relationships: you get mad at each other, you go through all of everything. And that’s what makes a relationship.\"\n"
   ]
}