{
   "Discography": {
      "Compilations": {},
      "Singles/EPs": {},
      "Studio albums": {}
   },
   "External links": {},
   "Former members": {},
   "History": {
      "text": [
         "Ashley was raised by a \"hippie\" mother who introduced her to Buffy Sainte-Marie, Joan Baez, Jimi Hendrix, and the Beatles. When Ashley was 16 years old, she moved to San Francisco. She met Levin met at a movie theater in the city. Ashley later described, \"It was just one of those magic things when you meet your soul mate. But we also had a lot of angry shows. That’s like a lot of relationships: you get mad at each other, you go through all of everything. And that’s what makes a relationship.\"[3]\n",
         "When the band first formed in 1982, Frightwig received a certain amount of attention for being female, including catcalls that made them feel it necessary to  defend their \"right\" to be on stage with the men. On \"A Man's Gotta Do, What A Man's Gotta Do\", Frightwig invited men onto the stage to strip as \"a sexist turnaround.\"\n",
         "The bandmates worked minimum wage jobs to support themselves. As Ashley recalled, \"In the 80s we could work our crappy little jobs and get minimum wage, which was, I remember, $3.25 an hour at the Egyptian and the Strand on Market Street. Our studio was opposite the Sound of Music; we had to carry our equipment at three a.m. downstairs in spiked heel shoes and really blotto drunk.\"[3]\n",
         "In San Francisco, Frightwig played the Valencia Tool & Die, The Fillmore, Mabuhay Gardens, the On Broadway, and The Farm. Frightwig toured the United States several times, British Columbia many times, and Europe in the fall of 1985, opening for D.O.A., and in 1994 for a Swiss tour. In New York City, they often performed at 8BC, which \"became one of our homes.\"[3] The band gained momentary fame after Kurt Cobain was seen at Nirvana's MTV Unplugged concert wearing a Frightwig T-shirt. Frightwig also toured with Flipper, Funkyard, the Butthole Surfers, Snakefinger, GBH, Redd Kross and No Means No, and played with Dead Kennedys, Sonic Youth, Lydia Lunch, L7, SWA and Bikini Kill. Bands and performers who list Frightwig as influential include Hole, L7, Bikini Kill, and Faith No More.[4]\n",
         "On May 4, 2017, band member Cecilia Kuhn died of cancer.[5] In 2019, Frightwig played a May show at Oasis in San Francisco to benefit RAICES and a September show at PRF West in Oakland, California.[6][7]\n"
      ]
   },
   "Most recent line-up": {},
   "References": {},
   "Sections": [
      "1 History",
      "2 Most recent line-up",
      "3 Former members",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Singles/EPs",
      "4.3 Compilations",
      "5 See also",
      "6 References",
      "7 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "Frightwig is an all-female punk rock band from San Francisco, California,[1] formed in 1982 by Deanna Ashley and Mia Levin. After many line-up changes, Frightwig retired in 1994 to raise children and focus on other career paths.[citation needed]\n",
         "Frightwig reformed in 2012 with Rebecca Sevrin and Rachel Thoele. Frightwig's current line-up is Deanna Mitchell, Mia d'Bruzzi, and Eric Drew Feldman. In September, 2014, the band did a US east coast tour with Jane Lee Hooker.[2]\n"
      ]
   },
   "Title": "Frightwig - Wikipedia"
}