{
   "Name": "F Chopper Koga",
   "Sections": [
      "1 Career",
      "1.1 The Pink Panda",
      "1.2 Gacharic Spin",
      "1.3 Doll$Boxx",
      "2 Instructional series",
      "3 Other works",
      "3.1 Television",
      "3.2 Film",
      "3.3 Video",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Michiko Koga (Japanese: 古賀美智子, Hepburn: Koga Michiko), known professionally as F Chopper Koga (FチョッパーKOGA, Efu Choppā Koga), is a Japanese bass player and leader of the rock band Gacharic Spin. She has released two DVD instructional videos for her signature slap-bass technique. Koga has also former model and a founding member of the bands The Pink Panda and Doll$Boxx.\n"
      ]
   },
   "Career": {
      "The Pink Panda": {
         "text": [
            "Koga was the bass player for the band The Pink Panda, formed in 2002.[1] The Pink Panda released 3 singles and 3 albums from 2004 to 2008 before Koga left the band after their final concert at Shibuya O-West on November 15, 2008.[2][3]\n"
         ]
      },
      "Gacharic Spin": {
         "text": [
            "In 2009, Koga formed the band Gacharic Spin with high school classmate Hana.[4]\n"
         ]
      },
      "Doll$Boxx": {
         "text": [
            "In 2012, Koga and other members of Gacharic Spin joined with Light Bringer vocalist Fuki to create the band Doll$Boxx.[5] Koga had previously worked with Fuki when the singer filled in as Gacharic Spin's vocalist in 2012.[6]\n"
         ]
      }
   },
   "Instructional series": {
      "text": [
         "In 2010, Atoss International released Koga's first bass instructional DVD titled Zettai Hajikeru! Slap Bass Cho Nyuumo (\"Let's Play! Slap Bass Super Introduction\").[7] The promotional video for the release featured Koga with Gacharic Spin bandmate Hana on drums.[8]\n",
         "In 2011, Koga's second instructional DVD was released, titled F Chopper Koga no Slap Bass Rakuchin Phrase Shu (\"F Chopper Koga's Slap Bass Easy Phrasebook\").[9] The promotional video featured Koga playing bass accompanied by Gacharic Spin's full lineup.[10]\n"
      ]
   },
   "Other works": {
      "Television": {
         "text": [
            "In 2001, Koga performed a guest role as a school bully in the television drama Kids War 3.[11]\n"
         ]
      },
      "Film": {
         "text": [
            "In 2014, Koga and the other members of Gacharic Spin appeared as members of the fictional rock band Nosebleed in the film Metalca.[12]\n"
         ]
      },
      "Video": {
         "text": [
            "Before becoming a full-time musician, Koga starred in several gravure modeling videos: Petit Angel Michiko Koga (2002),[13] Petit in Wonderland (2002),[14] Punyu Punyu (2004),[15] and Qutie Pistols (2005).[16]\n",
            "Koga has also appeared as a frequent co-host of supplemental DVD talk program included with WeRocK!! Magazine.[17]\n"
         ]
      }
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Michiko Koga (Japanese: 古賀美智子, Hepburn: Koga Michiko), known professionally as F Chopper Koga (FチョッパーKOGA, Efu Choppā Koga), is a Japanese bass player and leader of the rock band Gacharic Spin. She has released two DVD instructional videos for her signature slap-bass technique. Koga has also former model and a founding member of the bands The Pink Panda and Doll$Boxx.\n",
      "Koga was the bass player for the band The Pink Panda, formed in 2002.[1] The Pink Panda released 3 singles and 3 albums from 2004 to 2008 before Koga left the band after their final concert at Shibuya O-West on November 15, 2008.[2][3]\n",
      "In 2009, Koga formed the band Gacharic Spin with high school classmate Hana.[4]\n",
      "In 2012, Koga and other members of Gacharic Spin joined with Light Bringer vocalist Fuki to create the band Doll$Boxx.[5] Koga had previously worked with Fuki when the singer filled in as Gacharic Spin's vocalist in 2012.[6]\n"
   ]
}