{
   "Name": "Girlpool",
   "rawData": [
      "Girlpool is an indie rock band from Los Angeles, California, formed by friends Avery Tucker and Harmony Tividad. Their self-titled debut EP was posted on their Bandcamp account in February 2014, and re-released on Wichita Recordings later that year. The band released its debut album, Before the World Was Big, in June 2015, also on Wichita Recordings. Their second album, Powerplant, was released in May 2017, via Anti-.\n",
      "Girlpool's eponymous EP received generally favorable reviews from critics, with a weighted average score of 79 on Metacritic. In his review of this EP, Chris Conaton compared their sound to \"an angrier, socially conscious Kimya Dawson.\"\n",
      "Before the World Was Big also received generally favorable reviews from critics, with a 79 out of 100 score on Metacritic. For example, Pitchfork Media's Jayson Greene gave it a score of 7.8 out of 10 and described it as \"a quiet album of uncommon intensity.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California"
      ],
      "Genres": [
         "Indie rock, indie folk, Dream pop, Lo-Fi"
      ],
      "Years active": [
         "2013 (2013)–present"
      ],
      "Labels": [
         "Anti-, Wichita Recordings"
      ],
      "Website": [
         "girlpoolmusic.com"
      ],
      "Members": [
         "Avery Tucker[1]",
         " Harmony Tividad"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Los Angeles, California, formed by friends Avery Tucker and [PERSON_NAME_FULL_0_FEMALE]. Their self-titled debut EP was posted on their Bandcamp account in [MONTH] [YEAR], and re-released on Wichita Recordings later that year. The band released its debut album, Before the World Was Big, in [MONTH] [YEAR], also on Wichita Recordings. Their second album, Powerplant, was released in [MONTH] [YEAR], via Anti-.\n",
      "[BAND_NAME]'s eponymous EP received generally favorable reviews from critics, with a weighted average score of 79 on Metacritic. In his review of this EP, [PERSON_NAME_FULL_0_MALE] compared their sound to \"an angrier, socially conscious Kimya Dawson.\"\n",
      "Before the World Was Big also received generally favorable reviews from critics, with a 79 out of 100 score on Metacritic. For example, Pitchfork Media's [PERSON_NAME_FULL_0_MALE] gave it a score of 7.8 out of 10 and described it as \"a quiet album of uncommon intensity.\"\n"
   ]
}