{
   "Name": "Girl in a Coma",
   "Sections": [
      "1 History",
      "2 Cultural background",
      "3 Activism",
      "4 2006 documentary",
      "5 Concert tours",
      "6 Discography",
      "6.1 Demos and EPs",
      "6.2 Albums",
      "7 Music videos",
      "8 Awards and nominations",
      "9 References",
      "10 External links"
   ],
   "Summary": {
      "text": [
         "Girl In a Coma was an American indie rock band from San Antonio, Texas, United States, formerly on Joan Jett's Blackheart Records' label.  The band consisted of Nina (vocals/guitar), Phanie Diaz (drums) and Jenn Alva (bass).[1][2] The name is a reference to The Smiths' song \"Girlfriend in a Coma\". Before they were called Girl in a Coma, they were known as Sylvia's Radio and Girls in a Coma.[citation needed]\n"
      ]
   },
   "History": {
      "text": [
         "Stephanie \"Phanie\" Diaz started learning how to play the acoustic guitar when she was eleven.[3] Jenn Alva and Phanie met in eighth grade in art class where they became best friends. Both of them played instruments and created Girl in a Coma.[3][4]\n",
         "The partners asked Phanie's younger sister, Nina Diaz, to join their band after she shared with them a song she had written.[5] Her first show was a week before her 14th birthday.[6] Nina left high school at 16 to focus on the band.[3] In 2009, Nina collaborated with Tiësto to co-write the dance track, \"In Your Mind.\"[5] At the start of 2014, Nina took a break from the band to record solo material.[5][7]\n",
         "Nina and Phanie are Mexican American. Nina and Phanie grew up in Texas listening to Tejano music, including much of Selena's music.[8] They have integrated cultural elements from this music into their own.[9]\nPhanie has espoused curanderismo.[3][10]\n",
         "In 2006, while filming the television series pilot for the SiTV show Jammin, the girls met Joan Jett. Jett and producer Kenny Laguna signed the girls to a contract with Blackheart Records after seeing them perform at the Knitting Factory in New York City.[11][12]\n",
         "In October 2007, while in New York, Girl in a Coma were called by Morrissey to open for the remainder of his tour. Besides Morrissey, Girl in a Coma have opened for Frank Black, The Pogues, Tegan and Sara, Social Distortion and others.\n",
         "The band played at the SXSW Music Festival in 2007,[13][14] 2009,[15] and again in 2010 and 2012.[16]  They also performed on the True Colors Tour 2008.\n",
         "In early 2008, their song \"Clumsy Sky\" won in The 7th Annual Independent Music Awards for Best Punk Song.[17]\n",
         "On March 22, 2009 group member Jenn Alva and Nina Diaz were arrested outside of a Houston club. They were briefly detained and processed at a Harris County jail. Both were charged with felony assault on a public servant. The incident began when one of the officers, who was working as a security guard, saw Diaz slap her boyfriend and attempted to separate the couple.[6]\n[18]\n[19] All charges were later dropped.[20]\n",
         "In the summer of 2010, Girl in a Coma played at Polish Woodstock.\n",
         "In 2012, they won another Independent Music Award with their album Exits & All The Rest for Best Indie/Alt. Album.[21]\n",
         "In September 2018, Phanie Diaz and Jenn Alva held the band's final performance at Taco Fest in San Antonio. Later that month, they each announced via Facebook that the band had broken up.[22][23]\n",
         "Drummer Phanie Diaz and bass player Jenn Alva are both openly lesbian.[24] Jenn is currently married.\n"
      ]
   },
   "Cultural background": {
      "text": [
         "Felix Contreras of National Public Radio (NPR) conducted an interview with Girl in a Coma where they opened up about not speaking Spanish and not knowing the language well. Nina Diaz, the lead singer and guitarist, said, “When the grandparents were talking to my older sister, or even adult conversations, you could hear them talking and it felt like a foreign thing,\"  She also said, \"It's like, 'What are you saying? I want to understand you.' But then I would go off and play with my toys, and was like, 'Whatever, I guess I'll understand it later.'” [25]\n",
         "In another interview, by www.musicpix.net the band members said that they do not like to label themselves as a Latina, lesbian, or girl band, because they do not want to be put in a box. Girl in a Coma does say that if they were anything they would say they are a rock and roll band even though there are punk rock, oldies Spanish music, indie, as well as rock and roll influences in their music. However, they also said they do not want to make it about themselves, because it is all about the music.[26]\n",
         "In the interview by www.musicpix.net of Girl in a Coma, the band said that they had influences from Selena Quintanilla, especially because she was also from Texas and she was the first Latina to break out in a male dominated industry. They covered her song “Si Una Vez” in their album Coverland. The band also mentioned in their interview that they would love to have a complete Spanish album in the future.\n"
      ]
   },
   "Activism": {
      "text": [
         "Girl in a Coma has been involved in social issues affecting the LGBTQ and Latino community. They have stood up to stereotypes and unfair policies through their music. In 2012, Girl in a Coma got together with The SoundStrike to campaign against Arizona's anti-immigration SB 1070 law. According to the Huffington Post, the band was pulled over and questioned by authorities in Mobile, Alabama. In an interview, Phanie Diaz does not consider Girl in a Coma to be activists or a political band. “Even though we are not self-identified [as activists], we do pay attention…we have youth, the gay community and the Latino community all paying attention to what we are doing and supporting us so if we can give back, we can.[27] In a separate interview with GA Voice, Jenn Alva stated that there had to be a different way to approach immigration. “Our country is taking steps in the wrong direction…There’s got to be another way. We need to work to help them and see what brilliant compromise that we can establish.” The song “Hope” on Exits and all the Rests was written about Arizona's anti-immigration law.[28]\n"
      ]
   },
   "2006 documentary": {
      "text": [
         "Jim Mendiola, the director of many of Girl in a Coma's music videos, directed the Girl in a Coma an episode of \"Jammin’\" for SiTV.  This 2006 episode captured the girls in their music element: writing songs, recording, performing, and interviewing, all in their hometown of San Antonio, Texas. The full episode is 45 minutes in length. The episode gives a glimpse into the girls’ lives, how they started up their band, and shows how real and down to earth they really are. \n[3]\n[29] Jim Mendiola 2006.\n"
      ]
   },
   "Concert tours": {
      "text": [
         "[30]\n"
      ]
   },
   "Discography": {
      "Demos and EPs": {
         "text": [
            "Gira O Morir Demo (2005)\n",
            "Girl In A Coma Demo [Vinyl] (2005) (Very Rare, Only 500 copies)\n",
            "Hiding My Trail EP (2009)\n",
            "Adventures in Coverland, Vol. 1 [Vinyl] (2010, Blackheart Records)\n",
            "Adventures in Coverland, Vol. 2 [Vinyl] (2010, Blackheart Records)\n",
            "Adventures in Coverland, Vol. 3 [Vinyl] (2010, Blackheart Records)\n"
         ]
      },
      "Albums": {
         "text": [
            "Both Before I'm Gone (May 1, 2007, Blackheart Records)\n",
            "Trio B.C. (June 2, 2009, Blackheart Records) (48:32)\n",
            "Adventures in Coverland (October 19, 2010, Blackheart Records)  (32:52)\n",
            "Exits & All The Rest (November 1, 2011, Blackheart Records) (45:03)\n"
         ]
      }
   },
   "Music videos": {
      "text": [
         "Girl in a Coma has filmed nine music videos between the years of 2007 and 2012 since the forming of the band in 2006.[31]\n",
         "From their first album, Both Before I'm Gone, which was released in 2007, the Latina girl band came out with four music videos from that first album alone. With the help of directors Jim Mendiola and Greg Olliver, Girl in a Coma was able to film all four videos in about a year and a half. Many of their music videos have been filmed in San Antonio, Texas, where Jenn, Nina, and Phanie live. For the Road to Home music video, Girl in a Coma featured a guest star to perform in it, Amanda Lepore. The music video Clumsy Sky was filmed in a nightclub in their hometown of San Antonio, called Lerma's Nite Club. With the help of Vincent Valdez, the music video Say by Girl in a Coma had hand drawn letters and drawings for the background of the video. The last of the four music videos filmed for the first album Both Before I'm Gone, was Their Cell, which Girl in a Coma filmed inside the Gonzales County Jail in Gonzales, Texas.\n",
         "As for Girl in a Coma's second album, Trio B.C., the band filmed two music videos. Again, with the directing of Jim Mendiola, and on location in San Antonio, Texas, Girl in a Coma filmed both El Monte, and Static Mind, in July 2009.\n",
         "The band's third album, Adventures in Coverland, was an entire album dedicated to covering songs from other artists, and the first album where Girl in a Coma switched it up and found different directors to help direct their music videos. One of the covers, As the World Falls Down, was originally David Bowie's song, and Girl in a Coma released a music video for that song in 2010, directed by Robert Rodriguez. The one other music video that the band filmed from their third album was for Walkin’ After Midnight, which was Patsy Cline's original song. This music video also came out in 2010, but Jenn Alva (bass guitarist in the band) directed the video.\n",
         "Lastly, Girl in a Coma has filmed one music video for their latest album Exits and All the Rest. The video for Smart came out in 2012 and is the most recent work of Girl in a Coma.[31]\n",
         "Both Before I'm Gone (2007)\n",
         "Trio B.C. (2009)\n",
         "Adventures In Coverland (2010)\n",
         "Exits and All the Rest (2011)\n"
      ]
   },
   "Awards and nominations": {
      "text": [
         "[32]\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Girl In a Coma was an American indie rock band from San Antonio, Texas, United States, formerly on Joan Jett's Blackheart Records' label.  The band consisted of Nina (vocals/guitar), Phanie Diaz (drums) and Jenn Alva (bass).[1][2] The name is a reference to The Smiths' song \"Girlfriend in a Coma\". Before they were called Girl in a Coma, they were known as Sylvia's Radio and Girls in a Coma.[citation needed]\n",
      "Stephanie \"Phanie\" Diaz started learning how to play the acoustic guitar when she was eleven.[3] Jenn Alva and Phanie met in eighth grade in art class where they became best friends. Both of them played instruments and created Girl in a Coma.[3][4]\n",
      "The partners asked Phanie's younger sister, Nina Diaz, to join their band after she shared with them a song she had written.[5] Her first show was a week before her 14th birthday.[6] Nina left high school at 16 to focus on the band.[3] In 2009, Nina collaborated with Tiësto to co-write the dance track, \"In Your Mind.\"[5] At the start of 2014, Nina took a break from the band to record solo material.[5][7]\n",
      "Nina and Phanie are Mexican American. Nina and Phanie grew up in Texas listening to Tejano music, including much of Selena's music.[8] They have integrated cultural elements from this music into their own.[9]\nPhanie has espoused curanderismo.[3][10]\n"
   ],
   "infobox": {
      "Origin": [
         "San Antonio, Texas, United States"
      ],
      "Genres": [
         "Indie rock, alternative rock, punk."
      ],
      "Years active": [
         "2006–2018"
      ],
      "Labels": [
         "Blackheart Records"
      ],
      "Website": [
         "http://www.girlinacoma.com/"
      ],
      "Members": [
         "Jenn Alva",
         "Nina Diaz",
         "Phanie Diaz"
      ]
   }
}