{
   "Name": "Heavens to Betsy",
   "rawData": [
      "Heavens to Betsy was an American punk band formed in Olympia, Washington in 1991. It was part of the DIY riot grrrl movement in the punk rock underground in the early 1990s, and the first band of Sleater-Kinney vocalist/guitarist Corin Tucker.\n",
      "The members were fellow Evergreen State College students Tracy Sawyer on drums and occasionally bass guitar, and Corin Tucker on guitar and vocals. Their first appearance was at the International Pop Underground Convention organized by independent record label K Records in August 1991. For one night an all-female bill, dubbed \"Love Rock Revolution Girl Style Now\", commanded the stage with Heavens to Betsy, Bratmobile, Jean Smith of Mecca Normal and 7 Year Bitch appearing, an event that is widely considered one of the pivotal events in the inception of the riot grrrl movement.\n",
      "Their first record was a split single on K Records with Bratmobile, considered an essential riot grrrl recording. The band recorded three singles, produced one LP/CD, Calculated, and contributed to many compilations while they were together. These recordings are now sought after by collectors. One of these compilations, Free to Fight, also included a song contributed by the band Excuse 17, of which Carrie Brownstein was a member. Tucker and Brownstein began to play together, and when Heavens to Betsy disbanded in the mid-1990s, the two women founded Sleater-Kinney. Several of the band's songs were featured in the 2013 video game Gone Home, including the song \"Complicated\", which was used in the game's end credits.\n"
   ],
   "infobox": {
      "Origin": [
         "Olympia, Washington"
      ],
      "Genres": [
         "Riot grrrl, indie rock, punk rock"
      ],
      "Years active": [
         "1991–1994"
      ],
      "Labels": [
         "K",
         "Chainsaw",
         "Yoyo"
      ],
      "Past members": [
         "Corin Tucker",
         "Tracy Sawyer"
      ]
   },
   "albums": [
      "Calculated"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band formed in Olympia, Washington in [YEAR]. It was part of the DIY riot grrrl movement in the punk rock underground in the early [YEAR]s, and the first band of Sleater-Kinney vocalist/guitarist Corin Tucker.\n",
      "The members were fellow Evergreen State College students Tracy Sawyer on drums and occasionally bass guitar, and [PERSON_NAME_FULL_1_MALE] on guitar and vocals. Their first appearance was at the International Pop Underground Convention organized by independent record label K Records in [MONTH] [YEAR]. For one night an all-female bill, dubbed [SONG_NAME], commanded the stage with [BAND_NAME], Bratmobile, [PERSON_NAME_FULL_0_MALE] of Mecca Normal and 7 Year Bitch appearing, an event that is widely considered one of the pivotal events in the inception of the riot grrrl movement.\n",
      "Their first record was a [GENRE] an essential riot grrrl recording. The band recorded three singles, produced one LP/CD, Calculated, and contributed to many compilations while they were together. These recordings are now sought after by collectors. One of these compilations, Free to Fight, also included a song contributed by the band Excuse 17, of which [PERSON_NAME_FULL_0_FEMALE] was a member. Tucker and [PERSON_NAME_LAST_0] began to play together, and when [BAND_NAME] disbanded in the mid-[YEAR]s, the two women founded Sleater-Kinney. Several of the band's songs were featured in the [YEAR] video game Gone Home, including the song [SONG_NAME], which was used in the game's end credits.\n"
   ]
}