{
   "Name": "Ivy Benson",
   "Sections": [
      "1 Early years",
      "2 Career",
      "2.1 Film and television appearances",
      "3 Personal life",
      "4 Later years",
      "5 Honours",
      "6 Cultural references",
      "7 Discography",
      "8 See also",
      "9 References",
      "10 External links"
   ],
   "Summary": {
      "text": [
         "Ivy Benson (11 November 1913 – 6 May 1993) was an English musician and bandleader, who led an all-female swing band. Benson and her band rose to fame in the 1940s, headlining variety theatres and topping the bill at the London Palladium, and became the BBC's resident house band.\n"
      ]
   },
   "Early years": {
      "text": [
         "Benson was born on 11 November 1913 in Holbeck, Leeds, the daughter of Douglas Rolland \"Digger\" Benson and his wife Mary Jane Mead.[1] Her father, a musician who played several instruments[1] including trombone for the Leeds Symphony Orchestra,[2] began teaching her the piano at the age of five. She played at working men's clubs from the age of eight,[2] billed as Baby Benson, and performed on BBC Radio's Children's Hour aged nine.[3]\n",
         "Ivy's father had ambitions for her to become a concert pianist, but she was inspired to become a jazz musician after hearing a Benny Goodman record and learned to play clarinet and alto saxophone.[1][3] She left school at 14[1] and took a job at the Montague Burton factory in Leeds, putting aside half a crown from her wages each week to save up for her first saxophone.[4] She supplemented her income by playing in dance bands in the evenings.[5]\n"
      ]
   },
   "Career": {
      "Film and television appearances": {
         "text": [
            "In 1943 Benson appeared as herself with a speaking role in the feature film The Dummy Talks, which starred Jack Warner.[1] She and the band were scheduled to take part in a BBC Television broadcast in 1946, but were forced to cancel 48 hours before they were due to go on air following a dispute with the Stoll Theatres Corporation, who she was contracted to. Stoll advised her that she faced a ban from their theatres, saying that they considered that television \"will be a great detriment to the theatre\".[3][7]\n",
            "Benson and the band appeared on the television series The Music Box in 1957.[8] She was the subject of an episode of the UK tribute show This Is Your Life in 1976.[4]\n"
         ]
      },
      "text": [
         "Benson joined Yorkshire-based six-piece band Edna Croudson's Rhythm Girls in 1929, touring with them until 1935,[6] after which she toured with various bands including Teddy Joyce and the Girlfriends where she became a featured soloist.[1] She moved to London in the late 1930s and formed her own band. Their first significant engagement was performing with the all-female revue Meet the Girls, which starred Hylda Baker.[3]\n",
         "During the Second World War, opportunities for female musicians opened up as many male musicians were enlisted into the armed forces.[2] The band became the BBC's resident dance band in 1943, and were top of the bill at the London Palladium for six months in 1944.[1] In 1945 the band were the first entertainers invited to perform at the VE Day celebrations in Berlin at the request of Field Marshal Montgomery, and on Christmas Day that year they performed for a live BBC Radio broadcast from Hamburg immediately after the King's speech.[1] Benson and her band also toured Europe and the Middle East with the Entertainments National Service Association entertaining Allied troops,[2] headlined variety theatres[1] and performed at the 1948 Summer Olympics in London.[4]\n",
         "Benson's band had a high turnover of musicians, as they frequently left to marry G.I.s they met while touring. She once commented, \"I lost seven in one year to America. Only the other week a girl slipped away from the stage. I thought she was going to the lavatory but she went off with a G.I. Nobody's seen her since.\"[4]\n",
         "In the 1950s, she played summer seasons at Butlins holiday camps and Villa Marina on the Isle of Man.[1] She continued to lead the band until the early 1980s, adapting to changing tastes by adding pop tunes to the band's repertoire in the 1960s.[5] The band played for overseas-based servicemen until the 1970s.[6] Towards the end of her career the band played mostly private functions as dance halls and variety theatres declined. The band disbanded in 1982 after a final performance at the Savoy Hotel,[3] briefly reforming in 1983 for a performance on Russell Harty's television show to celebrate Benson's 70th birthday.[1]\n"
      ]
   },
   "Personal life": {
      "text": [
         "Benson married theatrical producer Caryll Stafford Clark in 1949;[1] they were divorced in 1951.[9] In 1957 she married Top Sergeant Brantley Callaway of the United States Air Force, whom she met while performing in a summer season on the Isle of Man. The marriage ended after she refused to accompany him when he returned to the United States in 1963 and they were divorced in 1964.[1][5][9] An operation left her unable to have children.[10]\n"
      ]
   },
   "Later years": {
      "text": [
         "Benson retired to the seaside resort of Clacton-on-Sea, Essex, occasionally entertaining local holidaymakers on the electric organ.[1] A few months before her death in 1993 she became close friends with the actor Sean Pertwee. Pertwee had sought her advice about his upcoming portrayal of a troubled trombonist and drag queen in the film Dirty Weekend.[11]\n",
         "She suffered a heart attack at her home and died on 6 May 1993, aged 79.[12]\n"
      ]
   },
   "Honours": {
      "text": [
         "Benson was made an honorary fellow of Leeds Polytechnic in 1988, the only significant honour she received during her lifetime.[1] In 2011 she was commemorated by Leeds Civic Trust with a blue plaque placed at her childhood home in Cemetery Road, Holbeck.[13]\n",
         "Ivy Benson has a ward named after her in Clacton Hospital.\n"
      ]
   },
   "Cultural references": {
      "text": [
         "In 1984 The Silver Lady, a play by Liane Aukin based on Benson's life, was staged at the Birmingham Repertory Theatre.[1] Benson and her band have been suggested as a possible basis for Alan Plater's TV film The Last of the Blonde Bombshells and play Blonde Bombshells of 1943, in which a woman reunites her wartime all-female band.[4][14][15]\n"
      ]
   },
   "Discography": {},
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Ivy Benson (11 November 1913 – 6 May 1993) was an English musician and bandleader, who led an all-female swing band. Benson and her band rose to fame in the 1940s, headlining variety theatres and topping the bill at the London Palladium, and became the BBC's resident house band.\n",
      "Benson was born on 11 November 1913 in Holbeck, Leeds, the daughter of Douglas Rolland \"Digger\" Benson and his wife Mary Jane Mead.[1] Her father, a musician who played several instruments[1] including trombone for the Leeds Symphony Orchestra,[2] began teaching her the piano at the age of five. She played at working men's clubs from the age of eight,[2] billed as Baby Benson, and performed on BBC Radio's Children's Hour aged nine.[3]\n",
      "Ivy's father had ambitions for her to become a concert pianist, but she was inspired to become a jazz musician after hearing a Benny Goodman record and learned to play clarinet and alto saxophone.[1][3] She left school at 14[1] and took a job at the Montague Burton factory in Leeds, putting aside half a crown from her wages each week to save up for her first saxophone.[4] She supplemented her income by playing in dance bands in the evenings.[5]\n",
      "Benson joined Yorkshire-based six-piece band Edna Croudson's Rhythm Girls in 1929, touring with them until 1935,[6] after which she toured with various bands including Teddy Joyce and the Girlfriends where she became a featured soloist.[1] She moved to London in the late 1930s and formed her own band. Their first significant engagement was performing with the all-female revue Meet the Girls, which starred Hylda Baker.[3]\n"
   ]
}