{
   "Albums": {
      "text": [
         "The band self-released their debut EP, Songs From the Valley Below, in February 2010, the same day that they debuted as a live band.  On May 19, 2011, they reissued a remixed and remastered version of Songs From the Valley Below.\n",
         "On January 22, 2011, The Family Crest released a limited local release of their debut LP, The Village. The Village was funded in part by a successful Kickstarter campaign, in which the band exceeded their $10,000 goal.[12] On May 1, 2012, The Village was self-released nationally.\n",
         "Both Songs From the Valley Below (Reissue) and The Village were mixed by Jay Pellicci at Tiny Telephone Studios in San Francisco, and mastered by Bernie Grundman at Bernie Grundman Studios in Hollywood.\n",
         "On September 18, 2012, the band announced their plans for a second full-length album, titled Beneath the Brine, by launching a second Kickstarter campaign.[13]  The project was successfully funded on November 17, 2012. On March 15, 2014, Beneath the Brine debuted at #16 on the Billboard Heatseekers Album Chart.\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "The brainchild of frontman Liam McCormick, The Family Crest began as a recording project in 2008 that aimed to connect a community of people through a musical platform. Using flyers, personal contacts, Craigslist and other forms of outreach, McCormick and co-founder John Seeterlin recorded nearly 100 people for the project throughout Northern California.[1]  After completing the majority of recording in the fall of 2009, McCormick and Seeterlin elected to continue the project by forming a live band.[2]\n",
         "After 'Falling off the Wagon' was featured on KFOG’s Local Scene 7 CD[3] in 2010, the band gained attention from Bay Area radio stations, receiving airplay on Bay Area public radio station KALW-FM, San Francisco's Pirate Cat Radio, KSFS and KVON. In-studio performances include live sets on KALX Berkeley,[4] Seattle's KEXP.[5] in January 2012, and a live set at San Francisco's KFOG Playspace in May 2012.\n",
         "‘Falling off the Wagon’ was used in both television and radio commercials for the second annual Notes & Words,[6] a concert benefiting Children’s Hospital Oakland founded by best-selling author Kelly Corrigan. On May 10, 2012 'North' was used in Episode 11 of the NBC drama Awake, titled Say Hello to My Little Friend. In September 2013, the band released 'Make Me a Boat' which was subsequently used by GoPro in the launch video for the Hero3+ camera. Beginning in January 2014, a new song titled 'The World' was used in television and internet commercials for Carnival Cruise Lines. In April 2014, The Family Crest was exclusively featured in the launch video for GoPro's line of music products, performing their song 'Make Me a Boat.'\n",
         "In January 2012, The Family Crest was selected to be part of Google Play's Magnified Artists program. On February 13, 2012, as part of the program, they performed at the Grammy Awards party for Red Light Management, an event sponsored by T-Mobile.[7][8] On May 27, 2012, the band performed at the 75th Anniversary Celebration of the Golden Gate Bridge.[9]\n",
         "The Family Crest announced on June 25, 2013 that they had signed to a Portland record label, Tender Loving Empire. Along with this announcement was the release of \"Love Don't Go\", the single from their upcoming EP, The Headwinds. The EP was released through Tender Loving Empire on July 30.\n",
         "Drummer for The Family Crest Charlie Giesige left the band in early 2017. Anthony Franceschi filled in for the band's headlining tour in spring 2017, and officially joined the band on October 22, 2017.[10]\n"
      ]
   },
   "Personnel": {
      "text": [
         "In addition to Liam McCormick (lead vocals, guitar) and John Seeterlin (bass), the band consists of Anthony Franceschi (drums), Laura Bergmann (flute, percussion, vocals), George Samaan (trombone) Owen Sutter (violin, percussion), and Charly Akert (cello, percussion). Laura Bergmann, Owen Sutter, Charly Akert, and George Samaan are all classically trained (Bergmann, Sutter, Akert, Samaan, and Franceschi hold degrees in music performance).\n",
         "Former core band members include Pat Elliott (drums), Nicole Calhoun (cello), Mike Rocha (trumpet), Jacob Steuer (drums), Sarah Dabby (viola, opera vocals), Lucas Chen (cello), and Charlie Giesige.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Personnel",
      "3 Style",
      "4 Albums",
      "5 Discography",
      "6 References",
      "7 External links"
   ],
   "Style": {
      "text": [
         "Though the band identifies themselves as an 'orchestral indie rock' band, their sound is inspired by many genres including jazz, folk, and classical. Kimberly Chun of the San Francisco Chronicle states that \"The Family Crest harbors an affection for Burt Bacharach-style swingin' romanticism that is sure to impress lovers of classic pop.\"[11]\n"
      ]
   },
   "Summary": {
      "text": [
         "The Family Crest is an American orchestral indie rock band based in San Francisco. The band is made up of seven core members and several hundred additional members who actively participate in recordings, live performances, and other creative projects.\n"
      ]
   },
   "Title": "The Family Crest - Wikipedia"
}