{
   "Name": "The Family Crest",
   "rawData": [
      "The Family Crest is an American orchestral indie rock band based in San Francisco. The band is made up of seven core members and several hundred additional members who actively participate in recordings, live performances, and other creative projects.\n",
      "The brainchild of frontman Liam McCormick, The Family Crest began as a recording project in 2008 that aimed to connect a community of people through a musical platform. Using flyers, personal contacts, Craigslist and other forms of outreach, McCormick and co-founder John Seeterlin recorded nearly 100 people for the project throughout Northern California.  After completing the majority of recording in the fall of 2009, McCormick and Seeterlin elected to continue the project by forming a live band.\n",
      "After 'Falling off the Wagon' was featured on KFOG’s Local Scene 7 CD in 2010, the band gained attention from Bay Area radio stations, receiving airplay on Bay Area public radio station KALW-FM, San Francisco's Pirate Cat Radio, KSFS and KVON. In-studio performances include live sets on KALX Berkeley, Seattle's KEXP. in January 2012, and a live set at San Francisco's KFOG Playspace in May 2012.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Indie rock"
      ],
      "Years active": [
         "2008 (2008)–present"
      ],
      "Labels": [
         "Tender Loving Empire"
      ],
      "Associated acts": [
         "Mother Falcon, Ben Kweller, Jimmy Gnecco, The Stone Foxes, The Head and the Heart, Train, OK Go"
      ],
      "Website": [
         "thefamilycrest.net"
      ],
      "Members": [
         "Liam McCormick",
         "John Seeterlin",
         "Laura Bergmann",
         "Charly Akert",
         "George Mousa Samaan",
         "Owen Sutter",
         "Anthony Franceschi"
      ],
      "Past members": [
         "Charlie Giesige",
         "Lucas Chen",
         "Pat Elliott",
         "Nicole Calhoun",
         "Mike Rocha",
         "Sarah Dabby",
         "Jacob Steuer"
      ]
   }
}