{
   "Name": "Jack Off Jill",
   "Sections": [
      "1 History",
      "2 Breakup and aftermath",
      "3 Reunion",
      "4 Members",
      "4.1 Timeline",
      "5 Discography",
      "5.1 Albums",
      "5.2 Singles",
      "5.3 EPs",
      "5.4 Compilations",
      "5.5 Cassette demos",
      "6 See also",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Jack Off Jill was an American alternative rock[1] band from Fort Lauderdale Florida founded in 1992 by vocalist Jessicka, drummer Tenni Ah-Cha-Cha, Agent Moulder, and guitarist Michelle Inhell. Though these four women were the initial founders,9 members rotated through the group in its life-span, including Scott Putesky, guitarist and co-founder of Marilyn Manson. The band lasted 3 years with only Jessicka remaining through all its line-ups. The band reunited in 2015 for a number of shows.[3]\n"
      ]
   },
   "History": {
      "text": [
         "Tenni Arslanyan met Jessicka while attending Piper High School in Sunrise, Florida. They had begun writing songs, but had not yet formed a band when Moulder and Inhell joined them to create the band that would become Jack Off Jill.\n",
         "Jack Off Jill's first show was opening for Marilyn Manson and his shock-rock outfit, Marilyn Manson and the Spooky Kids, at a Davie, Florida night club called The Plus Five Lounge. Manson went on to produce their early demos and had them open most of his shows.[4]\n",
         "During this time the band served as the opening act for many female-fronted national acts such as Joan Jett, L7, Silverfish, Tribe 8, Fetchin' Bones and the Lunachicks. Singer Jessicka's on-stage antics included covering the audience with spit and real blood and candy.[5][6] In early 1993, Jessicka performed with Manson's ephemeral side project, Mrs. Scabtree.[7]\n",
         "On December 27, 1994, Jack Off Jill joined Marilyn Manson on dates through Florida. While playing Club 5 in Jacksonville, Florida, Manson and Jessicka were arrested for violating the town's adult entertainment codes. Neither singer was charged.[8]\n",
         "Jack Off Jill released several independent records: Children 5 and Up (produced by Marilyn Manson),[5] The Boygrinder Sessions, Cannibal Song Book, (produced by JOJ and Manson at Studio 13 in Deerfield Beach, Florida)[7] Cockroach Waltz, and several 7\" singles. It was not until April 8, 1994, when JOJ played a benefit show for Rock Against Domestic Violence with Babes in Toyland and 7 Year Bitch at the Cameo Theatre on Miami Beach that Jack Off Jill caught the eye of record labels.[9] Los Angeles-based Risk Records later signed them in January 1997. The band replaced both Ah Cha Cha and Inhell with new members because the two were not ready to leave Florida. The band released their first national 7\" \"Girl Scout\"/\"American Made\" in March 1997. On September 9, 1997, their first full-length Sexless Demons And Scars (produced by Gumball's leader Don Fleming, who co-produced Hole's Pretty on the Inside) was released.\n",
         "After touring with Lords of Acid[citation needed], Jack Off Jill headed to Los Angeles in order to complete 1998's Covetous Creature, a remix EP of songs from Sexless Demons and Scars with the help of SMP (Scott Putesky), a founding member of Marilyn Manson and new drummer Claudia Rossi.[10] The new manifestation of Jack Off Jill hit the road on a national tour with Psychotica, joined along the way by Switchblade Symphony.\n",
         "The band road-tested new songs in March 1999 when JOJ played four dates on the Marilyn Manson Rock Is Dead Tour after Hole departed.[11] With Putesky no longer in the guitar position, JOJ enlisted the help of Jessicka's then-boyfriend guitarist Clint Walsh, original JOJ guitarist Michelle Inhell (née Oliver), and drummer Norm Block (formerly of Plexi) for the tour. On July 17, 2000, JOJ released their second full-length CD, Clear Hearts Grey Flowers on Risk Records, that featured a cover by artist Mark Ryden and was produced by Chris Vrenna of Tweaker and Nine Inch Nails.\n",
         "Jack Off Jill played its last show at The Troubadour in Los Angeles in April 2000. They were joined onstage by guitarist Helen Storer of the UK all-female band Fluffy (and later of Thee Heavenly Music Association) and producer Chris Vrenna on drums.[12]\n"
      ]
   },
   "Breakup and aftermath": {
      "text": [
         "Jack Off Jill officially disbanded in the year 2000. Jessicka founded noise-pop band Scarling. Moulder began her studio project TCR. Tenni Ah-Cha-Cha and Michelle Inhell's (née Oliver) founded Set to Zero. In 2010 Tenni Ah-Cha-Cha began playing with Zombie Queen out of Asheville, NC. Claudia Rossi founded a group called One Of The Loudest Tragedies Ever Heard. Hellen Storer's photo defunct project Thee Heavenly Music Association. Putesky worked on his solo project, Three Ton Gate.\n",
         "Post-breakup, critics have touted JOJ as \"riot-goth legends\"[13] and refer to Jack Off Jill's final album as \"excellent, yet under-appreciated\".[14]\n",
         "Former band member Jeff Tucci (Ho Ho Spade) died on November 27, 2014 of a drug overdose.[15]\n",
         "In September 2013, Putesky was diagnosed with stage-four colon cancer.[16] He died on October 22, 2017.[17]\n"
      ]
   },
   "Reunion": {
      "text": [
         "A reunion had been discussed by the band members in the preceding years, but they did not have the time to organise one. When Jessicka Addams suffered a serious health emergency in 2013, she decided it was \"now or never\".[18]\n",
         "On April 7, 2015, Bust.com announced a Jack Off Jill reunion show at The Orange Peel in Asheville, NC on July 18 as well as a Pledgemusic campaign offering \"Golden Tickets\" and other Jack Off Jill rarities related to the show. Other reunion shows in the tour included Manchester (19 October), London's Electric Ballroom (21 October) and Heaven Nightclub (23rd October), where they were joined on stage by (Scott Putesky), a founding member of Marilyn Manson. Their last London show was also on Jessicka's birthday, and was an emotional show for all of the fans and the band, especially due to Jessicka's health problems.[19] They announced via their facebook page that these shows would be their last saying, \"It's been an honor & a pleasure friends.\"\n",
         "The 2015 roster consisted of Jessicka, Tenni Ah-Cha-Cha, Michelle Inhell (née Oliver), and Helen Storer.[20] Original bassist Robin Moulder was not involved in the reunion shows.[21]\n",
         "Jack Off Jill is referred to by several publications as \"Riot Goth Legends\" & \"Cult Heroes\"[20][22][23]\n",
         "Singer Jessicka Addams stated that their show at Heaven in London on October 23, 2015 (her 40th birthday) would be Jack Off Jill's final show.[23]\n"
      ]
   },
   "Members": {
      "Timeline": {}
   },
   "Discography": {
      "Albums": {
         "text": [
            "CMJ\n"
         ]
      },
      "Singles": {},
      "EPs": {
         "text": [
            "\n"
         ]
      },
      "Compilations": {},
      "Cassette demos": {
         "text": [
            "1 indicates the demos were never released.\n"
         ]
      }
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Jack Off Jill was an American alternative rock[1] band from Fort Lauderdale Florida founded in 1992 by vocalist Jessicka, drummer Tenni Ah-Cha-Cha, Agent Moulder, and guitarist Michelle Inhell. Though these four women were the initial founders,9 members rotated through the group in its life-span, including Scott Putesky, guitarist and co-founder of Marilyn Manson. The band lasted 3 years with only Jessicka remaining through all its line-ups. The band reunited in 2015 for a number of shows.[3]\n",
      "Tenni Arslanyan met Jessicka while attending Piper High School in Sunrise, Florida. They had begun writing songs, but had not yet formed a band when Moulder and Inhell joined them to create the band that would become Jack Off Jill.\n",
      "Jack Off Jill's first show was opening for Marilyn Manson and his shock-rock outfit, Marilyn Manson and the Spooky Kids, at a Davie, Florida night club called The Plus Five Lounge. Manson went on to produce their early demos and had them open most of his shows.[4]\n",
      "During this time the band served as the opening act for many female-fronted national acts such as Joan Jett, L7, Silverfish, Tribe 8, Fetchin' Bones and the Lunachicks. Singer Jessicka's on-stage antics included covering the audience with spit and real blood and candy.[5][6] In early 1993, Jessicka performed with Manson's ephemeral side project, Mrs. Scabtree.[7]\n"
   ],
   "infobox": {
      "Origin": [
         "Fort Lauderdale, Florida, United States"
      ],
      "Genres": [
         "Alternative rock,[1] riot grrrl,[2] gothic rock,[2] punk rock"
      ],
      "Years active": [
         "1992—2000, 2015"
      ],
      "Labels": [
         "Rectum, Risk, Sympathy for the Record Industry"
      ],
      "Associated acts": [
         "Scarling., TCR, Set to Zero, Mrs. Scabtree, Thee Heavenly Music Association, Marilyn Manson"
      ],
      "Website": [
         "www.jessicka.com"
      ],
      "Past members": [
         "See list of members"
      ]
   }
}