{
   "Name": "Jale",
   "Sections": [
      "1 Career",
      "2 After the break up",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Jale was a Canadian alternative rock band from Halifax, Nova Scotia, Canada.  Contemporaries of Sloan and The Super Friendz, they were formed in 1992 and disbanded in 1996. They released three records in all (the albums Dreamcake and So Wound and the EP \"Closed\").\n"
      ]
   },
   "Career": {
      "text": [
         "Jale was formed by four art school students in 1992. The guitarist Jennifer Pierce had earlier sung backing vocals on the album Smeared by Sloan. The other founders were Alyson MacLeod (drums), Laura Stein (bass guitar) and Eve Hartling (guitar). The band's name was formed from the first letters of the members' first names.  \n",
         "Jale was the second Canadian band (after Eric's Trip) to be signed to the Seattle label Sub Pop.\n",
         "Jale's first album, Dreamcake, was released in 1994. \n",
         "In November 1995, Jale regrouped to record their second album, So Wound, in Chicago. Mike Belitsky of the alt-country band The Sadies replaced McLeod as drummer. So Wound appeared to contain radio-friendly hits in \"All Ready\" and \"Ali\". However, Sub Pop pulled support for the album while the band was on tour.\n",
         "Only a few months after the release of So Wound, Jale disbanded.  \n"
      ]
   },
   "After the break up": {
      "text": [
         "Pierce, Stein and Belitsky continued as The Vees. They toured Canada twice and released an EP, The Vees, on the Halifax label Murderecords in 1997. The band stopped performing the following year.\n",
         "Pierce, Stein and Belitsky resurfaced in 2000 as Chappaquiddick Skyline, a side project of the Massachusetts-based Pernice Brothers, and released an album, Chappaquiddick Skyline. Stein and Belitsky later appeared on the Pernice Brothers' albums The World Won't End (2001) and Yours, Mine and Ours (2003).  \n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Jale was a Canadian alternative rock band from Halifax, Nova Scotia, Canada.  Contemporaries of Sloan and The Super Friendz, they were formed in 1992 and disbanded in 1996. They released three records in all (the albums Dreamcake and So Wound and the EP \"Closed\").\n",
      "Jale was formed by four art school students in 1992. The guitarist Jennifer Pierce had earlier sung backing vocals on the album Smeared by Sloan. The other founders were Alyson MacLeod (drums), Laura Stein (bass guitar) and Eve Hartling (guitar). The band's name was formed from the first letters of the members' first names.  \n",
      "Jale was the second Canadian band (after Eric's Trip) to be signed to the Seattle label Sub Pop.\n",
      "Jale's first album, Dreamcake, was released in 1994. \n"
   ]
}