{
   "Name": "Katzenjammer (band)",
   "rawData": [
      "Katzenjammer was an English-language Norwegian band from Oslo, formed in 2005. The band consists of Anne Marit Bergheim, Solveig Heilo and Turid Jørgensen. Former band member Marianne Sveen left the band in the beginning of 2016.\n",
      "The members of Katzenjammer met in 2004 while studying at a private music school in Oslo. The band was formed in 2007 while listening to Anne Marit Bergheim perform the song \"Wading in Deeper\" on the piano. They were brought together by a common feeling of being \"the outcasts at the school.\" Katzenjammer felt that their music school didn't encourage originality, but \"only wanted to teach what had been done.\"\n",
      "The band is named after the Katzenjammer Kids, the oldest comic strip continually in syndication. They chose this comic strip because they noticed that they resembled the characters in it. The term Katzenjammer is a German loanword that literally means \"lament of a cat\", and is used in Norway to describe low-grade music and instrumentation (which in Germany would be called Katzenmusik - \"music by cats\").\n"
   ],
   "infobox": {
      "Origin": [
         "Oslo, Norway"
      ],
      "Genres": [
         "Rock, country, Balkan, dark cabaret"
      ],
      "Years active": [
         "2005–2017"
      ],
      "Labels": [
         "Propeller, Universal, Nettwerk"
      ],
      "Website": [
         "www.katzenjammer.com"
      ],
      "Past members": [
         "Marianne Sveen",
         "Anne Marit Bergheim",
         "Solveig Heilo",
         "Turid Jørgensen"
      ]
   },
   "albums": [
      "Le Pop",
      "A Kiss Before You Go",
      "Rockland"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Oslo, formed in [YEAR]. The band consists of Anne [MONTH]it Bergheim, [PERSON_NAME_FULL_1_FEMALE] and [PERSON_NAME_FULL_0_FEMALE]. Former band member [MONTH]ianne Sveen left the band in the beginning of [YEAR].\n",
      "The members of [BAND_NAME] met in [YEAR] while studying at a [GENRE] band was formed in [YEAR] while listening to Anne [MONTH]it Bergheim perform the song [SONG_NAME]\n",
      "The band is named after the [BAND_NAME] Kids, the oldest comic strip continually in syndication. They chose this comic strip because they noticed that they resembled the characters in it. The term [BAND_NAME] is a German loanword that literally means [SONG_NAME]).\n"
   ]
}