{
   "Name": "KSM (band)",
   "rawData": [
      "KSM was an American rock band from Los Angeles, California that was active from 2006 to 2010. The band consisted of lead singer Shelby Cobra (real last name Spalione), lead guitarist Shae Padilla, rhythm guitarist Katie Cecil, bassist Sophia Melon and drummer Kate Cabebe.\n",
      "They gained popularity in summer 2009 when they covered the song, \"I Want You to Want Me\" by Cheap Trick. The song was used to promote the television series 10 Things I Hate About You on the ABC Family network.\n",
      "KSM was formed in a joint project between The Walt Disney Company and former chart-topping girl band The Go-Go's. The Go-Go's were looking for an all-girl pop band to mentor and held auditions in 2006. Four musicians (Padilla, Cecil, Cabebe, and Melon; all age 13-15 at the time) were selected and the group was originally developed as a Go-Go's cover band called the Po-Go's. Disney planned to replicate its success with Devo 2.0, a kids' version of the '80s new wave band Devo, with the possibility of the Po-Go's appearing in a movie or TV series. Eventually the band's sound was changed from pop to rock, and with the addition of lead singer Shelby Cobra (real last name Spalione) in February 2008, they changed their name to KSM. Around that time, the Go-Go's ended their involvement with the project.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Power pop, pop rock, pop punk, alternative rock"
      ],
      "Years active": [
         "2006–2010"
      ],
      "Labels": [
         "Walt Disney"
      ],
      "Past members": [
         "Kate Cabebe",
         "Katie Cecil",
         "Shelby Cobra",
         "Shae Padilla ",
         "Sophia Melon"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Los Angeles, California that was active from [YEAR] to [YEAR]. The band consisted of lead singer Shelby Cobra (real last name Spalione), lead guitarist Shae Padilla, rhythm guitarist [PERSON_NAME_FULL_0_FEMALE], bassist Sophia Melon and drummer Kate Cabebe.\n",
      "They gained popularity in summer [YEAR] when they covered the song, \"I Want You to Want Me\" by Cheap Trick. The song was used to promote the television series 10 Things I Hate About You on the ABC Family network.\n",
      "[BAND_NAME] was formed in a [GENRE] band The Go-Go's. The Go-Go's were looking for an all-girl pop band to mentor and held auditions in [YEAR]. Four musicians (Padilla, Cecil, Cabebe, and Melon; all age 13-15 at the time) were selected and the group was originally developed as a Go-Go's cover band called the Po-Go's. Disney planned to replicate its success with Devo 2.0, a kids' version of the '80s new wave band Devo, with the possibility of the Po-Go's appearing in a movie or TV series. Eventually the band's sound was changed from pop to rock, and with the addition of lead singer Shelby Cobra (real last name Spalione) in [MONTH] [YEAR], they changed their name to [BAND_NAME]. Around that time, the Go-Go's ended their involvement with the project.\n"
   ]
}