{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "Le Tigre were initially envisioned as a live backup band for Hanna's solo project Julie Ruin. They took their name from one of many hypothetical bands made up by Hanna circa 1994. After Benning left the band, Samson filled in for them during live performances and eventually became an official member. Samson had previously worked with the band as a roadie and the operator of the band's slideshow during the few live performances before Benning's departure.[6]\n",
         "In 2003, Le Tigre collaborated with Chicks on Speed on their cover of Tom Tom Club's \"Wordy Rappinghood\" from their album 99 Cents along with other artists such as Miss Kittin, Kevin Blechdom, ADULT.'s Nicola Kuperus, and Tina Weymouth of Tom Tom Club.[7] The cover became a moderate dance hit in Europe, peaking at number five on the Belgian Dance Chart,[8] and at number sixty-six on the UK Singles Chart.[9]\n",
         "In 2010, Le Tigre briefly returned from an indefinite hiatus[10] to produce Christina Aguilera's \"My Girls\", from her sixth studio album Bionic. The track features Peaches.[11]\n",
         "Le Tigre members JD Samson and Johanna Fateman collaborated with Russian activists Pussy Riot during a concert organised by Vice (magazine) in 2014, performing Le Tigre's “Deceptacon”.[12] Later, in 2015, they reunited with Pussy Riot to record a song and video for Netflix series House of Cards (American TV series).[13]\n",
         "\nIn September 2016, the band announced they were reuniting just to release a “special song”.[14] On October 19, 2016, Le Tigre released the song, titled “I’m with Her”, and its accompanying video to voice their support of the 2016 Democratic Presidential Nominee, Hillary Clinton.[15]"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Le Tigre (French for \"The Tiger\", pronounced  /ləˈtiːɡrə/) was an American electronic rock band formed by Kathleen Hanna (formerly of Bikini Kill), Johanna Fateman and Sadie Benning in 1998 in New York City. Benning left in 2001 and was replaced by JD Samson for the rest of the group's existence. Le Tigre are known for their left-wing sociopolitical lyrics that often dealt with issues of feminism and the LGBT community. They mixed punk's directness and politics with playful samples, eclectic pop, and lo-fi electronics. The group also added multimedia and performance art elements to their live shows, which often featured support from like-minded acts such as The Need.[5]\n"
      ]
   },
   "Title": "Le Tigre - Wikipedia"
}