{
   "Name": "Le Tigre",
   "rawData": [
      "Le Tigre (French for \"The Tiger\", pronounced  /ləˈtiːɡrə/) was an American electronic rock band formed by Kathleen Hanna (formerly of Bikini Kill), Johanna Fateman and Sadie Benning in 1998 in New York City. Benning left in 2001 and was replaced by JD Samson for the rest of the group's existence. Le Tigre are known for their left-wing sociopolitical lyrics that often dealt with issues of feminism and the LGBT community. They mixed punk's directness and politics with playful samples, eclectic pop, and lo-fi electronics. The group also added multimedia and performance art elements to their live shows, which often featured support from like-minded acts such as The Need.\n",
      "Le Tigre were initially envisioned as a live backup band for Hanna's solo project Julie Ruin. They took their name from one of many hypothetical bands made up by Hanna circa 1994. After Benning left the band, Samson filled in for them during live performances and eventually became an official member. Samson had previously worked with the band as a roadie and the operator of the band's slideshow during the few live performances before Benning's departure.\n",
      "In 2003, Le Tigre collaborated with Chicks on Speed on their cover of Tom Tom Club's \"Wordy Rappinghood\" from their album 99 Cents along with other artists such as Miss Kittin, Kevin Blechdom, ADULT.'s Nicola Kuperus, and Tina Weymouth of Tom Tom Club. The cover became a moderate dance hit in Europe, peaking at number five on the Belgian Dance Chart, and at number sixty-six on the UK Singles Chart.\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, U.S."
      ],
      "Genres": [
         "Electronic rock[1]",
         "electroclash[2]",
         "dance-punk[3]"
      ],
      "Years active": [
         "1998–2007, 2010, 2016[4]"
      ],
      "Labels": [
         "Mr. Lady",
         "Strummer",
         "Universal"
      ],
      "Associated acts": [
         "Bikini Kill",
         "Julie Ruin",
         "The Julie Ruin",
         "MEN"
      ],
      "Website": [
         "www.letigreworld.com/sweepstakes/"
      ],
      "Past members": [
         "Kathleen Hanna",
         "Johanna Fateman",
         "JD Samson",
         "Sadie Benning"
      ]
   },
   "albums": [
      "Le Tigre",
      "Feminist Sweepstakes",
      "This Island"
   ],
   "prunedData": [
      "[BAND_NAME] (French for [SONG_NAME], pronounced  /ləˈtiːɡrə/) was an [GENRE] band formed by [PERSON_NAME_FULL_1_FEMALE] (formerly of Bikini Kill), [PERSON_NAME_FULL_2_FEMALE] and [PERSON_NAME_FULL_0_FEMALE] in [YEAR] in New York City. [PERSON_NAME_LAST_0] left in [YEAR] and was replaced by JD Samson for the rest of the group's existence. [BAND_NAME] are known for their left-wing sociopolitical lyrics that often dealt with issues of feminism and the LGBT community. They mixed punk's directness and politics with playful samples, eclectic pop, and lo-fi electronics. The group also added multimedia and performance art elements to their live shows, which often featured support from like-minded acts such as The Need.\n",
      "[BAND_NAME] were initially envisioned as a [GENRE] band for Hanna's solo project [MONTH]ie Ruin. They took their name from one of many hypothetical bands made up by Hanna circa [YEAR]. After Benning left the band, Samson filled in for them during live performances and eventually became an official member. Samson had previously worked with the band as a roadie and the operator of the band's slideshow during the few live performances before Benning's departure.\n",
      "In [YEAR], [BAND_NAME] collaborated with Chicks on Speed on their cover of Tom Tom Club's [SONG_NAME] from their album 99 Cents along with other artists such as Miss Kittin, [PERSON_NAME_FULL_2_MALE], ADULT.'s [PERSON_NAME_FULL_0_FEMALE], and [PERSON_NAME_FULL_1_FEMALE] of Tom Tom Club. The cover became a [GENRE]"
   ]
}