{
   "Name": "Lovebites (band)",
   "Sections": [
      "1 History",
      "1.1 Formation and first album (2016–2017)",
      "1.2 International recognition (2018–present)",
      "2 Music and influences",
      "3 Band members",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 EPs",
      "4.3 Live albums",
      "4.4 Video albums",
      "4.5 Singles",
      "4.6 Music videos",
      "5 Awards and nominations",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Lovebites (stylized as LOVEBITES) is a Japanese all-female heavy metal band, formed in 2016 by former Destrose members Miho and Haruna. Its lineup consists of Miho on bass, Haruna on drums, Midori and Miyako on guitar, and Asami on vocals. After signing to Victor Entertainment, the group released both their debut EP and their first album, The Lovebites EP and Awakening from Abyss, in 2017 before performing their first overseas concerts at the end of the year. With another EP and album released in 2018, Battle Against Damnation and Clockwork Immortality, Lovebites quickly garnered international attention and won that year's Metal Hammer Golden Gods Award for Best New Band. They released their third album, Electric Pentagram, in 2020, and it reached number 9 on the Oricon chart, becoming their highest-charting to date.\n"
      ]
   },
   "History": {
      "Formation and first album (2016–2017)": {
         "text": [
            "Lovebites was formed in Tokyo in 2016 by bassist Miho and drummer Haruna. The two met while members of Destrose, another all-female metal band that disbanded in 2015.[2] After recruiting guitarist Midori and support guitarist and keyboardist Miyako (then known as Mi-Ya), the four chose vocalist Asami based on a demo she made.[3] Midori was in the band Gekijo Metalicche, Miyako was a member of A Drop of Joker and 21g, while Asami was a backup singer for Vamps and Uverworld.[4] During one rehearsal, the musicians performed \"Love Bites (So Do I)\" by Halestorm. Feeling that the song fit well with Asami's voice, it left an impression on all of the members and they chose Lovebites as the name for their new band.[5] They had their first concert on November 18, 2016 at Tsutaya O-West.[3][4]\n",
            "Lovebites released their debut EP, The Lovebites EP, in May 2017 via Victor Entertainment. Miho explained that it was more of a demo to get the band signed, but the label liked it so much they had it properly mastered and released.[6] It was mixed by Mikko Karmila and mastered by Mika Jussila, who have worked with acts like Nightwish, Children of Bodom, and Stratovarius, at Finnvox Studios in Helsinki, Finland. The EP was released in the United Kingdom on August 25 by JPU Records and in North America by Sliptrick Records on August 31.[7]\n",
            "Support member Miyako became a full member of the band in August 2017.[8] Their first full-length album Awakening from Abyss was released in Japan and North America on October 25,[8] and in the UK two days later.[9] It was again mixed and mastered by Karmila and Jussila and includes re-recordings of the four tracks from their debut EP.[2][9] The group played just a handful of shows before their first gigs outside Japan: two nights at Hyper Japan Christmas and one show at Camden Underworld, both in London at the end of November 2017.[2]\n"
         ]
      },
      "International recognition (2018–present)": {
         "text": [
            "In 2018, Lovebites performed on the Japanese leg of Warped Tour and released their second EP Battle Against Damnation on June 6.[10][11][12] Days later, they won the 2018 Metal Hammer Golden Gods Award for Best New Band.[13] They performed at Wacken Open Air on August 4,[14] becoming the first Japanese all-female rock band to appear at the German festival.[15] They also performed on the main stage at Bloodstock Open Air on August 10, 2018.[16] In November, Lovebites held their first European tour that saw them visit the Netherlands, Germany, France and the UK.[17] The band released their second album Clockwork Immortality on December 5 in Japan. Limited editions of the album include a DVD or Blu-ray of the concert video Battle in the East, which was recorded on June 28, 2018 at Tsutaya O-East.[18] It was released in Europe, Australia, and New Zealand two days later by Arising Empire, and in the UK by JPU Records on January 18, 2019.[19][20]\n",
            "Lovebites was the opening act for Arch Enemy at two shows in Shanghai and Beijing, China on March 23 and 24, 2019.[21] In June, they performed at the Download Festival in both Donington, UK and Madrid, Spain and at the Graspop Metal Meeting in Dessel, Belgium.[22] Their set at Donington was cited by its organizers and Metal Hammer as one of the festival's highlight performances,[23][24] including when Asami joined Halestorm on stage to sing her band's namesake song,[25] which she had also done earlier at Download Festival Japan on March 21.[26]\n",
            "On July 10, Lovebites released their first standalone concert video and live album, Daughters of the Dawn - Live in Tokyo, recorded on January 27, 2019 at Mynavi Blitz Akasaka.[27] They were a support act on DragonForce's UK tour throughout the first half of November,[28] and opened for Halestorm in Tokyo on December 2.[29] The band's third studio album, Electric Pentagram, was released on January 29, 2020.[29] It was set to be supported by a seven-date Japanese tour from February 14 to April 12,[29] but the last three concerts were postponed until June due to the COVID-19 pandemic in Japan.[30] On July 22, Lovebites released their second standalone concert video and live album, Five of a Kind - Live in Tokyo 2020, recorded on February 21, 2020 at Zepp DiverCity.[31] To celebrate the third anniversary of Awakening from Abyss, the band streamed a live studio performance titled Awake Again, where they played the album in its entirety on October 25.[32]\n",
            "Lovebites wrote the song \"Winds of Transylvania\" to be used as the opening theme of the anime series Vlad Love and were named an official ambassador for the series. Its director, Mamoru Oshii, commented that \"I could immediately see parallels between the five members and the main character of Vlad Love. They are like a heretic of heavy metal, wearing bright white outfits while playing intense music, they are the perfect choice to take charge of a theme song to an anime not bound by convention or common sense. And above all, their name couldn't be more fitting!\"[33] The band members appear in the anime's opening credits, which also features Vlad Love's fictional characters performing the song in a sequence that the animators based on the band's.[34] A CD including \"Winds of Transylvania\" and the three other themes of the anime was released at Ichigo Animation's CulZone stores on January 9, 2021.[35]\n",
            "Lovebites' sold out national Ride for Vengeance Tour was set to take place between January 24 and March 5, 2021,[36] but the first three shows have been postponed following the Japanese government's declaration of a second state of emergency due to the COVID-19 pandemic.[37] The band will release their third EP Glory, Glory, to the World, which they recorded during the pandemic, on March 10.[38]\n"
         ]
      }
   },
   "Music and influences": {
      "text": [
         "Although hailing from Tokyo, Lovebites' music is heavily influenced by the new wave of British heavy metal which led their music to be compared to Iron Maiden and Rage.[2][39] Miho said she always wanted to play a combination of power metal and \"a little bit of old school [heavy metal].\"[2] She also noted that their decision to wear all-white clothing, as opposed to the genre's stereotypical black, was made to contrast with their old school sound and have them stand out.[2] Their lyrics are written in English even though the musicians do not speak the language fluently.[3] An exception is the Haruna-penned song \"Bravehearted\" on their debut EP, which was written in Japanese and intended for Destrose.[40]\n",
         "The group frequently collaborates with former Light Bringer keyboardist Mao on composing and arranging songs.[3][41] All of their releases have been mixed and mastered by Finnish audio engineers Mikko Karmila and Mika Jussila,[27] and all of their album cover illustrations since Awakening from Abyss have been created by Spanish artists David López Gómez and Carlos Vincente León.[42] These album covers all feature a wolf to symbolize that, by playing the non-mainstream genre of heavy metal, Lovebites are a \"lone wolf\" in the music scene.[43] The wolf is a mascot to represent the band, like Eddie for Iron Maiden or Vic Rattlehead for Megadeth.[43]\n",
         "Miho has been strongly into hard rock and heavy metal since junior high, and started playing bass in high school.[4] Her favorite bands are Iron Maiden, Pantera, Mötley Crüe and Anthrax.[4][40] She referred to her playing as more showmanship than technical, and cited Steve Harris as a particular influence alongside the style of Nikki Sixx.[40]\n",
         "Haruna has played drums since she was thirteen years old, and began writing songs on a keyboard at fourteen.[40][44] From elementary school up to high school her favorite band was B'z, but she became interested in heavy metal after hearing Helloween's Master of the Rings.[40][44] As a result, she stated her basic drumming style is that of Uli Kusch.[45]\n",
         "Midori started to learn piano at around two years of age and electric organ at eight, but gave up both upon entering university and started to learn guitar at 20.[4][46] She is a graduate of Musicians Institute Japan in Osaka, and listed Kiko Loureiro, Nuno Bettencourt and Yngwie Malmsteen as her biggest guitar influences.[4][46][47] Generally speaking, Midori said that she plays the \"flashy and aggressive\" guitar solos in the band, while Miyako plays the \"slower, more melodic\" ones.[43]\n",
         "Miyako has played classical piano since she was three and guitar since high school.[40] Having grown up listening to classic rock bands like Deep Purple and Rainbow with her mother, Miyako ended up being very influenced by Ritchie Blackmore.[47] But she has also been influenced by more modern guitarists, such as Timothy Henson and Scott LePage from Polyphia.[47] It was Disarmonia Mundi's Ettore Rigotti who inspired Miyako to start composing and arranging songs.[48]\n",
         "Asami comes from a R&B and soul music background and likes artists such as Alicia Keys and Aretha Franklin.[40] Starting at the age of two, she performed classical ballet for about 16 years before moving to America after high school to study jazz and hip-hop dance.[49][50]\n"
      ]
   },
   "Band members": {},
   "Discography": {
      "Studio albums": {},
      "EPs": {},
      "Live albums": {},
      "Video albums": {},
      "Singles": {},
      "Music videos": {}
   },
   "Awards and nominations": {
      "text": [
         "Metal Hammer Golden Gods Awards\n\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Lovebites (stylized as LOVEBITES) is a Japanese all-female heavy metal band, formed in 2016 by former Destrose members Miho and Haruna. Its lineup consists of Miho on bass, Haruna on drums, Midori and Miyako on guitar, and Asami on vocals. After signing to Victor Entertainment, the group released both their debut EP and their first album, The Lovebites EP and Awakening from Abyss, in 2017 before performing their first overseas concerts at the end of the year. With another EP and album released in 2018, Battle Against Damnation and Clockwork Immortality, Lovebites quickly garnered international attention and won that year's Metal Hammer Golden Gods Award for Best New Band. They released their third album, Electric Pentagram, in 2020, and it reached number 9 on the Oricon chart, becoming their highest-charting to date.\n",
      "Lovebites was formed in Tokyo in 2016 by bassist Miho and drummer Haruna. The two met while members of Destrose, another all-female metal band that disbanded in 2015.[2] After recruiting guitarist Midori and support guitarist and keyboardist Miyako (then known as Mi-Ya), the four chose vocalist Asami based on a demo she made.[3] Midori was in the band Gekijo Metalicche, Miyako was a member of A Drop of Joker and 21g, while Asami was a backup singer for Vamps and Uverworld.[4] During one rehearsal, the musicians performed \"Love Bites (So Do I)\" by Halestorm. Feeling that the song fit well with Asami's voice, it left an impression on all of the members and they chose Lovebites as the name for their new band.[5] They had their first concert on November 18, 2016 at Tsutaya O-West.[3][4]\n",
      "Lovebites released their debut EP, The Lovebites EP, in May 2017 via Victor Entertainment. Miho explained that it was more of a demo to get the band signed, but the label liked it so much they had it properly mastered and released.[6] It was mixed by Mikko Karmila and mastered by Mika Jussila, who have worked with acts like Nightwish, Children of Bodom, and Stratovarius, at Finnvox Studios in Helsinki, Finland. The EP was released in the United Kingdom on August 25 by JPU Records and in North America by Sliptrick Records on August 31.[7]\n",
      "Support member Miyako became a full member of the band in August 2017.[8] Their first full-length album Awakening from Abyss was released in Japan and North America on October 25,[8] and in the UK two days later.[9] It was again mixed and mastered by Karmila and Jussila and includes re-recordings of the four tracks from their debut EP.[2][9] The group played just a handful of shows before their first gigs outside Japan: two nights at Hyper Japan Christmas and one show at Camden Underworld, both in London at the end of November 2017.[2]\n"
   ]
}