{
   "Name": "Lovebites (band)",
   "rawData": [
      "Lovebites (stylized as LOVEBITES) is a Japanese all-female heavy metal band, formed in 2016 by former Destrose members Miho and Haruna. Its lineup consists of Miho on bass, Haruna on drums, Midori and Miyako on guitar, and Asami on vocals. After signing to Victor Entertainment, the group released both their debut EP and their first album, The Lovebites EP and Awakening from Abyss, in 2017 before performing their first overseas concerts at the end of the year. With another EP and album released in 2018, Battle Against Damnation and Clockwork Immortality, Lovebites quickly garnered international attention and won that year's Metal Hammer Golden Gods Award for Best New Band. They released their third album, Electric Pentagram, in 2020, and it reached number 9 on the Oricon chart, becoming their highest-charting to date.\n",
      "Lovebites was formed in Tokyo in 2016 by bassist Miho and drummer Haruna. The two met while members of Destrose, another all-female metal band that disbanded in 2015. After recruiting guitarist Midori and support guitarist and keyboardist Miyako (then known as Mi-Ya), the four chose vocalist Asami based on a demo she made. Midori was in the band Gekijo Metalicche, Miyako was a member of A Drop of Joker and 21g, while Asami was a backup singer for Vamps and Uverworld. During one rehearsal, the musicians performed \"Love Bites (So Do I)\" by Halestorm. Feeling that the song fit well with Asami's voice, it left an impression on all of the members and they chose Lovebites as the name for their new band. They had their first concert on November 18, 2016 at Tsutaya O-West.\n",
      "Lovebites released their debut EP, The Lovebites EP, in May 2017 via Victor Entertainment. Miho explained that it was more of a demo to get the band signed, but the label liked it so much they had it properly mastered and released. It was mixed by Mikko Karmila and mastered by Mika Jussila, who have worked with acts like Nightwish, Children of Bodom, and Stratovarius, at Finnvox Studios in Helsinki, Finland. The EP was released in the United Kingdom on August 25 by JPU Records and in North America by Sliptrick Records on August 31.\n"
   ],
   "infobox": {
      "Origin": [
         "Tokyo, Japan"
      ],
      "Genres": [
         "Power metal[1]"
      ],
      "Years active": [
         "2016–present"
      ],
      "Labels": [
         "Victor (JP), JPU (UK), Sliptrick (NA), Arising Empire (EU, AUS), Red River (NA)"
      ],
      "Associated acts": [
         "Destrose"
      ],
      "Website": [
         "Official site"
      ],
      "Members": [
         "Miho",
         "Haruna",
         "Midori",
         "Miyako",
         "Asami"
      ]
   }
}