{
   "Career": {
      "text": [
         "Madam X was formed in Detroit, Michigan in 1982 by the Petrucci sisters, who had previously played in an all-female group called Pantagruel.[1] They recruited bass guitarist Chris Doliber and vocalist John (Jayme) Grosjean, and the band relocated to the East Coast. Shortly after, John (Jayme) Grosjean left the band and was replaced by Bret Kaiser and they moved to New York. They were signed to Jet Records by Don Arden[1] and released their debut album We Reserve the Right in 1984, produced by Rick Derringer.[2] A single, \"High in High School\", was also released.[3] They also appeared on the British TV music show ECT.[1]\n",
         "Kaiser later left the band and was unsuccessfully replaced by British singer John Ward, later in the bands Sabre and Shy.[4] More songs were recorded but remained unreleased as the band were dropped by Jet.[5] Ward then left the band and was replaced by unknown Canadian vocalist Sebastian Bach. Roxy Petrucci also left, joining Vixen, and was replaced by Mark \"Bam-Bam\" McConnell. Despite touring with a flamboyant stage show, the group disintegrated in 1988 with Bach leaving to join Skid Row, and McConnell joining Carrera. Madam X continued briefly as a trio with Shawn Duncan replacing McConnell, but when Doliber left to form his own band, Madam X disbanded.[5]\n",
         "In 1991, the Petrucci sisters reformed Madam X with vocalist Lenita Erickson; this line-up was later renamed Hell's Belles with Irene Wohlman on bass guitar, but soon disbanded.[1]\n",
         "Roxy Petrucci later reformed Vixen,[5] being joined by Maxine on bass for a tour during 1998, only to leave Roxy's band thereafter. Vixen subsequently had to split following that tour when Roxy's previous bandmate Jan Kuehnemund filed a lawsuit to keep the rights to the Vixen name. After leaving Madam X, Bret Kaiser formed his own band (Kaiser) with his brother, and later performed with his own band ('56), releasing an album titled Steppin. Kaiser also performs as an Elvis Presley tribute artist.[6] McConnell died on May 24, 2012.[7]\n",
         "The four original members, Bret Kaiser (vocals), Maxine Petrucci (guitars), Roxy Petrucci (drums) and Chris \"Godzilla\" Doliber (bass), reunited at the Sweden Rock Festival on June 7, 2014.[8]  In August 2017 EMP Label Group, a record label formed by David Ellefson of Megadeth, signed the original-member line-up of Madam X and their new album Monstrocity was released October 31, 2017.\n"
      ]
   },
   "Discography": {},
   "Personnel": {
      "Current members": {},
      "Past members": {}
   },
   "References": {},
   "Sections": [
      "1 Career",
      "2 Discography",
      "3 Personnel",
      "3.1 Current members",
      "3.2 Past members",
      "4 Timeline",
      "5 References"
   ],
   "Summary": {
      "text": [
         "Madam X is an American hard rock band first active in glam metal during the 1980s. Originally formed by two sisters, Maxine and Roxy Petrucci, the band also featured male members John (Jayme) Grosjean, Bret Kaiser and Chris Doliber, and later included future Skid Row vocalist Sebastian Bach. Disbanding in 1988, the group reformed briefly in 1991, and has become active again after reforming for a second time in 2013. The band released a new album, Monstrocity, on October 31, 2017.\n"
      ]
   },
   "Timeline": {},
   "Title": "Madam X (band) - Wikipedia"
}