{
   "Name": "Madam X (band)",
   "rawData": [
      "Madam X is an American hard rock band first active in glam metal during the 1980s. Originally formed by two sisters, Maxine and Roxy Petrucci, the band also featured male members John (Jayme) Grosjean, Bret Kaiser and Chris Doliber, and later included future Skid Row vocalist Sebastian Bach. Disbanding in 1988, the group reformed briefly in 1991, and has become active again after reforming for a second time in 2013. The band released a new album, Monstrocity, on October 31, 2017.\n",
      "Madam X was formed in Detroit, Michigan in 1982 by the Petrucci sisters, who had previously played in an all-female group called Pantagruel. They recruited bass guitarist Chris Doliber and vocalist John (Jayme) Grosjean, and the band relocated to the East Coast. Shortly after, John (Jayme) Grosjean left the band and was replaced by Bret Kaiser and they moved to New York. They were signed to Jet Records by Don Arden and released their debut album We Reserve the Right in 1984, produced by Rick Derringer. A single, \"High in High School\", was also released. They also appeared on the British TV music show ECT.\n",
      "Kaiser later left the band and was unsuccessfully replaced by British singer John Ward, later in the bands Sabre and Shy. More songs were recorded but remained unreleased as the band were dropped by Jet. Ward then left the band and was replaced by unknown Canadian vocalist Sebastian Bach. Roxy Petrucci also left, joining Vixen, and was replaced by Mark \"Bam-Bam\" McConnell. Despite touring with a flamboyant stage show, the group disintegrated in 1988 with Bach leaving to join Skid Row, and McConnell joining Carrera. Madam X continued briefly as a trio with Shawn Duncan replacing McConnell, but when Doliber left to form his own band, Madam X disbanded.\n"
   ],
   "infobox": {
      "Also known as": [
         "Hell's Belles (1991)"
      ],
      "Origin": [
         "Detroit, Michigan, U.S."
      ],
      "Genres": [
         "Glam metal, heavy metal, hard rock"
      ],
      "Years active": [
         "1982–88, 1991, 2013–present"
      ],
      "Labels": [
         "Jet"
      ],
      "Associated acts": [
         "Vixen"
      ],
      "Members": [
         "Maxine Petrucci",
         "Roxy Petrucci",
         "Chris Doliber",
         "Bret Kaiser"
      ],
      "Past members": [
         "John Grosjean ",
         "John Ward",
         "Mark McConnell",
         "Sebastian Bach",
         "David Rolen",
         "Shawn Duncan",
         "Lenita Erickson",
         "Irene Wohlman"
      ]
   },
   "albums": [
      "We Reserve the Right",
      "Monstrocity"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band first active in glam metal during the [YEAR]s. Originally formed by two sisters, Maxine and [PERSON_NAME_FULL_0_FEMALE], the band also featured male members John (Jayme) Grosjean, Bret Kaiser and [PERSON_NAME_FULL_2_MALE], and later included future Skid Row vocalist [PERSON_NAME_FULL_1_MALE]. Disbanding in [YEAR], the group reformed briefly in [YEAR], and has become active again after reforming for a second time in [YEAR]. The band released a new album, Monstrocity, on [MONTH] 31, [YEAR].\n",
      "[BAND_NAME] was formed in Detroit, Michigan in [YEAR] by the Petrucci sisters, who had previously played in an all-female group called Pantagruel. They recruited bass guitarist [PERSON_NAME_FULL_2_MALE] and vocalist John (Jayme) Grosjean, and the band relocated to the East Coast. Shortly after, John (Jayme) Grosjean left the band and was replaced by Bret Kaiser and they moved to New York. They were signed to [PERSON_NAME_FULL_0_FEMALE] by Don Arden and released their debut album We Reserve the Right in [YEAR], produced by [PERSON_NAME_FULL_1_MALE]. A single, [SONG_NAME], was also released. They also appeared on the British TV music show ECT.\n",
      "Kaiser later left the band and was unsuccessfully replaced by British singer John Ward, later in the bands Sabre and Shy. More songs were recorded but remained unreleased as the band were dropped by Jet. Ward then left the band and was replaced by unknown Canadian vocalist [PERSON_NAME_FULL_2_MALE]. [PERSON_NAME_FULL_1_FEMALE] also left, joining Vixen, and was replaced by [MONTH]k [SONG_NAME] McConnell. Despite touring with a flamboyant stage show, the group disintegrated in [YEAR] with [PERSON_NAME_LAST_2] leaving to join Skid Row, and McConnell joining Carrera. [BAND_NAME] continued briefly as a trio with [PERSON_NAME_FULL_0_MALE] replacing McConnell, but when Doliber left to form his own band, [BAND_NAME] disbanded.\n"
   ]
}