{
   "Name": "Fecal Matter (band)",
   "Sections": [
      "1 History",
      "2 Legacy",
      "3 Members",
      "4 Illiteracy Will Prevail",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Fecal Matter was a short-lived punk rock band from Aberdeen, Washington. The group was formed in 1985 by Kurt Cobain, the future frontman of Nirvana, along with Dale Crover of the Melvins and drummer Greg Hokanson. Hokanson was removed from the band over his penchant for Schmidt beer (otherwise known as Animal beer) and mini thins or \"witch speed\", and his ensuing negative attitude.  Melvins members Buzz Osborne (also known as \"King Buzzo\") and Mike Dillard appeared in a later version of the band during rehearsals the following year.\n",
         "Songs from the group's sole recording session were issued as the Illiteracy Will Prevail demo tape. With the exception of the song \"Spank Thru\", the tracks from this session remain unreleased officially.[1] A re-recording of \"Downer\" was also released on the first Nirvana album, Bleach.[2] Illiteracy Will Prevail is the earliest documentation of Cobain's songwriting in circulation, and helped Cobain to establish himself as a composer and performer among his peers in the underground rock scene in Washington state.\n"
      ]
   },
   "History": {
      "text": [
         "Fecal Matter formed early in 1985 after Kurt Cobain had dropped out of Aberdeen High School.[3] One of \"several joke bands\" that arose from the circle of friends associated with the Melvins,[3] it initially included Cobain singing and playing guitar, Melvins drummer Dale Crover playing bass, and Greg Hokanson playing drums.[4] The band spent several months rehearsing original material and covers, including songs by The Ramones, Led Zeppelin, and Jimi Hendrix.[3][5]\n",
         "In the SeaTac home of Cobain's aunt Mari Earl, Cobain and Crover recorded the Illiteracy Will Prevail demo on a 4-track recorder.[4] The date of the recording session has been disputed; many have followed Michael Azerrad's dating of the session to December 1985 in his Come as You Are: The Story of Nirvana biography from 1993,[4] while Gillian Gaar contends in her 2012 biography Entertain Us!: The Rise of Nirvana that Easter break in 1986 is more likely.[3]  With Crover playing both bass and drums, the two recorded 13 original songs in total, which Cobain would later remember as a \"totally abrasive\" batch of punk songs reflecting his dual interest in Black Sabbath and Black Flag.[3]  Although Crover later dismissed the demo as \"amateurish,\" Melvins frontman Buzz Osborne recalled a \"certain magic\" in the band's simple but effective recording, citing as memorable their \"ability to put something together in an interesting way.\"[3]\n",
         "Later in 1986, Osborne and former Melvins drummer Mike Dillard joined the group playing bass and drums, respectively.[4] This incarnation rehearsed for a brief time only; Azerrad records Cobain's frustration with Osborne for failing to take the band seriously enough to buy a bass guitar amplifier.[4] The only live performance of this era occurred on May 3, 1986, in Olympia under the name Brown Towel (sometimes reported as \"Brown Cow\").[3] This short-lived and related project featured Cobain's poetry and lyrics along with Osborne and Crover's musical accompaniment.[3]\n",
         "Fecal Matter disbanded that year while Melvins supported their debut EP, Six Songs.\n"
      ]
   },
   "Legacy": {
      "text": [
         "Although the band had become inactive, Cobain continued passing around the Fecal Matter demo tape to friends and peers. His acquaintance Krist Novoselic, with whom Cobain had briefly jammed previously[6] and had wanted to collaborate for some time, heard the tape and particularly liked the song \"Spank Thru\". The two agreed to form a band, which eventually became Nirvana.[3] They began rehearsals later in 1986 for the new project, and reused the Fecal Matter songs \"Downer\", \"Anorexorcist\", and \"Spank Thru\".[3]\n",
         "\"Spank Thru\" is the only track from the tape to be released officially, arriving on the 2005 Nirvana rarities album Sliver: The Best of the Box.[7] The song's first half satirizes adolescent hard rock and the sentimental love lyrics that arena bands used to veil songs about sex.[8] \"Spank Thru\" develops into a high-energy punk song in its second half, with lyrics about masturbation.[8] According to music theorist Tim Hughes, \"While Cobain is mocking the heavy metal kids who regularly beat him in high school, the frenzied energy he displays simultaneously communicates a sense of the dumb, frustrated, angry state of mind that fueled those beatings.\"[8]\n",
         "\"Downer\" was re-recorded for Nirvana's Bleach album but left off it. The song \"Anorexorcist\", part of a nine-minute medley on the Fecal Matter demo, was also re-recorded by Nirvana in a version released on 2004's With the Lights Out boxed set.\n",
         "Illiteracy Will Prevail remained a highly sought-after and elusive item for collectors as Nirvana rose to fame, became extensively bootlegged, and ultimately had their career cut short by Cobain's death in 1994. Numerous forgeries arose[9] before an incomplete, poor-quality version of the demo was leaked in March 2006. A week later, three full songs from the demo were briefly hosted on a MySpace site (\"Sound of Dentage\", \"Bambi Slaughter\" and \"Laminated Effect\"). The clips were confirmed authentic by collector Mike Ziegler and others who had heard the demo.\n",
         "In August 2015, the two anonymous leakers shared the content of the whole tape in both mp3 and lossless format. A remastered version is also available.[10]\n"
      ]
   },
   "Members": {},
   "Illiteracy Will Prevail": {
      "text": [
         "The titles \"Laminated Effect\" and \"Blather's Log\" are thought to apply to two of the compositions on the cassette, though it is unclear which. The end of \"Sound of Dentage\" features various clips from Reefer Madness as well as commercial excerpts.\n",
         "Recorded in Burien, Washington, on TEAC A-2340 four-track recorder.[4] Self-released.\n",
         "The back cover is reported to have contact information for Cobain and Crover on it.\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Fecal Matter was a short-lived punk rock band from Aberdeen, Washington. The group was formed in 1985 by Kurt Cobain, the future frontman of Nirvana, along with Dale Crover of the Melvins and drummer Greg Hokanson. Hokanson was removed from the band over his penchant for Schmidt beer (otherwise known as Animal beer) and mini thins or \"witch speed\", and his ensuing negative attitude.  Melvins members Buzz Osborne (also known as \"King Buzzo\") and Mike Dillard appeared in a later version of the band during rehearsals the following year.\n",
      "Songs from the group's sole recording session were issued as the Illiteracy Will Prevail demo tape. With the exception of the song \"Spank Thru\", the tracks from this session remain unreleased officially.[1] A re-recording of \"Downer\" was also released on the first Nirvana album, Bleach.[2] Illiteracy Will Prevail is the earliest documentation of Cobain's songwriting in circulation, and helped Cobain to establish himself as a composer and performer among his peers in the underground rock scene in Washington state.\n",
      "Fecal Matter formed early in 1985 after Kurt Cobain had dropped out of Aberdeen High School.[3] One of \"several joke bands\" that arose from the circle of friends associated with the Melvins,[3] it initially included Cobain singing and playing guitar, Melvins drummer Dale Crover playing bass, and Greg Hokanson playing drums.[4] The band spent several months rehearsing original material and covers, including songs by The Ramones, Led Zeppelin, and Jimi Hendrix.[3][5]\n",
      "In the SeaTac home of Cobain's aunt Mari Earl, Cobain and Crover recorded the Illiteracy Will Prevail demo on a 4-track recorder.[4] The date of the recording session has been disputed; many have followed Michael Azerrad's dating of the session to December 1985 in his Come as You Are: The Story of Nirvana biography from 1993,[4] while Gillian Gaar contends in her 2012 biography Entertain Us!: The Rise of Nirvana that Easter break in 1986 is more likely.[3]  With Crover playing both bass and drums, the two recorded 13 original songs in total, which Cobain would later remember as a \"totally abrasive\" batch of punk songs reflecting his dual interest in Black Sabbath and Black Flag.[3]  Although Crover later dismissed the demo as \"amateurish,\" Melvins frontman Buzz Osborne recalled a \"certain magic\" in the band's simple but effective recording, citing as memorable their \"ability to put something together in an interesting way.\"[3]\n"
   ],
   "infobox": {
      "Also known as": [
         "Brown Towel, Brown Cow"
      ],
      "Origin": [
         "Aberdeen, Washington, U.S."
      ],
      "Genres": [
         "Punk rock",
         "heavy metal",
         "sludge metal"
      ],
      "Years active": [
         "1985–1986"
      ],
      "Associated acts": [
         "Nirvana",
         "Melvins"
      ],
      "Past members": [
         "Kurt Cobain",
         "Dale Crover",
         "Greg Hokanson",
         "Buzz Osborne",
         "Mike Dillard"
      ]
   }
}