{
   "Name": "Fecal Matter (band)",
   "rawData": [
      "Fecal Matter was a short-lived punk rock band from Aberdeen, Washington. The group was formed in 1985 by Kurt Cobain, the future frontman of Nirvana, along with Dale Crover of the Melvins and drummer Greg Hokanson. Hokanson was removed from the band over his penchant for Schmidt beer (otherwise known as Animal beer) and mini thins or \"witch speed\", and his ensuing negative attitude.  Melvins members Buzz Osborne (also known as \"King Buzzo\") and Mike Dillard appeared in a later version of the band during rehearsals the following year.\n",
      "Songs from the group's sole recording session were issued as the Illiteracy Will Prevail demo tape. With the exception of the song \"Spank Thru\", the tracks from this session remain unreleased officially. A re-recording of \"Downer\" was also released on the first Nirvana album, Bleach. Illiteracy Will Prevail is the earliest documentation of Cobain's songwriting in circulation, and helped Cobain to establish himself as a composer and performer among his peers in the underground rock scene in Washington state.\n",
      "Fecal Matter formed early in 1985 after Kurt Cobain had dropped out of Aberdeen High School. One of \"several joke bands\" that arose from the circle of friends associated with the Melvins, it initially included Cobain singing and playing guitar, Melvins drummer Dale Crover playing bass, and Greg Hokanson playing drums. The band spent several months rehearsing original material and covers, including songs by The Ramones, Led Zeppelin, and Jimi Hendrix.\n"
   ],
   "infobox": {
      "Also known as": [
         "Brown Towel, Brown Cow"
      ],
      "Origin": [
         "Aberdeen, Washington, U.S."
      ],
      "Genres": [
         "Punk rock",
         "heavy metal",
         "sludge metal"
      ],
      "Years active": [
         "1985–1986"
      ],
      "Associated acts": [
         "Nirvana",
         "Melvins"
      ],
      "Past members": [
         "Kurt Cobain",
         "Dale Crover",
         "Greg Hokanson",
         "Buzz Osborne",
         "Mike Dillard"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band from Aberdeen, Washington. The group was formed in [YEAR] by [PERSON_NAME_FULL_0_MALE], the future frontman of Nirvana, along with Dale Crover of the Melvins and drummer [PERSON_NAME_FULL_2_MALE]. [PERSON_NAME_LAST_2] was removed from the band over his penchant for Schmidt beer (otherwise known as Animal beer) and mini thins or \"witch speed\", and his ensuing negative attitude.  Melvins members Buzz Osborne (also known as \"King Buzzo\") and [PERSON_NAME_FULL_1_MALE] appeared in a later version of the band during rehearsals the following year.\n",
      "Songs from the group's sole recording session were issued as the Illiteracy Will Prevail demo tape. With the exception of the song \"Spank Thru\", the tracks from this session remain unreleased officially. A re-recording of \"Downer\" was also released on the first Nirvana album, Bleach. Illiteracy Will Prevail is the earliest documentation of Cobain's songwriting in circulation, and helped Cobain to establish himself as a [GENRE]",
      "[BAND_NAME] formed early in [YEAR] after [PERSON_NAME_FULL_1_MALE] had dropped out of Aberdeen High School. One of \"several joke bands\" that arose from the circle of friends associated with the Melvins, it initially included [PERSON_NAME_LAST_1] singing and playing guitar, Melvins drummer Dale Crover playing bass, and [PERSON_NAME_FULL_2_MALE] playing drums. The band spent several months rehearsing original material and covers, including songs by The Ramones, Led Zeppelin, and [PERSON_NAME_FULL_0_MALE].\n"
   ]
}