{
   "Name": "Film School (band)",
   "rawData": [
      "Film School is a five-piece indie rock band from Los Angeles and San Francisco.\n",
      "The band was formed in 1998 by lead singer Greg Bertens. Initially, the band only consisted of Bertens working with members of Fuck and Pavement when they released their debut album Brilliant Career, on MeToo! records in 2001. Jason Ruck (keyboards), Nyles Lannon (guitar), Justin Labo (bass guitar), and Ben Montesano (drums) joined the band on a permanent basis later that year.\n",
      "In 2003, the band released Alwaysnever, an EP on Amazing Grease Records, a record label founded by Scott Kannberg from the band Pavement. Donny Newenhouse later replaced Montesano on drums. Their self-titled album was released in January 2006 on Beggars Banquet Records. Film School has also provided music for a series of short films by Demetri Martin, known collectively as \"Clearification\", an advertising campaign for Windows Vista.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, U.S."
      ],
      "Genres": [
         "Indie rock, shoegazing"
      ],
      "Years active": [
         "1998–2011, 2014-present"
      ],
      "Labels": [
         "Beggars Banquet"
      ],
      "Website": [
         "filmschoolmusic.com"
      ],
      "Members": [
         "Greg Bertens",
         "Jason Ruck",
         "Justin Labo",
         "Nyles Lannon"
      ],
      "Past members": [
         "Lorelei (Plotczyk) Meetze",
         "Ben Montesano",
         "Donny Newenhouse",
         "James Smith",
         "Dave Dupuis"
      ]
   },
   "albums": [
      "Brilliant Career",
      "Film School",
      "Hideout",
      "Fission",
      "Bright To Death"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Los Angeles and [PERSON_NAME_FULL_0_MALE].\n",
      "The band was formed in [YEAR] by lead singer [PERSON_NAME_FULL_0_MALE]. Initially, the band only consisted of [PERSON_NAME_LAST_0] working with members of Fuck and Pavement when they released their debut album Brilliant Career, on MeToo! records in [YEAR]. Jason Ruck (keyboards), Nyles Lannon (guitar), [PERSON_NAME_FULL_1_MALE] (bass guitar), and Ben Montesano (drums) joined the band on a [GENRE]",
      "In [YEAR], the band released Alwaysnever, an [GENRE] a record label founded by Scott Kannberg from the band Pavement. [PERSON_NAME_FULL_0_MALE] later replaced Montesano on drums. Their self-titled album was released in [MONTH] [YEAR] on Beggars Banquet Records. [BAND_NAME] has also provided music for a series of short films by Demetri [MONTH]tin, known collectively as [SONG_NAME], an advertising campaign for Windows Vista.\n"
   ]
}