{
   "Discography": {
      "Albums": {},
      "EPs": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "text": [
         "The band was formed in 1998 by lead singer Greg Bertens. Initially, the band only consisted of Bertens working with members of Fuck and Pavement when they released their debut album Brilliant Career, on MeToo! records in 2001. Jason Ruck (keyboards), Nyles Lannon (guitar), Justin Labo (bass guitar), and Ben Montesano (drums) joined the band on a permanent basis later that year.\n",
         "In 2003, the band released Alwaysnever, an EP on Amazing Grease Records, a record label founded by Scott Kannberg from the band Pavement. Donny Newenhouse later replaced Montesano on drums. Their self-titled album was released in January 2006 on Beggars Banquet Records. Film School has also provided music for a series of short films by Demetri Martin, known collectively as \"Clearification\", an advertising campaign for Windows Vista.\n",
         "Film School released their third album (second on Beggars Banquet) called Hideout in September 2007 after going through some line-up changes and moving to Los Angeles. Lorelei Plotczyk replaced Justin Labo on bass, Dave Dupuis replaced Nyles Lannon on guitar, and James Smith replaced Donny Newenhouse on drums. Hideout was largely written by Bertens, recorded with Dan Long and mixed by Phil Ek.\n",
         "Their fourth album, Fission, was released on Hi-Speed Soul in August 2010 to mixed reviews as the band's exploration of new territory delighted some at the same time as it disappointed others.[citation needed]\n",
         "Film School played what appeared to be their last official show on February 24, 2011 and subsequently became inactive. However, the band's self-titled album lineup reunited on September 5, 2014, to play a special, one-off show at San Francisco's Bottom of the Hill as a tribute for Newenhouse's 40th birthday.[2] The band most recently released the single Crushin' in May 2018.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Albums",
      "2.2 EPs",
      "2.3 Singles",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Film School is a five-piece indie rock band from Los Angeles[1] and San Francisco.\n"
      ]
   },
   "Title": "Film School (band) - Wikipedia"
}