{
   "Name": "Oreskaband",
   "rawData": [
      "Oreskaband (オレスカバンド, Oresukabando, stylized as ORESKABAND) is an all-female ska band from Sakai, Japan. As well as performing regularly within Japan, they have toured in North and South America, as well as Europe.\n",
      "The band name, \"ore ska band,\" literally translates as \"we're (a) ska band.\" While \"ore\" is normally considered a masculine pronoun and an informal way to say \"I\" in Japanese, and the suffix \"-tachi\" is added to personal nouns when emphasizing that they are plural, in this context the term \"ore\" means something more along the lines of \"we fellows.\"  The choice of \"ore\" is also one of gender play, as the band would typically appear wearing boys' school uniform in their early videos and concerts.\n",
      "Oreskaband began in 2003 when the members were still in middle school.  Ikasu saw Tae playing in a local band and asked her to form a new one with her and some of their other friends.  They self-produced their first album, Penpal, in 2005 and were signed by Sony Music in 2006 while they were still in high school.\n"
   ],
   "infobox": {
      "Also known as": [
         "Oreskaband"
      ],
      "Origin": [
         "Sakai, Japan"
      ],
      "Genres": [
         "J-ska, ska punk, pop punk, 2-tone"
      ],
      "Years active": [
         "2003-present"
      ],
      "Labels": [
         "Sony Music Japan"
      ],
      "Website": [
         "oreskaband.com"
      ],
      "Members": [
         "iCas",
         "Tae",
         "Hayami",
         "Add",
         "CC"
      ],
      "Past members": [
         "Morico",
         "Saki (hiatus)",
         "Tomi"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (オレスカバンド, Oresukabando, stylized as ORESKABAND) is an [GENRE] band from Sakai, Japan. As well as performing regularly within Japan, they have toured in North and South America, as well as Europe.\n",
      "The band name, \"ore ska band,\" literally translates as \"we're (a) ska band.\" While \"ore\" is normally considered a [GENRE] an informal way to say \"I\" in Japanese, and the suffix \"-tachi\" is added to personal nouns when emphasizing that they are plural, in this context the term \"ore\" means something more along the lines of \"we fellows.\"  The choice of \"ore\" is also one of gender play, as the band would typically appear wearing boys' school uniform in their early videos and concerts.\n",
      "[BAND_NAME] began in [YEAR] when the members were still in middle school.  Ikasu saw [PERSON_NAME_FULL_0_MALE] playing in a [GENRE] band and asked her to form a new one with her and some of their other friends.  They self-produced their first album, Penpal, in [YEAR] and were signed by Sony Music in [YEAR] while they were still in high school.\n"
   ]
}