{
   "Discography": {
      "Albums and EPs": {},
      "As featured artist": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Oreskaband began in 2003 when the members were still in middle school.  Ikasu saw Tae playing in a local band and asked her to form a new one with her and some of their other friends.[3]  They self-produced their first album, Penpal, in 2005 and were signed by Sony Music in 2006 while they were still in high school.\n",
         "The band received media attention from their appearance in a commercial advertising the popular Japanese snack Pocky. In July 2006, their major debut EP Ore was released and a month later, they appeared at the Fuji Rock Festival attracting 1,000 attendees, a record for a new artist. In March 2007, the band members graduated from high school and toured in the United States appearing in Austin, Los Angeles, and San Francisco as part of the Japan Nite tour.[4] In April 2007, their song, \"Tsumasaki\" (爪先, Fingertips), was featured as the 11th ending for the anime Bleach. In May, they released their first full-length album, WAO!!. They performed at Anime Expo in Long Beach, California in July 2007 and participated in the 2008 Vans Warped Tour. Oreskaband starred in the film Lock and Roll Forever, which was set for a 2008 release in Japan. Despite the involvement of several individuals associated with the High School Musical franchise, including producers Bill Borden and Barry Rosenbush, screenwriter Peter Barsocchini and actor Lucas Grabeel in a starring role, as well as a cameo appearance from Joan Jett, the film's Japanese release never materialised, and following the US premiere it did not resurface until 2013 as a direct-to-DVD release in Scandinavia.[5][6] The band released their second full-length album, Color in 2010, and the single \"Jitensha\" (自転車, Bicycle) was featured as the 13th ending song of Naruto: Shippuden.\n",
         "In 2013 the band were featured on AKB48 member Mayu Watanabe's fourth solo single, \"Rappa Renshūchū\".[7][8] In 2015, they performed at that year's Otakon convention in the USA. In 2016, long-time saxophonist and keyboardist Morico left the band to start a family, and the band released their third full-length album Slogan the same year, with new saxophonist ADD.[9] This configuration of the band's horn section made a guest appearance on The Autocratics' 2017 self-titled album, including the duet \"On the Rainy Night\", which featured vocals from iCas.[10]\n",
         "In December 2018 it was announced that trumpeter Saki would be taking time off from Oreskaband to pursue a songwriting career, subsequently joining Tokyo-based skacore band Mayson's Party in February 2021.[11][12] Trumpeter Hisae Ōtomari took her place as a support member from January until October 2019.[13] At the band's Stay Irie, Go Rudy event in October 2019, they announced the new addition of keyboardist CC to their lineup as a full member.[14] This lineup would prove short-lived, as bassist Tomi announced in February 2020 that she would be leaving to pursue other musical endeavors, following a final pair of performances with the band in Tokyo and their hometown of Sakai, Osaka Prefecture scheduled for that April.[15] The COVID-19 pandemic led to the postponement of both concerts until August.[16] Owing to the continued impact of the pandemic, the performances were ultimately livestreamed without an audience present, with Luck Life appearing as the support band for the Tokyo concert, while Gelugugu were scheduled to support Oreskaband at the Sakai concert, but cancelled their appearance due to the pandemic.[17][18] Tomi's role was filled in subsequent performances by support member Aki Kawano, and the band announced that November that their lineup would be further bolstered in their December 2020 live performance by support member Natsuka Emi on trumpet, bringing the onstage lineup to seven members for the first time in the band's history, and ending the trumpet's absence from Oreskaband's horn section since CC had joined the band the previous year.[19]\n"
      ]
   },
   "Members": {
      "text": [
         "Former Members\n",
         "Support Members\n",
         "\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "3.1 Singles",
      "3.2 Albums and EPs",
      "3.3 As featured artist",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Oreskaband (オレスカバンド, Oresukabando, stylized as ORESKABAND) is an all-female ska band from Sakai, Japan. As well as performing regularly within Japan, they have toured in North and South America, as well as Europe.[1]\n",
         "The band name, \"ore ska band,\" literally translates as \"we're (a) ska band.\" While \"ore\" is normally considered a masculine pronoun and an informal way to say \"I\" in Japanese,[2] and the suffix \"-tachi\" is added to personal nouns when emphasizing that they are plural, in this context the term \"ore\" means something more along the lines of \"we fellows.\"  The choice of \"ore\" is also one of gender play, as the band would typically appear wearing boys' school uniform in their early videos and concerts.\n"
      ]
   },
   "Title": "Oreskaband - Wikipedia"
}