{
   "Name": "The Organ (band)",
   "rawData": [
      "The Organ was a Canadian post-punk band formed in 2001 in Vancouver, British Columbia. They officially broke up on December 7, 2006, due to illness and personal conflicts in the band.\n",
      "The Organ were conceived in 2001 by frontwoman Katie Sketch, born Katie Ritchie, in Vancouver, BC. Sketch's musical training started at the age of three, when she began classical training on the violin. Her childhood was spent largely in ignorance of the underground sounds of The Smiths, The Cure, and Joy Division, whom The Organ would later often be favorably compared to. \"Tiffany and Bon Jovi – that was my take on ’80s music.\"\n",
      "Sketch has said of the time of the formation of the band, when she and the band members were in their early to mid-twenties. \"I was in a musical lull, I couldn’t stand what I was listening to,\" naming Sleater-Kinney as one example. “The local scene was also pretty shitty, and of course the radio was brutal. Then, by total fluke, my mom’s friend’s husband, Ron Obvious, hired me to help with the audio wiring for a studio he was building for Bryan Adams.” Obvious introduced Katie to the world of independent music, and what she calls \"that ’80s sound.\" He created mix-tapes of bands he thought she’d appreciate as a violinist (Roxy Music, Ultravox) and singers with an \"amazing natural vocal pitch\" (Siouxsie and the Banshees, Nina Hagen, Kate Bush)). This job also led Sketch to Tara Nelson, the engineer who would later record the Organ’s first EP.\n"
   ],
   "infobox": {
      "Origin": [
         "Vancouver, British Columbia Canada"
      ],
      "Genres": [
         "Post-punk, jangle pop, new wave"
      ],
      "Years active": [
         "2001–2006"
      ],
      "Labels": [
         "Mint Records, 604 Records, Too Pure, Talitres, Popfrenzy"
      ],
      "Website": [
         "www.theorgan.ca (at Archive.org)"
      ],
      "Members": [
         "Katie Sketch (vocals)",
         "Jenny Smyth (Organ)",
         "Debora Cohen (Guitar)",
         "Shmoo Ritchie (Bass guitar)",
         "Shelby Stocks (drums)"
      ],
      "Past members": [
         "Ashley Webber (Bass guitar) 2001–2005"
      ]
   }
}