{
   "Name": "The Pandoras",
   "Sections": [
      "1 Formation",
      "2 Early career and controversy",
      "3 Rhino era",
      "4 Elektra era",
      "5 Restless era",
      "6 Disbandment and Pierce's death",
      "7 Reunions",
      "8 Members",
      "8.1 Timeline",
      "9 Discography",
      "9.1 Albums and mini-albums",
      "9.2 Singles and EPs",
      "9.3 Compilation appearances",
      "9.4 Reissues",
      "9.5 Videos/DVD",
      "9.6 Unreleased album",
      "9.7 Bootlegs",
      "10 References"
   ],
   "Summary": {
      "text": [
         "The Pandoras is an all-female garage punk band from Los Angeles, California with a run 1982 to 1991. The band is among the first handful of all-female rock bands to ever be signed. From the beginning, the band found a strong following in the Hollywood garage rock and Paisley Underground scene. The Pandoras enjoyed strong radio support from DJ Rodney Bingenheimer. The band graduated from the garage rock sound to a more contemporary, hard rock style in later years, spawning the off-shoot band The Muffs. The Pandoras founder/singer/songwriter, Paula Pierce, died on August 10, 1991, of a brain aneurysm at the age of 31.[1] The Muffs front-woman/founder Kim Shattuck who played bass in the Pandoras from 1985 to 1990 passed in October 2nd, 2019 from ALS. Shattuck had appeared as lead singer/lead guitarist of the reunited Pandoras in recent years, until her passing.\n"
      ]
   },
   "Formation": {
      "text": [
         "The Pandoras began in late 1982 as part of the 1960s garage rock revival. They were associated with the Paisley Underground era in Hollywood's underground rock scene that shared an aesthetic heavily influenced by 1960s garage rock and psychedelia. Pierce, a resident of Chino, California until 1984, had been a member of the Hollywood music scene; playing in bands since 1976.\n",
         "The Pandoras were formed when singer/guitarist Pierce, a member of the mod/garage/pop Action Now, met singer/guitarist/bass player Deborah Mendoza (aka Menday), at Chaffey College in Rancho Cucamonga  in 1982. Mendoza, an art \\major, answered an ad that Pierce, a graphic arts major, had posted on the bulletin board in the cafeteria. The ad read, \"Wanted, another female musician to jam with! Influenced by sixties garage punk.\" They began bringing their guitars to school and jamming between classes.\n",
         "Pierce, singer/songwriter/lead guitarist, brought in Gwynne Kahn on keyboards/guitar/backing vocals. Mendoza on bass, brought in drummer Casey Gomez. After a band meeting in December 1982, The Pandoras were born, though names such as The Keyholes, Hole, The wHolesome, and The Goodwylls were considered first.\n"
      ]
   },
   "Early career and controversy": {
      "text": [
         "After recording their first EP in 1983, I'm Here I'm Gone on Moxie Records, Mendoza left the group. She was replaced on bass by Bambi Conway. Conway, Kahn, Gomez, and Pierce appeared on The Pandoras' debut album, It's About Time, on Greg Shaw's Bomp! Records.[2]\n",
         "In 1984, The Pandoras split into two factions just as the It's About Time LP was being released. Founder/Singer/Songwriter Paula Pierce had focus on the direction she wanted to go with her band. Bassist Conway, unhappy with Pierce, quit The Pandoras; followed by Pierce firing keyboardist Kahn. Shortly thereafter, drummer Gomez split from Pierce. Pierce decided to continue as The Pandoras, immediately recruiting three new members who embarked on tour for the It's About Time LP release. Former members Gomez and Conway joined Kahn in the short-lived Gwynne's Pandoras.\n",
         "The brief dispute over the Pandoras name was discussed on a KROQ-FM radio show hosted by Rodney Bingenheimer and in the local music zines such as BAM, Music Connection, and the LA Weekly (and its \"L.A. Dee Da\" gossip column).\n",
         "Pierce's fresh, new line-up of The Pandoras included Melanie Vammen on keyboards, Julie Patchouli on bass, and Karen Blankfeld on drums. Momentum began picking up with the release of the Hot Generation single on Bomp! Records in late 1984. The Pierce-led band toured the east coast with the Fuzztones to promote the single.\n",
         "The Gwynne's Pandoras released \"Worm Boy\" on an Enigma Records compilation, Enigma Variations, in 1985. When readying for an EP on Enigma Records, the label insisted that the Gwynne's Pandoras change their name. This ended the gossip-column controversies, and the Pierce-led Pandoras prevailed. Gwynne's EP, to be titled Psycho Circus, was never released, and a new band name never settled upon.\n",
         "Bassist Patchouli quit The Pandoras in the spring of 1985. Gayle Morency joined The Pandoras and played bass for two shows before retiring from music to raise a family. Morency was replaced by bassist Kim Shattuck in July 1985.\n"
      ]
   },
   "Rhino era": {
      "text": [
         "The Pandoras were signed to Rhino Records and began recording the basic tracks for the Stop Pretending album during the winter of 1985 with producer Bill Inglot, who had produced earlier Pandoras and Action Now releases. In 1986, Stop Pretending was released.[3]\n",
         "The Pandoras was labeled \"one of the bands that matter\" by the LA Weekly. The band continued to play live and record new songs for their major label debut and were a top live club draw outside of Los Angeles, touring with Nina Hagen, and performing on bills with such acts as Iggy Pop, The Fuzztones, The Beat Farmers, Johnny Thunders, The Alarm, Madness, The Blasters, and The Cramps. The music video for \"Stop Pretending\" appeared on air, in the United States, Canada and Europe. The Pandoras played the inaugural LA Weekly Music Awards and showcased a slightly harder sound and were interviewed on the roof of the Variety Arts Center for French TV by Laurent Basset who would in later years go on to marry drummer Karen Blankfeld and direct the hit series Below Deck on Bravo.\n"
      ]
   },
   "Elektra era": {
      "text": [
         "Elektra A&R man Steve Pross signed the band to Elektra Records. The band made numerous attempts to record the album, to be titled Come Inside. During this period, Blankfeld was forced from the band due to disagreements about band management, and was replaced with Kelly Dillard on drums. Blankfeld went on to play bass with former Enigma recording artists Wednesday Week, before forming the Billboard-charting all-female band The Rebel Pebbles.\n",
         "Dillard was in The Pandoras for only two months; during that time she appeared in photoshoots intended for the Elektra cover of Come Inside and recorded \"Run Down Love Battery\" for the album as well. She was replaced on drums in November of 1987 by Sheri Kaplan.\n",
         "Before the release of the LP, which had reached the test-pressing stage, Pross was let go by Elektra Records. As a result, the label dropped both bands he had signed — Jetboy and The Pandoras — with their respective records being withdrawn from release. Many of the demo recordings The Pandoras made during the Elektra-era eventually surfaced on the Psychedelic Sluts bootleg CD.\n"
      ]
   },
   "Restless era": {
      "text": [
         "The band continued to play live while looking for a new record deal. Rita D'Albert joined as a guitarist in 1988. The Pandoras recorded new songs and released the Rock Hard mini-LP on Restless Records. A video for \"Run Down Love Battery\" received airplay on MTV's Headbangers Ball, expanding their audience to include metal fans.\n",
         "D'Albert left The Pandoras in February 1989, just before a tour in support of Rock Hard, to join Human Drama, which had signed to RCA records. She would go on to found Lucha VaVoom in subsequent years. The Pandoras concert at Z Rock in Dallas, Texas was recorded for a \"Coast to Coast Concert Series\" broadcast. They also made an appearance on the first episode of The Arsenio Hall Show where they performed \"Run Down Love Battery.\"\n",
         "Billie Jo Hash joined the band on guitar for the second leg of the Rock Hard tour. She lasted through the summer of 1989. Lissa Beltri joined The Pandoras in late 1989.\n",
         "Restless Records release the Z-Rock concert as a live mini-album. Live Nymphomania. Pierce and bandmates were not happy with the release, though the band went out on tour promoting it for Restless.\n"
      ]
   },
   "Disbandment and Pierce's death": {
      "text": [
         "In July 1990, keyboardist Vammen was removed from The Pandoras by Pierce, over Shattuck's and Kaplan's objections. Pierce's reason for Vammen's departure was that the new direction of the band did not require keyboards.[4]\n",
         "Both an Australian tour and a European tour in 1990 were cancelled; prompting Shattuck to leave the band two months later. There was a single show with Chris from the Hollywood band Taz on bass, and then Kaplan quit the band to join Hardly Dangerous, ending The Pandoras. In the wake of their departure, Vammen and Shattuck, had been plotting a band of their own. They went on to form The Muffs, enjoying great success in the alternative music scene. \n",
         "In 1991, Pierce slowly worked on new material with guitarist Beltri. A new drummer joined Pierce and Beltri, as they began auditioning bass players. On August 9, a bass player auditioned who both Pierce and Beltri liked. She was to be brought back in for a rehearsal on August 11. However, on August 10, after dinner and an exercise session, Pierce suffered a fatal aneurysm in the shower. Pierce had complained of painful headaches for two weeks before her death, but did not seek medical care.\n",
         "Former Pandoras' roadie Dave Eddy, former band members, and friends organized a tribute and fundraising show at the Coconut Teaser. The show saw performances by Cherie Currie of The Runaways and her twin sister Marie Currie in their first public performance together in 20 years, with the final line up of the Pandoras backing them, as well as Precious Metal, who had broken up but who reunited for the show, Redd Kross and Abby Travis, Dramarama with Clem Burke of Blondie and Sylvain Sylvain from the New York Dolls, The Muffs (Shattuck's and Vammen's band), African Violet (D'Albert band), Hardly Dangerous (Kaplan's band) and White Flag.\n"
      ]
   },
   "Reunions": {
      "text": [
         "In October of 2013, Pillbox front-woman Susan Hyatt, guitarist Lisa Black, Melanie Vammen, Karen Blankfeld-Basset, and Sheri Kaplan united to play three Pierce-penned Pandoras songs (\"You Don't Satisfy\", \"In and Out of my Life In A Day\" and \"You're All Talk\") at a private party in Redondo Beach, CA in October 2013.\n",
         "In July of 2014, the reformed Pandoras, including Shattuck, Vammen, Basset, and Kaplan recorded four songs at the Green Day studio JingleTown Recording in Oakland, California. One year later, at the same studio, three more songs were recorded with new drummer Hillary Burton.\n",
         "On June 26, 2015, Shattuck, Vammen, Basset, and Kaplan performed their first official live show as the reunited Pandoras at The Casbah in San Diego, California.\n",
         "On July 4, 2015, there was a reunion show billed as The Pandoras at the 2015 Burger Boogaloo (hosted by Burger Records and filmmaker John Waters at Mosswood Park, in Oakland, CA, which featured Shattuck (lead vocals, guitar), Vammen (keyboard), Basset (bass), and Kaplan (drums).\n",
         "In July of 2015, The reunited Pandoras, featuring Shattuck, Vammen, Basset, and newly acquired drummer Hillary Burton performed in Minneapolis, Minnesota at The Turf Club. \n",
         "In August of 2015 The Pandoras, featuring Shattuck, Vammen, Basset, and Burton embarked on a comprehensive European tour, with two U.S. East Coast dates included.\n",
         "In March of 2018 The Pandoras, including Shattuck, Vammen, Basset, and Burton released a seven song EP titled \"Hey It's the Pandoras.\" \n",
         "The surviving members of Pierce's Pandoras, Vammen, Basset, Burton, and Kaplan plan to perform at a tribute concert for Kim Shattuck after the Pandemic is past, at the El Rey Theater in Los Angeles. \n",
         "Thank you to our fans for your continued support.\n"
      ]
   },
   "Members": {
      "Timeline": {}
   },
   "Discography": {
      "Albums and mini-albums": {},
      "Singles and EPs": {},
      "Compilation appearances": {},
      "Reissues": {},
      "Videos/DVD": {},
      "Unreleased album": {},
      "Bootlegs": {}
   },
   "References": {},
   "coreData": [
      "The Pandoras is an all-female garage punk band from Los Angeles, California with a run 1982 to 1991. The band is among the first handful of all-female rock bands to ever be signed. From the beginning, the band found a strong following in the Hollywood garage rock and Paisley Underground scene. The Pandoras enjoyed strong radio support from DJ Rodney Bingenheimer. The band graduated from the garage rock sound to a more contemporary, hard rock style in later years, spawning the off-shoot band The Muffs. The Pandoras founder/singer/songwriter, Paula Pierce, died on August 10, 1991, of a brain aneurysm at the age of 31.[1] The Muffs front-woman/founder Kim Shattuck who played bass in the Pandoras from 1985 to 1990 passed in October 2nd, 2019 from ALS. Shattuck had appeared as lead singer/lead guitarist of the reunited Pandoras in recent years, until her passing.\n",
      "The Pandoras began in late 1982 as part of the 1960s garage rock revival. They were associated with the Paisley Underground era in Hollywood's underground rock scene that shared an aesthetic heavily influenced by 1960s garage rock and psychedelia. Pierce, a resident of Chino, California until 1984, had been a member of the Hollywood music scene; playing in bands since 1976.\n",
      "The Pandoras were formed when singer/guitarist Pierce, a member of the mod/garage/pop Action Now, met singer/guitarist/bass player Deborah Mendoza (aka Menday), at Chaffey College in Rancho Cucamonga  in 1982. Mendoza, an art \\major, answered an ad that Pierce, a graphic arts major, had posted on the bulletin board in the cafeteria. The ad read, \"Wanted, another female musician to jam with! Influenced by sixties garage punk.\" They began bringing their guitars to school and jamming between classes.\n",
      "Pierce, singer/songwriter/lead guitarist, brought in Gwynne Kahn on keyboards/guitar/backing vocals. Mendoza on bass, brought in drummer Casey Gomez. After a band meeting in December 1982, The Pandoras were born, though names such as The Keyholes, Hole, The wHolesome, and The Goodwylls were considered first.\n"
   ]
}