{
   "Name": "Phantom Blue",
   "rawData": [
      "Phantom Blue was an all-female American heavy metal band from Los Angeles, California, United States, formed in 1987. Phantom Blue were the first and only female artists to be signed to Mike Varney's Shrapnel Records, only three months after forming.\n",
      "Phantom Blue was formed in 1988 in Hollywood, California by Michelle Meldrum and Nicole Couch. Couch and Meldrum were students of Paul Gilbert and Bruce Bouillet of Racer X. Michelle Meldrum had played with drummer Linda McDonald in previous projects and together with vocalist Gigi Hangach and original bassist, Debra Armstrong. Armstrong left the band in June 1988, prior to the band signing with Shrapnel Records, in October 1988, and was replaced by Kim Nielsen, a student of John Alderete, bassist for Racer X and The Mars Volta. Phantom Blue recorded their self-titled first album with the help of producer Steve Fontano and fellow Shrapnel label mate, Marty Friedman. Couch and Meldrum also co-wrote a track on the album with Marty Freidman. Roadrunner Records, who owned the bands European distribution rights, were responsible for the band shooting a video for the single \"Why Call It Love?\" and a successful European tour followed.\n",
      "Upon returning to the States, Phantom Blue caught the attention of singer Don Dokken who introduced them to Tom Zutaut of Geffen Records. Other major labels were interested in signing the band, most notably Disney's Hollywood Records, but the band signed with Geffen. Couch and Meldrum began writing the material for the Geffen release. Couch left the band prior to recording and Meldrum successfully recorded all the guitar parts for Built to Perform. Guitarist Karen Kreutzer replaced Couch and the band embarked on another successful European tour and shot a video for the single \"Time to Run\".\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Heavy metal, hard rock"
      ],
      "Years active": [
         "1987–2001, 2006"
      ],
      "Labels": [
         "Shrapnel, Geffen, Roadrunner, Marlin, DRZ"
      ],
      "Associated acts": [
         "The Iron Maidens, Meldrum, The Little Dolls"
      ],
      "Website": [
         "www.phantomblue.com"
      ]
   },
   "albums": [
      "Phantom Blue",
      "Built to Perform"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Los Angeles, California, United States, formed in [YEAR]. [BAND_NAME] were the first and only female artists to be signed to Mike Varney's Shrapnel Records, only three months after forming.\n",
      "[BAND_NAME] was formed in [YEAR] in Hollywood, California by [PERSON_NAME_FULL_0_FEMALE] and Nicole Couch. Couch and [PERSON_NAME_LAST_0] were students of [PERSON_NAME_FULL_3_MALE] and Bruce Bouillet of Racer X. [PERSON_NAME_FULL_0_FEMALE] had played with drummer [PERSON_NAME_FULL_5_FEMALE] in previous projects and together with vocalist [PERSON_NAME_FULL_1_MALE] and original bassist, Debra Armstrong. Armstrong left the band in [MONTH] [YEAR], prior to the band signing with Shrapnel Records, in [MONTH] [YEAR], and was replaced by [PERSON_NAME_FULL_4_FEMALE], a student of John Alderete, bassist for Racer X and The [MONTH]s Volta. [BAND_NAME] recorded their self-titled first album with the help of producer [PERSON_NAME_FULL_2_MALE] and fellow Shrapnel label mate, [MONTH]ty Friedman. Couch and [PERSON_NAME_LAST_0] also co-wrote a track on the album with [MONTH]ty Freidman. Roadrunner Records, who owned the bands European distribution rights, were responsible for the band shooting a video for the single [SONG_NAME] and a successful European tour followed.\n",
      "Upon returning to the States, [BAND_NAME] caught the attention of singer Don Dokken who introduced them to [PERSON_NAME_FULL_0_MALE] of Geffen Records. Other major labels were interested in signing the band, most notably Disney's Hollywood Records, but the band signed with Geffen. Couch and Meldrum began writing the material for the Geffen release. Couch left the band prior to recording and Meldrum successfully recorded all the guitar parts for Built to Perform. Guitarist Karen Kreutzer replaced Couch and the band embarked on another successful European tour and shot a video for the single [SONG_NAME].\n"
   ]
}