{
   "Name": "The Pierces",
   "Sections": [
      "1 Early life",
      "2 Musical career",
      "2.1 2000–2006: The Pierces and Light of the Moon",
      "2.2 2007–2010: Thirteen Tales of Love and Revenge",
      "2.3 2010–2012: You & I",
      "2.4 2012–2014: James Levy and the Blood Red Rose and Creation",
      "2.5 2015–present",
      "3 Members",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Extended plays",
      "4.3 Singles",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Pierces are a Los Angeles-based band consisting of sisters Allison and Catherine Pierce.\n"
      ]
   },
   "Early life": {
      "text": [
         "Allison Margaret Pierce (born July 22, 1975) and Catherine Eleanor Pierce (born September 12, 1977) were born in Birmingham, Alabama.[1] They traveled frequently and received home-schooling from their self-described hippie parents. Their father played the guitar in various bands, while their mother was a painter.[2] Exposed to music and arts at an early age, the Pierce sisters grew up listening to The Beatles, Joni Mitchell and Simon & Garfunkel.[3] As children, they were encouraged to explore their creative side[4] and would perform at parties, weddings and churches. Allison started dancing at age three, and both sisters are accomplished ballet dancers.[citation needed]\n"
      ]
   },
   "Musical career": {
      "2000–2006: The Pierces and Light of the Moon": {
         "text": [
            "It was while they attended Auburn University that a friend sent a tape to a record company in Nashville. This eventually resulted in their debut album The Pierces (2000). It featured folk harmonies and \"adult alternative\" songs. In a 2004 interview, Allison Pierce commented that the album \"sort of got lost in the shuffle\".[5] Allmusic attributes the poor reception to \"no label support\".[6]\n",
            "On August 10, 2004, their second album Light of the Moon was released through Universal. The album was produced by Brian Sperber and featured 11 tracks that the Pierce sisters either wrote or co-wrote.[7] The original version of the song \"Save Me\" appeared in the television series Roswell[8] and The Pierces re-recorded a new version of the song for Light of the Moon.\n"
         ]
      },
      "2007–2010: Thirteen Tales of Love and Revenge": {
         "text": [
            "On March 20, 2007, their third album Thirteen Tales of Love and Revenge was released in the U.S. Produced by Roger Greenawalt (Nils Lofgren, Radish, Ben Kweller), the album has been well-reviewed, particularly for the single \"Boring\", which parodies celebrity socialites. The album has a darker, edgier style, at times using such diverse instruments as an accordion, a calliope, bassoons, a sitar, violins, an autoharp, and a Hawaiian lap steel. It marks a definitive change in the direction of the band, which hitherto had been known as a folk rock band.[9] In an interview with Rolling Stone, after they were featured as a Rolling Stone Breaking Artist, they revealed that this album \"felt like [their] last chance\". As a result, they \"just went for it, had fun\".[10]\n",
            "On December 5, 2007, The Pierces appeared on The CW television series Gossip Girl, in the episode \"Hi, Society\", playing their songs \"Secret\" and \"Three Wishes\". They also featured songs such as \"Boy In a Rock and Roll Band\" in season 2 and \"We Are Stars\" in season 4.\n",
            "On August 21, 2008, \"Secret\" by The Pierces appeared in a promo for Showtime show Dexter.[11] In May 2009, Dutch TV channel NET 5 used \"Secret\" in a promo for their fantasy shows Charmed and Ghost Whisperer. \"Secret\" was also played over the closing credits in the movie ExTerminators.\n",
            "\"Secret\" also serves as the theme song of the Freeform TV series Pretty Little Liars, based on the series of books by Sara Shepard. It was suggested by one of the stars of the show, Ashley Benson, after she heard from Gossip Girl. In 2012, the single \"Secret\" was also featured in a commercial for the Australian version of the reality series Big Brother. It was used in a video to promote the novel \"Three Can Keep a Secret\" by Archer Mayor.\n"
         ]
      },
      "2010–2012: You & I": {
         "text": [
            "On October 23, 2010, the group appeared on Later... with Jools Holland. In December 2010, the sisters and their band toured with Lissie as her support act. They also performed live on ITV1 show Lorraine in March 2011 whilst promoting their new single \"Glorious\".\n",
            "On May 30, 2011, their fourth album You & I was released featuring their new singles \"Love You More\", \"You'll Be Mine\", \"Glorious\" and \"It Will Not Be Forgotten\" produced by darktones and released by Polydor Records. However, The Pierces only have a label currently in the UK and are therefore focusing on widening their popularity there, later working on their homeland the US.\n",
            "They went on their first official tour through June 2011, with Delta Maid and Alice Gold as support: 7 June-The Pleasance (Edinburgh), 8 June-Rescue Rooms (Nottingham), 9 June-The Cockpit (Leeds), 11 June-The Ruby Lounge (Manchester), 12 June-HMV Institute (Birmingham), 13 June-Thekla (Bristol), 14 June-Bush Hall (London).\n",
            "The Pierces played at the Glastonbury Festival in June 2011.\n",
            "The Pierces supported Coldplay at the iTunes Festival in July 2011, which happened to be on Alison's 36th birthday. A second, much larger UK tour took place through October 2011, with Marcus Foster as support. On 11 September 2011, the duo announced via Twitter that their next UK single from You & I will be \"Kissing You Goodbye\", which was released on 23 October. The Pierces supported Coldplay once again for their North American tour in April–May 2012. They appeared at the Edmonton, Calgary, Vancouver, Portland, Seattle, San Jose and Los Angeles shows, as well as supporting them in their Australian tour\n"
         ]
      },
      "2012–2014: James Levy and the Blood Red Rose and Creation": {
         "text": [
            "In 2012, Allison released a record with singer songwriter James Levy under the band name James Levy and The Blood Red Rose. [12] Their album, Pray To Be Free, was released by Heavenly Recordings (2012) and received critical acclaim, including being included in the list of the top 100 albums of 2012 by French publication Les Inrocks. [13][14] The album, produced by Coldplay bass player Guy Berryman, received four star reviews in MOJO, Q and Uncut magazines and was praised by the BBC, The Independent and The Sunday Times of London. [15][16][17][18] US music magazine Popdose and UK publication indieLondon included the record on their top ten lists for 2012. [19][20]\n",
            "A single, Sneak into My Room, spent several weeks in rotation and on the playlist of BBC Radio 6 Music and was featured as Q Magazine's \"Track of the Day.\" [21] A music video for \"Hung To Dry,\" directed by Steve Birnbaum, was named one of the top 50 indie music videos of 2012. [22][23]\n",
            "Catherine Pierce revealed on August 27, 2013 via Twitter to a fan that a new album would be released in early 2014.[citation needed] Their song \"We Are Stars\" was featured on The CW's Beauty & the Beast in the episode \"Any Means Possible\".\n",
            "On January 31, 2014, the band confirmed via Twitter that the album would be called Creation[24] and shared a video for its first single, \"Kings\". \"Believe in Me\" was released as the second single in late March. On 12 April 2014, the song peaked at #66 in the UK Top 100.[25] On 22 May 2014, the official video for Kings was premiered on Vevo. The album was released on 1 September 2014.[26]\n"
         ]
      },
      "2015–present": {
         "text": [
            "In August 2015, the band announced on The Pierces Facebook page that they will be taking a break to pursue solo projects.[27]\n",
            "In January 2017, Catherine released the solo single \"You Belong to Me\", under the name Cat Pierce. The track is the first single off of her debut solo album, which was expected later in 2017.[28] Two follow-up singles have been released since then; \"Hard to Be a Woman\" and \"Weapon of War\"[29] and indeed, several other singles (thirteen in all), between 2017 and 2019. In May 2017, Allison Pierce released her debut solo album Year of the Rabbit.[30]\nIn 2020, they have re-recorded the song \"Secret\", considered their most famous one, and planned a full acoustic concert for 8/21/20.\n"
         ]
      }
   },
   "Members": {},
   "Discography": {
      "Studio albums": {},
      "Extended plays": {},
      "Singles": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Pierces are a Los Angeles-based band consisting of sisters Allison and Catherine Pierce.\n",
      "Allison Margaret Pierce (born July 22, 1975) and Catherine Eleanor Pierce (born September 12, 1977) were born in Birmingham, Alabama.[1] They traveled frequently and received home-schooling from their self-described hippie parents. Their father played the guitar in various bands, while their mother was a painter.[2] Exposed to music and arts at an early age, the Pierce sisters grew up listening to The Beatles, Joni Mitchell and Simon & Garfunkel.[3] As children, they were encouraged to explore their creative side[4] and would perform at parties, weddings and churches. Allison started dancing at age three, and both sisters are accomplished ballet dancers.[citation needed]\n",
      "It was while they attended Auburn University that a friend sent a tape to a record company in Nashville. This eventually resulted in their debut album The Pierces (2000). It featured folk harmonies and \"adult alternative\" songs. In a 2004 interview, Allison Pierce commented that the album \"sort of got lost in the shuffle\".[5] Allmusic attributes the poor reception to \"no label support\".[6]\n",
      "On August 10, 2004, their second album Light of the Moon was released through Universal. The album was produced by Brian Sperber and featured 11 tracks that the Pierce sisters either wrote or co-wrote.[7] The original version of the song \"Save Me\" appeared in the television series Roswell[8] and The Pierces re-recorded a new version of the song for Light of the Moon.\n"
   ]
}