{
   "Name": "The Pierces",
   "rawData": [
      "The Pierces are a Los Angeles-based band consisting of sisters Allison and Catherine Pierce.\n",
      "Allison Margaret Pierce (born July 22, 1975) and Catherine Eleanor Pierce (born September 12, 1977) were born in Birmingham, Alabama. They traveled frequently and received home-schooling from their self-described hippie parents. Their father played the guitar in various bands, while their mother was a painter. Exposed to music and arts at an early age, the Pierce sisters grew up listening to The Beatles, Joni Mitchell and Simon & Garfunkel. As children, they were encouraged to explore their creative side and would perform at parties, weddings and churches. Allison started dancing at age three, and both sisters are accomplished ballet dancers.\n",
      "It was while they attended Auburn University that a friend sent a tape to a record company in Nashville. This eventually resulted in their debut album The Pierces (2000). It featured folk harmonies and \"adult alternative\" songs. In a 2004 interview, Allison Pierce commented that the album \"sort of got lost in the shuffle\". Allmusic attributes the poor reception to \"no label support\".\n"
   ],
   "infobox": {
      "Born": [
         "Allison Margaret Pierce ",
         "  (1975-07-22) July 22, 1975 (age 45) ",
         " Catherine Eleanor Pierce ",
         " (1977-09-12) September 12, 1977 (age 43)"
      ],
      "Origin": [
         "Birmingham, Alabama, United States"
      ],
      "Genres": [
         "Psychedelic rock, psychedelic pop, psychedelic folk, folk rock, folk pop, alternative rock, pop rock, indie pop"
      ],
      "Years active": [
         "2000–present"
      ],
      "Labels": [
         "Polydor"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Allison Pierce",
         "Catherine Pierce"
      ]
   },
   "albums": [
      "The Pierces",
      "Light of the Moon",
      "Thirteen Tales of Love and Revenge",
      "You & I",
      "Creation"
   ],
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band consisting of sisters Allison and Catherine Pierce.\n",
      "Allison [MONTH]garet Pierce (born [MONTH] 22, [YEAR]) and Catherine Eleanor Pierce (born [MONTH] 12, [YEAR]) were born in Birmingham, Alabama. They traveled frequently and received home-schooling from their self-described hippie parents. Their father played the guitar in various bands, while their mother was a [GENRE] an early age, the Pierce sisters grew up listening to The Beatles, [PERSON_NAME_FULL_0_FEMALE] and Simon & Garfunkel. As children, they were encouraged to explore their creative side and would perform at parties, weddings and churches. Allison started dancing at age three, and both sisters are accomplished ballet dancers.\n",
      "It was while they attended Auburn University that a [GENRE] a tape to a record company in Nashville. This eventually resulted in their debut album [BAND_NAME] ([YEAR]). It featured folk harmonies and [SONG_NAME].\n"
   ]
}