{
   "Name": "Plastiscines",
   "Sections": [
      "1 History",
      "2 \"Les bébés rockers\"",
      "3 Band members",
      "4 Releases",
      "5 In popular culture",
      "6 Discography",
      "6.1 Albums",
      "6.2 EPs",
      "7 Notes",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "The Plastiscines are a French all-female rock band who perform their songs in both French and English. They have released three albums, spanning from garage rock revival and pop punk to disco-orientered pop music.\n"
      ]
   },
   "History": {
      "text": [
         "The Plastiscines are Katty Besnard (singer/guitar), Louise Basilien (bass), and Ana Vandevyvere (drums). Former members include Marine Neuilly (guitar), and Caroline and Zazie Tavitian (both drums). They formed in 2007 after Besnard, Neuilly, and Tavitian, all of whom were at school together in Saint-Cyr-l'École, met Basilien, originally a harpist, at a concert by the English band, The Libertines.[1] Their talent was recognised early on by Maxime Schmitt, producer of the German band Kraftwerk, and they were signed by EMI for the Virgin France label in October 2006.\nIn addition to the Libertines, the band's influences include the White Stripes, the Strokes[2] and, from an earlier generation, the Kinks and Blondie.[3] Closer to home, the prevailing style of their first album, LP1, was similar to that of the 1960s' singer Christie Laume, Édith Piaf's sister-in-law.[4]\n",
         "The Plastiscines' name derives from the phrase, \"plasticine porters with looking glass ties\" in the Beatles' song, \"Lucy in the Sky with Diamonds\", on the 1967 album Sgt. Pepper's Lonely Hearts Club Band.\n",
         "The Plastiscines have been critical of French retailing of rock music. Louise Basilien has remarked that she learned about rock 'n' roll through her parents, the Internet, and by reading books: \"the generation before us could not learn about rock 'n' roll because the stores here were rubbish\".[2] As a consequence, the French rock scene in 2006–07 was seen by many as fresh and exciting, even though the requirement that forty per cent of songs broadcast on radio in France should be in French continued to militate against bands who wished to perform in English (which, because of its American origins and British dominance in the 1960s, has always been the prime language of rock 'n' roll).\n",
         "In 2009, Marvin Scott Jarrett, Editor-in-chief of NYLON magazine, founded NYLON Records and signed the Plastiscines as its first act, after seeing them on the cover of French fashion and style magazine Citizen K.[5] The Plastiscines were featured on the TV series Gossip Girl episode \"They Shoot Humphreys, Don't They?\" at the Cotillion ball. Their song \"Bitch\" was also featured on the same episode.[6]  The music supervisor on Gossip Girl, Alex Patsavas, noticed the Plastiscines' record, and has written several of the band's songs into the series.[7] \nTheir single, \"Barcelona\" was iTunes single of the week during the first week of January 2010.\n",
         "In February 2010, they embarked on the 'Hot Mess Across The EU-niverse Tour' in support of Cobra Starship, along with Family Force 5.[citation needed]\n",
         "In December 2010, it was announced that they would be producing the music for the comic book based, animated TV show titled Scary Larry.[8]\nMarine Neuilly left the band. They are featured on the song, \"Nearly Witches (Ever Since We Met...)\" by Panic! at the Disco on their new album, Vices & Virtues. They are also featured on the song, \"Fool Like Me\" by Cobra Starship on their upcoming album, Night Shades.[citation needed]\n"
      ]
   },
   "\"Les bébés rockers\"": {
      "text": [
         "In the mid-2000s (decade), the Plastiscines were one of several Parisian teenage bands, referred to collectively as les bébés rockers. Paris Calling, a compilation album of music by several of them, was released in France in June 2006 (and in Britain in 2007). It contained the Plastiscines' first studio tracks, \"Shake (Twist Around the Fire)\" and \"Rake\". Those present at its launch included the French Minister of Culture, Renaud Donnedieu de Vabres, and Babyshambles singer Pete Doherty.[2]\n",
         "Such bands tended to be scorned at the time by some elements of the press for their bobo (bourgeois bohème or bourgeois Bohemian) backgrounds:[2] in other words, they were portrayed as \"the spoilt kids of rich parents playing at being rock stars\".[2]\n"
      ]
   },
   "Band members": {},
   "Releases": {
      "text": [
         "The band's first album, LP1, was issued on 12 February 2007. This was an eclectic mix of twelve notably short tracks (none was over three minutes long and some were under two), including their first single release, \"Loser\", and the two songs that had appeared on Paris Calling.\n",
         "The band's second album, About Love, was released on 21 June 2009 by NYLON Records. A three song EP was made available on 21 April 2009 and contained three songs from the album: \"Barcelona\", \"You're No Good\" and \"I Could Rob You\".\n",
         "In April 2013, the Plastiscines released \"Coming To Get You\", the first preview of their new album Back to the Start set for release in 2014. Two other songs from the album, \"Ooh La La\" and \"Comment Faire\", were released in May 2013. Back to the Start was released in full 28 April 2014.[9] This album was different from their prior releases as the Plastiscines dropped their rock sound and opted for a more electronic and pop sound.[9]\n"
      ]
   },
   "In popular culture": {},
   "Discography": {
      "Albums": {},
      "EPs": {}
   },
   "Notes": {},
   "External links": {},
   "coreData": [
      "The Plastiscines are a French all-female rock band who perform their songs in both French and English. They have released three albums, spanning from garage rock revival and pop punk to disco-orientered pop music.\n",
      "The Plastiscines are Katty Besnard (singer/guitar), Louise Basilien (bass), and Ana Vandevyvere (drums). Former members include Marine Neuilly (guitar), and Caroline and Zazie Tavitian (both drums). They formed in 2007 after Besnard, Neuilly, and Tavitian, all of whom were at school together in Saint-Cyr-l'École, met Basilien, originally a harpist, at a concert by the English band, The Libertines.[1] Their talent was recognised early on by Maxime Schmitt, producer of the German band Kraftwerk, and they were signed by EMI for the Virgin France label in October 2006.\nIn addition to the Libertines, the band's influences include the White Stripes, the Strokes[2] and, from an earlier generation, the Kinks and Blondie.[3] Closer to home, the prevailing style of their first album, LP1, was similar to that of the 1960s' singer Christie Laume, Édith Piaf's sister-in-law.[4]\n",
      "The Plastiscines' name derives from the phrase, \"plasticine porters with looking glass ties\" in the Beatles' song, \"Lucy in the Sky with Diamonds\", on the 1967 album Sgt. Pepper's Lonely Hearts Club Band.\n",
      "The Plastiscines have been critical of French retailing of rock music. Louise Basilien has remarked that she learned about rock 'n' roll through her parents, the Internet, and by reading books: \"the generation before us could not learn about rock 'n' roll because the stores here were rubbish\".[2] As a consequence, the French rock scene in 2006–07 was seen by many as fresh and exciting, even though the requirement that forty per cent of songs broadcast on radio in France should be in French continued to militate against bands who wished to perform in English (which, because of its American origins and British dominance in the 1960s, has always been the prime language of rock 'n' roll).\n"
   ],
   "infobox": {
      "Origin": [
         "Saint-Cyr-l'École, France"
      ],
      "Genres": [
         "Garage rock revival",
         "indie pop",
         "indie rock"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Virgin France"
      ],
      "Associated acts": [
         "Cobra Starship",
         "Panic! At The Disco"
      ],
      "Website": [
         "lesplastiscines.com"
      ],
      "Members": [
         "Katty Besnard",
         "Louise Basilien",
         "Anoushka \"Ana\" Vandevyvere"
      ],
      "Past members": [
         "Marine Neuilly",
         "Zazie Tavitian",
         "Caroline"
      ]
   }
}