{
   "Name": "Plastiscines",
   "rawData": [
      "The Plastiscines are a French all-female rock band who perform their songs in both French and English. They have released three albums, spanning from garage rock revival and pop punk to disco-orientered pop music.\n",
      "The Plastiscines are Katty Besnard (singer/guitar), Louise Basilien (bass), and Ana Vandevyvere (drums). Former members include Marine Neuilly (guitar), and Caroline and Zazie Tavitian (both drums). They formed in 2007 after Besnard, Neuilly, and Tavitian, all of whom were at school together in Saint-Cyr-l'École, met Basilien, originally a harpist, at a concert by the English band, The Libertines. Their talent was recognised early on by Maxime Schmitt, producer of the German band Kraftwerk, and they were signed by EMI for the Virgin France label in October 2006.\nIn addition to the Libertines, the band's influences include the White Stripes, the Strokes and, from an earlier generation, the Kinks and Blondie. Closer to home, the prevailing style of their first album, LP1, was similar to that of the 1960s' singer Christie Laume, Édith Piaf's sister-in-law.\n",
      "The Plastiscines' name derives from the phrase, \"plasticine porters with looking glass ties\" in the Beatles' song, \"Lucy in the Sky with Diamonds\", on the 1967 album Sgt. Pepper's Lonely Hearts Club Band.\n"
   ],
   "infobox": {
      "Origin": [
         "Saint-Cyr-l'École, France"
      ],
      "Genres": [
         "Garage rock revival",
         "indie pop",
         "indie rock"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Virgin France"
      ],
      "Associated acts": [
         "Cobra Starship",
         "Panic! At The Disco"
      ],
      "Website": [
         "lesplastiscines.com"
      ],
      "Members": [
         "Katty Besnard",
         "Louise Basilien",
         "Anoushka \"Ana\" Vandevyvere"
      ],
      "Past members": [
         "Marine Neuilly",
         "Zazie Tavitian",
         "Caroline"
      ]
   }
}