{
   "Name": "Plumtree (band)",
   "rawData": [
      "Plumtree was a Canadian indie rock/power pop band formed in 1993 in Halifax which consisted of sisters Carla and Lynette Gillis, Amanda Braden, Nina Martin, and later Catriona Sturton. The band achieved moderate success during their seven years of activity, completing several tours of Canada and parts of the U.S., as well as releasing three full-length albums, a six track EP, and various singles, before finally disbanding in June 2000. The band is notable for their top single, \"Scott Pilgrim\", having been the inspiration for the title character in Bryan Lee O'Malley's graphic novel series of the same name.\n",
      "The band formed in their hometown of Halifax, Nova Scotia in 1993 after meeting through their music teachers. The original line-up included Lynette Gillis (aged 14) on drums, Carla Gillis (16) on guitar and vocals, Amanda Braden (15) on guitar and vocals and Nina Martin (16) on bass and occasional vocals.\n",
      "As children the Gillis siblings developed an interest in heavy metal music. Carla took guitar lessons and Lynette studied drumming. They played at home until 1993 when they recruited others to form a band. Their first band played their junior high school talent show with a setlist made up mostly of Jimi Hendrix and Iron Maiden covers. The original group subsequently broke up. Braden and Martin joined the band soon after and the band developed a collaborative songwriting method. Plumtree played their first show at Halifax's all-ages Cafe Ole in June 1993.\n"
   ],
   "infobox": {
      "Origin": [
         "Halifax, Nova Scotia, Canada"
      ],
      "Genres": [
         "Indie rock, Indie pop, Power pop"
      ],
      "Years active": [
         "1993 (1993)–2000 (2000)"
      ],
      "Labels": [
         "Cinnamon Toast",
         "Endearing"
      ],
      "Past members": [
         "Final line-up:",
         "Lynette Gillis",
         "Carla Gillis",
         "Amanda Braden",
         "Catriona Sturton",
         "Former members:",
         "Nina Martin"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band formed in [YEAR] in Halifax which consisted of sisters Carla and [PERSON_NAME_FULL_0_FEMALE], [PERSON_NAME_FULL_1_FEMALE], Nina [MONTH]tin, and later Catriona Sturton. The band achieved moderate success during their seven years of activity, completing several tours of Canada and parts of the U.S., as well as releasing three full-length albums, a six track EP, and various singles, before finally disbanding in [MONTH] [YEAR]. The band is notable for their top single, \"Scott Pilgrim\", having been the inspiration for the title character in [PERSON_NAME_FULL_2_MALE] O'Malley's graphic novel series of the same name.\n",
      "The band formed in their hometown of Halifax, [MONTH]a Scotia in [YEAR] after meeting through their music teachers. The original line-up included [PERSON_NAME_FIRST_1] [PERSON_NAME_LAST_0] (aged 14) on drums, [PERSON_NAME_FULL_0_FEMALE] (16) on guitar and vocals, [PERSON_NAME_FULL_2_FEMALE] (15) on guitar and vocals and Nina [MONTH]tin (16) on bass and occasional vocals.\n",
      "As children the Gillis siblings developed an interest in heavy metal music. Carla took guitar lessons and Lynette studied drumming. They played at home until [YEAR] when they recruited others to form a band. Their first band played their junior high school talent show with a setlist made up mostly of Jimi Hendrix and Iron Maiden covers. The original group subsequently broke up. Braden and [MONTH]tin joined the band soon after and the band developed a collaborative songwriting method. [BAND_NAME] played their first show at Halifax's all-ages Cafe Ole in [MONTH] [YEAR].\n"
   ]
}