{
   "Name": "Plumtree (band)",
   "Sections": [
      "1 History",
      "1.1 Split",
      "1.2 Aftermath",
      "2 Awards",
      "3 Discography",
      "3.1 Studio albums & EPs",
      "3.2 7\"",
      "3.3 Compilation Albums",
      "4 References",
      "5 External"
   ],
   "Summary": {
      "text": [
         "Plumtree was a Canadian indie rock/power pop band formed in 1993 in Halifax which consisted of sisters Carla and Lynette Gillis, Amanda Braden, Nina Martin, and later Catriona Sturton. The band achieved moderate success during their seven years of activity, completing several tours of Canada and parts of the U.S., as well as releasing three full-length albums, a six track EP, and various singles, before finally disbanding in June 2000.[1][2] The band is notable for their top single, \"Scott Pilgrim\", having been the inspiration for the title character in Bryan Lee O'Malley's graphic novel series of the same name.[3]\n"
      ]
   },
   "History": {
      "Split": {
         "text": [
            "In spring 2000, the band toured across Canada and down the West Coast States with Vancouver's Salteens. Plumtree disbanded in July 2000 after performing their final show on July 31 at the Marquee Club in their hometown of Halifax.\n"
         ]
      },
      "Aftermath": {
         "text": [
            "Lynette and Carla Gillis currently[when?] live in Toronto, where they perform in the rock band Overnight (formerly known as SISTER). They also perform in Bells Clanging with Jason Starnes. Amanda Bidnall (née Braden) earned degrees at Dalhousie University and York University before graduating with a PhD from Boston College in 2010. She is now a history professor at Simon Fraser University in Vancouver, British Columbia, as well as a novice romance writer and web editor.[6][7][8] Catriona Sturton lives in Ottawa and teaches harmonica. Nina Martin is a professor of geography at UNC - Chapel Hill. In July 2010 Catriona joined SISTER on stage at the launch party for Scott Pilgrim Volume 6 to perform the song \"Scott Pilgrim\".\n",
            "Scott Pilgrim vs. The World, based on the graphic novel series by Bryan Lee O'Malley that was inspired by the Plumtree song \"Scott Pilgrim\", was released on August 13, 2010. In the film and comic book, the main character Scott Pilgrim can be seen wearing a Plumtree T-shirt.[9] The song \"Scott Pilgrim\" appears both in the film as well as on the soundtrack to the film and the song \"Go!\" appears in the film itself while not the soundtrack.\n"
         ]
      },
      "text": [
         "The band formed in their hometown of Halifax, Nova Scotia in 1993 after meeting through their music teachers. The original line-up included Lynette Gillis (aged 14) on drums, Carla Gillis (16) on guitar and vocals, Amanda Braden (15) on guitar and vocals and Nina Martin (16) on bass and occasional vocals.\n",
         "As children the Gillis siblings developed an interest in heavy metal music. Carla took guitar lessons and Lynette studied drumming. They played at home until 1993 when they recruited others to form a band. Their first band played their junior high school talent show with a setlist made up mostly of Jimi Hendrix and Iron Maiden covers.[4] The original group subsequently broke up. Braden and Martin joined the band soon after and the band developed a collaborative songwriting method. Plumtree played their first show at Halifax's all-ages Cafe Ole in June 1993.\n",
         "Plumtree established themselves in Canada after releasing the song, \"Follow You\", on the No Class cassette, a compilation released by No Records featuring Nova Scotia high school bands. This earned them opening slots for Jale, Thrush Hermit, Velocity Girl and the Spinanes. Cinnamon Toast Records released Plumtree's first seven-inch, Green Mittens, in 1994. It featured the songs \"Dog Gone Crazy\" and \"Have a Banana\", plus two songs from Prince Edward Island's Strawberry on the other side. Shortly after, Plumtree released a six-song cassette entitled Flutterboard.\n",
         "In 1995, Plumtree recorded their first full-length album, Mass Teen Fainting, at Sound of One Hand Studios in Ottawa, with Paul Hogan. The CD was played on college radio and this gained Plumtree a dedicated Canadian fanbase. Martin left the band in September 1995 to pursue undergraduate work at McGill University. She was replaced by Ottawa native Catriona Sturton in 1996.\n",
         "Plumtree's second album, Predicts the Future, was recorded in 1997 with Laurence Currie at Idea of East studios in Halifax. Released in 1998, the CD led to the Plumtree's appearance on the cover of Canada's music monthly, Exclaim!, as well as to the No. 1 spot on the national college radio chart, Earshot. Videos for the singles \"Scott Pilgrim\", \"Go\", and \"You Just Don't Exist\" received regular airplay on MuchMusic. (\"Scott Pilgrim\" went on to inspire the popular graphic novel series, Scott Pilgrim, by Bryan Lee O'Malley).\n",
         "During these early years, Plumtree released a number of songs on vinyl and CD compilations, including Water Had Leaked into My Suit (Cinnamon Toast), You're a Superlady (Corduroy), Secret Songs (Korova Cafe) and Syrup and Gasoline (Grenadine). An earlier version of \"Scott Pilgrim\" can also be found on a split seven-inch Plumtree released with The Inbreds on the PF label.\n",
         "The band toured extensively throughout its seven-year career, hitting the road with Montreal's The Local Rabbits, Halifax bands Thrush Hermit, The Inbreds and The Super Friendz, Moncton's Julie Doiron (formerly of Eric's Trip) and Winnipeg's The Weakerthans and Duotang. Plumtree could only tour during the summer months as they attended university during the school months.\n",
         "In 1999, Plumtree performed in Toronto at the Horseshoe Tavern with Number One Cup.[5] They spent the summer in Toronto recording This Day Won't Last at All with Justin Deneau at Electromagnetic Studios. It was released in 2000 by Winnipeg-based Endearing Records. A Cindy Sherman-inspired video for the song, \"Regret\", received airplay on MuchMusic.\n"
      ]
   },
   "Awards": {
      "text": [
         "In 1996, Plumtree was awarded Best Canadian Band Under Twenty at the YTV Achievement Awards. They performed \"Tropical\" during the show.\n",
         "Predicts the Future was nominated for an East Coast Music Award in the Alternative rock category. It lost to Superfriendz' Slide Show.\n"
      ]
   },
   "Discography": {
      "Studio albums & EPs": {},
      "7\"": {},
      "Compilation Albums": {}
   },
   "References": {},
   "External": {},
   "coreData": [
      "Plumtree was a Canadian indie rock/power pop band formed in 1993 in Halifax which consisted of sisters Carla and Lynette Gillis, Amanda Braden, Nina Martin, and later Catriona Sturton. The band achieved moderate success during their seven years of activity, completing several tours of Canada and parts of the U.S., as well as releasing three full-length albums, a six track EP, and various singles, before finally disbanding in June 2000.[1][2] The band is notable for their top single, \"Scott Pilgrim\", having been the inspiration for the title character in Bryan Lee O'Malley's graphic novel series of the same name.[3]\n",
      "The band formed in their hometown of Halifax, Nova Scotia in 1993 after meeting through their music teachers. The original line-up included Lynette Gillis (aged 14) on drums, Carla Gillis (16) on guitar and vocals, Amanda Braden (15) on guitar and vocals and Nina Martin (16) on bass and occasional vocals.\n",
      "As children the Gillis siblings developed an interest in heavy metal music. Carla took guitar lessons and Lynette studied drumming. They played at home until 1993 when they recruited others to form a band. Their first band played their junior high school talent show with a setlist made up mostly of Jimi Hendrix and Iron Maiden covers.[4] The original group subsequently broke up. Braden and Martin joined the band soon after and the band developed a collaborative songwriting method. Plumtree played their first show at Halifax's all-ages Cafe Ole in June 1993.\n",
      "Plumtree established themselves in Canada after releasing the song, \"Follow You\", on the No Class cassette, a compilation released by No Records featuring Nova Scotia high school bands. This earned them opening slots for Jale, Thrush Hermit, Velocity Girl and the Spinanes. Cinnamon Toast Records released Plumtree's first seven-inch, Green Mittens, in 1994. It featured the songs \"Dog Gone Crazy\" and \"Have a Banana\", plus two songs from Prince Edward Island's Strawberry on the other side. Shortly after, Plumtree released a six-song cassette entitled Flutterboard.\n"
   ]
}