{
   "Name": "Flamin' Groovies",
   "rawData": [
      "Flamin' Groovies is an American rock band that formed in San Francisco in 1965, originally co-led by Roy Loney and Cyril Jordan. After the Groovies released three albums, on Epic (Supersnazz) and Kama Sutra (Flamingo and Teenage Head), Loney left the band in 1971. He was replaced as co-leader by Chris Wilson, and the band's emphasis shifted more toward British Invasion power pop.\n",
      "The band signed to United Artists Records in 1972, releasing just three more singles until 1976. The Groovies then signed to Sire Records and released three albums between 1976 and 1979, Shake Some Action, Flamin' Groovies Now (both produced by Dave Edmunds at Rockfield Studios in Wales) and Jumpin' in the Night. The 1976 album's title track \"Shake Some Action\" (also released as a single) became a power pop anthem and is revered by many, including Greil Marcus in his book, The History of Rock and Roll in Ten Songs. Wilson left the band in 1981, and the band continued in various forms, including the release of three more albums, before breaking up in 1991. After a couple of limited reunions with different lineups, the 1970s nucleus of Jordan, Wilson, and Alexander reformed the group in 2013, and the band's first post-reunion album, Fantastic Plastic, was released in 2017. Alexander left the reformed band in 2017, and in 2019 Wilson went on hiatus.\n",
      "In addition to the band's role in the advancement of power pop, the Flamin' Groovies have also been called one of the forerunners of punk rock.\n"
   ],
   "infobox": {
      "Also known as": [
         "The Flamin' Groovies"
      ],
      "Origin": [
         "San Francisco, California, U.S."
      ],
      "Genres": [
         "Rock and roll[1][2]",
         "power pop[1]",
         "garage rock[3]"
      ],
      "Years active": [
         "1965–1991, 2004, 2009, 2013–present"
      ],
      "Labels": [
         "Epic, Kama Sutra, UA, Sire, AIM Records, Severn"
      ],
      "Associated acts": [
         "The Barracudas"
      ],
      "Website": [
         "http://www.cyriljordan.com/ (Cyril Jordan site)"
      ],
      "Members": [
         "Cyril Jordan",
         "Chris Von Sneidern",
         "Tony Sales",
         "Atom Ellis",
         "Chris Wilson (on hiatus 2019)"
      ],
      "Past members": [
         "Roy Loney (deceased)",
         "George Alexander",
         "Tim Lynch",
         "Danny Mihm (deceased)",
         "James Ferrell",
         "Terry Rae",
         "David Wright",
         "Mike Wilhelm (deceased)",
         "Mark Dunwoody (deceased)",
         "Bobby Ronco (deceased)",
         "Jack Johnson",
         "Paul Zahl",
         "Victor Penalosa"
      ]
   }
}