{
   "Book references": {
      "text": [
         "The Flamin' Groovies, along with the band Frumious Bandersnatch, are mentioned in Roger Hall's 1970 novel, \"19,\" which refers to them both as one band, \"Frumious Bandersnatch and the Flamin' Groovies.\" (First edition, page 110).\n"
      ]
   },
   "Career": {
      "Beginnings": {
         "text": [
            "Roy Loney[9][10][11][12][13][14] and Tim Lynch,[15][16][17][18] who met in first grade, had put together a Kingston Trio-type folk band with guitars when they were in junior high and high school.[19] Beginning in 1965, after adding their friend George Alexander (whom they told to learn bass), they became a Rolling Stones-influenced rock band with drummer Ron Greco.[19] Greco knew a 15-year-old lead guitarist named Cyril Jordan,[20] who quickly became a part of the group, although Greco then left and was replaced by Danny Mihm.[19][21] After playing together for about three years under various group names and not getting any record company offers, they decided to put up their own money and make their own EP, which they could also use as a label demo.[19] That EP, 1968's Sneakers, was recorded on 4-track and mixed in about eight hours total[19][21] and featured Jordan (guitar, vocals), Loney (vocals, guitar), Alexander (bass, harmonica, vocals), Lynch (guitar, harmonica, vocals) and Mihm (drums).[6] As a result of its success, they were signed to a contract by Epic Records; at about the same time, their manager leased The Fillmore from Bill Graham, and they became managers of the venue, which introduced them to a much wider variety of music, including The Stooges and Alice Cooper.[19][22]\n",
            "During this period, they released 1969's Supersnazz.[6] In Loney's words, the album was \"all over the map\" and \"kinda grasping at every possible straw\";[19] it contained both re-creations of 1950s rock and roll and more melodic songs that anticipated the power pop movement of the 1970s—a genre to which the Flamin' Groovies would eventually contribute significant work. However, the album's low sales led to their release by Epic.[6] They then started doing national tours, and their further exposure to Detroit's musical scene \"hardened up our sound a whole lot\", in Loney's words.[19] At the instigation of Richard Robinson (a journalist and the Groovies' future producer), the Groovies then signed to Kama Sutra Records for their next two albums, 1970's Flamingo and 1971's Teenage Head.[6] Flamingo had the disadvantage of being recorded on 12-track, which used the same 1\" tape as 8-track recording did, so the dynamic width had to be compressed; as Jordan later put it, \"12-track sounds like shit.\"[21][23] Teenage Head, which was recorded on 16-track,[21] is listed in the 2006 book 1001 Albums You Must Hear Before You Die, and Mick Jagger reportedly compared the album favorably to the Rolling Stones' contemporaneous Sticky Fingers.[24] Despite the critical plaudits, though, neither album sold well, which caused Loney and Lynch to lose interest and left the Groovies in limbo about their future.[19][21] Loney (a rockabilly and blues aficionado) and Jordan (who leaned more to Beatle-style pop) also clashed over the band's direction,[25] leading to a meme that \"Roy is the Stones guy, Cyril is the Beatles guy\".[26] Jordan, however, felt the band was just evolving.[21] Tim Lynch then left the band and was replaced by James Ferrell,[19] shortly before the Groovies played a concert for the closing of the Fillmore West that was broadcast live on local San Francisco radio station KSAN.[27][28]\n"
         ]
      },
      "Breakup": {
         "text": [
            "The commercial failure of Jumpin' in the Night, as well as clashes between Jordan and Stein, led Sire to drop the Flamin' Groovies in 1980,[50] although the band nevertheless added keyboardist Mark Dunwoody.[51] Then, a failed recording session at Gold Star Studios in 1981 for a new album tentatively called Tour de Force[52] (in which only five complete songs were recorded in a three-week period, but four of them were covers)[50] and the widening personal differences between Jordan and Wilson led both David Wright and Chris Wilson to quit the Groovies, with Wilson's departure taking place on Halloween night 1981.[6][25][33] Wilson called the Gold Star sessions \"a complete debacle\" and referred to the time as being \"like a messy family divorce\";[25] all of the Groovies blamed the collapse of the Gold Star sessions on excessive drug use.[50] As Jordan admitted, \"We got tired. We were beaten up and cast aside, and the feeling was that this thing’s over, and you couldn’t stop that feeling with anybody in the band because it looked like it was.\"[29] Despite that, Jordan and Alexander added new members, including the return of drummer Danny Mihm, and resumed touring.[29]\n",
            "However, after Wilhelm, Mihm and Dunwoody all left in 1982,[51][53] the Flamin' Groovies once again had to reform. Later in the 1980s, the Groovies, now including Jordan, Alexander, guitarist-vocalist Jack Johnson, and drummer Paul Zahl, became involved with an Australian promoter named Peter Noble (the owner of AIM Records), who began to issue various Groovies live and studio recordings and reissue prior albums.[54][55] After a 1987 live-in-the-studio recording in Australia for AIM entitled One Night Stand,[6] and Sire/Warner's release of a 1989 greatest hits album focused on the Jordan-Wilson recordings entitled Groovies' Greatest Grooves, Noble put the Groovies on a financially mismanaged 80-day, 80-city tour of Europe, which shattered the group.[21] The Groovies finally disbanded in 1991, with their last releases being the AIM compilation of demos entitled Step Up in 1991 and the post-breakup album Rock Juice (which used several of the same backing tracks as Step Up, according to Alexander) in 1993.[21][29][56]\n"
         ]
      },
      "Isolation and success": {
         "text": [
            "Not long after the KSAN concert, Loney also left the band and was replaced by 18-year-old singer and guitarist Chris Wilson, who, along with Jordan, began to move the group in a more overtly power pop direction.[6][7] Alexander had become friends with British music executive Andrew Lauder,[19] and in 1972, the band reached a deal to sign with Lauder's United Artists Records (\"UA\") and to record with British producer Dave Edmunds at Rockfield Studios in Wales,[29][30] even though the U.S. division of UA had already turned down the band.[25][31][32] The Groovies moved to Britain, where they remained for the rest of 1972,[23] but the UA deal was never expanded beyond two single releases, \"Slow Death\"/\"Tallahassee Lassie\" and \"Married Woman\"/\"Get a Shot of Rhythm and Blues\", which United Artists preferred to Edmunds and the band's choices \"Shake Some Action\" and \"You Tore Me Down\".[33] However, \"Slow Death\", an anti-drug song that Jordan had written with Loney, was banned by the BBC for using the word \"morphine\", which killed the momentum behind the signing.[23] All seven songs recorded in 1972 by the Groovies for UA (the six named above plus Chuck Berry's \"Little Queenie\") were released in 1995 by EMI on the A Bucket of Brains album.[34]\n",
            "The failure of these singles effectively left the band in limbo for two years.[6] During this lull, drummer Danny Mihm also left the band, replaced first by Terry Rae and ultimately by David Wright.[23] In 1973, the Groovies re-recorded \"Shake Some Action\" as part of a deal with Capitol Records, but executive turnover at Capitol blocked that deal before the contracts were signed.[23][35] In an effort to gain some leverage, the band agreed to release the Edmunds-produced version of \"You Tore Me Down\" as the first single on the brand-new Bomp! Records label in 1974.[35][36] Some of the various released and unreleased recordings made and produced by the Groovies during this period (six demos from 1971, \"Tallahassee Lassie\" from 1972, one TV recording from 1972, and the two Capitol demos from 1973) were later collected on the 2002 Norton album Slow Death.[23][37]\n",
            "Finally in 1975, Greg Shaw from Bomp! became the Flamin' Groovies' manager and arranged for them to sign to the new (but poorly distributed) label Sire Records, headed by Seymour Stein.[38] Due to that, the Groovies returned to the UK and recorded and released (in 1976) Shake Some Action, again produced by Edmunds, which included the same recordings of two songs (\"Shake Some Action\" and \"You Tore Me Down\") that United Artists had passed on in 1972 but Stein loved.[21][23] The album received rave critical reviews, similar to Teenage Head.[25][39] The Groovies continued to tour continually and were supported by the Ramones and The Stranglers at the Roundhouse in London on July 4, 1976 (which was coincidentally the US's bicentennial) in the latter band's first ever appearance in the UK. This concert has been widely noted as a seminal moment in the development of punk rock.[40][41][42][43][44][45][46][47]\n",
            "Sire's distribution was taken over by Warner Bros. Records in 1977, and so the Groovies returned to a major label; however, shortly before that, James Ferrell, who had been unhappy with the band's \"Beatle-esque\" direction,[48] was fired and replaced by Mike Wilhelm, who had previously played with Wilson in the San Francisco band \"Loose Gravel\".[34] The band then recorded two albums for Sire/Warners, 1978's Flamin' Groovies Now, once more produced by Dave Edmunds, and 1979's Jumpin' in the Night, produced by Jordan and Roger Bechirian.[6] Wilson felt that Now was his favorite album and the band with Edmunds was in \"one of our most creative times\".[25] However, Sire gave the album little promotion, and it didn't sell appreciably better.[25] Edmunds also intended to produce Jumpin' in the Night, but, according to Wilson, his new manager Jake Riviera blocked him from doing so.[25] Both albums included several covers of older material from other artists, which became an issue between Jordan, who wanted to include the covers (because he was trying to renegotiate his publishing rights with Sire), and Wilson, who did not.[29][33] According to Jordan, during this period Warners also released a punk rock songbook that featured the Sex Pistols. the Ramones, and the Groovies.[49]\n"
         ]
      },
      "Post-breakup and partial reunions": {
         "text": [
            "In 1979, Roy Loney formed the Phantom Movers featuring two other former Groovies, drummer Danny Mihm and guitarist James Ferrell, as well as Larry Lea (guitar) and Maurice Tani (bass). The band released several albums between 1979 and 1993[57][58] as well as a greatest hits CD (A Hundred Miles an Hour 1978-1989 on the Raven label out of Australia).[59] Loney and Lea continued to work together after the band folded.[58]\n",
            "In 1995, \"Shake Some Action\" appeared in the movie Clueless, which regenerated interest in the group.[60] Loney, Mihm and Ferrell, who were then playing together in a band called the Fondellas, tried to put a Groovies reunion together to capitalize on that interest, which had been further fueled by re-releases of Flamingo and Teenage Head, but Jordan wasn't interested at that time.[58]\n",
            "The Flamin' Groovies headlined the Azkena Rock Festival in Mendizabala, Spain, on September 11, 2004, although Jordan was the only member of the pre-1981 band who participated.[61]\n",
            "In 2005, Jordan founded a new band, Magic Christian, which released a self-titled double album in 2005 and the album Evolver in 2009.[62]\n",
            "In 2009, Loney and Jordan reunited and embarked on a brief tour, backed by members of the A-Bones and Yo La Tengo,[38] including the Ponderosa Stomp in April.[63] The tour focused on the Groovies' pre-1972 catalog, omitting the later songs; Jordan noted that, despite the band's continuing popularity, \"when I did that tour with Roy, . . . the halls didn’t exactly fill up.\"[38] During an English date on this tour, Jordan reconnected with Wilson, who was then living in England (and who had joined The Barracudas and the Fortunate Sons there in the 1980s after leaving the Groovies).[29][64]\n",
            "One result of the Loney/Jordan tour were more reunions on the 2010 Chris Wilson album Love Over Money. George Alexander, Roy Loney, James Ferrell and Mike Wilhelm all appear on the CD, as does Procol Harum's keyboard legend Matthew Fisher and Barracudas guitarist Robin Wills. The album was released on the French label Rock Paradise. Wilson then followed this up with the 2013 album It's Flamin' Groovy, which featured the same musicians as previously plus three songs with both Alexander and Cyril Jordan.[33]\n",
            "1980s Groovies keyboardist Mark Dunwoody, who also played with the Phantom Movers, died of a heart attack on June 12, 2013.[65] Guitarist Mike Wilhelm (1976-1982) died from cancer on May 14, 2019.[66] Drummer Danny Mihm died on March 26, 2020, following a stroke.[67]\n"
         ]
      },
      "Reunion": {
         "text": [
            "Beginning in late 2012, following the \"reunions\" on Wilson's solo albums, Jordan and Wilson considered reforming and relaunching the band. Said Jordan, \"the Flamin' Groovies Shake Some Action version makes way more money and did make way more money in the '70s than the Roy Loney version ever did. So it was a no-brainer to put that second version back together again and see if we could make some good money.\"[21] That second Groovies line-up of Jordan, Wilson, and Alexander (with the addition of Victor Penalosa on drums) played live for the first time since their 1981 split in Australia (Brisbane, Sydney, Melbourne, and Perth) as part of the Hoodoo Gurus' invitational Dig It Up in April 2013.[21][33][68] Jordan noted that the band received $75,000 for six or seven shows on the tour, which was enough money to overcome the band's post-breakup geographic spread.[21] The Groovies then played a series of sold-out shows in Japan.[33] Their next show, in San Francisco at The Elbo Room on May 4, sold out in less than 24 hours, and Loney even attended.[26]\n",
            "As a result, Jordan, Wilson, and Alexander decided to reform the Flamin' Groovies and to record a new album.[33][69] Their first release was a limited-edition single (on vinyl) in 2016 to commemorate the band's 50th anniversary entitled \"Crazy Macy\" b/w \"Let Me Rock\",[70] followed by the album Fantastic Plastic, which was released in September 2017.[69] The reformed band also did an East Coast, European, and Midwest tour behind the new album, with Jordan and Wilson accompanied by Chris Von Sneidern on bass and Tony Sales (son of bassist Tony Fox Sales) on drums.[69][71] In 2019, the Groovies, consisting of Jordan, Von Sneidern (now on guitar), Sales, and Atom Ellis (on bass), with special guest Roy Loney (vocals) but without Wilson (who was on hiatus in 2019), embarked on the \"Teenage Head Tour\" in the US and Europe.[72] However, Loney was hospitalized after a fall at the airport in June, just as the tour was headed to Europe, which forced the European leg of the tour to continue without him.[73] Loney died on December 13, 2019.[74]\n"
         ]
      }
   },
   "Discography": {
      "Albums": {
         "Compilation": {},
         "Demos": {},
         "Live": {},
         "Studio": {}
      },
      "EPs": {},
      "Singles": {}
   },
   "External links": {},
   "Notes": {},
   "Personnel": {
      "text": [
         "Timeline\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Career",
      "1.1 Beginnings",
      "1.2 Isolation and success",
      "1.3 Breakup",
      "1.4 Post-breakup and partial reunions",
      "1.5 Reunion",
      "2 Personnel",
      "3 Discography",
      "3.1 Albums",
      "3.1.1 Studio",
      "3.1.2 Live",
      "3.1.3 Demos",
      "3.1.4 Compilation",
      "3.2 EPs",
      "3.3 Singles",
      "4 Notes",
      "5 Book references",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Flamin' Groovies is an American rock band that formed in San Francisco in 1965, originally co-led by Roy Loney and Cyril Jordan.[4][5] After the Groovies released three albums, on Epic (Supersnazz) and Kama Sutra (Flamingo and Teenage Head), Loney left the band in 1971. He was replaced as co-leader by Chris Wilson, and the band's emphasis shifted more toward British Invasion power pop.[6][7]\n",
         "The band signed to United Artists Records in 1972, releasing just three more singles until 1976. The Groovies then signed to Sire Records and released three albums between 1976 and 1979, Shake Some Action, Flamin' Groovies Now (both produced by Dave Edmunds at Rockfield Studios in Wales) and Jumpin' in the Night. The 1976 album's title track \"Shake Some Action\" (also released as a single) became a power pop anthem and is revered by many, including Greil Marcus in his book, The History of Rock and Roll in Ten Songs. Wilson left the band in 1981, and the band continued in various forms, including the release of three more albums, before breaking up in 1991. After a couple of limited reunions with different lineups, the 1970s nucleus of Jordan, Wilson, and Alexander reformed the group in 2013, and the band's first post-reunion album, Fantastic Plastic, was released in 2017. Alexander left the reformed band in 2017, and in 2019 Wilson went on hiatus.\n",
         "In addition to the band's role in the advancement of power pop, the Flamin' Groovies have also been called one of the forerunners of punk rock.[8]\n"
      ]
   },
   "Title": "Flamin' Groovies - Wikipedia"
}