{
   "Name": "Princess Princess (band)",
   "Sections": [
      "1 Career",
      "1.1 Post-disbandment",
      "2 Songwriting collaborations",
      "3 Former members",
      "4 Discography",
      "5 Filmography",
      "5.1 TV",
      "5.1.1 Kōhaku Uta Gassen appearances",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Princess Princess (プリンセス・プリンセス, Purinsesu Purinsesu, commonly referred to as Puri-Puri) was a five-piece Japanese rock/pop girl band active from 1983 to 1996. They previously released music under the names \"Julian Mama\" (ジュリアン・ママ, Jurian Mama) and \"Akasaka Komachi\" (赤坂小町).\n"
      ]
   },
   "Career": {
      "Post-disbandment": {
         "text": [
            "Shortly after the group's final concert, Kaori Okui married actor Goro Kishitani. Okui, who had released the solo album Renaissance in 1994, released four other albums: Shout in 1997 and Kaori in 1998 under her maiden name; Ring to the Heavens in 2006 and The Best And More in 2014 as Kaori Kishitani. She still performs live as a solo artist.\n",
            "Kanako Nakayama released two albums Howling and Nakayama no Ippatsu in the 1990s. In 1999, Nakayama helped formed the hard rock group VooDoo Hawaiians. With VooDoo Hawaiians, she has released five albums: Pretty And Brutal in 2000, Rock 'n Roll Animal in 2001, Drive, She Said in 2002, 4our in 2006 and Love And Roll 2014. She has also performed with the group Tokyo Rocks and on a number of tribute albums in the late 1990s into the 2000s.\n",
            "Tomoko Konno had also released a solo CD before the group's breakup 24 Hours. After the group dissolved, she released two more  solo albums, Torch and Prime of Life. She also wrote the musical score for the movies Chloe (2000) and Kikyo (2004).\n",
            "Atsuko Watanabe joined the faculty of Tokyo School of Music in 1997 as a special instructor and two years later became the Vice Dean of the school; a post she still holds. In December 2014, Watanabe and Nakayama joined \"Grace\" and \"Ban-Chan\" as a group called \"Go 50 Go\", with the group name derived from the members' shared age of 50 years old.\n",
            "Kyōko Tomita is on the faculty of Tokyo School of Music. She also hosts the radio program \"Shonan Beat Land\" (\"湘南ビートランド\") Saturday nights at 1700 (JST) on Radio Shonan, FM 83.1 in Tokyo.\n"
         ]
      },
      "text": [
         "After being assembled via open audition of 1400 hopefuls as the female music group Akasaka Komachi by TDK Records in 1983, the band was housed with their manager in the Tokyo suburb of Nishi-Nippori for over two years to develop their musical skills and experience.[1] In March 1984, the band made the first of several appearances on Japanese television. In 1985 the band transferred from TDK Records to another management company, changed their name to Julian Mama, but did not release any singles or albums.\n",
         "In May 1986, the band made their recording debut with the EP Kiss de Crime, released by CBS Sony. In August 1986, the band transferred their management to Shinko Music Entertainment. In May of that year the CEO of Shinko had declined to represent the band, but the company employee Emiko Ichimura, who had seen the girls' live show and believed in their success, eventually persuaded the company to take them on. The band made seven concert appearances in 1986, playing in very small venues around Tokyo.\n",
         "In 1987, the band released their first single as Princess Princess, \"Koi wa Balance\" (\"Love Is Balance\"). The single's lyrics were credited to the band's guitarist, Kanako Nakayama, but the music was credited to well-known music producer Saburo Suzuki. At this time the band decided that they would produce their own sound, so all new compositions from then on was credited to band members, with Nakayama and drummer Kyōko Tomita generally splitting the lyric duties while lead singer Kaori Okui took over two thirds of the music credits over the band's career. The band still struggled for fan notice, playing approximately 60 small venues, and releasing their second single, \"Sekai de Ichiban Atsui Natsu\" (\"The Hottest Summer in the World\") to little market response.\n",
         "In 1988, the band made their major leap for recognition, releasing their first full-length album Here We Are in February and touring during the summer in support of it. The album, which include the songs \"19 Growing Up\", \"My Will\", \"Go Away Boy\" and \"Romancin' Blue\", demonstrated significant artistic development and was met with increasing commercial success. The single \"Go Away Boy\" reached the Japanese Oricon Top 20 Singles Chart. In November, the band released their third album Let's Get Crazy which furthered their commercial momentum with another batch of rock anthems and popular concert standards. From November 1987 through February 1989, Princess Princess made 100 concert appearances, progressing from small clubs to regional public halls. In April 1988 the band accomplished the first goal they had as a group: playing the Shibuya Public Hall. Tickets sold out within two hours, causing their manager Ichimura to cry in her office; the band reportedly initially thought Ichimura was reacting to bad news until being informed of their sell-out. This period of increasing success culminated in their January 1989 shows at the Nippon Budokan, where Princess Princess became the first all-female group to play that important Tokyo venue.\n",
         "1989 brought the band to the peak of their popular success. In April, their seventh single \"Diamonds\" was released, which reached No. 1 on the Oricon chart; the single also became the first CD single to become a \"million seller\" in Japan. In July, \"Sekai de Ichiban Atsui Natsu\" was re-released, and it also went to No. 1, earning Princess Princess the two top spots of the yearly sales rankings. The group made their first nationwide concert tour that summer, and finished out the year by releasing their fourth album, Lovers, which did not feature any single, but reached the No. 1 sales position in the albums chart.\n",
         "In 1990, the band consolidated their media presence with another nationwide tour, playing 56 venues, including major sports arenas. Their ninth single \"Oh Yeah!\" was released exactly a year after \"Diamonds\" and also reached No. 1. The band again finished the year releasing another album, the self-titled Princess Princess, and the single \"Julian\", also a No. 1 single.\n",
         "The following year saw Princess Princess continue their string of No. 1 singles with their 11th single, \"Kiss\", released in May, which would prove to be the band's last chart-topping song. Their next single \"Seven Years After\" peaked only at No. 3; the band's single sales into the 1990s never approached the heights of their 1989 period. In December 1991 the band released their 6th album, Dolls in Action.\n",
         "1992 saw the band reduce their musical output, only releasing one new single, \"Pilot-ni Naritakute\" (\"Wanting to Become a Pilot\") and their first compilation album Singles 1987-1992. They ended the year with the 'double-A single' \"Power\"/\"Regret\" from their 7th studio album Bee-Beep.\n",
         "Bee-Beep was released in January 1993 and was to be the band's last No. 1 album. In May, keyboardist Tomoko Konno experienced a temporary but total hearing loss in one ear, causing the band to field a replacement player since they were on their customary summer tour at the time. Konno's hearing returned in June but there was concern that she would have to be replaced, or perhaps even the band would retire.\n",
         "In this last period of their career, Princess Princess experienced declining popularity and record sales, with an evident difficulty in maintaining their previous musical output and success. The four singles from May 1993 up to their decision to retire in early 1995 are noticeably easy-listening and more mature-themed than their previous pop rock efforts. Released in late 1993, their 8th album Majestic featured less energetic \"break up\" love songs. In 1994, Konno released a solo album, and Okui also began her solo music activity, and the band filled the year with another compilation album, Presents, which featured fan-voted singles not on their previous compilation.\n",
         "In April 1995, the band informed their label management that they were retiring, a decision taken at the end of the previous year while preparing their next album. According to their statements, there was friction between band members about moving in new musical directions and preserving in the usual artistic path, keeping the image that the band had established over the previous decade of work. Okui, the main musical force behind the band, also said that songwriting was becoming much more difficult for her: \"In the past it felt that the songs would just come from heaven, without having to think about it, but as time went on it began to become more of a struggle\". Additionally, band members also said that they wanted to end their activity as friends. In August 1995, the band announced their impending breakup, along with their 20th single, \"Fly Baby Fly\" (which was the band's lowest-selling single since before their \"break\", only selling 32,000 copies). Their final album, titled The Last Princess, served as a \"goodbye message\" to their fans. In 1996, the band went on their last nationwide tour, ending with a three-night run at the Budokan in May.\n",
         "After 16 years, Princess Princess reunited in November 2012 for several concerts in order to help with recovery from the 2011 Tōhoku earthquake and tsunami.[2] They performed six concerts; November 3 and 4 at the Sendai Sun Plaza Hall, then November 20, 21, 23 and 24 at Nippon Budokan in Tokyo. In addition, they performed at the Tokyo Dome on December 23 and 24, 2012, as well as the 2012 Kōhaku Uta Gassen on New Year's Eve.\n"
      ]
   },
   "Songwriting collaborations": {
      "text": [
         "On their initial 6-song EP, the band received songwriting credit for one song (\"Tokyo Kanojo\"), while the lyrics for all songs were from other songwriters. For the band's first full album, the band received all the music credits except for the single \"Koi wa Balance\". \n",
         "From the band's first full album to the end of their career, lyric writing was divided among the members. Nakayama is credited with 39 song lyrics, Tomita with 35, Konno with 19, Watanabe with 9, and Okui with 7.\n",
         "Despite writing the fewest song lyrics, Okui was credited with the majority of the group's music, with 69 of the band's 118 song credits (and nearly all of their released singles), while Nakayama has the primary credit for 18 songs, Konno for 14, Watanabe for 8, Tomita for 1.\n",
         "Nakayama has sole songwriting credit for 7 songs, Konno for 6, Okui for 6 (including one instrumental), Watanabe for 4, and Tomita for 1.\n",
         "Lyric/song writing partnerships were rather distributed among the members. The Nakayama/Okui and the Tomita/Okui pairings are both credited with 27 songs each. Konno/Okui is credited with 9 songs, Tomita/Nakayama for 6, and Watanabe/Konno for 3. The Konno/Nakayama, Konno/Watanabe, Okui/Nakayama,  Nakayama/Konno, Tomita/Konno, and Watanabe/Okui pairings all have 2 song credits each, while Watanabe/Nakayama, Tomita/Watanabe, and Okui/Konno each have a single credit. Excluding Tomita, who only wrote the music to her own song, only the Okui/Watanabe pairing does not have a songwriting credit in the band's catalogue.\n",
         "Nakayama also recorded a duet of the Kiss classic “Hard Luck Woman” with Redd Kross singer Jeff McDonald.\n\n"
      ]
   },
   "Former members": {},
   "Discography": {
      "text": [
         "\n",
         "\n",
         "\n"
      ]
   },
   "Filmography": {
      "TV": {
         "Kōhaku Uta Gassen appearances": {}
      }
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Princess Princess (プリンセス・プリンセス, Purinsesu Purinsesu, commonly referred to as Puri-Puri) was a five-piece Japanese rock/pop girl band active from 1983 to 1996. They previously released music under the names \"Julian Mama\" (ジュリアン・ママ, Jurian Mama) and \"Akasaka Komachi\" (赤坂小町).\n",
      "After being assembled via open audition of 1400 hopefuls as the female music group Akasaka Komachi by TDK Records in 1983, the band was housed with their manager in the Tokyo suburb of Nishi-Nippori for over two years to develop their musical skills and experience.[1] In March 1984, the band made the first of several appearances on Japanese television. In 1985 the band transferred from TDK Records to another management company, changed their name to Julian Mama, but did not release any singles or albums.\n",
      "In May 1986, the band made their recording debut with the EP Kiss de Crime, released by CBS Sony. In August 1986, the band transferred their management to Shinko Music Entertainment. In May of that year the CEO of Shinko had declined to represent the band, but the company employee Emiko Ichimura, who had seen the girls' live show and believed in their success, eventually persuaded the company to take them on. The band made seven concert appearances in 1986, playing in very small venues around Tokyo.\n",
      "In 1987, the band released their first single as Princess Princess, \"Koi wa Balance\" (\"Love Is Balance\"). The single's lyrics were credited to the band's guitarist, Kanako Nakayama, but the music was credited to well-known music producer Saburo Suzuki. At this time the band decided that they would produce their own sound, so all new compositions from then on was credited to band members, with Nakayama and drummer Kyōko Tomita generally splitting the lyric duties while lead singer Kaori Okui took over two thirds of the music credits over the band's career. The band still struggled for fan notice, playing approximately 60 small venues, and releasing their second single, \"Sekai de Ichiban Atsui Natsu\" (\"The Hottest Summer in the World\") to little market response.\n"
   ],
   "infobox": {
      "Also known as": [
         "Puri-Puri",
         "Julian Mama",
         "Akasaka Komachi"
      ],
      "Origin": [
         "Tokyo, Japan"
      ],
      "Genres": [
         "J-pop",
         "J-rock"
      ],
      "Years active": [
         "1983–96",
         "(reunion: 2012, 2016)"
      ],
      "Labels": [
         "Sony Records"
      ],
      "Website": [
         "www.princess2.net"
      ],
      "Past members": [
         "Kaori Kishitani",
         "Kanako Nakayama",
         "Atsuko Watanabe",
         " Tomoko Konno",
         "Kyōko Tomita"
      ]
   }
}