{
   "Name": "Scandal (Japanese band)",
   "Sections": [
      "1 History",
      "1.1 Indie career",
      "1.2 Major debut",
      "1.3 \"her\" record label",
      "2 Band members",
      "3 Tie-ins and promotions",
      "3.1 Theme music",
      "3.2 Musical collaborations",
      "3.3 Endorsements and product collaborations",
      "3.4 Feedback apparel",
      "4 Solo activities",
      "5 Fan club",
      "6 Discography",
      "7 Concerts",
      "7.1 Tours",
      "7.2 One-man live performances",
      "7.3 International",
      "8 Works",
      "8.1 Documentaries",
      "8.2 Films",
      "8.3 Television",
      "8.4 Radio",
      "8.5 Internet",
      "8.6 Books",
      "8.7 Magazines",
      "9 References",
      "10 Further reading",
      "11 External links"
   ],
   "Summary": {
      "text": [
         "Scandal (Japanese: スキャンダル, Hepburn: Sukyandaru, stylized as SCANDAL) is an all-female Japanese rock band from Osaka. Formed in August 2006 by four high school girls, they played live street performances until they were noticed and signed to the indie label Kitty Records. Although all four members have provided lead vocals, their primary roles are Haruna on vocals and rhythm guitar, Mami on lead guitar, Tomomi on bass guitar, and Rina on drums. In 2008, they released three singles and a mini-album while simultaneously touring the United States, France, and Hong Kong. That October, Scandal released their major debut single, \"Doll\", on Epic Records Japan.\n",
         "The band has performed the theme songs for several anime series, including \"Shōjo S\" and \"Harukaze\" for Bleach, \"Shunkan Sentimental\" for Fullmetal Alchemist: Brotherhood, \"Pride\" for \"Star Driver\" and \"A.M.D.K.J.\" for \"GeGeGe no Kitarō\". With numerous overseas performances and anime theme songs, Scandal has built a considerable international fanbase.[6][7] The band has been voted by fans across the world into the top ten of the \"Most-Requested Artists\" category of the J-MELO Awards every year since 2010, peaking at first place in 2014.[8]\n",
         "During their \"Best Xmas 2018 Concert\" at Akasaka Blitz, they announced that they would establish their own private record label named \"her\" in 2019.[9]\n"
      ]
   },
   "History": {
      "Indie career": {
         "text": [
            "Scandal was formed in August 2006 by four high school girls. The girls, Haruna, Mami, Tomomi, and Rina, met in an Osaka vocal and dance school called Caless.[10][11] Shortly thereafter, they started performing live performances every weekend at Shiroten in Osaka Castle Park. Soon, they started getting offers from clubs in Osaka and Kyoto. The band's name originates from a sign near Studio Brotherz, a studio where they practiced in their early days. The studio was on the sixth floor of a building shared with other businesses, namely adult shops. The girls decided to choose the biggest sign among the shops, \"Scandal\" (スキャンダル, Sukyandaru), as the name for their band.[12]\n",
            "In 2008, Scandal signed with indie label Kitty Records and released three singles exclusive to Tower Records. The first, \"Space Ranger\", ranked #2 on the Tower indie charts and the other two, \"Koi Moyō\" and \"Kagerō\", ranked #1.[10] \"Koi Moyō\" was also used as the theme song for the movie Corazon de Melon. In March, they embarked on the Japan Nite tour, touring six major cities in the United States,[13] including an appearance at SXSW.[14][15]  They also performed at the Sakura-Con anime convention.[16][17] In July, they performed in front of 10,000 people at France's Japan Expo and also at Hong Kong's Animation-Comic-Game Hong Kong in August. Scandal concluded their indie career with the release of their first mini-album, Yah! Yah! Yah! Hello Scandal: Maido! Scandal Desu! Yah Yah Yah!.\n"
         ]
      },
      "Major debut": {
         "text": [
            "In October 2008, Scandal made their major debut on Epic Records Japan with the single \"Doll\". It gave them increased exposure, including appearances on mainstream music television shows like Music Station.[18] The band released their second major single \"Sakura Goodbye\" in March 2009 to commemorate Mami and Tomomi's high school graduation.[19] The song was a new version of their indie song, \"Sakura\", which had previously only been performed live.[20] The following month, their third major single \"Shōjo S\" was used as the tenth opening theme for the anime Bleach. The single ranked #6 on the Oricon charts when it was released two months later in June.[21]\n",
            "On October 14, Scandal released their fourth major single, \"Yumemiru Tsubasa\" which was followed with their major debut album, Best Scandal, the next week. The album ranked #5 on the Oricon weekly chart, making them the first girl band since Zone to have a debut album chart in the top five.[22] In December, Scandal embarked on their Scandal First Live: Best Scandal tour in 2009. Concluding the year, the band won a New Artist Award at the 51st Japan Record Awards, but lost the Best New Artist Award to Korean boy group Big Bang.\n",
            "2010 began with Scandal's fifth major single in February, \"Shunkan Sentimental\". It was used as the fourth ending theme for the anime Fullmetal Alchemist: Brotherhood. The following month, they embarked on a spring tour, Scandal: Shunkan Sakura Zensen Tour 2010 Spring. Prior to its start, the band conducted a Twitter poll to choose a song to cover for the tour. The winner was \"Secret Base (Kimi ga Kureta Mono)\", which was chosen out of over 600 candidates.[23] In June, Scandal released a pop tune for summer, \"Taiyō to Kimi ga Egaku Story\", followed by their first original ballad, \"Namida no Regret\", in July.\n",
            "Between the end of July and the beginning of August, Scandal traveled to Hong Kong. The band performed for the third consecutive year at the Animation-Comic-Game Hong Kong convention and held their first one-man live concert in Hong Kong, which sold out.[24] Scandal was also featured on the cover of the Hong Kong magazine re:spect music magazine, and their previously released single \"Taiyō to Kimi ga Egaku Story\" reached #1 on the Radio Television Hong Kong J-pop chart.[6] Earlier in the year, they were awarded a bronze newcomer award by RTHK, similar to the Hong Kong Grammys.[6]\n",
            "After returning to Japan, Scandal released their second album, Temptation Box, on August 11. The album debuted at #3 on the Oricon weekly chart, making them the first girl band to have an album chart in the top three in over a year since Chatmonchy's Kokuhaku.[25] The album was also released in 42 other countries worldwide.[7]\n",
            "Later in August, Scandal provided the theme, insert, and ending songs for the animated film Loups=Garous, which premiered on the 28th in most of Japan. The songs were \"Midnight Television\", \"Koshi-Tantan\", and \"Sayonara My Friend\", respectively.[26] The band also appeared as themselves, marking their big-screen debut as a band. They were shown in a musical performance scene that was created with the help of motion capture, providing a realistic representation of the band's movements.[27] Each member also had a role voicing a minor character.[28]\n",
            "Two months following Temptation Box, Scandal released their eighth major single, \"Scandal Nanka Buttobase\", on October 6, 2010. The title track was written and composed by the husband-and-wife duo Yoko Aki and Ryudo Uzaki, who are known for creating many songs for Momoe Yamaguchi.[29] The limited edition DVDs contains performances from the band's first television show, Shiteki Ongaku Jijō, which ran for 13 episodes from July to September 2010. In November, Scandal released a cover mini-album called R-Girl's Rock!. It features songs by female artists that they respect from the last three decades, including their cover of \"Secret Base (Kimi ga Kureta Mono)\" from May. Rina undertook her first lead vocal on the song Sunny Day Sunday.[30]\n",
            "Scandal continued into 2011 with their ninth major single on February 9. Titled \"Pride\", the song was used as the second ending theme for the anime Star Driver: Kagayaki no Takuto. The single also includes the tracks \"Cute!\", a collaboration with Sanrio's Cinnamoroll, and \"Emotion\", their first song that was written solely by a band member.[31] Their tenth major single, \"Haruka\", was released on April 20. The title track was used as the theme song for the animated film Tofu Kozou, while the song \"Satisfaction\" was later used as the promotional song for the release of Windows 8. This was followed by their eleventh major single, \"Love Survive\", as well as their third studio album Baby Action. They also embarked on their first Asian Tour, performing to sold-out crowds in Hong Kong, Taiwan and Singapore.\n",
            "2012 proved to be a year of firsts for Scandal. The title track of their twelfth single, \"Harukaze\", was used as the opening theme for the anime Bleach. The following month, they released their first compilation album, Scandal Show, as well as holding their first concert at the Nippon Budokan. In July, they released their thirteenth major single, \"Taiyō Scandalous\". This single marked the first official release of their subunits, Dobondobondo (Mami x Tomomi) and Almond Crush (Haruna x Rina). This was followed by their fourteenth major single, \"Pin Heel Surfer\", and their fourth major album, Queens Are Trumps: Kirifuda wa Queen. With this release, they became the first girl band to achieve four consecutive top 5 positions in the Oricon Weekly charts. They also held a concert in Malaysia in December, becoming the first Japanese band to hold a solo concert there.\n",
            "Scandal started 2013 by performing in their hometown at the Osaka-jō Hall in March. The tickets sold out in just five minutes.[32] Later that month they also performed to sellout crowds on their 2nd Asian Tour in Indonesia, Singapore and Thailand. During this period they also announced their fourteenth major single \"Awanai Tsumori no, Genki de ne\" released in May, with the title track being used as the theme song for the movie Ore wa Mada Honki Dashitenai Dake. They also took part in some music festivals like Kawaii!! Matsuri 2013 at Tokyo Metropolitan Gymnasium, and Rock in Japan Festival 2013 at Hitachi Seaside Park. Then they performed their summer live tour \"Ska wa Mada Houki Dashitenai Dake\". In August, they released their 16th single \"Kagen no Tsuki\", with the song \"Kimi to Mirai to Kanzen Douki\" being used as part of a collaboration with a robot project called \"Robot Scandal\". Their fifth studio album, Standard, was released on October 2, 2013.\n",
            "2014 was a milestone in Scandal's career. Their sixth studio album released on December 3, 2014, Hello World, was the first album fully written by the band members themselves, and their first released internationally by label JPU Records.[33] It debuted at #3 on the Oricon chart, selling over 35,000 copies in its first week, and spawned the singles \"Departure\" and \"Image\". Their eighteenth major single, \"Yoake no Ryuuseigun\", was used as the ending theme to Pokémon the Movie: Diancie and the Cocoon of Destruction and reached #1 on Billboard Japan Hot Animation.\n",
            "From April to May 2015, the band completed their first major Scandal World Tour 2015 \"Hello World\", selling out concerts in major cities across the world including Paris, London, Essen, Singapore, Taipei, Chicago, Los Angeles, Anaheim, Mexico City and Hong Kong. They followed this up with the Scandal Arena Tour 2015-2016 \"Perfect World\" in Japan from December 2015 to January 2016, during which they recorded their sixth live DVD at Nippon Budokan, Tokyo.\n",
            "Yellow, Scandal's seventh album, was released on March 2, 2016 and spawned the singles \"Stamp!\" (including B-side sleeper hit \"Flashback No. 5\") and \"Sisters\". The band released the single \"Take Me Out\" on July 27, 2016, in celebration of their tenth anniversary. The band also held their Scandal 10th Anniversary Festival \"2006-2016\" at Osaka Izumiotsu Phoenix, where they played to over 20,000 fans. The event was recorded and released later that year as their 7th concert DVD Scandal 10th Anniversary Festival 2006-2016. They then embarked on their second major world tour, Scandal Tour 2016 \"Yellow\", performing in 14 countries.\n",
            "On February 15, 2017, Scandal released their fourth compilation album, Scandal, which peaked at number 2 on the Oricon weekly charts. In support of this album, Scandal embarked on their longest tour to date at the time, the Scandal 47-Prefecture tour, which saw them sell out 53 performances across all 47 prefectures of Japan over four months.[34] Scandal's eleventh anniversary concert on August 21, 2017, was recorded for the October 21 episode of the television show Storytellers. On October 7, Scandal was invited to Hamburg to perform at the 40th anniversary show of German artiste Nena, who described herself as a fan of Scandal's. The band covered Nena's hit single \"Willst du mit mir gehn\" by singing the title phrase in German and the rest of the song in Japanese. On August 21, the band released a digital single, \"Koisuru Universe\".\n",
            "Their eighth studio album Honey was released in Japan on February 14, 2018, and in Europe on March 2. Honey peaked at number 3 on the Oricon weekly charts, extending their streak of being the only girl band to consecutively have their albums reach the top 5 of the charts to 8. The album also topped nine charts across Europe, and reached the top 10 in three more.[35] Later that year, the band embarked on yet another world tour, SCANDAL TOUR 2018 \"HONEY\", which included two debut concerts in Beijing and Guangzhou, China.\n"
         ]
      },
      "\"her\" record label": {
         "text": [
            "On Christmas Eve 2018 during their \"Best Xmas 2018 Concert\" at Akasaka Blitz, Scandal announced the formation of their own band-run music label \"her\".[36] The band released its first double-A-side CD single on the \"her\" label with the songs “Masterpiece” and “Mabataki” on March 27, 2019.[37] On August 7, 2019, Scandal released the digital single \"Fuzzy\".[38][39] This was followed by the digital single \"Saishūheiki, kimi\" on November 5, 2019. During this time, the band's official YouTube channel earned the 25th spot on Nikkei Entertainment's \"most subscribed-to Japanese performer/entertainer channels in 2019\" ranking.[40]\n",
            "In January 2020, the song \"A.M.D.K.J.\" was announced as the ending theme song for the anime GeGeGe no Kitarō, while \"Tonight\" was announced as the theme song for the Japanese drama Raise de wa Chanto Shimasu (I'll be fine in the afterlife).[41] On February 12, 2020, the band released their ninth studio album, Kiss from the Darkness, which included all the songs that had been released on the \"her\" label. The album peaked at number five on the Oricon weekly charts,[42] extending Scandal's streak of having all nine of their albums reach the top 5 of the charts upon release. The album also charted on iTunes in four other countries, peaking at #21, #33, #33, and #60 in Australia, United States, Canada, and France respectively.[43] On March 9, the band also launched a radio program hosted by themselves, Scandal Catch Up supported by Meiji Apollo, aired weekly on Spotify Podcasts[44] and Japanese commercial radio network JFN Park.[45]\n",
            "On May 30, 2020 the band announced the cancellation of the Japan leg of their Scandal World Tour 2020 “Kiss from the Darkness” due to Japan's strict COVID-19 precautionary measures prohibiting large public events (including concerts) and concerns for the safety of their fans and staff. Over the course of the next several months, they also announced the cancellations and postponements of their international legs. On June 3, the band released a digital single, \"Living in the City\", which they recorded from their respective homes during Japan's COVID-19 stay-home measures.[46] On July 15, they released the digital single \"Spice\" in collaboration with Xflag and their animated film Xpice, which premiered on the official Xflag Anime YouTube channel the same day. Scandal also livestreamed a commemoration talk show on their official YouTube channel in support of Xpice.[47] On the 14th anniversary of Scandal's formation on August 21, the band performed their first paid livestream concert, “Kiss from the Darkness” Livestream,[48] from Katsushika Symphony Hills. Footage from the livestream was released later that year as their 8th concert DVD, SCANDAL WORLD TOUR 2020 \"Kiss from the darkness\".[49] On October 18, the band appeared as guests on 「project STAY HOPE」, a special program hosted by fellow rock band Blue Encount supporting the reconstruction of Kumamoto. Scandal's one and only live performance with an audience in 2020, \"SCANDAL『SEASONS』collaborated with NAKED\" was held on December 24 at Toyosu PIT, Tokyo.[50] The concert was later also released as a paid stream.\n",
            "On January 31, 2021, the band launched a documentary series, ｢“her” Diary 2021 on YouTube｣, on their official YouTube channel. On March 3, 2021, the band released the single \"Eternal\"; in addition to being available via streaming and download, it was also released physically on CD, cassette, and vinyl in limited quantities. The band has also announced a SCANDAL MANIA TOUR 2021 for April 2021 as well as their 15th anniversary concert, SCANDAL 15th ANNIVERSARY LIVE [INVITATION], scheduled for August 21, 2021 at Osaka-jō Hall.\n"
         ]
      }
   },
   "Band members": {
      "text": [
         "Haruna Ono (小野春菜, Ono Haruna) — lead vocals, rhythm guitar\n",
         "Mami Sasazaki (笹崎まみ, Sasazaki Mami) — lead guitar, vocals\n",
         "Tomomi Ogawa (小川ともみ, Ogawa Tomomi) — bass guitar, vocals\n",
         "Rina Suzuki (鈴木理菜, Suzuki Rina) — drums, keyboards, guitar, vocals\n"
      ]
   },
   "Tie-ins and promotions": {
      "Theme music": {
         "text": [
            "Scandal's music has been featured in a range of popular media. Besides their aforementioned \"Shōjo S\" and \"Shunkan Sentimental\" singles, which were featured in the anime series \"Bleach\" and \"Fullmetal Alchemist Brotherhood\" respectively, their first single, \"Space Ranger\", was the opening to Kyoto Sports Weekly, and their second single, \"Koi Moyō\" was the main theme of the movie Corazon de Melon. Their song, \"Start\", is the theme of Star Ocean: Second Evolution and is available on the game's soundtrack.  In 2010, the song \"Hi-Hi-Hi-\" was featured in Hangame's MMORPG Elsword, for which Mami also provided guest voice acting. Scandal also provided the theme music to the 2010 animated movie, Loups=Garous.[51]\nThe movie's insert song \"Koshi-Tantan\" was on their single \"Taiyō to Kimi ga Egaku Story\". Scandal also provided both the opening and ending themes for the movie, appearing in their animated form during a special musical performance scene.\n",
            "In 2011, their single \"Pride\" was announced as the theme for the anime Star Driver while \"Haruka\" was used as the theme song for the animated film Tofu Kozou. In 2012, their single \"Harukaze\" was the 15th opening theme of Bleach. Scandal was the second artist to be in charge of more than one opening theme in Bleach (after Aqua Timez). Later that year, \"Burn\" was used as the closing theme for the movie Rabbit Horror 3D while \"Kill the Virgin\" was used as the theme for comedy horror film Dead Sushi. In 2013, \"Happy Collector\" was used as the theme song for the movie Kyou, Koi wo Hajimemasu. Later that year, \"Weather report\" was announced as the theme for the Japanese-dubbed release of American political thriller television series, Scandal.[52] On February 28, 2014, the song \"Rainy\" was announced to be the theme song of the Japanese release of The Mortal Instruments: City of Bones. On October 2, 2015, it was also announced that Scandal had written the song \"Morning Sun\" as the theme for the movie 猫なんかよんでもこない。; Cats Won't Come Even When You Call for Them.[53] In 2020, the band wrote and released the song \"A.M.D.K.J.\" as the ending theme for long-running anime GeGeGe no Kitarō. Later that year, \"Tonight\" was announced as the theme song for the Japanese drama Raise de wa Chanto Shimasu.[41] On July 15, they released the digital single \"Spice\" in collaboration with Xflag and their animated film Xpice.\n"
         ]
      },
      "Musical collaborations": {
         "text": [
            "In 2009, \"Daydream\" was featured on a tribute album to the classic multi-genre Japanese band, Judy and Mary. On November 17, 2010, Scandal released their second mini-album R-Girl's Rock!, featuring covers of songs by female artistes from the 1980s to the 2000s that they admire, including a promotional single of Zone's smash hit \"Secret Base (Kimi ga Kureta Mono) \". On October 24, 2012, Scandal released a cover of \"How Crazy\" by Yui, which was featured as the opening track on the Yui tribute album She Loves You. On February 12, 2014, Scandal released a split single \"Count Zero | Runners High\" with T.M.Revolution. On March 26, 2014, Scandal contributed a cover of \"Osaka LOVER\" by DREAMS COME TRUE on the tribute album Watashi to Dream: Dreams Come True 25th Anniversary Best Covers. On April 1, 2015, rock band Super Beaver released the song \"Q&A\" on their Aisuru album, which featured Mami on guest vocals. On February 3, 2016, singer-songwriter Rina Katahira released her album Saikou no Shiuchi, which included a song titled \"Party\" produced by Scandal.\n",
            "On September 13, 2017, idol group Tokyo Performance Doll released a song \"Glitter\", written by Rina, on their mini album Summer Glitter. On November 19, 2017, idol group Yumemiru Adolescence released the song \"Exceeeed!!\", written by Mami, as part of their double-A-side single 20xx / Exceeeed!!. On March 3, 2018, Scandal wrote and produced the song \"Story\" for Airi Suzuki's solo debut album Do me a favor. For their 2020 Kiss from the Darkness album, Scandal also collaborated with Yusuke Takeda of Radwimps and Chiaki Satō on the songs \"Laundry Laundry\" and \"Neon Town Escape\" respectively. In March 2020, the band announced on Instagram that rappers Kubo Takai and Rinne sampled \"Tsuki\", the ending track on the Kiss from the Darkness album, for their own song \"Shingetsu\". On May 30, all four Scandal members made cameos in fellow rock band SiM's music video for the song \"BASEBALL BAT\". On July 3,  Tomomi and Rina were announced as bassist and drummer of the newly formed Tigers Band, which performed the 2020 edition of fight song \"Rokko Oroshi\" to be played on the big screen during games of the professional baseball team Hanshin Tigers.[54]\n",
            "Over the course of their career, Scandal has taken part in joint live performances with artistes such as Stereopony, Kishidan, Keiko Tareda of Show-Ya, Airi Suzuki, Rina Katahira, and SMAP. They have also held two joint-band tours under the name \"SCANDAL's Joint Band Tour\"; one in 2017 with UNISON SQUARE GARDEN, 04 Limited Sazabys, and BLUE ENCOUNT, and another in 2019 with Kyuso Nekokami and SiM.\n"
         ]
      },
      "Endorsements and product collaborations": {
         "text": [
            "Scandal has been featured in commercials, promoting a line of Cecil McBee cosmetics,[55] for Nike, featuring four different colors of their footwear, and were chosen to represent Pocari Sweat in posters and in the promotional video for their song \"Beauteen\" as part of their summer 2009 campaign. In 2012, their song \"Satisfaction\" was used as the promotional song for the release of Windows 8, becoming the first Japanese artist to be chosen for the Windows commercial series. In 2014, \"Taiyō Scandalous\" was used as the CM song for Ito En's carbonated drink, \"Stylee Sparkling\".[56] In April 2016, the band modeled for American cosmetics label Anna Sui's 20th anniversary in Japan.[57] Later that year, their song \"Love Me Do\" was used as the CM song for the Fettuccine Gummi candy line manufactured by Bourbon while \"Koisuru Universe\" was used in a Bourbon web commercial that also featured animated versions of the Scandal members. In 2018, the band modeled for cosmetic brand Revlon's ColorStay Overtime Lip Color.[58]\n",
            "Throughout their career, Scandal has also had collaborations with many apparel and product brands. From 2011 to 2012, the band endorsed American lighter manufacturer Zippo as \"Zippo Girls\", and collaborated to release limited-edition Zippo lighters designed by the band members. In 2015, Scandal-branded collaboration models of Sony's Stereo Headphone h.ear on and Walkman A Series were released. This was followed by a collaboration with Leica Camera Japan on a Scandal-branded Leica D-Lux \"RSJ Edition\" camera. Later that year, they released a pair of limited edition shoes in collaboration with Vans as part of their 10th anniversary celebrations. Other collaborations include both international and Japanese fashionwear brands, such as Yohji Yamamoto's Ground Y label, Tower Records' original apparel brand WEAretheMusic, Fila, Peanuts, New Era, Nerdunit, jouetie, Village Vanguard, and E hyphen world gallery.\n",
            "Scandal also has a long-standing collaboration with guitar manufacturer Fender. In June 2014, Fender released three limited-edition Signature Squier instruments (the Haruna Telecaster Dark Silver Sparkle \"Skullsilver\", Mami Jazzmaster Pearl White, and Tomomi Jazz Bass Sky Blue \"Bluetus\"). In November 2017, Fender released another three limited-edition Signature Fender instruments (the Haruna Telecaster, Mami Stratocaster, and Tomomi Precision Bass). The band also signed an endorsement deal with Fender, making them the first female Japanese artist to do so.[59] Drummer Rina endorses Pearl Drums and has had her own Pearl signature model drumsticks released in 2011 and 2016.[60]\n"
         ]
      },
      "Feedback apparel": {
         "text": [
            "In 2012, the band launched their own apparel brand, Feedback!, which was later renamed Feedback. As of March 2016, the band started selling both Feedback apparel and exclusive official Scandal merchandise via \"Feedback Shop,\" a private store in Tokyo, and their webstore.[61] On August 1, 2020 it was announced that the store would close on August 31, 2020 and shift to online sales and pop-up stores amid the COVID-19 pandemic.[62] All the band members are involved in the design and production of the Feedback apparel. On August 21, 2020, Scandal launched an official overseas online store for band merchandise.\n"
         ]
      },
      "text": [
         "Anime\n",
         "Being fans of Japanese animation and manga themselves they wanted to be represented in animated form, turning each member into an animated character. The animated Scandal is featured on a series of promotional videos on the band's website.\n"
      ]
   },
   "Solo activities": {
      "text": [
         "Haruna played the role of Emil von Selle in the stage performance of Ginga Eiyuu Densetsu Dai 4 Shou Kouhen Gekitotsu from February 12 to March 2, 2014 at Aoyama Theater, Tokyo. On her 30th birthday of August 10, 2018, she released her first photobook titled SOMEWHERE.\n",
         "On March 11, 2014, Oricon and Fuji TV announced that Tomomi would be the new bassist of the Domoto Brothers Band, the house band that plays for the Sunday night TV musical variety show Shin Domoto Kyodai (新堂本兄弟).[63] From October 19, 2019, Tomomi made several appearances as a guest disc jockey at Tokyo cafe lounge montoak.\n",
         "Rina had a recurring guest column in the Japanese music magazine, GiGS, until May 2012. On September 13, 2012, Rina was announced to be joining the supergroup Halloween Junky Orchestra led by Hyde and K.A.Z of Vamps, which spawned the October 2012 hit single Halloween Party.[64] On her 23rd birthday of August 21, 2014, Rina released her first personal book titled one piece. This was followed by her second personal book, it's me, on July 15, 2016. On May 22, 2020, Rina announced the launch of her personal YouTube channel, tiny channel by rina, for which she personally creates and edits videos. Later that year in December, Rina and long-time collaborator Seina successfully completed MAKE A WISH \"DAISY\" PROJECT, a crowdfunding project for charities supporting single mothers and victims of domestic abuse.\n",
         "Mami performed her first live solo performance at the outdoor show Choushidoukan ～Kanade no Mori no Oto Shizuku ~ on October 4, 2020.[65] This was followed by another solo performance at FM802 Hikigatari-bu -Haru Urara-hen♪-[66] in Osaka on March 7, 2021.\n"
      ]
   },
   "Fan club": {
      "text": [
         "In October 2009, pamphlets were enclosed in the band's first album, Best Scandal, announcing the formation of \"Club Scandal\". Club Scandal is a cellphone-based fanclub with exclusive videos and interviews, behind the scenes bonus material, pictures, and news about the band.\n",
         "On August 21, 2010 (the 4-year anniversary of the band being founded), Scandal launched a separate, traditional mail-based fan club alongside \"Club Scandal\" called \"Scandal Mania\". When joining, members receive an official membership card, a full color newsletter mailed to the member tri-annually, a special birthday message written by their favorite member (chosen at sign-up) and signed by the whole band, as well as perks such as getting advance notice on tickets to live events, and special live events only for members.\n"
      ]
   },
   "Discography": {},
   "Concerts": {
      "Tours": {},
      "One-man live performances": {},
      "International": {}
   },
   "Works": {
      "Documentaries": {},
      "Films": {},
      "Television": {},
      "Radio": {},
      "Internet": {},
      "Books": {},
      "Magazines": {}
   },
   "References": {},
   "Further reading": {},
   "External links": {},
   "coreData": [
      "Scandal (Japanese: スキャンダル, Hepburn: Sukyandaru, stylized as SCANDAL) is an all-female Japanese rock band from Osaka. Formed in August 2006 by four high school girls, they played live street performances until they were noticed and signed to the indie label Kitty Records. Although all four members have provided lead vocals, their primary roles are Haruna on vocals and rhythm guitar, Mami on lead guitar, Tomomi on bass guitar, and Rina on drums. In 2008, they released three singles and a mini-album while simultaneously touring the United States, France, and Hong Kong. That October, Scandal released their major debut single, \"Doll\", on Epic Records Japan.\n",
      "The band has performed the theme songs for several anime series, including \"Shōjo S\" and \"Harukaze\" for Bleach, \"Shunkan Sentimental\" for Fullmetal Alchemist: Brotherhood, \"Pride\" for \"Star Driver\" and \"A.M.D.K.J.\" for \"GeGeGe no Kitarō\". With numerous overseas performances and anime theme songs, Scandal has built a considerable international fanbase.[6][7] The band has been voted by fans across the world into the top ten of the \"Most-Requested Artists\" category of the J-MELO Awards every year since 2010, peaking at first place in 2014.[8]\n",
      "During their \"Best Xmas 2018 Concert\" at Akasaka Blitz, they announced that they would establish their own private record label named \"her\" in 2019.[9]\n",
      "Scandal was formed in August 2006 by four high school girls. The girls, Haruna, Mami, Tomomi, and Rina, met in an Osaka vocal and dance school called Caless.[10][11] Shortly thereafter, they started performing live performances every weekend at Shiroten in Osaka Castle Park. Soon, they started getting offers from clubs in Osaka and Kyoto. The band's name originates from a sign near Studio Brotherz, a studio where they practiced in their early days. The studio was on the sixth floor of a building shared with other businesses, namely adult shops. The girls decided to choose the biggest sign among the shops, \"Scandal\" (スキャンダル, Sukyandaru), as the name for their band.[12]\n"
   ],
   "infobox": {
      "Origin": [
         "Miyakojima-ku, Osaka, Japan"
      ],
      "Genres": [
         "Pop rock[1][2][3]",
         "pop punk[1]",
         "alternative rock[4]",
         "garage rock[5]"
      ],
      "Years active": [
         "2006–present"
      ],
      "Labels": [
         "Kitty",
         "Epic",
         "Her",
         "JPU Records (EU & NA)"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Haruna Ono",
         "Mami Sasazaki",
         "Tomomi Ogawa",
         "Rina Suzuki"
      ]
   }
}