{
   "Name": "The Scissor Girls",
   "rawData": [
      "The Scissor Girls were an American, Chicago-based no wave band, formed by Washington, D.C. natives Azita Youssefi, Sue Anne Zollinger, and Heather Melowic in 1991. The idea to form the group was conceived during the late 1980s by Azita Youssefi and Heather Melowic while they were living in their hometown of Washington, DC. In 1989, after moving to Chicago to attend the Art Institute of Chicago, Youssefi met guitarist Sue Anne Zollinger who, following the addition of Heather Melowic on drums, agreed to join the trio. The original lineup of the band included of Azita Youssefi on bass and vocals, Sue Anne Zollinger on guitar, and Heather Melowic on drums.\n",
      "The Scissor Girls' live performances were highly theatrical and the group's members often dressed in bizarre homemade costumes ranging from Catholic schoolgirl uniforms, to clothes made of Bubble Wrap and duct tape.\n",
      "The group recorded and released a number of indie singles as well as two full-length albums with their original lineup before guitarist Sue Anne Zollinger chose to leave. In 1994, Zollinger's roommate, guitarist Kelly Kuvo, became Zollinger's permanent replacement. After Kuvo's induction into the band, the group released  7\" singles \"New Tactical Outline Sec. 1\" and \"New Tactical Outline Sec. 2.\" in February 1995, and the 10\" EP \"S-T-A-T-I-C-L-A-N-D\" in March 1996, before they were forced to disbanded due to financial issues, leaving a third full-length album unfinished in the studio. In 1997, following the band's breakup, a singles compilation was released by Atavistic Records.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, United States"
      ],
      "Genres": [
         "No wave, noise rock, experimental rock"
      ],
      "Years active": [
         "1991—1996"
      ],
      "Labels": [
         "MonkeyTech",
         "Quinnah Records",
         "Atavistic Records",
         "Load Records"
      ],
      "Associated acts": [
         "Bride of No-No",
         "Lake of Dracula",
         "Azita Youssefi"
      ],
      "Past members": [
         "Azita Youssefi",
         "Heather Melowic",
         "Sue Anne Zollinger",
         "Kelly Kuvo"
      ]
   }
}