{
   "Discography": {
      "Albums": {},
      "EPs": {},
      "Singles": {},
      "Video": {}
   },
   "External links": {},
   "History": {
      "After the Scissor Girls": {
         "text": [
            "After the breakup of the band, Azita Youssefi went on to form the short-lived Bride of No No. Following the breakup of Bride of No No, Youssefi went on to perform solo as \"Azita\", crafting much softer and more accessible piano-based compositions far removed from the Scissor Girls noisy experimentation.\n",
            "After the Scissor Girls, Melowic joined the Chicago no-wave supergroup Lake of Dracula, contributing drums alongside the Flying Luttenbachers' Weasel Walter, who provided lead guitar, Couch's Marlon Magas, who supplied vocals, and Shorty and U.S. Maple vocalist Al Johnson (billed as the Manhattanite) on backing vocals. The group lasted through 1997 at which point Melowic decided to continue her education, studying virology at the University of Illinois.[2] Melowic eventually went on to obtain a Ph.D in Biochemistry.[6] and now enjoys teaching Chemistry to High School students in New Jersey.\n",
            "After her time in The Scissor Girls, Kelly Kuvo traveled to Brooklyn where she helped form the band Sweet Thunder with Rayna Russom of The Crystal Ark, as well as with Casey Spooner and Lizzy Yoder of Fischerspooner.[2] Kuvo then made the move from Brooklyn to Los Angeles where she continued writing as a freelancer for magazines such as Index, Roctober Magazine, Oui, Scram Magazine, and Vice Magazine, and has six critical essays published in the music anthology book, Lost In The Grooves.[2] Kuvo hosted The Bubblegum Music Achievement Awards Ceremony, and then went on to receive an MA in Studio Art and Art Therapy from New York University. Kelly Kuvo produced a DVD retrospective video compilation for The Scissor Girls in 2004 later to be released by Savage Land Records in 2011, and continues to make and collaborate on art, video, literature, and music projects. Currently, Kelly Kuvo enjoys teaching art to middle and high school students in Los Angeles, CA.\n",
            "Upon her departure from the band, original guitarist SueAnne Zollinger went on to receive a Ph.D in Biology and Neuroscience, studying sound production and vocal learning.[6]\n"
         ]
      },
      "Breakup": {
         "text": [
            "In 1996, with the band now committed to a label, the trio of Youssefi, Melowic, and Kuvo returned to the studio to record the band's third LP. Though work was started on the album, it was never completed. After recording her drum parts for the album, Melowic opted to continue her education rather than try to contend with the band's growing financial troubles, which had recently compounded due to an extended period of mismanagement. The group's mishandled funds also prompted Kuvo to depart after recording her guitar parts for the album, leaving Azita to finish recording her bass parts alone. The band's final album is incomplete and unreleased. The Scissor Girls officially disbanded in October 1996, without fulfilling their two-album contract with Atavistic, who instead released a singles compilation, \"Here Is the 'Is-Not',\" in April 1997. \"Here Is the 'Is-Not'\" would be the band's final release.[2][4][5]\n"
         ]
      },
      "Early years": {
         "text": [
            "In 1989, Azita Youssefi left her hometown of Washington, D.C. to attend the Art Institute of Chicago, intending to pursue a study in drawing and sound. While still in her first year of school, Youssefi had begun to grow tired of producing visual art, and an encounter with guitarist and fellow D.C. native Sue Anne Zollinger prompted Youssefi to begin experimenting with music.[1] After convincing childhood friend Heather Melowic to join her in Chicago, Youssefi, along with Melowic, managed to persuade Zollinger to fill out their three-piece. The Scissor Girls formed in the summer of 1991 with Azita on bass, Zollinger on guitar, and Melowic on drums. The group was known for the odd costumes its members would wear on stage; an eclectic collection of attire which at times included, goggles, tutus, and heavy eye makeup that mimicked the black facial coloring of raccoons.[2]\n",
            "In 1992, the Scissor Girls became friends with a Copy Max employee named Kelly Kuvo—at the time also a student at the Art Institute of Chicago—who worked in the Wicker Park district of Chicago, a breeding ground for No Wave bands during the early 1990s. Kuvo offered the band a chance to make their first Scissor Girls fliers, demo tape inserts, and posters free of charge, giving the band a boost of publicity which they were able to exploit well enough to land their first gig: a local performance that took place on Halloween night 1992. Also in 1992, the band began to record their first 7-inch, Phy, Diablo!, issuing the release on Chicago indie label Monkeytech. The album sleeve of each release included a real dried cricket smashed and taped to the cover. At around the same time, the Scissor Girls contributed to the Mira Records-released split 7-inch single \"Time Expired\", accompanied by tracks from Slant 6, Drinking Woman, and Rasto.[2]\n"
         ]
      },
      "First releases": {
         "text": [
            "In 1994 the Scissor Girls began recording their first 10” LP, “From: The Scissor Girls To: The Imaginary Layer On Skeletons,” this time for Quinnah Records. The Scissor Girls first LP was delayed numerous times due to Quinnah’s tight budget at the time. When Quinnah finally did send the group’s master tapes to be pressed, the group discovered that the record pressing plant to which the masters had been sent had burned down, further delaying the album, but not affecting the master tapes, which were unharmed. The album was finally released in late 1994 as an expanded 12” LP, 500 copies of which were released on marbled gray vinyl, and all of which included a fold-out map hand-drawn by Youssefi. The CD version of “From: The Scissor Girls To: The Imaginary Layer on Skeletons” was released by The Making of Americans label, run by the New York City queercore duo, God is My Co-Pilot.[2]\n"
         ]
      },
      "Further releases": {
         "text": [
            "In March 1996, the Scissor Girls, now with Kuvo on guitar, released their first EP, the Load Records-released 10\" EP, \"So That You Can Start to See What S-T-A-T-I-C-L-A-N-D.\" The album was jointly produced by Tom Smith and Sonic Youth guitarist Jim O'Rourke in the winter of 1995.[3] It was during the recording of this first EP that the band finally managed to secure a release for their second album We People Space with Phantoms, which the band had recorded with original guitarist Sue Anne Zollinger, but which had sat unreleased on the shelf since it was recorded in October 1994. The job of issuing the album ultimately fell to Atavistic Records, which released the LP on April 16, 1996. Following the release of their second album, the Scissor Girls were offered a contract by Atavistic with the stipulation that the band would release two further records for the label. Guitarist Kelly Kuvo declined the offer, but both Youssefi and Melowic agreed to be signed to Atavistic.[2]\n"
         ]
      },
      "Lineup changes": {
         "text": [
            "Following the recording of “From: The Scissor Girls To: The Imaginary Layer on Skeletons” the band immediately set to work on a follow-up LP titled, “We People Space with Phantoms.” This album would be the final Scissor Girls album to include founding member Sue Anne Zollinger, who left the band following the recording due to internal conflicts between her and the rest of the band. Following Zollinger's departure, the band hired guitarist James Yoo to accompany them on a tour. Youssefi and Melowic, the remaining Scissor Girls, quickly realized that the guitar style of Zollinger's replacement did not mesh well with their own sound, and opted to replace Yoo mid-tour. Guitarist Kelly Kuvo, who had remained in touch with the band since the early days following their formation and had actually been living with Zollinger before the latter's departure from the Scissor Girls, was chosen to replace Yoo for the remainder of the tour. Though initially reluctant to collaborate with the Scissor Girls due to her commitments to her other group, Dot Dot Dot, and her production of video art project television shows for Public-access television cable TV, Kuvo agreed to take a week off work in order to help the band finish their tour. Eventually Kuvo would go on to become a full-time member of the group, collaborating as singer, songwriter and guitarist on the band's self-released 7\" singles \"New Tactical Outline Sec. 1\" and \"New Tactical Outline Sec. 2.\" in 1995, and the 10\" EP \"S-T-A-T-I-C-L-A-N-D\" released on Load Records, her self-produced SG Research Music Videos, and to the band's road shows until the band's breakup in 1996.[2]\n"
         ]
      },
      "Television appearances": {
         "text": [
            "After finishing up their first tour with the new lineup, the Scissor Girls began to look for new opportunities to expand their audience. With this goal in mind, Kelly Kuvo produced an SG Research 96 music video show for Chicago Cable Access, and the band began making appearances on local Chicago-area television programs such as \"Ben Loves Chicago\" and the American Bandstand-like, all-ages cable-access dance show Chic-a-Go-Go. One of the prerequisites for performing on Chic-a-Go-Go stipulated that the trio would have to lip-sync their contribution to the program. This became a point of contention with drummer Heather Melowic, who refused to perform on the show. Despite Melowic's refusal to appear on the program, the other members of the band opted not to cancel their performance. In Melowics' stead the band hired a young girl dressed as a cavewoman to intermittently beat a snare drum with a plastic dinosaur bone in lieu of Melowic's percussive accompaniment. After the Chic-a-go-go performance the Scissor Girls were offered a chance to appear on The Jenny Jones Show, but Melowic again refused to participate, and the performance was dropped.[2]\n"
         ]
      }
   },
   "Personnel": {},
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Early years",
      "1.2 First releases",
      "1.3 Lineup changes",
      "1.4 Television appearances",
      "1.5 Further releases",
      "1.6 Breakup",
      "1.7 After the Scissor Girls",
      "2 Personnel",
      "3 Discography",
      "3.1 Singles",
      "3.2 EPs",
      "3.3 Albums",
      "3.4 Video",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Scissor Girls were an American, Chicago-based no wave band, formed by Washington, D.C. natives Azita Youssefi, Sue Anne Zollinger, and Heather Melowic in 1991. The idea to form the group was conceived during the late 1980s by Azita Youssefi and Heather Melowic while they were living in their hometown of Washington, DC. In 1989, after moving to Chicago to attend the Art Institute of Chicago, Youssefi met guitarist Sue Anne Zollinger who, following the addition of Heather Melowic on drums, agreed to join the trio. The original lineup of the band included of Azita Youssefi on bass and vocals, Sue Anne Zollinger on guitar, and Heather Melowic on drums.\n",
         "The Scissor Girls' live performances were highly theatrical and the group's members often dressed in bizarre homemade costumes ranging from Catholic schoolgirl uniforms, to clothes made of Bubble Wrap and duct tape.\n",
         "The group recorded and released a number of indie singles as well as two full-length albums with their original lineup before guitarist Sue Anne Zollinger chose to leave. In 1994, Zollinger's roommate, guitarist Kelly Kuvo, became Zollinger's permanent replacement. After Kuvo's induction into the band, the group released  7\" singles \"New Tactical Outline Sec. 1\" and \"New Tactical Outline Sec. 2.\" in February 1995, and the 10\" EP \"S-T-A-T-I-C-L-A-N-D\" in March 1996, before they were forced to disbanded due to financial issues, leaving a third full-length album unfinished in the studio. In 1997, following the band's breakup, a singles compilation was released by Atavistic Records.[1]\n"
      ]
   },
   "Title": "The Scissor Girls - Wikipedia"
}