{
   "Name": "The Scissor Girls",
   "rawData": [
      "The Scissor Girls were an American, Chicago-based band, formed by Azita Youssefi, Sue Anne Zollinger, and Heather Melowic in 1991. The idea to form the group was conceived during the late 1980s by Azita Youssefi and Heather Melowic while they were living in the Washington, DC area. In 1989, after both Youssefi and Sue Anne Zollinger moved to Chicago to attend the Art Institute of Chicago, guitarist Sue Anne Zollinger who, following the addition of Heather Melowic on drums, agreed to join the trio. The original lineup of the band included of Azita Youssefi on bass and vocals, Sue Anne Zollinger on guitar, and Heather Melowic on drums.\n",
      "The group recorded and released a demo-cassette, 7” single, as well as two full-length albums with their original lineup before guitarist Sue Anne Zollinger chose to leave. In 1994, Zollinger's roommate, guitarist Kelly Kuvo, became Zollinger's permanent replacement. After Kuvo's induction into the band, the group released  7\" singles \"New Tactical Outline Sec. 1\" and \"New Tactical Outline Sec. 2.\" in February 1995, and the 10\" EP \"S-T-A-T-I-C-L-A-N-D\" in March 1996, before they disbanded, leaving a third full-length album unfinished in the studio. In 1997, following the band's breakup, a singles compilation was released by Atavistic Records.\n",
      "In 1989, Azita Youssefi left Washington, D.C. suburbia to attend the Art Institute of Chicago, intending to pursue a study in painting and drawing. While still in her first year of school, Youssefi had begun to grow tired of only producing visual art, and a blossoming relationship with Elliot Dicks, who worked at the School of the Art Institute of Chicago store, prompted Youssefi to begin experimenting with sound and music. After convincing a teenage friend from the D.C. scene Heather Melowic to join her in Chicago, Youssefi, along with Melowic, managed to persuade fellow teenage friend from the D.C. scene, guitarist, Silver Springs, Maryland native, and also a student at SAIC, Sue Anne Zollinger to fill out their three-piece. The Scissor Girls formed in the summer of 1991 with Azita on bass, Zollinger on guitar, and Melowic on drums.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, United States"
      ],
      "Genres": [
         "No wave, noise rock, experimental rock"
      ],
      "Years active": [
         "1991—1996"
      ],
      "Labels": [
         "MonkeyTech",
         "Quinnah Records",
         "Atavistic Records",
         "Load Records"
      ],
      "Associated acts": [
         "Bride of No-No",
         "Lake of Dracula",
         "Azita Youssefi"
      ],
      "Past members": [
         "Azita Youssefi",
         "Heather Melowic",
         "Sue Anne Zollinger",
         "Kelly Kuvo"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] were an [GENRE] band, formed by Azita Youssefi, Sue Anne Zollinger, and [PERSON_NAME_FULL_0_FEMALE] in [YEAR]. The idea to form the group was conceived during the late [YEAR]s by Azita Youssefi and [PERSON_NAME_FULL_0_FEMALE] while they were living in the Washington, DC area. In [YEAR], after both Youssefi and Sue Anne Zollinger moved to Chicago to attend the Art Institute of Chicago, guitarist Sue Anne Zollinger who, following the addition of [PERSON_NAME_FULL_0_FEMALE] on drums, agreed to join the trio. The original lineup of the band included of Azita Youssefi on bass and vocals, Sue Anne Zollinger on guitar, and [PERSON_NAME_FULL_0_FEMALE] on drums.\n",
      "The group recorded and released a demo-cassette, 7” single, as well as two full-length albums with their original lineup before guitarist Sue Anne Zollinger chose to leave. In [YEAR], Zollinger's roommate, guitarist [PERSON_NAME_FULL_0_FEMALE], became Zollinger's permanent replacement. After [PERSON_NAME_LAST_0]'s induction into the band, the group released  7[SONG_NAME] in [MONTH] [YEAR], before they disbanded, leaving a third full-length album unfinished in the studio. In [YEAR], following the band's breakup, a singles compilation was released by Atavistic Records.\n",
      "In [YEAR], Azita Youssefi left Washington, D.C. suburbia to attend the Art Institute of Chicago, intending to pursue a [GENRE] a blossoming relationship with Elliot Dicks, who worked at the School of the Art Institute of Chicago store, prompted Youssefi to begin experimenting with sound and music. After convincing a teenage friend from the D.C. scene [PERSON_NAME_FULL_0_FEMALE] to join her in Chicago, Youssefi, along with [PERSON_NAME_LAST_0], managed to persuade fellow teenage friend from the D.C. scene, guitarist, Silver Springs, [MONTH]yland native, and also a student at SAIC, [PERSON_NAME_FULL_1_FEMALE] to fill out their three-piece. [BAND_NAME] formed in the summer of [YEAR] with Azita on bass, Zollinger on guitar, and [PERSON_NAME_LAST_0] on drums.\n"
   ]
}