{
   "Name": "Screamin' Sirens",
   "rawData": [
      "Screamin' Sirens was an American all-female band from Hollywood, California that recorded from 1983 to 1987. The band combined country music, punk rock, rockabilly and a dash of funk to create an eclectic wild party music.  Screamin' Sirens predated what is usually referred to as alternative country, but influenced that subgenre's development.\n",
      "Screamin' Sirens were formed in Hollywood, California in around 1983. The band was formed by vocalist Pleasant Gehman who recalled in a 1986 Flipside interview:\n",
      "I just wanted to have a really wild all-girl band that was like a gang or something. And Boom Boom  was the only drummer I could think of so even though we hated each other I wound up calling her anyway. We had all the same ideas about bands and life and drinking and everything."
   ],
   "infobox": {
      "Origin": [
         "Los Angeles"
      ],
      "Genres": [
         "Alternative country, cowpunk, post-punk, new wave"
      ],
      "Years active": [
         "1983–1987"
      ],
      "Past members": [
         "First stable line-up:",
         "Pleasant Gehman",
         " Diane Dixon (aka Boom Boom Laffoon)",
         "Rosie Flores",
         "Laura Bandit"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Hollywood, California that recorded from [YEAR] to [YEAR]. The band combined country music, punk rock, rockabilly and a dash of funk to create an eclectic wild party music.  [BAND_NAME] predated what is usually referred to as alternative country, but influenced that subgenre's development.\n",
      "[BAND_NAME] were formed in Hollywood, California in around [YEAR]. The band was formed by vocalist Pleasant Gehman who recalled in a [YEAR] Flipside interview:\n",
      "I just wanted to have a [GENRE] band that was like a gang or something. And Boom Boom  was the only drummer I could think of so even though we hated each other I wound up calling her anyway. We had all the same ideas about bands and life and drinking and everything."
   ]
}