{
   "Name": "Screamin' Sirens",
   "Sections": [
      "1 History",
      "2 Personnel",
      "3 Discography",
      "4 See also",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Screamin' Sirens was an American all-female band from Hollywood, California that recorded from 1983 to 1987. The band combined country music, punk rock, rockabilly and a dash of funk to create an eclectic wild party music.  Screamin' Sirens predated what is usually referred to as alternative country, but influenced that subgenre's development.\n"
      ]
   },
   "History": {
      "text": [
         "Screamin' Sirens were formed in Hollywood, California in around 1983. The band was formed by vocalist Pleasant Gehman who recalled in a 1986 Flipside interview:\n",
         "I just wanted to have a really wild all-girl band that was like a gang or something. And Boom Boom [Laffoon][1] was the only drummer I could think of so even though we hated each other I wound up calling her anyway. We had all the same ideas about bands and life and drinking and everything.[2]",
         "Laffoon had for three years previously been a member of the band Keith Joe Dick and the Goners.[2]  Two different guitar players joined, but soon left.[citation needed].  Then the band added guitarist Rosie Flores, namesake of the band Rosie and the Screamers, with whom Laffoon was acquainted from her time with Keith Joe Dick and the Goners.[2] The trio added bassist Laura Bandit, a veteran of the minor punk bands One Doesn't Swallow and Hard as Nails, Cheap as Dirt.[2] A fifth member of the group, Marsky Reins, played fiddle in addition to guitar, helping the band to achieve a signature punked up country and western sound.[citation needed]\n",
         "Sporting cowboy boots and western skirts, the band delivered a high energy live show. \"A lot of people tell us we've got more balls than any girl band they've seen because we get real wild onstage,\" Pleasant Gehman noted. \"We're not into wimpiness at all.\"[2]\n",
         "The band portrayed The She-Devils in Max Tash's film The Runnin' Kind,[3] which took its name from a song written by sister and brother Diane Boom Boom Dixon and Gary Dixon (Fur Dixon's husband).[4]\n",
         "The band had several lineup changes over the course of their existence, adding Miiko Watanabe on bass as well as former Pandoras drummer Casey Gomez.[citation needed]\n",
         "Original drummer and songwriter Diane 'Boom Boom' Dixon went on to play with the Baloney Heads and the Real Dixons in Austin, Texas. Pleasant Gehman became a writer and editor,  professional dancer [5] and a member of the Ringling Sisters. Rosie Flores went on to have a successful solo career in the alternative country and rockabilly scene.  Genny Schorr, the original guitar player, was also in the original line-up of all girl band Backstage Pass and was involved in The Masque. She later owned Rock clothing store Strait Jacket with Elvis Costello's manager Jake Riviera. She was associated with bands such as The Bangles as Stylist. Miiko Watanabe went on to play with American Girls. Fur Dixon went on to play in The Cramps, The Dixons, Fur Dixon and Blow Up, Fur Dixon and Steve Werner, and a new band she formed in 2015, WTFUKUSHIMA![citation needed]\n"
      ]
   },
   "Personnel": {},
   "Discography": {},
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Screamin' Sirens was an American all-female band from Hollywood, California that recorded from 1983 to 1987. The band combined country music, punk rock, rockabilly and a dash of funk to create an eclectic wild party music.  Screamin' Sirens predated what is usually referred to as alternative country, but influenced that subgenre's development.\n",
      "Screamin' Sirens were formed in Hollywood, California in around 1983. The band was formed by vocalist Pleasant Gehman who recalled in a 1986 Flipside interview:\n",
      "I just wanted to have a really wild all-girl band that was like a gang or something. And Boom Boom [Laffoon][1] was the only drummer I could think of so even though we hated each other I wound up calling her anyway. We had all the same ideas about bands and life and drinking and everything.[2]",
      "Laffoon had for three years previously been a member of the band Keith Joe Dick and the Goners.[2]  Two different guitar players joined, but soon left.[citation needed].  Then the band added guitarist Rosie Flores, namesake of the band Rosie and the Screamers, with whom Laffoon was acquainted from her time with Keith Joe Dick and the Goners.[2] The trio added bassist Laura Bandit, a veteran of the minor punk bands One Doesn't Swallow and Hard as Nails, Cheap as Dirt.[2] A fifth member of the group, Marsky Reins, played fiddle in addition to guitar, helping the band to achieve a signature punked up country and western sound.[citation needed]\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles"
      ],
      "Genres": [
         "Alternative country, cowpunk, post-punk, new wave"
      ],
      "Years active": [
         "1983–1987"
      ],
      "Past members": [
         "First stable line-up:",
         "Pleasant Gehman",
         " Diane Dixon (aka Boom Boom Laffoon)",
         "Rosie Flores",
         "Laura Bandit"
      ]
   }
}