{
   "Name": "Flipper (band)",
   "rawData": [
      "Flipper is an American rock band formed in San Francisco, California in 1979, continuing in often erratic fashion until the mid-1990s, then reuniting in 2005. The band influenced a number of grunge, punk rock and noise rock bands. Their slowed-down, bass-driven and heavily distorted style of punk is considered to have inspired bands such as the Melvins and Nirvana, whose bass player Krist Novoselic played with the band in the 2000s.\n",
      "Flipper was founded by former Sleepers member Ricky Williams (vocals), former Rad Command member Ted Falconi (guitar), and former Negative Trend members Will Shatter (bass) and Steve DePace (drums). Founding member and original vocalist Williams was credited for naming the band, but was fired before it made any recordings. Bruce “Loose” Calderwood replaced Williams and he and Shatter then went on to trade vocal and bass duties, with both bringing a bass onstage. Falconi, a Vietnam War veteran, played a uniquely distorted style of guitar.\n",
      "Flipper's first recordings appeared in late 1979 on the SF Underground 7\" EP released on the newly formed Subterranean Records, followed by the \"Love Canal\"/\"Ha Ha Ha\" 7\" single in 1980.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, U.S."
      ],
      "Genres": [
         "Noise rock, punk rock, post-punk, hardcore punk, experimental rock, lo-fi"
      ],
      "Years active": [
         "1979–1987, 1990–1993, 2005–present"
      ],
      "Labels": [
         "Subterranean, Alternative Tentacles, ROIR, American, Domino"
      ],
      "Associated acts": [
         "The Sleepers, Rad Command, Negative Trend, A3I, Nirvana, Frightwig, Mudwimin, Van Gough's Daughter, Scratch Acid, The Jesus Lizard, Minutemen"
      ],
      "Website": [
         "flipperrules.com"
      ],
      "Members": [
         "Ted Falconi",
         "Steve DePace",
         "Rachel Thoele"
      ],
      "Past members": [
         "Will Shatter (died 1987)",
         "Ricky Williams (died 1992)",
         "Bruce Loose",
         "John Dougherty (died 1997)",
         "Krist Novoselic",
         "Bruno DeSmartass",
         "Mike Watt",
         "David Yow"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in San Francisco, California in [YEAR], continuing in often erratic fashion until the mid-[YEAR]s, then reuniting in [YEAR]. The band influenced a number of grunge, punk rock and noise rock bands. Their slowed-down, bass-driven and heavily distorted style of punk is considered to have inspired bands such as the Melvins and Nirvana, whose bass player Krist [MONTH]oselic played with the band in the [YEAR]s.\n",
      "[BAND_NAME] was founded by former Sleepers member Ricky Williams (vocals), former Rad Command member [PERSON_NAME_FULL_1_MALE] (guitar), and former Negative Trend members Will Shatter (bass) and [PERSON_NAME_FULL_0_MALE] (drums). Founding member and original vocalist Williams was credited for naming the band, but was fired before it made any recordings. Bruce “Loose” Calderwood replaced Williams and he and Shatter then went on to trade vocal and bass duties, with both bringing a bass onstage. [PERSON_NAME_LAST_1], a Vietnam War veteran, played a uniquely distorted style of guitar.\n",
      "[BAND_NAME]'s first recordings appeared in late [YEAR] on the SF Underground 7[SONG_NAME] single in [YEAR].\n"
   ]
}