{
   "Discography": {
      "Collections": {},
      "Singles": {},
      "Studio albums": {},
      "Tribute albums": {},
      "Various artists compilations": {}
   },
   "External links": {},
   "History": {
      "Career": {
         "text": [
            "The conceptual beginning of the Shaggs came from Austin Wiggin's mother who, when her son was young, had predicted during a palmreading that he would marry a strawberry blonde woman, that he would have two daughters after she had died, and that his daughters would form a popular music group. The first two predictions proved accurate, so Austin set about making the third come true as well.[8] Austin withdrew his daughters from school, bought them instruments, and arranged for them to receive music and vocal lessons. The Wiggin sisters themselves never planned to become a music group, but as Dot later said, \"[Austin] was something of a disciplinarian. He was stubborn and he could be temperamental. He directed. We obeyed. Or did our best.\"[9] Austin named the Shaggs after the popular shag hairstyle and as a reference to shaggy dogs.[9] In 1968, Austin arranged for the girls to play a regular Saturday night gig at the Fremont, New Hampshire, Town Hall.\n",
            "On the topic of the album, Cub Koda wrote, \"There's an innocence to these songs and their performances that's both charming and unsettling. Hacked-at drumbeats, whacked-around chords, songs that seem to have little or no meter to them ... being played on out-of-tune, pawn-shop-quality guitars all converge, creating dissonance and beauty, chaos and tranquility, causing any listener coming to this music to rearrange any pre-existing notions about the relationships between talent, originality, and ability. There is no album you might own that sounds remotely like this one.\"[10] A 2017 review of their work in The New Yorker noted that, while Dot and Betty Wiggin had written out their songs and had musical chemistry, Helen, the drummer, was often completely detached from what her sisters were playing.[11]\n",
            "At this point, the man who had promised to press 1,000 copies of Philosophy of the World reportedly absconded with 900 of them, as well as with the money paid to him. The rest were circulated to New England radio stations but attracted little attention, and Austin's dreams of superstardom for his girls were dashed. The band members themselves were appalled at how horrible the record sounded to them; years later, when it became popular, they were bewildered as to why.[11]\n"
         ]
      },
      "In popular culture": {},
      "Rediscovery": {
         "text": [
            "The most likely first instance of widespread publicity for the Shaggs was on the Dr. Demento show. In an early-1970s Dr. Demento show, Frank Zappa was a guest and was playing some of his favorite songs. He played a couple of Shaggs songs, and professed his love for the album.[12] Original pressings are now quite valuable and highly sought after among rare record collectors.\n",
            "In 1980, Terry Adams and Tom Ardolino, of the band NRBQ, who owned an original copy of the LP and were fans of the music, convinced their record label, Rounder Records, to reissue Philosophy of the World. Upon the LP's release, Rolling Stone magazine accorded the Shaggs \"Comeback of the Year\" honors.[13] The album was widely, if derisively, reviewed. Adams and Ardolino issued some unreleased 1975 recordings on the 1982 LP Shaggs' Own Thing, but its closer approximation to conventional music caused some to disregard this collection. In 1988 Dorothy Wiggin rediscovered the lost masters of Philosophy of the World in a closet; these and the tracks from Shaggs' Own Thing were remastered and released on Rounder as a self-titled compilation, which had a resequencing of all tracks.\n",
            "Kurt Cobain ranked Philosophy of the World No. 5 on his 50 best albums list.[citation needed]\n",
            "The Shaggs are referenced in the 1995 Warner Bros. motion picture Empire Records. Robin Tunney's character Debra asks James 'Kimo' Wills' character Eddie if he has Philosophy of the World on 45 rpm single. Tunney's character also makes an unsubstantiated claim that their second album was stolen prior to release and never recovered. The Dead Milkmen also reference the Shaggs at length on their 1995 song \"When I Get To Heaven\".[citation needed]\n",
            "RCA Victor released Philosophy of the World (with the original track sequence) on CD in 1999. (The reissue was co-produced by Terry Adams and Irwin Chusid; the latter also wrote new liner notes.)[14] The Wall Street Journal reviewed the CD on the day it was released. The New Yorker subsequently ran a lengthy profile of the Shaggs by staff writer Susan Orlean, who repeats the common falsehood that Frank Zappa called the Shaggs \"better than the Beatles\". (The quote originated in the headline of a Lester Bangs review of Philosophy of the World, which ran in The Village Voice, January 28, 1981. The full headline was \"The Shaggs: Better Than the Beatles (and DNA, Too).\")[15]  Orlean alludes to an online review by a writer who describes the album as \"hauntingly bad\".[16]\n",
            "The Shaggs played at the NRBQ 30th Anniversary celebration held at The Bowery Ballroom in New York City November 20 & 21, 1999.[17] In 2001, the Animal World label released Better Than The Beatles, a Shaggs tribute album. The title was based on the title of an article by Lester Bangs in which he described the importance of what the Shaggs accomplished musically. The album featured established acts such as Ida, Optiganally Yours, R. Stevie Moore, Deerhoof and Danielson Famille covering the Shaggs' songs.\n",
            "Dot Wiggin released a solo album, Ready! Get! Go!, on Alternative Tentacles Records on October 29, 2013.[18] The album contains new recordings of previously unrecorded Shaggs songs as well as new songs Wiggin wrote with her band.[18] Helen Wiggin died in 2006. She was survived by her two sons.[19] The widow of Austin Wiggin, Jr., Annie Wiggin, died in 2005.[20] On February 17, 2017, the Shaggs announced a reunion show at the Solid Sound Festival in June curated by Wilco.[5]\n"
         ]
      }
   },
   "Members": {
      "Timeline": {}
   },
   "Notes": {},
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Career",
      "1.2 Rediscovery",
      "1.3 In popular culture",
      "2 Members",
      "2.1 Timeline",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Collections",
      "3.3 Singles",
      "3.4 Tribute albums",
      "3.5 Various artists compilations",
      "4 References",
      "5 Notes",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Shaggs were an American all-female rock and outsider music band formed in Fremont, New Hampshire, in 1968. The band was composed of sisters Dorothy \"Dot\" Wiggin (vocals/lead guitar), Betty Wiggin (vocals/rhythm guitar), Helen Wiggin (drums) and, later, Rachel Wiggin (bass).\n",
         "The Shaggs were formed by Dot, Betty and Helen in 1968, on the insistence of their father, Austin Wiggin, who believed that his mother had predicted the band's rise to stardom. The band's only studio album, Philosophy of the World, was released in 1969. The album failed to garner attention, though the band continued to exist as a locally popular live act. The Shaggs disbanded in 1975 after the death of Austin.\n",
         "The band is primarily notable today for their perceived ineptitude at playing conventional rock music; the band was described in one Rolling Stone article as \"sounding like lobotomized Trapp Family singers.\"[6] Terry Adams of NRBQ compared the group's melodic lines and structures to the free jazz compositions of Ornette Coleman.[7]\n"
      ]
   },
   "Title": "The Shaggs - Wikipedia"
}