{
   "Name": "Shit & Chanel",
   "rawData": [
      "Shit & Chanel (in its last year of existence Shit & Chalou) was a Danish girl band in pop rock and folk rock established in 1974. The Aarhus-based band was made up of Anne Linnet, Astrid Elbek, Lis Sørensen, Lone Poulsen and Ulla Tvede Eriksen.\n",
      "In the early 1970s, Anne Linnet used to be in the band Tears along with her husband Holger Laumann. Holger had the idea of a girl band and suggested two recruits from Århus Friskole (Århus Free School), namely Astrid Elbæk and Ulla Tvede Eriksen to join Anne to form a band. Soon Lis Sørensen also joined in. They practiced at Ulla's parents house near Brabrand Lake in Aarhus.\n",
      "In 1975 there they took part in women-only Kvindefestival i Fælledparken in Copenhagen. After black American activist Angela Davis spoke, Shit & Chanel came on stage with an accompanying male-band Delta Blues Band playing for them, which immediately brought protests against the band by liberation movement organizers who had specified that this was an all-women event.\n"
   ],
   "infobox": {
      "Origin": [
         "Aarhus, Denmark"
      ],
      "Genres": [
         "Pop rock, folk rock"
      ],
      "Years active": [
         "1974-1979: Shit and Chanel ",
         "1980-1981: Shit & Chalou"
      ],
      "Past members": [
         "Anne Linnet ",
         " Astrid Elbek ",
         " Ulla Tvede Eriksen"
      ]
   },
   "albums": [
      "Shit & Chanel",
      "Chanel no. 5",
      "Tak for sidst",
      "Dagen har så mange farver"
   ],
   "prunedData": [
      "[BAND_NAME] (in its last year of existence Shit & Chalou) was a [GENRE] band in pop rock and folk rock established in [YEAR]. The Aarhus-based band was made up of Anne Linnet, [PERSON_NAME_FULL_1_FEMALE], Lis Sørensen, [PERSON_NAME_FULL_2_FEMALE] and [PERSON_NAME_FULL_0_FEMALE].\n",
      "In the early [YEAR]s, Anne Linnet used to be in the band Tears along with her husband [PERSON_NAME_FULL_1_MALE]. [PERSON_NAME_FIRST_1] had the idea of a [GENRE] band and suggested two recruits from Århus Friskole (Århus Free School), namely [PERSON_NAME_FULL_2_FEMALE] and [PERSON_NAME_FULL_0_FEMALE] to join Anne to form a band. Soon Lis Sørensen also joined in. They practiced at [PERSON_NAME_FIRST_0]'s parents house near Brabrand Lake in Aarhus.\n",
      "In [YEAR] there they took part in women-only Kvindefestival i Fælledparken in Copenhagen. After black American activist Angela Davis spoke, [BAND_NAME] came on stage with an [GENRE] band by liberation movement organizers who had specified that this was an all-women event.\n"
   ]
}