{
   "Biography": {
      "text": [
         "Sisters Delilah and Ursula Holliday had played together in a two piece called Typical Girls, before forming Skinny Girl Diet with their cousin Amelia Cutler around 2010 whilst all were in their early teens.[1][2] The name is a reference to feminist critique of the dieting industry.[1] Amelia left the band in 2017; the Holliday sisters continue as a two piece.\n",
         "Skinny Girl Diet performed their first gig in their early teens as the opening act for former Slits guitarist Viv Albertine.[3] Since then, they have become known for bringing an updated approach to the feminist art punk ideals associated with the riot grrrl Movement of the 1990s.[4] They have been vocal about addressing the lack of female musicians that still exists in today's music industry, as well as other issues of equality under a contemporary feminist context.[5]\n",
         "The group also contributed work to the \"Female Matters\" exhibition to raise funds and awareness about the fight against FGM.[6]\n",
         "In 2015, they were featured on Billboard.com's list of \"20 All-Female Bands You Need To Know.\" and featured on the cover of The Beat Magazine's Spring Issue.[7][8]\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Extended plays": {},
      "Split releases": {}
   },
   "Influences": {
      "text": [
         "The band cites a range of musical influences, ranging from Japanese metal, punk, to David Bowie.[9] Their influences also include Clara Rockmore, Sister Rosetta Tharpe, Memphis Minnie, MC5, Pussy Galore and The Breeders.[10]\n"
      ]
   },
   "References": {},
   "Releases": {
      "text": [
         "Skinny Girl Diet released a split EP with the Ethical Debating Society in 2013, on HHBTM Records, featuring Skinny Girl Diet's tracks \"DMT\" and \"Homesick\".[11]\n",
         "In July 2014, Skinny Girl Diet released their EP \"Girl Gang State of Mind.\" They have collaborated with fashion designer Claire Barrow and the pop-punk band Matches, along with producing various DIY zines.[10]\n",
         "In March 2015, Skinny Girl Diet released \"Nadine Hurley\" as part of Faris Badwan's Raft Records EP1, along with fellow London bands Niqab, Puffer, and Jet Black.[12]\n",
         "Their third self-released EP, Reclaim Your Life was released October 16, 2015 on Fiasco Recordings.[13]\n",
         "Their first full-length album was released in September 2017.[1]\n"
      ]
   },
   "Sections": [
      "1 Biography",
      "2 Influences",
      "3 Releases",
      "4 Discography",
      "4.1 Albums",
      "4.2 Extended plays",
      "4.3 Split releases",
      "5 References"
   ],
   "Summary": {
      "text": [
         "Skinny Girl Diet is a British political punk band, often described as riot grrrl, formed in London, England. The group consists of singer, songwriter and guitarist Delilah Holliday and drummer Ursula Holliday.\n"
      ]
   },
   "Title": "Skinny Girl Diet - Wikipedia"
}