{
   "Name": "Chaos Chaos",
   "Sections": [
      "1 History",
      "1.1 Smoosh: 2000–2012",
      "1.2 Chaos Chaos: 2012–present",
      "2 Members",
      "3 Discography",
      "3.1 As Smoosh",
      "3.2 As Chaos Chaos",
      "4 Gallery",
      "5 Notes",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Chaos Chaos is an American indie synthpop band based in Brooklyn, New York. The band was formed in Seattle under the name Smoosh in 2000 and adopted their current name in 2012. The band consists of two sisters, who founded the band as children: singer/keyboardist Asya \"Asy\" Saavedra (born February 2, 1992) and drummer Chloe Saavedra (born March 5, 1994). They released three LPs as Smoosh, and have produced two further EPs, several singles, and a fourth full-length album as Chaos Chaos.\n"
      ]
   },
   "History": {
      "Smoosh: 2000–2012": {
         "text": [
            "Smoosh started in 2000 when the family was at a Seattle music store The Trading Musician, standing in line to restring a violin. Asy and Chloe wandered into the drum section of the store, where Chloe met Jason McGerr, the drummer for Death Cab for Cutie. The family eventually left with a $600 drum kit for Chloe, McGerr's card from the Seattle Drum School, \"and no violin.\"[4] When McGerr learned that Asy had been playing the piano and writing songs since she was very young, he offered to help them both. Neither Asy nor Chloe read music.[5] Asy began piano training but soon quit because she found it boring.[4]\n",
            "—Asya on the band name's origin in a 2005 interview.[6]\n",
            "In 2000, Smoosh released Tomato Mistakes, a two-track single that they mailed free of charge to anyone who wanted it.[4] Four years later, in September 2004, Smoosh's full-length debut She Like Electric was released under Pattern 25 Records. By the time Smoosh released their second LP, on June 6, 2006, titled Free to Stay, they were signed to Seattle-based indie label Barsuk Records. Its third and title track, \"Free to Stay\", was an early song featured on Tomato Mistakes. Asy also plays guitar on the track 'Waiting for Something' off Free to Stay. The second album also features the song \"Find A Way\" which Smoosh performed on Jimmy Kimmel Live! on July 12, 2006, marking their first performance on late night TV.[7]  As they toured with the Eels as part of a world tour in mid-2006, they are also featured on the California-based band's live DVD/CD Live and in Person! London 2006.\n",
            "On August 5, 2007, Smoosh performed at Lollapalooza 2007 at Chicago's Grant Park. Their set included a cover of \"This Modern Love\" by Bloc Party, whom they would later tour with that same year in September. Earlier that year, they also performed a headlining spring tour on the east coast with The Postmarks. The band played \"Pajama Party Time\" on Zoom episode 20 of Season 4, originally broadcast in 2002, and again in episode 5 of season 1 of Yo Gabba Gabba in 2007. The Saavedra sisters have been the only members of the band. Their younger sister, Maia Saavedra, played bass for them in 2007.[2][3]\n",
            "As Smoosh, critics compared the band's sound to that of Tori Amos and PJ Harvey, and were impressed with the young writers and performers.[8][9][10] Smoosh opened for many leading Pacific Northwest bands including Pearl Jam,[6][4] Death Cab for Cutie,[4] Sleater-Kinney,[6][4] and the Presidents of the United States of America,[6][4] as well as for other acts such as Mates of State,[4] Jimmy Eat World,[4] Cat Power[4] (who also covered their song \"Rad\"),[6] Nada Surf, Sufjan Stevens and The Go! Team. Asy collaborated with Seattle indie band Head Like a Kite to create the songs \"Noisy at the Circus\" (which can be found on Head Like a Kite's first album Random Portraits of the Home Movie), \"Daydream Vacation\" (which can be found on their second album There Is Loud Laughter Everywhere), and \"Let's Start It All Again\" (which can be found on their album Dreams Suspend Night, and also available via the KEXP Song of the Day website).[11] Asy also lends her voice to the soundtrack of the musical film God Help the Girl created by Stuart Murdoch of Belle & Sebastian, where she sings on the songs \"I Just Want Your Jeans\" and \"A Down and Dusky Blonde\".  She also provided the vocals on the song \"I Fell for the Fall\" by Swedish band Karma Tree. In early 2008, they toured with Tokyo Police Club and The Dresden Dolls. In June 2010, Smoosh released their third album, Withershins (previously titled The World's Not Bad).\n"
         ]
      },
      "Chaos Chaos: 2012–present": {
         "text": [
            "In 2012 the Saavedras changed the band's name to Chaos Chaos, abandoning the name \"Smoosh\" because the term had become associated with Nicole \"Snooki\" Polizzi after an episode of South Park.[3] Their current name is derived from a historical scientific name for a species of amoeba, which they liken to their music as it is \"simple but always changing\".[12][13]\n",
            "Chaos Chaos released an EP, S, on October 16, 2012.[14] On February 23, 2013, they released a single, \"In This Place.\"[15] On October 7, 2014, Chaos Chaos released another EP, Committed to the Crime. One of its tracks, \"Do You Feel It?\", was featured in the Rick and Morty season two episode \"Auto Erotic Assimilation.\"[16] This brought the band a lot of recognition. Chaos Chaos provided vocals to George Watsky on the song \"Brave New World\" off of his album x Infinity, which released on August 19, 2016. On August 27, 2017, the duo released the single \"Terryfold\", which features lead vocals from Rick and Morty co-creator and voice actor Justin Roiland, who was a longtime fan.[16] The song became the band's first charting single when it debuted at #33 on the Billboard Hot Rock Songs chart in September 2017.[17]\n",
            "After releasing the singles \"Dripping with Fire\" and \"On Turning 23\" in late 2017[18][19] and \"Pink Politics\" in April 2018, the band released the full-length album Chaos Chaos on May 15, 2018.[20] To promote the album, they also began headlining their first nationwide tour on April 12 of that year.[20]\n",
            "At the request of Kim Kardashian West, Chaos Chaos and Justin Roiland collaborated a second time to produce a song for Kanye West (a fan of Rick and Morty) as a birthday present. It was released on West's forty-first birthday, June 8, 2018, as a single called \"Kanye's B-Day Song\" featuring Rick and Morty.[21]\n",
            "In 2019, the band released three singles that are currently unattached to any album: \"Armed and Dangerous,\"[22] \"Theaters,\"[23] and \"Improv Song.\"[24]\n"
         ]
      }
   },
   "Members": {},
   "Discography": {
      "As Smoosh": {},
      "As Chaos Chaos": {}
   },
   "Gallery": {
      "text": [
         "Chloe and Asya, 2007\n",
         "Maia, 2007\n",
         "Chloe, 2006\n",
         "Asya, 2007\n"
      ]
   },
   "Notes": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Chaos Chaos is an American indie synthpop band based in Brooklyn, New York. The band was formed in Seattle under the name Smoosh in 2000 and adopted their current name in 2012. The band consists of two sisters, who founded the band as children: singer/keyboardist Asya \"Asy\" Saavedra (born February 2, 1992) and drummer Chloe Saavedra (born March 5, 1994). They released three LPs as Smoosh, and have produced two further EPs, several singles, and a fourth full-length album as Chaos Chaos.\n",
      "Smoosh started in 2000 when the family was at a Seattle music store The Trading Musician, standing in line to restring a violin. Asy and Chloe wandered into the drum section of the store, where Chloe met Jason McGerr, the drummer for Death Cab for Cutie. The family eventually left with a $600 drum kit for Chloe, McGerr's card from the Seattle Drum School, \"and no violin.\"[4] When McGerr learned that Asy had been playing the piano and writing songs since she was very young, he offered to help them both. Neither Asy nor Chloe read music.[5] Asy began piano training but soon quit because she found it boring.[4]\n",
      "—Asya on the band name's origin in a 2005 interview.[6]\n",
      "In 2000, Smoosh released Tomato Mistakes, a two-track single that they mailed free of charge to anyone who wanted it.[4] Four years later, in September 2004, Smoosh's full-length debut She Like Electric was released under Pattern 25 Records. By the time Smoosh released their second LP, on June 6, 2006, titled Free to Stay, they were signed to Seattle-based indie label Barsuk Records. Its third and title track, \"Free to Stay\", was an early song featured on Tomato Mistakes. Asy also plays guitar on the track 'Waiting for Something' off Free to Stay. The second album also features the song \"Find A Way\" which Smoosh performed on Jimmy Kimmel Live! on July 12, 2006, marking their first performance on late night TV.[7]  As they toured with the Eels as part of a world tour in mid-2006, they are also featured on the California-based band's live DVD/CD Live and in Person! London 2006.\n"
   ]
}