{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "Spitboy was founded by drummer Michelle \"Todd\" Gonzales, vocalist Adrienne Droogas, bassist Paula, and guitarist Karin Gembus. Paula left the band before the release of the Rasana 7\" EP and was replaced by Dominique Davison.\n",
         "The band toured the United States, Europe, Australia, New Zealand, and Japan.  Their records were released on prominent punk rock labels Lookout Records, Allied Recordings, and Ebullition Records, including a split LP with the Chicago-based hardcore group Los Crudos.\n",
         "After the breakup of the group, Davison, Gonzales, and Gembus played together in the group Instant Girl, whose sound was less aggressive than that of Spitboy.  Instant Girl released an LP on Allied Recordings.  Droogas was briefly a member of the group Aus Rotten before moving to Richmond, Virginia.  She also wrote columns for the punk zines Heartattack and Profane Existence.  Davison is now an architect and owner of Draw in Kansas City.  Gonzales teaches English at Las Positas College in Livermore, California, has published zines and memoirs on her time in Spitboy, and has a son.\n"
      ]
   },
   "Origin of name": {
      "text": [
         "The word spitboy has more than one possible origin:[citation needed] it might designate a turnbrooch (a type of kitchen boy). The band makes a reference to the book Daughters of Copper Woman, by Anne Cameron, in which a Pacific Northwest tribe's saga refers to a young woman who put all the self-hatred she felt for her own secretions (tears, sweat, mucus, menstrual blood) into fashioning a Snotboy/Spitboy, which she buried in the dirt. The young woman's journey to accept and embrace herself seems to parallel the concise social commentaries and struggle for awareness for which Spitboy the band fought.\n"
      ]
   },
   "Sections": [
      "1 History",
      "2 Origin of name",
      "3 Discography",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Spitboy was an American anarcho-punk band founded in the San Francisco bay area, in California in 1990.  The all-female band aggressively criticized patriarchy and gender roles but did not associate with the contemporaneous riot grrrl movement.  They released several records and toured extensively before disbanding in 1995. Members later played in the bands Instant Girl and Aus Rotten, while drummer Michelle Cruz Gonzales and vocalist Adrienne Droogas have been active as writers.\n"
      ]
   },
   "Title": "Spitboy - Wikipedia"
}