{
   "Name": "Splendora",
   "rawData": [
      "Splendora were an American all-female alternative rock band from New York City. Formed in 1993 by Janet Wygal (lead vocals, guitar), Tricia Wygal (lead vocals, bass), Delissa Santos (drums), Cindy Brolsma (cello), and Jennifer Richardson (violin), the band released one studio album, 1995's In the Grass, before disbanding in 2002.\n",
      "The band is best known for performing \"You're Standing on My Neck\", which was featured as the opening theme to the MTV animated series Daria. Splendora also performed \"Turn the Sun Down\" and \"College Try\" for the Daria television films Is It Fall Yet? and Is It College Yet?, respectively.\n",
      "After the break up of her power pop band The Wygals, Janet Wygal began recreationally composing music with her sister Tricia Wygal. By 1993, these music sessions expanded to include friends of the two sisters, namely Delissa Santos, Cindy Brolsma, and Jennifer Richardson. In an interview with Billboard, Tricia Wygal described the formation of the band to be a \"labor of love\", recalling that \" rehearsed all the time. It was just fun\".\n"
   ],
   "infobox": {
      "Origin": [
         "New York City, New York, United States"
      ],
      "Genres": [
         "Alternative rock",
         "grunge"
      ],
      "Years active": [
         "1993–2002"
      ],
      "Labels": [
         "Koch"
      ],
      "Associated acts": [
         "The Individuals",
         "The Wygals",
         "Zuzu's Petals",
         "Steve Wynn"
      ],
      "Past members": [
         "Janet Wygal",
         "Tricia Wygal",
         "Delissa Santos",
         "Cindy Brolsma",
         "Jennifer Richardson"
      ]
   },
   "prunedData": [
      "[BAND_NAME] were an [GENRE] band from New York City. Formed in [YEAR] by [MONTH]et [PERSON_NAME_LAST_0] (lead vocals, guitar), [PERSON_NAME_FULL_0_FEMALE] (lead vocals, bass), Delissa Santos (drums), [PERSON_NAME_FULL_1_FEMALE] (cello), and Jennifer Richardson (violin), the band released one studio album, [YEAR]'s In the Grass, before disbanding in [YEAR].\n",
      "The band is best known for performing \"You're Standing on My Neck\", which was featured as the opening theme to the MTV animated series Daria. [BAND_NAME] also performed \"Turn the Sun Down\" and \"College Try\" for the Daria television films Is It Fall Yet? and Is It College Yet?, respectively.\n",
      "After the break up of her power pop band The [PERSON_NAME_LAST_0]s, [MONTH]et [PERSON_NAME_LAST_0] began recreationally composing music with her sister [PERSON_NAME_FULL_0_FEMALE]. By [YEAR], these music sessions expanded to include friends of the two sisters, namely Delissa Santos, [PERSON_NAME_FULL_1_FEMALE], and Jennifer Richardson. In an interview with Billboard, [PERSON_NAME_FULL_0_FEMALE] described the formation of the band to be a \"labor of love\", recalling that \" rehearsed all the time. It was just fun\".\n"
   ]
}