{
   "Name": "Stereopony",
   "Sections": [
      "1 Members",
      "2 History",
      "2.1 2007–2010",
      "2.2 2011–2012",
      "3 Discography",
      "4 References",
      "5 Further reading",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Stereopony (ステレオポニー, Sutereoponī) was a Japanese pop rock band that formed in Okinawa, Japan in 2007 and disbanded in 2012. The three-girl band consisted of Aimi Haraguni (lead vocals and guitar), Nohana Kitajima (bass guitar), and Shiho Yamanoha (drums). They were signed to the Sony Records music label.[1] The band released 11 singles and three studio albums.\n"
      ]
   },
   "Members": {},
   "History": {
      "2007–2010": {
         "text": [
            "Before their major debut, the band was named Mixbox. Under that name, the girls won the grand prize at the 2007 Young People Music Festival. Later, they renamed the band Stereopony and took part in the 2008 Okinawa Sound Stage with the song \"Sayonara no Kisetsu\" (さよならの季節), which was supposed to be released as their debut single on September 24, 2008 but was canceled. The band gained their first opportunity on the Japanese rock radio program School of Lock!.\n",
            "Their major debut was officially announced in June 2008.[2] Their song \"Hitohira no Hanabira\" was the 17th ending theme for the anime series Bleach.[3] The single was released on November 5, 2008.[3] It ranked No. 25 on the Oricon weekly singles chart and won second place in Rocochoku's Newcomer Competition in the same month.[4][5] Their second single was \"Namida no Mukou\", released on February 11, 2009, which was used as the second opening theme for the second season of the Mobile Suit Gundam 00 anime series. Their third single, \"I Do It\", is a collaboration with fellow Sony Music Japan singer Yui,[6] and was released on April 22, 2009. Yui's musical producer, Hisashi Kondo, produced and directed the single.[7][8]\n",
            "On March 21, 2009, the band performed at SXSW 2009 in Austin, Texas as part of the Japan Nite event.[9] A few months later, Stereopony released their debut album, Hydrangea ga Saiteiru. It debuted at No. 7 on the Oricon weekly album chart.[10] The song \"Seishun ni, Sono Namida ga Hitsuyou da!\" from the album was featured in a Japanese Lipton iced tea TV commercial.[11] Shortly after, the band went on their first tour, A Hydrangea Blooms. Along with the tour goods, there were 50 signed Score Band books in each venue for purchase. In August 2009, Stereopony released their fourth single, \"Smilife\". \"Smilife\" was used as the theme song for the 2009 anime film Yatterman: Shin Yatter Mecha Daishūgō! Omocha no Kuni de Daikessen da Koron!. Their fifth single, \"Tsukiakari no Michishirube\", was released on November 4, 2009. \"Tsukiakari no Michishirube\" was the opening theme to the 2009 anime series Darker than Black: Ryūsei no Gemini. It was their second single to reach the top ten Oricon singles chart, peaking at No. 8. Stereopony's sixth single, \"Hanbunko\", was released on September 17, 2010; \"Hanbunko\" is a cover originally released by Bivattchee in 2002. Stereopony's seventh single, \"Over Drive\", was released on May 12, 2010, and was used for the opening theme for the Japanese drama Pro Golfer Hana.\n",
            "In June 2010, Stereopony released their second studio album, Over The Border, and performed at AnimeNEXT, the first anime convention the band performed at in the United States. Over The Border was released on June 9, 2010, and ranked No. 12 on Oricon. Stereopony's national tour, Stereopony TOUR 2010 'Over The Border' (which was planned to start on July 26), was postponed due to Shiho's aggravated tendinitis.[12] Their eighth single, \"Chiisana Mahō\", was released on December 8, 2010, and the title song was used as the first opening theme for the anime Tegami Bachi: Reverse.\n"
         ]
      },
      "2011–2012": {
         "text": [
            "On January 14, 2011, fellow all-girl rock band and label mate Scandal announced on their official Twitter account that Stereopony and Scandal would be performing at Shibuya-AX with supporting acts from ByeByeBoy, Cossami and Hi-Lab. This collaboration, Band Yarō!! Vol. 2 (バンドやろうよ!! Vol.2), was scheduled for March 11, 2011.[13] However, due to the \"2011 Tōhoku earthquake\",[14] the performance was postponed to June 26, 2011.[15] Stereopony performed at Anime Boston 2011 as special guests at the Hynes Convention Center on April 23. They played a wide selection of songs from both albums and their latest single, as well as a cover of Green Day's \"American Idiot\".[16][17] Shortly after returning from their appearance at Anime Boston, the group announced they would be providing the theme song to the 2011 film Tengoku kara no Yell (天国からのエール).[18] Stereopony attended a press release event for the upcoming film, for which they are providing the theme song.[19]\n",
            "Stereopony collaborated with the band Kariyushi58 to produce the single \"Tatoeba Utaenakunattara\" (たとえば唄えなくなったら), released on August 10, 2011.[20] Stereopony contributed the song \"Akashi\" (証) on the Zone tribute album Zone Tribute: Kimi ga Kureta Mono (ZONEトリビュート～君がくれたもの～), released on August 10, 2011;[21] \"Akashi\" is a cover of Zone's 2002 single. On July 16, 2011, Aimi officially started an Ameblo blog.[22] The band's tenth single, \"Arigatō\" (ありがとう), was released on September 28, 2011. The music video for \"Arigatō\", released on September 1, 2011, features film actor Hiroshi Abe; he is also on the cover of the version B release of the single.[23][24] Stereopony released their third studio album, More! More!! More!!!, on December 7, 2011. Their song \"I Am A Hero\" from the album was featured as the third ending theme of Pokémon Smash!.\n",
            "Their 11th single, \"Stand By Me\", was released on May 30, 2012; the title song was used as the ending theme of Eureka Seven: AO. Stereopony attended as special guests for Anime Festival Asia: Indonesia 2012.[25] Stereopony contributed the song \"Again\" on the Yui tribute album She Loves You, released on October 24, 2012; \"Again\" is a cover of Yui's 2009 single. After the band took a one-month break during Aimi's throat polyp surgery, the members decided to disband in October 2012.[26] Their 12th and final single \"Namida Nante Mishite Yannai\" (涙なんて見してやんない) was released as the split single \"Just Rock With Me / Namida Nante Mishite Yannai\". \"Just Rock With Me\" is the debut single of Evanpony, a band consisting of the members of Stereopony and Evan Taubenfeld. A compilation album titled Best of Stereopony was released on November 21, 2012. Stereopony's farewell concert was at Akasaka Blitz in Tokyo on December 27, 2012.[27]\n"
         ]
      }
   },
   "Discography": {},
   "References": {},
   "Further reading": {},
   "External links": {},
   "coreData": [
      "Stereopony (ステレオポニー, Sutereoponī) was a Japanese pop rock band that formed in Okinawa, Japan in 2007 and disbanded in 2012. The three-girl band consisted of Aimi Haraguni (lead vocals and guitar), Nohana Kitajima (bass guitar), and Shiho Yamanoha (drums). They were signed to the Sony Records music label.[1] The band released 11 singles and three studio albums.\n",
      "Before their major debut, the band was named Mixbox. Under that name, the girls won the grand prize at the 2007 Young People Music Festival. Later, they renamed the band Stereopony and took part in the 2008 Okinawa Sound Stage with the song \"Sayonara no Kisetsu\" (さよならの季節), which was supposed to be released as their debut single on September 24, 2008 but was canceled. The band gained their first opportunity on the Japanese rock radio program School of Lock!.\n",
      "Their major debut was officially announced in June 2008.[2] Their song \"Hitohira no Hanabira\" was the 17th ending theme for the anime series Bleach.[3] The single was released on November 5, 2008.[3] It ranked No. 25 on the Oricon weekly singles chart and won second place in Rocochoku's Newcomer Competition in the same month.[4][5] Their second single was \"Namida no Mukou\", released on February 11, 2009, which was used as the second opening theme for the second season of the Mobile Suit Gundam 00 anime series. Their third single, \"I Do It\", is a collaboration with fellow Sony Music Japan singer Yui,[6] and was released on April 22, 2009. Yui's musical producer, Hisashi Kondo, produced and directed the single.[7][8]\n",
      "On March 21, 2009, the band performed at SXSW 2009 in Austin, Texas as part of the Japan Nite event.[9] A few months later, Stereopony released their debut album, Hydrangea ga Saiteiru. It debuted at No. 7 on the Oricon weekly album chart.[10] The song \"Seishun ni, Sono Namida ga Hitsuyou da!\" from the album was featured in a Japanese Lipton iced tea TV commercial.[11] Shortly after, the band went on their first tour, A Hydrangea Blooms. Along with the tour goods, there were 50 signed Score Band books in each venue for purchase. In August 2009, Stereopony released their fourth single, \"Smilife\". \"Smilife\" was used as the theme song for the 2009 anime film Yatterman: Shin Yatter Mecha Daishūgō! Omocha no Kuni de Daikessen da Koron!. Their fifth single, \"Tsukiakari no Michishirube\", was released on November 4, 2009. \"Tsukiakari no Michishirube\" was the opening theme to the 2009 anime series Darker than Black: Ryūsei no Gemini. It was their second single to reach the top ten Oricon singles chart, peaking at No. 8. Stereopony's sixth single, \"Hanbunko\", was released on September 17, 2010; \"Hanbunko\" is a cover originally released by Bivattchee in 2002. Stereopony's seventh single, \"Over Drive\", was released on May 12, 2010, and was used for the opening theme for the Japanese drama Pro Golfer Hana.\n"
   ]
}