{
   "Name": "Team Dresch",
   "rawData": [
      "Team Dresch is an American queercore/punk rock band from Portland, Oregon, originally formed in Olympia, Washington, which was initially active from 1993 until 1998. The band made a significant impression on the DIY movement queercore, which gave voice through zines and music to the passions and concerns of those in both the LGBT community and the punk subculture. All bandmembers were open lesbians. Washington Post writer Chris Richards called their debut album, 1995's Personal Best, \"a fiery, all-but-forgotten punk masterpiece.\" In the early 2000s, Team Dresch reunited, and they continue to perform. In March 2019, the band announced they would be reissuing their entire catalogue via Jealous Butcher Records. Along with reissuing their catalogue, the band is also plotting an upcoming tour, though dates haven't been announced. This came alongside the release of a new video for the band's classic track \"Fagetarian and Dyke.\" The new visual featured never-before-seen live footage of the group, offering a glimpse into the wild moshpit-filled shows of their heyday.\n",
      "Donna Dresch, founder of the band, had been involved in the queercore scene in the late 1980s and early 1990s as creator of her own fanzine Chainsaw and, in addition to contributing to other zines such as Outpunk and J.D.s, she contributed to and was featured on the cover of issue five of Homocore and appeared in the girl-gang film The Yo-Yo Gang by G.B. Jones.\n",
      "The line up of the group for its first album was Donna Dresch, guitar and bass; Jody Bleyle, guitar, bass, and vocals; Kaia Wilson, guitar and vocals; and Marcéo Martinez on drums. All were veterans of other musical outfits; Donna Dresch had previously played and recorded with such bands as Dinosaur Jr., Dangermouse, Screaming Trees, Rastro!, Fifth Column, Some Velvet Sidewalk, Lois, Mary Lou Lord and The Go Team; Jody Bleyle was simultaneously in the bands Hazel  and Lovebutt while playing in Team Dresch; Kaia Wilson had been in the band Adickdid and Marcéo Martinez in Calamity Jane. Scott Plouf, then of The Spinanes and later of Built to Spill, served as the drummer on the first 7-inch single, \"Hand Grenade\", which was released by Kill Rock Stars in 1994.\n"
   ],
   "infobox": {
      "Origin": [
         "Olympia, Washington, United States"
      ],
      "Genres": [
         "Punk rock, queercore, riot grrrl"
      ],
      "Years active": [
         "1993–1998, 2004–present"
      ],
      "Labels": [
         "KRS, Chainsaw, Candy Ass, Jealous Butcher"
      ],
      "Associated acts": [
         "The Butchies, Hazel, Adickdid, Calamity Jane, Vitapup, Born Against, Dinosaur Jr., Screaming Trees, Fifth Column, Some Velvet Sidewalk, Lois, Mary Lou Lord, The Go Team, The Spinanes, Built to Spill, Phranc"
      ],
      "Members": [
         "Jody Bleyle",
         "Kaia Wilson",
         "Donna Dresch",
         "Marcéo Martinez",
         "Melissa York"
      ],
      "Past members": [
         "Amanda Kelly"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Portland, Oregon, originally formed in Olympia, Washington, which was initially active from [YEAR] until [YEAR]. The band made a significant impression on the DIY movement queercore, which gave voice through zines and music to the passions and concerns of those in both the LGBT community and the punk subculture. All bandmembers were open lesbians. Washington Post writer Chris Richards called their debut album, [YEAR]'s Personal Best, \"a fiery, all-but-forgotten punk masterpiece.\" In the early [YEAR]s, [BAND_NAME] reunited, and they continue to perform. In [MONTH] [YEAR], the band announced they would be reissuing their entire catalogue via Jealous Butcher Records. Along with reissuing their catalogue, the band is also plotting an upcoming tour, though dates haven't been announced. This came alongside the release of a new video for the band's classic track \"Fagetarian and Dyke.\" The new visual featured never-before-seen live footage of the group, offering a glimpse into the wild moshpit-filled shows of their heyday.\n",
      "Donna Dresch, founder of the band, had been involved in the queercore scene in the late [YEAR]s and early [YEAR]s as creator of her own fanzine Chainsaw and, in addition to contributing to other zines such as Outpunk and J.D.s, she contributed to and was featured on the cover of issue five of Homocore and appeared in the girl-gang film The Yo-Yo Gang by G.B. Jones.\n",
      "The line up of the group for its first album was Donna Dresch, guitar and bass; [PERSON_NAME_FULL_0_FEMALE], guitar, bass, and vocals; Kaia Wilson, guitar and vocals; and [MONTH]céo [MONTH]tinez on drums. All were veterans of other musical outfits; Donna Dresch had previously played and recorded with such bands as Dinosaur Jr., Dangermouse, Screaming Trees, Rastro!, Fifth Column, Some Velvet Sidewalk, Lois, [MONTH]y Lou Lord and The Go Team; [PERSON_NAME_FULL_0_FEMALE] was simultaneously in the bands Hazel  and Lovebutt while playing in [BAND_NAME]; Kaia Wilson had been in the band Adickdid and [MONTH]céo [MONTH]tinez in Calamity [MONTH]e. Scott Plouf, then of The Spinanes and later of Built to Spill, served as the drummer on the first 7-inch single, \"Hand Grenade\", which was released by Kill Rock Stars in [YEAR].\n"
   ]
}