{
   "Name": "Team Dresch",
   "Sections": [
      "1 History",
      "1.1 Beginnings",
      "1.1.1 Establishment",
      "1.1.2 First album line-up",
      "1.2 Original disbandment and side projects",
      "1.3 Together Again",
      "2 Discography",
      "2.1 Albums",
      "2.2 Compilations",
      "2.3 Singles",
      "2.4 Split singles",
      "2.5 Compilation appearances",
      "2.6 Documentaries and other media",
      "3 See also",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Team Dresch is an American queercore/punk rock band from Portland, Oregon, originally formed in Olympia, Washington, which was initially active from 1993 until 1998. The band made a significant impression on the DIY movement queercore, which gave voice through zines and music to the passions and concerns of those in both the LGBT community and the punk subculture. All bandmembers were open lesbians. Washington Post writer Chris Richards called their debut album, 1995's Personal Best, \"a fiery, all-but-forgotten punk masterpiece.\"[1] In the early 2000s, Team Dresch reunited, and they continue to perform. In March 2019, the band announced they would be reissuing their entire catalogue via Jealous Butcher Records.[2] Along with reissuing their catalogue, the band is also plotting an upcoming tour, though dates haven't been announced.[3] This came alongside the release of a new video for the band's classic track \"Fagetarian and Dyke.\" The new visual featured never-before-seen live footage of the group, offering a glimpse into the wild moshpit-filled shows of their heyday.[4]\n"
      ]
   },
   "History": {
      "Beginnings": {
         "Establishment": {
            "text": [
               "Donna Dresch, founder of the band, had been involved in the queercore scene in the late 1980s and early 1990s as creator of her own fanzine Chainsaw and, in addition to contributing to other zines such as Outpunk and J.D.s, she contributed to and was featured on the cover of issue five of Homocore and appeared in the girl-gang film The Yo-Yo Gang by G.B. Jones.\n"
            ]
         },
         "First album line-up": {
            "text": [
               "The line up of the group for its first album was Donna Dresch, guitar and bass; Jody Bleyle, guitar, bass, and vocals; Kaia Wilson, guitar and vocals; and Marcéo Martinez on drums. All were veterans of other musical outfits; Donna Dresch had previously played and recorded with such bands as Dinosaur Jr., Dangermouse, Screaming Trees, Rastro!, Fifth Column, Some Velvet Sidewalk, Lois, Mary Lou Lord and The Go Team; Jody Bleyle was simultaneously in the bands Hazel  and Lovebutt while playing in Team Dresch; Kaia Wilson had been in the band Adickdid and Marcéo Martinez in Calamity Jane. Scott Plouf, then of The Spinanes and later of Built to Spill, served as the drummer on the first 7-inch single, \"Hand Grenade\", which was released by Kill Rock Stars in 1994.\n",
               "Personal Best appeared in January 1995 as a co-release on the independent labels Chainsaw Records, run by Dresch and Candy Ass Records, run by Bleyle.  Candy Ass then released the compilation Free to Fight, a double LP of all-women bands dedicated to female self-defense and addressing issues such as harassment and rape.  The band toured with self-defense instructor Alice Stagg, who gave lectures and demonstrations to the audience prior to the band's performance. The  members were committed to a DIY ethic, running their own record labels and booking their own tours.\n",
               "On their second recording, drummer Melissa York, previously of the hardcore punk bands Vitapup and Born Against, replaced Marcéo Martinez. This LP, Captain My Captain, released in 1996, also featured a guest appearance by singer-songwriter Phranc. The song \"Uncle Phranc\", written as a tribute to her, appears on this album.\n"
            ]
         }
      },
      "Original disbandment and side projects": {
         "text": [
            "After Captain My Captain, Kaia Wilson and Melissa York left the band to form The Butchies, while Dresch and Bleyle continued recording with the addition of new member Amanda Kelley and with Marcéo Martinez once again on drums. The band stopped playing in 1998, with Dresch increasingly involved in running her record label which was releasing many recordings by newer queercore bands, including  The Need, Longstocking and Sleater-Kinney. Marcéo Martinez and Amanda Kelley went on to play in The Vegas Beat.\n",
            "In 2002, Jody debuted a new band, Family Outing, which includes her brother, Allen, and in 2004, Donna returned to the stage with a new band, Davies vs. Dresch. They appeared as part of \"Queercore Blitz\", a group of queer bands touring the US together.\n"
         ]
      },
      "Together Again": {
         "text": [
            "In the summer of 2004, Jody, Donna, Kaia, Marcéo and Melissa came together to headline the queercore festival Homo-a-Go-Go in Olympia, Washington. Since then, the band has played sporadically, embarking on brief West and East coast tours throughout 2006 and 2007. Their 2007 tour came with an announcement of a new record planned to be released in 2008; as of late 2009, there have been no updates as to its development. The band's played in Portland and Seattle in September 2009, and in Brazil for two Ladyfest shows in May 2010.[5] The band played again in Portland in 2017.\n",
            "In June 2019, Team Dresch released a new single, \"Your Hands in My Pockets\", their first new song in 19 years.\nAlso in 2019, Team Dresch toured the US and rereleased their albums and a compilation of unreleased material.\n[6]\n"
         ]
      }
   },
   "Discography": {
      "Albums": {},
      "Compilations": {},
      "Singles": {},
      "Split singles": {},
      "Compilation appearances": {},
      "Documentaries and other media": {
         "text": [
            "The band performs and is interviewed in the documentary film She's Real, Worse Than Queer by Lucy Thane.\n",
            "Jody Bleyle is interviewed in the documentary Step Up and Be Vocal, Interviews zu Queer Punk und Feminismus in San Francisco Uta Busch und Sandra Ortmann, (2001) Bremen, Germany, 60 min\n",
            "On the cover of the Microcosm Publishing comic My Brain Hurts by Liz Baillie, Kate is wearing a hoodie with a Team Dresch patch sewn onto it.[7]\n",
            "The band appears in Queercore: How to Punk a Revolution, by Yony Leyser.\n",
            "The band is featured in Riot Grrrl United Feminism and Punk.\n"
         ]
      }
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Team Dresch is an American queercore/punk rock band from Portland, Oregon, originally formed in Olympia, Washington, which was initially active from 1993 until 1998. The band made a significant impression on the DIY movement queercore, which gave voice through zines and music to the passions and concerns of those in both the LGBT community and the punk subculture. All bandmembers were open lesbians. Washington Post writer Chris Richards called their debut album, 1995's Personal Best, \"a fiery, all-but-forgotten punk masterpiece.\"[1] In the early 2000s, Team Dresch reunited, and they continue to perform. In March 2019, the band announced they would be reissuing their entire catalogue via Jealous Butcher Records.[2] Along with reissuing their catalogue, the band is also plotting an upcoming tour, though dates haven't been announced.[3] This came alongside the release of a new video for the band's classic track \"Fagetarian and Dyke.\" The new visual featured never-before-seen live footage of the group, offering a glimpse into the wild moshpit-filled shows of their heyday.[4]\n",
      "Donna Dresch, founder of the band, had been involved in the queercore scene in the late 1980s and early 1990s as creator of her own fanzine Chainsaw and, in addition to contributing to other zines such as Outpunk and J.D.s, she contributed to and was featured on the cover of issue five of Homocore and appeared in the girl-gang film The Yo-Yo Gang by G.B. Jones.\n",
      "The line up of the group for its first album was Donna Dresch, guitar and bass; Jody Bleyle, guitar, bass, and vocals; Kaia Wilson, guitar and vocals; and Marcéo Martinez on drums. All were veterans of other musical outfits; Donna Dresch had previously played and recorded with such bands as Dinosaur Jr., Dangermouse, Screaming Trees, Rastro!, Fifth Column, Some Velvet Sidewalk, Lois, Mary Lou Lord and The Go Team; Jody Bleyle was simultaneously in the bands Hazel  and Lovebutt while playing in Team Dresch; Kaia Wilson had been in the band Adickdid and Marcéo Martinez in Calamity Jane. Scott Plouf, then of The Spinanes and later of Built to Spill, served as the drummer on the first 7-inch single, \"Hand Grenade\", which was released by Kill Rock Stars in 1994.\n",
      "Personal Best appeared in January 1995 as a co-release on the independent labels Chainsaw Records, run by Dresch and Candy Ass Records, run by Bleyle.  Candy Ass then released the compilation Free to Fight, a double LP of all-women bands dedicated to female self-defense and addressing issues such as harassment and rape.  The band toured with self-defense instructor Alice Stagg, who gave lectures and demonstrations to the audience prior to the band's performance. The  members were committed to a DIY ethic, running their own record labels and booking their own tours.\n"
   ],
   "infobox": {
      "Origin": [
         "Olympia, Washington, United States"
      ],
      "Genres": [
         "Punk rock, queercore, riot grrrl"
      ],
      "Years active": [
         "1993–1998, 2004–present"
      ],
      "Labels": [
         "KRS, Chainsaw, Candy Ass, Jealous Butcher"
      ],
      "Associated acts": [
         "The Butchies, Hazel, Adickdid, Calamity Jane, Vitapup, Born Against, Dinosaur Jr., Screaming Trees, Fifth Column, Some Velvet Sidewalk, Lois, Mary Lou Lord, The Go Team, The Spinanes, Built to Spill, Phranc"
      ],
      "Members": [
         "Jody Bleyle",
         "Kaia Wilson",
         "Donna Dresch",
         "Marcéo Martinez",
         "Melissa York"
      ],
      "Past members": [
         "Amanda Kelly"
      ]
   }
}