{
   "Name": "The Third Sex (band)",
   "rawData": [
      "The Third Sex was an American queercore band formed in 1993, in Portland, Oregon. The band featured Trish Walsh on guitar and vocals, Peyton Marshall on bass and vocals and, initially, a series of drummers. Although a smaller band, they helped propagate the queercore movement across the country. A part of the Riot Grrrl scene, The Third Sex were significant in feminism's third wave and both influenced, and were influenced by, DIY culture.\n",
      "Third Sex lyrics were often political and featured songs of heartbreak and hidden relationships. Playing with bands like Bikini Kill and Bratmobile, The Third Sex travelled across the country, performing in hundreds of local venues and building a large grassroots following.\n",
      "The band's first, eponymous 7-inch was released in 1995 on the Kill Rock Stars label, followed by their debut album Card Carryin on Donna Dresch's Chainsaw Records in 1996. This record represented several years of live performance and songwriting. In the wake of these releases, Third Sex started headlining their own shows, including performing many benefits for gay and lesbian youth clubs.\n"
   ],
   "infobox": {
      "Origin": [
         "Portland, Oregon, United States"
      ],
      "Genres": [
         "Queercore, riot grrrl"
      ],
      "Years active": [
         "1993–2000, 2010"
      ],
      "Labels": [
         "Chainsaw Records, Kill Rock Stars, Mr. Lady Records"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band formed in [YEAR], in Portland, Oregon. The band featured [PERSON_NAME_FULL_0_FEMALE] on guitar and vocals, Peyton [MONTH]shall on bass and vocals and, initially, a series of drummers. Although a smaller band, they helped propagate the queercore movement across the country. A part of the Riot Grrrl scene, [BAND_NAME] were significant in feminism's third wave and both influenced, and were influenced by, DIY culture.\n",
      "Third Sex lyrics were often political and featured songs of heartbreak and hidden relationships. Playing with bands like Bikini Kill and Bratmobile, [BAND_NAME] travelled across the country, performing in hundreds of local venues and building a [GENRE]",
      "The band's first, eponymous 7-inch was released in [YEAR] on the Kill Rock Stars label, followed by their debut album Card Carryin on [PERSON_NAME_FULL_0_FEMALE]'s Chainsaw Records in [YEAR]. This record represented several years of live performance and songwriting. In the wake of these releases, Third Sex started headlining their own shows, including performing many benefits for gay and lesbian youth clubs.\n"
   ]
}