{
   "Name": "Thunderpussy",
   "rawData": [
      "Thunderpussy is an American rock band formed in Seattle, Washington, in 2014. The group is composed of vocalist Molly Sides, guitarist Whitney Petty, bassist Leah Julius, and drummer Lindsey Elias. The band draws inspiration from the sound of 1970s rock. Their debut EP, Greatest Tits, was released digitally on February 23, 2018. Thunderpussy released their eponymous debut studio album, Thunderpussy, on May 25, 2018. The album was produced by Sylvia Massy. Thunderpussy began a tour in support of the album on May 11, 2018.\n",
      "The band was founded by Whitney Petty and Molly Sides in 2014 in Seattle. Petty had moved to Seattle to work on a boat, and began her musical career playing guitar for Deerhunter and playing drums in The Grizzled Mighty. Sides moved to Seattle to study Dance at the Cornish College of the Arts.  Seeing Sides sing backup for the band This Bitch Don't Fall Off inspired Petty to form Thunderpussy two years later.  Lena Simon, Sides' best friend from Cornish College of the Arts, later joined the band as drummer. Leah Julius, drummer of classic rock cover band Sundries, met Sides and Petty in the Seattle music community and joined the band as bassist.\n",
      "Simon left the band to focus upon playing bass for La Luz, leaving the band without a drummer for a while. She was replaced by Ruby Dunphy, who moved from Chicago to Seattle in 2014 to study Jazz at the Cornish College of the Arts. Within 2 weeks she was introduced to the band, and in her words, \"I didn't really have a choice in joining, they kind of just kidnapped me. It's the best thing that’s ever happened to me.\" Thunderpussy announced on the band's official Facebook and Instagram pages in January 2019 that Ruby Dunphy left to pursue other projects.\n"
   ],
   "infobox": {
      "Origin": [
         "Seattle, United States"
      ],
      "Genres": [
         "Hard rock, blues rock"
      ],
      "Years active": [
         "2014 (2014)–present"
      ],
      "Labels": [
         "Stardog/Republic Records"
      ],
      "Website": [
         "www.thunderpussyusa.com"
      ],
      "Members": [
         "Whitney Petty",
         "Molly Sides",
         "Leah Julius",
         "Lindsey Elias"
      ]
   },
   "albums": [
      "Thunderpussy"
   ]
}