{
   "Name": "Thunderpussy",
   "Sections": [
      "1 History",
      "1.1 Formation and early years",
      "1.2 Breakthrough",
      "1.3 Thunderpussy",
      "1.4 Milk It",
      "2 Influences",
      "3 Legal issues",
      "4 Discography",
      "4.1 Studio Albums",
      "4.2 EPs",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Thunderpussy is an American rock band formed in Seattle, Washington, in 2014.[1] The group is composed of vocalist Molly Sides, guitarist Whitney Petty, bassist Leah Julius, and drummer Lindsey Elias.[2][3] The band draws inspiration from the sound of 1970s rock. Their debut EP, Greatest Tits, was released digitally on February 23, 2018. Thunderpussy released their eponymous debut studio album, Thunderpussy, on May 25, 2018. The album was produced by Sylvia Massy. Thunderpussy began a tour in support of the album on May 11, 2018.\n"
      ]
   },
   "History": {
      "Formation and early years": {
         "text": [
            "The band was founded by Whitney Petty and Molly Sides in 2014 in Seattle. Petty had moved to Seattle to work on a boat,[4] and began her musical career playing guitar for Deerhunter[5] and playing drums in The Grizzled Mighty. Sides moved to Seattle to study Dance at the Cornish College of the Arts.[6]  Seeing Sides sing backup for the band This Bitch Don't Fall Off inspired Petty to form Thunderpussy two years later.[5]  Lena Simon, Sides' best friend from Cornish College of the Arts, later joined the band as drummer.[5] Leah Julius, drummer of classic rock cover band Sundries, met Sides and Petty in the Seattle music community and joined the band as bassist.[7]\n",
            "Simon left the band to focus upon playing bass for La Luz, leaving the band without a drummer for a while.[5] She was replaced by Ruby Dunphy, who moved from Chicago to Seattle in 2014[1] to study Jazz at the Cornish College of the Arts. Within 2 weeks she was introduced to the band, and in her words, \"I didn't really have a choice in joining, they kind of just kidnapped me. It's the best thing that’s ever happened to me.\"[8] Thunderpussy announced on the band's official Facebook and Instagram pages in January 2019 that Ruby Dunphy left to pursue other projects.\n"
         ]
      },
      "Breakthrough": {
         "text": [
            "The band met and befriended Pearl Jam's lead guitarist Mike McCready at Sasquatch! Music Festival.[8] McCready was an immediate fan of the band, and Thunderpussy's first single, \"Velvet Noose\", was released on McCready's HockeyTalkter Records. McCready contributes a guitar solo to the track.[9] The song was featured in the 2017 crime drama Molly's Game.\n",
            "In May 2017, the band supported benefit shows by Flight to Mars, McCready's UFO tribute band.[10]\n",
            "In November 2017, Thunderpussy were signed to Stardog Records.[1]\n",
            "The band chose four songs for their EP Greatest Tits,[6] which they described as \"a taste tester for the album\".[11] The EP was released on February 23, 2018.\n"
         ]
      },
      "Thunderpussy": {
         "text": [
            "The band recorded their full-length debut, Thunderpussy, at Sylvia Massy's home studio in Ashland, Oregon, with Massy and engineer Josh Evans.[12][1] The album was released on May 25, 2018.\n",
            "The band performed at SXSW on March 13, 2018.[13]\n"
         ]
      },
      "Milk It": {
         "text": [
            "The band released their second EP, Milk It, on October 25, 2019. It was their first recording effort with drummer Lindsey Elias.[14]\n"
         ]
      }
   },
   "Influences": {
      "text": [
         "The band have cited diverse musical influences, including Led Zeppelin,[15] Heart, Laura Jane Grace,[7] The Marshall Tucker Band,[7] and Kathleen Hanna.[7] Petty has described their live show as \"Beyoncé meets Led Zeppelin.\"[5]\n",
         "All of the band's members date women,[16] and Petty has stated that she and Sides are a couple.[17] It's suggested that their relationship influenced their songwriting, with \"Speed Queen\" being described by bassist Julius as \"vaguely a love story about Molly and Whitney\".[6]\n",
         "The band have expressed disdain for journalists who may brand them \"as an all-female, feminist rock group\" instead of focusing on their music.[7] Remarking upon being an all-female band in a male-dominated music genre, Julius told an interviewer: \"All four of us women do things that have historically been male-dominated. We play music, ride motorcycles, date girls, and lift heavy shit for a living. And we don't do them as a 'fuck you' to the male-dominated society, or in an attempt to advance women's rights, we do them because we can and want to.\"[16]\n"
      ]
   },
   "Legal issues": {
      "text": [
         "In May 2015, the band applied to register their name as a trademark. In August 2015, the Patent and Trademark Office denied their request, citing Section 2(a) of the Lanham Act, which denies registrations to trademarks that could be deemed \"scandalous, immoral, or disparaging.\"[18] Despite the disparagement provision of the law being struck down in 2017 with Matal v. Tam (also known as The Slants case) and the remainder of the law declared unconstitutional in Iancu v. Brunetti, the Trademark Office did not issue a registration to Thunderpussy's trademark until April 2020.[19]\n"
      ]
   },
   "Discography": {
      "Studio Albums": {},
      "EPs": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Thunderpussy is an American rock band formed in Seattle, Washington, in 2014.[1] The group is composed of vocalist Molly Sides, guitarist Whitney Petty, bassist Leah Julius, and drummer Lindsey Elias.[2][3] The band draws inspiration from the sound of 1970s rock. Their debut EP, Greatest Tits, was released digitally on February 23, 2018. Thunderpussy released their eponymous debut studio album, Thunderpussy, on May 25, 2018. The album was produced by Sylvia Massy. Thunderpussy began a tour in support of the album on May 11, 2018.\n",
      "The band was founded by Whitney Petty and Molly Sides in 2014 in Seattle. Petty had moved to Seattle to work on a boat,[4] and began her musical career playing guitar for Deerhunter[5] and playing drums in The Grizzled Mighty. Sides moved to Seattle to study Dance at the Cornish College of the Arts.[6]  Seeing Sides sing backup for the band This Bitch Don't Fall Off inspired Petty to form Thunderpussy two years later.[5]  Lena Simon, Sides' best friend from Cornish College of the Arts, later joined the band as drummer.[5] Leah Julius, drummer of classic rock cover band Sundries, met Sides and Petty in the Seattle music community and joined the band as bassist.[7]\n",
      "Simon left the band to focus upon playing bass for La Luz, leaving the band without a drummer for a while.[5] She was replaced by Ruby Dunphy, who moved from Chicago to Seattle in 2014[1] to study Jazz at the Cornish College of the Arts. Within 2 weeks she was introduced to the band, and in her words, \"I didn't really have a choice in joining, they kind of just kidnapped me. It's the best thing that’s ever happened to me.\"[8] Thunderpussy announced on the band's official Facebook and Instagram pages in January 2019 that Ruby Dunphy left to pursue other projects.\n",
      "The band met and befriended Pearl Jam's lead guitarist Mike McCready at Sasquatch! Music Festival.[8] McCready was an immediate fan of the band, and Thunderpussy's first single, \"Velvet Noose\", was released on McCready's HockeyTalkter Records. McCready contributes a guitar solo to the track.[9] The song was featured in the 2017 crime drama Molly's Game.\n"
   ]
}