{
   "Name": "Tijuana Sweetheart",
   "rawData": [
      "Tijuana Sweetheart (formerly known as VAGIANT and VAGIANT Boston) was an American all-female punk rock band from Boston, Massachusetts, United States. The band was initially formed in 2005 by four employees of the gaming company Harmonix after Helen McWilliams (stage name Hellion) sent around an email to the entire company. One of these original members was Elena Siegman. Since forming, the band has gone under several member changes leaving McWilliams and LoWreck as the only remaining original members. Most of their notoriety has come from the inclusion of \"Fuck the Kells\" (censored \"FTK\") in Guitar Hero II and \"Seven\" in Rock Band.\n",
      "In October 2009, the band announced it was changing its name from \"VAGIANT\" to \"VAGIANT Boston\" due to a legal dispute over the use of the name. It also announced the release of a new album, Trash Candy. Later they asked their fans to help them come up with a new name for the band.  After hundreds of often off-beat band name suggestions from fans, the band selected Tijuana Sweetheart in January 2010 – a name that comes from a cocktail of their own invention (and from the band's unique slang term for a prostitute).\n",
      "Tijuana Sweetheart's music features a fast paced, high energy punk rock base. Stylistically and vocally they are akin to Joan Jett and The Distillers, while lyrically coming off as abrasive and blunt as their sound. Their lyrics are occasionally highly sexual, and often pertain to both genders. Tijuana Sweetheart is a staple band for the Boston area and even features landmarks such as The Kells in their music, and have performed live with such bands as Bang Camaro, the Mighty Mighty Bosstones, DMZ, and the Ducky Boys\n"
   ],
   "infobox": {
      "Origin": [
         "Allston, Massachusetts, United States"
      ],
      "Genres": [
         "Punk rock, alternative rock, riot grrrl"
      ],
      "Years active": [
         "2005–2012"
      ],
      "Associated acts": [
         "Razors in the Night"
      ],
      "Website": [
         "www.tijuanasweetheart.com"
      ],
      "Past members": [
         "Hellion",
         "LoWreck",
         "Julie Two-Times",
         "Keri M.",
         "Ivahna Rock",
         "Elena Siegman",
         "Arielle Weiss",
         "Smokey"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (formerly known as VAGIANT and VAGIANT Boston) was an [GENRE] band from Boston, Massachusetts, United States. The band was initially formed in [YEAR] by four employees of the gaming company Harmonix after Helen McWilliams (stage name Hellion) sent around an email to the entire company. One of these original members was [PERSON_NAME_FULL_0_FEMALE]. Since forming, the band has gone under several member changes leaving McWilliams and LoWreck as the only remaining original members. Most of their notoriety has come from the inclusion of \"Fuck the Kells\" (censored \"FTK\") in Guitar Hero II and \"Seven\" in Rock Band.\n",
      "In [MONTH] [YEAR], the band announced it was changing its name from \"VAGIANT\" to \"VAGIANT Boston\" due to a [GENRE] a new album, Trash Candy. Later they asked their fans to help them come up with a new name for the band.  After hundreds of often off-beat band name suggestions from fans, the band selected [BAND_NAME] in [MONTH] [YEAR] – a name that comes from a cocktail of their own invention (and from the band's unique slang term for a prostitute).\n",
      "[BAND_NAME]'s music features a fast paced, high energy punk rock base. Stylistically and vocally they are akin to [PERSON_NAME_FULL_0_FEMALE] and The Distillers, while lyrically coming off as abrasive and blunt as their sound. Their lyrics are occasionally highly sexual, and often pertain to both genders. [BAND_NAME] is a staple band for the Boston area and even features landmarks such as The Kells in their music, and have performed live with such bands as Bang Camaro, the Mighty Mighty Bosstones, DMZ, and the Ducky Boys\n"
   ]
}