{
   "Name": "Tribe 8",
   "rawData": [
      "Tribe 8 was a LGBTQ punk rock band from San Francisco, considered one of the first queercore groups. The band took their name from the practice of tribadism, a \"tribe eight\" being a play on the word tribade, a sexual practice sometimes also known as \"scissoring.\"\n",
      "The makeup of the group changed over time, but Lynn Breedlove and Leslie Mah (formerly of Anti-Scrunti Faction) were consistent members. Other members included Flipper (Silas Howard), Slade Bellum, Jen Schwartz, Mama T, Kat Buell, and Tantrum.\n",
      "In concert, lead singer Breedlove frequently performed shirtless, wearing a strap-on dildo, and encouraged audience members to interact with it. Their songs often deal with subjects such as S/M, nudity, fellatio, and transgender issues, and the band was the subject of controversy because of this. An article from the Chicago Tribune praised their Fireside Bowl show in 1998 stating \"If the members of Tribe 8 play punk rock like they own it, it's only because they do.\"\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Queercore"
      ],
      "Years active": [
         "1991–2005"
      ],
      "Labels": [
         "Outpunk, Alternative Tentacles"
      ],
      "Website": [
         "www.tribe8.com"
      ],
      "Past members": [
         "Lynn Breedlove",
         "Leslie Mah",
         "Flipper (Silas Howard)",
         "Slade Bellum",
         "Jen Schwartz",
         "Mama T",
         "Tantrum",
         "Kat Buell"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band from San Francisco, considered one of the first queercore groups. The band took their name from the practice of tribadism, a \"tribe eight\" being a play on the word tribade, a sexual practice sometimes also known as \"scissoring.\"\n",
      "The makeup of the group changed over time, but [PERSON_NAME_FULL_0_FEMALE] and [PERSON_NAME_FULL_2_FEMALE] (formerly of Anti-Scrunti Faction) were consistent members. Other members included Flipper (Silas Howard), Slade Bellum, [PERSON_NAME_FULL_3_FEMALE], Mama T, [PERSON_NAME_FULL_1_FEMALE], and Tantrum.\n",
      "In concert, lead singer Breedlove frequently performed shirtless, wearing a [GENRE] band was the subject of controversy because of this. An article from the Chicago Tribune praised their Fireside Bowl show in [YEAR] stating \"If the members of [BAND_NAME] play punk rock like they own it, it's only because they do.\"\n"
   ]
}