{
   "Name": "Ut (band)",
   "Sections": [
      "1 History",
      "2 Post-breakup",
      "3 Reunion",
      "4 In popular culture",
      "5 Discography",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Ut was an American band which originated from New York City's no wave scene, forming in December 1978. The inheritors of the fertile collision between rock, free jazz, and the avant-garde that first manifested itself in the Velvet Underground, Ut soon became a serious force within the New York music scene.\n"
      ]
   },
   "History": {
      "text": [
         "Ut's members were Nina Canal, Jacqui Ham, and Sally Young. They were joined briefly by filmmaker Karen Achenbach in 1979 before resuming as a three-piece band and relocating to London in 1981. Ut toured the UK with bands such as the Fall and the Birthday Party. Originally releasing albums on its own label Out Records, the band became a favourite of John Peel[1] and recorded several sessions for his show before joining forces with Blast First in 1987.\n",
         "In Gut's House was originally released in 1988 and made NME's Top 50 that year. The Washington Post noted, \"With In Gut's House, Ut has scraped and droned one of the finest underground rock albums of the year.... The tightly woven, firmly focused sound...is rich, spooky, urgent, and quite unexpectedly beautiful.\"[2]\n",
         "In 1989, the band recorded and released the album Griller, engineered by labelmate Steve Albini, who shared Ut's raw aesthetic. In March 1990, Ut played its last concert in Paris.\n"
      ]
   },
   "Post-breakup": {
      "text": [
         "Sally Young went on to form the band Quint, releasing the Time Wounds All Heals album on Southern Records.[3]\n",
         "Jacqui Ham formed Dial with Rob Smith and Dominic Weeks (Furious Pig, Het). Dial released three albums on Cede Records: Infraction, Distance Runner and 168k.\n",
         "Nina Canal continues to create music and most recently participated in Rhys Chatham's 100 Guitars project.\n"
      ]
   },
   "Reunion": {
      "text": [
         "Ut played a short, unannounced reunion show in London in July 2010. In November 2010, the band mounted a brief tour of the East Coast of the United States. In November 2013, the band played the final holiday camp edition of the All Tomorrow's Parties festival in Camber Sands, England.[4]\n"
      ]
   },
   "In popular culture": {
      "text": [
         "Ut is one of the many bands mentioned in Le Tigre's single \"Hot Topic”.[5]\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Ut was an American band which originated from New York City's no wave scene, forming in December 1978. The inheritors of the fertile collision between rock, free jazz, and the avant-garde that first manifested itself in the Velvet Underground, Ut soon became a serious force within the New York music scene.\n",
      "Ut's members were Nina Canal, Jacqui Ham, and Sally Young. They were joined briefly by filmmaker Karen Achenbach in 1979 before resuming as a three-piece band and relocating to London in 1981. Ut toured the UK with bands such as the Fall and the Birthday Party. Originally releasing albums on its own label Out Records, the band became a favourite of John Peel[1] and recorded several sessions for his show before joining forces with Blast First in 1987.\n",
      "In Gut's House was originally released in 1988 and made NME's Top 50 that year. The Washington Post noted, \"With In Gut's House, Ut has scraped and droned one of the finest underground rock albums of the year.... The tightly woven, firmly focused sound...is rich, spooky, urgent, and quite unexpectedly beautiful.\"[2]\n",
      "In 1989, the band recorded and released the album Griller, engineered by labelmate Steve Albini, who shared Ut's raw aesthetic. In March 1990, Ut played its last concert in Paris.\n"
   ]
}