{
   "Name": "Upset (band)",
   "rawData": [
      "Upset are an American band formed in 2013. The band originally consisted of Ali Koehler on guitar and lead vocals, Jenn Prince on lead guitar and vocals, Chris Juarez on bass, and Patty Schemel on drums. After the recording and release of their debut album She's Gone, Prince departed the band to work on other projects, with Lauren Freeman joining the band on lead guitar and Rachel Gagliardi on bass and vocals. Koehler is the former drummer of the bands Best Coast and Vivian Girls. Schemel rose to prominence as the drummer of Hole and currently also drums for the band Death Valley Girls.  The band released their debut album on Don Giovanni Records on October 29, 2013.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Punk rock",
         "Pop punk"
      ],
      "Years active": [
         "2013–present"
      ],
      "Labels": [
         "Lauren Records Don Giovanni"
      ],
      "Associated acts": [
         "Vivian Girls, Best Coast, Hole, La Sera, Slutever, Benny The Jet Rodriguez."
      ],
      "Members": [
         "Ali Koehler ",
         " Lauren Freeman ",
         " Patty Schemel ",
         " Nicole Snyder"
      ],
      "Past members": [
         "Jenn Prince ",
         " Chris Juarez ",
         " Rachel Gagliardi"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band formed in [YEAR]. The band originally consisted of Ali Koehler on guitar and lead vocals, [PERSON_NAME_FULL_0_FEMALE] on lead guitar and vocals, Chris Juarez on bass, and [PERSON_NAME_FULL_1_FEMALE] on drums. After the recording and release of their debut album She's Gone, [PERSON_NAME_LAST_0] departed the band to work on other projects, with Lauren Freeman joining the band on lead guitar and [PERSON_NAME_FULL_2_FEMALE] on bass and vocals. Koehler is the former drummer of the bands Best Coast and Vivian Girls. [PERSON_NAME_LAST_1] rose to prominence as the drummer of Hole and currently also drums for the band Death Valley Girls.  The band released their debut album on Don Giovanni Records on [MONTH] 29, [YEAR].\n"
   ]
}