{
   "Name": "Graham Central Station",
   "rawData": [
      "Graham Central Station was an American funk band named after founder Larry Graham (formerly of Sly & the Family Stone). The name is a pun on New York City's Grand Central Terminal, often colloquially called Grand Central Station.\n",
      "The band's origins date from when Santana guitarist Neal Schon formed the band Azteca in 1972 along with Larry Graham (bass guitar) and Gregg Errico (drums), both from Sly & the Family Stone, and Pete Sears (keyboards), from Hot Tuna and Jefferson Starship. Santana bass guitar player Tom Rutley would move into the bass spot with Azteca. That band, like Santana with heavy Latin influences, would eventually morph into Graham Central Station, while Schon would form Journey. The invention of electric slap bass is attributed by many (including Victor Wooten and Bootsy Collins) to Graham, which influenced many musical genres, such as funk, R&B and disco.\n",
      "Graham Central Station's biggest hit was \"Your Love\", which charted at number 38 in 1975. The group also integrated gospel music into their repertoire, and played with the dichotomy between the funk/rock star image and the \"sanctified\" gospel group image. Some of their recordings feature the Tower of Power horn section.\n"
   ],
   "infobox": {
      "Origin": [
         "Oakland, California, United States"
      ],
      "Genres": [
         "Funk[1]",
         "progressive soul[2]"
      ],
      "Years active": [
         "1973–1979, 1997–1998, 2012"
      ],
      "Labels": [
         "Warner Bros., WEA, Star Maker, P-Vine,  Rhino"
      ],
      "Associated acts": [
         "Sly & the Family Stone, Prince"
      ],
      "Past members": [
         "Larry Graham",
         "David Vega",
         "Hershall Kennedy",
         "Willie Sparks[3]",
         "Patryce \"Chocolate\" Banks[4]"
      ]
   },
   "albums": [
      "Graham Central Station",
      "Release Yourself",
      "Ain't No 'Bout-A-Doubt It",
      "Mirror",
      "Now Do U Wanta Dance",
      "My Radio Sure Sounds Good to Me",
      "Star Walk",
      "By Popular Demand",
      "GCS 2000",
      "Raise Up"
   ]
}