{
   "Name": "Patty Schemel",
   "Sections": [
      "1 Life and career",
      "1.1 1967–1986: Early life",
      "1.2 1987–1991: Early projects",
      "1.3 1992–1997: Hole",
      "1.4 1998–2000: Departure from Hole and aftermath",
      "1.5 2001–present: Subsequent projects",
      "2 Discography",
      "2.1 As a drummer",
      "3 Notes",
      "4 References",
      "5 Sources",
      "6 Further reading",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Patricia Theresa Schemel (born April 24, 1967) is an American drummer and musician who rose to prominence as the drummer of alternative rock band Hole from 1992 until 1998. Born in Los Angeles, Schemel was raised in rural Marysville, Washington, where she developed an interest in punk rock music as a teenager. She began drumming at age eleven, and while in high school, formed several bands with her brother, Larry. \n",
         "Schemel was recommended as a drummer to Hole frontwoman Courtney Love by her husband, Kurt Cobain, a friend of Schemel's. She formally joined the band in 1992, and performed on their critically acclaimed second album, Live Through This (1994). On the band's third release, Celebrity Skin (1998), Schemel was replaced by a session drummer after its producer, Michael Beinhorn, convinced Love that Schemel was unable to adequately perform during their recording sessions. Though she receives credit on the album, her drumming does not appear on the final tracks, and the event marked her departure from the band. For the band's subsequent tour, Schemel was replaced by Samantha Maloney.\n",
         "After leaving Hole, Schemel developed a significant crack cocaine addiction, and was homeless for a time. In the early 2000s, she became sober and reunited with Love, joining the short-lived group Bastard before drumming on Love's debut solo album, America's Sweetheart (2004). Schemel subsequently drummed for Juliette and the Licks, appearing on their EP ...Like a Bolt of Lightning (2004). \n",
         "In 2010, using concert and video diary footage from Hole's 1994–1995 Live Through This world tour, Schemel co-created Hit So Hard, a documentary chronicling her time in Hole, her overcoming substance abuse, as well her subsequent business operating a dog boarding business. In 2013, she joined the indie rock group Upset, formed by Ali Koehler, previously of Vivian Girls and Best Coast,[1] and formed the band Death Valley Girls with her brother, Larry, the same year.\n"
      ]
   },
   "Life and career": {
      "1967–1986: Early life": {
         "text": [
            "Patricia Theresa Schemel was born April 24, 1967[2] in Los Angeles, California.[3] She is the middle child of three children and grew up in Marysville, Washington.[4] Both her parents are natives of Brooklyn, New York, and relocated to Washington state shortly after Schemel's birth.[5] Schemel began playing drums at age eleven after her father bought her a drum set, and played music with her brother Larry, who played guitar.[2]\n",
            "As a teenager, Schemel came out as a lesbian to her family.[4][6] \"When I realized I was a lesbian, it was weird,\" Schemel reflected. \"Thank god for punk and rock music. You could be whoever you wanted.\"[7] Musically, Schemel's early influences included Echo & the Bunnymen, AC/DC and Wire, among other punk rock bands.[citation needed] Schemel recalled being one of a small number of peers in her high school who had a shared interest in punk rock music.[7] At age fifteen formed her first band, The Milkbones.[2] She and her brother Larry subsequently formed the Seattle punk band Sybil, which was renamed Kill Sybil due to the artist of the same name.[2]\n"
         ]
      },
      "1987–1991: Early projects": {
         "text": [
            "In 1987, she joined Doll Squad,[8] an all-female punk rock band from Seattle. Along with bassist Annette Billesbach, lead guitarist Cathy Watson, rhythm guitarist Helen Halloran and vocalist Mara Dralle, Schemel was one of the original members of Doll Squad before their 2008 reunion. The band was initially active from 1987 to 1989 gaining an indie following in Seattle, playing alongside Nirvana, and releasing one self-released demo tape.\n",
            "Between Kill Sybil and Doll Squad, Schemel played drums for Everett, Washington-based band The Primitives with poet Raegan Butcher and local performers Danny Darst and Tommy Suzuki.\n"
         ]
      },
      "1992–1997: Hole": {
         "text": [
            "Schemel was considered by Kurt Cobain as Nirvana's drummer after the departure of their drummer, Chad Channing.[4][9] Cobain had been a fan of Schemel's former band Sybil, which had also been based in Seattle.[4] However, after Dave Grohl's audition, Schemel became Cobain's second choice, and he and Schemel developed a close friendship.\n",
            "After the departure of Hole's original drummer Caroline Rue, frontwoman Courtney Love recruited Schemel at the suggestion of Cobain; after an audition in Los Angeles which impressed Love and guitarist Eric Erlandson, Schemel was asked to join the band in 1992. Schemel's first work with Hole was the recording of their fourth single, \"Beautiful Son\", on which she also played guitar on the b-side \"20 Years in the Dakota\", with Love playing bass. During this period, Schemel had developed an addiction to heroin, and refused to be part of close friend Kurt Cobain's drug intervention in March 1994, claiming that doing so would be hypocrisy, as she \"was strung out [...] how dare I go there and say anything about someone else's abuse when I'm doing it too.\"[10]\n",
            "Schemel played drums on Hole's second critically acclaimed album, Live Through This (1994). She went on to tour with the band for the promotion of Live Through This, which featured dates at the Reading Festival, Big Day Out and Lollapalooza. While on tour in April 1995, Schemel became the first woman ever to appear on the cover of Drum World magazine. Schemel publicly came out in a 1995 band interview with Rolling Stone, commenting: \"It's important\" and that she's \"not out there with that fucking pink flag or anything but it's good for other people who live somewhere else in some small town who feel freaky about being gay to know that there's other people who are and that it's OK.\"[11] Schemel's girlfriend, Stacey, at the time worked as Courtney Love's personal assistant during Hole's 1994–1995 world tour, while promoting Live Through This.[11]\n",
            "Around this time, she also recorded with Phranc, playing drums on the 1995 Goofyfoot EP.[12] In 1996, Schemel played drums on Hole's cover of Fleetwood Mac's song \"Gold Dust Woman\", which was the first song on the soundtrack to The Crow: City of Angels. She also sang backing vocals and appeared prominently in the video for the song. During this time, Schemel and Hole bassist Melissa Auf der Maur formed a short-lived side project called Constant Comment. The band played a small number of shows before disbanding.[13][14]\n",
            "Hole became active again in 1997 and entered the studio to record Celebrity Skin (1998), the follow-up to Live Through This. Schemel worked on the writing of the album's material, and composed all of the drum parts herself. While in the studio, however, Love and Erlandson, at the insistence of producer Michael Beinhorn, suggested using a session drummer to record the drum tracks for the album. This led to Schemel voluntarily leaving the studio and quitting the band, and the final drum tracks were recorded by a session drummer provided by producer Beinhorn. In the months following the album's release, Schemel was not present in band interviews, and was eventually replaced by Samantha Maloney[15] for the album's tour. However, due to her contribution to the writing of the album and its demos, Schemel's name and photo were still included on the album sleeve.\n"
         ]
      },
      "1998–2000: Departure from Hole and aftermath": {
         "text": [
            "Reasons for Schemel's departure from Hole were disputed at the time, with Love claiming that Schemel's then drug habit was to blame, which supported circulating rumours,[16] however, Schemel insisted it was due to \"musical differences.\" It was later revealed in 2011 that Schemel left Hole due to personal and musical differences between her and Celebrity Skin producer, Michael Beinhorn. She claimed that Beinhorn was \"totally psyching [her] out in the studio\" and after a meeting with the band, Beinhorn brought in a session drummer, to which she felt \"betrayed by the band.\"[17]\n",
            "Bandmates Courtney Love and Eric Erlandson later publicly expressed regret over the decision to replace Schemel on the album's studio work, and Love referred to Beinhorn as \"a Nazi\".[18] Melissa Auf der Maur also commented on the incident, but noted that she \"didn't have much of a say in it.\"[4]\n",
            "After quitting Hole in 1998, Schemel cut off contact with her family and friends, and became addicted to crack cocaine and was homeless for over a year.[4] According to Courtney Love, Schemel contacted her asking for money, which Love provided, but only under the condition that she would attend rehab.[4] By 2001, Schemel had attended rehab and achieved sobriety.[4]\n"
         ]
      },
      "2001–present: Subsequent projects": {
         "text": [
            "After overcoming her addiction, Schemel reunited with Love for Love's short-lived project Bastard, which included Veruca Salt's Louise Post on guitar and Gina Crosley of Rockit Girl.[19] The group, though they recorded a few demos, disbanded shortly after. In 2002, Schemel served as a drummer for the experimental group Lucid Nation, and recorded drums for their album Tacoma Ballet (2002).[12] The following year, Schemel, along with her brother Larry, subsequently served as key composers and performers on Courtney Love's debut solo album, America's Sweetheart (2004).[20] She also recorded with Juliette Lewis's punk rock band Juliette and the Licks, with whom she played drums on their debut 6 song EP ...Like a Bolt of Lightning (2004).\n",
            "On March 18, 2010, Schemel appeared in bonus footage for the VH1 program Sober House with Dr. Drew discussing her addiction and sobriety. She also took part in the MusiCares MAP Fund benefit concert in 2010, which is focused on women's recovery from drug addiction to sobriety.[21]\n",
            "In 2011, Schemel was the subject of the documentary film Hit So Hard, directed by P. David Ebersole, which chronicles her early life, time in Hole, overcoming substance abuse, and life after quitting Hole.[22] The documentary includes interviews with the band, as well as home video footage recorded by Schemel, chronicling Hole's 1994–1995 Live Through This Tour.[22] The film premiered in New York at The Museum of Modern Art in March 2011 as part of the New Directors/New Films Festival, reuniting the classic Hole line-up in the same room for the first time in thirteen years.[23] Hit So Hard was also the Documentary Centerpiece at Outfest in Los Angeles in June 2011[24] and was released theatrically and on home video in 2012.[25] In April 2012, Schemel joined former Hole bandmates Melissa Auf der Maur, Courtney Love, and Eric Erlandson for a reunion performance at the Public Assembly in Brooklyn, New York following a screening of Hit So Hard.[26]\n",
            "In January 2013, Schemel joined the group Upset with Ali Koehler.[1] The same year, she formed the garage rock band Death Valley Girls with her brother, Larry.[27]\n",
            "Schemel published an autobiography, also titled Hit So Hard:A Memoir, in 2017 through Da Capo Press.[28] The book was praised for its candor, honesty and humor. In dealing with topics such as fame, addiction, coming out and more.[29][30][31]\n",
            "The following year, Schemel appeared as a drummer on Marissa Nadler's eighth studio album, For My Crimes (2018).[12] In 2019 Patty recorded a record with Upset produced by Steven McDonald of Redd Kross.[32]\n"
         ]
      }
   },
   "Discography": {
      "As a drummer": {
         "text": [
            "\n"
         ]
      }
   },
   "Notes": {},
   "References": {},
   "Sources": {},
   "Further reading": {},
   "External links": {},
   "coreData": [
      "Patricia Theresa Schemel (born April 24, 1967) is an American drummer and musician who rose to prominence as the drummer of alternative rock band Hole from 1992 until 1998. Born in Los Angeles, Schemel was raised in rural Marysville, Washington, where she developed an interest in punk rock music as a teenager. She began drumming at age eleven, and while in high school, formed several bands with her brother, Larry. \n",
      "Schemel was recommended as a drummer to Hole frontwoman Courtney Love by her husband, Kurt Cobain, a friend of Schemel's. She formally joined the band in 1992, and performed on their critically acclaimed second album, Live Through This (1994). On the band's third release, Celebrity Skin (1998), Schemel was replaced by a session drummer after its producer, Michael Beinhorn, convinced Love that Schemel was unable to adequately perform during their recording sessions. Though she receives credit on the album, her drumming does not appear on the final tracks, and the event marked her departure from the band. For the band's subsequent tour, Schemel was replaced by Samantha Maloney.\n",
      "After leaving Hole, Schemel developed a significant crack cocaine addiction, and was homeless for a time. In the early 2000s, she became sober and reunited with Love, joining the short-lived group Bastard before drumming on Love's debut solo album, America's Sweetheart (2004). Schemel subsequently drummed for Juliette and the Licks, appearing on their EP ...Like a Bolt of Lightning (2004). \n",
      "In 2010, using concert and video diary footage from Hole's 1994–1995 Live Through This world tour, Schemel co-created Hit So Hard, a documentary chronicling her time in Hole, her overcoming substance abuse, as well her subsequent business operating a dog boarding business. In 2013, she joined the indie rock group Upset, formed by Ali Koehler, previously of Vivian Girls and Best Coast,[1] and formed the band Death Valley Girls with her brother, Larry, the same year.\n"
   ],
   "infobox": {
      "Birth name": [
         "Patricia Theresa Schemel"
      ],
      "Born": [
         " (1967-04-24) April 24, 1967 (age 53)",
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Alternative rock",
         "punk rock",
         "indie rock",
         "grunge"
      ],
      "Occupation(s)": [
         "Musician"
      ],
      "Instruments": [
         "Drums",
         "guitar"
      ],
      "Years active": [
         "1987–present"
      ],
      "Labels": [
         "DGC",
         "Lauren",
         "Don Giovanni",
         "Geffen Records"
      ],
      "Associated acts": [
         "Kill Sybil",
         "Doll Squad",
         "The Primitives",
         "Hole",
         "Phranc",
         "Bastard",
         "Juliette and the Licks",
         "Courtney Love",
         "Imperial Teen",
         "Green Eyes",
         "Upset",
         "Death Valley Girls",
         "Marissa Nadler"
      ]
   }
}