{
   "Name": "Vivian Girls",
   "rawData": [
      "Vivian Girls are an American band from Brooklyn, New York. The only consistent members have been Cassie Ramone and Katy Goodman, on guitar and bass respectively, whereas the group had several drummers throughout its history. They took their name from a book by Henry Darger.\n",
      "Vivian Girls, named after the magnum opus of outsider author artist Henry Darger (titled The Story of the Vivian Girls, in What is Known as the Realms of the Unreal, of the Glandeco-Angelinian War Storm, Caused by the Child Slave Rebellion), started in Brooklyn, NY in March 2007 as the trio of Cassie Ramone (guitar/vocals); Katy \"Kickball Katy\" Goodman (bass/drums/vocals); and Frankie Rose (drums/bass/vocals). While only a band for a short while, they recorded a demo which included five original songs and a Wipers cover, and began to play locally in Brooklyn and Katy and Cassie's home state of New Jersey. Within the first couple of months they had already developed a strong local following, supporting acts like Jay Reatard, Sonic Youth and the King Khan & BBQ Show as well as finding kindred spirits in other locals like Cause Co-Motion!, Crystal Stilts, and Woods, with whom they’ve shared many bills and helped develop a local scene. The band is still very much connected to their home scene.\n",
      "In March 2008 they released the \"Wild Eyes\" single on the Plays With Dolls label. With very little promotion and distribution the single became an underground indie hit as it charted on many college radio playlists and garnered positive reviews on the internet.\nRecorded in the same session, their debut self-titled LP was released by the Mauled by Tigers label, whose initial pressing of the LP sold out in ten days.  During this time, the group signed with In The Red Records who released a new single in August 2008. In The Red re-released the Mauled by Tigers record on LP and CD formats in October 2008.\n"
   ],
   "infobox": {
      "Origin": [
         "Brooklyn, New York, United States"
      ],
      "Genres": [
         "Indie rock, dream pop, noise pop, lo-fi"
      ],
      "Years active": [
         "2007–2014",
         "2019–present"
      ],
      "Labels": [
         "Polyvinyl, In the Red"
      ],
      "Associated acts": [
         "La Sera, The Babies, Upset"
      ],
      "Website": [
         "viviangirls.net"
      ],
      "Members": [
         "Cassie Ramone",
         "\"Kickball Katy\" Goodman",
         "Ali Koehler"
      ],
      "Past members": [
         "Fiona Campbell",
         "Frankie Rose"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band from Brooklyn, New York. The only consistent members have been Cassie Ramone and [PERSON_NAME_FULL_0_FEMALE], on guitar and bass respectively, whereas the group had several drummers throughout its history. They took their name from a book by Henry Darger.\n",
      "[BAND_NAME], named after the magnum opus of outsider author artist Henry Darger (titled The Story of the [BAND_NAME], in What is Known as the Realms of the Unreal, of the Glandeco-Angelinian War Storm, Caused by the Child Slave Rebellion), started in Brooklyn, NY in [MONTH] [YEAR] as the trio of [PERSON_NAME_FULL_0_FEMALE] (guitar/vocals); Katy \"Kickball Katy\" Goodman (bass/drums/vocals); and Frankie Rose (drums/bass/vocals). While only a [GENRE] a short while, they recorded a demo which included five original songs and a Wipers cover, and began to play locally in Brooklyn and Katy and [PERSON_NAME_FIRST_0]'s home state of New Jersey. Within the first couple of months they had already developed a strong local following, supporting acts like [PERSON_NAME_FULL_1_MALE], Sonic Youth and the King Khan & BBQ Show as well as finding kindred spirits in other locals like Cause Co-Motion!, Crystal Stilts, and Woods, with whom they’ve shared many bills and helped develop a local scene. The band is still very much connected to their home scene.\n",
      "In [MONTH] [YEAR] they released the \"Wild Eyes\" single on the Plays With Dolls label. With very little promotion and distribution the single became an [GENRE] a new single in [MONTH] [YEAR]. In The Red re-released the Mauled by Tigers record on LP and CD formats in [MONTH] [YEAR].\n"
   ]
}