{
   "Band members": {},
   "Discography": {
      "Albums": {},
      "Compilation appearances": {},
      "EPs": {},
      "Singles": {}
   },
   "External links": {},
   "Further reading": {},
   "History": {
      "2007–2014": {
         "text": [
            "Vivian Girls, named after the magnum opus of outsider author artist Henry Darger (titled The Story of the Vivian Girls, in What is Known as the Realms of the Unreal, of the Glandeco-Angelinian War Storm, Caused by the Child Slave Rebellion), started in Brooklyn, NY in March 2007 as the trio of Cassie Ramone (guitar/vocals); Katy \"Kickball Katy\" Goodman[3] (bass/drums/vocals); and Frankie Rose (drums/bass/vocals).[4] While only a band for a short while, they recorded a demo which included five original songs and a Wipers cover, and began to play locally in Brooklyn and Katy and Cassie's home state of New Jersey.[1] Within the first couple of months they had already developed a strong local following, supporting acts like Jay Reatard, Sonic Youth and the King Khan & BBQ Show as well as finding kindred spirits in other locals like Cause Co-Motion!, Crystal Stilts, and Woods, with whom they’ve shared many bills and helped develop a local scene. The band is still very much connected to their home scene.[5]\n",
            "In March 2008 they released the \"Wild Eyes\" single on the Plays With Dolls label.[6] With very little promotion and distribution the single became an underground indie hit as it charted on many college radio playlists and garnered positive reviews on the internet.[7]\nRecorded in the same session, their debut self-titled LP was released by the Mauled by Tigers label, whose initial pressing of the LP sold out in ten days.[2]  During this time, the group signed with In The Red Records who released a new single in August 2008.[8] In The Red re-released the Mauled by Tigers record on LP and CD formats in October 2008.[9]\n",
            "In July 2008 the band underwent a lineup change with new drummer Ali Koehler replacing Frankie Rose.[10] The band then went on an extensive tour that saw them visit the U.S., UK, Australia, New Zealand, Japan and Puerto Rico in two months.[11]\n",
            "Their second album, Everything Goes Wrong was released by In The Red in September 2009.\n[12] In May 2010 Fiona Campbell of Coasting replaced Ali Koehler becoming Vivian Girls third drummer.  With her they have toured with their third album \"Share The Joy\" to Europe, UK, Thailand, Japan, Hong Kong, and the US.  Fiona is native to New Zealand and previously played there in a band called The Coolies.\n",
            "Katy Goodman formed a side project with Cat Power's Gregg Foreman named All Saints Day, and the band has digitally released one self-titled EP. She now has a solo project La Sera. Cassie Ramone has a side project called The Babies with Woods bassist Kevin Morby. They have released two studio albums in 2011 and 2012. Fiona Campbell also plays in Coasting and Chain & The Gang, and is co-owner of M'Lady's Records.\n",
            "The band also featured on the track 'Worse to Come' on noise pop band Male Bonding's debut album Nothing Hurts.\n",
            "Vivian Girls' third album Share the Joy was released in spring 2011 by Polyvinyl Record Co..[13]\n",
            "In January 2014, the band announced they were breaking up, featuring two last shows at The Church on York in Los Angeles, and Death by Audio in Brooklyn.[14][15] They reunited in October 2015 to play two songs at bassist \"Kickball\" Katy Goodman's wedding.[16]\n"
         ]
      },
      "2019–present": {
         "text": [
            "On July 17, 2019, Cassie Ramone, Katy Goodman, and Ali Koehler announced the band's reformation alongside a new full-length album called Memory to be released in September.[17] It was recorded in 2018 with producer Rob Barbato.[18] On August 14, 2019, a music video for the song 'Something To Do', directed by Jason Lester, was released.[19] On September 10, 2019, a music video for the song 'Sludge', directed by Alex Ross Perry, was released.\n"
         ]
      }
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 2007–2014",
      "1.2 2019–present",
      "2 Band members",
      "3 Discography",
      "3.1 Albums",
      "3.2 EPs",
      "3.3 Singles",
      "3.4 Compilation appearances",
      "4 References",
      "5 Further reading",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Vivian Girls are an American band from Brooklyn, New York. The only consistent members have been Cassie Ramone and Katy Goodman, on guitar and bass respectively, whereas the group had several drummers throughout its history. They took their name from a book by Henry Darger.[1][2]\n"
      ]
   },
   "Title": "Vivian Girls - Wikipedia"
}