{
   "Name": "Jan Kuehnemund",
   "rawData": [
      "Janice Lynn \"Jan\" Kuehnemund (/ˈkuːnəmənd, ˈkjuː-, ˈkiː-/; November 18, 1953 – October 10, 2013) was an American lead guitarist who founded the all-female hard rock/glam metal band Vixen.\n",
      "Born in St. Paul, Minnesota, Kuehnemund formed an all-female band known as Genesis in St. Paul in 1971, initially as a quintet under the name Lemon Pepper. Her father Carl served as a roadie during her band's earliest days. Genesis was later renamed Vixen to prevent confusion with the same-named English band before breaking up in 1974. A bandmate of hers during that year was Nancy Shanks. After a six-year hiatus she reformed Vixen and shortly moved her band to Los Angeles in 1981, and, in 1983, singer Janet Gardner joined her. The band gained notice by appearing in the 1984 teen film Hardbodies under the on-screen name Diaper Rash. They were also a quintet at the time. She eventually added Roxy Petrucci on drums and fellow Minnesotan Share Ross, then known as Share Pedersen, on bass, the lineup that signed to EMI Records. They released their self-titled debut, Vixen, in 1988. It was released by Manhattan Records in the U.S. and Canada. The band toured with the Scorpions, Ozzy Osbourne, and Bon Jovi, and appeared in Penelope Spheeris' 1988 film, The Decline of Western Civilization Part II: The Metal Years, although only Gardner, Pedersen, and Petrucci appeared in the film.\n",
      "The album Rev It Up followed in 1990, along with tours with Kiss and Deep Purple. The band's album sales declined and they were dropped from their record label. Vixen disbanded in 1991, but formed again in 1997 without Kuehnemund, while she was working on side project Drawing Down the Moon. Kuehnemund sued and won the rights to the band's name, after she realized that the rest of Vixen left her out and usurped her right to represent them. She then continued the band in 2001 with new members, and toured and released Live & Learn in 2006. Gardner, Petrucci, and Ross (née Pedersen) formed their own band JanetShareRoxyGina (aka JSRG) with 1997 Vixen guitarist Gina Stile. The group's most well-known lineup did briefly reunite in 2004 to perform for VH1's Bands Reunited.\n"
   ],
   "infobox": {
      "Birth name": [
         "Janice Lynn Kuehnemund"
      ],
      "Born": [
         "(1953-11-18)November 18, 1953",
         "Saint Paul, Minnesota, U.S."
      ],
      "Died": [
         "October 10, 2013(2013-10-10) (aged 59)",
         "Colorado Springs, Colorado, U.S."
      ],
      "Genres": [
         "Hard rock, glam metal, pop rock"
      ],
      "Occupation(s)": [
         "Guitarist, vocalist, songwriter"
      ],
      "Instruments": [
         "Guitar, vocals"
      ],
      "Years active": [
         "1971–74, 1980–2013"
      ],
      "Associated acts": [
         "Vixen, Lemon Pepper/Genesis, Population 361, Drawing Down the Moon, Jeff Paris"
      ]
   }
}