{
   "Discography": {},
   "External links": {},
   "Motivational speaker/trainer": {
      "text": [
         "In addition to her musical career, Ross is also a life coach, specializing in confidence-building, with particular reference to self-promotion via video, with her \"Video Rockstar University\"[10] program, and a motivational course, \"MESH\".[11] Her programs are predominantly targeted at self-employed businesswomen.\n",
         "She has also published a book of hip knitting designs, Punk Knits published by Stewart, Tabori and Chang.\n"
      ]
   },
   "Music career": {
      "text": [
         "Ross joined Vixen in 1987, replacing Pia Maiocco, and remained with the band until 1992. After leaving Vixen, she co-formed the supergroup, Contraband, releasing only one album. When Vixen reunited in 1997, she had no interest in coming back, as she was playing in her husband's band, Bubble.\n",
         "In 1999, Ross and her husband Bam co-wrote the songs on Jesse Camp's debut album, Jesse & The 8th Street Kidz.[2]\n",
         "Bubble won Song of the Year in the John Lennon Songwriting Contest in 2000 with their song, Sparkle Star. It was also featured in the film starring Daryl Hannah, Dancing at the Blue Iguana.\n",
         "In 2003, Ross toured with her husband's band, The Dogs D'Amour, and opened up for Alice Cooper on a European tour. She contributed to two albums that were released in 2000 for his band before the couple left the group after the tour.\n",
         "In 2006, Ross became the host and co-producer of the now-defunct video podcast Rock n Roll TV, an online show which featured up-and-coming punk/garage/rock bands and rock news,[3] and in 2010, she played for one night only in a cover band L.A. Nookie, with future Vixen bandmate, Femme Fatale's Lorraine Lewis on vocals, to support Ratt at the latter's party for the release of their seventh and most recent album Infestation.[4] As Share Pedersen, Ross recorded with Ratt's former drummer Bobby Blotzer on Contraband's lone, self-titled album.\n",
         "In 2012, Ross reunited with her former Vixen bandmates, Roxy Petrucci and Janet Gardner, along with Gina Stile to form a new band originally known as \"VXN\"[5] and now using simply their names as the band name of JanetShareRoxyGina (or JSRG for short). The band began performing shows in late 2012 and went on tour with the Monsters of Rock cruise in 2013.[6] Late in 2013 JSRG changed their name back to Vixen in accordance with the wishes[7] of founding member and guitarist Jan Kuehnemund who was unable to be part of the reformed band due to her battle with cancer and shock passing on October 10, 2013.\n",
         "After sitting in on bass with the Quireboys during the 2014 Monsters of Rock Cruise (due to the absence of their regular bassist), she was invited to join Joe Elliott's Down 'n' Outz[8] on their December 2014 UK tour. This Is How We Roll, her first album with that band, came out on October 11, 2019.[9]\n",
         "In contrast to all of Vixen's past concerts, Ross, primarily a backing vocalist, handled lead vocals on the band's cover of \"I Don't Need No Doctor\" during their 2017 and 2018 live tours instead of Gardner, her best friend and Vixen's long-time lead singer.\n"
      ]
   },
   "Personal life": {
      "text": [
         "Share and Bam Ross adopted a raw vegan lifestyle in 2006 through the Raw Pirate Gourmet.[12] She shares the same birthday with Janet Gardner, her former Vixen bandmate.[13]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Music career",
      "2 Motivational speaker/trainer",
      "3 Personal life",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Sharon June \"Share\" Ross (formerly Pedersen; born Sharon June Howe; March 21, 1963 in Glencoe, Minnesota) is the bass player of the female hard rock band, Vixen.[1]\n"
      ]
   },
   "Title": "Share Ross - Wikipedia"
}