{
   "Name": "Britt Lightning",
   "Sections": [
      "Summary"
   ],
   "Summary": {
      "text": [
         "Brittany Denaro (born February 2, 1985), best known as Britt Lightning, is the lead guitarist for the band Vixen.[1]\n",
         "From 2004 to 2011, Lightning performed in Jaded,[2] an all-female hard rock based out of Boston. The band released two albums, the latter including tracks produced by legendary producer Gary Katz (Steely Dan).[3] Jaded was a staple band in the Locobazooka,[4] Rock 101 and WAAF festivals, and the New Jersey KISS Expos.[5] In 2006, the band toured Europe in support of W.A.S.P.\n",
         "In 2011, Lightning joined the New York-based rock musical Chix6 as the character and guitar player \"Lick,\" which ran at the Queens Theatre.[6][7]\n",
         "From 2012 to 2015, Lightning performed for 18-time Grammy Award-winning artist Alejandro Sanz in his stadium-level world tour, supporting his album La Música No Se Toca, which reached number one on the Mexican Top Album, Spanish Top Album, and Billboard US Latin Top Album and Top Album charts.[8] Lightning is featured in Sanz's La Música No Se Toca - En Vivo CD/DVD. She joined Sanz at the 2013 Latin Grammy Awards in Las Vegas performing the single \"No Me Compares.\"[9]\n",
         "In 2013, Lightning performed on Live with Kelly and Michael with Jason Derulo to promote his album Tattoos.[10]\n",
         "From 2015 to 2016, Lightning was the guitarist for Rachel Platten, performing at festivals and on various national television and radio specials and programs. She performed alongside Platten to promote the single \"Fight Song\" (which charted at #6 on the Billboard Hot 100 chart), live on Good Morning America, the Today Show, Live with Kelly and Michael, VH1, the 2015 Teen Choice Awards, Nickelodeon and on the 2016 finale of America's Got Talent, which took place at New York City's Radio City Music Hall.[11][12]\n",
         "In 2017, Lightning replaced Gina Stile as the guitarist in the all-female American rock band Vixen, the only all-female hard rock band from the 1980s to sell over one million albums, have six number one videos on MTV and enter four songs on Billboard's Top 100.[13]\n",
         "In addition to Vixen, Lightning has also performed with Paradise Kitty, a female Guns N' Roses cover band.[14]\n"
      ]
   },
   "coreData": [
      "Brittany Denaro (born February 2, 1985), best known as Britt Lightning, is the lead guitarist for the band Vixen.[1]\n",
      "From 2004 to 2011, Lightning performed in Jaded,[2] an all-female hard rock based out of Boston. The band released two albums, the latter including tracks produced by legendary producer Gary Katz (Steely Dan).[3] Jaded was a staple band in the Locobazooka,[4] Rock 101 and WAAF festivals, and the New Jersey KISS Expos.[5] In 2006, the band toured Europe in support of W.A.S.P.\n",
      "In 2011, Lightning joined the New York-based rock musical Chix6 as the character and guitar player \"Lick,\" which ran at the Queens Theatre.[6][7]\n",
      "From 2012 to 2015, Lightning performed for 18-time Grammy Award-winning artist Alejandro Sanz in his stadium-level world tour, supporting his album La Música No Se Toca, which reached number one on the Mexican Top Album, Spanish Top Album, and Billboard US Latin Top Album and Top Album charts.[8] Lightning is featured in Sanz's La Música No Se Toca - En Vivo CD/DVD. She joined Sanz at the 2013 Latin Grammy Awards in Las Vegas performing the single \"No Me Compares.\"[9]\n"
   ]
}