{
   "Name": "The Great Society (band)",
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "3.1 Albums",
      "3.2 Singles",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Great Society (also known as The Great!! Society!!) was a 1960s San Francisco rock band that existed from 1965 to 1966, and was closely associated with the burgeoning Bay Area acid rock scene. Best known as the original group of model-turned-singer Grace Slick, the initial line-up of the band also featured her then-husband Jerry Slick on drums, his brother Darby Slick on guitar, David Miner on vocals and guitar, Bard DuPont on bass, and Peter van Gelder on flute, bass, and saxophone.  Miner and DuPont did not remain with the band for the duration of its existence.[3]\n"
      ]
   },
   "History": {
      "text": [
         "In the late summer of 1965, Grace, Darby, and Jerry were inspired by The Beatles to start their own group.[4] Grace has said that seeing Jefferson Airplane perform for the first time was an influence as well.[5] The band made its debut at the Coffee Gallery in San Francisco's North Beach neighborhood on October 15, 1965 and continued to perform throughout 1966.\n",
         "The band released only one single during its lifetime, the Darby Slick-penned \"Someone to Love\" (b/w \"Free Advice\"). The single was issued in February 1966 on Autumn Records' a tiny Northbeach subsidiary label and made little impact outside of the Bay Area.[4] While signed to Autumn Records, the band worked with the label's staff producer Sylvester Stewart (better known as Sly Stone), who at the time was still in the process of forming Sly and the Family Stone. Purportedly, Stewart eventually walked out as the band's producer after it took The Great Society over 50 takes to record a version of the song \"Free Advice\" that was suitable for release.\n",
         "Momentum for the band began to build as they started opening for Jefferson Airplane and other successful local bands, with Columbia Records offering The Great Society a recording contract. However, by the time the contract arrived in the mail, Grace had decided to replace departing vocalist Signe Toly Anderson in the Airplane.[6] Because Grace had been both the visual and musical focal point, the band could not survive without her and disbanded in the fall of 1966.[4] Grace and Jerry Slick soon divorced.\n",
         "The Airplane recorded \"Someone to Love\" (retitled as \"Somebody to Love\") and Grace's own \"White Rabbit\" for Surrealistic Pillow.[4] Both songs were released as singles in 1967, reaching No. 5 and No. 8 on the Billboard Hot 100 respectively.[7] To capitalize on Grace's fame with the Airplane, Columbia Records released tapes of live performances by The Great Society on the 1968 albums Conspicuous Only in Its Absence and How It Was.[4] All of those performances were recorded at The Matrix, a small nightclub in the Cow Hollow neighborhood of San Francisco, and its house band was the Airplane. These two albums were repackaged as a double LP titled Collector's Item in 1971. This double album has been issued twice on CD, once by Edsel Records in 1989 (under the title Live at the Matrix) and in 2008 by Columbia under its original title. In 1995, Sundazed Records released the Born to Be Burned compilation, featuring both sides of the band's debut single along with a number of previously unreleased studio recordings. (There is an error on the Sundazed CD; Track 1 is listed as being the issued take of \"Free Advice\" on the Northbeach single. This is wrong; the issued take is in fact track 16, with a slight edit at the end.)\n",
         "\"The Great Society\" was a popular name for musical groups in the 1960s due to the popularity of the term as used by Lyndon B. Johnson's administration for his Great Society. On one occasion, in Fort Worth, Texas, The Great Society (with Grace Slick) and a similarly named four-man group performed on opposite sides of the city on the same evening.\n"
      ]
   },
   "Members": {},
   "Discography": {
      "Albums": {
         "text": [
            "1A live concert version of \"Somebody to Love\" from this album was included on the 1968 Columbia Records' sampler, Rock Machine - I Love You.\n"
         ]
      },
      "Singles": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Great Society (also known as The Great!! Society!!) was a 1960s San Francisco rock band that existed from 1965 to 1966, and was closely associated with the burgeoning Bay Area acid rock scene. Best known as the original group of model-turned-singer Grace Slick, the initial line-up of the band also featured her then-husband Jerry Slick on drums, his brother Darby Slick on guitar, David Miner on vocals and guitar, Bard DuPont on bass, and Peter van Gelder on flute, bass, and saxophone.  Miner and DuPont did not remain with the band for the duration of its existence.[3]\n",
      "In the late summer of 1965, Grace, Darby, and Jerry were inspired by The Beatles to start their own group.[4] Grace has said that seeing Jefferson Airplane perform for the first time was an influence as well.[5] The band made its debut at the Coffee Gallery in San Francisco's North Beach neighborhood on October 15, 1965 and continued to perform throughout 1966.\n",
      "The band released only one single during its lifetime, the Darby Slick-penned \"Someone to Love\" (b/w \"Free Advice\"). The single was issued in February 1966 on Autumn Records' a tiny Northbeach subsidiary label and made little impact outside of the Bay Area.[4] While signed to Autumn Records, the band worked with the label's staff producer Sylvester Stewart (better known as Sly Stone), who at the time was still in the process of forming Sly and the Family Stone. Purportedly, Stewart eventually walked out as the band's producer after it took The Great Society over 50 takes to record a version of the song \"Free Advice\" that was suitable for release.\n",
      "Momentum for the band began to build as they started opening for Jefferson Airplane and other successful local bands, with Columbia Records offering The Great Society a recording contract. However, by the time the contract arrived in the mail, Grace had decided to replace departing vocalist Signe Toly Anderson in the Airplane.[6] Because Grace had been both the visual and musical focal point, the band could not survive without her and disbanded in the fall of 1966.[4] Grace and Jerry Slick soon divorced.\n"
   ]
}