{
   "Name": "The Great Society (band)",
   "rawData": [
      "The Great Society (also known as The Great!! Society!!) was a 1960s San Francisco rock band that existed from 1965 to 1966, and was closely associated with the burgeoning Bay Area acid rock scene. Best known as the original group of model-turned-singer Grace Slick, the initial line-up of the band also featured her then-husband Jerry Slick on drums, his brother Darby Slick on guitar, David Miner on vocals and guitar, Bard DuPont on bass, and Peter van Gelder on flute, bass, and saxophone.  Miner and DuPont did not remain with the band for the duration of its existence.\n",
      "In the late summer of 1965, Grace, Darby, and Jerry were inspired by The Beatles to start their own group. Grace has said that seeing Jefferson Airplane perform for the first time was an influence as well. The band made its debut at the Coffee Gallery in San Francisco's North Beach neighborhood on October 15, 1965 and continued to perform throughout 1966.\n",
      "The band released only one single during its lifetime, the Darby Slick-penned \"Someone to Love\" (b/w \"Free Advice\"). The single was issued in February 1966 on Autumn Records' a tiny Northbeach subsidiary label and made little impact outside of the Bay Area. While signed to Autumn Records, the band worked with the label's staff producer Sylvester Stewart (better known as Sly Stone), who at the time was still in the process of forming Sly and the Family Stone. Purportedly, Stewart eventually walked out as the band's producer after it took The Great Society over 50 takes to record a version of the song \"Free Advice\" that was suitable for release.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Psychedelic rock,[1] acid rock[2]"
      ],
      "Years active": [
         "1965–1966"
      ],
      "Labels": [
         "Northbeach, Challenge, Columbia, Sundazed"
      ],
      "Associated acts": [
         "Jefferson Airplane"
      ],
      "Past members": [
         "Darby Slick",
         "Grace Slick",
         "Jerry Slick",
         "Peter van Gelder",
         "David Miner",
         "Bard Dupont",
         "Oscar Daniels",
         "Jean Piersol"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] (also known as The Great!! Society!!) was a [YEAR]s [PERSON_NAME_FULL_0_MALE] rock band that existed from [YEAR] to [YEAR], and was closely associated with the burgeoning Bay Area acid rock scene. Best known as the original group of model-turned-singer [PERSON_NAME_FULL_1_FEMALE], the initial line-up of the band also featured her then-husband Jerry [PERSON_NAME_LAST_1] on drums, his brother [PERSON_NAME_FIRST_2] [PERSON_NAME_LAST_1] on guitar, David Miner on vocals and guitar, Bard DuPont on bass, and Peter van Gelder on flute, bass, and saxophone.  Miner and DuPont did not remain with the band for the duration of its existence.\n",
      "In the late summer of [YEAR], Grace, Darby, and Jerry were inspired by The Beatles to start their own group. Grace has said that seeing Jefferson Airplane perform for the first time was an [GENRE] band made its debut at the Coffee Gallery in San Francisco's North Beach neighborhood on [MONTH] 15, [YEAR] and continued to perform throughout [YEAR].\n",
      "The band released only one single during its lifetime, the Darby Slick-penned [SONG_NAME] that was suitable for release.\n"
   ]
}