{
   "Name": "Warpaint (band)",
   "Sections": [
      "1 History",
      "1.1 Beginning and formation (2004–2007)",
      "1.2 Exquisite Corpse (2007–2009)",
      "1.3 The Fool (2009–2011)",
      "1.4 Warpaint (2014–2015)",
      "1.5 Heads Up (2016–present)",
      "2 Style",
      "3 Discography",
      "4 Members",
      "4.1 Timeline",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Warpaint is an American indie rock band from Los Angeles, California, formed in 2004.[1] The band consists of Emily Kokal (vocals, guitar), Theresa Wayman (vocals, guitar), Jenny Lee Lindberg (bass, vocals), and Stella Mozgawa (drums).\n",
         "To date, the band has released four studio albums: Exquisite Corpse (EP, 2008), The Fool (2010), Warpaint (2014), and Heads Up (2016).\n"
      ]
   },
   "History": {
      "Beginning and formation (2004–2007)": {
         "text": [
            "Warpaint formed in Los Angeles on Valentine's Day 2004. The original lineup consisted of childhood friends Wayman and Kokal alongside sisters Lindberg and Shannyn Sossamon. The band played in the Los Angeles area for three years, writing songs (\"Stars\", \"Beetles\" and \"Elephants\") which would eventually comprise their debut EP.[citation needed]\n"
         ]
      },
      "Exquisite Corpse (2007–2009)": {
         "text": [
            "The band began recording their debut EP, Exquisite Corpse, in December 2007, with producer Jacob Bercovici. The sessions took over two months and concluded with mixing and mastering by John Frusciante, who was also Kokal's boyfriend at the time. Warpaint self-released the EP in 2008, which quickly moved to No. 1 on the Los Angeles Amoeba Records local artist chart. In 2009, Exquisite Corpse was rereleased worldwide by Manimal Vinyl, to critical acclaim. The song \"Elephants\" featured in the 2011 independent horror film Siren, directed by Andrew Hull and released by Lionsgate.[citation needed]\n",
            "Current Red Hot Chili Peppers guitarist John Frusciante mixed and mastered Exquisite Corpse. Former RHCP guitarist Josh Klinghoffer performed drums and guitar on the EP in 2007.[citation needed]\n",
            "Australian drummer Mozgawa (formerly of Mink and Swahili Blonde) joined the band in the winter of 2009. Shortly afterwards, Warpaint were signed to Rough Trade Records, and immediately began extensive touring throughout the United States and Europe, including an opening slot for the xx.[2]\n",
            "On December 6, 2010, the BBC announced that Warpaint had been nominated for the BBC's Sound of 2011 poll and they were the cover stars of Beat magazine's Winter 2010 launch issue.[3]\n"
         ]
      },
      "The Fool (2009–2011)": {
         "text": [
            "On October 25, 2010, the band released their debut album, The Fool.[4] The album received a glowing review from NME.[5] Prior to the album's release, the band contributed a cover of the David Bowie song \"Ashes to Ashes\" to We Were So Turned On, a Bowie tribute album released in conjunction with War Child. \"Shadows\", the first single from their debut album, was released as a digital download and 12\" vinyl on January 10, 2011.[6] A remix of the single, \"Shadows (Neon Lights Remix)\", proved popular;[7] managing to be playlisted by BBC Radio 1 as part of \"In New Music We Trust\".\n",
            "Warpaint toured the U.S. and Europe in the spring and summer of 2011 to promote the album. They played at various major festivals including Summer Sundae, Bonnaroo, Glastonbury Festival, Reading and Leeds Festivals, Coachella Valley Music and Arts Festival, Rock Werchter, and Electric Picnic. In 2011, the rerelease of the track \"Undertow\" as a single charted in the UK at No. 92 and in Australia at No. 75. On September 25, 2011, they played the prestigious Hollywood Bowl, sharing the bill with TV on the Radio, Arctic Monkeys, Panda Bear and Smith Westerns.[8]\n"
         ]
      },
      "Warpaint (2014–2015)": {
         "text": [
            "As early as 2011, drummer Mozgawa, in an interview with NME, expressed the band's intention to \"experiment and write with one another\" as the current lineup had never composed songs \"from the ground up\" together. Bassist Lindberg further indicated that most of the newer songs were written by \"just jam[ming] and free-flow[ing] onstage\".[9] In February 2013, Wayman confirmed to NME that the band intended to create a minimalist sound on Warpaint, revealing that the band developed songs at soundchecks, and experimented more with acoustic guitars and percussion instruments on the album.[10] Lead vocalist Kokal noted that R&B and rap music were influences on Warpaint and stated that the album featured \"things that have drum machines and ambience, music that's more than standard rock\". Kokal added that the album was largely keyboards-based, which contributed to the overall sound being \"definitely different\" from the band's previous album, The Fool.[11]\n",
            "Produced and mixed by Flood, except two tracks which were mixed by Nigel Godrich, Warpaint was released by Rough Trade on January 17, 2014 in Germany, Ireland, Netherlands and Switzerland; January 20 in Denmark, France, Sweden and the United Kingdom; and January 21 in Spain and the U.S. A snippet of the album's lead single, \"Love Is to Die\", was featured in an advertisement for Calvin Klein on September 25, 2013[12] and later as part of a teaser for an upcoming documentary of the same name about the recording of Warpaint.[13] The single was released on October 28 with the pre-ordered digital version of the album.\n",
            "On November 20, Warpaint performed \"Composure,\" from The Fool, as well as new songs \"Love Is to Die\" and \"Keep It Healthy\", on BBC 6 Music with Steve Lamacq in the U.K. The next day, an article from the December 2013 issue of Dazed & Confused magazine appeared online, providing insight into the making of the new album, as well as the accompanying documentary, filmed by Lindberg's husband, video artist Chris Cunningham (the subject of the song \"CC\").[14] Lindberg later confirmed in a November 24 interview on XFM that Cunningham's documentary would be made available shortly after the album's release.[15]\n",
            "A music video, composed of a two-song vignette from the second album—\"Disco//very\" and \"Keep it Healthy\"—was released in April 2014. Directed by Laban Pheidias, the video featured skateboarding from professional skateboarders Justin Eldridge, Kris Markovich and Patrick Melcher.[16]\n",
            "The band toured in promotion of the album up to summer 2015, after which its members began separate projects. Kokal collaborated with folk musician Paul Bergmann, contributing vocals to Bergmann's extended play Romantic Thoughts (2015);[17] Wayman formed a supergroup, BOSS, with Sarah Jones of Hot Chip and Guro Gikling of All We Are, and recorded material for a solo album;[18] Mozgawa recorded with Andy Clockwise and Kurt Vile;[19] and Lindberg released her debut solo album, Right On! (2015), on which Mozgawa also performed drums.\n"
         ]
      },
      "Heads Up (2016–present)": {
         "text": [
            "On August 1, 2016, Warpaint released a single titled \"New Song\",[20] and announced the September 23 release of its third studio album, Heads Up.[21][22] Beginning August 23 until October 27, 2017, they toured as special guest and opening act of Depeche Mode's Global Spirit Tour.[23] Their four dates opening for Depeche Mode at the Hollywood Bowl marked the first time a band played four consecutive shows at the famed Los Angeles venue.[24] The band also toured in support of Harry Styles on a handful of dates in Asia in May 2018.\n"
         ]
      }
   },
   "Style": {
      "text": [
         "Warpaint's style has been characterized as art rock,[25][26] dream pop[27] and psychedelic rock.[28] NME has described their style as \"intermittently emerging from plaintive moods into harder rocking, they play expansive, lushly-harmonic psych-rock songs with enough time-changes to satisfy even the most beardy prog-rock bong-tokers\".[29] They have been compared to Cocteau Twins,[30] Joni Mitchell,[31] and Siouxsie and the Banshees.[31] Other influences include Kraftwerk, Depeche Mode and Public Image Ltd.[32] The band has also cited hip-hop as an influence of their work. Two songs have been named after their favorite rappers: Biggy and Dre.[citation needed]\n"
      ]
   },
   "Discography": {},
   "Members": {
      "Timeline": {},
      "text": [
         "Current members\n",
         "Former members\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Warpaint is an American indie rock band from Los Angeles, California, formed in 2004.[1] The band consists of Emily Kokal (vocals, guitar), Theresa Wayman (vocals, guitar), Jenny Lee Lindberg (bass, vocals), and Stella Mozgawa (drums).\n",
      "To date, the band has released four studio albums: Exquisite Corpse (EP, 2008), The Fool (2010), Warpaint (2014), and Heads Up (2016).\n",
      "Warpaint formed in Los Angeles on Valentine's Day 2004. The original lineup consisted of childhood friends Wayman and Kokal alongside sisters Lindberg and Shannyn Sossamon. The band played in the Los Angeles area for three years, writing songs (\"Stars\", \"Beetles\" and \"Elephants\") which would eventually comprise their debut EP.[citation needed]\n",
      "The band began recording their debut EP, Exquisite Corpse, in December 2007, with producer Jacob Bercovici. The sessions took over two months and concluded with mixing and mastering by John Frusciante, who was also Kokal's boyfriend at the time. Warpaint self-released the EP in 2008, which quickly moved to No. 1 on the Los Angeles Amoeba Records local artist chart. In 2009, Exquisite Corpse was rereleased worldwide by Manimal Vinyl, to critical acclaim. The song \"Elephants\" featured in the 2011 independent horror film Siren, directed by Andrew Hull and released by Lionsgate.[citation needed]\n"
   ]
}