{
   "Name": "Zone (band)",
   "rawData": [
      "Zone were all-female rock band started in Sapporo, Japan in 1997. Although it initially started as a dance group, they turned to an all-female band. Zone has been categorized in a new genre called \"bandol\" (a portmanteau of the words band and idol). The band was started and managed by Studio RunTime and released their first single, \"Good Days\", under the major record label Sony Records, on February 7, 2001.  The group has officially ended on March 2, 2013.\n",
      "Their most famous song is \"Secret Base (Kimi ga Kureta Mono)\", released on August 8, 2001. The single sold about 744,000 copies on Japanese Oricon charts.\n",
      "Zone started off with eight members in 1997, then reduced to six and finally to four – Miyu Nagase, Mizuho Saito, Maiko Sakae, and Takayo Ookoshi – by the time they released their first indie disc in 1999.\n"
   ],
   "infobox": {
      "Origin": [
         "Sapporo, Japan"
      ],
      "Genres": [
         "J-pop",
         "rock"
      ],
      "Years active": [
         "1997–2005, 2011–2013"
      ],
      "Labels": [
         "Sony Music"
      ],
      "Past members": [
         "Miyu Nagase",
         "Mizuho Saito",
         "Maiko Sakae",
         "Takayo Ookoshi",
         "Tomoka Nishimura"
      ]
   },
   "prunedData": [
      "[BAND_NAME] were all-female rock band started in Sapporo, Japan in [YEAR]. Although it initially started as a [GENRE] an all-female band. [BAND_NAME] has been categorized in a new genre called \"bandol\" (a portmanteau of the words band and idol). The band was started and managed by Studio RunTime and released their first single, \"Good Days\", under the major record label Sony Records, on [MONTH] 7, [YEAR].  The group has officially ended on [MONTH] 2, [YEAR].\n",
      "Their most famous song is \"Secret Base (Kimi ga Kureta Mono)\", released on [MONTH] 8, [YEAR]. The single sold about 744,000 copies on Japanese Oricon charts.\n",
      "[BAND_NAME] started off with eight members in [YEAR], then reduced to six and finally to four – [PERSON_NAME_FULL_1_FEMALE], [PERSON_NAME_FULL_2_FEMALE], [PERSON_NAME_FULL_3_FEMALE], and [PERSON_NAME_FULL_0_FEMALE] – by the time they released their first indie disc in [YEAR].\n"
   ]
}