{
   "Name": "Hickey (band)",
   "rawData": [
      "Hickey (also known as \"The Naked Cult of Hickey\") was an American melodic punk band from San Francisco's Mission District, California, United States.  The band often recorded, released and distributed their own music. Elaborate and very personal artwork was the style used for the band's records, and they were well known for their raucous and sometimes antagonizing live performances.\n",
      "Hickey was started in 1994 by guitarist/singer Matty Luv and drummer Aesop Dekker following the demise of their previous band, FuckBoyz, who had moved from south Florida to San Francisco's Mission District earlier in the year.  The trio was rounded out by bassist Chubby, formerly of Schleprok.\n",
      "Hickey recorded their first 7\" EP, Us vs. Them, within a month of forming and released it soon afterwards.  The band quickly became a part of the Probe Records scene, featured in the Probe zine and on a few of the label's releases.  Later, Hickey made split 7\" records with bands such as All You Can Eat, Fuckface and V.B.F.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Punk rock"
      ],
      "Years active": [
         "1994–1998"
      ],
      "Labels": [
         "Probe Records, Poverty Records"
      ],
      "Associated acts": [
         "Fuckboyz, Schleprok, Agalloch, Ludicra, Yogurt, The Unit Breed"
      ],
      "Members": [
         "Matty Luv",
         "Aesop",
         "Chubby",
         "Dwight Trash"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (also known as \"The Naked Cult of [BAND_NAME]\") was an [GENRE] band from San Francisco's Mission District, California, United States.  The band often recorded, released and distributed their own music. Elaborate and very personal artwork was the style used for the band's records, and they were well known for their raucous and sometimes antagonizing live performances.\n",
      "[BAND_NAME] was started in [YEAR] by guitarist/singer [PERSON_NAME_FULL_0_FEMALE] and drummer Aesop Dekker following the demise of their previous band, FuckBoyz, who had moved from south Florida to San Francisco's Mission District earlier in the year.  The trio was rounded out by bassist Chubby, formerly of Schleprok.\n",
      "[BAND_NAME] recorded their first 7\" EP, Us vs. Them, within a [GENRE] band quickly became a part of the Probe Records scene, featured in the Probe zine and on a few of the label's releases.  Later, [BAND_NAME] made split 7\" records with bands such as All You Can Eat, Fuckface and V.B.F.\n"
   ]
}