{
   "Name": "Hickey (band)",
   "Sections": [
      "1 Founding members",
      "2 History",
      "3 Voodoo Glow Skulls controversy",
      "4 Discography",
      "4.1 Albums",
      "4.2 Extended plays",
      "4.3 Split releases",
      "4.4 Compilation appearances",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Hickey (also known as \"The Naked Cult of Hickey\") was an American melodic punk band from San Francisco's Mission District, California, United States.  The band often recorded, released and distributed their own music. Elaborate and very personal artwork was the style used for the band's records, and they were well known for their raucous and sometimes antagonizing live performances.\n"
      ]
   },
   "Founding members": {
      "text": [
         "Hickey was started in 1994 by guitarist/singer Matty Luv and drummer Aesop Dekker following the demise of their previous band, FuckBoyz, who had moved from south Florida to San Francisco's Mission District earlier in the year.  The trio was rounded out by bassist Chubby, formerly of Schleprok.\n"
      ]
   },
   "History": {
      "text": [
         "Hickey recorded their first 7\" EP, Us vs. Them, within a month of forming and released it soon afterwards.  The band quickly became a part of the Probe Records scene, featured in the Probe zine and on a few of the label's releases.  Later, Hickey made split 7\" records with bands such as All You Can Eat, Fuckface and V.B.F.\n",
         "Bass player Chubby left Hickey in 1997, and was replaced by Matt Rissler (a.k.a. \"Dwight Trash\").  The new line-up went on to record a self-titled LP, as well as the Hickey/Voodoo Glow Skulls split 7\", both for Probe Records.  Hickey called it quits in 1998, refusing to contribute any new material for a proposed split with Screeching Weasel, and handed their last recording (\"Robots Never Cry\") over to trend is dead! records for the Worse Than Alternative It's Another Punk Comp CD in 1999.\n",
         "The original Hickey line-up of Matty, Chubby and Aesop re-united and soon began recording a plethora of new material under the name Yogurt, almost all of which remains unreleased. Yogurt was essentially an experimental recording outlet for the band, only performing live on a few occasions, and dissolved after Matty Luv's death in 2002.  Nine Yogurt songs appear on the All Seeing Monotony split CD (Nothing Enterprises).\n",
         "\nMatty Luv died of a heroin overdose on October 5, 2002.[1]  A wall mural of Luv was painted in tribute, and stands in the Mission District today. ",
         "Before Matty's death he played guitar in the bands Miami and Unit Breed, and co-founded San Francisco's first needle exchange program.[2][3]\n",
         "Aesop went on to drum for Bay Area black metal band, Ludicra, and currently records and tours with Agalloch, Worm Ouroboros and VHÖL.\n",
         "Various States of Disrepair - Complete Works 1994-1997 collected some of Hickey's EPs, splits and compilation tracks, along with unreleased recordings from the era (though it was not truly Hickey's \"complete\" recorded output during that time).  It was originally released on CD in 1997 via Poverty Records.  Various States was re-pressed on CD by S.P.A.M. Records following Luv's passing in 2002.  In 2012, 1-2-3-4 Go! Records released the compilation on vinyl for the first time, marking the tenth anniversary of Luv's death.  The vinyl issue was a double LP with bonus tracks, but still incomplete;  missing were cover versions of \"American In Me\" (originally by The Avengers) and \"Kingdom Come\" (Manowar), as well as alternate recordings of \"Hey Cutie Pie\" and \"Food Stamps + Drink Tickets\" (all four omitted songs had been released on various compilation CDs during the band's existence). \n",
         "In 1999, a double-CD was planned on Probe Records, with one disc of live Hickey recordings and another disc of Hickey cover versions for a tribute.  Following the closure of Probe, the 2CD live/tribute was announced as being moved to the Suburban Justice label in 2003.[4]  By 2020, the Hickey live album had still not been released (though several Hickey live performances had been leaked online since) but the tribute was finally released online for free.[5]\n"
      ]
   },
   "Voodoo Glow Skulls controversy": {
      "text": [
         "Probe records released a 7\" which was made to look as if it were a split between Hickey and the Voodoo Glow Skulls. On one side of the 7\" was the Hickey song \"Food Stamps and Drink Tickets\" and the other side members of Hickey played the trumpet that was stolen from Voodoo Glow Skulls over the answering machine messages left by Voodoo Glow Skulls members and Epitaph Records employees demanding the return of the instrument. The 7\" also falsely had the Epitaph Records logo on the back as Epitaph had no official part in the release.\n",
         "According to the zine included with the 7\", the two bands played together at the Nile Theater in Mesa, Arizona. Matty Luv, singer of Hickey, made disparaging remarks about Epitaph Records and the commercialization of punk. After members of both bands had a confrontation, the Voodoo Glow Skulls convinced the venue owner to eject Hickey without pay. In response, Hickey stole the trumpet in question out of the Voodoo Glow Skulls van.\n",
         "After receiving threatening messages on his answering machine, Hickey claimed to have returned the trumpet.[6] Contrary to this rumor, members of the Voodoo Glow Skulls claimed they had to retrieve the instrument themselves. Upon return, it had been suspected the instrument was urinated in and required professional cleaning.[citation needed]\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Extended plays": {},
      "Split releases": {},
      "Compilation appearances": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Hickey (also known as \"The Naked Cult of Hickey\") was an American melodic punk band from San Francisco's Mission District, California, United States.  The band often recorded, released and distributed their own music. Elaborate and very personal artwork was the style used for the band's records, and they were well known for their raucous and sometimes antagonizing live performances.\n",
      "Hickey was started in 1994 by guitarist/singer Matty Luv and drummer Aesop Dekker following the demise of their previous band, FuckBoyz, who had moved from south Florida to San Francisco's Mission District earlier in the year.  The trio was rounded out by bassist Chubby, formerly of Schleprok.\n",
      "Hickey recorded their first 7\" EP, Us vs. Them, within a month of forming and released it soon afterwards.  The band quickly became a part of the Probe Records scene, featured in the Probe zine and on a few of the label's releases.  Later, Hickey made split 7\" records with bands such as All You Can Eat, Fuckface and V.B.F.\n",
      "Bass player Chubby left Hickey in 1997, and was replaced by Matt Rissler (a.k.a. \"Dwight Trash\").  The new line-up went on to record a self-titled LP, as well as the Hickey/Voodoo Glow Skulls split 7\", both for Probe Records.  Hickey called it quits in 1998, refusing to contribute any new material for a proposed split with Screeching Weasel, and handed their last recording (\"Robots Never Cry\") over to trend is dead! records for the Worse Than Alternative It's Another Punk Comp CD in 1999.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Punk rock"
      ],
      "Years active": [
         "1994–1998"
      ],
      "Labels": [
         "Probe Records, Poverty Records"
      ],
      "Associated acts": [
         "Fuckboyz, Schleprok, Agalloch, Ludicra, Yogurt, The Unit Breed"
      ],
      "Members": [
         "Matty Luv",
         "Aesop",
         "Chubby",
         "Dwight Trash"
      ]
   }
}