{
   "Break Up": {
      "text": [
         "On 17 July 2008, the band announced on their website that they had disbanded.[4] The following message was posted: \"A quiet front has existed for some time now but the group have now disbanded, da da for now. Who knows what tomorrow might bring?\" Guitarist Douglas Morland is currently gigging with the Glasgow-based Big Ned and, in September 2009, he released a solo 10\" EP on the Glasgow label, Optimo Music, under the name 'Older Lover'. Former 'Mother' Sam Smith now works as a producer and engineer, recent projects have included Alisdair Roberts 2009 album, Spoils,  for Drag City Records and Remember Remember's debut album for Rock Action. He is currently producing the Leeds record label Art Goes Pop's band, Nacionals debut, and is one of the directors of The Green Door Studio CIC.\n",
         "Ian Cronan and Peter Vallely formed and are still currently running Glasgow Badges, a company which produces button badges and screen printed clothing.\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Originally inspired by bands like Dr. Feelgood and The Modern Lovers, their later material gives a heady nod in the direction of Krautrock and sees an increasing complexity in their music combining elements of funk and rock and roll. Mother and the Addicts released their debut single \"Who Art You Girls?\" in December 2004, followed by \"Oh yeah, You Look Quite Nice\" in July 2005 and their debut album, Take The Lovers Home Tonight in August 2005. Their next single a double a side \"Watch the Lines/Are Other?\" was released in August 2007.\n",
         "The band have toured extensively along with the likes of Sons and Daughters and the 1990s. Though meeting at the Glasgow School of Art only two of the original members, Douglas Morland and Kendall Koppe attended. All of the current lineup come from Glasgow with the exception of Mother who was brought up in the Orkney Islands. Kendall Koppe left the band in 2005 to pursue a career in photography. Through 2006 the band played a handful of shows including the Indian Summer Festival and the GSA degree show as a four-piece. During this period Mother wrote the majority of the material for Science Fiction Illustrated, and the album was recorded over the winter and completed in January 2007. They have been actively touring since May 2007 being joined live by Timothy Dyer on Keyboards and samples.\n"
      ]
   },
   "Musical style": {
      "text": [
         "The band's sound includes elements of \"white funk\", disco, krautrock and pub rock, and has seen them compared to the likes of Franz Ferdinand, Dr. Feelgood, The Violent Femmes, and Roxy Music, while Mother's songwriting and singing have been compared to Mark E. Smith and Jarvis Cocker.[1][2][3]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Musical style",
      "3 Break Up",
      "4 Discography",
      "4.1 Singles",
      "4.2 Albums",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Mother and The Addicts were a Glasgow-based band signed to Chemikal Underground Records, who formed in 2003. They have released two albums.\n"
      ]
   },
   "Title": "Mother and the Addicts - Wikipedia"
}