{
   "Name": "Mother and the Addicts",
   "rawData": [
      "Mother and The Addicts were a Glasgow-based band signed to Chemikal Underground Records, who formed in 2003. They have released two albums.\n",
      "Originally inspired by bands like Dr. Feelgood and The Modern Lovers, their later material gives a heady nod in the direction of Krautrock and sees an increasing complexity in their music combining elements of funk and rock and roll. Mother and the Addicts released their debut single \"Who Art You Girls?\" in December 2004, followed by \"Oh yeah, You Look Quite Nice\" in July 2005 and their debut album, Take The Lovers Home Tonight in August 2005. Their next single a double a side \"Watch the Lines/Are Other?\" was released in August 2007.\n",
      "The band have toured extensively along with the likes of Sons and Daughters and the 1990s. Though meeting at the Glasgow School of Art only two of the original members, Douglas Morland and Kendall Koppe attended. All of the current lineup come from Glasgow with the exception of Mother who was brought up in the Orkney Islands. Kendall Koppe left the band in 2005 to pursue a career in photography. Through 2006 the band played a handful of shows including the Indian Summer Festival and the GSA degree show as a four-piece. During this period Mother wrote the majority of the material for Science Fiction Illustrated, and the album was recorded over the winter and completed in January 2007. They have been actively touring since May 2007 being joined live by Timothy Dyer on Keyboards and samples.\n"
   ],
   "infobox": {
      "Origin": [
         "Glasgow, Scotland"
      ],
      "Genres": [
         "Indie rock"
      ],
      "Years active": [
         "2003–2008"
      ],
      "Labels": [
         "Chemikal Underground"
      ],
      "Members": [
         "Mother (aka Sam Smith) (lead vocals, guitar )",
         "Ian Cronan (drums)",
         "Douglas Morland (guitar, backing vocals)",
         "Peter Vallely (bass, backing vocals)",
         "Tim Dyer (keyboards, sampler)"
      ],
      "Past members": [
         "Kendall Koppe (synthesizer, backing vocals)"
      ]
   },
   "prunedData": [
      "Mother and The Addicts were a [GENRE] band signed to Chemikal Underground Records, who formed in [YEAR]. They have released two albums.\n",
      "Originally inspired by bands like Dr. Feelgood and The Modern Lovers, their later material gives a [GENRE] an increasing complexity in their music combining elements of funk and rock and roll. [BAND_NAME] released their debut single \"Who Art You Girls?\" in [MONTH] [YEAR], followed by \"Oh yeah, You Look Quite Nice\" in [MONTH] [YEAR] and their debut album, Take The Lovers Home Tonight in [MONTH] [YEAR]. Their next single a double a side \"Watch the Lines/Are Other?\" was released in [MONTH] [YEAR].\n",
      "The band have toured extensively along with the likes of Sons and Daughters and the [YEAR]s. Though meeting at the Glasgow School of Art only two of the original members, Douglas Morland and [PERSON_NAME_FULL_0_FEMALE] attended. All of the current lineup come from Glasgow with the exception of Mother who was brought up in the Orkney Islands. [PERSON_NAME_FULL_0_FEMALE] left the band in [YEAR] to pursue a career in photography. Through [YEAR] the band played a handful of shows including the Indian Summer Festival and the GSA degree show as a four-piece. During this period Mother wrote the majority of the material for Science Fiction Illustrated, and the album was recorded over the winter and completed in [MONTH] [YEAR]. They have been actively touring since [MONTH] [YEAR] being joined live by Timothy Dyer on Keyboards and samples.\n"
   ]
}