{
   "Name": "Natural Acoustic Band",
   "rawData": [
      "The Natural Acoustic Band were a British acid-folk band, formed in 1969 in Milngavie, Glasgow, Scotland. There were a number of personnel changes throughout the band's history, but the best known line up was:\n",
      "The band only produced two albums and one single (reaching No 1 in the Melody Maker folk charts). They played The Royal Albert Hall (supporting Don McLean), toured extensively with Ralph McTell, played at The Weeley Festival Rod Stewart, T-Rex, Status Quo, Rory Gallagher and Monty Python also appearing with Country Joe McDonald at Reading Played Glasgow City Halls with Billy Connolly and Steelers Wheel, The Old Grey Whistle Test with Alice Cooper, and they were on the bill on three occasions at London's Marquee Club: November 17, 1971 (supported by Shape of the Rain), 12 April 1972 (supported by Gnidrolog) and on 22 November 1972 (supporting Brewers Droop). \n",
      "As a replacement for Krysia Kocjan the NAB had at first recruited Joanna Carlin but she never recorded with them.  She was actually called Melanie Harrold but was trying to avoid confusion with the better known Melanie (Melanie Safka).  She later made singles and solo albums (under both her names) and worked with the Albion Band and members of Steeleye Span.\n"
   ],
   "infobox": {
      "Origin": [
         "Milngavie, Glasgow, Scotland"
      ],
      "Genres": [
         "Acid-folk"
      ],
      "Years active": [
         "1969–1975"
      ],
      "Labels": [
         "RCA"
      ],
      "Associated acts": [
         "Magna Carta, Shot in the Dark"
      ],
      "Website": [
         "naturalacousticband.com"
      ],
      "Past members": [
         "Tom Hoy, Robin Thyne, Krysia Kocjan"
      ]
   },
   "albums": [
      "Learning to Live"
   ],
   "prunedData": [
      "The [BAND_NAME] were a [GENRE] band, formed in [YEAR] in Milngavie, Glasgow, Scotland. There were a number of personnel changes throughout the band's history, but the best known line up was:\n",
      "The band only produced two albums and one single (reaching No 1 in the Melody Maker folk charts). They played The Royal Albert Hall (supporting [PERSON_NAME_FULL_1_MALE]), toured extensively with [PERSON_NAME_FULL_0_MALE], played at The Weeley Festival Rod Stewart, T-Rex, Status Quo, [PERSON_NAME_FULL_2_MALE] and Monty Python also appearing with Country Joe Mc[PERSON_NAME_FIRST_1]ald at Reading Played Glasgow City Halls with Billy Connolly and Steelers Wheel, The Old Grey Whistle Test with Alice Cooper, and they were on the bill on three occasions at London's [MONTH]quee Club: [MONTH] 17, [YEAR] (supported by Shape of the Rain), 12 [MONTH] [YEAR] (supported by Gnidrolog) and on 22 [MONTH] [YEAR] (supporting Brewers Droop). \n",
      "As a replacement for Krysia Kocjan the NAB had at first recruited [PERSON_NAME_FULL_0_FEMALE] but she never recorded with them.  She was actually called [PERSON_NAME_FULL_1_FEMALE] but was trying to avoid confusion with the better known [PERSON_NAME_FIRST_1] ([PERSON_NAME_FIRST_1] [PERSON_NAME_LAST_2]).  She later made singles and solo albums (under both her names) and worked with the Albion Band and members of Steeleye Span.\n"
   ]
}