{
   "Name": "The Sensational Alex Harvey Band",
   "rawData": [
      "The Sensational Alex Harvey Band were a rock  band formed in Glasgow in 1972. Fronted by Alex Harvey accompanied by Zal Cleminson on guitar, bassist Chris Glen, keyboard player Hugh McKenna and drummer Ted McKenna, their music veered from glam rock to experimental jazz, around a core of experimental and avant-garde rock, dealing with themes from environmentalism to Chinese take away food. They achieved a critically acclaimed status in the UK, were very popular in continental Europe, and were also highly influential in Australia, most notably on the young Nick Cave and his first band The Boys Next Door.\n",
      "In August 1972, Alex Harvey formed The Sensational Alex Harvey Band (often shortened to SAHB) with guitarist Zal Cleminson, bassist Chris Glen, and cousins Hugh and Ted McKenna on keyboards and drums respectively, all previous members of progressive rock act Tear Gas.\n",
      "They adopted distinctive stage costumes: Alex Harvey started to wear vaudeville-like clothes and his trademark striped shirt, while Zal Cleminson assumed the identity of a \"mime\" in full make-up and green-yellow jumpsuit, and Chris Glen wore a dark blue jumpsuit reminiscent of a superhero costume incorporating a lighter blue codpiece.\n"
   ],
   "infobox": {
      "Also known as": [
         "SAHB"
      ],
      "Origin": [
         "Glasgow, Scotland"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1972 (1972)–1978 (1978)"
      ],
      "Labels": [
         "Vertigo, Universal International"
      ],
      "Associated acts": [
         "Alex Harvey and His Soul Band, Tear Gas, SAHB (without Alex)"
      ],
      "Website": [
         "sahbofficial.co.uk"
      ],
      "Past members": [
         "Alex Harvey",
         "Zal Cleminson",
         "Chris Glen",
         "Hugh McKenna",
         "Ted McKenna",
         "Tommy Eyre"
      ]
   },
   "prunedData": [
      "[BAND_NAME] were a [GENRE] band formed in Glasgow in [YEAR]. Fronted by Alex Harvey accompanied by Zal Cleminson on guitar, bassist Chris Glen, keyboard player [PERSON_NAME_FULL_1_MALE] and drummer Ted [PERSON_NAME_LAST_1], their music veered from glam [GENRE]to experimental jazz, around a core of experimental and avant-garde rock, dealing with themes from environmentalism to Chinese take away food. They achieved a critically acclaimed status in the UK, were very popular in continental Europe, and were also highly influential in Australia, most notably on the young [PERSON_NAME_FULL_0_MALE] and his first band The Boys Next Door.\n",
      "In [MONTH] [YEAR], Alex Harvey formed [BAND_NAME] (often shortened to SAHB) with guitarist Zal Cleminson, bassist Chris Glen, and cousins Hugh and Ted McKenna on keyboards and drums respectively, all previous members of progressive rock act Tear Gas.\n",
      "They adopted distinctive stage costumes: Alex Harvey started to wear vaudeville-like clothes and his trademark striped shirt, while Zal Cleminson assumed the identity of a [GENRE] a dark blue jumpsuit reminiscent of a superhero costume incorporating a lighter blue codpiece.\n"
   ]
}