{
   "Name": "The Sensational Alex Harvey Band",
   "Sections": [
      "1 Band history",
      "2 Final albums together and split",
      "3 Reunions",
      "4 The Lost album",
      "5 Legacy",
      "6 Discography",
      "6.1 Studio albums",
      "6.2 Live albums",
      "6.3 Reunion albums",
      "6.4 Compilations/other releases",
      "6.5 Singles",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "The Sensational Alex Harvey Band were a rock  band formed in Glasgow in 1972.[1] Fronted by Alex Harvey accompanied by Zal Cleminson on guitar, bassist Chris Glen, keyboard player Hugh McKenna and drummer Ted McKenna, their music veered from glam rock to experimental jazz, around a core of experimental and avant-garde rock, dealing with themes from environmentalism to Chinese take away food. They achieved a critically acclaimed status in the UK,[2] were very popular in continental Europe, and were also highly influential in Australia, most notably on the young Nick Cave and his first band The Boys Next Door.\n"
      ]
   },
   "Band history": {
      "text": [
         "In August 1972, Alex Harvey formed The Sensational Alex Harvey Band (often shortened to SAHB) with guitarist Zal Cleminson, bassist Chris Glen, and cousins Hugh and Ted McKenna on keyboards and drums respectively, all previous members of progressive rock act Tear Gas.[3]\n",
         "They adopted distinctive stage costumes: Alex Harvey started to wear vaudeville-like clothes and his trademark striped shirt, while Zal Cleminson assumed the identity of a \"mime\" in full make-up and green-yellow jumpsuit, and Chris Glen wore a dark blue jumpsuit reminiscent of a superhero costume incorporating a lighter blue codpiece.\n",
         "SAHB produced a succession of highly regarded albums and tours throughout the 1970s. The band did not enjoy large-scale success in the United States as it did in Great Britain,[4] but had a cult following in certain US cities, notably Cleveland, where the group first played at the Agora Ballroom in December 1974. Thanks to airplay from WMMS, songs like \"Next\" and \"The Faith Healer\" became very popular.[5]\n",
         "The Sensational Alex Harvey Band had Top 40 hits in Britain with the single \"Delilah\", a cover version of the Tom Jones hit, which reached number seven in 1975, and also with \"The Boston Tea Party\" in June 1976.[3] The song \"Anthem\" was a top 30 hit in Australia in 1975.[6]\n"
      ]
   },
   "Final albums together and split": {
      "text": [
         "Harvey left the group later that year and the other members continued with the moniker \"SAHB (without Alex)\". They recorded a new album titled Fourplay in February 1977.[3] The album steered towards a solid pop-rock with some slight prog influences.\n",
         "Harvey re-joined the group in mid-1977, while Hugh McKenna left. The Sensational Alex Harvey Band then recorded 1978's Rock Drill, with Tommy Eyre replacing Hugh McKenna. They disbanded shortly afterwards.[3]\n",
         "Harvey died of heart failure on 4 February 1982 in Belgium.[3]\n"
      ]
   },
   "Reunions": {
      "text": [
         "In 1992, Chris Glen, Zal Cleminson and Ted McKenna banded together to form \"The Party Boys\" which featured guest vocalists such as Fish, Dan McCafferty, and Stevie Doherty with Stone The Crows keyboardist Ronnie Leahy.[3] This band lasted about one year before they decided to recruit keyboard player Hugh McKenna and finally reform as SAHB. They also released a live album Live in Glasgow 1993 featuring Stevie Doherty on vocals.[3] This line-up of SAHB disbanded in 1995, before reforming in 2002 for a tribute night to Frankie Miller at The Barrowlands in Glasgow with ex-Nazareth guitarist Billy Rankin on vocals. After a year \"Mad\" Max Maxwell replaced Rankin on vocals.\n",
         "SAHB released a new live album titled Zalvation, which was their first official release since Rock Drill in 1978, and an autobiography called SAHB Story, written by former tour manager and author Martin Keilty. The band performed numerous tours and festivals across UK, Europe, and Australia before once again disbanding in 2008 after the departure of Zal Cleminson on guitar. The band carried out a handful of shows that were pre-booked with guitarist Julian Hutson Saxby but after that, they decided to move on to separate projects.\n"
      ]
   },
   "The Lost album": {
      "text": [
         "In January 1974, the band went into Advision studios in London with US producer Shel Talmy to record their third album. By April, the sessions were finished and the album was mixed. However, the band and management had some reservations about the overall sound and decided to scrap the entire album. Talmy then returned to Los Angeles with his tapes.\n",
         "Most of the song titles eventually showed up on the official album The Impossible Dream later that year with a different producer, though the songs were dramatically changed.[clarification needed] The original recordings formed an album called Hot City,  released in 2009 by Major League Productions.\n"
      ]
   },
   "Legacy": {
      "text": [
         "In 2018 Nick Cave told Primal Scream's Bobby Gillespie:\n",
         "Robert Smith of The Cure has been quoted as saying:\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Live albums": {},
      "Reunion albums": {},
      "Compilations/other releases": {},
      "Singles": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Sensational Alex Harvey Band were a rock  band formed in Glasgow in 1972.[1] Fronted by Alex Harvey accompanied by Zal Cleminson on guitar, bassist Chris Glen, keyboard player Hugh McKenna and drummer Ted McKenna, their music veered from glam rock to experimental jazz, around a core of experimental and avant-garde rock, dealing with themes from environmentalism to Chinese take away food. They achieved a critically acclaimed status in the UK,[2] were very popular in continental Europe, and were also highly influential in Australia, most notably on the young Nick Cave and his first band The Boys Next Door.\n",
      "In August 1972, Alex Harvey formed The Sensational Alex Harvey Band (often shortened to SAHB) with guitarist Zal Cleminson, bassist Chris Glen, and cousins Hugh and Ted McKenna on keyboards and drums respectively, all previous members of progressive rock act Tear Gas.[3]\n",
      "They adopted distinctive stage costumes: Alex Harvey started to wear vaudeville-like clothes and his trademark striped shirt, while Zal Cleminson assumed the identity of a \"mime\" in full make-up and green-yellow jumpsuit, and Chris Glen wore a dark blue jumpsuit reminiscent of a superhero costume incorporating a lighter blue codpiece.\n",
      "SAHB produced a succession of highly regarded albums and tours throughout the 1970s. The band did not enjoy large-scale success in the United States as it did in Great Britain,[4] but had a cult following in certain US cities, notably Cleveland, where the group first played at the Agora Ballroom in December 1974. Thanks to airplay from WMMS, songs like \"Next\" and \"The Faith Healer\" became very popular.[5]\n"
   ],
   "infobox": {
      "Also known as": [
         "SAHB"
      ],
      "Origin": [
         "Glasgow, Scotland"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1972 (1972)–1978 (1978)"
      ],
      "Labels": [
         "Vertigo, Universal International"
      ],
      "Associated acts": [
         "Alex Harvey and His Soul Band, Tear Gas, SAHB (without Alex)"
      ],
      "Website": [
         "sahbofficial.co.uk"
      ],
      "Past members": [
         "Alex Harvey",
         "Zal Cleminson",
         "Chris Glen",
         "Hugh McKenna",
         "Ted McKenna",
         "Tommy Eyre"
      ]
   }
}