{
   "Name": "Hoodoo Rhythm Devils",
   "Sections": [
      "1 History",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "The Hoodoo Rhythm Devils were a blues-funk band from San Francisco, California, formed in 1970.\n"
      ]
   },
   "History": {
      "text": [
         "In 1970 John Rewind was teaching guitar at Roger Calkins Music on Market Street in San Francisco, California. One of his students, Lee Humphries, kept telling John about the talents of his buddy Joe Crane, with whom he was in the Coast Guard. Joe played bass with Johnny & Edgar Winter in high school back in Conroe, Texas, and had been produced by the infamous Huey Meaux. Between Lee's description, and confirmation from Al Amis, who also worked at Roger Calkins and had heard Joe sing, John went to the Alameda, California, Coast Guard Officer's Club to see Joe perform, and the Hoodoo Rhythm Devils were born.[1] Another one of John's guitar students, \"Funky Jack\" Leahy, who lived up the street from John in the Haight-Ashbury district, had just closed his poster business Funky Features, and was getting into recording and was building a studio. When Jack heard Joe and John, he took the lead and started recording the band and making connections for the band to get a recording contract with a major label. After a few personnel changes, Glenn Walter, who had played drums in a band called The Zoo and released a single in St. Louis, Missouri, with John during the 1960s, joined the band, along with Richard Greene (aka Dexter C. Plates) on bass. Richard had played in groups around the Washington, D.C. area, most notably with Roberta Flack.\n",
         "Modeled after the names of bands in the 1950s, Joe Crane and his Hoodoo Rhythm Devils signed with Capitol Records under the direction of Michael Sunday and Jack Leahy, made their first record Rack Jobber's Rule in 1971. The name was too big of a mouthful, so it was shortened to the Hoodoo Rhythm Devils. Roger Allen Clark, fresh from the Steve Miller Band, was added on drums with the second album, The Barbecue of DeVille on Blue Thumb Records in 1972. The Hoodoos toured extensively that year playing with Savoy Brown, The Doobie Brothers, Steely Dan, Chuck Berry, John Lee Hooker, Graham Central Station, Tower of Power, Mott the Hoople, Bloodrock, and The Tubes. Roger Clark left to become a studio session drummer working for Rick Hall in Muscle Shoals, Alabama. Keith Knudsen, formerly of Lee Michaels' band and later the Doobie Brothers, then joined for a short stint on drums from late 1972 to mid 1973 before Jerome Kimsey joined the band for the recording of their third album, What the Kids Want, for Blue Thumb Records in 1973. The Hoodoos continued to tour the United States and Joe began having some of his songs covered by Johnny Winter, The Chambers Brothers, Rodger Collins, and Patti LaBelle.[2]\n",
         "In 1973 Richard Greene left to become a sought-after recording engineer at Russian Hill Recording in San Francisco, and was the famous \"Fall Into The Gap\" voice. Roger Stanton replaced Richard on bass. 1973 and 1974 saw non-stop touring and took the band from Canada to Texas, California to Florida tearing up many a dancehall and 'burning down' many a nightclub. The band went their separate ways in 1974, only to reform a year later with a new lineup and recorded the famous \"Lost Album\" that was never released until 2012.  Jack Leahy and Bob Simmons of KSAN-FM in San Francisco formed World Records, and recorded, produced, and released the album Safe In Their Homes in 1976. Fantasy Records in Berkeley, California, re-released Safe in Their Homes. The Hoodoo Rhythm Devils was revived and strong playing concerts and clubs. (See Wolfgang's Vault for live concerts from Winterland in San Francisco). In 1978, Crane and Walters, recorded their second Fantasy Records album All Kidding Aside, which was produced by Clayton Ivey and Terry Woodford. It included guest musicians the Muscle Shoals Horns, Roger Allen Clark, Tom Roady, and many other well-known Muscle Shoals session kings. The band continued on until Joe Crane died from leukemia in 1980.\n",
         "After the band's demise, several compilations were released by Rear Window Music.[2] In 2013, the Hoodoo Rhythm Devils released a live recording recorded at Ultrasonic Studios in Hempstead, New York on November 28, 1972 that had been broadcast live on WLIR-FM. In 2014 they released One Night Only, a CD which featured some jams with Johnny Winter and a live recording of the Texas Day Special with the Pointer Sisters that had been broadcast live on KSAN-FM from San Francisco in 1973. 2016 brought The Best Of The Hoodoo Rhythm Devils Volume II CD that featured a variety of unreleased tunes, demos, and a reunion tune with surviving members and their children. The album also features Tower of Power, The Pointer Sisters, Norton Buffalo, Greg Douglass, John McFee, and the Two Tons of Fun - Martha Wash and the late Izora Armstead.[3]\n",
         "Glenn Walters has carried on as fixture vocalist and drummer in the San Francisco area, well known in the advertising business with his Taco Bell, Blue Diamond Almonds, Selix Tuxedos, etc., spots, and gigs regularly with the Glenn Walters Quartet and with Sidepocket, a cover band that performs for weddings and other social events.[4][5] Richard Greene is a member of The Bobs, the Grammy-winning a capella group. John Rewind continues as a producer, guitarist, and songwriter for Rear Window Music, producing recordings with Georgia Whiting, Davey Pattison, Bobby Black, and many others.[1][6] Roger Allen Clark currently tours with Travis Wammack in the Muscle Shoals and Nashville area.\n"
      ]
   },
   "Discography": {
      "text": [
         "Compilations:\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Hoodoo Rhythm Devils were a blues-funk band from San Francisco, California, formed in 1970.\n",
      "In 1970 John Rewind was teaching guitar at Roger Calkins Music on Market Street in San Francisco, California. One of his students, Lee Humphries, kept telling John about the talents of his buddy Joe Crane, with whom he was in the Coast Guard. Joe played bass with Johnny & Edgar Winter in high school back in Conroe, Texas, and had been produced by the infamous Huey Meaux. Between Lee's description, and confirmation from Al Amis, who also worked at Roger Calkins and had heard Joe sing, John went to the Alameda, California, Coast Guard Officer's Club to see Joe perform, and the Hoodoo Rhythm Devils were born.[1] Another one of John's guitar students, \"Funky Jack\" Leahy, who lived up the street from John in the Haight-Ashbury district, had just closed his poster business Funky Features, and was getting into recording and was building a studio. When Jack heard Joe and John, he took the lead and started recording the band and making connections for the band to get a recording contract with a major label. After a few personnel changes, Glenn Walter, who had played drums in a band called The Zoo and released a single in St. Louis, Missouri, with John during the 1960s, joined the band, along with Richard Greene (aka Dexter C. Plates) on bass. Richard had played in groups around the Washington, D.C. area, most notably with Roberta Flack.\n",
      "Modeled after the names of bands in the 1950s, Joe Crane and his Hoodoo Rhythm Devils signed with Capitol Records under the direction of Michael Sunday and Jack Leahy, made their first record Rack Jobber's Rule in 1971. The name was too big of a mouthful, so it was shortened to the Hoodoo Rhythm Devils. Roger Allen Clark, fresh from the Steve Miller Band, was added on drums with the second album, The Barbecue of DeVille on Blue Thumb Records in 1972. The Hoodoos toured extensively that year playing with Savoy Brown, The Doobie Brothers, Steely Dan, Chuck Berry, John Lee Hooker, Graham Central Station, Tower of Power, Mott the Hoople, Bloodrock, and The Tubes. Roger Clark left to become a studio session drummer working for Rick Hall in Muscle Shoals, Alabama. Keith Knudsen, formerly of Lee Michaels' band and later the Doobie Brothers, then joined for a short stint on drums from late 1972 to mid 1973 before Jerome Kimsey joined the band for the recording of their third album, What the Kids Want, for Blue Thumb Records in 1973. The Hoodoos continued to tour the United States and Joe began having some of his songs covered by Johnny Winter, The Chambers Brothers, Rodger Collins, and Patti LaBelle.[2]\n",
      "In 1973 Richard Greene left to become a sought-after recording engineer at Russian Hill Recording in San Francisco, and was the famous \"Fall Into The Gap\" voice. Roger Stanton replaced Richard on bass. 1973 and 1974 saw non-stop touring and took the band from Canada to Texas, California to Florida tearing up many a dancehall and 'burning down' many a nightclub. The band went their separate ways in 1974, only to reform a year later with a new lineup and recorded the famous \"Lost Album\" that was never released until 2012.  Jack Leahy and Bob Simmons of KSAN-FM in San Francisco formed World Records, and recorded, produced, and released the album Safe In Their Homes in 1976. Fantasy Records in Berkeley, California, re-released Safe in Their Homes. The Hoodoo Rhythm Devils was revived and strong playing concerts and clubs. (See Wolfgang's Vault for live concerts from Winterland in San Francisco). In 1978, Crane and Walters, recorded their second Fantasy Records album All Kidding Aside, which was produced by Clayton Ivey and Terry Woodford. It included guest musicians the Muscle Shoals Horns, Roger Allen Clark, Tom Roady, and many other well-known Muscle Shoals session kings. The band continued on until Joe Crane died from leukemia in 1980.\n"
   ]
}