{
   "Name": "Hoodoo Rhythm Devils",
   "rawData": [
      "The Hoodoo Rhythm Devils were a blues-funk band from San Francisco, California, formed in 1970.\n",
      "In 1970 John Rewind was teaching guitar at Roger Calkins Music on Market Street in San Francisco, California. One of his students, Lee Humphries, kept telling John about the talents of his buddy Joe Crane, with whom he was in the Coast Guard. Joe played bass with Johnny & Edgar Winter in high school back in Conroe, Texas, and had been produced by the infamous Huey Meaux. Between Lee's description, and confirmation from Al Amis, who also worked at Roger Calkins and had heard Joe sing, John went to the Alameda, California, Coast Guard Officer's Club to see Joe perform, and the Hoodoo Rhythm Devils were born. Another one of John's guitar students, \"Funky Jack\" Leahy, who lived up the street from John in the Haight-Ashbury district, had just closed his poster business Funky Features, and was getting into recording and was building a studio. When Jack heard Joe and John, he took the lead and started recording the band and making connections for the band to get a recording contract with a major label. After a few personnel changes, Glenn Walter, who had played drums in a band called The Zoo and released a single in St. Louis, Missouri, with John during the 1960s, joined the band, along with Richard Greene (aka Dexter C. Plates) on bass. Richard had played in groups around the Washington, D.C. area, most notably with Roberta Flack.\n",
      "Modeled after the names of bands in the 1950s, Joe Crane and his Hoodoo Rhythm Devils signed with Capitol Records under the direction of Michael Sunday and Jack Leahy, made their first record Rack Jobber's Rule in 1971. The name was too big of a mouthful, so it was shortened to the Hoodoo Rhythm Devils. Roger Allen Clark, fresh from the Steve Miller Band, was added on drums with the second album, The Barbecue of DeVille on Blue Thumb Records in 1972. The Hoodoos toured extensively that year playing with Savoy Brown, The Doobie Brothers, Steely Dan, Chuck Berry, John Lee Hooker, Graham Central Station, Tower of Power, Mott the Hoople, Bloodrock, and The Tubes. Roger Clark left to become a studio session drummer working for Rick Hall in Muscle Shoals, Alabama. Keith Knudsen, formerly of Lee Michaels' band and later the Doobie Brothers, then joined for a short stint on drums from late 1972 to mid 1973 before Jerome Kimsey joined the band for the recording of their third album, What the Kids Want, for Blue Thumb Records in 1973. The Hoodoos continued to tour the United States and Joe began having some of his songs covered by Johnny Winter, The Chambers Brothers, Rodger Collins, and Patti LaBelle.\n"
   ],
   "infobox": {},
   "prunedData": [
      "The [BAND_NAME] were a [GENRE] band from San Francisco, California, formed in [YEAR].\n",
      "In [YEAR] John Rewind was teaching guitar at [PERSON_NAME_FULL_2_MALE] on [MONTH]ket Street in San Francisco, California. One of his students, Lee Humphries, kept telling John about the talents of his buddy [PERSON_NAME_FULL_3_MALE], with whom he was in the Coast Guard. [PERSON_NAME_FIRST_3] played bass with Johnny & Edgar Winter in high school back in Conroe, Texas, and had been produced by the infamous [PERSON_NAME_FULL_1_MALE]. Between Lee's description, and confirmation from [PERSON_NAME_FULL_4_MALE], who also worked at [PERSON_NAME_FIRST_2] [PERSON_NAME_LAST_2] and had heard [PERSON_NAME_FIRST_3] sing, John went to the [PERSON_NAME_FIRST_4]ameda, California, Coast Guard Officer's Club to see [PERSON_NAME_FIRST_3] perform, and the [BAND_NAME] were born. Another one of John's guitar students, \"Funky Jack\" Leahy, who lived up the street from John in the Haight-Ashbury district, had just closed his poster business Funky Features, and was getting into recording and was building a studio. When Jack heard [PERSON_NAME_FIRST_3] and John, he took the lead and started recording the band and making connections for the band to get a recording contract with a major label. After a few personnel changes, Glenn Walter, who had played drums in a band called The Zoo and released a single in St. Louis, Missouri, with John during the [YEAR]s, joined the band, along with [PERSON_NAME_FULL_0_MALE] (aka Dexter C. Plates) on bass. [PERSON_NAME_FIRST_0] had played in groups around the Washington, D.C. area, most notably with [PERSON_NAME_FULL_5_FEMALE].\n",
      "Modeled after the names of bands in the [YEAR]s, Joe Crane and his [BAND_NAME] signed with Capitol Records under the direction of Michael Sunday and Jack Leahy, made their first record Rack Jobber's Rule in [YEAR]. The name was too big of a mouthful, so it was shortened to the [BAND_NAME]. Roger Allen Clark, fresh from the [PERSON_NAME_FULL_0_MALE], was added on drums with the second album, The Barbecue of DeVille on Blue Thumb Records in [YEAR]. The Hoodoos toured extensively that year playing with Savoy Brown, The Doobie Brothers, Steely Dan, [PERSON_NAME_FULL_5_MALE], John Lee Hooker, [PERSON_NAME_FULL_7_MALE], Tower of Power, Mott the Hoople, Bloodrock, and The Tubes. Roger Clark left to become a studio session drummer working for [PERSON_NAME_FULL_2_MALE] in Muscle Shoals, Alabama. [PERSON_NAME_FULL_3_MALE], formerly of Lee Michaels' band and later the Doobie Brothers, then joined for a short stint on drums from late [YEAR] to mid [YEAR] before [PERSON_NAME_FULL_4_MALE] joined the band for the recording of their third album, What the Kids Want, for Blue Thumb Records in [YEAR]. The Hoodoos continued to tour the United States and Joe began having some of his songs covered by Johnny Winter, The Chambers Brothers, [PERSON_NAME_FULL_1_MALE], and [PERSON_NAME_FULL_6_FEMALE].\n"
   ]
}