{
   "Name": "World Pipe Band Championships",
   "Sections": [
      "1 New format",
      "2 Competition grade system",
      "3 Results",
      "4 Most successful bands",
      "5 Notes",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "The World Pipe Band Championships is a pipe band competition held in Glasgow, Scotland. The World Pipe Band Championships as we currently know them have been staged since 1947 although the Grade 1 Pipe Band Competition winners at the annual Cowal Highland Gathering were recognised as World Champions as far back as 1906. Although titled \"The World Pipe Band Championship\" this designation was made by the Royal Scottish Pipe Band Association (RSPBA) without consulting any other Pipe Band Association. Even though bands around the world compete the vast majority of bands that enter are from the United Kingdom. For competitive bands, the title of World Champion is highly coveted, and this event is seen as the culmination of a year's worth of preparation, rehearsal and practice. There are no qualifications  to enter, bands do not have to enter or win any other competitions. The only requirement is the band is a member of the RSPBA or a Pipe Band Association  recognized by the RSPBA\n",
         "Until 2013, the entirety of the World Championships has taken place on one day in August, the current venue being Glasgow Green. Typically several hundred bands attend, traveling from all over the world. Competition commences at 9am. \n",
         "Depending on the size of the grade - or in the case of Grade One, where a band has not secured automatic qualification - bands are required to perform in a qualifying round which takes place in the morning. The top bands at the end of the qualifying round play in a second event in the afternoon to determine the winner. \n",
         "To win, Grade One bands must perform in two events, a March, Strathspey and Reel event (known as a \"set\" or \"MSR\") which consists of three pre-arranged tunes, and a Medley event, which consists of a short selection of music chosen and arranged by the band. The band must prepare two MSR sets and two Medley sets - and play one. This is drawn on the line.\n",
         "However - from 2019 - the Grade 1 contest was adjusted so that the performances of bands on the Friday would now count. See: \"New Format\"\n",
         "\nThe title is held by the Inveraray & District Pipe Band from Scotland.\n"
      ]
   },
   "New format": {
      "text": [
         "In 2013 the World Championships have been held over two days.[1] For all but Grade One bands, the competition will remain as it had been, with each grade competing in morning qualifiers and afternoon finals on either Saturday or Sunday. For Grade One, all the bands (there will be no more automatic qualifiers for the finals) will be required to compete in a qualifying round on Friday, playing an MSR and a Medley. The 12 bands that qualify for the finals will then play a different MSR and Medley in Saturday's final for the championship.\n",
         "In 2014, the schedule was changed to hold the Grade 1 qualifying rounds on Friday, and the Grade 1 finals along with the lower grade qualifiers and finals on Saturday.[2]\n",
         "In 2019, the grade one format was changed due to a smaller contest. \"Grade 1 at the World Pipe Band Championships will be a two-day event with 15 bands playing both of the MSRs and medleys, one each on separate days, with all performances counting towards the final result.\"[3] Every Grade 1 band has 2 separate MSR's and Medleys and is able to choose which one they play on Friday and then must play the alternate set on Saturday. \n",
         "Live streaming on social media is forbidden.\n"
      ]
   },
   "Competition grade system": {
      "text": [
         "Prizes at the Worlds are awarded in the following eight categories:[4]\n",
         "In the Novice Juvenile and Juvenile categories, band members must be under the age of eighteen, with the exception of one \"adult\" player, often instructors, who may serve as the Pipe Major or Pipe Sergeant.  The remaining categories have no age restriction, but are based on proficiency. Grade One is the highest of these categories, and Novice is the lowest. Grading and eligibility are overseen by the Royal Scottish Pipe Band Association (RSPBA), and bands must apply for downgrading or upgrading.[5]\n",
         "Because of time constraints, the RSPBA uses \"A\" and \"B\" designations in Grade 3 and 4, for major competitions.  By doing this, bands are grouped based on prior-years' performances, and can receive promotions within their respective grade.  It is also important to note that these vary slightly throughout the world. For example, in North America, many regional associations have implemented Grade Five, an entry-level Grade, intended to help bands familiarize themselves with competition and in Australia, New Zealand and Northern Ireland there is no Novice grade at all. There is also no Juvenile grade in Northern Ireland.\n"
      ]
   },
   "Results": {
      "text": [
         "The highly coveted Grade One title remained in Scotland until 1987, when the Canadian 78th Fraser Highlanders Pipe Band became the first overseas band to win the award.  In recent years, the title has travelled to Canada a further six times with Simon Fraser University Pipe Band, Northern Ireland 12 times with the Field Marshal Montgomery Pipe Band, Australia with the Victoria Police Pipe Band in 1998, and, the Republic of Ireland with the St. Laurence O'Toole Pipe Band in 2010.  The most successful pipe bands in this competition remain the Strathclyde Police Pipe Band (known as City of Glasgow Police Pipe Band from 1912 to 1975) winning 20 times, and, the Shotts & Dykehead Caledonia Pipe Band]] (winning 16 times). Other multiple World Champions include the Muirhead & Sons Pipe Band (8 times), the Clan MacRae Society Pipe Band (eight times), and the Edinburgh Police Pipe Band (8 times). \n",
         "(C) indicates Champion of Champions [6]\n"
      ]
   },
   "Most successful bands": {
      "text": [
         "The following is a list of some of the most successful pipe bands at the world championships.\n"
      ]
   },
   "Notes": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The World Pipe Band Championships is a pipe band competition held in Glasgow, Scotland. The World Pipe Band Championships as we currently know them have been staged since 1947 although the Grade 1 Pipe Band Competition winners at the annual Cowal Highland Gathering were recognised as World Champions as far back as 1906. Although titled \"The World Pipe Band Championship\" this designation was made by the Royal Scottish Pipe Band Association (RSPBA) without consulting any other Pipe Band Association. Even though bands around the world compete the vast majority of bands that enter are from the United Kingdom. For competitive bands, the title of World Champion is highly coveted, and this event is seen as the culmination of a year's worth of preparation, rehearsal and practice. There are no qualifications  to enter, bands do not have to enter or win any other competitions. The only requirement is the band is a member of the RSPBA or a Pipe Band Association  recognized by the RSPBA\n",
      "Until 2013, the entirety of the World Championships has taken place on one day in August, the current venue being Glasgow Green. Typically several hundred bands attend, traveling from all over the world. Competition commences at 9am. \n",
      "Depending on the size of the grade - or in the case of Grade One, where a band has not secured automatic qualification - bands are required to perform in a qualifying round which takes place in the morning. The top bands at the end of the qualifying round play in a second event in the afternoon to determine the winner. \n",
      "To win, Grade One bands must perform in two events, a March, Strathspey and Reel event (known as a \"set\" or \"MSR\") which consists of three pre-arranged tunes, and a Medley event, which consists of a short selection of music chosen and arranged by the band. The band must prepare two MSR sets and two Medley sets - and play one. This is drawn on the line.\n"
   ]
}