{
   "Name": "World Pipe Band Championships",
   "rawData": [
      "The World Pipe Band Championships is a pipe band competition held in Glasgow, Scotland. The World Pipe Band Championships as we currently know them have been staged since 1947 although the Grade 1 Pipe Band Competition winners at the annual Cowal Highland Gathering were recognised as World Champions as far back as 1906. Although titled \"The World Pipe Band Championship\" this designation was made by the Royal Scottish Pipe Band Association (RSPBA) without consulting any other Pipe Band Association. Even though bands around the world compete the vast majority of bands that enter are from the United Kingdom. For competitive bands, the title of World Champion is highly coveted, and this event is seen as the culmination of a year's worth of preparation, rehearsal and practice. There are no qualifications  to enter, bands do not have to enter or win any other competitions. The only requirement is the band is a member of the RSPBA or a Pipe Band Association  recognized by the RSPBA\n",
      "Until 2013, the entirety of the World Championships has taken place on one day in August, the current venue being Glasgow Green. Typically several hundred bands attend, traveling from all over the world. Competition commences at 9am. \n",
      "Depending on the size of the grade - or in the case of Grade One, where a band has not secured automatic qualification - bands are required to perform in a qualifying round which takes place in the morning. The top bands at the end of the qualifying round play in a second event in the afternoon to determine the winner. \n"
   ],
   "infobox": {},
   "albums": [],
   "prunedData": [
      "The [BAND_NAME] is a [GENRE] band competition held in Glasgow, Scotland. The [BAND_NAME] as we currently know them have been staged since [YEAR] although the Grade 1 Pipe Band Competition winners at the annual Cowal Highland Gathering were recognised as World Champions as far back as [YEAR]. Although titled [SONG_NAME] this designation was made by the Royal Scottish Pipe Band Association (RSPBA) without consulting any other Pipe Band Association. Even though bands around the world compete the vast majority of bands that enter are from the United Kingdom. For competitive bands, the title of World Champion is highly coveted, and this event is seen as the culmination of a year's worth of preparation, rehearsal and practice. There are no qualifications  to enter, bands do not have to enter or win any other competitions. The only requirement is the band is a member of the RSPBA or a Pipe Band Association  recognized by the RSPBA\n",
      "Until [YEAR], the entirety of the World Championships has taken place on one day in [MONTH], the current venue being Glasgow Green. Typically several hundred bands attend, traveling from all over the world. Competition commences at 9am. \n",
      "Depending on the size of the grade - or in the case of Grade One, where a [GENRE] bands are required to perform in a qualifying round which takes place in the morning. The top bands at the end of the qualifying round play in a second event in the afternoon to determine the winner. \n"
   ]
}