{
   "Name": "Despite (band)",
   "rawData": [
      "Despite is a Swedish death metal band from Gothenburg, Sweden.\n",
      "The band was formed in 1998. Their debut indie album, In Your Despite was released in Sweden in March 2009. The album contains a song called ”MindPlague” with guest vocals supplied by Knut Agnred, a renowned Swedish singer and member of the popular comedy group Galenskaparna och After Shave. In October 2010, the band released their second indie album titled Clenched. This time the record producer Andreas Kleerup helped them out on the track \"Commander of Hate\". Later the band parted ways with their singer Alex, and Peter Tuthill (ex member of Carnal Forge, Godsic and Construcdead) joined as their new lead singer in December 2012. During the spring of 2013 Despite entered Crehate Studios to record EPic, released in the beginning of 2014. The album was well received among the metal community. MusicReviewRadar wrote \"EPic is a refreshing, solid and heavy as f**k album that stands out from the crowd (...) Despite seem to be the real deal, ready to leave the underground and dazzle the entire world with their amazing nordic metal for a really long time\". On November 10, 2014 the new standalone single \"Chaos Trigger\" was released. VH1 featured Despite among \"15 MORE Metal Bands You Should Be Listening To In 2015\".\n",
      "In December 2014, bassist Mathias Dagerhed decided to quit, and a replacement was found in Anthony Cui. At the same time Despite decided to add a third guitarist to the line-up, and Zoran Panovic was recruited. In 2015, they released the single \"Praedonum\". This was also the last recording featuring drummer Oscar Nilsson, who left the band to concentrate more on his studio. Drummer Janne Jaloma (ex Deals Death and Bloodshot Dawn) was recruited shortly after Oscar's departure. In late 2015-early 2016, Despite recorded their first album Synergi which was released on July 22, 2016 and featured 13 tracks. This is also the first Despite album to be released through Eclipse Records. The first single \"As You Bleed\" managed to climb to the top 3 of José Mangin's show \"The Devil's Dozen\" on America's biggest satellite metal music radio station Liquid Metal (Sirius XM) and stayed there for several weeks. Synergi has been praised by critics and fans alike all over the globe. In May 2016, guitarist and founding member Timmy Leng decided to leave Despite. Eldor Pettersson replaced Leng in May 2016. In 2017,  Despite released a stand-alone single of The Prodigy's hit single \"Breathe\". On February 15, 2019, Despite released the single, \"Echo Chamber\".\n"
   ],
   "infobox": {
      "Origin": [
         "Gothenburg, Sweden"
      ],
      "Genres": [
         "Melodic death metal",
         "progressive metal",
         "thrash metal",
         "mathcore",
         "djent"
      ],
      "Years active": [
         "1998–present"
      ],
      "Labels": [
         "Dozer"
      ],
      "Website": [
         "www.despiteofficial.com"
      ],
      "Members": [
         "Peter Tuthill, André Gonzales, Zoran Panovic, Eldor Pettersson, Anthony Cui, Janne Jaloma"
      ]
   }
}