{
   "Discography": {},
   "External links": {},
   "Line-up": {},
   "References": {},
   "Sections": [
      "1 Discography",
      "2 Line-up",
      "3 Timeline",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Dimension Zero is a  melodic death metal band based in Gothenburg, Sweden. It was formed in 1995 as a side project by In Flames' former guitarists Jesper Strömblad and Glenn Ljungström. The former Marduk drummer and vocalist Jocke Gothberg joined later on vocals, as well as Hans Nilsson (ex-Liers in Wait, Diabolique, Crystal Age) on drums.\n",
         "The band released Penetrations from the Lost World in 1997 before splitting up the following year. They reformed in 2000, and later recorded Silent Night Fever and This Is Hell. Tours have been rare due to members' other musical commitments.\n",
         "Musically, they have been described as strictly old-school Swedish death metal in the range of At the Gates, Unleashed and Defleshed. Because of Dimension Zero's inception by In Flames' lead guitarist, Jesper Strömblad, their albums have drawn critical comparisons with some of In Flames' earlier work. Their latest album, He Who Shall Not Bleed, was released in 2007.\n",
         "In May 2014, it was announced that the band would reunite for the Gothenburg Sound Festival, which was set to take place in January 2015.[1] In November 2014, a video message from vocalist Jocke on Gothenburg Sound's official Facobook page announced that Dimension Zero had been forced to cancel due to \"family circumstances\" and was replaced by Jesper Strömblad's new band The Resistance. The band is slated to instead reunite for Gothenburg Sound 2016.\n",
         "On March 31, 2016 Jesper Strömblad Announced that Jocke Gothberg and Daniel Antonsson have parted ways with Dimension Zero. The replacement for Jocke Gothberg was later announced as Andy Solveström formerly of Amaranthe.\n"
      ]
   },
   "Timeline": {},
   "Title": "Dimension Zero - Wikipedia"
}