{
   "Name": "Dragonland",
   "rawData": [
      "Dragonland is a power metal band from Sweden. The group is most notable for basing their first two and the fifth album upon the self-produced The Dragonland Chronicles fantasy saga and for the original symphonic/electronic parts by Elias Holmlid.\n",
      "The band was founded in autumn 1999 by guitarist Nicklas Magnusson and Jonas Heidgert. Soon after Daniel Kvist, Magnus Olin and Christer Pederson joined in. Their first demo was recorded in January 2000. Only 3 months before the recording of their debut album started, The Battle of the Ivory Plains, Kvist decided to leave the band and was soon replaced by Olof Mörck. The album was released on 30 April 2001, and the second album, Holy War, was released on 8 February 2002. Both featured singer Jonas Heidgert on drums.\n",
      "In 2003, Dragonland invited Japanese power metal band Galneryus to play with throughout the Japan tour. Their third album, Starfall, was released on 27 October 2004, featuring Jesse Lindskog on drums. Tom S. Englund and Henrik Danhage (of Evergrey) and Johanna Andersson provided guest performances on the album, including vocals and guitar solos.\n"
   ],
   "infobox": {
      "Origin": [
         "Gothenburg, Sweden"
      ],
      "Genres": [
         "Symphonic metal, power metal"
      ],
      "Years active": [
         "1999–present"
      ],
      "Labels": [
         "Black Lotus (1999–2004)",
         "Century Media (Europe, North America)",
         "King Records (Japan)",
         "AFM Records (Europe)"
      ],
      "Associated acts": [
         "Evergrey, Nightrage, Firewind, Amaranthe, Pathfinder, Falconer"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Jonas Heidgert",
         "Olof Mörck",
         "Elias Holmlid",
         "Jesse Lindskog",
         "Anders Hammer",
         "Johan Nunez"
      ],
      "Past members": [
         "Daniel Kvist",
         "Magnus Olin",
         "Robert Willstedt",
         "Christer Pederson",
         "Nicklas Magnusson",
         "Morten Löwe Sörensen"
      ]
   },
   "albums": [
      "The Battle of the Ivory Plains",
      "Holy War",
      "Starfall",
      "Astronomy",
      "Under the Grey Banner",
      "TBD"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Sweden. The group is most notable for basing their first two and the fifth album upon the self-produced The [BAND_NAME] Chronicles fantasy saga and for the original symphonic/electronic parts by Elias Holmlid.\n",
      "The band was founded in autumn [YEAR] by guitarist [PERSON_NAME_FULL_1_MALE] and [PERSON_NAME_FULL_3_MALE]. Soon after Daniel Kvist, [PERSON_NAME_FULL_2_MALE] and [PERSON_NAME_FULL_0_MALE] joined in. Their first demo was recorded in [MONTH] [YEAR]. Only 3 months before the recording of their debut album started, The Battle of the Ivory Plains, Kvist decided to leave the band and was soon replaced by [PERSON_NAME_FULL_4_MALE]. The album was released on 30 [MONTH] [YEAR], and the second album, Holy War, was released on 8 [MONTH] [YEAR]. Both featured singer [PERSON_NAME_FULL_3_MALE] on drums.\n",
      "In [YEAR], [BAND_NAME] invited Japanese power metal band Galneryus to play with throughout the Japan tour. Their third album, Starfall, was released on 27 [MONTH] [YEAR], featuring [PERSON_NAME_FULL_0_MALE] on drums. Tom S. Englund and [PERSON_NAME_FULL_1_MALE] (of Evergrey) and [PERSON_NAME_FULL_2_FEMALE] provided guest performances on the album, including vocals and guitar solos.\n"
   ]
}