{
   "Name": "Dream Evil",
   "Sections": [
      "1 History",
      "2 Members",
      "3 Timeline",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 EPs",
      "4.3 Live",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Dream Evil is a heavy metal band from Sweden, assembled by producer Fredrik Nordström in 1999.\n"
      ]
   },
   "History": {
      "text": [
         "Producer Fredrik Nordström had the ambition of creating a power metal band of his own for a long time, but had difficulty finding anyone with musical ideals similar to his own. However, while on holiday in the Greek islands during the year of 1999, Nordström met the young guitarist Gus G (from Firewind). The musicians got along quite well, despite an age difference of over a decade. Plans for a band commenced - Gus had already been planning to relocate to Gothenburg, and upon his arrival he looked up Fredrik at Studio Fredman to begin writing.\n",
         "The first person asked to join the new band was Snowy Shaw (from King Diamond, Mercyful Fate and Notre Dame), but the drummer initially refused their invitation. He would later change his mind and agreed to play on the band's debut album in a session capacity.\n",
         "Vocalist Niklas Isfeldt had done backing vocals for some of HammerFall's songs produced by Nordström, and since he was not involved in any major projects at the time, he agreed to take the position. He also brought along his longtime friend and Pure-X bandmate Peter Stålfors, who assumed bass guitar duties.\n",
         "Up until the moment the first promotional photos were shot, the entire band had never been in the same place at the same time before. Some members did not even know each other.\n",
         "The band soon got a deal with Century Media Records, and intended to name themselves Dragonslayer due to the medieval and fantastical themes of the songs written by Gus and Nordström. The label did not find the name original enough, and thus the band settled for the name Dream Evil, inspired by the Dio album of the same name.\n",
         "Dream Evil's debut album was released in April 2002, and received positive feedback from the metal press. At one point the album, titled Dragonslayer, reached number one on the Japanese import charts. The band proceeded to play a series of festivals, and also supported Blind Guardian during a part of their world tour.\n",
         "The band members found that they got along well as a unit, despite the somewhat random manner by which they had been brought together - Snowy Shaw decided to join the band permanently, and Dream Evil went on their first Japanese tour. During their stay in Japan, the band was invited by HammerFall to support their 2003 European tour. Their label manager hinted that it would be a good idea to have a new album out by then.\n",
         "With little time on their hands, the band wrote the basis of several songs on the flight back to Europe, and on the day of their arrival entered the studio in order to record a new album. They took two weeks in total to record Evilized, and most songs were recorded as they had been written. It was released on 20 January, and one week later Dream Evil proceeded to tour Europe with HammerFall and the less known Masterplan.\n",
         "For their third album, the band actually took time to write the songs and fine-tune them in the studio. The Book of Heavy Metal took two months to be recorded, and was released in May 2004.\n",
         "Guitarist Gus G left the band in late 2004 in order to dedicate more time to Firewind, being replaced by Mark Black (then known as Mark U Black). Black had previously filled in for Gus on a few other occasions and replaced him permanently on their tour as support act for Saxon.[1]\n",
         "Niklas Isfeldt and Peter Stålfors briefly left in 2005 to be replaced by Jake E. Berg (aka Jake Steel, of Dreamland) and Tommy Larsson. However, a few months later, Niklas and Pater returned before recordings or live shows were done.[2] At the start of 2006, Snowy Shaw abruptly quit Dream Evil. After a period of silence for several months, Dream Evil announced Pat Power (Patrik Jerksten), a co-worker of Fredrik Nordström from Studio Fredman, as Snowy's replacement.\n",
         "The first album featuring the new line-up, United, was released on 13 October 2006.\n",
         "Dream Evil announced on 7 December 2007 on the website that Mark Black would be leaving the band and will be replaced by Daniel Varghamne aka Dannee Demon.\n",
         "On 3 March 2008 the band announced that they had begun work on a new studio album, tentatively titled In the Night. The album was released on 25 January 2010 in Europe and 26 January 2010 in North America.\n",
         "On 23 July 2008 the band announced that their first live DVD/CD set, Gold Medal in Metal (Alive & Archive), was released on 25 August 2008.\n",
         "On 28 December 2013 Dream Evil announced that Dannee Demon left the band and was replaced by Mark Black. Upon contact in 2015, Dream Evil informed that they were not on hiatus, just very busy with other commitments, and had eighteen tracks prepared for a future album.[3] On 7 March 2017 the album titled Six was finally announced to be released on 26 May 2017.[4]\n"
      ]
   },
   "Members": {
      "text": [
         "Current members\n",
         "\n",
         "Former members\n",
         "\n"
      ]
   },
   "Timeline": {},
   "Discography": {
      "Studio albums": {},
      "EPs": {},
      "Live": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Dream Evil is a heavy metal band from Sweden, assembled by producer Fredrik Nordström in 1999.\n",
      "Producer Fredrik Nordström had the ambition of creating a power metal band of his own for a long time, but had difficulty finding anyone with musical ideals similar to his own. However, while on holiday in the Greek islands during the year of 1999, Nordström met the young guitarist Gus G (from Firewind). The musicians got along quite well, despite an age difference of over a decade. Plans for a band commenced - Gus had already been planning to relocate to Gothenburg, and upon his arrival he looked up Fredrik at Studio Fredman to begin writing.\n",
      "The first person asked to join the new band was Snowy Shaw (from King Diamond, Mercyful Fate and Notre Dame), but the drummer initially refused their invitation. He would later change his mind and agreed to play on the band's debut album in a session capacity.\n",
      "Vocalist Niklas Isfeldt had done backing vocals for some of HammerFall's songs produced by Nordström, and since he was not involved in any major projects at the time, he agreed to take the position. He also brought along his longtime friend and Pure-X bandmate Peter Stålfors, who assumed bass guitar duties.\n"
   ]
}