{
   "Name": "Fibes, Oh Fibes!",
   "rawData": [
      "Fibes, Oh Fibes! is a Swedish funk rock band that rose to fame in early 2004.\n",
      "The trio, from Gothenburg on the west coast of Sweden, was formed in 2001. Their first release was a self-titled EP in 2003. The band name is from drum company Fibes Drums, of which the band had a beloved drumset in its early career.\n",
      "In May 2004, their first album, Still Fresh, was released. In August 2006, they released a second album, Emotional. In autumn 2009, the band released the album 1987, on which they collaborated with Gary Kemp, Pontus Winnberg, Petter Winberg and Oskar Linnros. The album also contains duets with Björn Skifs and Kim Wilde. The album won Pop Album of the Year at the 2010 Grammis Awards. \n"
   ],
   "infobox": {
      "Origin": [
         "Sweden"
      ],
      "Genres": [
         "Funk rock, alternative rock"
      ],
      "Years active": [
         "2002–present"
      ],
      "Members": [
         "Christian Olsson - vocals, songwriter",
         "Mathias Nilson - guitar ",
         "Edvin Edvinson - Bass, ",
         "Andreas Jensen - Drums, ",
         "Erik Dahl - Trombone, ",
         "Andres Boson - drums"
      ],
      "Past members": [
         "Mats Larsson"
      ]
   },
   "albums": [
      "Fibes, Oh Fibes!",
      "Still Fresh",
      "Emotional",
      "1987",
      "Album"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band that rose to fame in early [YEAR].\n",
      "The trio, from Gothenburg on the west coast of Sweden, was formed in [YEAR]. Their first release was a self-titled EP in [YEAR]. The band name is from drum company Fibes Drums, of which the band had a beloved drumset in its early career.\n",
      "In [MONTH] [YEAR], their first album, Still Fresh, was released. In [MONTH] [YEAR], they released a second album, Emotional. In autumn [YEAR], the band released the album [YEAR], on which they collaborated with Gary Kemp, [PERSON_NAME_FULL_0_MALE], Petter Winberg and [PERSON_NAME_FULL_1_MALE]. The album also contains duets with [PERSON_NAME_FULL_2_MALE] and Kim Wilde. The album won Pop Album of the Year at the [YEAR] Grammis Awards. \n"
   ]
}