{
   "Name": "Gardenian",
   "Sections": [
      "1 Background",
      "2 Discography",
      "3 Members",
      "3.1 Final Lineup",
      "3.2 Former Members",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Gardenian is a Swedish melodic death metal band from Gothenburg. It formed in 1996 and disbanded in 2004 but reunited in 2012.\n"
      ]
   },
   "Background": {
      "text": [
         "Gardenian was formed in April 1996 by drummer Thim Blom and vocalist/guitarist Jim Kjell. Eventually, guitarist Niklas Engelin and bassist Håkan Skoger joined the band. Later in 1996, the band recorded a demo and sent it to Listenable Records who gave the band a record deal and booked Studio Fredman that same year so that the band could record their debut studio album.\n",
         "In 1997, Gardenian released their debut studio album, Two Feet Stand. After the album's release, the band was pretty dormant due to lack of interest by their label Listenable Records. At this point Niklas Engelin decided to join In Flames for some tours. However, eventually the band decided they needed to break off their contract with Listenable Records and dedicate themselves fully to the band, something which bassist Håkan Skoger felt he could no longer do since he wanted to focus on his other band Headplate.\n",
         "After breaking off their contract with Listenable Records the band signed with Nuclear Blast. In 1999, Gardenian recorded and released their second studio album, Soulburner, which was also recorded in Studio Fredman. This album featured guest vocals by Eric Hawk (ex-Artch) and Sabrina Khilstrand (ex-Ice Age). After Soulburner's release the band toured with bands such as In Flames, Dark Tranquillity, Children of Bodom, Hypocrisy, The Kovenant, and Evereve.\n",
         "In 2000, Gardenian recorded and released their third studio album, Sindustries. This album was recorded in Abyss Studio and produced by Peter Tägtgren. Shortly after the release of Sindustries, Gardenian felt disappointed with the way Nuclear Blast was treating them, so they broke off their contract. In 2003, Gardenian underwent major line-up changes and in 2004, the band eventually disbanded.\n",
         "In 2012, it was announced that the band will reunite with the original lineup, only once for the 4-5 January, 2013 edition of The Gothenburg Sound festival, which took place in Trädgår'n, Gothenburg, Sweden[1] but then in March 2013 it was announced that they weren't going to do the one-off reunion as planned and remain active. They split up again in 2016 [2]\n"
      ]
   },
   "Discography": {},
   "Members": {
      "Final Lineup": {},
      "Former Members": {
         "text": [
            "Timeline\n"
         ]
      }
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Gardenian is a Swedish melodic death metal band from Gothenburg. It formed in 1996 and disbanded in 2004 but reunited in 2012.\n",
      "Gardenian was formed in April 1996 by drummer Thim Blom and vocalist/guitarist Jim Kjell. Eventually, guitarist Niklas Engelin and bassist Håkan Skoger joined the band. Later in 1996, the band recorded a demo and sent it to Listenable Records who gave the band a record deal and booked Studio Fredman that same year so that the band could record their debut studio album.\n",
      "In 1997, Gardenian released their debut studio album, Two Feet Stand. After the album's release, the band was pretty dormant due to lack of interest by their label Listenable Records. At this point Niklas Engelin decided to join In Flames for some tours. However, eventually the band decided they needed to break off their contract with Listenable Records and dedicate themselves fully to the band, something which bassist Håkan Skoger felt he could no longer do since he wanted to focus on his other band Headplate.\n",
      "After breaking off their contract with Listenable Records the band signed with Nuclear Blast. In 1999, Gardenian recorded and released their second studio album, Soulburner, which was also recorded in Studio Fredman. This album featured guest vocals by Eric Hawk (ex-Artch) and Sabrina Khilstrand (ex-Ice Age). After Soulburner's release the band toured with bands such as In Flames, Dark Tranquillity, Children of Bodom, Hypocrisy, The Kovenant, and Evereve.\n"
   ]
}