{
   "Name": "Graveyard (band)",
   "rawData": [
      "Graveyard is a Swedish hard rock band from Gothenburg, formed in 2006.\n",
      "Joakim Nilsson, Rikard Edlund (both formerly of Norrsken), Axel Sjöberg, and Truls Mörck formed Graveyard in 2006. When Norrsken disbanded in 2000, guitarist Magnus Pelander went on to form doomy folk metal act Witchcraft and Nilsson and Edlund joined Albatross, a growly blues rock band whose lineup also included Sjöberg on drums. Initially, they considered Albatross a hobby project, but after five years the members began taking their music more seriously and had grown dissatisfied with the direction their sound had taken. When Albatross broke up, Nilsson and Edlund decided that for their next venture, they would head back towards their roots as musicians and songwriters. Nilsson explains, “I am a singer, but in Albatross I only played guitar. Rikard played guitar but he is a bass player. We also wanted a more straightforward  sound.”\n",
      "Together with Sjöberg and guitarist/singer Truls Mörck (not to be confused with Truls Mørk) they began practicing as Graveyard. Upon their initial formation, Graveyard quickly recorded a two track demo, played a total of three shows, and began planning for a full-length album with Swedish label Transubstans Records. In the meantime, they posted a demo of some of their material on Myspace. Songs from the band's Myspace caught the ear of Tony Presedo, founder of Tee Pee Records. Their self-titled debut album was recorded by Don Ahlsterberg and released in early 2008. On the recording sessions' completion, Truls Mörck was replaced by guitarist Jonatan Ramm. The debut album received generally good reviews. Graveyard performed at the 2008's South by Southwest Music Festival.\n"
   ],
   "infobox": {
      "Origin": [
         "Gothenburg, Sweden"
      ],
      "Genres": [
         "Hard rock, neo-psychedelia, psychedelic rock, blues rock, occult rock[1]"
      ],
      "Years active": [
         "2006–2016, 2017–present"
      ],
      "Labels": [
         "TeePee Records / Transubstans Records (past), Nuclear Blast (present)"
      ],
      "Associated acts": [
         "Norrsken, Spiders"
      ],
      "Website": [
         "Graveyard on Myspace, Graveyard official site"
      ],
      "Members": [
         "Joakim Nilsson",
         "Jonatan Ramm",
         "Truls Mörck",
         "Oskar Bergenheim"
      ],
      "Past members": [
         "Rikard Edlund",
         "Axel Sjöberg"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Gothenburg, formed in [YEAR].\n",
      "Joakim Nilsson, [PERSON_NAME_FULL_0_MALE] (both formerly of Norrsken), [PERSON_NAME_FULL_1_MALE], and [PERSON_NAME_FULL_3_MALE] formed [BAND_NAME] in [YEAR]. When Norrsken disbanded in [YEAR], guitarist [PERSON_NAME_FULL_2_MALE] went on to form doomy folk metal act Witchcraft and Nilsson and [PERSON_NAME_LAST_0] joined Albatross, a [GENRE] band whose lineup also included [PERSON_NAME_LAST_1] on drums. Initially, they considered Albatross a hobby project, but after five years the members began taking their music more seriously and had grown dissatisfied with the direction their sound had taken. When Albatross broke up, Nilsson and [PERSON_NAME_LAST_0] decided that for their next venture, they would head back towards their roots as musicians and songwriters. Nilsson explains, “I am a singer, but in Albatross I only played guitar. [PERSON_NAME_FIRST_0] played guitar but he is a bass player. We also wanted a more straightforward  sound.”\n",
      "Together with Sjöberg and guitarist/singer [PERSON_NAME_FIRST_1] [PERSON_NAME_LAST_2] (not to be confused with [PERSON_NAME_FULL_1_MALE]) they began practicing as [BAND_NAME]. Upon their initial formation, [BAND_NAME] quickly recorded a [GENRE] a total of three shows, and began planning for a full-length album with Swedish label Transubstans Records. In the meantime, they posted a demo of some of their material on Myspace. Songs from the band's Myspace caught the ear of [PERSON_NAME_FULL_0_MALE], founder of Tee Pee Records. Their self-titled debut album was recorded by Don Ahlsterberg and released in early [YEAR]. On the recording sessions' completion, [PERSON_NAME_FIRST_1] [PERSON_NAME_LAST_2] was replaced by guitarist Jonatan Ramm. The debut album received generally good reviews. [BAND_NAME] performed at the [YEAR]'s South by Southwest Music Festival.\n"
   ]
}