{
   "Name": "JJ (Swedish band)",
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Mixtapes",
      "2.3 Singles and EPs",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "JJ, styled as jj, is a Swedish band who has released music through the Gothenburg-based independent label Sincerely Yours and the Bloomington, Indiana-based label Secretly Canadian.[1][2] The band consists of Joakim Benon and Elin Kastlander.[3]\n"
      ]
   },
   "History": {
      "text": [
         "jj met in their hometown of Vallentuna, outside of Stockholm, and began playing together at a local youth center.[4] They released their debut jj n° 1 in early 2009 and a couple of months later they released their debut album jj n° 2.[5] Both the debut single and the debut album received a Best New Music inclusion from Pitchfork Media with ratings of 8 and 8.6 respectively.[6]\n",
         "On December 24, 2008 it was announced that the American record label Secretly Canadian had signed jj to their roster. At the same time, the release date for jj's second full length album was slated. The album, named jj n° 3, was released in the United States and Sweden on March 9, 2010.[7] jj works with both Sincerely Yours and Secretly Canadian, depending on the location, and hence didn't leave Sincerely Yours for Secretly Canadian.\n",
         "Aside from their official releases, jj has also done several covers and new takes on contemporary songs. For example, they've recorded covers of Akon's \"Troublemaker\", Jeremih's \"Birthday Sex\" and the \"Theme Song\" for the Welcome Back, Kotter TV-series. All of these were released for free on the internet, making it similar to a mixtape.[8]\n",
         "From March to April 2010, jj was on a nationwide tour in the United States with the British band The xx.[9] Following the US tour, jj went on a minor tour through Europe with dates in Italy, France and Belgium among others.[10]\n",
         "jj's next release, following jj n° 3, was a mixtape named Kills.[11] It was released as a free download on Christmas Eve 2010, at Sincerely Yours website.[12][13]\n",
         "In late March 2011, jj collaborated with fellow Swedish artist Yves Saint Lorentz to make an official remix of Rebecca & Fiona's single \"Bullets\". The remix was named \"The End of the World\".[14]\n",
         "jj's song \"My Life\" from jj n° 3 was featured in an official trailer for Battlefield 3 that was released in April 2011.[15]\n",
         "In summer 2011, jj collaborated with the American R&B singer Ne-Yo and released the song \"We Can't Stop\" as part of the Adult Swim Singles Program 2011.[16] Later in 2011, they were involved in another collaboration with American rapper Don Trip to make the song \"Cheers (jj’s Save Our Souls Remix)\" for the magazine The Fader.[17]\n",
         "In September 2013 they collaborated with Adrian Lux on the song \"Wild Child\".[18]\n",
         "In May 2014, jj announced their third studio album entitled V, as in jj n° 5. At the same  time they released the single \"All White Everything\" from the album. V was released on August 19, 2014.[19]\n",
         "On August 12, 2015 jj released the EP \"Death\" consisting of five new songs.[20]\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Mixtapes": {},
      "Singles and EPs": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "JJ, styled as jj, is a Swedish band who has released music through the Gothenburg-based independent label Sincerely Yours and the Bloomington, Indiana-based label Secretly Canadian.[1][2] The band consists of Joakim Benon and Elin Kastlander.[3]\n",
      "jj met in their hometown of Vallentuna, outside of Stockholm, and began playing together at a local youth center.[4] They released their debut jj n° 1 in early 2009 and a couple of months later they released their debut album jj n° 2.[5] Both the debut single and the debut album received a Best New Music inclusion from Pitchfork Media with ratings of 8 and 8.6 respectively.[6]\n",
      "On December 24, 2008 it was announced that the American record label Secretly Canadian had signed jj to their roster. At the same time, the release date for jj's second full length album was slated. The album, named jj n° 3, was released in the United States and Sweden on March 9, 2010.[7] jj works with both Sincerely Yours and Secretly Canadian, depending on the location, and hence didn't leave Sincerely Yours for Secretly Canadian.\n",
      "Aside from their official releases, jj has also done several covers and new takes on contemporary songs. For example, they've recorded covers of Akon's \"Troublemaker\", Jeremih's \"Birthday Sex\" and the \"Theme Song\" for the Welcome Back, Kotter TV-series. All of these were released for free on the internet, making it similar to a mixtape.[8]\n"
   ]
}