{
   "Name": "Lillasyster",
   "rawData": [
      "Lillasyster is a Swedish rock band formed in Gothenburg in 2006. They released their debut album, Hjärndöd musik för en hjärndöd generation (Braindead Music For A Braindead Generation) in May 2007.\n",
      "Lillasyster (meaning Little Sister) was formed as Rallypack in 2004, by former LOK members Martin Westerstrand (lead vocals) and Daniel Cordero (bass). After a while, Rallypack changed the name to Lillasyster. In February 2007 their first single \"Berätta det för Lina\" (\"Tell It to Lina\" in English) was released and in May 2007 they released their first album. They are also known for their cover versions of R&B star Rihanna's \"Umbrella\" the same year (2007) and Katy Perry's \"Roar\" (2014) which became successful.\nThe style of Lillasyster's music is very similar to LOK's music.\n",
      "They will participate in Melodifestivalen 2021.\n"
   ],
   "infobox": {
      "Origin": [
         "Gothenburg, Sweden"
      ],
      "Genres": [
         "Alternative metal, hard rock, nu metal, hardcore punk"
      ],
      "Years active": [
         "2006 — present",
         "2004 — 2006 as Rallypack"
      ],
      "Labels": [
         "Gain Music Entertainment"
      ],
      "Associated acts": [
         "LOK",
         "Rallypack"
      ],
      "Website": [
         "lillasyster.nu"
      ],
      "Members": [
         "Martin Westerstrand",
         "Max Flövik",
         "Daniel Cordero",
         "Ian-Paolo Lira"
      ]
   },
   "albums": [
      "Sod Off, God! We Believe in Our Rockband",
      "Hjärndöd musik för en hjärndöd generation",
      "Det Här Är Inte Musik Det Här Är Kärlek",
      "3",
      "4",
      "Svensk Jävla Metal"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band formed in Gothenburg in [YEAR]. They released their debut album, Hjärndöd musik för en hjärndöd generation (Braindead Music For A Braindead Generation) in [MONTH] [YEAR].\n",
      "[BAND_NAME] (meaning Little Sister) was formed as Rallypack in [YEAR], by former LOK members [MONTH]tin Westerstrand (lead vocals) and [PERSON_NAME_FULL_0_MALE] (bass). After a while, Rallypack changed the name to [BAND_NAME]. In [MONTH] [YEAR] their first single [SONG_NAME] ([YEAR]) which became successful.\nThe style of [BAND_NAME]'s music is very similar to LOK's music.\n",
      "They will participate in Melodifestivalen [YEAR].\n"
   ]
}