{
   "Name": "LOK (band)",
   "rawData": [
      "LOK are a Swedish nu metal band formed in 1995, disbanded in 2002 and reunited in 2019.\n",
      "The band was created in Partille, a suburb to Göteborg in 1995, as a fusion of the two rock bands \"PsychoBetaBuckDown\" (with Martin as vocalist) and \"Hyperbug\" (with Johan as bassist). The two bands shared the same rehearsal space and had played together a few times. The bands had also finished second and first respectively in a communal rock band competition in 1994. Martin and Johan decided to play together in the 1995 competition and Johan also changed from bass to his original instrument, drums. They needed a guitarist and a bassist and found Daniel (from the band \"In a Pig's Eye\") and Thomas (from the Judas Priest cover band \"Just as Priest\").\n",
      "Their first rehearsal was held in August 1995, with Martin singing in English for about ten minutes before fooling around and starting to sing in Swedish. It sounded strange, and they decided to continue with Swedish lyrics. The name of the band, which is an abbreviation of locomotive in Swedish, was chosen as a reference to their music style; \"heavy, relentless and totally over-running\"!\n"
   ],
   "infobox": {
      "Origin": [
         "Gothenburg, Sweden"
      ],
      "Genres": [
         "Nu metal, Rap metal, Rapcore, Metalcore"
      ],
      "Years active": [
         "1995–2002, 2019-"
      ],
      "Associated acts": [
         "Lillasyster"
      ],
      "Members": [
         "Martin Westerstrand",
         "Daniel Cordero",
         "Johan Reivén",
         "Thomas Brandt"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band formed in [YEAR], disbanded in [YEAR] and reunited in [YEAR].\n",
      "The band was created in Partille, a suburb to Göteborg in [YEAR], as a fusion of the two rock bands \"PsychoBetaBuckDown\" (with [MONTH]tin as vocalist) and \"Hyperbug\" (with Johan as bassist). The two bands shared the same rehearsal space and had played together a few times. The bands had also finished second and first respectively in a communal rock band competition in [YEAR]. [MONTH]tin and Johan decided to play together in the [YEAR] competition and Johan also changed from bass to his original instrument, drums. They needed a guitarist and a bassist and found Daniel (from the band \"In a Pig's Eye\") and Thomas (from the Judas Priest cover band \"Just as Priest\").\n",
      "Their first rehearsal was held in [MONTH] [YEAR], with [MONTH]tin singing in English for about ten minutes before fooling around and starting to sing in Swedish. It sounded strange, and they decided to continue with Swedish lyrics. The name of the band, which is an [GENRE] a reference to their music style; \"heavy, relentless and totally over-running\"!\n"
   ]
}