{
   "Name": "LOK (band)",
   "Sections": [
      "1 The band",
      "1.1 Members",
      "1.2 History",
      "2 Discography",
      "2.1 Albums",
      "2.2 Singles",
      "3 See also",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "LOK are a Swedish nu metal band formed in 1995, disbanded in 2002 and reunited in 2019.\n"
      ]
   },
   "The band": {
      "Members": {},
      "History": {
         "text": [
            "The band was created in Partille, a suburb to Göteborg in 1995, as a fusion of the two rock bands \"PsychoBetaBuckDown\" (with Martin as vocalist) and \"Hyperbug\" (with Johan as bassist). The two bands shared the same rehearsal space and had played together a few times. The bands had also finished second and first respectively in a communal rock band competition in 1994. Martin and Johan decided to play together in the 1995 competition and Johan also changed from bass to his original instrument, drums. They needed a guitarist and a bassist and found Daniel (from the band \"In a Pig's Eye\") and Thomas (from the Judas Priest cover band \"Just as Priest\").\n",
            "Their first rehearsal was held in August 1995, with Martin singing in English for about ten minutes before fooling around and starting to sing in Swedish. It sounded strange, and they decided to continue with Swedish lyrics. The name of the band, which is an abbreviation of locomotive in Swedish, was chosen as a reference to their music style; \"heavy, relentless and totally over-running\"!\n",
            "They won two large music competitions in the next nine months, being awarded with studio time and the production of two singles. Their first album was released in November 1996 and contained six songs. The band signed their first contract with Stockholm Records in the summer of 1997, and recorded their new album during 1998. They also performed at the Hultsfred Festival for the first time the same year. In 2000 they performed at Roskilde Festival on the green stage in front of 17,500 people.\n",
            "LOK made their last appearance ever in Malmö, in late 2002. They played in Gothenburg for the last time just a few days before that; the event was recorded and became a live album, their last release. After problems between the members, the band was declared dead. They said that they had shown Sweden that hardcore music could be in Swedish, and after five albums, their purpose had been reached, and thus there was no reason to continue.\n",
            "Two of the former members, Martin Westerstrand and Daniel Cordero along with two new members, started the band Rallypack in 2004 and recorded the album Sod Off, God! We Believe In Our Rockband being their first and last English record and the only record under the name Rallypack.\n",
            "Rallypack became Lillasyster in 2006, and released their debut album Hjärndöd musik för en hjärndöd generation (Braindead Music For A Braindead Generation) in May 2007.\n",
            "In January 2019 the former band members announced that they had begun rehearsals together with the goal to tour Sweden in the summer for the 20th anniversary of their first full-length album.[citation needed]\n"
         ]
      }
   },
   "Discography": {
      "Albums": {},
      "Singles": {}
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "LOK are a Swedish nu metal band formed in 1995, disbanded in 2002 and reunited in 2019.\n",
      "The band was created in Partille, a suburb to Göteborg in 1995, as a fusion of the two rock bands \"PsychoBetaBuckDown\" (with Martin as vocalist) and \"Hyperbug\" (with Johan as bassist). The two bands shared the same rehearsal space and had played together a few times. The bands had also finished second and first respectively in a communal rock band competition in 1994. Martin and Johan decided to play together in the 1995 competition and Johan also changed from bass to his original instrument, drums. They needed a guitarist and a bassist and found Daniel (from the band \"In a Pig's Eye\") and Thomas (from the Judas Priest cover band \"Just as Priest\").\n",
      "Their first rehearsal was held in August 1995, with Martin singing in English for about ten minutes before fooling around and starting to sing in Swedish. It sounded strange, and they decided to continue with Swedish lyrics. The name of the band, which is an abbreviation of locomotive in Swedish, was chosen as a reference to their music style; \"heavy, relentless and totally over-running\"!\n",
      "They won two large music competitions in the next nine months, being awarded with studio time and the production of two singles. Their first album was released in November 1996 and contained six songs. The band signed their first contract with Stockholm Records in the summer of 1997, and recorded their new album during 1998. They also performed at the Hultsfred Festival for the first time the same year. In 2000 they performed at Roskilde Festival on the green stage in front of 17,500 people.\n"
   ]
}