{
   "Name": "Love Is All (band)",
   "rawData": [
      "Love Is All is a Swedish five-piece indie pop band from Gothenburg, Sweden. It releases songs in English. Paste Magazine has stated that it makes \"infectiously lo-fi punk rock laced with saxophone and melodic vocals\". Their most acclaimed single, \"Make out fall out make up\" is included among Pitchfork's 200 best songs of 2000s. \n",
      "Swedish band Love Is All are composed of Josephine Olausson (vocals, keyboard), Johan Lindwall (bass), Markus Görsch (drums), James Ausfahrt (saxophone), and Nicholaus Sparding (guitar/vocals). Olausson, Sparding, and Görsch had previously been members of Girlfrendo. The trio promptly regrouped after that band's demise and added Lindwall, who had recorded in a side project with Olausson and Sparding called Cat Skills. They finally added the missing piece with saxophone player Fredrik Eriksson. While earning many rave reviews from the blogging community for their blend of art punk and indie rock, the band released several singles, one of which made single of the week in NME. The singles were collected on the debut LP Nine Times That Same Song, released by New York-based What's Your Rupture? in late 2005. The album was re-released in the world outside of North America by the British record label Parlophone in 2006. After much touring through 2006 and 2007, Eriksson left the band and Love Is All continued on as a quartet. A Hundred Things Keep Me Up at Night and the remix album Love Is All Mixed Up arrived in 2008, along with Eriksson's replacement Åke Strömer (saxophone, keyboards). They are currently signed to Polyvinyl Record Co..\n"
   ],
   "infobox": {
      "Origin": [
         "Gothenburg, Sweden"
      ],
      "Genres": [
         "Indie pop"
      ],
      "Years active": [
         "2003–present"
      ],
      "Labels": [
         "What's Your Rupture? ",
         " Polyvinyl Record Co."
      ],
      "Members": [
         "Nicholaus Sparding",
         "Josephine Olausson",
         "James Ausfahrt",
         "Markus Görsch",
         "Johan Lindwall"
      ],
      "Past members": [
         "Fredrik Eriksson"
      ]
   },
   "albums": [
      "Nine Times That Same Song",
      "A Hundred Things Keep Me Up at Night",
      "Two Thousand and Ten Injuries"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Gothenburg, Sweden. It releases songs in English. Paste Magazine has stated that it makes [SONG_NAME] is included among Pitchfork's 200 best songs of [YEAR]s. \n",
      "Swedish band [BAND_NAME] are composed of [PERSON_NAME_FULL_2_FEMALE] (vocals, keyboard), [PERSON_NAME_FULL_1_MALE] (bass), [MONTH]kus Görsch (drums), James Ausfahrt (saxophone), and Nicholaus Sparding (guitar/vocals). [PERSON_NAME_LAST_2], Sparding, and Görsch had previously been members of Girlfrendo. The trio promptly regrouped after that band's demise and added [PERSON_NAME_LAST_1], who had recorded in a side project with [PERSON_NAME_LAST_2] and Sparding called Cat Skills. They finally added the missing piece with saxophone player [PERSON_NAME_FULL_0_MALE]. While earning many rave reviews from the blogging community for their blend of art punk and indie rock, the band released several singles, one of which made single of the week in NME. The singles were collected on the debut LP Nine Times That Same Song, released by New York-based What's Your Rupture? in late [YEAR]. The album was re-released in the world outside of North America by the British record label Parlophone in [YEAR]. After much touring through [YEAR] and [YEAR], [PERSON_NAME_LAST_0] left the band and [BAND_NAME] continued on as a quartet. A Hundred Things Keep Me Up at Night and the remix album [BAND_NAME] Mixed Up arrived in [YEAR], along with [PERSON_NAME_LAST_0]'s replacement [PERSON_NAME_FULL_3_MALE] (saxophone, keyboards). They are currently signed to Polyvinyl Record Co..\n"
   ]
}