{
   "Name": "Flowerhead",
   "Sections": [
      "1 Biography",
      "2 Discography",
      "2.1 Albums",
      "2.2 Singles",
      "2.3 Compilations",
      "2.4 Independent releases",
      "2.5 Music videos",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Flowerhead was a rock band from Austin, Texas.\n"
      ]
   },
   "Biography": {
      "text": [
         "The seeds of Flowerhead were originally planted deep underground by founding members Eric Faust (Lead Vocals, Bass, Guitars) and Buz Zoller (Guitars, Vocals) in 1987. With the addition of Eric Schmitz (Guitars, Vocals) in 1989 and Pete Levine (Drums, Vocals) in 1990, the roots took hold. The unassuming rock band, working in the sweaty club environments of Austin, Texas and nearby cities and states, began its campaign to enter the music world with their independently produced 4-track, cassette only release \"Turmoil in the Toybox\". \n",
         "After being \"discovered\" (buying and listening to Turmoil) by CMJ (College Media Journal) veteran Scott Byron (A&R guru for BMG label Zoo Entertainment), the band was quickly signed following feverish live performances preceding and during Austin's popular South by Southwest Music Festival. A fast paced 1991 resulted in the rapid replacement of local management and legal representation by industry insiders in New York City and Hollywood. Riding on the \"Turmoil Tapes\", the band embarked on a promotional tour before going into the studio. An East coast stint with British rockers Thee Hypnotics laid a foundation in the \"cool club circuit\" that made Flowerhead welcome throughout the U.S. and Canada.\n",
         "Flowerhead produced their debut album at Butch Vig's Smart Studios in Madison, Wisconsin in the Spring of 1992. Working with engineers Brian Anderson, Steve Marker, and Duke Erikson, the band recorded Ka-Bloom within two months. Faust joined Lou Giordano at The Carriage House in Stamford, Connecticut for the mixing sessions, and mastering was at K Disc in Hollywood with Jack Skinner. However, after mastering the tracks, Flowerhead decided that the record was not complete. The addition of \"Everything is Beautiful\" was produced at Cedar Creek Studios in Austin with engineer Jim Wilson.\n",
         "The release was followed by constant touring, including jaunts with Ned's Atomic Dustbin, and favorite tour companions Blind Melon.\n",
         "With the addition of drummer Kyle Thomas (Course of Empire, Reverend Horton Heat), 1994's The People's Fuzz was recorded in Austin (Willie Nelson's Arlyn Studio) with co-producer Robbie Adams (U2). As stated in the liner notes, Danny Levin (Asleep at the Wheel) blessed the record with his fiddle, most notably on \"Cows\" and the loop in \"Arise\".\n",
         "Mixing was done at Chick Corea's Mad Hatter Studios, but changes were needed as before with Ka-Bloom!. Without the presence of Adams, and again with engineer extraordinaire \"Supermodel\" Jim Wilson, additional tracks were added as well as remixes for many of the songs on the record.\n",
         "From 1994 - 1995, the Zoo bands felt the impact of BMG's \"downsizing\" of their \"indie\" label. Flowerhead continued touring, including a brief time with Cheap Trick, until the summer of 1995 when they decided to go on a hiatus. The band has remained on hiatus, but promises to reform and rock the world when both are ready.\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Singles": {},
      "Compilations": {},
      "Independent releases": {},
      "Music videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Flowerhead was a rock band from Austin, Texas.\n",
      "The seeds of Flowerhead were originally planted deep underground by founding members Eric Faust (Lead Vocals, Bass, Guitars) and Buz Zoller (Guitars, Vocals) in 1987. With the addition of Eric Schmitz (Guitars, Vocals) in 1989 and Pete Levine (Drums, Vocals) in 1990, the roots took hold. The unassuming rock band, working in the sweaty club environments of Austin, Texas and nearby cities and states, began its campaign to enter the music world with their independently produced 4-track, cassette only release \"Turmoil in the Toybox\". \n",
      "After being \"discovered\" (buying and listening to Turmoil) by CMJ (College Media Journal) veteran Scott Byron (A&R guru for BMG label Zoo Entertainment), the band was quickly signed following feverish live performances preceding and during Austin's popular South by Southwest Music Festival. A fast paced 1991 resulted in the rapid replacement of local management and legal representation by industry insiders in New York City and Hollywood. Riding on the \"Turmoil Tapes\", the band embarked on a promotional tour before going into the studio. An East coast stint with British rockers Thee Hypnotics laid a foundation in the \"cool club circuit\" that made Flowerhead welcome throughout the U.S. and Canada.\n",
      "Flowerhead produced their debut album at Butch Vig's Smart Studios in Madison, Wisconsin in the Spring of 1992. Working with engineers Brian Anderson, Steve Marker, and Duke Erikson, the band recorded Ka-Bloom within two months. Faust joined Lou Giordano at The Carriage House in Stamford, Connecticut for the mixing sessions, and mastering was at K Disc in Hollywood with Jack Skinner. However, after mastering the tracks, Flowerhead decided that the record was not complete. The addition of \"Everything is Beautiful\" was produced at Cedar Creek Studios in Austin with engineer Jim Wilson.\n"
   ]
}