{
   "Name": "Marionette (band)",
   "Sections": [
      "1 Career",
      "2 Members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Marionette was a Swedish melodic death metal band. They hail from Gothenburg, Sweden, formed in 2005. The band achieved recognition from placing high, and often winning, many national and international music contests. Inspired by the Japanese visual-kei scene and the brutality of Swedish hardcore and metal, Marionette has brought new light to the metal genre. \n"
      ]
   },
   "Career": {
      "text": [
         "When founded in 2005, when the average member's age was 16, Marionette quickly made a name for themselves in the Swedish metal scene by winning and placing high in many national and international music contests. In support of the EP, Terror Hearts - which was mixed and mastered by Fredrick Nordström (In Flames, At the Gates) – Marionette shared the stage with some of the world's most renowned metal acts including: Machine Head, Slayer, Mastodon, Meshuggah, and Candlemass among others.[2]\n",
         "In January 2008, Marionette recorded its debut album, Spite, with a series of up-and-coming as well as established producers in Swedish music: including Simon Exner (As You Drown), and two time Swedish Grammy winner Åke Parmerud. Spite was mixed and mastered by Christian Silver (Sonic Syndicate). Mixing elegance, darkness, power, aggression, and speed, Spite, hit the metal scene with the power of an atomic bomb in April 2008, receiving raving reviews from mainstream and underground publications around Europe. The album was released across North America in September of the same year via France's Listenable Records.[3]\n",
         "Marionette made its debut European tour in October 2008 following an exclusive showcase at PopKomm in Berlin, augmenting the band's growing prominence in the European metal scene. Marionette then hit the road with Die Apokalyptischen Reiter for the month long, critically acclaimed, Reiterfestspiele 2008 tour.[4] On the back of popular support from the band's growing UK fan base and acclaim from Metal Hammer and Kerrang! magazines, Marionette did a short headline tour in the UK in January 2009.[5]  Marionette then joined the Deathstars and Sonic Syndicate for the Scandinavian dates of the Death Syndicate European Tour in February and March 2009.[6]  In April 2009 Marionette was invited to join the Deathstars on the UK leg of its Night Electric Night Tour.[7]  Following the aforementioned tour Marionette began writing material for its second full-length album Enemies.\n",
         "In keeping with the approach established for Spite, Marionette assembled a production team for Enemies which included Pontus Hjelm (Dead by April) and two-time Swedish Grammy award-winning producer Åke Parmerud. Fredrik Nordström (In Flames, At the Gates, Bring Me the Horizon) and Peter In De Betou (Dimmu Borgir, Meshuggah) handled mixing and mastering duties respectively.[8] \"Enemies\" was born to critical acclaim upon its European release in late 2009 and early 2010 in North America and Japan. Special recognition was given to the band's aggressive sound, “stylistic depth”, “technical cohesion”, and an intrinsic ability to walk the line between relentless heaviness and commercial appeal (Kerrang! magazine).[9]  Heavy touring followed including Scandinavian dates with Five Finger Death Punch and Shadows Fall in November 2009 and European and UK tour with Blessthefall. \"Enemies\" was nominated for a Swedish Metal Award in the category of “Best Death Metal Album” of 2009.[10]\n",
         "In July 2010, Marionette entered Studio Fredman with producer Fredrik Nordström to begin recording the band's as yet unnamed third album, the first to feature new vocalist Alexander Andersson who replaced vocalist Axel Widén (ZombieKrig) in spring of the same year.[11]  The band took a brief break from recording in fall 2010 to perform on its headlining The SlaughTour 2010 of the UK and Denmark and to support fellow Gothenburgers Dark Tranquillity for the final Scandinavian dates of its Where Death Is Most Alive Part II Tour.[12]  In November 2010 Marionette signed a worldwide publishing deal with Warner Chappell Music, only the third metal band to have signed by the company's Swedish branch (the other two being Meshuggah and Sabaton).[13]  In January 2010 Marionette toured Europe as direct support for the Murderdolls.[14]  In February 2011 Marionette completed the mix of its third album at PH Studio in Gothenburg with Pontus Hjelm, who the band had worked with previously on the Enemies album.\n",
         "In May 2011, Marionette announced they would tour Europe and the UK on \"The SlaughTour 2011\" with Swedish pop-metallers Dead By April. \"The SlaughTour 2011\" covered Denmark, Netherlands, Germany, Austria, France, and the UK in October and November 2011.\n"
      ]
   },
   "Members": {},
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Marionette was a Swedish melodic death metal band. They hail from Gothenburg, Sweden, formed in 2005. The band achieved recognition from placing high, and often winning, many national and international music contests. Inspired by the Japanese visual-kei scene and the brutality of Swedish hardcore and metal, Marionette has brought new light to the metal genre. \n",
      "When founded in 2005, when the average member's age was 16, Marionette quickly made a name for themselves in the Swedish metal scene by winning and placing high in many national and international music contests. In support of the EP, Terror Hearts - which was mixed and mastered by Fredrick Nordström (In Flames, At the Gates) – Marionette shared the stage with some of the world's most renowned metal acts including: Machine Head, Slayer, Mastodon, Meshuggah, and Candlemass among others.[2]\n",
      "In January 2008, Marionette recorded its debut album, Spite, with a series of up-and-coming as well as established producers in Swedish music: including Simon Exner (As You Drown), and two time Swedish Grammy winner Åke Parmerud. Spite was mixed and mastered by Christian Silver (Sonic Syndicate). Mixing elegance, darkness, power, aggression, and speed, Spite, hit the metal scene with the power of an atomic bomb in April 2008, receiving raving reviews from mainstream and underground publications around Europe. The album was released across North America in September of the same year via France's Listenable Records.[3]\n",
      "Marionette made its debut European tour in October 2008 following an exclusive showcase at PopKomm in Berlin, augmenting the band's growing prominence in the European metal scene. Marionette then hit the road with Die Apokalyptischen Reiter for the month long, critically acclaimed, Reiterfestspiele 2008 tour.[4] On the back of popular support from the band's growing UK fan base and acclaim from Metal Hammer and Kerrang! magazines, Marionette did a short headline tour in the UK in January 2009.[5]  Marionette then joined the Deathstars and Sonic Syndicate for the Scandinavian dates of the Death Syndicate European Tour in February and March 2009.[6]  In April 2009 Marionette was invited to join the Deathstars on the UK leg of its Night Electric Night Tour.[7]  Following the aforementioned tour Marionette began writing material for its second full-length album Enemies.\n"
   ]
}