{
   "Name": "Marionette (band)",
   "rawData": [
      "Marionette was a Swedish melodic death metal band. They hail from Gothenburg, Sweden, formed in 2005. The band achieved recognition from placing high, and often winning, many national and international music contests. Inspired by the Japanese visual-kei scene and the brutality of Swedish hardcore and metal, Marionette has brought new light to the metal genre. \n",
      "When founded in 2005, when the average member's age was 16, Marionette quickly made a name for themselves in the Swedish metal scene by winning and placing high in many national and international music contests. In support of the EP, Terror Hearts - which was mixed and mastered by Fredrick Nordström (In Flames, At the Gates) – Marionette shared the stage with some of the world's most renowned metal acts including: Machine Head, Slayer, Mastodon, Meshuggah, and Candlemass among others.\n",
      "In January 2008, Marionette recorded its debut album, Spite, with a series of up-and-coming as well as established producers in Swedish music: including Simon Exner (As You Drown), and two time Swedish Grammy winner Åke Parmerud. Spite was mixed and mastered by Christian Silver (Sonic Syndicate). Mixing elegance, darkness, power, aggression, and speed, Spite, hit the metal scene with the power of an atomic bomb in April 2008, receiving raving reviews from mainstream and underground publications around Europe. The album was released across North America in September of the same year via France's Listenable Records.\n"
   ],
   "infobox": {
      "Origin": [
         "Gothenburg, Sweden"
      ],
      "Genres": [
         "Melodic death metal[1]"
      ],
      "Years active": [
         "2005–2017"
      ],
      "Labels": [
         "Listenable Records"
      ],
      "Members": [
         "Alexander Andersson",
         "Mikael Medin",
         "Anton Modig",
         "Aron Parmerud",
         "Linus Johansson",
         "Jimmie Olausson"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band. They hail from Gothenburg, Sweden, formed in [YEAR]. The band achieved recognition from placing high, and often winning, many national and international music contests. Inspired by the Japanese visual-kei scene and the brutality of Swedish hardcore and metal, [BAND_NAME] has brought new light to the metal genre. \n",
      "When founded in [YEAR], when the average member's age was 16, [BAND_NAME] quickly made a name for themselves in the Swedish metal scene by winning and placing high in many national and international music contests. In support of the EP, Terror Hearts - which was mixed and mastered by [PERSON_NAME_FULL_0_MALE] (In Flames, At the Gates) – [BAND_NAME] shared the stage with some of the world's most renowned metal acts including: Machine Head, Slayer, Mastodon, Meshuggah, and Candlemass among others.\n",
      "In [MONTH] [YEAR], [BAND_NAME] recorded its debut album, Spite, with a series of up-and-coming as well as established producers in Swedish music: including Simon Exner (As You Drown), and two time Swedish Grammy winner [PERSON_NAME_FULL_0_MALE]. Spite was mixed and mastered by Christian Silver (Sonic Syndicate). Mixing elegance, darkness, power, aggression, and speed, Spite, hit the metal scene with the power of an atomic bomb in [MONTH] [YEAR], receiving raving reviews from mainstream and underground publications around Europe. The album was released across North America in [MONTH] of the same year via France's Listenable Records.\n"
   ]
}