{
   "Band members": {
      "Current line-up": {},
      "Former members": {},
      "Live/session members": {
         "Timeline": {}
      }
   },
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "\nShortly thereafter, Anders Brolycke joined as a second guitarist. The group's first official recordings were made in the end of 1992; just before the release of the demo tape, called Sedes Impiorum, the band name was changed to Sacramentum.[5] In February 1994, Sacramentum went to Unisound Studio to record the self-financed five-track EP Finis Malorum, which was re-released by Adipocere Records a year later.[5] Following the release of this EP, Nicklas Rudolfsson (now also in Runemagick, Swordmaster and Deathwitch) joined in on drums, and Karlén shifted from guitar to bass. According to Karlén,",
         "When we started it was just because we wanted to make extreme music, violent music. We had no ambitions whatsoever. Then thing started to happen. A lot of people liked the stuff we made. So we became more serious and after we had recorded the MCD “Finis Malorum” we realized that we could really achieve something. So we kicked out the unserious members and started rehearse more often and that’s the way it is. I think that everything we could dream about then has been fulfilled but we will carry on for many years to spread our message of hatred.[6]",
         "With this three-piece line-up Sacramentum went back to Unisound Studio in June 1995 to record their full-length debut, entitled Far Away from the Sun. Finally released in June 1996, the album was hailed in some circles as a masterpiece. The band then embarked on a tour of Europe with Ancient Rites, Bewitched and Enthroned.[5]\n",
         "In the spring 1997, Sacramentum signed with Century Media.[5] The second full-length album, The Coming of Chaos, was recorded in June 1997 in King Diamond guitarist Andy LaRocque's studio, Los Angered Recordings in Gothenburg, Sweden, and released in September 1997 on Century Media Records. It showcased the band moving in more of a blackened death metal direction.  AllMusic's Steve Huey writes that \"Thanks to improved production, as well as the band's musical development, The Coming of Chaos is the best Sacramentum release available, not to mention their first domestic album.\"[7] The band once again embarked on a tour of Europe, this time with labelmates Old Man's Child and Rotting Christ.[5]\n",
         "Sacramentum's final album, Thy Black Destiny, was recorded in September 1998 at Los Angered Recordings, and was released on April 13, 1999. The recording line-up was augmented by Nicklas Andersson (also in Lord Belial), who joined the group as a permanent guitarist. However, the band apparently split up sometime thereafter. \"Employing classic death metal sounds, Sacramentum strip their sound down to the basics on Thy Black Destiny, recalling old-school thrash yet still mixing it up with enough modern black metal to stay contemporary.\"[8]\n",
         "In 2008 their last two albums The Coming of Chaos and Thy Black Destiny were reissued in a compilation titled Abyss of Time on Century Media Records.[9]\n",
         "As of 2012, Anders Brolycke plays guitar with the Swedish black metal band Likblek, who released their self-tiled debut full-length album in 2010.[10] Nicklas Rudolfsson has gone on to perform with many other bands, including Heavydeath, Necrocurse, and Runemagick.[11]\n",
         "In 2013, the band's debut album Far Away from the Sun was reissued in CD, vinyl, and picture disc by Century Media. The album art was rescanned by Necrolord, the music was remastered by Dan Swanö, and with a new layout by Nora Dirkling.[12]\n",
         "In January 24th, 2020 the band announced that they were working on their fourth album and also revealed that it would be titled Shadow of Oblivion and will also be performing live as a headlining act on Maryland Deathfest and the Netherlands Deathfest.\n"
      ]
   },
   "Musical style and influences": {
      "text": [
         "On the band's first album they performed a style of melodic black metal that has been compared to bands such as Dissection and Unanimated, which involved \"a mixture of Black Metal's atmosphere and speed with the technicality and arrangement normally found in Death Metal\".[4] Over time the band began to move towards the kind of melodic death metal sound many of their contemporaries in Gothenburg were pioneering.[4] Nisse Karlén has said that \"Our influences comes mostly from old heavy Metal bands and a lot of speed and thrash bands where we have our roots. A lot also comes from within ourselves, moods and so on.\"[6] Anders Brolycke has cited Bathory, Destruction, Coroner, Slayer, Autopsy, Death, and Metallica as influences.[13] He also said that \"The lyrics are held on a personal level and deal with thoughts and reflections about life and death. They are often about a longing away from this earthly prison.\"[13]\n"
      ]
   },
   "Notes and references": {},
   "Sections": [
      "1 History",
      "2 Musical style and influences",
      "3 Band members",
      "3.1 Current line-up",
      "3.2 Former members",
      "3.3 Live/session members",
      "3.3.1 Timeline",
      "4 Discography",
      "5 External links",
      "6 Notes and references"
   ],
   "Summary": {
      "text": [
         "Sacramentum is a melodic black metal band from Falköping, Sweden, formed by Nisse Karlén (vocals/guitar) in the summer of 1990 under the name of Tumulus.[3] The band released three full-length studio albums and two demos. They are best known for their debut album Far Away From The Sun, which is often considered one of the best early melodic black metal releases.[4]\n"
      ]
   },
   "Title": "Sacramentum (band) - Wikipedia"
}