{
   "Name": "Sacramentum (band)",
   "rawData": [
      "Sacramentum is a melodic black metal band from Falköping, Sweden, formed by Nisse Karlén (vocals/guitar) in the summer of 1990 under the name of Tumulus. The band released three full-length studio albums and two demos. They are best known for their debut album Far Away From The Sun, which is often considered one of the best early melodic black metal releases.\n",
      "\nShortly thereafter, Anders Brolycke joined as a second guitarist. The group's first official recordings were made in the end of 1992; just before the release of the demo tape, called Sedes Impiorum, the band name was changed to Sacramentum. In February 1994, Sacramentum went to Unisound Studio to record the self-financed five-track EP Finis Malorum, which was re-released by Adipocere Records a year later. Following the release of this EP, Nicklas Rudolfsson (now also in Runemagick, Swordmaster and Deathwitch) joined in on drums, and Karlén shifted from guitar to bass. According to Karlén,",
      "When we started it was just because we wanted to make extreme music, violent music. We had no ambitions whatsoever. Then thing started to happen. A lot of people liked the stuff we made. So we became more serious and after we had recorded the MCD “Finis Malorum” we realized that we could really achieve something. So we kicked out the unserious members and started rehearse more often and that’s the way it is. I think that everything we could dream about then has been fulfilled but we will carry on for many years to spread our message of hatred."
   ],
   "infobox": {
      "Also known as": [
         "Tumulus (1990–1992)"
      ],
      "Origin": [
         "Falköping, Sweden"
      ],
      "Genres": [
         "Blackened death metal",
         "melodic black/death[1][2]"
      ],
      "Years active": [
         "1992–2001, 2019-present"
      ],
      "Labels": [
         "Century Media, Adipocere"
      ],
      "Members": [
         "Niclas Rudolfsson",
         "Nisse Karlén",
         "Anders Brolycke"
      ],
      "Past members": [
         "Niklas Andersson",
         "Pär Åhag",
         "Freddy Andersson",
         "Mikael Rydén"
      ]
   },
   "albums": [
      "Sedes Impiorum",
      "Finis Malorum",
      "Far Away from the Sun",
      "The Coming of Chaos",
      "In Conspiracy with Satan – A Tribute to Bathory",
      "A Tribute to Sepultura",
      "Tribute to Mercyful Fate",
      "Thy Black Destiny",
      "Abyss of Time",
      "The Coming of Chaos",
      "Thy Black Destiny",
      "Shadow of Oblivion"
   ]
}