{
   "Name": "J Church (band)",
   "rawData": [
      "J Church was an American punk rock band from San Francisco, California, formed by the guitarist and vocalist Lance Hahn and bassist Gardner Maxam in 1992, after the demise of their former band Cringer.  The group continued through numerous line-up changes and released a number of vinyl records and CDs before Hahn's death in 2007.\n",
      "Hahn and Maxam had played together in Cringer from the band's inception in 1985 to its demise in 1991. This group, whose additional members changed frequently in its short career, was initially based in Hahn and Maxam's native Hawaii before relocating to Los Angeles where Maxam was attending college.\n",
      "After Cringer disbanded, the pair's new three-piece group, J Church, began. The band was named for the San Francisco Muni Metro J Church line that Hahn took down Church Street to band practice and to work every day. They went through a large number of drummers in their career; a noteworthy early player was the former Jawbreaker drummer Adam Pfahler. From its inception, J Church embarked upon writing and recording what became an extensive discography including numerous singles and splits with fellow punk rock bands including Discount and Less Than Jake. The group has released an estimated 150 records.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Punk rock, pop punk, anarcho-punk[citation needed]"
      ],
      "Years active": [
         "1992–2007"
      ],
      "Associated acts": [
         "Cringer, Jawbreaker, Severed Head of State, Monsula"
      ],
      "Members": [
         "Lance Hahn",
         "Gardner Maxam",
         "Aaron Olson",
         "Adam Pfahler",
         "Brendan Murdoch",
         "Wade Driver",
         "Reed Burgoyne",
         "Andee Connors",
         "Scott Bradley",
         "Jeff Bursley",
         "Ben White",
         "Chris Pfeffer",
         "David DiDonato"
      ]
   },
   "albums": []
}