{
   "Name": "The Plan (band)",
   "rawData": [
      "The Plan is a Swedish band formed by Broder Daniel guitarist and subsequent bass player Theodor Jensen in 2000.\n",
      "After having written own songs for a period of time, Jensen met organist Mikael Furugärde, drummer Niklas Korssell and bass player Peter Morén through mutual friends. The group recorded its first demo in the winter of 2000-2001 and were signed by EMI in early 2001. By that time, Jensen's childhood friend and Broder Daniel bandmate Håkan Hellström had – on his highly successful debut album Känn ingen sorg för mig Göteborg – already released an interpretation in Swedish of the Plan's song \"Foggy Days\" (called \"Dom dimmiga dagarna\").\n",
      "The self-titled debut album was recorded during the summer of 2001 together with producer Ronald Bood, and at the time of its release in September that year, the first single \"Mon Amour\" was already climbing the charts. The album entered the Swedish charts at number 2, and was nominated for Grammis awards in four categories: best debut act, best album, best pop/rock group, and best composer. The album was followed by a tour in Europe, as well as performances at South by Southwest in Austin and CBGB in New York City. However, despite the success of the band, drummer Niklas Korssell and bass player Peter Morén left the band in 2002 to pursue their own musical projects.\n"
   ],
   "infobox": {
      "Origin": [
         "Gothenburg, Sweden"
      ],
      "Years active": [
         "2000 - present"
      ],
      "Labels": [
         "Virgin, EMI, Majesty, Razzia"
      ],
      "Associated acts": [
         "Broder Daniel"
      ],
      "Website": [
         "www.theplanmusic.com"
      ],
      "Members": [
         "Theodor Jensen"
      ],
      "Past members": [
         "Mikael Furugärde ",
         "Niklas Korssell ",
         "Peter Morén"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band formed by Broder Daniel guitarist and subsequent bass player Theodor Jensen in [YEAR].\n",
      "After having written own songs for a period of time, Jensen met organist [PERSON_NAME_FULL_0_MALE], drummer [PERSON_NAME_FULL_2_MALE] and bass player Peter Morén through mutual friends. The group recorded its first demo in the winter of [YEAR]-[YEAR] and were signed by EMI in early [YEAR]. By that time, Jensen's childhood friend and [PERSON_NAME_FULL_3_MALE] bandmate [PERSON_NAME_FULL_1_MALE] had – on his highly successful debut album Känn ingen sorg för mig Göteborg – already released an interpretation in Swedish of the Plan's song [SONG_NAME]).\n",
      "The self-titled debut album was recorded during the summer of [YEAR] together with producer [PERSON_NAME_FULL_0_MALE], and at the time of its release in [MONTH] that year, the first single [SONG_NAME] was already climbing the charts. The album entered the Swedish charts at number 2, and was nominated for Grammis awards in four categories: best debut act, best album, best pop/rock group, and best composer. The album was followed by a [GENRE] band, drummer [PERSON_NAME_FULL_1_MALE] and bass player Peter Morén left the band in [YEAR] to pursue their own musical projects.\n"
   ]
}