{
   "Name": "7 Year Bitch",
   "Sections": [
      "1 Biography",
      "1.1 Career",
      "1.2 Break-up",
      "1.3 Aftermath",
      "2 Band members",
      "3 Discography",
      "3.1 Albums",
      "3.2 Singles/EPs",
      "3.3 Compilations",
      "3.4 Music videos",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "7 Year Bitch was an American punk rock band from Seattle, Washington. The band was active between 1990 and 1997 and released three albums over that time.The band formed at the same time as the emergence of the Riot Grrrl sub-genre, which is a sub-genre of punk music from the early to mid-1990s that emphasized the role of women in rock music. The Riot Grrrl movement began as a feminist response to the violence and misogyny that became more prominent in punk music in the mid to late 1980s, and 7 Year Bitch, an all female punk band, emerged as part of that sub-genre.[1]\n"
      ]
   },
   "Biography": {
      "Career": {
         "text": [
            "7 Year Bitch was formed in 1990 by vocalist Selene Vigil, guitarist Stefanie Sargent, bassist Elizabeth Davis and drummer Valerie Agnew.  Vigil, Sargent, and Agnew had been playing together in the Seattle band Barbie's Dream Car when their bassist left for Europe. They subsequently recruited Davis and renamed their band after the movie The Seven Year Itch, based on a suggestion by their friend, Ben London, of fellow Seattle band, Alcohol Funnycar.\n",
            "At their first concert, the band opened for The Gits, who would prove to have a significant influence on their music. In 1991 the band released their first single \"Lorna\" and signed with C/Z Records. Their first album, Sick 'Em, was released in 1992, but it was overshadowed by Sargent's death on June 27,[2] through passing out on her back after returning home from a party where she had drunk alcohol and taken a small amount of heroin.[3] Following a period grieving and uncertainty, the band decided to continue, recruiting guitarist Roisin Dunne as Sargent's replacement later that year.\n",
            "In July 1993, Gits' frontwoman and longtime friend of the band Mia Zapata was raped and murdered while walking home late at night.[4] This event, coupled with Sargent's death the previous year, had a profound effect on the group. As a reaction, the band recorded and released their second album ¡Viva Zapata! (1994) in tribute to both of their fallen friends.[5] During this time, Valerie Agnew also became one of the primary organizers and co-founders of the anti-violence and self-defence organisation Home Alive.[6][7][8] On April 8, 1994, the band played a benefit show for Rock Against Domestic Violence at the Cameo Theatre on Miami Beach, alongside Babes in Toyland and Jack Off Jill.[9]\n",
            "In 1995, the band signed with Atlantic Records, and in 1996 released their third album, Gato Negro.[10] Following the tour supporting Gato Negro, guitarist Roisin Dunne left, and was replaced by Lisa Faye Beatty, the band's live sound engineer and long-time friend.\n"
         ]
      },
      "Break-up": {
         "text": [
            "In early 1997, the band began recording material for what was to be their fourth album.  The band moved from Seattle to California, Elizabeth Davis and Valerie Agnew to San Francisco and Selene Vigil to Los Angeles.  With the recent departure of their guitarist, Roisin Dunne and the geographical separation between bandmates, Seven Year Bitch's career came to a close after a final tour with San Francisco's Lost Goat.\n"
         ]
      },
      "Aftermath": {
         "text": [
            "Following the break-up of 7 Year Bitch, bassist Elizabeth Davis joined the San Francisco-based band Clone, with whom she performed until 2003. In 2005 she helped to form the band Von Iva.[11] Guitarist Lisa Faye Beatty became involved with filmography, played for the band Smoochknob, and even held a solo act called Elfay. She went on to open show for the band Sleepytime Gorilla Museum.[12] Vocalist Selene Vigil formed a gothic/psychedelic-influenced band by the name of Cistine, in 2000. She later released the solo album That Was Then in 2010. Roisin Dunne joined the band The Last Goodbye in 2006.\n",
            "Their songs, \"The Scratch\" and \"Icy Blue\" were featured in the movie Mad Love with Drew Barrymore and Chris O'Donnell.\n"
         ]
      }
   },
   "Band members": {},
   "Discography": {
      "Albums": {},
      "Singles/EPs": {},
      "Compilations": {},
      "Music videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "7 Year Bitch was an American punk rock band from Seattle, Washington. The band was active between 1990 and 1997 and released three albums over that time.The band formed at the same time as the emergence of the Riot Grrrl sub-genre, which is a sub-genre of punk music from the early to mid-1990s that emphasized the role of women in rock music. The Riot Grrrl movement began as a feminist response to the violence and misogyny that became more prominent in punk music in the mid to late 1980s, and 7 Year Bitch, an all female punk band, emerged as part of that sub-genre.[1]\n",
      "7 Year Bitch was formed in 1990 by vocalist Selene Vigil, guitarist Stefanie Sargent, bassist Elizabeth Davis and drummer Valerie Agnew.  Vigil, Sargent, and Agnew had been playing together in the Seattle band Barbie's Dream Car when their bassist left for Europe. They subsequently recruited Davis and renamed their band after the movie The Seven Year Itch, based on a suggestion by their friend, Ben London, of fellow Seattle band, Alcohol Funnycar.\n",
      "At their first concert, the band opened for The Gits, who would prove to have a significant influence on their music. In 1991 the band released their first single \"Lorna\" and signed with C/Z Records. Their first album, Sick 'Em, was released in 1992, but it was overshadowed by Sargent's death on June 27,[2] through passing out on her back after returning home from a party where she had drunk alcohol and taken a small amount of heroin.[3] Following a period grieving and uncertainty, the band decided to continue, recruiting guitarist Roisin Dunne as Sargent's replacement later that year.\n",
      "In July 1993, Gits' frontwoman and longtime friend of the band Mia Zapata was raped and murdered while walking home late at night.[4] This event, coupled with Sargent's death the previous year, had a profound effect on the group. As a reaction, the band recorded and released their second album ¡Viva Zapata! (1994) in tribute to both of their fallen friends.[5] During this time, Valerie Agnew also became one of the primary organizers and co-founders of the anti-violence and self-defence organisation Home Alive.[6][7][8] On April 8, 1994, the band played a benefit show for Rock Against Domestic Violence at the Cameo Theatre on Miami Beach, alongside Babes in Toyland and Jack Off Jill.[9]\n"
   ],
   "infobox": {
      "Origin": [
         "Seattle, Washington, USA"
      ],
      "Genres": [
         "Punk rock, riot grrrl, grunge"
      ],
      "Years active": [
         "1990–1997"
      ],
      "Labels": [
         "C/Z, Atlantic, Man's Ruin"
      ],
      "Associated acts": [
         "The Gits, Barbie's Dream Car, Alcohol Funnycar, Cistine, Von Iva, Clone"
      ],
      "Website": [
         "http://www.7yearbitchrocks.com"
      ],
      "Members": [
         "Selene Vigil",
         "Elizabeth Davis",
         "Valerie Agnew ",
         "Roisin Dunne"
      ],
      "Past members": [
         "Stefanie Sargent (Deceased)",
         "Lisa Faye Beatty (Deceased)"
      ]
   }
}