{
   "Name": "The Gits",
   "Sections": [
      "1 History",
      "1.1 Formation and early history",
      "1.2 Local following",
      "2 Murder of Mia Zapata",
      "3 Legacy",
      "3.1 Home Alive",
      "3.2 Dedications",
      "3.3 Films",
      "4 Related projects",
      "5 Discography",
      "5.1 Albums",
      "5.2 Compilations",
      "5.3 Singles/EPs",
      "5.4 Appearances/Soundtrack contributions",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "The Gits were an American punk band, formed in Yellow Springs, Ohio, in 1986.[1][2]   As part of the burgeoning Seattle music scene of the early 1990s, they were known for their fiery live performances. Members included singer Mia Zapata, guitarist Joe Spleen (born Andy Kessler), bassist Matt Dresdner and drummer Steve Moriarty.[3] They dissolved in 1993 after the murder of Zapata.\n",
         "During their existence, the band released two studio albums, one compilation of early recordings, one live recording, three 7\" singles and appeared on various compilations. The band also recorded on a few independent labels, and released its two studio albums on C/Z Records. In 2003, each release in the band's discography was remastered and expanded with bonus tracks on Broken Rekids.\n"
      ]
   },
   "History": {
      "Formation and early history": {
         "text": [
            "The Gits met and formed in 1986 at Antioch College, a liberal arts school in Yellow Springs, Ohio.[4] They called themselves the 'Snivelling Little Rat Faced Gits' (a reference to a Monty Python skit), but soon shortened the moniker to just 'The Gits'.[5] In 1988 they recorded and self-released their \"unofficial\" debut album entitled Private Lubs with the help of friend Ben London (later of Alcohol Funnycar and solo). These recordings did not see widespread release until 1996, when the album was reissued by the Broken Rekids label as Kings & Queens.[6][7]\n"
         ]
      },
      "Local following": {
         "text": [
            "After relocating to Seattle, Washington in 1989, the band set up shop at \"the Rathouse\", an abandoned house in the Capitol Hill district where they rehearsed and lived.[4][8]  They quickly earned a following in the local scene and gained many friends, particularly in the city's punk rock community. During the early 1990s, buzz began surrounding the band, which caused some media outlets to erroneously lump them in with the then-burgeoning Seattle grunge music scene, and Zapata's persona led many[who?] to incorrectly associate The Gits with the Olympia, Washington riot grrrl movement.[opinion]\n",
            "The band's first official release was \"Precious Blood\", released by the local Big Flaming Ego Records. This single was quickly followed up by two more releases (\"Second Skin\" on Broken Rekids (1991), \"Spear & Magic Helmet\" on Empty Records (1991), as well as the Bobbing For Pavement compilation (Rathouse/Broken Rekids, 1991).\n",
            "In 1992 the band recorded and released their debut album, Frenching the Bully.[3]\n"
         ]
      }
   },
   "Murder of Mia Zapata": {
      "text": [
         "On the night of July 7, 1993, Mia Zapata was brutally raped and murdered while walking home from a bar, The Comet.[3] The Seattle Police Department initially focused their investigation on Zapata's circle of friends, believing that her murderer must have been someone she knew. Using funds generated by the Seattle music community (from benefit shows and CDs), as well as their own money, the remaining band members hired private investigator Leigh Hearon to supplement the police department's investigation. For over three years, Hearon and the Seattle Police Department investigated the crime with few or no breaks in the case. In 1996, the investigation first gained national attention in an episode of Unsolved Mysteries. It however did not open any new leads. The case was later highlighted on several other TV shows including A&E's American Justice, Cold Case Files, City Confidential, CBS's 48 Hours, FOX's America's Most Wanted, and TruTV's Forensic Files.\n",
         "Nine years passed with few new leads in the case, until a random DNA check conducted by the Seattle PD's Cold Case Unit and the Washington State Crime Lab led to the arrest of Jesus Mezquia. Mezquia, who briefly lived in Seattle during the time of Zapata's murder, was linked to the crime in 2003 when a DNA profile was extracted from a saliva sample left on Zapata's body;[5] Mezquia had bitten her breast. The saliva sample had been kept in cold storage until the STR technology was developed for full extraction. An original entry in 2001 failed to generate a positive result, but Mezquia's DNA entered the national data bank after he was arrested for burglary in Florida in 2002.\n",
         "On March 25, 2004, a jury convicted Mezquia of Zapata's murder and he was later sentenced to 36 years in prison, the maximum allowed in the case under Washington state law.[9]\n",
         "Mezquia has always maintained his innocence throughout the two convictions.\n"
      ]
   },
   "Legacy": {
      "Home Alive": {
         "text": [
            "In the aftermath of Zapata's murder, friends created a non-profit self-defense group called Home Alive, which ceased operations in 2010, organized benefit concerts and CDs with the participation of several bands, including Nirvana, Pearl Jam, Heart, and the Presidents of the United States of America.[10] The Home Alive group has its own instructors and seek to empower women with ways to protect themselves against predators. They hold a range of courses, from anger management and use of pepper spray to the martial arts.[11]\n"
         ]
      },
      "Dedications": {
         "text": [
            "Portland, Oregon-based alternative rock band Everclear dedicated their 1993 album World of Noise to Zapata. The California hardcore band Retching Red included a Gits cover (\"Spear and Magic Helmet\") on their debut album Get Your Red Wings. Also, the alt-country band Richmond Fontaine have a tribute song to the band, called \"The Gits\".\n",
            "Punk rock band 7 Year Bitch, who were good friends and briefly label mates of The Gits, named their 1994 album ¡Viva Zapata! in tribute to Mia Zapata. The album cover also featured a painting by artist Scott Musgrove featuring Zapata wearing bullet sashes. The song \"M.I.A.\", which explicitly deals with Zapata's death, appears on this album.\n"
         ]
      },
      "Films": {
         "text": [
            "In 1996, Hype!—a documentary about the Seattle scene, featuring The Gits—came out. Nine years later, in 2005, a movie chronicling the life of Mia Zapata during her time with The Gits was released. The final cut of the film was released theatrically in over 20 North American cities on July 7, 2008, the 15th memorial anniversary of Zapata's death. The following day saw the film released on DVD along with a Best of the Gits CD (both from Liberation Entertainment).\n",
            "The story of the Gits was made into a \"lively and engaging\" documentary film,[12] titled simply The Gits, and reflected a renewed interest in the band.[13] The film, directed by Kerri O'Kane, had its first screenings in 2005 at the Seattle International Film Festival.[4] A finalized version of the film was accepted and screened at the 2007 SXSW (South By Southwest) Film Festival held March 9–17, 2007, in Austin, Texas. In her review for NPR, Sarah Bardeen found that \"Above all, we fall for the music. Compared to many of their contemporaries, the Gits were instrumentally brilliant, playing fast, tight, classic punk rock which took a radical left turn when Zapata added her voice to the mix\".[14]\n"
         ]
      }
   },
   "Related projects": {
      "text": [
         "Following the posthumous completion of Enter: The Conquering Chicken, Spleen formed a hardcore punk band called the Dancing French Liberals of '48, and later toured briefly with hardcore legends Poison Idea.[3][15] Dancing French Liberals of '48 featured all of the remaining Gits as well as longtime friend and guitarist Julian Gibson (ex-DC Beggars). Their music was, as expected, much in the vein of the Gits although with a more hardcore punk attitude. Together the Liberals issued an EP (Scream Clown Scream) and a full-length album (Powerline) on the Broken Rekids label before disbanding in the late 1990s.\n",
         "Following Zapata's death, Joan Jett and Bikini Kill frontwoman Kathleen Hanna co-wrote a song (entitled \"Go Home\") inspired by Zapata's death. Jett also included a message at the end of her video for the song asking for any information anyone had in regard to Zapata's murder. After seeing the video the remaining members of the Gits approached Jett about touring with the band. Jett agreed as she had long been a fan of The Gits. The band renamed themselves Evil Stig (Gits Live backwards), and toured in early 1995 playing a mix of Gits and Joan Jett songs, with a majority of the profits going towards Zapata's murder investigation.[3] A self-titled album was issued later in the year, again with a majority of the profits going towards the investigation.[16][17]  While touring and recording with Evil Stig, Spleen, Dresdner and Moriarty also continued playing with the Dancing French Liberals of '48.\n",
         "Moriarty later appeared in the punk rock band St. Bushmill's Choir as well as the more acoustic based Pinkos. In January 2012 Moriarty conducted a comprehensive audio interview with Music Life Radio about his life and career with extensive references to The Gits.[18]\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Compilations": {},
      "Singles/EPs": {},
      "Appearances/Soundtrack contributions": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Gits were an American punk band, formed in Yellow Springs, Ohio, in 1986.[1][2]   As part of the burgeoning Seattle music scene of the early 1990s, they were known for their fiery live performances. Members included singer Mia Zapata, guitarist Joe Spleen (born Andy Kessler), bassist Matt Dresdner and drummer Steve Moriarty.[3] They dissolved in 1993 after the murder of Zapata.\n",
      "During their existence, the band released two studio albums, one compilation of early recordings, one live recording, three 7\" singles and appeared on various compilations. The band also recorded on a few independent labels, and released its two studio albums on C/Z Records. In 2003, each release in the band's discography was remastered and expanded with bonus tracks on Broken Rekids.\n",
      "The Gits met and formed in 1986 at Antioch College, a liberal arts school in Yellow Springs, Ohio.[4] They called themselves the 'Snivelling Little Rat Faced Gits' (a reference to a Monty Python skit), but soon shortened the moniker to just 'The Gits'.[5] In 1988 they recorded and self-released their \"unofficial\" debut album entitled Private Lubs with the help of friend Ben London (later of Alcohol Funnycar and solo). These recordings did not see widespread release until 1996, when the album was reissued by the Broken Rekids label as Kings & Queens.[6][7]\n",
      "After relocating to Seattle, Washington in 1989, the band set up shop at \"the Rathouse\", an abandoned house in the Capitol Hill district where they rehearsed and lived.[4][8]  They quickly earned a following in the local scene and gained many friends, particularly in the city's punk rock community. During the early 1990s, buzz began surrounding the band, which caused some media outlets to erroneously lump them in with the then-burgeoning Seattle grunge music scene, and Zapata's persona led many[who?] to incorrectly associate The Gits with the Olympia, Washington riot grrrl movement.[opinion]\n"
   ]
}