{
   "Name": "Latin Soul Syndicate",
   "rawData": [
      "Latin Soul Syndicate is a San Francisco-based band that formed in 2003. On each of their three albums, the core members (Happy Sanchez, Karl Perazzo, and Mark Pistel) are joined by a collective of Bay Area-based musicians including members of Santana, Tower of Power and Spearhead.\n",
      "Their songs include a blend of upbeat Latin soul, electronica and pop/rock. Over the years, their songs have been licensed in films and TV shows including The Sopranos and The Devil Wears Prada. The group has released three albums of original music on independent record label LoveCat Music. Their songs have been included on various compilation CDs including Latin Travels Volume 2 and Latin Moderns. narcotrafico is the soundtrack of the game scarface.\n",
      "Their songs \"Vato Loco\" featured in the film The Devil Wears Prada (2006) and \"El Gitano del Amor\" in The Ugly Truth (2009) film. They also had their song Narco Traffico featured in the game Scarface: The World Is Yours and Mamasita in The Slammin' Salmon.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California"
      ],
      "Genres": [
         "Latin ",
         " Electronica ",
         " Pop/Rock"
      ],
      "Years active": [
         "2003–present"
      ],
      "Labels": [
         "LoveCat Music"
      ],
      "Associated acts": [
         "Sons of Sanchez"
      ],
      "Website": [
         "MySpace page"
      ],
      "Members": [
         "Happy Sanchez ",
         " Karl Perazzo ",
         " Mark Pistel"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band that formed in [YEAR]. On each of their three albums, the core members (Happy Sanchez, [PERSON_NAME_FULL_0_MALE], and [MONTH]k Pistel) are joined by a collective of Bay Area-based musicians including members of Santana, Tower of Power and Spearhead.\n",
      "Their songs include a [GENRE]",
      "Their songs \"Vato Loco\" featured in the film The Devil Wears Prada ([YEAR]) and \"El Gitano del Amor\" in The Ugly Truth ([YEAR]) film. They also had their song Narco Traffico featured in the game Scarface: The World Is Yours and Mamasita in The Slammin' Salmon.\n"
   ]
}