{
   "Name": "Hammerbox",
   "rawData": [
      "Hammerbox was an American alternative rock band from Seattle, Washington, United States. The band formed around 1990 and disbanded in 1994 when lead singer Carrie Akre left the band to form Goodness.\n",
      "Hammerbox formed around 1989 in Seattle and released their first LP, Hammerbox on independent label C/Z Records.  This album earned them the opportunity to sign to a major label, A&M Records, with whom they released their second album.  However, despite the band's appearance at rock festival Endfest in Bremerton, Washington to support their album, it did not sell well and the band was dropped by the label.  James Atkins left the band in early 1994, and the rest of the members followed suit shortly thereafter.  Carrie Akre formed Goodness, while Harris Thurmond went on to form Anodyne (later renamed to Marfa Lights) with That Petrol Emotion singer Steve Mack.  Thurmond formed Orbiter in 2000, and later Kingsley in 2003.\n",
      "Live EMP Skychurch, Seattle, WA, an album containing live material from the band's reunion show, was released in 2005.\n"
   ],
   "infobox": {
      "Origin": [
         "Seattle, Washington, United States"
      ],
      "Genres": [
         "Alternative rock, grunge[1]"
      ],
      "Years active": [
         "1990–1994; 2004"
      ],
      "Labels": [
         "C/Z"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Seattle, Washington, United States. The band formed around [YEAR] and disbanded in [YEAR] when lead singer [PERSON_NAME_FULL_0_FEMALE] left the band to form Goodness.\n",
      "[BAND_NAME] formed around [YEAR] in Seattle and released their first LP, [BAND_NAME] on independent label C/Z Records.  This album earned them the opportunity to sign to a [GENRE] band's appearance at rock festival Endfest in Bremerton, Washington to support their album, it did not sell well and the band was dropped by the label.  James Atkins left the band in early [YEAR], and the rest of the members followed suit shortly thereafter.  [PERSON_NAME_FULL_0_FEMALE] formed Goodness, while Harris Thurmond went on to form Anodyne (later renamed to [MONTH]fa Lights) with That Petrol Emotion singer Steve Mack.  Thurmond formed Orbiter in [YEAR], and later Kingsley in [YEAR].\n",
      "Live EMP Skychurch, Seattle, WA, an [GENRE] band's reunion show, was released in [YEAR].\n"
   ]
}