{
   "Discography": {
      "Albums": {},
      "B-side": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "Background (1984–1989)": {
         "text": [
            "Before the formation of My Sister's Machine, guitarist Owen Wright and drummer Chris Gohde were involved in a band called Mistrust in 1984; this band also included former Culprit singer Jeff L'Heureux.[6][7] They recorded one album called Spin the World, which was released on CD in 2009 by Heart of Steel Records.[8] This band did an extensive amount of touring before they broke up in 1988.\n",
            "Meanwhile, Nick Pollock played guitar in a glam metal band called Alice N' Chains, a precursor to Alice in Chains that also included Layne Staley on vocals. The band recorded two demos and toured throughout the Seattle area for roughly one year before they broke up on friendly terms in 1987.[4]\n"
         ]
      },
      "Formation, Diva, and Wallflower (1989–1994)": {
         "text": [
            "After the demise of their previous bands, Pollock joined Wright and Gohde to form My Sister's Machine along with bassist Chris Ivanovich. Since none of the other members had ever been a lead singer, Pollock got the job by default as he was also their primary lyricist.[4]\n",
            "In 1991, My Sister's Machine received the \"Best New Group\" award from the Northwest Music Association.[9]  They continued to garner much interest from the major record labels but ultimately chose to sign with a smaller label Caroline Records.[4]\n",
            "In 1992, they released their debut album, Diva to much critical acclaim. Steve Kurutz of AllMusic gave the album four and a half stars, calling it \"a surprisingly strong record.\"[10] Mike Boehm of Los Angeles Times opined, \"Diva moves at a more rapid gait than either Alice in Chains or Soundgarden, and it dispenses with the leaden grunge that characterized the Seattle sound until a year or so ago (recent efforts out of the city, including, 'Diva,' tend to be far more melodic and better written).\"[4] Jim Washburn (also of Los Angeles Times) described the band as \"more melodic and propulsive than its Seattle soul mates Alice in Chains\" when discussing the album, but was far less enthused when he saw them onstage, writing \"those qualities flattened out into a lank-haired generic grunge that prompted much of the audience to exit long before the hourlong show had concluded.\"[11]\n",
            "Still, Lonn Friend (editor of the heavy metal/rock music magazine RIP) who did a weekly segment called \"Friend at Large\" on Headbangers Ball on MTV, talked about how much he loved Diva. He also wore their shirt for two weeks on the show. The band later thanked Friend for his support in the liner notes of their next album Wallflower. Over the next year they did a tour with Pantera and White Zombie.[11] They toured the United States and Europe. They did in-studio interviews on Headbangers Ball promoting their video on MTV for their single, I'm Sorry. They also co-headlined a tour with Pantera.\n",
            "In 1993, they moved to Chameleon a division of Elektra Entertainment and released Wallflower in 1993. They toured the United States with King's X. Just a couple months after releasing the album, Elektra Entertainment folded the Chameleon division dropping all bands that were signed leaving the album and band unpromoted.[12] After a string of bad luck, My Sister's Machine split up in 1994.\n"
         ]
      },
      "Post-break-up (1994–present)": {
         "text": [
            "Since the break-up of My Sister's Machine, Nick Pollock has fronted the bands Tanks of Zen[3] and Soulbender;[13] the latter also features longtime Queensrÿche guitarist Michael Wilton.[13] Meanwhile, Wright has played guitar in a band called Old Lady Litterbug[14] and Gohde has played drums for a band called Hot Rod Lunatics and Call for the Priest, the latter is a Judas Priest cover band.\n"
         ]
      },
      "Reunion (2010–present)": {
         "text": [
            "On June 4, 2010, the Layne Staley Fund announced that My Sister's Machine will be reuniting for the Layne Staley Tribute, held on August 21 of that year. My Sister's Machine has continued to play shows into the 2010s.[12]\n"
         ]
      }
   },
   "Legacy": {
      "text": [
         "In 2017, Metal Injection ranked My Sister's Machine at number 6 on their list of \"10 Heaviest Grunge Bands\".[1]\n"
      ]
   },
   "Members": {},
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Background (1984–1989)",
      "1.2 Formation, Diva, and Wallflower (1989–1994)",
      "1.3 Post-break-up (1994–present)",
      "1.4 Reunion (2010–present)",
      "2 Legacy",
      "3 Members",
      "4 Discography",
      "4.1 Albums",
      "4.2 Singles",
      "4.3 B-side",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "My Sister's Machine was an American rock band from Seattle, Washington, formed in 1989.[4] Its members were Nick Pollock (lead vocals, guitar), Owen Wright (guitar), Chris Ivanovich (bass guitar), and Chris Gohde (drums).[3][4]\n",
         "This band recorded and released two albums, Diva and Wallflower, before they broke up in 1994. They reunited in 2010 to headline the Layne Staley Tribute and Benefit Concert that year as Pollock had previously played guitar in an early incarnation of Alice in Chains,[4] the glam metal band Alice N' Chains that also included Staley.[5]\n"
      ]
   },
   "Title": "My Sister's Machine - Wikipedia"
}