{
   "Name": "Tad (band)",
   "rawData": [
      "Tad (often styled as TAD) was an American grunge band from Seattle, Washington, formed in 1988 by Tad Doyle. They are often recognized as one of the first bands of the grunge era.\n",
      "Led by Tad Doyle (born Thomas Andrew Doyle) on vocals and guitar, Tad was formed in early 1988 by Doyle, a drummer turned guitar player/singer, who asked bassist Kurt Danielson to play bass for the band. Danielson's band Bundle of Hiss played with Doyle's previous band (in which he played drums) H-Hour. Tad recruited drummer Steve Wied (formerly of Skin Yard) and guitarist Gary Thorstensen to complete the original lineup. Tad was among the first bands to be signed to the independent label Sub Pop Records. In 1988, Doyle had released the \"Daisy/Ritual Device\" single on Sub Pop, produced by seminal Seattle producer Jack Endino, for which Doyle wrote and performed all music. Tad's debut album God's Balls appeared in early 1989 and was also produced by Endino. In March 1990 the band released the Salt Lick EP, recorded by Steve Albini. It contained the song \"Wood Goblins\", for which a music video was produced. After a European tour with Nirvana, Tad returned to Seattle and recorded their second album 8-Way Santa (1991), named after a type of blotter acid. Produced by Butch Vig, the album was far more pop-oriented than its predecessors, and featured the singles \"Jinx\" and \"Jack Pepsi\". \n",
      "\"Jack Pepsi\" was released as a single, but Pepsi filed a lawsuit against the band due to the cover art on the single, which was the Pepsi logo with \"Tad\" in place of \"PEPSI.\" However, the so-called \"Pepsi logo\" was missing the left and right colorations in the actual Pepsi logo, one being of a light blue color; said light blue color never appeared on the Tad artwork, making this at best an attempt at \"folk art\", not even coming close to \"copyright infringement\". Another lawsuit was filed due to the cover of 8-Way Santa (which was a found picture of a man fondling a woman's breast). The couple in the photograph, one of whom had since become a born-again Christian and remarried, took exception and sued. Sub Pop subsequently changed the album cover to a shot of the band.\n"
   ],
   "infobox": {
      "Origin": [
         "Seattle, Washington, U.S."
      ],
      "Genres": [
         "Grunge[1]",
         "alternative metal[2]",
         "sludge metal",
         "noise rock"
      ],
      "Years active": [
         "1988–1999"
      ],
      "Labels": [
         "Sub Pop",
         "Amphetamine Reptile",
         "Futurist",
         "Giant/Warner Bros.",
         "East West/Elektra"
      ],
      "Past members": [
         "Tad Doyle",
         "Gary Thorstensen",
         "Kurt Danielson",
         "Steve Wied",
         "Rey Washam",
         "Josh Sinder",
         "Mike Mongrain"
      ]
   },
   "albums": [
      "God's Balls",
      "Salt Lick",
      "8-Way Santa",
      "Inhaler",
      "Infrared Riding Hood"
   ],
   "prunedData": [
      "[BAND_NAME] (often styled as TAD) was an [GENRE] band from Seattle, Washington, formed in [YEAR] by [BAND_NAME] Doyle. They are often recognized as one of the first bands of the grunge era.\n",
      "Led by [BAND_NAME] Doyle (born Thomas Andrew Doyle) on vocals and guitar, [BAND_NAME] was formed in early [YEAR] by Doyle, a drummer turned guitar player/singer, who asked bassist [PERSON_NAME_FULL_0_MALE] to play bass for the band. [PERSON_NAME_LAST_0]'s band Bundle of Hiss played with Doyle's previous band (in which he played drums) H-Hour. [BAND_NAME] recruited drummer [PERSON_NAME_FULL_2_MALE] (formerly of Skin Yard) and guitarist Gary Thorstensen to complete the original lineup. [BAND_NAME] was among the first bands to be signed to the independent label [PERSON_NAME_FULL_4_FEMALE]. In [YEAR], Doyle had released the [SONG_NAME]. \n",
      "[SONG_NAME]. Another lawsuit was filed due to the cover of 8-Way Santa (which was a [GENRE] a man fondling a woman's breast). The couple in the photograph, one of whom had since become a born-again Christian and remarried, took exception and sued. [PERSON_NAME_FULL_0_FEMALE] subsequently changed the album cover to a shot of the band.\n"
   ]
}