{
   "Name": "Paw (band)",
   "Sections": [
      "1 History",
      "2 Post-Paw activities",
      "3 Members",
      "3.1 Timeline",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 EP",
      "4.3 Rarities compilations",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Paw was an American alternative rock band from Lawrence, Kansas, United States, that was formed in 1990. The band's original lineup consisted of vocalist Mark Hennessy, guitarist Grant Fitch, bassist Charles Bryan, and drummer Peter Fitch. They released two studio albums – Dragline and Death To Traitors, the B-side and outtake collection Keep The Last Bullet For Yourself and the EP Home Is A Strange Place before disbanding in 2000. On two occasions they have reunited.\n"
      ]
   },
   "History": {
      "text": [
         "Paw was formed in 1990 in Lawrence alongside Kill Creek and Stick. Their work from this era can best be characterized as aggressive rock with melodic undertones, or 'Southern rock' as Hennessy explained in an MTV interview. They were frequently cited by industry insiders as potentially \"the next Nirvana\" and a bidding war erupted to sign them.[1][2][3] The band signed a three-album deal with A&M Records during the height of the grunge wave, and released their first album, Dragline, in 1993. Their most well-known songs are from this period which received moderate rotation on the radio and on Headbanger's Ball, MTV's hard rock/heavy metal showcase. Music videos were made for the hits \"Jessie\",[4] \"Couldn't Know\"[5] and \"Sleeping Bag\".[6] Paw toured the UK in 1993 supporting Tool with Headswim (months after Tool's UK support slot with Rage Against the Machine), introducing the band to an audience outside of America. The band recorded two sessions for BBC Radio 1's rock show in 1993 (during which they played the Reading Festival). Their songs \"Jessie\", \"Pansy\" and \"The Bridge\" (plus an alternate version of the video of the first[7]) were used in the 3DO, PC, Sega Saturn and PlayStation versions of the video game Road Rash.\n",
         "In 1995, the band released its second album, Death To Traitors, on A&M Records, recorded as a three-piece following the departure of bass player Charles Bryan; guitarist Grant Fitch doubled up on bass for the recording. During this period, the band evolved by adding more instrumental and country elements to soften their hard rock edge. The band toured Europe and the UK in early 1995, as well as touring Australia in October 1995. While the album received favorable reviews from the press, sales were less successful, and Paw was dropped by A&M in 1996, before their contract was fulfilled.\n",
         "In 1998, Grant Fitch, Peter Fitch and Dan Hines formed the band Palomar and released the album World Without Horses. A reviewer described Palomar as \"a gentler and more melodic sound than Paw.\"[8] Paw also released a full-length compilation of B-sides and rarities entitled Keep The Last Bullet For Yourself on their own label, Outlaw Records. Paw still played together during this period, and both World Without Horses and Keep The Last Bullet For Yourself were released on these shows.\n",
         "In 2000, founding members Hennessy and Fitch signed Paw with Koch Records and released the mini-album Home Is A Strange Place the same year. The new album incorporated a more pronounced southern rock element. After that they split.\n"
      ]
   },
   "Post-Paw activities": {
      "text": [
         "Former bassist Charles Bryan, who left Paw in 1994, retired from the music industry altogether to be a professional skydiver.[9]\n",
         "Hennessy's book of poetry, Cue the Bedlam (More Desperate with Longing Than Want of Air), was published in December 2005 by Unholy Day Press.[10] He joinen on vocals with Mike Ratzo (bass guitar, vocals and guitar), Justin Parr (drums), Brody Buster (guitar, harmonica and keys), Heather Lofflin (vocals and guitar), James Garvic (bass guitar and guitar) and Kurt Nesbitt (bass guitar) in The Diamond Heart Club in Lawrence, from 2006-2007. They reformed under the name 1950 D.A. (without Garvic and Nesbitt)[11] and made a 6-song EP called Low Like Planes. Around the web can be found a song by The Diamond Heart Club, under the name of \"Track 5\", which is instead \"Return To Zero\" later redone by 1950 D.A.\n",
         "In 2008, after being scheduled on the same bill between their post-Paw bands, Hennessy and Fitch returned and played together on June 6, 2008, at the Revival Tent at the Wakarusa Festival in Clinton Lake, Kansas.[12] The band played its first headlining reunion show in Lawrence on Saturday, October 4, 2008, at The Bottleneck.[13][14]\n",
         "Grant Fitch and Jason Jones formed The New Franklin Panthers, in Lawrence.[15][16] They have released on Bandcamp Hot Dogs Are Cool: In III Movements on February 1, 2008[15] and the Circus Act EP (with Dan Hines) on January 13, 2011.[16] Grant self-released Gman Rides Again on July 26, 2012[17] and re-released World Without Horses (under the name Grant Finch and Palomar).[18] Grant is currently occupied as a Production Manager on a number of productions, including the television series The Inspectors, and the 2018 thriller Faceless, and runs a production company, Electrical Odyssey.[19]\n",
         "In 2014, Mark Hennessy started Godzillionaire (with Michael Dye, Cody Romaine and Benjamin White). After releasing some demos[20][21] they released in 2016 $mall ¢hange[22] and in 2017 the EP the great dEPression.[23] In November and December 2017 they took offline their sites while on legal litigation with the lawyers of the Godzilla's copyright owners, but on January 5 the band announced the litigation was over and they can still use their name.[24]\n",
         "Mark Hennessy announced he would perform the whole Dragline album at The First Annual Corn King Music and Arts Festival in September.[25][26] Although it was not a Paw reunion (as it was misunderstooded by fans) but a tribute by his band Godzillionaire (for the occasion a quintet with Dan Duncan),[27] this is the actual first time he performed Paw songs since he formed Godzillionaire (and since the last Paw reunion).\n"
      ]
   },
   "Members": {
      "Timeline": {},
      "text": [
         "Session members\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "EP": {},
      "Rarities compilations": {
         "text": [
            "Palomar's World Without Horses\n",
            "Originally self-released in 1998 on Outlaw Records, re-released on bandcamp on 2012 (with \"Pocketknife\" moved at the beginning)[28][29]\n",
            "All released in singles on A&M Records. \n"
         ]
      }
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Paw was an American alternative rock band from Lawrence, Kansas, United States, that was formed in 1990. The band's original lineup consisted of vocalist Mark Hennessy, guitarist Grant Fitch, bassist Charles Bryan, and drummer Peter Fitch. They released two studio albums – Dragline and Death To Traitors, the B-side and outtake collection Keep The Last Bullet For Yourself and the EP Home Is A Strange Place before disbanding in 2000. On two occasions they have reunited.\n",
      "Paw was formed in 1990 in Lawrence alongside Kill Creek and Stick. Their work from this era can best be characterized as aggressive rock with melodic undertones, or 'Southern rock' as Hennessy explained in an MTV interview. They were frequently cited by industry insiders as potentially \"the next Nirvana\" and a bidding war erupted to sign them.[1][2][3] The band signed a three-album deal with A&M Records during the height of the grunge wave, and released their first album, Dragline, in 1993. Their most well-known songs are from this period which received moderate rotation on the radio and on Headbanger's Ball, MTV's hard rock/heavy metal showcase. Music videos were made for the hits \"Jessie\",[4] \"Couldn't Know\"[5] and \"Sleeping Bag\".[6] Paw toured the UK in 1993 supporting Tool with Headswim (months after Tool's UK support slot with Rage Against the Machine), introducing the band to an audience outside of America. The band recorded two sessions for BBC Radio 1's rock show in 1993 (during which they played the Reading Festival). Their songs \"Jessie\", \"Pansy\" and \"The Bridge\" (plus an alternate version of the video of the first[7]) were used in the 3DO, PC, Sega Saturn and PlayStation versions of the video game Road Rash.\n",
      "In 1995, the band released its second album, Death To Traitors, on A&M Records, recorded as a three-piece following the departure of bass player Charles Bryan; guitarist Grant Fitch doubled up on bass for the recording. During this period, the band evolved by adding more instrumental and country elements to soften their hard rock edge. The band toured Europe and the UK in early 1995, as well as touring Australia in October 1995. While the album received favorable reviews from the press, sales were less successful, and Paw was dropped by A&M in 1996, before their contract was fulfilled.\n",
      "In 1998, Grant Fitch, Peter Fitch and Dan Hines formed the band Palomar and released the album World Without Horses. A reviewer described Palomar as \"a gentler and more melodic sound than Paw.\"[8] Paw also released a full-length compilation of B-sides and rarities entitled Keep The Last Bullet For Yourself on their own label, Outlaw Records. Paw still played together during this period, and both World Without Horses and Keep The Last Bullet For Yourself were released on these shows.\n"
   ]
}