{
   "Name": "Paw (band)",
   "rawData": [
      "Paw was an American alternative rock band from Lawrence, Kansas, United States, that was formed in 1990. The band's original lineup consisted of vocalist Mark Hennessy, guitarist Grant Fitch, bassist Charles Bryan, and drummer Peter Fitch. They released two studio albums – Dragline and Death To Traitors, the B-side and outtake collection Keep The Last Bullet For Yourself and the EP Home Is A Strange Place before disbanding in 2000. On two occasions they have reunited.\n",
      "Paw was formed in 1990 in Lawrence alongside Kill Creek and Stick. Their work from this era can best be characterized as aggressive rock with melodic undertones, or 'Southern rock' as Hennessy explained in an MTV interview. They were frequently cited by industry insiders as potentially \"the next Nirvana\" and a bidding war erupted to sign them. The band signed a three-album deal with A&M Records during the height of the grunge wave, and released their first album, Dragline, in 1993. Their most well-known songs are from this period which received moderate rotation on the radio and on Headbanger's Ball, MTV's hard rock/heavy metal showcase. Music videos were made for the hits \"Jessie\", \"Couldn't Know\" and \"Sleeping Bag\". Paw toured the UK in 1993 supporting Tool with Headswim (months after Tool's UK support slot with Rage Against the Machine), introducing the band to an audience outside of America. The band recorded two sessions for BBC Radio 1's rock show in 1993 (during which they played the Reading Festival). Their songs \"Jessie\", \"Pansy\" and \"The Bridge\" (plus an alternate version of the video of the first) were used in the 3DO, PC, Sega Saturn and PlayStation versions of the video game Road Rash.\n",
      "In 1995, the band released its second album, Death To Traitors, on A&M Records, recorded as a three-piece following the departure of bass player Charles Bryan; guitarist Grant Fitch doubled up on bass for the recording. During this period, the band evolved by adding more instrumental and country elements to soften their hard rock edge. The band toured Europe and the UK in early 1995, as well as touring Australia in October 1995. While the album received favorable reviews from the press, sales were less successful, and Paw was dropped by A&M in 1996, before their contract was fulfilled.\n"
   ],
   "infobox": {
      "Origin": [
         "Lawrence, Kansas, U.S."
      ],
      "Genres": [
         "Alternative rock, grunge, hard rock, heavy metal, alternative metal, southern rock"
      ],
      "Years active": [
         "1990–2000, 2008, 2018"
      ],
      "Labels": [
         "A&M, eOne, Nasty Pope, Outlaw Records"
      ],
      "Past members": [
         "Mark Hennessy",
         "Grant Fitch",
         "Peter Fitch",
         "Charles Bryan",
         "Jason Magierowski",
         "Dan Hines"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Lawrence, Kansas, United States, that was formed in [YEAR]. The band's original lineup consisted of vocalist [MONTH]k Hennessy, guitarist Grant Fitch, bassist [PERSON_NAME_FULL_0_MALE], and drummer Peter Fitch. They released two studio albums – Dragline and Death To Traitors, the B-side and outtake collection Keep The Last Bullet For Yourself and the EP Home Is A Strange Place before disbanding in [YEAR]. On two occasions they have reunited.\n",
      "[BAND_NAME] was formed in [YEAR] in Lawrence alongside Kill Creek and Stick. Their work from this era can best be characterized as aggressive rock with melodic undertones, or 'Southern rock' as Hennessy explained in an [GENRE] a bidding war erupted to sign them. The band signed a three-album deal with A&M Records during the height of the grunge wave, and released their first album, Dragline, in [YEAR]. Their most well-known songs are from this period which received moderate rotation on the radio and on Headbanger's Ball, MTV's hard rock/heavy metal showcase. Music videos were made for the hits \"Jessie\", \"Couldn't Know\" and \"Sleeping Bag\". [BAND_NAME] toured the UK in [YEAR] supporting Tool with Headswim (months after Tool's UK support slot with Rage Against the Machine), introducing the band to an audience outside of America. The band recorded two sessions for BBC Radio 1's rock show in [YEAR] (during which they played the Reading Festival). Their songs \"Jessie\", \"Pansy\" and \"The Bridge\" (plus an alternate version of the video of the first) were used in the 3DO, PC, Sega Saturn and PlayStation versions of the video game Road Rash.\n",
      "In [YEAR], the band released its second album, Death To Traitors, on A&M Records, recorded as a three-piece following the departure of bass player Charles Bryan; guitarist [PERSON_NAME_FULL_0_MALE] doubled up on bass for the recording. During this period, the band evolved by adding more instrumental and country elements to soften their hard rock edge. The band toured Europe and the UK in early [YEAR], as well as touring Australia in [MONTH] [YEAR]. While the album received favorable reviews from the press, sales were less successful, and [BAND_NAME] was dropped by A&M in [YEAR], before their contract was fulfilled.\n"
   ]
}