{
   "Name": "Dandelion (American band)",
   "rawData": [
      "Dandelion was an alternative Rock band from Philadelphia, Pennsylvania formed in 1989 by vocalist/guitarist Kevin Morpurgo, bassist Mike Morpurgo, guitarist Carl Hinds, and drummer Dante Cimino. Bayen Butler was also a member in 1993-94. Due to their sound and image, Dandelion is often associated with the grunge movement of the late 1980s and early 1990s from Seattle.\n",
      "The band was originally going to be called Cat Food but instead chose Dandelion due to the guitarist Carl Hinds reading Ray Bradbury's novel \"Dandelion Wine\". In 1990, Dandelion recorded a demo tape called Silver that was reviewed by CMJ magazine and received a Jackpot pick, being only the second demo to receive that honor. The tape attracted the attention of Ruffhouse Records, a label based in nearby Conshohocken and home to various hip-hop groups like The Goats, Cypress Hill, Schoolly D, and The Fugees. The song \"Waiting for a Ride\" was released as a single the following year. They also released two full-length albums: I Think I'm Gonna Be Sick (Columbia/Ruffhouse) in 1993, and Dyslexicon (Sony) in 1995. Bayen Butler left the band before the release of Dyslexicon and formed the band Shag.\n",
      "Dandelion's music was featured on MTV, as videos for the songs \"Waiting for a Ride\", \"Under My Skin\", and \"Weird-Out\" entered late night rotation. The band's music was also featured on MTV shows The Real World and Beavis & Butt-head, as well as the Edward Furlong movie Brainscan. However, national fame eluded the band as their albums were released during the time of grunge's decline in popularity. Dandelion disbanded in 1996.\n"
   ],
   "infobox": {
      "Origin": [
         " Philadelphia, PA"
      ],
      "Genres": [
         "Alternative rock",
         "Hard rock",
         "Grunge",
         "Heavy metal"
      ],
      "Years active": [
         "1989—1996"
      ],
      "Labels": [
         "Ruffhouse Records",
         "Columbia",
         "Sony"
      ],
      "Associated acts": [
         "Shag",
         "Latimer",
         "The Hells",
         "The Cobbs",
         "Laguardia",
         "The Hell Yeahs ",
         "Rudy & Blitz"
      ],
      "Website": [
         "MySpace:Dandelion"
      ],
      "Past members": [
         "Kevin Morpurgo",
         "Mike Morpurgo",
         "Carl Hinds",
         "Dante Cimino",
         "Bayen Butler (1993-1994)"
      ]
   }
}