{
   "Name": "Loquat (band)",
   "rawData": [
      "Loquat is an electronic/pop band based in San Francisco, California. The group is currently composed of Kylee Swenson Gordon (vocals/guitar), Christopher Cooper (keyboards), Anthony Gordon (bass guitar), Chip Cosby (guitar/vocals), and Jon Langmead (drums).\n",
      "Loquat began with singer Kylee Swenson and Earl Otsuka writing songs in San Francisco in 1996. However, it wasn't until 2001 that the band came into being in its current form, when bass player Anthony Gordon encouraged the then-duo to play live shows.  They recruited drummer Christopher Lautz and original keyboardist Ben Kasman, and Loquat played their first live engagement in September 2001.  Loquat self-released their first EP, The Penny Drop, in May 2002.  It was followed later that year by a second EP, Fall, released on 10-inch vinyl by Dreams by Degrees.  In 2003, Ben Kasman left the band, and was replaced on keyboards by Ryan Manley, recruited via an advertisement on Craigslist.  Their third EP, Before the Momentum, was released in December 2003 by Devil in the Woods.  Also in 2003, Loquat was awarded the title of Best Pop Group at SF Weekly's 2003 Music Awards.\n",
      "While Loquat began assembling their first full album, their music gained increasing exposure due to extensive play time on San Francisco radio station Live 105, as well as the song \"Swingset Chain\" being featured on the CW television series One Tree Hill and coming pre-loaded on SanDisk's Sansa media player.  The band's debut LP, It's Yours to Keep, was released in April 2005 by Jackpine Social Club, and featured ten tracks.  The album was met with generally positive reviews, though some reviewers thought the album fell short of the band's talent.  It reached #85 on  College Music Journal's CMJ Radio 200 chart.  The band recently signed with Talking House Records, and their second full-length album, Secrets of the Sea, was released in October 2008. Loquat released their third studio album on April 24, 2012 titled We Could Be Arsonists.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Pop",
         "Electronic"
      ],
      "Years active": [
         "2001 (2001)–present"
      ],
      "Labels": [
         "Nacional Records",
         "Tommy Boy Entertainment"
      ],
      "Members": [
         "Kylee Swenson Gordon",
         "Anthony Gordon",
         "Christopher Cooper",
         "Chip Cosby",
         "Jon Langmead"
      ],
      "Past members": [
         "Ben Kasman",
         "Ryan Manley",
         "Christopher Lautz",
         "Earl Otsuka"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band based in San Francisco, California. The group is currently composed of [PERSON_NAME_FIRST_2] [PERSON_NAME_LAST_2] [PERSON_NAME_LAST_1] (vocals/guitar), Christopher Cooper (keyboards), [PERSON_NAME_FULL_1_MALE] (bass guitar), Chip Cosby (guitar/vocals), and [PERSON_NAME_FULL_0_MALE] (drums).\n",
      "[BAND_NAME] began with singer [PERSON_NAME_FULL_0_FEMALE] and Earl Otsuka writing songs in San Francisco in [YEAR]. However, it wasn't until [YEAR] that the band came into being in its current form, when bass player [PERSON_NAME_FULL_1_MALE] encouraged the then-duo to play live shows.  They recruited drummer Christopher Lautz and original keyboardist [PERSON_NAME_FULL_2_MALE], and [BAND_NAME] played their first live engagement in [MONTH] [YEAR].  [BAND_NAME] self-released their first EP, The Penny Drop, in [MONTH] [YEAR].  It was followed later that year by a second EP, Fall, released on 10-inch vinyl by Dreams by Degrees.  In [YEAR], [PERSON_NAME_FULL_2_MALE] left the band, and was replaced on keyboards by [PERSON_NAME_FULL_3_MALE], recruited via an advertisement on Craigslist.  Their third EP, Before the Momentum, was released in [MONTH] [YEAR] by Devil in the Woods.  Also in [YEAR], [BAND_NAME] was awarded the title of Best Pop Group at SF Weekly's [YEAR] Music Awards.\n",
      "While [BAND_NAME] began assembling their first full album, their music gained increasing exposure due to extensive play time on [PERSON_NAME_FULL_1_MALE] radio station Live 105, as well as the song \"Swingset Chain\" being featured on the CW television series [PERSON_NAME_FULL_0_FEMALE] and coming pre-loaded on [PERSON_NAME_FIRST_1]Disk's [PERSON_NAME_FIRST_1]sa media player.  The band's debut LP, It's Yours to Keep, was released in [MONTH] [YEAR] by Jackpine Social Club, and featured ten tracks.  The album was met with generally positive reviews, though some reviewers thought the album fell short of the band's talent.  It reached #85 on  College Music Journal's CMJ Radio 200 chart.  The band recently signed with Talking House Records, and their second full-length album, Secrets of the Sea, was released in [MONTH] [YEAR]. [BAND_NAME] released their third studio album on [MONTH] 24, [YEAR] titled We Could Be Arsonists.\n"
   ]
}