{
   "Name": "Eric's Trip",
   "rawData": [
      "Eric's Trip was a Canadian indie rock band from Moncton, New Brunswick. Eric's Trip achieved prominence as the first Canadian band to be signed to Seattle's flagship grunge label Sub Pop in the early 1990s. The band had a minor hit in alternative circles with the single \"View Master\", from the 1994 album Forever Again.\n",
      "Eric's Trip formed in 1990 when musicians Rick White and Chris Thompson joined Julie Doiron and Ed Vaughan (who was later replaced by Mark Gaudet). They took their name from a Sonic Youth song and developed a unique sound which fused elements of the distorted guitar of Dinosaur Jr., the folk leanings of Neil Young, and the lo-fi aesthetic of Sebadoh. White described their sound as \"sappy melodic pop music on top of thick distortion.\" Gaudet's description was more succinct: \"dreamy punk\".\n",
      "The band released their first album, Love Tara, in 1993.\n"
   ],
   "infobox": {
      "Also known as": [
         "Stereo Mountain"
      ],
      "Origin": [
         "Moncton, New Brunswick, Canada"
      ],
      "Genres": [
         "Indie rock, noise pop, alternative rock, grunge[1]"
      ],
      "Years active": [
         "1990–1996, 2001, 2006–present"
      ],
      "Labels": [
         "Sub Pop, Sappy, Great Beyond, Sonic Unyon, Murderecords, Squirtgun Records"
      ],
      "Associated acts": [
         "Elevator, Sloan"
      ],
      "Members": [
         "Rick White",
         "Julie Doiron",
         "Chris Thompson",
         "Mark Gaudet"
      ],
      "Past members": [
         "Ed Vaughan"
      ]
   },
   "albums": [
      "Eric's Trip",
      "Catapillars",
      "Drowning",
      "Warm Girl",
      "Belong",
      "Peter",
      "Songs About Chris",
      "Julie and the Porthole to Dimentia",
      "Trapped In New York",
      "Warm Girl",
      "The Gordon Street Haunting",
      "The Road South"
   ],
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band from Moncton, New Brunswick. [BAND_NAME] achieved prominence as the first Canadian band to be signed to Seattle's flagship grunge label Sub Pop in the early [YEAR]s. The band had a minor hit in alternative circles with the single [SONG_NAME], from the [YEAR] album Forever Again.\n",
      "[BAND_NAME] formed in [YEAR] when musicians Rick White and [PERSON_NAME_FULL_1_MALE] joined [MONTH]ie Doiron and Ed Vaughan (who was later replaced by [MONTH]k Gaudet). They took their name from a [GENRE] a unique sound which fused elements of the distorted guitar of Dinosaur Jr., the folk leanings of [PERSON_NAME_FULL_0_MALE], and the lo-fi aesthetic of Sebadoh. White described their sound as [SONG_NAME].\n",
      "The band released their first album, Love Tara, in [YEAR].\n"
   ]
}