{
   "Name": "King Cobb Steelie",
   "rawData": [
      "King Cobb Steelie is a Canadian indie rock band formed in 1991 from Guelph, Ontario, and later based in Toronto.  The band's most successful single was 1997's \"Rational\", from the album Junior Relaxer. Their music fuses elements of punk, grunge, funk, jazz and dance. The core of the band is singer/songwriter Kevan Byrne and bassist Kevin Lynn. A variety of other collaborators, including Sam Cino, Al Okada, Gary Dutch, Geoff Walton, Steve Clarkson, Mike Armstrong, Nathan Lawr, Don Pyle and Michelle McAdorey, have contributed to individual albums.\n",
      "In 1993 the band, named for a special kind of toy marble, released its self-titled album, which fused progressive rock with dubstep sampling. In 1994 the band was signed to the EMI label. In July 1997 the band performed at Graceland in Vancouver. In 1999, as Junior Relaxer, the band made a number of performances at the Rancho Relaxo in Toronto.\n",
      "Percussionist Robin Easton participated as drummer 14 in the Boredoms 77 Boadrum performance which occurred on July 7, 2007 at the Empire-Fulton Ferry State Park in Brooklyn, New York. That year King Cobb Steelie released an album, Destroy All Codes.\n"
   ],
   "infobox": {
      "Origin": [
         "Guelph, Ontario, Canada"
      ],
      "Genres": [
         "Indie rock, grunge[1]"
      ],
      "Years active": [
         "1991–present"
      ],
      "Labels": [
         "Raw Energy Records, EMI Canada, Outside Music"
      ],
      "Website": [
         "http://www.kingcobbsteelie.net/"
      ],
      "Members": [
         "Kevan Byrne",
         "Kevin Lynn"
      ]
   },
   "albums": [
      "One's a Heifer b/w Duotang",
      "King Cobb Steelie",
      "Project Twinkle",
      "Junior Relaxer",
      "Mayday",
      "Destroy All Codes",
      "Goodbye Arcadia EP"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band formed in [YEAR] from Guelph, Ontario, and later based in Toronto.  The band's most successful single was [YEAR]'s [SONG_NAME], from the album [MONTH]ior Relaxer. Their music fuses elements of punk, grunge, funk, jazz and dance. The core of the band is singer/songwriter [PERSON_NAME_FULL_3_MALE] and bassist [PERSON_NAME_FULL_5_MALE]. A variety of other collaborators, including Sam Cino, [PERSON_NAME_FULL_2_MALE], Gary Dutch, [PERSON_NAME_FULL_4_MALE], [PERSON_NAME_FULL_0_MALE], Mike Armstrong, [PERSON_NAME_FULL_1_MALE], Don Pyle and [PERSON_NAME_FULL_6_FEMALE], have contributed to individual albums.\n",
      "In [YEAR] the band, named for a special kind of toy marble, released its self-titled album, which fused progressive rock with dubstep sampling. In [YEAR] the band was signed to the EMI label. In [MONTH] [YEAR] the band performed at Graceland in Vancouver. In [YEAR], as [MONTH]ior Relaxer, the band made a number of performances at the Rancho Relaxo in Toronto.\n",
      "Percussionist Robin Easton participated as drummer 14 in the Boredoms 77 Boadrum performance which occurred on [MONTH] 7, [YEAR] at the Empire-Fulton [PERSON_NAME_FULL_0_MALE] in Brooklyn, New York. That year [BAND_NAME] released an [GENRE]"
   ]
}