{
   "Name": "Noir Désir",
   "Sections": [
      "1 History",
      "1.1 Formation: 1980–1985",
      "1.2 Early albums: 1985–1991",
      "1.3 Post-success: 1991–2001",
      "1.4 Des visages des figures: 2001–2003",
      "1.5 Incarceration of Bertrand Cantat: 2003–2007",
      "1.6 Return: 2005–2010",
      "1.7 Acoustic and New song: 2020",
      "2 Discography",
      "3 References"
   ],
   "Summary": {
      "text": [
         "Noir Désir (French pronunciation: ​[nwaʁ deziʁ], \"Black Desire\") was a French rock band from Bordeaux. They were active during the 1980s, 1990s and early 2000s, and have had two albums certified double platinum in France and three certified gold.[2] They have been an influence on numerous French musicians including Cali, Louise Attaque and Miossec.[3] While active, the band consisted of Bertrand Cantat (vocals, guitar), Serge Teyssot-Gay (guitar), Jean-Paul Roy (bass guitar) and Denis Barthe (drums).\n"
      ]
   },
   "History": {
      "Formation: 1980–1985": {
         "text": [
            "Bertrand Cantat and Serge Teyssot-Gay met in 1980 at secondary school after Cantat moved to Bordeaux from his hometown in Normandy; Teyssot-Gay was 17 years old and Cantat  16. The two teenagers shared a love of music, particularly Led Zeppelin and The Who, so they decided to form a band. Teyssot-Gay had a strong musical background and a decade's worth of training in classical guitar; Cantat, who could not play any instrument at the time, became the singer. While on summer vacation they met Denis Barthe, who shared their passion for music and agreed to play drums for the band, though he had never played them before and learned on the fly.[4][5]\n",
            "They went through a series of temporary bassists, eventually settling on Vincent Leriche. The band originally called themselves \"Psychoz\", then \"6.35\", \"Station Désir\" and finally \"Noirs Désirs\" (to be changed later to Noir Désir). In 1982 Teyssot-Gay and Leriche left the group to form BAM (Boîte A Musique). The remaining band members, Barthe and Cantat, went in search of a replacement guitarist and bassist. For bass they found Frédéric Vidalenc, who had played in the well-known local group Dernier Métro, and eventually they settled on Luc Robène for guitar.[4] (The following year Cantat also left the band temporarily, being replaced during his six-month absence by Emmanuel Ory-Weil, who later became the band's manager.) When Robène quit in 1985 Cantat succeeded in getting their original guitarist, Teyssot-Gay, back into the band. The new lineup of Cantat on vocals, Teyssot-Gay on guitar, Vidalenc on bass and Barthe on drums continued for 11 more years.[6]\n"
         ]
      },
      "Early albums: 1985–1991": {
         "text": [
            "Now with a new and finally solid lineup the band decided to make an attempt at getting a recording contract. They created a demo which was heard by Théo Hakola of the American band Passion Fodder. Hakola urged the French label Barclay Records to sign the band, and the label's artistic director agreed to see the band in concert first. At first the label wanted the band to produce a single, but after two months of negotiations it was agreed that a mini-album would be made instead. The label did not expect much success, the director commenting \"If we sell 1,500 copies of your disk, that will already be very good\" (Si on vend 1 500 exemplaires de votre disque, ce sera déjà très bien).[4] The label disliked the name Noirs Désirs, feeling it to be old fashioned, so the band agreed to drop two letters, unpluralising the name to Noir Désir. In 1987 they released the mini-album, Où veux tu qu'je r'garde?. After two months it had sold 5,000 copies, exceeding the expectations of Barclay, who signed the band for another three albums.[7]\n",
            "Their first critical and popular success came two years later in 1989, with their next album, Veuillez rendre l'âme (à qui elle appartient). The album won Noir Désir the Bus d'Acier for 1989, an award given by the press to the best French rock group of the year. It was certified gold, selling over 150,000 copies, and became recognised as one of the best French rock albums ever made. It also produced the hit single: \"Aux sombres héros de l'amer\", a sea-shanty-like harmonica-driven ballad that uses the concept of sailors lost at sea as a metaphor for life.[8] However the group were dismayed that many people had missed this double meaning of the song, interpreting it as a meaningless sea shanty. They were also disappointed that many people judged them based on the one song, without listening to the rest of the album.[9] In their next two albums the band would return to the harder sound of Où veux-tu qu'je r'garde ? and develop it even further. This development was largely a reaction to their worries about the success of the single Aux sombres héros de l'amer.[9]\n"
         ]
      },
      "Post-success: 1991–2001": {
         "text": [
            "With its harder and more aggressive sound and an almost complete lack of promotion, the third album Du ciment sous les plaines (1991) received lacklustre reviews compared to Veuillez rendre l'âme (à qui elle appartient) and no singles were released from it. In May 1991, a concert in Besançon was cut short after four songs when Bertrand Cantat collapsed on stage. As a result, the band took a break from touring until the release of their next album, Tostaky.[7]\n",
            "Tostaky was produced in London, a city the group admired for its musical output. Unlike Du ciment sous les plaines, Tostaky was released to much acclaim and popular success and was certified gold a few days after its release. In August 1993, The Christian Science Monitor heralded Noir Désir as France's \"leading entry in the grunge wave.\"[1] In January 1994, the live album Dies Irae was released, showcasing the frenzy of the band's performances.[7] However the touring took its toll on Cantat, who eventually ended up in hospital for an operation on his vocal cords.[7] After this gruelling tour the band decided to take a year's break, both from playing and from each other.[5] During their break Bertrand Cantat received professional voice training and bass-player Frédéric Vidalenc quit the group to pursue his own projects;[4] he was replaced by a longtime friend of the band, Jean-Paul Roy. Serge Teyssot-Gay used his spare time during the break to record a solo album, Silence Radio, which would be finished and released in 1996.\n",
            "In December 1996 the success of Tostaky was continued with the release of 666.667 Club, which would be certified double platinum a year after its release.[10] In 1998, after receiving a remix of their song \"Septembre, en attendant\" in the mail, they decided to produce the album One Trip, One Noise which comprised a collection of their songs remixed by young musicians.[11]\n"
         ]
      },
      "Des visages des figures: 2001–2003": {
         "text": [
            "Their most recent studio album, 2001's Des visages des figures was much quieter than any of their previous albums,[12] but was very well received, selling over 1 million copies. The group received five Victoires de la Musique award nominations for 2001, winning both Best Rock Album of the Year and Music Video of the Year for \"Le vent nous portera\" in collaboration with the French/Spanish artist Manu Chao. During the awards ceremony Cantat read out a speech on behalf of the band, addressed to Jean-Marie Messier, the CEO of Vivendi, the group that owns Noir Désir's record company, Universal.  Messier was a controversial figure in France at the time, due to the perception that he was abandoning his French roots in favour of Americanization.  In their speech, Noir Désir accused Vivendi of exploiting their band's name in order to rebut criticism of Messier's treatment of French culture.[5][13] The band played few concerts for their Des visages des figures tour, but all were held in large stadium-like venues except for the Middle East tour, where the band was able to go back to their roots playing in small clubs.[7] They were invited to perform a one off concert at the “Montpellier Radio-France” festival in 2002. For the 55 minute performance, titled \"Nous n'avons fait que fuir\", Cantat recited a long-form poem he'd written over musical improvisations played by the rest of the band. The text of the poem along with a recording of the performance on CD was released by French book publisher Éditions Verticales.[14]\n"
         ]
      },
      "Incarceration of Bertrand Cantat: 2003–2007": {
         "text": [
            "In 2003, following an argument about infidelity, Bertrand Cantat, drunk at the time, severely beat his girlfriend, the French actress Marie Trintignant, also drunk, in a hotel room in Vilnius, Lithuania.  The following morning Marie Trintignant was found in a coma in her bed and died a few days later. A post mortem examination showed that she had suffered multiple head injuries.  Cantat admitted to hitting her four times; prosecutors argued that it was in fact 19 times in all.[15]  He later alleged she had fallen and hit her head on a radiator,[16] and that this impact, not his blows, rendered her unconscious. On 29 March 2004, a Lithuanian court sentenced Cantat to eight years in prison after he was found guilty of manslaughter.[16] After one year spent in Lukiškės prison of Vilnius, he was moved to a prison near Toulouse, France, and was released on parole in October 2007 after serving half his sentence.[17]  A condition of Cantat's release was that he must receive regular psychological counseling and refrain from public reference to his crime in interviews or in music.[18] In July 2010, the conditional status of Cantat's release was lifted and he was declared as having completely served his sentence.[19]\n"
         ]
      },
      "Return: 2005–2010": {
         "text": [
            "September 2005 brought two new releases of Noir Désir's work. The album, Noir Désir en public, which had been started before the incident in Vilnius, contained highlights of their last tour, during which every concert had been recorded. The DVD set, Noir Désir en images, contained various live performances footage and videos. Special permission was obtained for the imprisoned Cantat to participate in the development of both the CD and the DVD.[3]\n",
            "In November 2008, the band released two free tracks on their website, performed by the whole band. The songs are \"Gagnants / Perdants (Bonne nuit les petits)\" and a cover of \"Le Temps des cerises\".[20]\nThe group was in the process of composing and recording a new album, which Teyssot-Gay had predicted would be completed in 2009.  However, according to a 14 May 2009 article in Le Parisien the album would not be ready until January 2010.[21]\n",
            "On 29 November 2010, it was announced that guitarist Serge Teyssot-Gay was leaving the band citing \"emotional, human and musical differences\" with lead singer Cantat.[22]\n",
            "On 30 November 2010, the band's drummer Denis Barthe announced that Noir Désir is \"disbanded for good\" adding that it is useless to let the band live with \"artificial respiration\".[23]\n"
         ]
      },
      "Acoustic and New song: 2020": {
         "text": [
            "On 24 January 2020, Noir Désir released a Acoustic/Live album, Débranché, with 11 songs on it of live recordings from, Live á Radio Popolare, Milan 2002 and Live á Much Electric, Buenos Aires 1997.\nOn 30 October 2020, the band released a new single, Imbécile.\n"
         ]
      }
   },
   "Discography": {},
   "References": {},
   "coreData": [
      "Noir Désir (French pronunciation: ​[nwaʁ deziʁ], \"Black Desire\") was a French rock band from Bordeaux. They were active during the 1980s, 1990s and early 2000s, and have had two albums certified double platinum in France and three certified gold.[2] They have been an influence on numerous French musicians including Cali, Louise Attaque and Miossec.[3] While active, the band consisted of Bertrand Cantat (vocals, guitar), Serge Teyssot-Gay (guitar), Jean-Paul Roy (bass guitar) and Denis Barthe (drums).\n",
      "Bertrand Cantat and Serge Teyssot-Gay met in 1980 at secondary school after Cantat moved to Bordeaux from his hometown in Normandy; Teyssot-Gay was 17 years old and Cantat  16. The two teenagers shared a love of music, particularly Led Zeppelin and The Who, so they decided to form a band. Teyssot-Gay had a strong musical background and a decade's worth of training in classical guitar; Cantat, who could not play any instrument at the time, became the singer. While on summer vacation they met Denis Barthe, who shared their passion for music and agreed to play drums for the band, though he had never played them before and learned on the fly.[4][5]\n",
      "They went through a series of temporary bassists, eventually settling on Vincent Leriche. The band originally called themselves \"Psychoz\", then \"6.35\", \"Station Désir\" and finally \"Noirs Désirs\" (to be changed later to Noir Désir). In 1982 Teyssot-Gay and Leriche left the group to form BAM (Boîte A Musique). The remaining band members, Barthe and Cantat, went in search of a replacement guitarist and bassist. For bass they found Frédéric Vidalenc, who had played in the well-known local group Dernier Métro, and eventually they settled on Luc Robène for guitar.[4] (The following year Cantat also left the band temporarily, being replaced during his six-month absence by Emmanuel Ory-Weil, who later became the band's manager.) When Robène quit in 1985 Cantat succeeded in getting their original guitarist, Teyssot-Gay, back into the band. The new lineup of Cantat on vocals, Teyssot-Gay on guitar, Vidalenc on bass and Barthe on drums continued for 11 more years.[6]\n",
      "Now with a new and finally solid lineup the band decided to make an attempt at getting a recording contract. They created a demo which was heard by Théo Hakola of the American band Passion Fodder. Hakola urged the French label Barclay Records to sign the band, and the label's artistic director agreed to see the band in concert first. At first the label wanted the band to produce a single, but after two months of negotiations it was agreed that a mini-album would be made instead. The label did not expect much success, the director commenting \"If we sell 1,500 copies of your disk, that will already be very good\" (Si on vend 1 500 exemplaires de votre disque, ce sera déjà très bien).[4] The label disliked the name Noirs Désirs, feeling it to be old fashioned, so the band agreed to drop two letters, unpluralising the name to Noir Désir. In 1987 they released the mini-album, Où veux tu qu'je r'garde?. After two months it had sold 5,000 copies, exceeding the expectations of Barclay, who signed the band for another three albums.[7]\n"
   ]
}