{
   "Name": "Noir Désir",
   "rawData": [
      "Noir Désir (French pronunciation: ​, \"Black Desire\") was a French rock band from Bordeaux. They were active during the 1980s, 1990s and early 2000s, and have had two albums certified double platinum in France and three certified gold. They have been an influence on numerous French musicians including Cali, Louise Attaque and Miossec. While active, the band consisted of Bertrand Cantat (vocals, guitar), Serge Teyssot-Gay (guitar), Jean-Paul Roy (bass guitar) and Denis Barthe (drums).\n",
      "Bertrand Cantat and Serge Teyssot-Gay met in 1980 at secondary school after Cantat moved to Bordeaux from his hometown in Normandy; Teyssot-Gay was 17 years old and Cantat  16. The two teenagers shared a love of music, particularly Led Zeppelin and The Who, so they decided to form a band. Teyssot-Gay had a strong musical background and a decade's worth of training in classical guitar; Cantat, who could not play any instrument at the time, became the singer. While on summer vacation they met Denis Barthe, who shared their passion for music and agreed to play drums for the band, though he had never played them before and learned on the fly.\n",
      "They went through a series of temporary bassists, eventually settling on Vincent Leriche. The band originally called themselves \"Psychoz\", then \"6.35\", \"Station Désir\" and finally \"Noirs Désirs\" (to be changed later to Noir Désir). In 1982 Teyssot-Gay and Leriche left the group to form BAM (Boîte A Musique). The remaining band members, Barthe and Cantat, went in search of a replacement guitarist and bassist. For bass they found Frédéric Vidalenc, who had played in the well-known local group Dernier Métro, and eventually they settled on Luc Robène for guitar. (The following year Cantat also left the band temporarily, being replaced during his six-month absence by Emmanuel Ory-Weil, who later became the band's manager.) When Robène quit in 1985 Cantat succeeded in getting their original guitarist, Teyssot-Gay, back into the band. The new lineup of Cantat on vocals, Teyssot-Gay on guitar, Vidalenc on bass and Barthe on drums continued for 11 more years.\n"
   ],
   "infobox": {
      "Origin": [
         "Bordeaux, Aquitaine, Occitania, France"
      ],
      "Genres": [
         "Post-punk",
         "alternative rock",
         "grunge[1]"
      ],
      "Years active": [
         "1980–2010"
      ],
      "Labels": [
         "Barclay Records"
      ],
      "Website": [
         "www.noirdez.com"
      ],
      "Past members": [
         "Bertrand Cantat",
         "Jean-Paul Roy",
         "Denis Barthe",
         "Serge Teyssot-Gay",
         "Frédéric Vidalenc"
      ]
   },
   "albums": [
      "Où veux tu qu'je r'garde",
      "Veuillez rendre l'âme (à qui elle appartient)",
      "Du ciment sous les plaines",
      "Tostaky",
      "666.667 Club",
      "Des Visages des Figures"
   ],
   "prunedData": [
      "[BAND_NAME] (French pronunciation: ​, [SONG_NAME]) was a [GENRE] band from Bordeaux. They were active during the [YEAR]s, [YEAR]s and early [YEAR]s, and have had two albums certified double platinum in France and three certified gold. They have been an influence on numerous French musicians including Cali, [PERSON_NAME_FULL_1_FEMALE] and Miossec. While active, the band consisted of Bertrand Cantat (vocals, guitar), Serge Teyssot-Gay (guitar), [PERSON_NAME_FULL_2_MALE] (bass guitar) and [PERSON_NAME_FULL_0_MALE] (drums).\n",
      "Bertrand Cantat and Serge Teyssot-Gay met in [YEAR] at secondary school after Cantat moved to Bordeaux from his hometown in Normandy; Teyssot-Gay was 17 years old and Cantat  16. The two teenagers shared a [GENRE] a band. Teyssot-Gay had a strong musical background and a decade's worth of training in classical guitar; Cantat, who could not play any instrument at the time, became the singer. While on summer vacation they met [PERSON_NAME_FULL_0_MALE], who shared their passion for music and agreed to play drums for the band, though he had never played them before and learned on the fly.\n",
      "They went through a [GENRE] band originally called themselves [SONG_NAME] (to be changed later to [BAND_NAME]). In [YEAR] Teyssot-Gay and Leriche left the group to form BAM (Boîte A Musique). The remaining band members, Barthe and Cantat, went in search of a replacement guitarist and bassist. For bass they found [PERSON_NAME_FULL_0_MALE], who had played in the well-known local group Dernier Métro, and eventually they settled on [PERSON_NAME_FULL_2_MALE] for guitar. (The following year Cantat also left the band temporarily, being replaced during his six-month absence by [PERSON_NAME_FULL_1_MALE], who later became the band's manager.) When [PERSON_NAME_LAST_2] quit in [YEAR] Cantat succeeded in getting their original guitarist, Teyssot-Gay, back into the band. The new lineup of Cantat on vocals, Teyssot-Gay on guitar, [PERSON_NAME_LAST_0] on bass and Barthe on drums continued for 11 more years.\n"
   ]
}