{
   "Name": "Animals as Leaders",
   "rawData": [
      "Animals as Leaders is an American instrumental progressive metal band from Washington, D.C., United States. It currently consists of guitarists Tosin Abasi and Javier Reyes and drummer Matt Garstka, having been formed by Abasi in 2007. They are a prominent band within the djent scene. Prosthetic Records released the band's eponymous debut album in 2009. They went on to release the albums Weightless (2011), The Joy of Motion (2014), and The Madness of Many (2016).\n",
      "Animals as Leaders formed after guitarist Tosin Abasi's previous metalcore band, Reflux, disbanded. The heavy metal record label Prosthetic Records saw Abasi's guitar work and asked him to create a solo album for them. Abasi initially declined, feeling such an endeavor would be \"...egotistical and unnecessary.\" Abasi decided to take a year off to study music, as he felt he was unable to reach his peak at guitar playing. After Abasi had completed his course, he took up the label on the offer of a solo project. The name Animals as Leaders was inspired by Daniel Quinn's 1992 novel Ishmael, which addresses anthropocentrism. Abasi coined the name as a reminder \"that we're all essentially animals\".\n",
      "The project's first album, Animals as Leaders, was recorded in early 2008. Abasi recorded most guitar and bass tracks on the album; a few guitar solos, drums and various synthesized effects were programmed by engineer Misha Mansoor of Periphery and Haunted Shores. The album was released April 28, 2009 by Prosthetic Records.\n"
   ],
   "infobox": {
      "Origin": [
         "Washington, D.C., United States"
      ],
      "Genres": [
         "Progressive metal[1]",
         "djent",
         "instrumental rock[2]"
      ],
      "Years active": [
         "2007–present"
      ],
      "Labels": [
         "Sumerian",
         "Prosthetic"
      ],
      "Associated acts": [
         "TRAM",
         "Reflux",
         "Periphery",
         "Mestis"
      ],
      "Website": [
         "www.animalsasleaders.org"
      ],
      "Members": [
         "Tosin Abasi",
         "Javier Reyes",
         "Matt Garstka"
      ],
      "Past members": [
         "Chebon Littlefield",
         "Matt Halpern",
         "Navene Koperweis"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Washington, D.C., United States. It currently consists of guitarists Tosin Abasi and Javier Reyes and drummer [PERSON_NAME_FULL_0_MALE], having been formed by Abasi in [YEAR]. They are a prominent band within the djent scene. Prosthetic Records released the band's eponymous debut album in [YEAR]. They went on to release the albums Weightless ([YEAR]), The Joy of Motion ([YEAR]), and The Madness of Many ([YEAR]).\n",
      "[BAND_NAME] formed after guitarist Tosin Abasi's previous metalcore band, Reflux, disbanded. The heavy metal record label Prosthetic Records saw Abasi's guitar work and asked him to create a [GENRE] an endeavor would be \"...egotistical and unnecessary.\" Abasi decided to take a year off to study music, as he felt he was unable to reach his peak at guitar playing. After Abasi had completed his course, he took up the label on the offer of a solo project. The name [BAND_NAME] was inspired by Daniel Quinn's [YEAR] novel Ishmael, which addresses anthropocentrism. Abasi coined the name as a reminder \"that we're all essentially animals\".\n",
      "The project's first album, [BAND_NAME], was recorded in early [YEAR]. Abasi recorded most guitar and bass tracks on the album; a few guitar solos, drums and various synthesized effects were programmed by engineer [PERSON_NAME_FULL_0_MALE] of Periphery and Haunted Shores. The album was released [MONTH] 28, [YEAR] by Prosthetic Records.\n"
   ]
}