{
   "Discography": {
      "Live albums": {},
      "Re-releases": {},
      "Singles": {},
      "Studio albums": {}
   },
   "External links": {},
   "History": {
      "text": [
         "Animals as Leaders formed after guitarist Tosin Abasi's previous metalcore band, Reflux, disbanded.[4][5] The heavy metal record label Prosthetic Records saw Abasi's guitar work and asked him to create a solo album for them. Abasi initially declined, feeling such an endeavor would be \"...egotistical and unnecessary.\"[6] Abasi decided to take a year off to study music, as he felt he was unable to reach his peak at guitar playing. After Abasi had completed his course, he took up the label on the offer of a solo project. The name Animals as Leaders was inspired by Daniel Quinn's 1992 novel Ishmael, which addresses anthropocentrism. Abasi coined the name as a reminder \"that we're all essentially animals\".[6]\n",
         "The project's first album, Animals as Leaders, was recorded in early 2008. Abasi recorded most guitar and bass tracks on the album; a few guitar solos, drums and various synthesized effects were programmed by engineer Misha Mansoor of Periphery and Haunted Shores.[6] The album was released April 28, 2009 by Prosthetic Records.[7]\n",
         "In 2010, the band toured extensively, including the 2010 Summer Slaughter Tour with such acts as Decapitated, Vital Remains, Carnifex, The Faceless, All Shall Perish, The Red Chord, Cephalic Carnage, Veil of Maya, and Decrepit Birth and since Summer Slaughter have toured with more mainstream acts like Circa Survive and Dredg. They uploaded a non-album digital single called Wave of Babies to iTunes later that year.\n",
         "The band embarked on a tour alongside Circa Survive, Dredg, and Codeseven from mid-2010 to early 2011, and in early 2011, toured alongside Underoath, Thursday, and A Skylit Drive to promote Underoath's latest release, Ø (Disambiguation).\n",
         "On May 26, 2011, Animals as Leaders took part in a Red Cross benefit show titled \"Josh Barnett Presents The Sun Forever Rising\" at the House of Blues in West Hollywood, California. Shortly thereafter, they headlined their first tour, which included opening acts Intronaut, Dead Letter Circus, Last Chance to Reason, and Evan Brewer. On July 27, 2011, during a show at the Masquerade in Atlanta, Georgia, Tosin Abasi announced that they were recording the show for a live DVD.\n",
         "The band has been billed as the first support of Between the Buried and Me on their European tour in September 2011, also with the French band Doyle.  That same year, as a follow-up to their self-titled album, the band released their LP, entitled Weightless, on November 8 in the United States,[8] November 4 in Europe, and November 7 in the UK.[9]\n",
         "In Spring 2012, Animals as Leaders embarked on a headlining tour of Europe, then returned to North America to open for Thrice. Navene Koperweis left Animals as Leaders that March. Prosthetic Records then announced on March 23 that drummer Matt Garstka would join them on tour.[10]\n",
         "“We see nothing but great potential with Matt, and look forward to performing with him on the upcoming tours,” Abasi says. “We feel very excited for the future of AAL, which is brighter than ever. I’m beyond excited for our fans to hear some of the new music we already have brewing for the future!” [11]\n",
         "On November 28, 2012, Misha Mansoor, the producer for the first Animals as Leaders album, announced that he had begun writing riffs with Tosin Abasi, intending to start recording on their third album.[12] Two days later, it was confirmed that Mansoor was recording the band after the completion of two songs.[13] On February 14, 2014, the band announced their third studio album, The Joy of Motion, which was released via Sumerian Records on March 25, 2014.\n",
         "On February 2, 2016, they revealed on Instagram that they were working on their fourth studio album. On September 22, they revealed that the album would be titled The Madness of Many, and would be released on November 11, 2016. On September 30, they released a single from the album, \"The Brain Dance\". On October 18, they released another song from the album, \"Arithmophobia\". This song features extensive use of odd metered rhythm, hence its name.\n"
      ]
   },
   "Members": {
      "text": [
         "Abasi and Reyes are also members of the supergroup TRAM, alongside former Mars Volta wind instrumentalist Adrián Terrazas-González and Suicidal Tendencies drummer Eric Moore. Reyes also has his own side-project, Mestis.\n",
         "Current\n",
         "Former\n",
         "Timeline\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Singles",
      "3.3 Re-releases",
      "3.4 Live albums",
      "4 Videography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Animals as Leaders is an American instrumental progressive metal band from Washington, D.C., United States. It currently consists of guitarists Tosin Abasi and Javier Reyes and drummer Matt Garstka, having been formed by Abasi in 2007. They are a prominent band within the djent scene.[3] Prosthetic Records released the band's eponymous debut album in 2009. They went on to release the albums Weightless (2011), The Joy of Motion (2014), and The Madness of Many (2016).\n"
      ]
   },
   "Title": "Animals as Leaders - Wikipedia",
   "Videography": {}
}