{
   "Name": "Austin TV",
   "Sections": [
      "1 Members",
      "2 Indie-O Music Awards",
      "3 Coachella 2008",
      "4 Los Perros Predicen Temblores concert",
      "5 Discography",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Austin TV was an instrumental post-rock band formed in 2001 in Mexico City. Austin TV creates sonic landscapes with their music without lyrics. They have opened for groups like Yo La Tengo in Mexico and Café Tacuba in the U.S. leg of their 2007 tour, and have released three LPs, one EP and appearances in many Mexican independent bands compilations. Like the Residents or Devo, the group usually develops on stage with masks, disguises and uniforms, reason of their motto \"Your face is not important, the truth is inside\".\n",
         "Austin TV has shared the stage with many important bands of the Mexican scene, as well as international bands such as Mogwai, Tristeza, the Album Leaf and Incubus, among others. They have played at very important festivals like Vive Latino, Zero Fest, Motorokr Fest, SXSW, Personal Fest in Argentina, Manifest, Festival Cervantino, LAMC in New York, Coachella Valley Music and Arts Festival, and recently at the Rock al Parque Fest in Colombia, and \"Quitofest\" in Ecuador. They have also opened at the Aragon Ballroom in Chicago.\n"
      ]
   },
   "Members": {
      "text": [
         "Guest Members\n",
         "Former Members\n"
      ]
   },
   "Indie-O Music Awards": {
      "text": [
         "On June 11, 2008, Austin TV received four awards at the Indie-O Music Awards, the first awards created to recognize the best of the independent music scene in Mexico. \nThe categories from which they received an award were:\n"
      ]
   },
   "Coachella 2008": {
      "text": [
         "During the presentation of Fontana Bella in Mexico City (in late October, 2007), the band's manager, Carlos \"Jiju\" Ruiz announced that the band was confirmed to be playing at Coachella Valley Music and Arts Festival, an American festival held in Indio, CA. \n",
         "Taking advantage of this, they prepared a California U.S. tour with five previous dates to Coachella.\n",
         "The dates were:\n"
      ]
   },
   "Los Perros Predicen Temblores concert": {
      "text": [
         "This special show, translated in English \"Dogs can predict earthquakes\", was held at one of the most important theaters in Mexico City, the Teatro Metropolitan on August 29, 2008. Having a completely \"sold out\" date since the 1st week of tickets release, the show was theatrically performed by the band using a xoloitzcuintle dog disguise and had actors, real xoloitzcuintle dogs running around the stage, choreography dancers and special guest musicians such as Emmanuel \"Meme\" del Real, member of Cafe Tacuba, playing the acoustic guitar and keyboards and the violinist \"Alegre\". Meme also had a special feature in their LP presentation Fontana Bella at the Pabellon de Alta Tecnologia in Mexico City on October 1, 2007.\nJosue \"Hobbit mayor\" Ortiz, from the band Vicente Gayo, played the guitar replacing Chato.\n"
      ]
   },
   "Discography": {
      "text": [
         "LP\n",
         "EP\n",
         "Live DVD\n",
         "Appearances\n"
      ]
   },
   "External links": {},
   "coreData": [
      "Austin TV was an instrumental post-rock band formed in 2001 in Mexico City. Austin TV creates sonic landscapes with their music without lyrics. They have opened for groups like Yo La Tengo in Mexico and Café Tacuba in the U.S. leg of their 2007 tour, and have released three LPs, one EP and appearances in many Mexican independent bands compilations. Like the Residents or Devo, the group usually develops on stage with masks, disguises and uniforms, reason of their motto \"Your face is not important, the truth is inside\".\n",
      "Austin TV has shared the stage with many important bands of the Mexican scene, as well as international bands such as Mogwai, Tristeza, the Album Leaf and Incubus, among others. They have played at very important festivals like Vive Latino, Zero Fest, Motorokr Fest, SXSW, Personal Fest in Argentina, Manifest, Festival Cervantino, LAMC in New York, Coachella Valley Music and Arts Festival, and recently at the Rock al Parque Fest in Colombia, and \"Quitofest\" in Ecuador. They have also opened at the Aragon Ballroom in Chicago.\n",
      "Guest Members\n",
      "Former Members\n"
   ]
}