{
   "Name": "Because of Ghosts",
   "Sections": [
      "1 Members",
      "2 History",
      "3 Discography",
      "4 External links",
      "5 Notes and references"
   ],
   "Summary": {
      "text": [
         "Because of Ghosts is a three-piece post-rock band based in Melbourne, Australia.\n",
         "They are often compared to bands such as Dirty Three[1] or Godspeed You! Black Emperor.[2][3]\n",
         "The band is known for their unique take on instrumental rock and their (often handmade) CD artwork illustrated by guitarist Reuben Stanton.[4][5]\n"
      ]
   },
   "Members": {
      "text": [
         "All three members of the band are related. Domenic and Reuben are brothers. Jacob is their younger half-brother (maternal). This relationship is often confused and misconstrued in media stories and interviews.[6]\n"
      ]
   },
   "History": {
      "text": [
         "Because of Ghosts formed in 2002 when half brothers Jacob Pearce and Reuben Stanton began experimenting with looped guitars, casio toys, found tapes, field recordings and various percussion instruments. Jacob and Reuben independently recorded and released \"No More Reason, No More Doubt\" and \"Because of Ghosts EP\" in late 2002 / early 2003.\n",
         "Domenic Stanton (bass, glockenspiel, wineglasses) joined the band shortly after. The band recorded a split EP with friends Adlerseri, brothers Reuben, Domenic and Jacob independently recorded and released a mini album, Make Amends With Your Adversary Before Dawn. This record gained an international release with Japanese label Wonderground Music.\n",
         "In 2004, the band released an EP entitled Your House Is Built On A Frozen Lake. This EP widened their fan base nationally through CD sales, national airplay, and interstate tours.\n",
         "In October 2004, the because of ghosts live 12\" with an etching on side b was released on Art School Dropout Records, consisting of four tracks recorded live at the Hopetoun in Sydney.\n",
         "Notable events from 2005 include Because of Ghosts supporting U.S. group Tortoise in Melbourne and a successful tour of Tokyo.[7] The band also signed a three-album publishing contract with Mushroom Music Publishing.[8]\n",
         "In February 2006, the band released No More Reason, No More Doubt - Selected Recordings 2002 - 2004 on Art School Dropout Records. This release consists of 11 recordings from the band's early history, through to live recordings and EP tracks.\n",
         "Because of Ghosts’ debut album proper, The Tomorrow We Were Promised Yesterday, was released in Australia and New Zealand in October 2006 on Feral Media. The album is a culmination of many months of both precise and raw production. The band completed their first national tour of Australia in support of the album in late 2006.\n",
         "In July 2007, Because of Ghosts played shows across Canada. A limited Canadian Tour EP was available at the band's final Australian shows and across Canada. Each EP featured unique hand drawn cover art. After the tour, the band recorded a new album at the Hotel2Tango in Montreal with producer Howard Bilerman. \n",
         "The album, \"This Culture Of Background Noise\" was released in Australia in September 2008.[9]\n",
         "Domenic and Jacob contributed to the debut album At Long Last from Melbourne band Princess One Point Five. The two also appear on the second Princess One Point Five album The Truth, which was released in May 2006. Jacob is featured on drums for the title track \"The Truth\" and \"Oh So Cold\".\n",
         "Domenic and Jacob contributed to the debut self-titled album by The Steadfast Shepherd.\n",
         "Jacob played drums on the Alex Jarvis album The New Patriotism. He also appeared on the Mount Eerie \"Mount Eerie Dances With Wolves 12\", recorded live to acetate in Melbourne, 2005.\n",
         "Domenic plays bass for Melbourne grunge-rock group Needleburner and on occasion for Melbourne gothic-folk artist Wayward Breed\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "Notes and references": {},
   "coreData": [
      "Because of Ghosts is a three-piece post-rock band based in Melbourne, Australia.\n",
      "They are often compared to bands such as Dirty Three[1] or Godspeed You! Black Emperor.[2][3]\n",
      "The band is known for their unique take on instrumental rock and their (often handmade) CD artwork illustrated by guitarist Reuben Stanton.[4][5]\n",
      "All three members of the band are related. Domenic and Reuben are brothers. Jacob is their younger half-brother (maternal). This relationship is often confused and misconstrued in media stories and interviews.[6]\n"
   ],
   "infobox": {
      "Origin": [
         "Melbourne, Australia"
      ],
      "Genres": [
         "Post-rock, math rock"
      ],
      "Years active": [
         "2002–2013 (indefinite hiatus)"
      ],
      "Labels": [
         "Wonderground Music, Mushroom Music Publishing, Feral Media"
      ],
      "Members": [
         "Reuben Stanton",
         "Domenic Stanton",
         "Jacob Pearce"
      ]
   }
}