{
   "Name": "LoveLikeFire",
   "rawData": [
      "LoveLikeFire is a San Francisco-based indie rock band. The group was formed in 2006 and whilst an unsigned artist they independently released two EPs, Bed of Gold (2006) and An Ocean in the Air (2007), as well as mounted a self-organized national tour to promote the latter release. The band then signed to Heist Or Hit Records and a full-length album was released in the UK in Autumn 2009. This album Tear Ourselves Away was released in the US in early 2010. LoveLikeFire has received significant media and critical coverage in San Francisco Bay Area publications (San Francisco magazine, East Bay Express, SFist, SF Weekly, Palo Alto Daily News, San Francisco Chronicle) as well as in the national and out-of-town media (Spin, The A.V. Club, LimeWire Music Blog, WOXY.com, LA Weekly), and has stylistically been identified as exhibiting Britpop, dream pop, indie pop, and shoegazing influences.\n",
      "The group considers itself to have officially formed in January 2006, when its first lineup came together. Vocalist Ann Yu and drummer/keyboardist David Farrell, who had previously played together in several bands, were preparing to relocate to Los Angeles, California because, according to Yu, \"it's a lot easier to find other musicians that are serious about making a career out of \" there. The move was abruptly canceled as the band began to form. Bassist and friend Jesse Hayes became available when his punk rock band Time in Malta split up; then, in January, Yu and Farrell met guitarist Ted Parker through a Craigslist classified advertisement. A few weeks later, the band played its first gig in Los Angeles.\n",
      "The group released its first recording on August 15, 2006, only seven months after having formed. According to Yu, the six-track EP Bed of Gold was recorded before LoveLikeFire had \"fully developed its identity as a band.\" Nevertheless, the album received critical praise from The A.V. Club San Francisco, LA Weekly, and the East Bay Express. The group continued touring, performing alongside bands such as Morningwood, The Brian Jonestown Massacre, and Favourite Sons.\n"
   ],
   "infobox": {
      "Origin": [
         " San Francisco, California, United States"
      ],
      "Genres": [
         "Indie rock[1]"
      ],
      "Years active": [
         "2006-present"
      ],
      "Labels": [
         "Heist Or Hit Records[2]"
      ],
      "Website": [
         "lovelikefire.com"
      ],
      "Members": [
         "Ann Yu (vocals, guitar)",
         "David Farrell (drums)",
         "Marty Mattern (guitar, keyboards, backing vocals)",
         "Eric Amerman (bass, guitar, backing vocals)[3]"
      ],
      "Past members": [
         "Jesse Hayes (bass)[4]",
         "Ted Parker (guitar)",
         "Robert Kissinger (bass)"
      ]
   },
   "albums": [
      "Bed of Gold",
      "An Ocean in the Air",
      "Tear Ourselves Away",
      "Dust"
   ],
   "prunedData": [
      "[BAND_NAME] is a [PERSON_NAME_FULL_0_FEMALE]-based indie rock band. The group was formed in [YEAR] and whilst an unsigned artist they independently released two EPs, Bed of Gold ([YEAR]) and An Ocean in the Air ([YEAR]), as well as mounted a self-organized national tour to promote the latter release. The band then signed to Heist Or Hit Records and a full-length album was released in the UK in Autumn [YEAR]. This album Tear Ourselves Away was released in the US in early [YEAR]. [BAND_NAME] has received significant media and critical coverage in [PERSON_NAME_FULL_0_FEMALE] Bay Area publications ([PERSON_NAME_FULL_0_FEMALE] magazine, East Bay Express, SFist, SF Weekly, Palo Alto Daily News, [PERSON_NAME_FULL_0_FEMALE] Chronicle) as well as in the national and out-of-town media (Spin, The A.V. Club, LimeWire Music Blog, WOXY.com, LA Weekly), and has stylistically been identified as exhibiting Britpop, dream pop, indie pop, and shoegazing influences.\n",
      "The group considers itself to have officially formed in [MONTH] [YEAR], when its first lineup came together. Vocalist Ann Yu and drummer/keyboardist [PERSON_NAME_FULL_1_MALE], who had previously played together in several bands, were preparing to relocate to Los Angeles, California because, according to Yu, [SONG_NAME] there. The move was abruptly canceled as the band began to form. Bassist and friend Jesse Hayes became available when his punk rock band Time in Malta split up; then, in [MONTH], Yu and [PERSON_NAME_LAST_1] met guitarist [PERSON_NAME_FULL_0_MALE] through a [GENRE] band played its first gig in Los Angeles.\n",
      "The group released its first recording on [MONTH] 15, [YEAR], only seven months after having formed. According to Yu, the six-track EP Bed of Gold was recorded before [BAND_NAME] had [SONG_NAME] Nevertheless, the album received critical praise from The A.V. Club San Francisco, LA Weekly, and the East Bay Express. The group continued touring, performing alongside bands such as Morningwood, The Brian Jonestown Massacre, and Favourite Sons.\n"
   ]
}