{
   "Career": {
      "text": [
         "The group considers itself to have officially formed in January 2006, when its first lineup came together.[17] Vocalist Ann Yu and drummer/keyboardist David Farrell, who had previously played together in several bands, were preparing to relocate to Los Angeles, California because, according to Yu, \"it's a lot easier to find other musicians that are serious about making a career out of [music]\" there.[18] The move was abruptly canceled as the band began to form. Bassist and friend Jesse Hayes became available when his punk rock band Time in Malta split up;[17] then, in January, Yu and Farrell met guitarist Ted Parker through a Craigslist classified advertisement.[12][15] A few weeks later, the band played its first gig in Los Angeles.[18]\n",
         "The group released its first recording on August 15, 2006,[19] only seven months after having formed. According to Yu, the six-track EP Bed of Gold was recorded before LoveLikeFire had \"fully developed its identity as a band.\"[18] Nevertheless, the album received critical praise from The A.V. Club San Francisco,[13] LA Weekly,[16] and the East Bay Express.[6] The group continued touring, performing alongside bands such as Morningwood, The Brian Jonestown Massacre,[20] and Favourite Sons.[6]\n",
         "The band followed its debut album with the seven-track sophomore effort An Ocean in the Air, which was released on August 28, 2007.[21] The record brought further critical praise from publications such as Spin[11][12] and SF Weekly,[8] and made several best-of-2007 album or single lists, including associate producer Andrew Ross Rowe at MTV News[22] and Muhammad Asranur at Ground Control Mag.[23] The band recorded music videos for three of the album's tracks, \"Wish You Dead,\"[24] \"From a Tower,\"[25] and \"I Will\".[26] The latter, a carnival-themed music video shot on 16 mm film and produced by Thomas Barndt and Samara St. Croix (Tom and Samara), was chosen as an Official Selection of SXSW 2008 Film Festival.[7]\n",
         "Robert Kissinger replaced original bassist Jesse Hayes in mid-2007.[27][28][29] The group followed up the release of An Ocean in the Air with a self-organized and self-financed national tour.[3] In October 2008, Kissinger and guitarist Ted Parker were replaced by Eric Amerman and Marty Mattern, respectively.\n",
         "The band released a full-length album Tear Ourselves Away on August 10, 2009 on Heist Or Hit Records (The Answering Machine, Pomegranates) in the UK to some good press Two rough demos, \"Signs\" and \"William\", were released in May 2008 on the band's MySpace profile as an indication of \"songs we'll be working on for the full length\".[30] A single for the song \"William\" was released on April 6, 2009 in the UK. Following this the tracks Stand In Your Shoes and Boredom were released in the UK. The band have toured twice in the UK playing all over the country. The latest album was promoted on another nationwide tour.[31] The album was released in America in early 2010 [32] and promoted with a full tour.\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "References": {},
   "Sections": [
      "1 Career",
      "2 Style and influences",
      "3 Discography",
      "4 Side projects",
      "5 References",
      "6 External links"
   ],
   "Side projects": {
      "text": [
         "Ann Yu is in a band called Silver Swans with Jon Waters which released an album called Realize The Ghost in 2010 on San Francisco Independent Label, Tricycle Records.[40]\n"
      ]
   },
   "Style and influences": {
      "text": [
         "The band's style has been described as indie rock[1][33][34] as well as shoegazing,[6][8] Britpop,[6][17] power pop,[33] alternative rock,[6] indie pop,[35] and dream pop.[34] Ann Yu's singing style has invited comparisons to Bianca Leilani Casady (CocoRosie),[11] Beth Gibbons (Portishead),[11] Shirley Manson (Garbage),[36] Karen O (Yeah Yeah Yeahs),[11][36] Emily Haines (Metric),[13] Dolores O'Riordan (The Cranberries),[37] and PJ Harvey.[37]\n",
         "The band members' stated influences include Curve, Radiohead, Ride, Blonde Redhead, The Beatles, Siouxsie and the Banshees,[17] U2, Echo & the Bunnymen, New Order, My Bloody Valentine, and Arcade Fire.[15] Other suggestions of stylistic similarity have included Pixies (Bossanova and Trompe le Monde), The Cure,[38] Rilo Kiley,[33] Lush,[17][37] Echobelly,[17] Giant Drag, Land of Talk,[39] Muse,[8] The Stills, The National,[35] Pink Floyd, The Dandy Warhols, and Dinosaur Jr..[37]\n"
      ]
   },
   "Summary": {
      "text": [
         "LoveLikeFire is a San Francisco-based indie rock band. The group was formed in 2006 and whilst an unsigned artist they independently released two EPs, Bed of Gold (2006) and An Ocean in the Air (2007), as well as mounted a self-organized national tour to promote the latter release. The band then signed to Heist Or Hit Records and a full-length album was released in the UK in Autumn 2009. This album Tear Ourselves Away was released in the US in early 2010.[needs update] LoveLikeFire has received significant media and critical coverage in San Francisco Bay Area publications (San Francisco magazine,[5] East Bay Express,[6] SFist,[7] SF Weekly,[8] Palo Alto Daily News,[9] San Francisco Chronicle[10]) as well as in the national and out-of-town media (Spin,[11][12] The A.V. Club,[13] LimeWire Music Blog,[14] WOXY.com,[15] LA Weekly[16]), and has stylistically been identified as exhibiting Britpop, dream pop, indie pop, and shoegazing influences.\n"
      ]
   },
   "Title": "LoveLikeFire - Wikipedia"
}