{
   "Name": "Behold... The Arctopus",
   "rawData": [
      "Behold… The Arctopus is an American avant-garde metal band from Brooklyn, New York, formed in 2001.\n",
      "Behold The Arctopus was formed by Colin Marston and Mike Lerner, who had been playing guitar together for over a year-and-a-half by the time they found a drummer. Their demo We Need a Drummer (on which a drum machine was used) was picked up by drummer Charlie Zeleny. Zeleny met Lerner and Marston and impressed the duo. He was immediately asked to join the band.\n",
      "After releasing two EPs and a split, Behold The Arctopus released their first full-length, entitled Skullgrid, on October 16, 2007. The band went on tour with Genghis Tron and The Dillinger Escape Plan to support the album, but it was cut short by an injury of one of the members of The Dillinger Escape Plan. To help them recoup financial losses from that tour, Between the Buried and Me took the band on tour, supported by August Burns Red.\n"
   ],
   "infobox": {
      "Origin": [
         "Brooklyn, New York, United States"
      ],
      "Genres": [
         "Avant-garde metal, progressive metal, technical death metal[1]"
      ],
      "Years active": [
         "2001–present"
      ],
      "Labels": [
         "Black Market Activities"
      ],
      "Associated acts": [
         "Dysrhythmia, Gorguts, Indricothere, Byla, Infidel?/Castro!, Krallice, Blotted Science, Direwolf, The Flying Luttenbachers, Burmese, XBXRX"
      ],
      "Members": [
         "Mike Lerner",
         "Colin Marston",
         "Jason Bauers"
      ],
      "Past members": [
         "Charlie Zeleny, Weasel Walter"
      ]
   },
   "prunedData": [
      "Behold… The Arctopus is an [GENRE] band from Brooklyn, New York, formed in [YEAR].\n",
      "Behold The Arctopus was formed by Colin [MONTH]ston and Mike Lerner, who had been playing guitar together for over a [GENRE] a drummer. Their demo We Need a Drummer (on which a drum machine was used) was picked up by drummer [PERSON_NAME_FULL_0_MALE]. [PERSON_NAME_LAST_0] met Lerner and [MONTH]ston and impressed the duo. He was immediately asked to join the band.\n",
      "After releasing two EPs and a split, Behold The Arctopus released their first full-length, entitled Skullgrid, on [MONTH] 16, [YEAR]. The band went on tour with Genghis Tron and The Dillinger Escape Plan to support the album, but it was cut short by an injury of one of the members of The Dillinger Escape Plan. To help them recoup financial losses from that tour, Between the Buried and Me took the band on tour, supported by [MONTH] Burns Red.\n"
   ]
}