{
   "Name": "Behold... The Arctopus",
   "Sections": [
      "1 Biography",
      "2 Style",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 EPs",
      "3.3 Split releases",
      "3.4 Demos",
      "3.5 Videos",
      "4 Members",
      "4.1 Former Members",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Behold… The Arctopus is an American avant-garde metal band from Brooklyn, New York, formed in 2001.\n"
      ]
   },
   "Biography": {
      "text": [
         "Behold The Arctopus was formed by Colin Marston and Mike Lerner, who had been playing guitar together for over a year-and-a-half by the time they found a drummer. Their demo We Need a Drummer (on which a drum machine was used) was picked up by drummer Charlie Zeleny. Zeleny met Lerner and Marston and impressed the duo. He was immediately asked to join the band.[2]\n",
         "After releasing two EPs and a split, Behold The Arctopus released their first full-length, entitled Skullgrid, on October 16, 2007.[3] The band went on tour with Genghis Tron and The Dillinger Escape Plan to support the album, but it was cut short by an injury of one of the members of The Dillinger Escape Plan.[4] To help them recoup financial losses from that tour, Between the Buried and Me took the band on tour, supported by August Burns Red.\n",
         "On December 30, 2008 drummer Charlie Zeleny posted a statement on his MySpace page stating that after five years with Behold The Arctopus, he would be leaving the group to focus on his career as a session musician.[5] On November 25, 2009, Weasel Walter announced that he was moving to New York City to join the band on drums and will be writing \"new, more extreme material from scratch.\"[6]  The band made a brief announcement confirming it on December 16, 2009.[7]\n"
      ]
   },
   "Style": {
      "text": [
         "Behold The Arctopus play instrumental music inspired by both metal and 20th century classical music. This technical and progressive style is executed on a regular electric guitar and drum kit but involves a 12-string Warr guitar, an instrument that covers the range of a bass and guitar and is generally played by tapping with either one or two hands.[2] Their music often includes dissonance, and polyrhythms.\n",
         "Influences on their music range from Heavy metal, Progressive Metal to Technical Death Metal, amongst other genres. Influential heavy metal bands include Ulver, Death, Neurosis, Darkthrone, Meshuggah, Atheist, Voivod and Gorguts. Composers Béla Bartók, Luciano Berio, Arnold Schoenberg, and Krzysztof Penderecki have all influenced the band.\n",
         "Marston has explained the Behold The Arctopus' recording process in an interview: \"The songs written by one member were all scored out on paper and learned by the band. The first couple songs only had a few notated parts, the majority being written on the instrument and never written down. The trend has definitely been going more towards writing everything out.\"[8]\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "EPs": {},
      "Split releases": {},
      "Demos": {},
      "Videos": {}
   },
   "Members": {
      "Former Members": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Behold… The Arctopus is an American avant-garde metal band from Brooklyn, New York, formed in 2001.\n",
      "Behold The Arctopus was formed by Colin Marston and Mike Lerner, who had been playing guitar together for over a year-and-a-half by the time they found a drummer. Their demo We Need a Drummer (on which a drum machine was used) was picked up by drummer Charlie Zeleny. Zeleny met Lerner and Marston and impressed the duo. He was immediately asked to join the band.[2]\n",
      "After releasing two EPs and a split, Behold The Arctopus released their first full-length, entitled Skullgrid, on October 16, 2007.[3] The band went on tour with Genghis Tron and The Dillinger Escape Plan to support the album, but it was cut short by an injury of one of the members of The Dillinger Escape Plan.[4] To help them recoup financial losses from that tour, Between the Buried and Me took the band on tour, supported by August Burns Red.\n",
      "On December 30, 2008 drummer Charlie Zeleny posted a statement on his MySpace page stating that after five years with Behold The Arctopus, he would be leaving the group to focus on his career as a session musician.[5] On November 25, 2009, Weasel Walter announced that he was moving to New York City to join the band on drums and will be writing \"new, more extreme material from scratch.\"[6]  The band made a brief announcement confirming it on December 16, 2009.[7]\n"
   ]
}