{
   "Name": "The Bel-Airs",
   "rawData": [
      "The Bel-Airs were an early and influential surf rock band from South Bay, Los Angeles, active in the early 1960s.\n",
      "They were best known for their 1961 hit \"Mr. Moto\", an instrumental surf rock song that featured a flamenco-inspired intro and contained a melodic piano interlude. The song's theme was used in the solo for the song \"Seed\" by Sublime.\n",
      "Upon splitting up, guitarist Eddie Bertrand formed Eddie & the Showmen in 1964, while guitarist Paul Johnson later joined Cat Mother & the All Night Newsboys in 1970.  Original Bel-Airs drummer Dick Dodd joined Bertrand in Eddie & the Showmen, and later joined the Standells, playing drums and singing lead on their major 1966 hit, \"Dirty Water\". Richard Delvy replaced Dick Dodd on drums, Randy Nauert replaced Steve Lotto on bass, and Art Fisher replaced Eddie Bertrand on guitar. Delvy, Fisher Nauert and Roberts went on to found the surf group The Challengers. \n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles County, California, United States"
      ],
      "Genres": [
         "Surf rock"
      ],
      "Years active": [
         "1961 (1961)–1963 (1963)",
         "(1986 reunion)"
      ],
      "Labels": [
         "Arvee"
      ],
      "Associated acts": [
         "The Challengers, Eddie & the Showmen"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] were an [GENRE] band from South Bay, Los Angeles, active in the early [YEAR]s.\n",
      "They were best known for their [YEAR] hit [SONG_NAME] by Sublime.\n",
      "Upon splitting up, guitarist [PERSON_NAME_FULL_2_MALE] formed [PERSON_NAME_FIRST_2] & the Showmen in [YEAR], while guitarist Paul Johnson later joined [PERSON_NAME_FULL_1_MALE] & the All Night Newsboys in [YEAR].  Original Bel-Airs drummer Dick Dodd joined [PERSON_NAME_LAST_2] in [PERSON_NAME_FIRST_2] & the Showmen, and later joined the Standells, playing drums and singing lead on their major [YEAR] hit, [SONG_NAME]. [PERSON_NAME_FULL_0_MALE] replaced Dick Dodd on drums, Randy Nauert replaced [PERSON_NAME_FULL_3_MALE] on bass, and Art Fisher replaced [PERSON_NAME_FULL_2_MALE] on guitar. [PERSON_NAME_LAST_0], Fisher Nauert and Roberts went on to found the surf group The Challengers. \n"
   ]
}