{
   "Name": "The Black Mages",
   "rawData": [
      "The Black Mages were a Japanese instrumental rock band formed in 2002 by Nobuo Uematsu, Kenichiro Fukui and Tsuyoshi Sekito, who were three video game composers for Square and Square Enix. The band arranged Uematsu's Final Fantasy video game series-based compositions in a hard rock style often similar to progressive metal, achieved with the additional use of synthesizers. Since its inception, the band had expanded to six members with the addition of Keiji Kawamori, Michio Okamiya and Arata Hanyuda. In August 2010, Uematsu announced the band had been disbanded, but he would continue to perform rock arrangements of his music as a part of another similar band, known as the Earthbound Papas.\n",
      "The band released three studio albums. Their first was released eponymously as The Black Mages in 2003, and contained arrangements of Final Fantasy battle themes. The second album, The Black Mages II: The Skies Above, was released in 2004 and featured additional pieces besides battle themes including the group's first original song, \"Blue Blast ~Winning the Rainbow\", which was created for Japanese K-1 fighter Takehiro Murahama. The third album, The Black Mages III: Darkness and Starlight, was released in 2008. Music from the group has also appeared in other albums, including one track in Dark Chronicle Premium Arrange, an album of arranged music from the video game Dark Chronicle, a piece in the animated film Final Fantasy VII Advent Children and its corresponding soundtrack album, and one track on Final Fantasy III Original Soundtrack, the soundtrack album for the Nintendo DS version of Final Fantasy III.\n",
      "The Black Mages did not tour as a band, but performed several concerts to promote their album releases. For their first album they performed in Shibuya and Kanagawa, Japan in 2003 and later released a live video of the first concert on DVD exclusively to Uematsu fanclub members. They repeated this for the release of their second album, performing in Kawasaki and Osaka, Japan in 2005 and similarly released on DVD to fanclub members. The third album saw a performance in Yokohama, Japan in 2008; a DVD of the show was released commercially in March 2009. In addition to these concerts, The Black Mages made live appearances at two Final Fantasy concerts, More Friends: Music from Final Fantasy and Voices - Music from Final Fantasy, as well as another video game music event, Extra: Hyper Game Music Event 2007.\n"
   ],
   "infobox": {
      "Origin": [
         "Tokyo, Japan"
      ],
      "Genres": [
         "Instrumental rock",
         "hard rock",
         "progressive metal",
         "symphonic rock"
      ],
      "Years active": [
         "2002–2010"
      ],
      "Labels": [
         "Square Enix Music",
         "Dog Ear Records"
      ],
      "Associated acts": [
         "Earthbound Papas"
      ],
      "Past members": [
         "Nobuo Uematsu",
         "Kenichiro Fukui",
         "Tsuyoshi Sekito",
         "Keiji Kawamori",
         "Arata Hanyuda",
         "Michio Okamiya"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] were a [GENRE] band formed in [YEAR] by [PERSON_NAME_FULL_5_MALE], [PERSON_NAME_FULL_3_MALE] and [PERSON_NAME_FULL_4_MALE], who were three video game composers for Square and Square Enix. The band arranged [PERSON_NAME_LAST_5]'s Final Fantasy video game series-based compositions in a hard rock style often similar to progressive metal, achieved with the additional use of synthesizers. Since its inception, the band had expanded to six members with the addition of [PERSON_NAME_FULL_1_MALE], [PERSON_NAME_FULL_2_MALE] and [PERSON_NAME_FULL_0_FEMALE]. In [MONTH] [YEAR], [PERSON_NAME_LAST_5] announced the band had been disbanded, but he would continue to perform rock arrangements of his music as a part of another similar band, known as the Earthbound Papas.\n",
      "The band released three studio albums. Their first was released eponymously as [BAND_NAME] in [YEAR], and contained arrangements of Final Fantasy battle themes. The second album, [BAND_NAME] II: The Skies Above, was released in [YEAR] and featured additional pieces besides battle themes including the group's first original song, [SONG_NAME], which was created for Japanese K-1 fighter [PERSON_NAME_FULL_0_MALE]. The third album, [BAND_NAME] III: Darkness and Starlight, was released in [YEAR]. Music from the group has also appeared in other albums, including one track in Dark Chronicle Premium Arrange, an [GENRE] a piece in the animated film Final Fantasy VII Advent Children and its corresponding soundtrack album, and one track on Final Fantasy III Original Soundtrack, the soundtrack album for the Nintendo DS version of Final Fantasy III.\n",
      "[BAND_NAME] did not tour as a band, but performed several concerts to promote their album releases. For their first album they performed in Shibuya and Kanagawa, Japan in [YEAR] and later released a live video of the first concert on DVD exclusively to Uematsu fanclub members. They repeated this for the release of their second album, performing in Kawasaki and Osaka, Japan in [YEAR] and similarly released on DVD to fanclub members. The third album saw a performance in Yokohama, Japan in [YEAR]; a DVD of the show was released commercially in [MONTH] [YEAR]. In addition to these concerts, [BAND_NAME] made live appearances at two Final Fantasy concerts, More Friends: Music from Final Fantasy and Voices - Music from Final Fantasy, as well as another video game music event, Extra: Hyper Game Music Event [YEAR].\n"
   ]
}