{
   "Name": "Bongripper",
   "rawData": [
      "Bongripper is an American doom metal band from Chicago, Illinois, United States.\n",
      "Bongripper began in 2006 with the self-release of their first album titled The Great Barrier Reefer, which is composed of a single 79-minute piece created with the intention of being longer than Sleep's Dopesmoker. In 2007, the band self-released their second studio album titled Hippie Killer and their third studio album titled Heroin. In 2008, the band self-released its fourth studio album titled Hate Ashbury and a collaborative EP with Winters in Osaka.  This was followed by the band self releasing their album Satan Worshipping Doom in 2010.\n",
      "In 2013, Bongripper released two split EPs via Great Barrier Records; one with Hate and another one with Conan.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, United States"
      ],
      "Genres": [
         "Doom metal",
         "stoner metal",
         "drone metal (early)[1]"
      ],
      "Years active": [
         "2005 (2005)–present"
      ],
      "Labels": [
         "Great Barrier Records"
      ],
      "Website": [
         "www.bongripper.com"
      ],
      "Members": [
         "Ronald Petzke",
         "Daniel O'Connor",
         "Nick Dellacroce",
         "Dennis Pleckham"
      ],
      "Past members": [
         "Robert Scott"
      ]
   },
   "albums": [
      "The Great Barrier Reefer"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Chicago, Illinois, United States.\n",
      "[BAND_NAME] began in [YEAR] with the self-release of their first album titled The Great Barrier Reefer, which is composed of a single 79-minute piece created with the intention of being longer than Sleep's Dopesmoker. In [YEAR], the band self-released their second studio album titled Hippie Killer and their third studio album titled Heroin. In [YEAR], the band self-released its fourth studio album titled Hate Ashbury and a collaborative EP with Winters in Osaka.  This was followed by the band self releasing their album Satan Worshipping Doom in [YEAR].\n",
      "In [YEAR], [BAND_NAME] released two split EPs via Great Barrier Records; one with Hate and another one with Conan.\n"
   ]
}