{
   "Name": "Break of Reality",
   "rawData": [
      "Break of Reality (BoR) is an American cello rock band consisting of three cellists and a percussionist.  The group is associated with the terms \"cinematic rock\", \"cello rock\", and \"indie classical\". Break of Reality's current members are Patrick Laird, Ivan Trevino, Laura Metcalf, and Adrian Daurov. The band's sound consists of many musical influences, such as rock, classical, and indie rock.\n",
      "The group was formed while the original members were freshmen at the Eastman School of Music in Rochester, NY.  At the time of its formation, the band consisted of four cellists.  The band gave their first formal concert in a small classical venue at Eastman, where they received complaints for being too loud.\n",
      "In 2006, the band released \"The Sound Between\", a double disc album featuring both electric and acoustic songs. After all graduating from Eastman, the group collectively moved to NYC in 2007, where they developed a fan base through busking in Central Park.  The band split a year later, leaving Laird and Trevino as the remaining members.\n"
   ],
   "infobox": {
      "Origin": [
         "Rochester, New York"
      ],
      "Genres": [
         "Cello rock, Cinematic Rock, chamber music"
      ],
      "Years active": [
         "2003–present"
      ],
      "Labels": [
         "Independent"
      ],
      "Website": [
         "breakofreality.com"
      ],
      "Members": [
         "Patrick Laird",
         "Ivan Trevino",
         "Laura Metcalf",
         "Ben Capps",
         "Meta Weiss"
      ],
      "Past members": [
         "Philip Borter",
         "Erin Keesecker",
         "Jeff Hood",
         "Andrew Janss",
         "Brook Speltz",
         "Tavi Ungerleider",
         "Cecily Parnas"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (BoR) is an [GENRE] band consisting of three cellists and a percussionist.  The group is associated with the terms \"cinematic rock\", \"cello rock\", and \"indie classical\". [BAND_NAME]'s current members are Patrick Laird, [PERSON_NAME_FULL_0_MALE], [PERSON_NAME_FULL_1_FEMALE], and Adrian Daurov. The band's sound consists of many musical influences, such as rock, classical, and indie rock.\n",
      "The group was formed while the original members were freshmen at the Eastman School of Music in Rochester, NY.  At the time of its formation, the band consisted of four cellists.  The band gave their first formal concert in a [GENRE]",
      "In [YEAR], the band released \"The Sound Between\", a double disc album featuring both electric and acoustic songs. After all graduating from Eastman, the group collectively moved to NYC in [YEAR], where they developed a fan base through busking in Central Park.  The band split a year later, leaving Laird and Trevino as the remaining members.\n"
   ]
}