{
   "Name": "Caspian (band)",
   "Sections": [
      "1 History",
      "1.1 Early history: 2003–2004",
      "1.2 You Are The Conductor: 2005–2006",
      "1.3 The Four Trees: 2007–2008",
      "1.4 Tertia: 2009–2011",
      "1.5 Waking Season: 2011–2014",
      "1.6 Dust and Disquiet: 2015–2017",
      "1.7 Touring and On Circles: 2018-present",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 Other releases",
      "3 Members",
      "4 See also",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Caspian is an American post-rock band from Beverly, Massachusetts, United States.\n"
      ]
   },
   "History": {
      "Early history: 2003–2004": {
         "text": [
            "Caspian loosely formed in Autumn of 2003 in Beverly, Massachusetts,[1] developing material through the first year of its existence, recording a demo in May 2004 and performing a small number of shows in late 2004 and early 2005, including support for the Japanese post-rock band Mono.[2] The band's first performance took place at The Pickled Onion in Beverly, Massachusetts on August 26, 2004. At the time the band had not yet chosen the name Caspian and was looking for a vocalist.\n"
         ]
      },
      "You Are The Conductor: 2005–2006": {
         "text": [
            "In January 2005, the band signed with Dopamine Records, releasing a debut EP, You Are the Conductor in November 2005.[3] This was followed, in January 2006, with the band's first tour of the Northeast comprising four dates in New York, D.C. and Pittsburgh. In April and May 2006, the band embarked on its first full tour of the US, reaching to the west coast and back. A hand pressed, limited edition tour EP was released by the band in September 2006 on their second full tour of the United States.\n"
         ]
      },
      "The Four Trees: 2007–2008": {
         "text": [
            "Over the course of 2006, the band developed material for a debut album, recording with Ethan Dussault again in August 2006 in Cambridge, Massachusetts at the newly renovated New Alliance Audio. Released on Dopamine Records on April 10, 2007, their debut album, The Four Trees, continued their positive exposure to a growing underground of Post-Rock fans. The album was re-released in Europe by Make My Day Records in July 2008. Later that year, they recorded a split 7-inch with fellow Massachusetts band Constants.\n",
            "Once again Caspian embarked on a three-month-long coast to coast tour of the United States to support the release. After learning that founding member, guitarist Calvin Joss, could no longer fulfill touring duties, Erin Burke-Moran of The Fly-Agaris Sky, was initially recruited to tour in place of Joss, but became a full-time member immediately following their 2007 Spring U.S. Tour.[4] Joss remains an active member of the band[when?] and will perform live with the band when scheduling permits.[citation needed]\n"
         ]
      },
      "Tertia: 2009–2011": {
         "text": [
            "Now officially a 5 piece band, Caspian released a follow-up to their debut called Tertia in Europe on 7 August 2009 and in the US on 15 September 2009.[5] Caspian once again recorded the album in February 2007 at New Alliance Audio with Ethan Dussault. \n",
            "To tour the album upon its release, Caspian enlisted Washington DC area guitarist, Jonny Ashburn, and Austin, TX bassist, Jon McMahan to assist. \"Tertia\" was supported by two massive European tours (Fall of 2009 and Spring 2010) and a two-month North American tour (March/April 2010) that included opening for Red Sparowes and Fang Island. In July 2010 the band played their first ever shows in China. The two-date \"Asian Tour\" was July 16 at the Hidden Agenda Live House and the second was on July 17 in Guangzhou, as part of the Qiangyuan Music Festival. The band toured the U.S. in September and October with their October 22 show at the Old South Church in Boston. The show was recorded, and highlights were released on an EP titled Live at the Old South Church in January 2012. The tour continued to Europe in November and December playing support with God is an Astronaut.In 2010 alone the band performed close to 150 concerts in 33 countries on 3 continents. The band played their final concert of 2010 at the Middle East Downstairs in Cambridge as part of the \"Last Night on Earth\", the eighth of the series, with Constants, Irepress and Moving Mountains.\n"
         ]
      },
      "Waking Season: 2011–2014": {
         "text": [
            "In a band blog update in early January 2011[citation needed] the band said that most of their time over the next year would be spent writing and recording their 3rd full-length album. They performed at the 2011 SXSW Music Festival in Austin, Texas and played an 8-day European tour in April 2011 visiting Russia, Germany, Poland, and the Netherlands including a headline performance at the Dunk! Festival in Zottegem, Belgium.\n",
            "During the summer of 2011, Caspian refrained from live performances and focused exclusively on writing new material. The band enlisted the services of Matt Bayles to co-produce, engineer, and mix the record, which was recorded at Q Division Studios in Somerville, MA in January 2012 for 3 weeks. Additional recording and production occurred in February 2012 at Radar Studios in Clinton, CT. The album was mixed at Red Room Studios in Seattle by Matt Bayles with the band for 10 days in May, 2012. On July 9, 2012, the band announced that the album title would be Waking Season. The release date was later confirmed to be September 21, 2012, sold via Triple Crown Records.[6] A week before the album's U.S. release Spin.com posted a full stream of the album and called it \"The Post Rock Album of the Year\".\n",
            "The band played a few shows before starting a 16-show-run in support of Minus the Bear and Cursive. Upon completion of that string of dates, Caspian headed to Europe touring from October 10, through November 20, and completed a full U.S. headline tour in February and March 2013 with support from Junius and Native.\n",
            "On May 26 the band opened up day two of the first Boston Calling Music Festival at the Boston City Hall Plaza.\nThe band played a short and spirited set and it also marked the first time the band played with six members on stage. The band followed up the outdoor show with a free concert in Beverly on July 13.\n",
            "On August 28, 2013, the band announced via Facebook that bassist Chris Friedrich had died. He was 32 years old.[7]\n",
            "For much of the month of October 2013 the band supported HIM on a European tour. They subsequently returned to the U.S. for a string of dates with 65daysofstatic as co-headliners.\n",
            "During this tour the band announced the release of a new EP, entitled Hymn For The Greatest Generation, containing three new songs, as well as a demo and two remixes of songs from Waking Season. Pitchfork began to stream the title track on October 9, 2013, prior to the EP's release on November 11, 2013. \"Hymn For The Greatest Generation\" was the final recording on which bassist Chris Friedrich appeared, though it was released after his death.\n",
            "The album Waking Season was later given an Australia and New Zealand release through Hobbledehoy Record Co. in January 2014.[8]\n",
            "In March 2014 the band did two shows before departing for a tour of Asia and Australia. The 14-show-tour had the band playing shows in the Philippines, Singapore, six shows in China, Taiwan, and a five shows in Australia.\n"
         ]
      },
      "Dust and Disquiet: 2015–2017": {
         "text": [
            "In June 2015, Caspian released a 10th anniversary concert film, Live From the Larcom, recorded at the historic Larcom Theatre in their hometown of Beverly, Massachusetts in October 2014. The release was followed by a free screening of the film at the Cabot Theater.\n",
            "The band began work on their fourth LP in March and April, and began hosting \"listening parties\" where paying fans were given iPods loaded with tracks from the album and invited to listen and discuss the record. The band also hosted additional parties in Europe in April and May 2015. On June 26, Noisey premiered the first single, \"Sad Heart of Mine\", off the upcoming record, titled Dust & Disquiet.[9] On September 13, 2015, the band appeared on \"Boston Emissions\", a radio program airing on WZLX. All six members were in studio for the interview and a number of the new songs were played from the forthcoming record. Dust & Disquiet was released worldwide on September 25, 2015. Along with the single, the band announced U.S. and Canada tour dates for the fall, 2015. The album was the first from the band to include vocals.[10]\n",
            "By the end of the first four months of 2016 the band had played over 50 shows. In February the band did a U.S. tour with Defeater, after which they headed to Asia, where they performed a dozen total shows in China, Taiwan and the band's first-ever shows in Japan. Once back in the U.S. the band headed out on tour in support of Underoath. The tour opened in Houston on March 21 and concluded in Orlando Florida on April 24, with 29 total shows played.\n",
            "After much of the summer was taken for personal time the band headed back to Europe in mid August and played a series of headlining dates and appeared at 5 different festivals. On October 20 the band released a short film that was accompanied by a new song \"Castles High, Marble Bright\". The track made its first live appearance almost two years to the day prior. The band, when doing their 10th Anniversary show at the Larcom Theater, closed the show with this track, which some fans took to calling \"Joy\". Alongside the video the band announced its plan to release the track via \"8 Inch\" and it would be sold on their tour as well as available online both digitally and in physical form. On October 22 the band hit the road in North America once more. The 22 date tour started in Washington DC at the Rock and Roll Hotel and ended on November 19 a Bar Le Ritz, in Montreal, Canada. All shows featured The Appleseed Cast. On the November 1, 2016, stop of the tour the band was recorded performing live at the Teragram Ballroom in Los Angeles to be later featured on Last Call with Carson Daly. The segment aired on November 15 in the U.S. and it featured \"Sad Heart of Mine\" as well as a shortened version of \"Arcs of Command\" in the latter part of the program. This was the band's first appearance on late night television. The band appeared for a second time on the show in February 2017. Recorded at the same venue the second airing of the show had an abridged performance of \"Castles High, Marble Bright\".\n",
            "On 18, February 2017 the band played their first show in Mexico. The band was part of the \"Forever Alone Festival\" that took place at Foro Indie Rocks in Mexico City. Other bands on the bill included This Will Destroy You Ttng, The Polar Dream, Mylets and many more. The band was then slated to support Katatonia on their 28-city-tour. The tour opened in Washington D.C. on March 16, and concluded on April 22 when both bands appeared at the New England Metal and Hardcore Festival in Worcester MA. No sooner did the band complete the tour with Katatonia when they played two additional shows in China. April 29 the band played the Strawberry Festival in Shanghai and then Beijing for a headline show at Modernsky Lab on May 1.\n"
         ]
      },
      "Touring and On Circles: 2018-present": {
         "text": [
            "In March 2018, via social media, the band posted a shot of them in the studio. There was no indication given as to the potential release of any of the material.\n",
            "The band headed to Europe for a brief tour that included a performance at DunkFest in Zottegem. The band then played two shows at Saint Vitus in New York City as part of the Northside Festival. At the time it was slated to be the only U.S. shows for 2018 so the band celebrated by performing Dust and Disquiet in full on the June 8, their second night.\n",
            "The band supported Minus the Bear from 9 October to 28 October 2018, for a total of 18 shows.\n",
            "In May 2019, the band announced they were headed to the studio to record their next record. In a social media post the band indicated they would be in studio for the month. The initial recording was completed in late-May 2019.\n",
            "On June 11, 2019, the band formally announced that a longtime friend and collaborator, Justin Forrest, was the new drummer for the band. Forrest had been touring with the band since 2018 and was also the drummer while the band was in the studio over the prior month. In the same post the band also acknowledged that the split with former drummer Joe Vickers was amicable.[citation needed]\n",
            "On November 16, 2019, the band performed two shows (matinee and evening) show with the Losander Chamber Orchestra. The event was held at the Cabot Theater in Beverly Massachusetts.  The orchestra was made up of string, brass and woodwind instruments and they accompanied the band on many of the songs.  The event featured never before heard songs as well as Caspian classics. Burke-Moran was responsible for much of the sheet music used by the Orchestra and would even put his guitar down on a few occasions during the event to \"conduct\".\n",
            "On Circles was released January 24, 2020.[11]\n",
            "On March 25, 2020, many of the band members were involved with a Q+A on Reddit and handled well over 250 unique questions. With touring plans on hold and self quarantine due to COVID-19 many of the band members took to social media for chats and online lessons with fan interaction. Phil Jamieson explained \"Circles on Circles\" a few days later Calvin Joss worked through (Hymn for) The Greatest Generation, Jonny Ashburn did Rioseco and finally Erin Burke Moran worked Arcs of Command\n",
            "Pairing up with Audiotree, who had filmed the Cabot Theater show, the band did a 24 hour \"ticketed\" stream of the show on 30 September 2020. Fans that bought \"virtual tickets\" were provided a code and a 24 hour window to watch the show as often as they'd like. Prior to the first airing (and during) Jamieson, Ashburn and Zubkov were all part of the live chat with fans. The band wanted the event to \"Feel like an actual concert\" have said there is no plan to release the show other than this one off event.  The following day Jamieson and Burke-Moran did an Instragram Live session to further engage fans.\n",
            "The band announced that a European tour was slated for October 2021.  Caspian along with Holy Fawn are slated to support Cult of Luna on 14 of 15 shows.\nThe album \"On Circles\" was nominated for the \"Best Recording Package\" Grammy Award. Jordan Butcher was the art director for the album.  Other artists nominated in the category are Coldplay and Lil Wayne.  The awards ceremony was slated for 31, January 2021 but has been pushed to March. This is typically not a televised award.\n"
         ]
      }
   },
   "Discography": {
      "Studio albums": {},
      "Other releases": {}
   },
   "Members": {},
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Caspian is an American post-rock band from Beverly, Massachusetts, United States.\n",
      "Caspian loosely formed in Autumn of 2003 in Beverly, Massachusetts,[1] developing material through the first year of its existence, recording a demo in May 2004 and performing a small number of shows in late 2004 and early 2005, including support for the Japanese post-rock band Mono.[2] The band's first performance took place at The Pickled Onion in Beverly, Massachusetts on August 26, 2004. At the time the band had not yet chosen the name Caspian and was looking for a vocalist.\n",
      "In January 2005, the band signed with Dopamine Records, releasing a debut EP, You Are the Conductor in November 2005.[3] This was followed, in January 2006, with the band's first tour of the Northeast comprising four dates in New York, D.C. and Pittsburgh. In April and May 2006, the band embarked on its first full tour of the US, reaching to the west coast and back. A hand pressed, limited edition tour EP was released by the band in September 2006 on their second full tour of the United States.\n",
      "Over the course of 2006, the band developed material for a debut album, recording with Ethan Dussault again in August 2006 in Cambridge, Massachusetts at the newly renovated New Alliance Audio. Released on Dopamine Records on April 10, 2007, their debut album, The Four Trees, continued their positive exposure to a growing underground of Post-Rock fans. The album was re-released in Europe by Make My Day Records in July 2008. Later that year, they recorded a split 7-inch with fellow Massachusetts band Constants.\n"
   ],
   "infobox": {
      "Origin": [
         "Beverly, Massachusetts, United States"
      ],
      "Genres": [
         "Post-rock, instrumental rock, post-metal"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Dopamine, Radar, The Mylene Sheath, Make My Day Records, Triple Crown Records, Hobbledehoy Record Co., Big Scary Monsters"
      ],
      "Website": [
         "caspianmusic.net"
      ],
      "Members": [
         "Philip Jamieson",
         "Calvin Joss",
         "Justin Forrest",
         "Erin Burke-Moran",
         "Jonny Ashburn",
         "Jani Zubkovs"
      ],
      "Past members": [
         "Chris Friedrich",
         "Jon McMahan",
         "Joe Vickers"
      ]
   }
}