{
   "Name": "Caspian (band)",
   "rawData": [
      "Caspian is an American post-rock band from Beverly, Massachusetts, United States.\n",
      "Caspian loosely formed in Autumn of 2003 in Beverly, Massachusetts, developing material through the first year of its existence, recording a demo in May 2004 and performing a small number of shows in late 2004 and early 2005, including support for the Japanese post-rock band Mono. The band's first performance took place at The Pickled Onion in Beverly, Massachusetts on August 26, 2004. At the time the band had not yet chosen the name Caspian and was looking for a vocalist.\n",
      "In January 2005, the band signed with Dopamine Records, releasing a debut EP, You Are the Conductor in November 2005. This was followed, in January 2006, with the band's first tour of the Northeast comprising four dates in New York, D.C. and Pittsburgh. In April and May 2006, the band embarked on its first full tour of the US, reaching to the west coast and back. A hand pressed, limited edition tour EP was released by the band in September 2006 on their second full tour of the United States.\n"
   ],
   "infobox": {
      "Origin": [
         "Beverly, Massachusetts, United States"
      ],
      "Genres": [
         "Post-rock, instrumental rock, post-metal"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Dopamine, Radar, The Mylene Sheath, Make My Day Records, Triple Crown Records, Hobbledehoy Record Co., Big Scary Monsters"
      ],
      "Website": [
         "caspianmusic.net"
      ],
      "Members": [
         "Philip Jamieson",
         "Calvin Joss",
         "Justin Forrest",
         "Erin Burke-Moran",
         "Jonny Ashburn",
         "Jani Zubkovs"
      ],
      "Past members": [
         "Chris Friedrich",
         "Jon McMahan",
         "Joe Vickers"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Beverly, Massachusetts, United States.\n",
      "[BAND_NAME] loosely formed in Autumn of [YEAR] in Beverly, Massachusetts, developing material through the first year of its existence, recording a demo in [MONTH] [YEAR] and performing a small number of shows in late [YEAR] and early [YEAR], including support for the Japanese post-rock band Mono. The band's first performance took place at The Pickled Onion in Beverly, Massachusetts on [MONTH] 26, [YEAR]. At the time the band had not yet chosen the name [BAND_NAME] and was looking for a vocalist.\n",
      "In [MONTH] [YEAR], the band signed with Dopamine Records, releasing a debut EP, You Are the Conductor in [MONTH] [YEAR]. This was followed, in [MONTH] [YEAR], with the band's first tour of the Northeast comprising four dates in New York, D.C. and Pittsburgh. In [MONTH] and [MONTH] [YEAR], the band embarked on its first full tour of the US, reaching to the west coast and back. A hand pressed, limited edition tour EP was released by the band in [MONTH] [YEAR] on their second full tour of the United States.\n"
   ]
}