{
   "Name": "The Champs",
   "Sections": [
      "1 Band members",
      "2 Singles",
      "3 See also",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Champs were an American rock and roll band, most famous for their Latin-tinged instrumental \"Tequila\".[1] The group took their name from the name of Gene Autry's horse, Champion,[1] and was formed by studio executives at Autry's Challenge Records[2] to record a B-side for the Dave Burgess single, \"Train to Nowhere\". The intended throwaway track became more famous than its A-side, as \"Tequila\" went to No. 1 in just three weeks,[1] and the band became the first group to go to the top spot with an instrumental that was their first release.[3] The song was recorded at Gold Star Studios in fall 1957, and in 1959 won the Grammy Award for Best R&B Performance.[4] It sold over one million copies, and was awarded a gold disc by the RIAA.[5]\n",
         "\"Tequila\" was written by the saxophonist Danny Flores, although he was credited as Chuck Rio because he was under contract to another record label (RPM Records) at the time.[1] Flores, who died in September 2006, was known as the \"Godfather of Latino rock.\"[3] Flores' \"dirty sax\" and his low-voiced \"Tequila\" are the hallmarks of the song.[6] Flores signed away the US rights to the song but retained worldwide rights until his death.[7]\n",
         "There are many cover versions of the tune, including a jazz version by guitarist Wes Montgomery in 1966. It has also been recorded by rappers A.L.T. and XL Singleton. The Champs also had success with instrumentals such as \"Limbo Rock\" and \"El Rancho Rock\". In 1985, \"Tequila\" featured prominently in the film Pee Wee's Big Adventure.\n",
         "The Champs also recorded a sequel to \"Tequila\" entitled \"Too Much Tequila\".\n",
         "In 2020, group leader Dave Burgess resurrected The Champs for a new album, \"Tequila Party\", scheduled for November release.  The LP contains 12 newly recorded tracks including a raucous \"party\" rendition of their signature hit plus seven new Burgess compositions.  Prolific songwriter Burgess, who has in excess of 700 copyrights registered with BMI, wrote or co-wrote 14 songs on The Champs' first two Challenge Records LPs.  \"Tequila Party\" is available at www.TheChampsOfficial.com.\n"
      ]
   },
   "Band members": {
      "text": [
         "Dave \"Snuffy\" Smith played bass from late 1959 to 1960. Other members at this time were Jimmy Seals, Dash Crofts, Johnny Meeks, and Dave Burgess.[8]\nLater band members included Glen Campbell,[9] Jerry Cole, Chuck Downs (drums), Rich Grissom, Johnny Meeks (of Gene Vincent and the Blue Caps, guitar), Gary Nieland (drums), Jerry Puckett (guitar), Marvin Siders, and Leon Sanders. The last lineup of the band prior to the 2020 revival, in 1964,[1] included Johnny Trombatore, who co-wrote some songs with Jim Seals, Dash Crofts, Maurice Marshall, bassist Curtis Paul and Seals' replacement on saxophone, Keith MacKendrick.\n"
      ]
   },
   "Singles": {},
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Champs were an American rock and roll band, most famous for their Latin-tinged instrumental \"Tequila\".[1] The group took their name from the name of Gene Autry's horse, Champion,[1] and was formed by studio executives at Autry's Challenge Records[2] to record a B-side for the Dave Burgess single, \"Train to Nowhere\". The intended throwaway track became more famous than its A-side, as \"Tequila\" went to No. 1 in just three weeks,[1] and the band became the first group to go to the top spot with an instrumental that was their first release.[3] The song was recorded at Gold Star Studios in fall 1957, and in 1959 won the Grammy Award for Best R&B Performance.[4] It sold over one million copies, and was awarded a gold disc by the RIAA.[5]\n",
      "\"Tequila\" was written by the saxophonist Danny Flores, although he was credited as Chuck Rio because he was under contract to another record label (RPM Records) at the time.[1] Flores, who died in September 2006, was known as the \"Godfather of Latino rock.\"[3] Flores' \"dirty sax\" and his low-voiced \"Tequila\" are the hallmarks of the song.[6] Flores signed away the US rights to the song but retained worldwide rights until his death.[7]\n",
      "There are many cover versions of the tune, including a jazz version by guitarist Wes Montgomery in 1966. It has also been recorded by rappers A.L.T. and XL Singleton. The Champs also had success with instrumentals such as \"Limbo Rock\" and \"El Rancho Rock\". In 1985, \"Tequila\" featured prominently in the film Pee Wee's Big Adventure.\n",
      "The Champs also recorded a sequel to \"Tequila\" entitled \"Too Much Tequila\".\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Rock and roll, Chicano rock, Tex-Mex"
      ],
      "Years active": [
         "1957–1965, 2020"
      ],
      "Labels": [
         "Challenge, London, Apex (Canada), Gold Star Studios"
      ],
      "Past members": [
         "Danny Flores",
         "Dave Burgess"
      ]
   }
}