{
   "Discography": {
      "EPs": {},
      "Home videos": {},
      "Studio albums": {}
   },
   "External links": {},
   "Line-up": {
      "Current members": {},
      "Former members": {},
      "Touring members": {}
   },
   "Mordred": {},
   "References": {},
   "Sections": [
      "1 Mordred",
      "2 Line-up",
      "2.1 Current members",
      "2.2 Former members",
      "2.3 Touring members",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 EPs",
      "3.3 Home videos",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Mordred is an American groove metal/thrash metal band based in the San Francisco Bay Area. They released three studio albums and one EP from 1989 to 1994.[1] In this five-year span, they showed an interesting inventiveness in the wake of fusion genre. Fool's Game (1989) meets the Bay Area thrash spirit, while The Next Room is more akin a Faith No More album. This may be the reason they did not receive much success.\n",
         "In a 2016 interview on music website No Echo, bassist Art Liboon spoke about the lack of success after The Next Room was released:\n",
         "At this time, [Mordred drummer] Gannon [Hall] took over as manager. We seemed to be moving along okay during the recording. The noise appeared to be giving it a supportive reaction. When it hit the shelves, our strongest fanbase in Germany either shunned the record or didn't know about our forthcoming tour. There were no pre-sale tickets for the tour. Noise pulled the plug on the tour. We said, 'Fuck you,' by disbanding. We were not bluffing. The tour cancellation and growing tension between Gannon and Karl from Noise led to the ultimate sacrifice: ending the band.[2]",
         "Mordred announced a reunion in 2001. In the following year, they played live in their hometown of San Francisco and went on to perform again. Despite this, no new material from the band has been released. On October 20, 2013, Mordred created their official Facebook page, and a few days later, they announced a reunion with the \"In This Life\" lineup.\n",
         "The band toured the UK and Ireland in 2014 with Jeff Gomes on drums alongside British Metal Revival band Kaine. They also played the new song \"The Baroness\" and announced their intention to record a new album.[3]\n"
      ]
   },
   "Title": "Mordred (band) - Wikipedia"
}