{
   "Awards": {},
   "Discography": {
      "Albums": {},
      "Singles": {}
   },
   "External links": {},
   "History": {
      "text": [
         "The Chantays were formed in 1961 by five high-school friends. Bob Spickard, Brian Carman (co-writers of \"Pipeline\"), Bob Welch, Warren Waters and Rob Marshall were all students at Santa Ana High School in California.[2] In December 1962, the group recorded and released \"Pipeline\", which peaked at No. 4 on the Billboard Hot 100 in May 1963. The track also peaked in the UK Singles Chart in 1963 at No. 16.[3] The Chantays recorded their first album in 1963, also titled Pipeline, which included \"Blunderbus\" and \"El Conquistador\". Their follow-up album was Two Sides of the Chantays in 1964.[2]\n",
         "The Chantays toured Japan and the United States, joining the Righteous Brothers and Roy Orbison on a few occasions, and they were the only rock and roll band to perform on The Lawrence Welk Show.[4]\n",
         "\"Pipeline\" (published as sheet music in 1962 by Downey Music Publishing) has become one of several surf rock hits. The tune has since been covered by Bruce Johnston, Welk (on the Dot album Scarlet O'Hara), Al Caiola (on the United Artists album Greasy Kid Stuff), the Ventures, Takeshi Terauchi & Blue Jeans, Agent Orange, Hank Marvin, Lively Ones, Pat Metheny, Dick Dale with the help of Stevie Ray Vaughan (Grammy Nominated), by the thrash metal band Anthrax, Bad Manners and Johnny Thunders. \"Pipeline\" has been used in many films, television programs and commercials, and appears on numerous compilation albums.[citation needed]\n",
         "The Chantays have been honored for their contributions to music. Highlights include being honored on April 12, 1996, by Hollywood's Rock Walk,[5] that was founded to honor individuals and bands that have made lasting and important contributions to music. \"Pipeline\" is listed as one of the 500 Songs that Shaped Rock and Roll. Along with Bill Medley of the Righteous Brothers and Diane Keaton, the Chantays were honored by the City of Santa Ana, California, and Santa Ana High School when they named a street after them, Chantays Way.[6] OC Weekly magazine also named the Chantays as one of the Best Orange County Bands.\n",
         "The Chantays are still playing.[when?] Original members Bob Spickard and Bob Welch are joined by longtime members Ricky Lewis and Brian Nussle. More recent albums include The Next Set (live recording) and Waiting for the Tide.[7] Some of the tracks are the new songs \"Crystal T\" and \"Killer Dana\", along with remakes of \"Pipeline\", \"El Conquistador\" and \"Blunderbus\".[8]\n",
         "Brian Carman died at his home in Santa Ana, California, from complications of Crohn's disease on March 1, 2015. He was 69.[9] Another longtime member Gil Orr died on September 19, 2017. He was 79.[10]\n"
      ]
   },
   "Live TV performances": {},
   "Members": {},
   "References": {},
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "3.1 Albums",
      "3.2 Singles",
      "4 Live TV performances",
      "5 Awards",
      "6 See also",
      "7 References",
      "8 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "The Chantays, sometimes credited as Chantay's,[1] is an American surf rock band from Orange County, California, United States, known for the hit instrumental \"Pipeline\" (1963).[2] Their music combines electronic keyboards and surf guitar, creating a unique ghostly sound.\n"
      ]
   },
   "Title": "The Chantays - Wikipedia"
}