{
   "Name": "Chon (band)",
   "rawData": [
      "Chon (sometimes stylized as CHON) is an American progressive rock and math rock band from Oceanside, California. Their music is largely instrumental with only a few songs containing vocal performances. The band consists of Mario Camarena (guitar), Erick Hansel (guitar), Esiah Camarena (bass) and Nathan Camarena (drums). \n",
      "Since 2008, they have been releasing demos via internet. In 2010, the band began a brief hiatus, but reunited in 2011 to record two new songs, \"O.G.\" and \"Breathe\". They returned in 2013 with the release of their debut EP entitled Newborn Sun. In 2014, Chon released their second EP, entitled Woohoo! and embarked on two consecutive nationwide tours with Animals as Leaders. \n",
      "In December 2014, Chon signed with the record label Sumerian Records, and announced they would be releasing their debut full-length album the following year. On February 5, 2015, the band announced their debut full length titled Grow would be released in March 2015. On March 5, the band premiered their song Can't Wait from the album via Red Bull. They released the album on March 24. Eight days prior the band embarked on a 27 date tour supporting Circa Survive. On December 16, 2015, Chon announced their first full US headlining tour, titled the Super Chon Bros Tour, with accompanying bands Polyphia and Strawberry Girls. They sold out every single show on the tour. Chon was also an opening band during the Sonic Unrest Tour, featuring headliner Periphery, and bands Sikth and Toothgrinder.\n"
   ],
   "infobox": {
      "Origin": [
         "Oceanside, California"
      ],
      "Genres": [
         "Progressive rock",
         "math rock",
         "instrumental rock"
      ],
      "Years active": [
         "2008 (2008)–present"
      ],
      "Labels": [
         "Sumerian"
      ],
      "Associated acts": [
         "The Fall of Troy",
         "Polyphia",
         "Mouse on the Keys"
      ],
      "Website": [
         "http://www.thisischon.com/"
      ],
      "Members": [
         "Mario Camarena",
         "Erick Hansel",
         "Nathan Camarena",
         "Esiah Camarena"
      ],
      "Past members": [
         "Drew Pelisek"
      ]
   },
   "albums": [
      "Grow",
      "Homey",
      "Chon"
   ],
   "prunedData": [
      "[BAND_NAME] (sometimes stylized as CHON) is an [GENRE] band from Oceanside, California. Their music is largely instrumental with only a few songs containing vocal performances. The band consists of [MONTH]io [PERSON_NAME_LAST_1] (guitar), [PERSON_NAME_FULL_0_MALE] (guitar), Esiah [PERSON_NAME_LAST_1] (bass) and [PERSON_NAME_FULL_1_MALE] (drums). \n",
      "Since [YEAR], they have been releasing demos via internet. In [YEAR], the band began a brief hiatus, but reunited in [YEAR] to record two new songs, [SONG_NAME]. They returned in [YEAR] with the release of their debut EP entitled Newborn Sun. In [YEAR], [BAND_NAME] released their second EP, entitled Woohoo! and embarked on two consecutive nationwide tours with Animals as Leaders. \n",
      "In [MONTH] [YEAR], [BAND_NAME] signed with the record label Sumerian Records, and announced they would be releasing their debut full-length album the following year. On [MONTH] 5, [YEAR], the band announced their debut full length titled Grow would be released in [MONTH] [YEAR]. On [MONTH] 5, the band premiered their song Can't Wait from the album via [PERSON_NAME_FULL_0_FEMALE]. They released the album on [MONTH] 24. Eight days prior the band embarked on a 27 date tour supporting Circa Survive. On [MONTH] 16, [YEAR], [BAND_NAME] announced their first full US headlining tour, titled the Super [BAND_NAME] Bros Tour, with accompanying bands Polyphia and Strawberry Girls. They sold out every single show on the tour. [BAND_NAME] was also an opening band during the Sonic Unrest Tour, featuring headliner Periphery, and bands Sikth and Toothgrinder.\n"
   ]
}