{
   "Name": "Crime in Choir",
   "rawData": [
      "San Francisco quintet Crime In Choir was an instrumental progressive rock band. Founded in 2000, Crime In Choir released their previous full-length releases on Frenetic Records (2004’s The Hoop) and Omnibus (2002’s self-titled debut), respectively. The band’s third full-length, Trumpery Metier, was recorded by Tim Green, and is their first release for Gold Standard Labs.  The band includes two original members of At the Drive-In, guitarist Jarrett Wrenn and bassist Kenny Hopper.\n",
      "On September 13, 2007, Crime in Choir performed at the San Francisco Museum of Modern Art accompanied by light projections by visual artist, Anthony McCall.\n",
      "Crime in Choir's fourth release, \"Gift Givers\" was released on 22 January 2009 on Kill Shaman Records - their previous label (Gold Standard Labs) closed its doors in October 2007.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California"
      ],
      "Genres": [
         "Instrumental",
         "Experimental",
         "Progressive rock",
         "Math Rock"
      ],
      "Years active": [
         "2000 – 2009"
      ],
      "Labels": [
         "Omnibus, Frenetic, Moorworks, Gold Standard Labs"
      ],
      "Members": [
         "Kenny Hopper",
         "Jesse Reiner",
         "Jarrett Wrenn",
         "Tim Soete",
         "Matt Waters",
         "Jonathan Skaggs",
         "Warren Huegel"
      ],
      "Past members": [
         "Zach Hill",
         "Ian Hill",
         "Carson McWhirter",
         "Jeff Hunt"
      ]
   },
   "albums": [
      "Crime in Choir",
      "The Hoop",
      "Trumpery Metier",
      "Gift Givers"
   ],
   "prunedData": [
      "San Francisco quintet Crime In Choir was an [GENRE] band. Founded in [YEAR], Crime In Choir released their previous full-length releases on Frenetic Records ([YEAR]’s The Hoop) and Omnibus ([YEAR]’s self-titled debut), respectively. The band’s third full-length, Trumpery Metier, was recorded by [PERSON_NAME_FULL_0_MALE], and is their first release for Gold Standard Labs.  The band includes two original members of At the Drive-In, guitarist [PERSON_NAME_FULL_1_MALE] and bassist Kenny Hopper.\n",
      "On [MONTH] 13, [YEAR], [BAND_NAME] performed at the San Francisco Museum of Modern Art accompanied by light projections by visual artist, Anthony McCall.\n",
      "[BAND_NAME]'s fourth release, [SONG_NAME] was released on 22 [MONTH] [YEAR] on Kill Shaman Records - their previous label (Gold Standard Labs) closed its doors in [MONTH] [YEAR].\n"
   ]
}