{
   "Name": "Djam Karet",
   "Sections": [
      "1 Personnel",
      "1.1 Guests",
      "2 History",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Djam Karet is an instrumental progressive rock band based in Topanga, California.  The band was founded in 1984 by guitarists Gayle Ellett and Mike Henderson, bassist Henry J. Osborne, and drummer Chuck Oken, Jr..  The band's name is an old spelling of an Indonesian word (pronounced by English speakers as 'jum car-RAT) that translates loosely as \"elastic time\".\n"
      ]
   },
   "Personnel": {
      "Guests": {}
   },
   "History": {
      "text": [
         "Djam Karet was founded at Pitzer College in 1984 by guitarists Gayle Ellett and Mike Henderson, bassist Henry J. Osborne, and drummer Chuck Oken, Jr. They've created 18 instrumental albums so far, and have played on an additional 26 compilations, EPs, and limited-edition CD-rs. They chose as the band's name an Indonesian word (pronounced 'jam Kah-ret[1]) that translates loosely as \"elastic time\". Early Djam Karet was a proto-\"jam band\" whose live, totally improvised performances on the southern California/LA area college circuit featured a free-form mixture of guitar-dominated instrumental rock and textural Eastern drone music, as on their 1985 release No Commercial Potential. Djam Karet's mode of working and repertoire gradually expanded beyond improvisation to include compositional elements, field recordings, and studio work. In 1987 the band released The Ritual Continues, which was chosen \"Number 2 Album Of The Year\" by ELECTRONIC MUSICIAN magazine. Two years later, they released Reflections From The Firepool (now available from Cuneiform Records), which received ROLLING STONE's accolade of \" Number 2 Independent Album Of The Year\".\n",
         "In 1991, the band released two separate CDs at the same time: Burning The Hard City and Suspension & Displacement which \"show-cased the band's two extreme split personalities...The former was a bone-crushing excursion into heavy power rock with anarchistic guitar solos, and the latter was a brilliant diary of dark, eerie ambient soundscapes.\" (EXPOSE'). Three years later in 1994, Djam Karet released the CD Collaborator, with guests musicians: Jeff Greinke, Kit Watkins, Marc Anderson, Steve Roach, Carl Weingarten, and many others.\n",
         "As the 20th century drew to a close, Djam Karet signed with Cuneiform Records, working on new releases for Cuneiform and initiated a program to repackage and reissue their back catalog.  Djam Karet also began playing live on the festival circuit: live shows were performed at Day Zero for 1999's ProgDay (San Francisco); at NEARfest 2001, progressive rock's premier US showcase; ProgWest 2001 (Claremont), 2002's ProgDay (North Carolina), 2009's The Immersion Festival, and they headlined the three-day Progressive Rock festival in France called the Crescendo Festival. Throughout the years they have also contributed music to more than 20 compilation releases, both here and in Europe. Many of those tunes are available nowhere else.\n",
         "When Cuneiform released its first Djam Karet CD in 1997 titled The Devouring, INNERVIEWS noted that Djam Karet is \"back with a vengeance, one hell of an album\". SPACE.com applauded their expanded sound featuring more keyboards: \"As if the band's earlier music hadn't already scorched the ceilings of heaven, this new sonic incarnation burned like a stellar nova.\" In 1998, Djam Karet performed on the West and East Coasts, recording a live album for Cuneiform titled Live At Orion, released in 1999, that was applauded as \"one of the best live recordings that I've heard\" and was chosen as \"Top 10 Album of 1999\" by EXPOSE' Magazine. The band began to do more work in the studio, resulting in the 2001 release of New Dark Age (Cuneiform) and also the Limited Edition CD release Ascension. Numerous critics called New Dark Age Djam Karet's best to date. In the words of PROGRESSION: \"This may be the best Djam Karet recording yet, which is a mouthful, considering that the band's now-voluminous output is amply studded with gems. Their brilliant synthesis of abstract mind-trip and concrete butt-kick is at an all-time high here. Sonically, ...it is simply masterful. This is one of the major releases of the year.\"\n",
         "Around the same time as New Dark Age's release, and complementary to its work with Cuneiform, Djam Karet launched a series of self-released CD-Rs, reissues and limited edition CDs for its fans. Within two years, the band had self-released numerous CD projects, including recordings made at New York City's The Knitting Factory, an on-air performance recorded at KCRW-FM, and other archival performances. Out of this creative renaissance arose A Night For Baku which featured the addition of new band member Aaron Kenyon on bass. The title derives from Japanese folklore: the Baku are mythical inhabitants of the dream world, valiant warriors who devour nightmares as the spoils of battle. The CD features Djam Karet using more keyboards and electronics, and collaborating on one track with electronic musician Steve Roach, who worked previously with the band on Collaborator.\n",
         "It is this new line up as a quintet that created Recollection Harvest, their most melodic album yet. Actually two albums on one CD, Recollection Harvest is divided into two chapters. The first-half is filled with their most melodic and jazzy music released so far, with a strong focus on composition and tight arrangements, Mellotrons and soulful guitar melodies. The second-half, titled Indian Summer, features a collection of compositions colored with beautiful acoustic guitars and analog synths, and showcases their more atmospheric side. Together, this release demonstrates the broad and varied world that is Djam Karet.  The internal drama and sense of purpose of earlier releases (through New Dark Age and Ascension) is diffused in these later works.\n",
         "In 2009 the band was flown to the Bordeaux area of France to headline the annual Crescendo Festival. Held in a huge grassy field right on the beach, this three-day progressive rock concert took place with great weather and fantastic music by all involved. With free camping and a bohemian atmosphere this was one of the group’s most enjoyable gigs. To achieve a fuller and more massive live sound, the group acquired new member Mike Murray on guitar, allowing Gayle Ellett to focus more exclusively on keyboards. When they returned to the States they decided to record The Heavy Soul Sessions in 2010, to better document their current live sound. In order to achieve a more lively and dynamic sound, all of the music was performed live-in-studio without any overdubs and no compressors or limiters were used during the recording process. This gives the CD a sound that is very dynamic, punchy and powerful, where the drums and bass are crystal clear and aggressive, and the guitars and keyboards are warm and inviting, and clearly demonstrates the broad and varied world that is Djam Karet\n",
         "Recently they have formed a new record label called Firepool Records, which has released five albums so far: the self-titled Herd Of Instinct and their follow up Conjure, Henderson/Oken's Dream Theory In The IE, the improvised Jazz album The Whiskey Mountain Sessions by the group Hillmen, and the self-titled \"Spoke Of Shadows\".\n",
         "2013 saw the release of The Trip which features one single 47 minute track. Spacey and dreamy, The Trip takes you on a journey to places both familiar and exotic. It was voted \"#6 Album Of The Year\" by the listeners of east coast FM Radio show Gagliarchives, hosted by DJ Tom Gagliardi.\n",
         "In 2014 they celebrated their 30th anniversary together with a new album Regenerator 3017, their 17th album so far. The album is a collection of 7 tracks that were recorded with a pristine sound quality, without any compression or computer manipulation. All music is played by hand the old-fashioned way. Punchy drums and fat bass hold down a slowly driving groove, as Rhodes and electric guitars rock on. Many of the instruments used on this album have been owned by the band members since the band was formed thirty years ago! Founding member/guitarist Gayle Ellett said “We wanted to create a melodic album with a classic sound. Most of us were born around 1960, so the 1970’s was the decade of our youth, our teenage years. And the music of that time, and the values it embraced, were very pivotal in the development of our views on how music should sound. This was a time when Fusion, Psychedelic music, Southern Rock and other styles were all quite popular. With Regenerator 3017 we’re not trying to recreate that era, but we are inspired by it.”\n",
         "In 2017 they released their most melodic album: Sonic Celluloid. Relating to the idea of \"sound as cinema\", this collection of 10 tracks demonstrates the group's ability to create \"mini-movies in your mind\". With more acoustic instruments, and more minimoogs and mellotrons then on any previous album, Sonic Celluloid is their best produced and best sounding album to date.\n"
      ]
   },
   "Discography": {
      "text": [
         "Discography of Major Releases: \n",
         "Minor Releases, Compilations, CD-rs & EPs: \n",
         "Solo Albums and Side-Projects:\n",
         "Ellett:\n",
         "Oken/Ellett:\n",
         "Henderson/Oken:\n",
         "Henderson:\n",
         "Henderson/Kenyon:\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Djam Karet is an instrumental progressive rock band based in Topanga, California.  The band was founded in 1984 by guitarists Gayle Ellett and Mike Henderson, bassist Henry J. Osborne, and drummer Chuck Oken, Jr..  The band's name is an old spelling of an Indonesian word (pronounced by English speakers as 'jum car-RAT) that translates loosely as \"elastic time\".\n",
      "Djam Karet was founded at Pitzer College in 1984 by guitarists Gayle Ellett and Mike Henderson, bassist Henry J. Osborne, and drummer Chuck Oken, Jr. They've created 18 instrumental albums so far, and have played on an additional 26 compilations, EPs, and limited-edition CD-rs. They chose as the band's name an Indonesian word (pronounced 'jam Kah-ret[1]) that translates loosely as \"elastic time\". Early Djam Karet was a proto-\"jam band\" whose live, totally improvised performances on the southern California/LA area college circuit featured a free-form mixture of guitar-dominated instrumental rock and textural Eastern drone music, as on their 1985 release No Commercial Potential. Djam Karet's mode of working and repertoire gradually expanded beyond improvisation to include compositional elements, field recordings, and studio work. In 1987 the band released The Ritual Continues, which was chosen \"Number 2 Album Of The Year\" by ELECTRONIC MUSICIAN magazine. Two years later, they released Reflections From The Firepool (now available from Cuneiform Records), which received ROLLING STONE's accolade of \" Number 2 Independent Album Of The Year\".\n",
      "In 1991, the band released two separate CDs at the same time: Burning The Hard City and Suspension & Displacement which \"show-cased the band's two extreme split personalities...The former was a bone-crushing excursion into heavy power rock with anarchistic guitar solos, and the latter was a brilliant diary of dark, eerie ambient soundscapes.\" (EXPOSE'). Three years later in 1994, Djam Karet released the CD Collaborator, with guests musicians: Jeff Greinke, Kit Watkins, Marc Anderson, Steve Roach, Carl Weingarten, and many others.\n",
      "As the 20th century drew to a close, Djam Karet signed with Cuneiform Records, working on new releases for Cuneiform and initiated a program to repackage and reissue their back catalog.  Djam Karet also began playing live on the festival circuit: live shows were performed at Day Zero for 1999's ProgDay (San Francisco); at NEARfest 2001, progressive rock's premier US showcase; ProgWest 2001 (Claremont), 2002's ProgDay (North Carolina), 2009's The Immersion Festival, and they headlined the three-day Progressive Rock festival in France called the Crescendo Festival. Throughout the years they have also contributed music to more than 20 compilation releases, both here and in Europe. Many of those tunes are available nowhere else.\n"
   ],
   "infobox": {
      "Origin": [
         "Claremont, California, US"
      ],
      "Genres": [
         "Progressive rock",
         "Jam rock",
         "Psychedelic rock",
         "World music",
         "Avant-garde",
         "New wave",
         "Electronic",
         "Ambient"
      ],
      "Years active": [
         "1984–present"
      ],
      "Labels": [
         "Cuneiform Records"
      ],
      "Website": [
         "http://djamkaret.com"
      ],
      "Members": [
         "Gayle Ellett, Mike Henderson, Henry J. Osborne, Aaron Kenyon, Chuck Oken, Jr., M.G. Murray"
      ]
   }
}