{
   "Name": "Djam Karet",
   "rawData": [
      "Djam Karet is an instrumental progressive rock band based in Topanga, California.  The band was founded in 1984 by guitarists Gayle Ellett and Mike Henderson, bassist Henry J. Osborne, and drummer Chuck Oken, Jr..  The band's name is an old spelling of an Indonesian word (pronounced by English speakers as 'jum car-RAT) that translates loosely as \"elastic time\".\n",
      "Djam Karet was founded at Pitzer College in 1984 by guitarists Gayle Ellett and Mike Henderson, bassist Henry J. Osborne, and drummer Chuck Oken, Jr. They've created 18 instrumental albums so far, and have played on an additional 26 compilations, EPs, and limited-edition CD-rs. They chose as the band's name an Indonesian word (pronounced 'jam Kah-ret) that translates loosely as \"elastic time\". Early Djam Karet was a proto-\"jam band\" whose live, totally improvised performances on the southern California/LA area college circuit featured a free-form mixture of guitar-dominated instrumental rock and textural Eastern drone music, as on their 1985 release No Commercial Potential. Djam Karet's mode of working and repertoire gradually expanded beyond improvisation to include compositional elements, field recordings, and studio work. In 1987 the band released The Ritual Continues, which was chosen \"Number 2 Album Of The Year\" by ELECTRONIC MUSICIAN magazine. Two years later, they released Reflections From The Firepool (now available from Cuneiform Records), which received ROLLING STONE's accolade of \" Number 2 Independent Album Of The Year\".\n",
      "In 1991, the band released two separate CDs at the same time: Burning The Hard City and Suspension & Displacement which \"show-cased the band's two extreme split personalities...The former was a bone-crushing excursion into heavy power rock with anarchistic guitar solos, and the latter was a brilliant diary of dark, eerie ambient soundscapes.\" (EXPOSE'). Three years later in 1994, Djam Karet released the CD Collaborator, with guests musicians: Jeff Greinke, Kit Watkins, Marc Anderson, Steve Roach, Carl Weingarten, and many others.\n"
   ],
   "infobox": {
      "Origin": [
         "Claremont, California, US"
      ],
      "Genres": [
         "Progressive rock",
         "Jam rock",
         "Psychedelic rock",
         "World music",
         "Avant-garde",
         "New wave",
         "Electronic",
         "Ambient"
      ],
      "Years active": [
         "1984–present"
      ],
      "Labels": [
         "Cuneiform Records"
      ],
      "Website": [
         "http://djamkaret.com"
      ],
      "Members": [
         "Gayle Ellett, Mike Henderson, Henry J. Osborne, Aaron Kenyon, Chuck Oken, Jr., M.G. Murray"
      ]
   }
}