{
   "Name": "Dub Trio",
   "rawData": [
      "Dub Trio is a dub/rock cross-over band from Brooklyn, New York City, New York.\n",
      "Dub Trio consists of bassist Stu Brooks, guitarist DP Holmes, and drummer Joe Tomino. With the addition of electronic, rock, punk and heavy metal, the group pays homage to King Tubby's original dub style, while recreating studio trickery live on stage using various delay pedals, keyboards, and samplers.\n",
      "While Tomino can add delay or loop effects to his own drums, each member of the band has the ability to \"dub\" the other via microphones on Tomino's kit running to delay effects on both Holmes' and Brooks' pedal boards.\n"
   ],
   "infobox": {
      "Origin": [
         "Brooklyn, New York City, New York, United States"
      ],
      "Genres": [
         "Rock, punk rock, heavy metal, dub"
      ],
      "Years active": [
         "2000–present"
      ],
      "Labels": [
         "Ipecac Recordings, ROIR"
      ],
      "Associated acts": [
         "Joel Hamilton, Matisyahu, Mike Patton, Peeping Tom, Actual Proof"
      ],
      "Website": [
         "www.dubtrio.com"
      ],
      "Members": [
         "Stu Brooks",
         "DP Holmes",
         "Joe Tomino"
      ]
   },
   "albums": [
      "Exploring the Dangers Of",
      "New Heavy",
      "Another Sound Is Dying",
      "IV",
      "The Shape of Dub to Come"
   ],
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band from Brooklyn, New York City, New York.\n",
      "[BAND_NAME] consists of bassist Stu Brooks, guitarist DP Holmes, and drummer [PERSON_NAME_FULL_0_MALE]. With the addition of electronic, rock, punk and heavy metal, the group pays homage to King Tubby's original dub style, while recreating studio trickery live on stage using various delay pedals, keyboards, and samplers.\n",
      "While Tomino can add delay or loop effects to his own drums, each member of the band has the ability to [SONG_NAME] the other via microphones on Tomino's kit running to delay effects on both Holmes' and Brooks' pedal boards.\n"
   ]
}