{
   "Name": "Dysrhythmia (band)",
   "rawData": [
      "Dysrhythmia is an American instrumental progressive metal band formed in Philadelphia, Pennsylvania, United States, in 1998.  The band's music combines avant-garde elements of progressive rock and jazz with heavy metal.  They are currently located in Brooklyn, New York.\n",
      "Their most recent release, The Veil of Control, was released in September 2016 via Profound Lore Records.\n",
      "The band was formed in August 1998 by guitarist Kevin Hufnagel and bassist Clayton Ingerson, who were joined six months later by drummer Jeff Eber. The band entered the studio in early 2000 to record their debut album, Contradiction, which was recorded, like every other Dysrhythmia album to follow, completely live with minimal overdubs.  Shortly thereafter, the band reentered the studio in 2001 to record the No Interference record.  The new album helped to define and expand the band's sound, and was followed by extensive touring.  In 2002, the band released two split albums, a 10\" vinyl record with Thoughtstreams and a 7\" split with Technician.\n"
   ],
   "infobox": {
      "Origin": [
         "Philadelphia, Pennsylvania, United States"
      ],
      "Genres": [
         "Progressive metal",
         "math rock"
      ],
      "Years active": [
         "1998–present"
      ],
      "Labels": [
         "Relapse"
      ],
      "Associated acts": [
         "Behold... The Arctopus, Krallice, Gorguts"
      ],
      "Website": [
         "Dysrhythmia Blogspot"
      ],
      "Members": [
         "Kevin Hufnagel",
         "Jeff Eber",
         "Colin Marston"
      ],
      "Past members": [
         "Clayton Ingerson"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in Philadelphia, Pennsylvania, United States, in [YEAR].  The band's music combines avant-garde elements of progressive rock and jazz with heavy metal.  They are currently located in Brooklyn, New York.\n",
      "Their most recent release, The Veil of Control, was released in [MONTH] [YEAR] via Profound Lore Records.\n",
      "The band was formed in [MONTH] [YEAR] by guitarist [PERSON_NAME_FULL_2_MALE] and bassist [PERSON_NAME_FULL_0_MALE], who were joined six months later by drummer [PERSON_NAME_FULL_1_MALE]. The band entered the studio in early [YEAR] to record their debut album, Contradiction, which was recorded, like every other [BAND_NAME] album to follow, completely live with minimal overdubs.  Shortly thereafter, the band reentered the studio in [YEAR] to record the No Interference record.  The new album helped to define and expand the band's sound, and was followed by extensive touring.  In [YEAR], the band released two split albums, a [GENRE] a 7\" split with Technician.\n"
   ]
}