{
   "Name": "Dysrhythmia (band)",
   "Sections": [
      "1 History",
      "2 Personnel",
      "3 Discography",
      "3.1 Albums",
      "3.2 Singles and EPs",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Dysrhythmia is an American instrumental progressive metal band formed in Philadelphia, Pennsylvania, United States, in 1998.  The band's music combines avant-garde elements of progressive rock and jazz with heavy metal.  They are currently located in Brooklyn, New York.\n",
         "Their most recent release, The Veil of Control, was released in September 2016 via Profound Lore Records.\n"
      ]
   },
   "History": {
      "text": [
         "The band was formed in August 1998 by guitarist Kevin Hufnagel and bassist Clayton Ingerson, who were joined six months later by drummer Jeff Eber. The band entered the studio in early 2000 to record their debut album, Contradiction, which was recorded, like every other Dysrhythmia album to follow, completely live with minimal overdubs.  Shortly thereafter, the band reentered the studio in 2001 to record the No Interference record.  The new album helped to define and expand the band's sound, and was followed by extensive touring.  In 2002, the band released two split albums, a 10\" vinyl record with Thoughtstreams and a 7\" split with Technician.[1]\n",
         "The band signed to Relapse Records in October 2002.  Entitled Pretest, their first album with Relapse was released May 13, 2003 to positive critical acclaim. Metal Hammer Magazine named Pretest one of the Top 10 Essential Mathcore albums of all time,[2] while Revolver Magazine ranked the album among the top 20 albums of 2003 alongside of records by Radiohead, Metallica and others.[3] The band began touring with bigger named acts such as Mastodon, Cephalic Carnage and The Dillinger Escape Plan, and playing large music festivals including the 2003 and 2004 Relapse Contamination tour, the Relapse Records South by Southwest showcase in Austin, Texas, and the New England Metal and Hardcore festival, where the band was profiled by both MTV2 and Fuse. Ingerson left the group in November 2004.\n",
         "To replace Ingerson, Dysrhythmia recruited Colin Marston, a member of the group Behold...The Arctopus (in which he plays a 12-string Warr guitar).  Dysrhythmia next embarked on tours with Isis and These Arms are Snakes.  They recorded and released their fourth full-length album, Barriers and Passages, at B.C. Studios in Brooklyn with engineer Martin Bisi, who had previously worked with John Zorn and Sonic Youth. Barriers and Passages was released on May 2, 2006 in North America and May 9 internationally. The band continued touring throughout 2006 and 2007, and released a split album with Rothko in late 2007.\n",
         "Dysrhythmia stayed relatively quiet in 2008 as Hufnagel and Marston pursued their own individual projects. Marston continued recording and touring with Behold...The Arctopus and Krallice, while Hufnagel released a full-length solo album entitled Songs for the Disappeared via his own imprint Nightfloat Recordings.  Both Hufnagel and Marston also joined the long-standing technical death metal band Gorguts.\n",
         "After the short break, Dysrhythmia entered their own Menegroth Studios in Queens, New York  to record their fifth full-length release, Psychic Maps.  The album was engineered and produced by Marston and was released July 7, 2009 in North America and July 13 internationally via Relapse. They began touring in October 2009 in support of the new album.[4] Tours included their first European run in June and July 2010, and a U.S. and Canadian tour following shortly after, supporting Cynic, and Intronaut. In May 2012 the band entered Marston's studio again to record their sixth full-length studio album entitled Test of Submission,  released on August 28, 2012 on Profound Lore Records. Their seventh full-length album The Veil of Control followed in 2016, also released on Profound Lore Records.\n"
      ]
   },
   "Personnel": {},
   "Discography": {
      "Albums": {},
      "Singles and EPs": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Dysrhythmia is an American instrumental progressive metal band formed in Philadelphia, Pennsylvania, United States, in 1998.  The band's music combines avant-garde elements of progressive rock and jazz with heavy metal.  They are currently located in Brooklyn, New York.\n",
      "Their most recent release, The Veil of Control, was released in September 2016 via Profound Lore Records.\n",
      "The band was formed in August 1998 by guitarist Kevin Hufnagel and bassist Clayton Ingerson, who were joined six months later by drummer Jeff Eber. The band entered the studio in early 2000 to record their debut album, Contradiction, which was recorded, like every other Dysrhythmia album to follow, completely live with minimal overdubs.  Shortly thereafter, the band reentered the studio in 2001 to record the No Interference record.  The new album helped to define and expand the band's sound, and was followed by extensive touring.  In 2002, the band released two split albums, a 10\" vinyl record with Thoughtstreams and a 7\" split with Technician.[1]\n",
      "The band signed to Relapse Records in October 2002.  Entitled Pretest, their first album with Relapse was released May 13, 2003 to positive critical acclaim. Metal Hammer Magazine named Pretest one of the Top 10 Essential Mathcore albums of all time,[2] while Revolver Magazine ranked the album among the top 20 albums of 2003 alongside of records by Radiohead, Metallica and others.[3] The band began touring with bigger named acts such as Mastodon, Cephalic Carnage and The Dillinger Escape Plan, and playing large music festivals including the 2003 and 2004 Relapse Contamination tour, the Relapse Records South by Southwest showcase in Austin, Texas, and the New England Metal and Hardcore festival, where the band was profiled by both MTV2 and Fuse. Ingerson left the group in November 2004.\n"
   ]
}