{
   "Name": "Electro Quarterstaff",
   "rawData": [
      "Electro Quarterstaff is an instrumental metal band hailing from Winnipeg, Manitoba, Canada. They play a form of progressive/technical heavy metal and employ three lead guitarists.  Initially consisting of just three guitarists and a drummer, they added a bassist to their line-up in winter 2006 and played their first show with him in autumn 2007.  The band is named for a weapon in the Canadian cartoon Rocket Robin Hood.\n",
      "The band self-released the Swayze EP in 2004.  They later signed with Willowtip Records for their debut full-length album in 2006, Gretzky, which included rerecorded and reworked versions of their earlier tracks. Also in 2006 they toured the United States and Canada for the first time, which included a performance at the Maryland Deathfest.\n"
   ],
   "infobox": {
      "Origin": [
         "Winnipeg, Manitoba, Canada"
      ],
      "Genres": [
         "Instrumental music",
         "Progressive metal",
         "Technical metal",
         "Thrash metal[1]"
      ],
      "Years active": [
         "2001–present"
      ],
      "Labels": [
         "Willowtip Records"
      ],
      "Website": [
         "www.electroquarterstaff.com"
      ],
      "Members": [
         "Josh Bedry",
         "Drew Johnston",
         "Andrew Dickens",
         "Dan Ryckman",
         "Marty Thiessen"
      ]
   },
   "albums": [
      "Swayze",
      "Gretzky",
      "Aykroyd"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band hailing from Winnipeg, Manitoba, Canada. They play a form of progressive/technical heavy metal and employ three lead guitarists.  Initially consisting of just three guitarists and a drummer, they added a bassist to their line-up in winter [YEAR] and played their first show with him in autumn [YEAR].  The band is named for a weapon in the Canadian cartoon Rocket Robin Hood.\n",
      "The band self-released the Swayze EP in [YEAR].  They later signed with Willowtip Records for their debut full-length album in [YEAR], Gretzky, which included rerecorded and reworked versions of their earlier tracks. Also in [YEAR] they toured the United States and Canada for the first time, which included a performance at the [MONTH]yland Deathfest.\n"
   ]
}