{
   "Name": "The Fucking Champs",
   "Sections": [
      "1 Members",
      "1.1 Current",
      "1.2 Former",
      "2 Discography",
      "3 External links",
      "4 References"
   ],
   "Summary": {
      "text": [
         "The Fucking Champs are a three-piece rock band from San Francisco, California. They are known for their heavy metal sound, based largely around shifting time signatures, guitar harmonies, and plentiful rhythm. Most songs are instrumental. They are currently signed to Drag City. They have also collaborated with Trans Am and the two have recorded albums together as TransChamps and The Fucking Am.  Founded in Santa Cruz in the early 1990s, the band was initially called The Champs, but added the \"Fucking\" to their name – following a brief stint as The Champs UK – because The Champs had been used by a band in the late 1950s.\n",
         "Tim Green was a member of Nation of Ulysses, Lice, The Vile Cherubs and The Young Ginns. He has released various solo albums and remixes under the name Concentrick. He has also recorded and produced numerous bands through his own Louder Studios.\n",
         "Drummer Tim Soete was the singer/guitarist of San Diego mod revivalists The Event and guitarist/vocalist for Santa Cruz band Tail Dragger.\n",
         "Phil Manley is a founding member of Trans Am and has also released albums under his own name. In 2011, he collaborated with Earthless guitarist Isaiah Mitchell, under the name 'Mitchell Manley', to release an EP for Thrill Jockey. He also works as a recording engineer and has worked with numerous bands in the Bay Area.\n",
         "Founding Champs guitarist Josh Smith was also a member of the cult San Francisco black metal band Weakling, as well as fronting the power pop band The Makes Nice and playing guitar in Drunk Horse. He is currently a member of The Futur Skullz.\n",
         "Phil Manley stated in a January 31, 2011 interview that \"The Champs have broken up.  Tim Soete has moved to San Diego and Tim Green lives in Grass Valley, California.  I have been playing a bit with Josh Smith, but not as the Champs\".[1]  Contrary to Mr. Manley's statement, The Fucking Champs recorded a remix of Justice's song \"Civilization\" for Justice's Civilization EP released June 6, 2011.\n"
      ]
   },
   "Members": {
      "Current": {},
      "Former": {}
   },
   "Discography": {},
   "External links": {},
   "References": {},
   "coreData": [
      "The Fucking Champs are a three-piece rock band from San Francisco, California. They are known for their heavy metal sound, based largely around shifting time signatures, guitar harmonies, and plentiful rhythm. Most songs are instrumental. They are currently signed to Drag City. They have also collaborated with Trans Am and the two have recorded albums together as TransChamps and The Fucking Am.  Founded in Santa Cruz in the early 1990s, the band was initially called The Champs, but added the \"Fucking\" to their name – following a brief stint as The Champs UK – because The Champs had been used by a band in the late 1950s.\n",
      "Tim Green was a member of Nation of Ulysses, Lice, The Vile Cherubs and The Young Ginns. He has released various solo albums and remixes under the name Concentrick. He has also recorded and produced numerous bands through his own Louder Studios.\n",
      "Drummer Tim Soete was the singer/guitarist of San Diego mod revivalists The Event and guitarist/vocalist for Santa Cruz band Tail Dragger.\n",
      "Phil Manley is a founding member of Trans Am and has also released albums under his own name. In 2011, he collaborated with Earthless guitarist Isaiah Mitchell, under the name 'Mitchell Manley', to release an EP for Thrill Jockey. He also works as a recording engineer and has worked with numerous bands in the Bay Area.\n"
   ]
}