{
   "Name": "Füxa",
   "rawData": [
      "Füxa (pronounced like the color fuchsia) is an American rock band.\n",
      "Füxa was formed in Detroit in 1994 by musicians Randall Nieman (formerly of Windy & Carl) and Ryan Anderson (formerly of Asha Vida and later to join Delta Waves). Band members include Randall Nieman (synths/ guitars/ percussion/ Space), Tom Meade (synths/ electronic percussion/ studio effects) Mark Refoy, Jonny Mattock and Stefan Persson. The band quickly achieved cult status with their split recordings with artists such as the Azusa Plane, The Telescopes, Martin Rev, Dean and Britta and Stereolab.\n",
      "Füxa's first collaborative effort, which was immediately bracketed within the psychedelic and experimental category, was a collection of short, guitar and synth driven, primal instrumental space rock songs, recorded at home on a borrowed 6-track cassette recorder. The tapes were later brought to friend Erik Kassab of Gravity Wax for mixing and mastering at his Mission Control home studio. The resulting masters totaled over 90 minutes, and the best hours worth of music was selected for their first release, a hand colored, labeled and numbered cassette. This tape was sold at local indie record shops, and quite a few copies were given away by the band. College DJ Lunar Larry played many selections from this tape on his Friday night program, \"The Life According to Larry\", on WHFR radio. Nieman & Anderson at that time began to play at Detroit coffee houses, quickly building a cult following with their brief, psychedelic, erratic performances. The duo performed with the assistance of an old, literally falling apart Korg Mono/Poly synthesizer, often left to its own devices to produce loud, random arpeggios throughout the entire performance, which almost always emulated in a drum circle where audience participation was encouraged to \"feel good\" with the band. It has been suggested that the Detroit-based experimental rock band focus on a lo-fi, electronics-heavy blend of droning, treated guitars, vintage synths, and sparse percussion in the vein of suicide, Spacemen 3 / Spiritualized, and neu!.  Ryan Anderson departed from the outfit in 1998, and Randall Nieman took over Füxa as a solo project. In 2001-2003 Ryan Anderson Joined Delta Waves to play drums and perform on a few recordings.\n"
   ],
   "infobox": {
      "Origin": [
         "Detroit, Michigan"
      ],
      "Genres": [
         "Space rock, indie rock, alternative rock"
      ],
      "Years active": [
         "1994 (1994)–present"
      ],
      "Labels": [
         "Rocket Girl, Mind Expansion, Astro Lanes, Burnt Hair, the Great Pop Supplement, Static Caravan, Alley Sweeper, Ché Trading, I (label) and Darla"
      ],
      "Website": [
         "www.fuxamusic.com"
      ],
      "Members": [
         "Randall Nieman",
         "Tom Meade",
         "Mark Refoy",
         "Jonny Mattock",
         "Stefan Persson"
      ],
      "Past members": [
         "Ryan Anderson",
         "Eric Morrison",
         "Jesse Percival"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (pronounced like the color fuchsia) is an [GENRE] band.\n",
      "[BAND_NAME] was formed in Detroit in [YEAR] by musicians [PERSON_NAME_FULL_1_MALE] (formerly of Windy & Carl) and Ryan Anderson (formerly of [PERSON_NAME_FULL_2_FEMALE] and later to join Delta Waves). Band members include [PERSON_NAME_FULL_1_MALE] (synths/ guitars/ percussion/ Space), [PERSON_NAME_FULL_0_MALE] (synths/ electronic percussion/ studio effects) [MONTH]k Refoy, Jonny Mattock and [PERSON_NAME_FULL_3_MALE]. The band quickly achieved cult status with their split recordings with artists such as the Azusa Plane, The Telescopes, [MONTH]tin Rev, Dean and Britta and Stereolab.\n",
      "[BAND_NAME]'s first collaborative effort, which was immediately bracketed within the psychedelic and experimental category, was a [GENRE] a borrowed 6-track cassette recorder. The tapes were later brought to friend [PERSON_NAME_FULL_0_MALE] of Gravity Wax for mixing and mastering at his Mission Control home studio. The resulting masters totaled over 90 minutes, and the best hours worth of music was selected for their first release, a hand colored, labeled and numbered cassette. This tape was sold at local indie record shops, and quite a few copies were given away by the band. College DJ Lunar Larry played many selections from this tape on his Friday night program, \"The Life According to Larry\", on WHFR radio. Nieman & [PERSON_NAME_LAST_1] at that time began to play at Detroit coffee houses, quickly building a cult following with their brief, psychedelic, erratic performances. The duo performed with the assistance of an old, literally falling apart Korg Mono/Poly synthesizer, often left to its own devices to produce loud, random arpeggios throughout the entire performance, which almost always emulated in a drum circle where audience participation was encouraged to \"feel good\" with the band. It has been suggested that the Detroit-based experimental rock band focus on a lo-fi, electronics-heavy blend of droning, treated guitars, vintage synths, and sparse percussion in the vein of suicide, Spacemen 3 / Spiritualized, and neu!.  [PERSON_NAME_FULL_1_MALE] departed from the outfit in [YEAR], and Randall Nieman took over [BAND_NAME] as a solo project. In [YEAR]-[YEAR] [PERSON_NAME_FULL_1_MALE] Joined Delta Waves to play drums and perform on a few recordings.\n"
   ]
}