{
   "Name": "Ghosts and Vodka",
   "rawData": [
      "Ghosts and Vodka was an American instrumental math rock band from Chicago, Illinois, United States. The band was made up of two guitarists, Victor Villareal, and Sam Zurick, bassist Erik Bocek, and drummer Scott Shellhamer.\n",
      "The band formed after Bocek and Zurick met Villareal and Shellhamer at a Sky Corvair reunion show in 1998. Bocek and Zurick were both members of Joan of Arc at the time, but quit when the four formed Ghosts and Vodka (Zurick would return to Joan of Arc several years later). Ghosts and Vodka continued to play until 2001 when Villareal and Zurick opted to concentrate on Owls, which saw them reuniting with their ex-Cap'n Jazz bandmates Mike and Tim Kinsella. In 2003, the Sixgunlover label compiled the group's full anthology onto one CD.\n",
      "In March 2009, the band put a blog up on their MySpace page with news of their first practice in 8 years, but later that year announced that they were not continuing in the near future.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, US"
      ],
      "Genres": [
         "Math rock, instrumental rock, post-rock"
      ],
      "Years active": [
         "1998–2001"
      ],
      "Labels": [
         "Hefty Records, Sixgunlover Records"
      ],
      "Associated acts": [
         "Cap'n Jazz,[1] Joan of Arc,[1] Make Believe, Owls, American Heritage, Tongues, Tetsuo, An Automotive, People Dick, Noyes"
      ],
      "Members": [
         "Erik Bocek",
         "Scott Shellhamer",
         "Victor Villareal",
         "Sam Zurick"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band from Chicago, Illinois, United States. The band was made up of two guitarists, Victor Villareal, and [PERSON_NAME_FULL_0_MALE], bassist [PERSON_NAME_FULL_1_MALE], and drummer Scott Shellhamer.\n",
      "The band formed after Bocek and Zurick met Villareal and Shellhamer at a Sky Corvair reunion show in [YEAR]. Bocek and Zurick were both members of Joan of Arc at the time, but quit when the four formed [BAND_NAME] (Zurick would return to Joan of Arc several years later). [BAND_NAME] continued to play until [YEAR] when Villareal and Zurick opted to concentrate on Owls, which saw them reuniting with their ex-Cap'n Jazz bandmates Mike and [PERSON_NAME_FULL_0_MALE]. In [YEAR], the Sixgunlover label compiled the group's full anthology onto one CD.\n",
      "In [MONTH] [YEAR], the band put a [GENRE]"
   ]
}