{
   "Name": "Gifts from Enola",
   "rawData": [
      "Gifts From Enola was a four-piece instrumental post-rock band from Harrisonburg, Virginia.  Their music is characterized with a strong riff-orientated guitar sound along with the soft-loud approach prevalent in some post-rock. They have released three full-length albums and a split album. In July 2010, the band released their self-titled third full-length album. The name supposedly references the Enola Gay, the first aircraft to drop a nuclear bomb.\n",
      "Gifts From Enola was formed by friends Andrew Barnes and Nate Dominy while they were in their freshman year of college in late 2005.  After starting to perform and record in 2006, they added CJ DeLuca and Jordan Endahl to the lineup and recorded their first album Loyal Eyes Betrayed the Mind which they self-released later that year. Loyal Eyes was commercially well received, and led to them being named 'pick of the month' for September 2006 by the prominent music website TheSilentBallet.com. In 2007 they went on their first U.S. tour, which increased national awareness of the band.\n",
      "Gifts From Enola were one of the first bands to be signed by the influential indie record label The Mylene Sheath. In March 2008 Gifts From Enola released a split album with the post-rock band You.May.Die.In.The.Desert, which was titled Harmonic Motion Vol. 1 and was released nationwide through Differential Records. This was followed by a vinyl re-release of Loyal Eyes Betrayed the Mind by The Mylene Sheath on 3 June 2008. The re-release was a vinyl exclusive limited to 500 copies: 100 on clear vinyl with black and blue splatter available exclusively from the band at concerts, 150 on clear vinyl with gray haze and clear with white haze available exclusively from The Mylene Sheath webstore, and 250 on gray vinyl. Both of the exclusive versions sold out very quickly and the re-release cemented the band as a stalwart of the emerging post-rock genre. The release of both these albums increased both national and international appreciation of the band.\n"
   ],
   "infobox": {
      "Origin": [
         "Harrisonburg, Virginia, USA"
      ],
      "Genres": [
         "Post-rock ",
         "Experimental"
      ],
      "Years active": [
         "2005 - present"
      ],
      "Labels": [
         "The Mylene Sheath ",
         "Differential Records"
      ],
      "Website": [
         "Myspace"
      ],
      "Members": [
         "Andrew Barnes",
         "Nathaniel Dominy",
         "CJ DeLuca",
         "Jud Mason"
      ],
      "Past members": [
         "Jordan Endahl",
         "Tim Skirven"
      ]
   }
}