{
   "Discography": {
      "Albums": {
         "Memory Lame (2018)": {
            "text": [
               "Giraffes? Giraffes! released their fourth album on April 27, 2018 via Topshelf Records.\n"
            ]
         },
         "More Skin With Milk-Mouth (2007)": {
            "text": [
               "Giraffes? Giraffes! released their second album on December 8, 2007. The album was recorded at Beef Studio by Topham and David Provost, mixed by Topham and Andreoli, and mastered by Dan Rathbun.\n"
            ]
         },
         "Pink Magick (2011)": {
            "text": [
               "Giraffes? Giraffes! released their third album on September 21, 2011. The album was recorded by Topham and mixed by Andreoli and Topham at Beef Studio, and mastered by Harris Newman.\n"
            ]
         },
         "SUPERBASS!!!! (Black Death Greatest Hits Vol. 1) (2005)": {
            "text": [
               "Giraffes? Giraffes! released their first album on December 9, 2005. The album was recorded and mixed by Topham and Christopher \"Chet!\" Snow.\n"
            ]
         }
      },
      "EPs": {
         "10\" (2013)": {
            "text": [
               "Giraffes? Giraffes! released a split 10\" EP with Goddard on April 30, 2013. Giraffes? Giraffes! material was recorded and mixed by Jason Karby, Andreoli, and Topham at Boiler Room Recordings in Worcester, Massachusetts. Goddard's material was recorded by Goddard at Electrical Audio in Chicago.\n"
            ]
         },
         "Rite of Summer (2020)": {
            "text": [
               "Giraffes? Giraffes! released an EP on May 20, 2020. The EP was Engineered and Mixed by Justin Pizzoferrato at Sonelab / March-April 2020, and mastered by Carl Saff at Saff Mastering.\n"
            ]
         },
         "Spazz Master 7\" (2015)": {
            "text": [
               "Giraffes? Giraffes! released a 7\" EP on February 3, 2015. The EP was recorded and mixed by Jason Karby at Boiler Room Recordings, and mastered by Chris Goosman at Baseline Audio Labs.\n"
            ]
         }
      },
      "Live": {
         "Live In Toronto (2010)": {
            "text": [
               "Giraffes? Giraffes! released their first live album on August 30, 2010. The album was recorded live on August 15, 2010, by Cameron Harding at Rancho Relaxo in Toronto, Canada. It features songs from their first two albums, as well as songs from their yet to be released third album.\n"
            ]
         }
      }
   },
   "External links": {},
   "History": {
      "text": [
         "Ken Topham and Joseph Andreoli both grew up in Western Massachusetts and met at Keene State college in 2001. Topham studied Music Composition and Music History and Andreoli studied English. They met through mutual friends and connections in Keene's music scene. Some of their first practices and brain storming sessions were held in Topham's studio apartment on Court Street in Keene. Their first show together was at the Owl's Nest Cafe at Keene State College under the name \"A Heart Breaking Work of Staggering Genius\" taken from a Dave Eggers book.\n",
         "In 2004, the pair moved to Santa Cruz, California. Shortly after arriving on the west coast Topham and Andreoli committed to working together under the name Giraffes? Giraffes!, also taken from an Eggers book.[1] Moving around the country exposed the duo to several \"musical communities,\" which Andreoli described as \"totally weird to join, and then (the band would) leave them and start again somewhere else.\"[2]\n",
         "The group's first album SUPERBASS!!!! (Black Death Greatest Hits Vol. 1) (2005) was recorded in a warehouse in Santa Cruz, California and was recorded mostly live, as with the rest of the band's output. \"We try to record as much as possible live with minimal overdubs,\" says Topham. \"But for the sake of time and frustration, we do some overdubs.\" Andreoli added \"especially with looping. In a recording situation where you’re working with loops one little fuck up a loop 8 minutes in on a ten minute piece it’s just devastating,\" concluding that the band tries to only record material that they can play live.[1]\n",
         "After the release of SUPERBASS!!!!, the duo began playing regularly in venues in Santa Cruz, San Francisco, San Jose and Oakland. They began writing their second studio album and in 2007, More Skin With Milk-Mouth was recorded in Topham's apartment in Santa Cruz.[1] The following year, they successfully booked and played their first west coast tour, and a few months later, toured much of the east coast.\n",
         "In 2009, the duo returned to New England and recorded Pink Magick in 2011. In 2013 they recorded a split EP 10\" with Goddard. In February 2015 the band released a 7\" titled Spazz Master. The band's most recent release their 4th studio album: Memory Lame, released 27 April 2018. Topham is a rad music teacher.\n"
      ]
   },
   "Members": {},
   "References": {},
   "Sections": [
      "1 History",
      "2 Discography",
      "2.1 Albums",
      "2.1.1 SUPERBASS!!!! (Black Death Greatest Hits Vol. 1) (2005)",
      "2.1.2 More Skin With Milk-Mouth (2007)",
      "2.1.3 Pink Magick (2011)",
      "2.1.4 Memory Lame (2018)",
      "2.2 EPs",
      "2.2.1 10\" (2013)",
      "2.2.2 Spazz Master 7\" (2015)",
      "2.2.3 Rite of Summer (2020)",
      "2.3 Live",
      "2.3.1 Live In Toronto (2010)",
      "3 Members",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Giraffes? Giraffes! (often abbreviated as G? G!) are an American instrumental math rock band formed in 2001 in Massachusetts, by guitarist/drummer Kenneth Topham and guitarist Joseph Andreoli. Along with math rock, the band's music frequently touches on post-rock, progressive rock and experimental rock.\n"
      ]
   },
   "Title": "Giraffes? Giraffes! - Wikipedia"
}