{
   "Name": "Gone (band)",
   "rawData": [
      "\nGone is a three-piece punk-based instrumental rock band, formed by Greg Ginn in late 1985. Originally, Gone was a side project to his main group Black Flag.\n",
      "Before forming Gone, Ginn had been performing some instrumental compositions with Black Flag themselves. For Gone, Ginn tapped bassist Andrew Weiss and drummer Sim Cain, who had previously played together in the band Regressive Aid. They recorded their first album, Let's Get Real, Real Gone For A Change, in late 1985 and released it in 1986 on Ginn's SST Records label. The album title comes from an Elvis Presley quote uttered on his Sun Records-era recording \"Milkcow Blues Boogie\"; the actual quote is both attributed on the back cover of the album, and sampled into the album's second song, \"Get Gone\".\n",
      "Gone were the opening act for Black Flag's entire 1986 tour, which lasted for the first six months of the year.  On a typical day during the tour, Gone would perform one set at an in-store appearance, then go down to the venue where Black Flag were headlining, set up, and open the show.  Ginn's only break in the evening would be when the second opening band, Painted Willie, performed; he would then get onstage with Black Flag and play a 90-minute set.\n"
   ],
   "infobox": {},
   "prunedData": [
      "\n[BAND_NAME] is a [GENRE] band, formed by [PERSON_NAME_FULL_0_MALE] in late [YEAR]. Originally, [BAND_NAME] was a side project to his main group Black Flag.\n",
      "Before forming [BAND_NAME], Ginn had been performing some instrumental compositions with Black Flag themselves. For [BAND_NAME], Ginn tapped bassist [PERSON_NAME_FULL_0_MALE] and drummer Sim Cain, who had previously played together in the band Regressive Aid. They recorded their first album, Let's Get Real, Real [BAND_NAME] For A Change, in late [YEAR] and released it in [YEAR] on Ginn's SST Records label. The album title comes from an [PERSON_NAME_FULL_1_MALE] quote uttered on his Sun Records-era recording \"Milkcow Blues Boogie\"; the actual quote is both attributed on the back cover of the album, and sampled into the album's second song, \"Get [BAND_NAME]\".\n",
      "[BAND_NAME] were the opening act for Black Flag's entire [YEAR] tour, which lasted for the first six months of the year.  On a typical day during the tour, [BAND_NAME] would perform one set at an in-store appearance, then go down to the venue where Black Flag were headlining, set up, and open the show.  Ginn's only break in the evening would be when the second opening band, Painted Willie, performed; he would then get onstage with Black Flag and play a 90-minute set.\n"
   ]
}