{
   "Biography": {
      "text": [
         "Before forming Gone, Ginn had been performing some instrumental compositions with Black Flag themselves. For Gone, Ginn tapped bassist Andrew Weiss and drummer Sim Cain, who had previously played together in the band Regressive Aid. They recorded their first album, Let's Get Real, Real Gone For A Change, in late 1985 and released it in 1986 on Ginn's SST Records label. The album title comes from an Elvis Presley quote uttered on his Sun Records-era recording \"Milkcow Blues Boogie\"; the actual quote is both attributed on the back cover of the album, and sampled into the album's second song, \"Get Gone\".\n",
         "Gone were the opening act for Black Flag's entire 1986 tour, which lasted for the first six months of the year.  On a typical day during the tour, Gone would perform one set at an in-store appearance, then go down to the venue where Black Flag were headlining, set up, and open the show.  Ginn's only break in the evening would be when the second opening band, Painted Willie, performed; he would then get onstage with Black Flag and play a 90-minute set.\n",
         "During a break between 1986 tour legs, Gone recorded their second album, Gone II: But Never Too Gone.\n",
         "In August 1986, Ginn disbanded Black Flag after ten years, presumably to concentrate on Gone and on running SST, but Ginn suddenly disbanded the group not long after Gone II But Not Too Gone was released.  By the time the new year started, Weiss and Cain would join former Black Flag singer Henry Rollins in the Rollins Band.\n",
         "In 1993, Ginn revived the Gone name and recruited a new rhythm section, bassist Steve Sharp and drummer Gregory Moore, both of whom had played on instrumental tracks Ginn recorded and released on his second and third solo albums, Dick and Let It Burn. This line up recorded four albums.  Gone went quiet in 1998, coinciding with a near decade of silence from SST Records.  Ginn and Gone returned in 2007 with The Epic Trilogy, a double CD consisting of 3 lengthy tracks (disc one featured instrumental versions of the songs and disc two featured guest vocals from Bad Brains vocalist H.R.).  Greg played both  guitar and bass, Andy Batwinas (who had engineer a number of albums for SST in the 1990s) provided keyboards and percussion, and the drums were handled by Moore, who now performs under the pseudonym \"Drummer\".[1][2]\n",
         "Another band called \"Gone\" exists, and their two albums have mistakenly been combined with the original band's on the AllMusic.com database. However, they have absolutely no connection whatsoever to either Ginn or his record label.\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "Members": {
      "Current lineup": {},
      "Former members": {}
   },
   "References": {},
   "Sections": [
      "1 Biography",
      "2 Members",
      "2.1 Current lineup",
      "2.2 Former members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "\nGone is a three-piece punk-based instrumental rock band, formed by Greg Ginn in late 1985. Originally, Gone was a side project to his main group Black Flag.\n"
      ]
   },
   "Title": "Gone (band) - Wikipedia"
}