{
   "Name": "Hella (band)",
   "rawData": [
      "Hella is an American math rock band from Sacramento, California. The primary members of the band are Spencer Seim on electric guitar and Zach Hill on drums. In 2005, the band expanded their live band by adding Dan Elkan on vocals, rhythm guitar, sampler and synthesizer and Jonathan Hischke on synth bass guitar for their Church Gone Wild/Chirpin' Hard tour. In 2006 they reformed as a five-piece line-up including Seim, Hill, Carson McWhirter (of The Advantage), Aaron Ross & Josh Hill. In 2009, the band was reduced back to core members Hill and Seim.\n",
      "As teenagers Spencer Seim and Zach Hill were both members of the Northern California band Legs on Earth along with Josh Hill on guitar and Julian Imsdahl on bass and vocals. The band achieved some moderate local success, becoming renowned for their wild live shows, young age, and Primus-esque sound. Zach Hill described Legs on Earth in an interview as pop music but in the way  Devo and Talking Heads were considered pop. They released one album in 1999 called Lasers & Saviors on local record label Para-Sight Records, now out of print. In April of 2000 they went on hiatus and later broke up. Imsdahl later joined the band Grandstream (formerly known as Little California), and was previously in the band Eraserhead. Hill and Seim decided they wanted to continue playing together and pursue a less mainstream sound. According to Hill, they didn't always intend to remain a duo, though: \" had intentions to start a band that was like… kinda like what we were doing with just the two of us, but with more people. But, we couldn't find the other people so we decided to do it just with the two of us.\" Their name is simply a reference to the slang word \"hella\" that was common throughout Northern California.\n",
      "Hella's earliest recording was the self-released Leather Diamond EP, hand-assembled in a nondescript cardboard sleeve and sold at some of their first shows.\n"
   ],
   "infobox": {
      "Origin": [
         "Sacramento, California, U.S."
      ],
      "Genres": [
         "Math rock",
         "noise rock",
         "experimental rock",
         "instrumental rock",
         "Nintendocore[1]"
      ],
      "Years active": [
         "2001–present"
      ],
      "Labels": [
         "5 Rue Christine",
         "Suicide Squeeze",
         "Ipecac",
         "Sargent House"
      ],
      "Associated acts": [
         "The Advantage",
         "Team Sleep",
         "sBACH",
         "Wavves",
         "The Holy Smokes",
         "The Ladies",
         "Bygones",
         "The Mars Volta",
         "Death Grips",
         "Nervous Cop",
         "Dilute"
      ],
      "Website": [
         "hella.bandcamp.com"
      ],
      "Members": [
         "Spencer Seim",
         "Zach Hill"
      ],
      "Past members": [
         "Dan Elkan",
         "Josh Hill",
         "Jonathan Hischke",
         "Carson McWhirter",
         "Aaron Ross"
      ]
   }
}