{
   "Name": "Intervals (band)",
   "Sections": [
      "1 History",
      "1.1 Formation and The Space Between EP (2011–2012)",
      "1.2 In Time EP (2012–2013)",
      "1.3 A Voice Within (2013–2015)",
      "1.4 Departure, The Shape of Colour, and The Way Forward (2015–present)",
      "2 Tours",
      "3 Band members",
      "3.1 Timeline",
      "4 Discography",
      "4.1 Music videos",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Intervals is a Canadian progressive metal band. Formed in Toronto, Ontario, the band has toured throughout Canada and the United States with bands such as Animals as Leaders,[1] Protest the Hero, Between the Buried and Me and The Contortionist.\n",
         "Intervals released two EPs, The Space Between (2011) and In Time (2012),[2] and their debut full-length album A Voice Within on March 4, 2014, featuring vocals by Mike Semesky. After the exit of every band member except for guitarist Aaron Marshall, follow-up albums The Shape of Colour (2015), The Way Forward (2017), and Circadian (2020)[3] were released.\n"
      ]
   },
   "History": {
      "Formation and The Space Between EP (2011–2012)": {
         "text": [
            "Intervals was formed in Toronto, Ontario in 2011 as a creative outlet for guitarist Aaron Marshall[4][5] after quitting his previous band, \"Speak of the Devil\".[citation needed] He recorded and programmed all the parts for The Space Between in his home studio, with mixing and mastering by Adam \"Nolly\" Getgood of Periphery, and released independently on December 20, 2011.[6] Marshall attempted to form a full band including a vocalist, with the intention of turning Intervals into a touring act, but failed to do so.\n"
         ]
      },
      "In Time EP (2012–2013)": {
         "text": [
            "With the release of their second EP In Time on October 30, 2012, Marshall was joined by Olly Steele (Monuments) and David Maxim Micic (Destiny Potato). Sputnik Music gave the EP a 4.0/Excellent rating, suggesting that \"if they find a bit more creativity and increase their originality, they have potential to go down in history as one of the best instrumental prog metal bands. As of now, they are still not on the same level as Animals as Leaders.\"[7] The band released a music video for \"Epiphany\" on April 25, 2013 via Guitar World promotion and YouTube.[8] Following the success of In Time, the band gained endorsement deals from Ernie Ball Music Man, Pearl Drums, Meinl Cymbals, Toontrack, InTune Guitar Picks, and Gruv Gear.[9] Marshall also released playthroughs and lessons for certain songs from the EP.[10][11]\n"
         ]
      },
      "A Voice Within (2013–2015)": {
         "text": [
            "On September 14, 2013, Intervals announced they would be entering the studio with producer Jordan Valeriote (Silverstein, Structures, Counterparts) on November 4 to begin tracking their upcoming release.[12] Following the studio, Intervals were scheduled to tour Europe (January - February 2014) with Protest The Hero, TesseracT, and The Safety Fire.[13] On December 30, it was announced that bassist Mike Semesky would be changing his role in the band and provide vocals on the new album; as a result, the album's bass tracks were handled equally by Marshall and Valeriote. The band released Semesky's vocal debut in the form of new single ‘Ephemeral’ via RevolverMag.com, as well as a revelation that the new album would be titled A Voice Within.[14]\n",
            "\nDue to the need for Semesky to focus entirely on his vocal performance live, the band hired Henry Selva (formerly of The Human Abstract) as their live bassist for their upcoming tours. ",
            "\"I'm extremely happy to announce that I am the singer of Intervals. I joined the band on bass in early 2013, but after writing and experimenting with vocals over demos of the band's new material, the four of us knew that that was the direction we were meant to go. I feel so blessed to be a part of such a talented group of musicians and I'm extremely proud of the album we all worked so hard on. We can't wait for you all to hear it!\"[14]",
            " The band released a second song from the album, \"The Escape\", on January 23, 2014 and announced that the album would be released on March 4, 2014.[15] On February 26, the band announced that they would be releasing one new song from the album per day until the day of the album's release. The first of these songs was \"The Self Surrendered\".[16]\n"
         ]
      },
      "Departure, The Shape of Colour, and The Way Forward (2015–present)": {
         "text": [
            "On November 25, 2014, Mike Semesky was announced to have left the band. An instrumental version of A Voice Within was then released on March 3, 2015. On June 23, three months after, Guyader and Sastry announced on Facebook that they would no longer be a part of Intervals. This separation was caused by different expectations about the direction of the band:\n",
            "\"With one more show in 2014 with Protest The Hero and Unearth, this was the first time in well over a year that we were returning to our roots and performing as an instrumental band again. For me, the show felt like a place that I had been missing for so long. It felt like coming home and I was ecstatic. [...] It was clear that the same sentiment was not shared between us. Anup and Lukas wanted to continue searching for a new frontman, and myself and our manager were not comfortable with this. We went back and forth for some time and there was no clear resolution, but I couldn't deny my instinct to resume playing instrumental music, the way this all began.\"[5]",
            "Marshall then introduced new studio musicians, bassist Cameron McLellan (Protest The Hero) and drummer Travis Orbin (Darkest Hour, ex-Periphery, Sky Eats Airplane), to work on the band's next album.[17][5] On December 4, 2015, Intervals released The Shape of Colour.[18][19][4]\n",
            "On October 24, 2017, Intervals announced The Way Forward, a new album with McLellan returning to bass, and new drummer Nathan Bulla, who had been playing live with the band until the release.[20] Marshall continues to be the only official member of the band, despite having returning members for tours and studio recordings.\n"
         ]
      }
   },
   "Tours": {},
   "Band members": {
      "Timeline": {}
   },
   "Discography": {
      "Music videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Intervals is a Canadian progressive metal band. Formed in Toronto, Ontario, the band has toured throughout Canada and the United States with bands such as Animals as Leaders,[1] Protest the Hero, Between the Buried and Me and The Contortionist.\n",
      "Intervals released two EPs, The Space Between (2011) and In Time (2012),[2] and their debut full-length album A Voice Within on March 4, 2014, featuring vocals by Mike Semesky. After the exit of every band member except for guitarist Aaron Marshall, follow-up albums The Shape of Colour (2015), The Way Forward (2017), and Circadian (2020)[3] were released.\n",
      "Intervals was formed in Toronto, Ontario in 2011 as a creative outlet for guitarist Aaron Marshall[4][5] after quitting his previous band, \"Speak of the Devil\".[citation needed] He recorded and programmed all the parts for The Space Between in his home studio, with mixing and mastering by Adam \"Nolly\" Getgood of Periphery, and released independently on December 20, 2011.[6] Marshall attempted to form a full band including a vocalist, with the intention of turning Intervals into a touring act, but failed to do so.\n",
      "With the release of their second EP In Time on October 30, 2012, Marshall was joined by Olly Steele (Monuments) and David Maxim Micic (Destiny Potato). Sputnik Music gave the EP a 4.0/Excellent rating, suggesting that \"if they find a bit more creativity and increase their originality, they have potential to go down in history as one of the best instrumental prog metal bands. As of now, they are still not on the same level as Animals as Leaders.\"[7] The band released a music video for \"Epiphany\" on April 25, 2013 via Guitar World promotion and YouTube.[8] Following the success of In Time, the band gained endorsement deals from Ernie Ball Music Man, Pearl Drums, Meinl Cymbals, Toontrack, InTune Guitar Picks, and Gruv Gear.[9] Marshall also released playthroughs and lessons for certain songs from the EP.[10][11]\n"
   ],
   "infobox": {
      "Origin": [
         "Toronto, Ontario, Canada"
      ],
      "Genres": [
         "Progressive rock, progressive metal, djent, instrumental rock"
      ],
      "Years active": [
         "2011–present"
      ],
      "Associated acts": [
         "The HAARP Machine, Raunchy, Skyharbor, Jeff Loomis, Marty Friedman, Monuments, Destiny Potato, Plini"
      ],
      "Website": [
         "intervalsmusic.net"
      ],
      "Members": [
         "Aaron Marshall"
      ],
      "Past members": [
         "Mike Semesky",
         "Lukas Guyader",
         "Anup Sastry",
         "Matt De Luca"
      ]
   }
}