{
   "Name": "Intervals (band)",
   "rawData": [
      "Intervals is a Canadian progressive metal band. Formed in Toronto, Ontario, the band has toured throughout Canada and the United States with bands such as Animals as Leaders, Protest the Hero, Between the Buried and Me and The Contortionist.\n",
      "Intervals released two EPs, The Space Between (2011) and In Time (2012), and their debut full-length album A Voice Within on March 4, 2014, featuring vocals by Mike Semesky. After the exit of every band member except for guitarist Aaron Marshall, follow-up albums The Shape of Colour (2015), The Way Forward (2017), and Circadian (2020) were released.\n",
      "Intervals was formed in Toronto, Ontario in 2011 as a creative outlet for guitarist Aaron Marshall after quitting his previous band, \"Speak of the Devil\". He recorded and programmed all the parts for The Space Between in his home studio, with mixing and mastering by Adam \"Nolly\" Getgood of Periphery, and released independently on December 20, 2011. Marshall attempted to form a full band including a vocalist, with the intention of turning Intervals into a touring act, but failed to do so.\n"
   ],
   "infobox": {
      "Origin": [
         "Toronto, Ontario, Canada"
      ],
      "Genres": [
         "Progressive rock, progressive metal, djent, instrumental rock"
      ],
      "Years active": [
         "2011–present"
      ],
      "Associated acts": [
         "The HAARP Machine, Raunchy, Skyharbor, Jeff Loomis, Marty Friedman, Monuments, Destiny Potato, Plini"
      ],
      "Website": [
         "intervalsmusic.net"
      ],
      "Members": [
         "Aaron Marshall"
      ],
      "Past members": [
         "Mike Semesky",
         "Lukas Guyader",
         "Anup Sastry",
         "Matt De Luca"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band. Formed in Toronto, Ontario, the band has toured throughout Canada and the United States with bands such as Animals as Leaders, Protest the Hero, Between the Buried and Me and The Contortionist.\n",
      "[BAND_NAME] released two EPs, The Space Between ([YEAR]) and In Time ([YEAR]), and their debut full-length album A Voice Within on [MONTH] 4, [YEAR], featuring vocals by Mike Semesky. After the exit of every band member except for guitarist Aaron [MONTH]shall, follow-up albums The Shape of Colour ([YEAR]), The Way Forward ([YEAR]), and Circadian ([YEAR]) were released.\n",
      "[BAND_NAME] was formed in Toronto, Ontario in [YEAR] as a creative outlet for guitarist Aaron [MONTH]shall after quitting his previous band, \"Speak of the Devil\". He recorded and programmed all the parts for The Space Between in his home studio, with mixing and mastering by Adam \"Nolly\" Getgood of Periphery, and released independently on [MONTH] 20, [YEAR]. [MONTH]shall attempted to form a full band including a vocalist, with the intention of turning [BAND_NAME] into a touring act, but failed to do so.\n"
   ]
}