{
   "Name": "Intronaut",
   "rawData": [
      "Intronaut is an American progressive metal band from Los Angeles, California, that incorporates complex polyrhythms, progressive rock, and jazz.\n",
      "Intronaut formed in 2004, and their initial line-up included guitarist/vocalist Sacha Dunable, guitarist/vocalist Leon del Muerte, drummer Danny Walker, and bassist Joe Lester.  \n",
      "In 2005, Intronaut released a four-track demo entitled Null – Demonstration Extended Play Compact Disc. They signed to Goodfellow Records in October and recorded Void in early April 2006 at Shiva Industries in Santa Ana, California with producer John Haddad.  Void represented the first songwriting effort featuring the band as a whole, as Dunable had written much of the material for Null prior to the other members joining the band.\n"
   ],
   "infobox": {
      "Origin": [
         "Los Angeles, California, U.S."
      ],
      "Genres": [
         "Progressive metal, post-metal, sludge metal, avant-garde metal"
      ],
      "Years active": [
         "2004 (2004)–present"
      ],
      "Labels": [
         "Century Media, Translation Loss, Goodfellow, Lifeforce, Metal Blade"
      ],
      "Website": [
         "intronautofficial.com"
      ],
      "Members": [
         "Sacha Dunable",
         "Dave Timnick",
         "Joe Lester"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Los Angeles, California, that incorporates complex polyrhythms, progressive rock, and jazz.\n",
      "[BAND_NAME] formed in [YEAR], and their initial line-up included guitarist/vocalist [PERSON_NAME_FULL_0_FEMALE], guitarist/vocalist Leon del Muerte, drummer Danny Walker, and bassist [PERSON_NAME_FULL_1_MALE].  \n",
      "In [YEAR], [BAND_NAME] released a four-track demo entitled Null – Demonstration Extended Play Compact Disc. They signed to Goodfellow Records in [MONTH] and recorded Void in early [MONTH] [YEAR] at Shiva Industries in Santa Ana, California with producer John Haddad.  Void represented the first songwriting effort featuring the band as a whole, as Dunable had written much of the material for Null prior to the other members joining the band.\n"
   ]
}