{
   "Name": "Karma to Burn",
   "rawData": [
      "Karma to Burn, sometimes known as K2B, is a desert rock/stoner rock band from Morgantown, West Virginia comprising guitarist William Mecum, bassist Eric Clutter, and drummer Evan Devine. The band are noted for their uncompromising, mostly instrumental sound.\n",
      "Their name comes from a sleevenote on Bob Dylan's 1976 album Desire which reads \"I have a brother or two and a whole lot of karma to burn...\"\n",
      "After years of viral self-promotion (such as phoning record companies pretending to be other bands who'd heard an interesting band called Karma To Burn), Karma To Burn was signed to Roadrunner Records in 1996. They were planning to release an entirely instrumental album, but Roadrunner insisted that the contract was only valid under the condition that they hired a vocalist. After a brief trial of then Kyuss frontman John Garcia, they hired a friend of theirs Jay Jarosz. Their first album Karma To Burn was released in 1997, and despite critical acclaim, sold poorly. The band decided to sack Jarosz and as such were fired from Roadrunner. The band continued, releasing 1999's Wild Wonderful Purgatory and 2001's Almost Heathen as entirely instrumental albums.\n"
   ],
   "infobox": {
      "Origin": [
         "Morgantown, West Virginia, United States"
      ],
      "Genres": [
         "Desert rock, stoner rock, instrumental rock, acid rock, stoner metal, heavy metal"
      ],
      "Years active": [
         "1997–2002, 2009-"
      ],
      "Labels": [
         "Roadrunner, Spitfire Records, Napalm Records"
      ],
      "Associated acts": [
         "Speedealer, Year Long Disaster, Dragon Ass, Sons of Alpha Centauri, Treasure Cat, Nebula, Kyuss"
      ],
      "Website": [
         "http://www.k2burn.net/"
      ],
      "Members": [
         "William Mecum",
         "Eric Clutter",
         "Evan Devine"
      ],
      "Past members": [
         "Rich Mullins",
         "Rob Oswald",
         "Rob Halkett",
         "Daniel Davies",
         "John Garcia",
         "Nathan Limbaugh",
         "Jay Jarosz",
         "Chuck Nicholas",
         "Jim Davison"
      ]
   },
   "prunedData": [
      "[BAND_NAME], sometimes known as K2B, is a [GENRE] band from Morgantown, West Virginia comprising guitarist [PERSON_NAME_FULL_1_MALE], bassist Eric Clutter, and drummer [PERSON_NAME_FULL_0_MALE]. The band are noted for their uncompromising, mostly instrumental sound.\n",
      "Their name comes from a sleevenote on Bob Dylan's [YEAR] album Desire which reads \"I have a brother or two and a whole lot of karma to burn...\"\n",
      "After years of viral self-promotion (such as phoning record companies pretending to be other bands who'd heard an [GENRE] band called Karma To Burn), Karma To Burn was signed to Roadrunner Records in [YEAR]. They were planning to release an entirely instrumental album, but Roadrunner insisted that the contract was only valid under the condition that they hired a vocalist. After a brief trial of then Kyuss frontman John Garcia, they hired a friend of theirs [PERSON_NAME_FULL_0_MALE]. Their first album Karma To Burn was released in [YEAR], and despite critical acclaim, sold poorly. The band decided to sack [PERSON_NAME_LAST_0] and as such were fired from Roadrunner. The band continued, releasing [YEAR]'s Wild Wonderful Purgatory and [YEAR]'s Almost Heathen as entirely instrumental albums.\n"
   ]
}