{
   "Name": "Kinski (band)",
   "rawData": [
      "Kinski is an American rock band from Seattle, Washington. They have released eight albums, a number of split albums and EP.\n",
      "They formed in 1998 in a pub, when bartender and drummer Dave Weeks overheard a conversation between two customers, Chris Martin (guitar) and Lucy Atkinson (bassist)  about analog recording. Weeks joined the discussion, and they found they also shared mutual musical interests, and hence agreed to form a band. They started playing live the same year.\n",
      "Near the end of 1999, guitarist/keyboardist/flautist Matthew Reid Schwartz was added to the line-up. Kinski issued its first record Space Launch for Frenchie earlier that same year consisting of six tracks running for 45 minutes. The band went on their first US tour with Mainliner from Japan, where they befriended Kawabata Makoto, also of Acid Mothers Temple.\n"
   ],
   "infobox": {
      "Origin": [
         "Seattle, Washington, USA"
      ],
      "Genres": [
         "Post-rock, noise rock, Instrumental rock"
      ],
      "Years active": [
         "1998–present"
      ],
      "Labels": [
         "Kill Rock Stars, Sub Pop"
      ],
      "Members": [
         "Chris Martin",
         "Lucy Atkinson",
         "Matthew Reid Schwartz",
         "Barrett Wilke"
      ],
      "Past members": [
         "Dave Weeks"
      ]
   },
   "albums": [
      "Space Launch for Frenchie",
      "Be Gentle With the Warm Turtle",
      "Airs Above Your Station",
      "Crickets and Fireflies",
      "Don't Climb on and Take the Holy Water",
      "Alpine Static",
      "Down Below It's Chaos",
      "Cosy Moments",
      "7 (or 8)",
      "Accustomed to Your Face"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Seattle, Washington. They have released eight albums, a number of split albums and EP.\n",
      "They formed in [YEAR] in a [GENRE] a conversation between two customers, Chris [MONTH]tin (guitar) and [PERSON_NAME_FULL_0_FEMALE] (bassist)  about analog recording. Weeks joined the discussion, and they found they also shared mutual musical interests, and hence agreed to form a band. They started playing live the same year.\n",
      "Near the end of [YEAR], guitarist/keyboardist/flautist Matthew Reid Schwartz was added to the line-up. [BAND_NAME] issued its first record Space Launch for Frenchie earlier that same year consisting of six tracks running for 45 minutes. The band went on their first US tour with Mainliner from Japan, where they befriended Kawabata Makoto, also of Acid Mothers Temple.\n"
   ]
}