{
   "Name": "Kinski (band)",
   "Sections": [
      "1 Career",
      "2 Band members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Kinski is an American rock band from Seattle, Washington. They have released eight albums, a number of split albums and EP.[1]\n"
      ]
   },
   "Career": {
      "text": [
         "They formed in 1998 in a pub, when bartender and drummer Dave Weeks overheard a conversation between two customers, Chris Martin (guitar) and Lucy Atkinson (bassist)  about analog recording. Weeks joined the discussion, and they found they also shared mutual musical interests, and hence agreed to form a band. They started playing live the same year.\n",
         "Near the end of 1999, guitarist/keyboardist/flautist Matthew Reid Schwartz was added to the line-up. Kinski issued its first record Space Launch for Frenchie earlier that same year consisting of six tracks running for 45 minutes. The band went on their first US tour with Mainliner from Japan, where they befriended Kawabata Makoto, also of Acid Mothers Temple.\n",
         "Tours throughout the US would follow the next two years with such bands as Hovercraft, Silkworm, and Primordial Undermind.  Their second album, Be Gentle With the Warm Turtle, came out on Pacifico in 2001.[2] The band also toured Japan with Acid Mothers Temple in late 2001.\n",
         "In early 2002, after the band finished recording their third album, Weeks left and later went on to join Seattle band Black Panties.[3] That summer, Barrett Wilke took over on drums. The band at this time signed with Sub Pop. The album Airs Above Your Station was released in 2003.\n",
         "Later in 2003, Sub Pop issued a split album with Kinski and Acid Mothers Temple. Each band contributed their own material for this release, along with two collaborative pieces that were recorded during their earlier tour of Japan.  Finally, the three-way \"triptych\" split, Crickets and Fireflies, was released by the Music Fellowship label with the bands Paik & Surface of Eceon.\n",
         "Around the time that Weeks left the band, the remaining members began performing as an improvisational threesome under the name Herzog. An album, Don't Climb on and Take the Holy Water, was issued in 2004 by the Strange Attractors Audio House label consisting of live recordings from Herzog performances. The band also contributed a track to the Franco Battiato tribute album, What's Your Function. A brief west coast tour with Mission of Burma rounded out the year.\n",
         "In 2005, the band came back with Alpine Static, their sixth album overall and third on Sub Pop produced by Randall Dunn.[3] Tours throughout the US, Europe, and Japan followed, stopping in London for a session with Huw Stephens on BBC Radio 1.\n",
         "Kinski was the opening act during the spring 2007 leg of Tool's 10,000 Days tour. Just before leaving for this tour, they finished their seventh album, Down Below It's Chaos which was released on August 21, 2007.\n",
         "In August 2012, it was announced that Kinski' had signed with Kill Rock Stars.[4] The album, Cosy Moments was released April 3, 2013.[5] In February 2015 the band released a split EP with fellow Seattle band Sandrider on Seattle label Good to Die Records.[6]\n",
         "The second album on Kill Rock Stars[7] entitled 7 (or 8), was recorded and mixed in San Francisco at El Studio with Phil Manley (of Trans Am) and was released in June 2015.[8]\n",
         "In 2017 Kinski adapted a passage of James Joyce's Finnegans Wake for the Waywords and Meansigns project.[9]\n",
         "In August 2018, it was announced that for Kinski's 20th anniversary as a band, they would be releasing a vinyl reissue of Be Gentle With the Warm Turtle as well as releasing a new album titled Accustomed To Your Face, with both albums being released on Kill Rock Stars on October 12th, 2018. [10]\n"
      ]
   },
   "Band members": {},
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Kinski is an American rock band from Seattle, Washington. They have released eight albums, a number of split albums and EP.[1]\n",
      "They formed in 1998 in a pub, when bartender and drummer Dave Weeks overheard a conversation between two customers, Chris Martin (guitar) and Lucy Atkinson (bassist)  about analog recording. Weeks joined the discussion, and they found they also shared mutual musical interests, and hence agreed to form a band. They started playing live the same year.\n",
      "Near the end of 1999, guitarist/keyboardist/flautist Matthew Reid Schwartz was added to the line-up. Kinski issued its first record Space Launch for Frenchie earlier that same year consisting of six tracks running for 45 minutes. The band went on their first US tour with Mainliner from Japan, where they befriended Kawabata Makoto, also of Acid Mothers Temple.\n",
      "Tours throughout the US would follow the next two years with such bands as Hovercraft, Silkworm, and Primordial Undermind.  Their second album, Be Gentle With the Warm Turtle, came out on Pacifico in 2001.[2] The band also toured Japan with Acid Mothers Temple in late 2001.\n"
   ]
}