{
   "Name": "Lymbyc Systym",
   "rawData": [
      "Lymbyc Systym is an American instrumental band from Tempe, Arizona, United States, which formed in 2001, consisting of brothers Jared and Michael Bell. Their sound combines elements of instrumental rock and electronic music.  Lymbyc Systym have toured with Broken Social Scene, The Books, Crystal Castles, The Album Leaf,  Her Space Holiday, Buckethead, This Will Destroy You, Foxing and The One AM Radio.  The duo have released records with Mush Records, Magic Bullet Records, Hobbledehoy Record Co, Western Vinyl and & Records (Japan). Michael Bell died on November 10, 2016, under undisclosed circumstances, leaving the future of Lymbyc Systym uncertain.\n",
      "Jared Bell says the intentional misspelling of the Limbic System was to own it, lamenting comparisons to Lynyrd Skynyrd. For much of the recording of their 2012 album, Symbolyst the brothers were not in the same state. \"Our first full length when we lived in the same house in south Scottsdale, we were treating it like a job and we literally worked on it every day until it was done,\" Michael Bell has explained. \"After that, it morphed into a process of exchanging ideas online ... Even when we lived in New York, we never met up until the end. We worked on stuff separately and exchanged ideas \"\n"
   ],
   "infobox": {
      "Origin": [
         "Tempe, Arizona, United States"
      ],
      "Genres": [
         "Electronic, ambient, post-rock, synthwave"
      ],
      "Years active": [
         "2001–present"
      ],
      "Labels": [
         "Western Vinyl, Magic Bullet, Mush, Hobbledehoy, & (Japan)"
      ],
      "Members": [
         "Jared Bell"
      ],
      "Past members": [
         "Mike Bell (deceased)"
      ]
   },
   "albums": [
      "Carved by Glaciers",
      "Love Your Abuser",
      "Love Your Abuser Remixed",
      "Field Studies",
      "Shutter Release",
      "Symbolyst",
      "Split Stones",
      "New Varieties"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Tempe, Arizona, United States, which formed in [YEAR], consisting of brothers Jared and Michael Bell. Their sound combines elements of instrumental rock and electronic music.  [BAND_NAME] have toured with Broken Social Scene, The Books, Crystal Castles, The Album Leaf,  Her Space Holiday, Buckethead, This Will Destroy You, Foxing and The One AM Radio.  The duo have released records with Mush Records, Magic Bullet Records, Hobbledehoy Record Co, Western Vinyl and & Records (Japan). Michael Bell died on [MONTH] 10, [YEAR], under undisclosed circumstances, leaving the future of [BAND_NAME] uncertain.\n",
      "Jared Bell says the intentional misspelling of the Limbic System was to own it, lamenting comparisons to Lynyrd Skynyrd. For much of the recording of their [YEAR] album, Symbolyst the brothers were not in the same state. [SONG_NAME]\n"
   ]
}