{
   "Name": "Mono (Japanese band)",
   "rawData": [
      "Mono (stylised as MONO) is a Japanese instrumental band, formed in 1999 in Tokyo. The band consists of Takaakira \"Taka\" Goto (electric guitar, glockenspiel), Hideki \"Yoda\" Suematsu (electric guitar, glockenspiel), Dahm Majuri Cipolla (drums), and Tamaki Kunishi (bass guitar, electric guitar, piano, glockenspiel).\n",
      "Mono have released nine studio albums. The band spent their early years, from 1999 to 2003, touring Asia, Europe, and America continuously, and released two studio albums, Under the Pipal Tree (2001) and One Step More and You Die (2002) on the Tzadik Records and Music Mine Inc. record labels, respectively. From 2004 to 2007, Mono signed to Temporary Residence Limited, released two more studio albums, Walking Cloud and Deep Red Sky, Flag Fluttered and the Sun Shined (2004) and You Are There (2006), and toured worldwide in their support. In 2008, the band took a break, returning one year later with a new studio album, Hymn to the Immortal Wind (2009), also on Temporary Residence Limited. During the tour that followed they recorded a live album, Holy Ground: NYC Live With The Wordless Music Orchestra which was released in 2010. In October 2016 the band released their ninth studio album, titled Requiem for Hell. Their most recent effort, Nowhere Now Here was released on January 25, 2019 through Pelagic Records, and was produced by the band's longtime friend Steve Albini at Electrical Audio, Chicago. It also contains Tamaki's first vocals for the band on the track \"Breathe\".\n",
      "The band have cited a variety of experimental, avant-rock and classical music artists as inspirations but stated that their aim is to transcend genre, rejecting the post-rock label which has often been applied to them. Mono's sound is characterised by the lead and rhythm guitars of Goto and Yoda respectively, both of whom make extensive use of reverb, distortion and delay effects. The band's live performances are noted for their intensity, both in the playing and in the dynamics.\n"
   ],
   "infobox": {
      "Origin": [
         "Tokyo, Japan"
      ],
      "Genres": [
         "Post-rock",
         "contemporary classical"
      ],
      "Years active": [
         "1999–present"
      ],
      "Labels": [
         "Temporary Residence Limited, Pelagic Records, Conspiracy, Human Highway, Tzadik"
      ],
      "Website": [
         "www.monoofjapan.com"
      ],
      "Members": [
         "Takaakira \"Taka\" Goto",
         "Hideki \"Yoda\" Suematsu",
         "Dahm Majuri Cipolla",
         "Tamaki Kunishi"
      ],
      "Past members": [
         "Yasunori Takada"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (stylised as MONO) is a [GENRE] band, formed in [YEAR] in Tokyo. The band consists of Takaakira \"Taka\" Goto (electric guitar, glockenspiel), Hideki \"Yoda\" Suematsu (electric guitar, glockenspiel), Dahm Majuri Cipolla (drums), and [PERSON_NAME_FULL_0_FEMALE] (bass guitar, electric guitar, piano, glockenspiel).\n",
      "[BAND_NAME] have released nine studio albums. The band spent their early years, from [YEAR] to [YEAR], touring Asia, Europe, and America continuously, and released two studio albums, Under the Pipal Tree ([YEAR]) and One Step More and You Die ([YEAR]) on the Tzadik Records and Music Mine Inc. record labels, respectively. From [YEAR] to [YEAR], [BAND_NAME] signed to Temporary Residence Limited, released two more studio albums, Walking Cloud and Deep Red Sky, Flag Fluttered and the Sun Shined ([YEAR]) and You Are There ([YEAR]), and toured worldwide in their support. In [YEAR], the band took a [GENRE] a new studio album, Hymn to the Immortal Wind ([YEAR]), also on Temporary Residence Limited. During the tour that followed they recorded a live album, Holy Ground: NYC Live With The Wordless Music Orchestra which was released in [YEAR]. In [MONTH] [YEAR] the band released their ninth studio album, titled Requiem for Hell. Their most recent effort, Nowhere Now Here was released on [MONTH] 25, [YEAR] through Pelagic Records, and was produced by the band's longtime friend [PERSON_NAME_FULL_0_MALE] at Electrical Audio, Chicago. It also contains Tamaki's first vocals for the band on the track \"Breathe\".\n",
      "The band have cited a variety of experimental, avant-rock and classical music artists as inspirations but stated that their aim is to transcend genre, rejecting the post-rock label which has often been applied to them. [BAND_NAME]'s sound is characterised by the lead and rhythm guitars of Goto and Yoda respectively, both of whom make extensive use of reverb, distortion and delay effects. The band's live performances are noted for their intensity, both in the playing and in the dynamics.\n"
   ]
}