{
   "Name": "Mount Rushmore (band)",
   "rawData": [
      "Mount Rushmore was a rock band in the late 1960s from San Francisco, California that played a heavy blues rock style with psychedelic elements.\n",
      "The band formed in early 1967 at 1915 Oak Street, a large Victorian rooming house in the Haight-Ashbury district. The original members were Ed Levin (ex-Vipers), Warren Phillips (ex Blue House Basement), Thomas Dotzler, Mike Bolan and Danny Wei. Wei was soon replaced by Terry Kimble on bass guitar. In June and July 1967 they were featured on posters for shows at the Avalon Ballroom with many other bands including The Doors, Procol Harum, The Paul Butterfield Blues Band, The Grateful Dead, Steve Miller, Santana,  Quicksilver Messenger Service, and Big Brother and the Holding Company. In June 1967 Mount Rushmore played 2 sets at The KFRC Fantasy Fair and Magic Mountain Music Festival; it was just one week before the Monterey Pop Festival which is considered the world's first \"Rock Festival\". In March 1968 Dotzler left to join local band Phoenix, and was soon followed by Phillips and Levin. Bolan and Kimble added Glenn Smith and Travis Fullerton to the line up and the group made two albums.\n",
      "Warren B. Phillips was the former lead singer of the band and wrote a few songs that were recorded by the band after he left.\n"
   ],
   "infobox": {},
   "albums": [],
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band in the late [YEAR]s from San Francisco, California that played a heavy blues [GENRE] style with psychedelic elements.\n",
      "The band formed in early [YEAR] at [YEAR] Oak Street, a large Victorian rooming house in the Haight-Ashbury district. The original members were Ed Levin (ex-Vipers), [PERSON_NAME_FULL_2_MALE] (ex Blue House Basement), [PERSON_NAME_FULL_1_MALE], Mike Bolan and [PERSON_NAME_FULL_0_MALE]. [PERSON_NAME_LAST_0] was soon replaced by Terry Kimble on bass guitar. In [MONTH] and [MONTH] [YEAR] they were featured on posters for shows at the Avalon Ballroom with many other bands including The Doors, Procol Harum, The Paul Butterfield Blues Band, The Grateful Dead, [PERSON_NAME_FULL_4_MALE], Santana,  Quicksilver Messenger Service, and Big Brother and the Holding Company. In [MONTH] [YEAR] [BAND_NAME] played 2 sets at The KFRC Fantasy Fair and Magic Mountain Music Festival; it was just one week before the Monterey Pop Festival which is considered the world's first [SONG_NAME]. In [MONTH] [YEAR] [PERSON_NAME_LAST_1] left to join local band Phoenix, and was soon followed by [PERSON_NAME_LAST_2] and Levin. Bolan and Kimble added [PERSON_NAME_FULL_3_MALE] and [PERSON_NAME_FULL_5_MALE] to the line up and the group made two albums.\n",
      "Warren B. Phillips was the former lead singer of the band and wrote a [GENRE] band after he left.\n"
   ]
}