{
   "Name": "The Octopus Project",
   "rawData": [
      "The Octopus Project is an American indietronica band based in Austin, Texas, active since 1999. Their sound blends pop and experimental elements, and is a combination of digital and electronic sounds and noises (including drum machine, keyboard, synthesizers and other devices) and analog equipment (including guitars and live drums). The band's music is mostly instrumental.\n",
      "On April 30, 2006, the Octopus Project performed at the Coachella Valley Music and Arts Festival. They were offered the opportunity after a fan, unbeknownst to the band, entered them in a contest held by the festival on MySpace in which voters were to \"nominate their favorite band for an open slot at the festival\". In 2007, they supported underground hip hop star, Aesop Rock and indie electronic icons Stereo Total on their national tours. In 2008, the group performed at notable festivals such as Lollapalooza, All Tomorrow's Parties, and the Austin City Limits Festival.\n",
      "The Octopus Project composed and performed a series of unique, individual scores for short films played at Alamo Drafthouse in Austin, Texas in February 2009. For their performance at the South by Southwest festival in their hometown in March 2010, the band put together a multi-media show which involved them performing material from what was to be their upcoming release, Hexadecagon. The band performed surrounded by eight loudspeakers, while eight projectors projected videos corresponding to the music on tent ceilings above the stage and the audience. Later that same year, the Octopus Project played at Moogfest 2010 in Asheville, North Carolina. They were scheduled to play just prior to Devo's headlining set. Three days prior to the concert, Devo's guitarist, Bob Mothersbaugh, severely injured his hand and was unable to play. Since the band was receiving a Moog Innovation Award at the festival, and because they didn't want to disappoint their fans, the remaining two members of Devo enlisted the help of The Octopus Project, and together the two bands performed the Devo songs \"Girl U Want\" and \"Beautiful World.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Austin, Texas, United States"
      ],
      "Genres": [
         "Experimental, indie pop, electronica, psychedelic pop, Nintendocore"
      ],
      "Years active": [
         "1999–present"
      ],
      "Labels": [
         "Peek-A-Boo Records"
      ],
      "Website": [
         "www.theoctopusproject.com"
      ],
      "Members": [
         "Josh Lambert",
         "Toto Miranda",
         "Yvonne Lambert",
         "Mari Rubio"
      ],
      "Past members": [
         "Ryan Figg",
         "Colin Swietek",
         "Brandon Durham",
         "John Schmersal",
         "Evan Dickson",
         "Dustin Kilgore",
         "Nik Snell",
         "Lauren Gurgiolo",
         "Kevin Adickes",
         "Wiley Wiggins"
      ]
   },
   "albums": [
      "Identification Parade",
      "One Ten Hundred Thousand Million",
      "Hello, Avalanche",
      "Hexadecagon",
      "Fever Forms",
      "Memory Mirror"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band based in Austin, Texas, active since [YEAR]. Their sound blends pop and experimental elements, and is a combination of digital and electronic sounds and noises (including drum machine, keyboard, synthesizers and other devices) and analog equipment (including guitars and live drums). The band's music is mostly instrumental.\n",
      "On [MONTH] 30, [YEAR], the [MONTH]opus Project performed at the Coachella Valley Music and Arts Festival. They were offered the opportunity after a [GENRE] band, entered them in a contest held by the festival on MySpace in which voters were to [SONG_NAME]. In [YEAR], they supported underground hip hop star, Aesop Rock and indie electronic icons Stereo Total on their national tours. In [YEAR], the group performed at notable festivals such as Lollapalooza, All Tomorrow's Parties, and the Austin City Limits Festival.\n",
      "[BAND_NAME] composed and performed a series of unique, individual scores for short films played at Alamo Drafthouse in Austin, Texas in [MONTH] [YEAR]. For their performance at the South by Southwest festival in their hometown in [MONTH] [YEAR], the band put together a multi-media show which involved them performing material from what was to be their upcoming release, Hexadecagon. The band performed surrounded by eight loudspeakers, while eight projectors projected videos corresponding to the music on tent ceilings above the stage and the audience. Later that same year, the [MONTH]opus Project played at Moogfest [YEAR] in Asheville, North Carolina. They were scheduled to play just prior to Devo's headlining set. Three days prior to the concert, Devo's guitarist, Bob Mothersbaugh, severely injured his hand and was unable to play. Since the band was receiving a Moog Innovation Award at the festival, and because they didn't want to disappoint their fans, the remaining two members of Devo enlisted the help of [BAND_NAME], and together the two bands performed the Devo songs [SONG_NAME]\n"
   ]
}