{
   "Discography": {
      "Demos": {},
      "EPs": {},
      "LP Studio albums": {},
      "Music videos": {
         "text": [
            "\n",
            "(featuring Jason Richardson)\n"
         ]
      },
      "Singles": {}
   },
   "History": {
      "text": [
         "Polyphia first achieved mainstream success when the guitar play-through of \"Impassion\", from the EP, Inspire, went viral on YouTube. The band continues to grow in popularity and have gone on several national tours sharing the stage with the likes of progressive metalcore giants such as Periphery, Between the Buried and Me, and August Burns Red.[1]\n",
         "Polyphia has featured artists such as Jason Richardson (ex-Chelsea Grin, ex-Born of Osiris, ex-All Shall Perish and All That Remains), Aaron Marshall (Intervals), Mario Camarena (Chon), Erick Hansel (Chon), Yvette Young (Covet), Rick Graham, Nick Johnston, Jakub Żytecki, Lewis Grant, Ichika Nito and Mateus Asato.[2]\n",
         "The band states that their influences come from artists of all genres. The group started out with a heavier shred-oriented sound but has since matured into a more melodic-focused band. When describing the album, Muse, Timothy Henson says that the primary inspiration comes from pop and rap music as to not draw influence from other artists of their genre.[3]\n"
      ]
   },
   "Members": {
      "text": [
         "Current members\n",
         "Former members\n"
      ]
   },
   "Reception": {
      "text": [
         "Metal Injection wrote in their review of Muse: \"Basically, if you're looking for some really great instrumental music that stays away from the pitfalls of modern instrumental metal and will not be leaving your rotation anytime soon, grab Muse. Or if you're looking for a few songs to hum madly to yourself throughout your daily life because they simply will not leave your head...again, this album right here. Get it.\"[5]\n",
         "During their first headlining tour, Polyphia, solo metal act Jason Richardson, and math rock band Covet were all part of a video and interview by alternative press.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Style and influences",
      "3 Members",
      "4 Reception",
      "5 Discography",
      "5.1 LP Studio albums",
      "5.2 EPs",
      "5.3 Demos",
      "5.4 Singles",
      "5.5 Music videos",
      "6 References"
   ],
   "Style and influences": {
      "text": [
         "The band was originally known for classical guitar covers on YouTube. Their first EP, Inspire and first LP Muse both show the band's appreciation for pop music[how?]. However, both works employ more progressive metal influences than their later releases.[4] This associated them with the djent movement, although they were characteristically less heavy and more melody-based than their peers. Their second LP studio album, Renaissance, saw the band diverge further away from metal, into a more progressive rock and math rock influenced sound. They also began to mix elements of EDM, Funk, and Hip-hop into the mix with the single LIT, a remix of the song Light, the second track on Renaissance. This sound was further developed with the release of their second EP The Most Hated and third LP New Levels New Devils, which featured production from hip-hop and EDM producers Judge and Y2K.\n"
      ]
   },
   "Summary": {
      "text": [
         "Polyphia is a primarily instrumental progressive rock band based in Dallas, Texas that formed in 2010.\n"
      ]
   },
   "Title": "Polyphia - Wikipedia"
}