{
   "Discography": {
      "Extended plays": {},
      "Music videos": {},
      "Remix albums": {},
      "Studio albums": {},
      "Tributes": {}
   },
   "External links": {},
   "History": {
      "E1 Music, Saturday Morning Apocalypse, and future albums (2009 - present)": {
         "text": [
            "Since then, the band has begun writing their third album, stated by the band on their MySpace page.[11] It has been stated that they will most likely record their new album as they recorded Metal Kombat.[5] At this point, the band had demos for three possible songs.[5] In July 2009, guitarist Chris Marchiel stated in a blog on the band's official MySpace that the band is about to record two albums. The first was centered around TV, cartoon, and movie themes the band grew up with. Some songs mentioned were the Pokémon theme song, Danny Elfman's \"This Is Halloween\" from Tim Burton's The Nightmare Before Christmas, The Flintstones, and more. Marchiel stated that the second album, which he had hoped would be released sometime by the end of 2011, will return to the band's brand of video game metal. The only song possibility mentioned for this album was \"Snake Man\" from Mega Man 3. The band announced in late July 2009 that they had begun recording. Powerglove signed to notable record company E1 Music in May 2010.[12] The TV album, titled Saturday Morning Apocalypse, was released September 28, 2010, through E1 Music.[13]\n",
            "In 2010, Powerglove toured the U.S. and Canada with Swedish power metal act HammerFall and followed that tour immediately with another U.S./Canadian tour with Sonata Arctica and Mutiny Within.[13] Powerglove was a part of the 2011 Summer Slaughter Tour in North America alongside co-headliners Whitechapel and The Black Dahlia Murder.\n",
            "Powerglove released a Japan-only album entitled TV Game Metal, featuring remixed and re-recorded versions of their older songs through Marquee/Avalon Records on July 25, 2012. They will also be limiting touring starting in August to focus on recording their next full-length album, which will return to their video game cover roots.[citation needed]\n",
            "Powerglove began releasing single tracks off their new album \"Continue?\". The first track was a song from Kirby (Gourmet Race) and the second was a medley of songs from Super Metroid featuring Kraid's Lair.[14] The album \"Continue?\" was announced with a release date of May 15, 2018.[15]\n"
         ]
      },
      "Formation, Total Pwnage, and Metal Kombat (2003 - 2008)": {
         "text": [
            "The band was started as a side project of the members various other bands. A melodic death metal band all the members were in disbanded, and the group decided to further develop Powerglove. The band's first recording was \"Dr. Wily's Theme\" from Mega Man 2 in early 2003, which was followed by \"Storm Eagle\" from Mega Man X and the theme from Mighty Morphin Power Rangers.[4]\n",
            "The band records their music in various locations and mixes them in a home studio.[5] The band recorded and released its debut EP, Total Pwnage, in 2005 (later re-released in 2008). Over the following two years, the band arranged and recorded what would become their debut, full-length album, Metal Kombat for the Mortal Man. The album met positive reviews.[6][7][8][9][10] Throughout 2008, following the release of Metal Kombat for the Mortal Man, the band had found its way into many publications, such as Game Informer, Metal Hammer, and Gamepro, including interviews with the band members and album reviews.\n",
            "In May 2008, the band embarked on their first U.S. tour with bands Psychostick and Look What I Did. It was during this tour that power metal guitarist Herman Li invited the band to open for his group, DragonForce, at the Roseland Theater in Portland, Oregon. After this performance, the band was invited to be a part of DragonForce's Ultra Beatdown U.S. and Canadian tour, which took place November–December 2008 along with the Finnish metal band Turisas.\n"
         ]
      }
   },
   "Members": {
      "Current": {},
      "Former": {},
      "Session": {},
      "Touring": {}
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Formation, Total Pwnage, and Metal Kombat (2003 - 2008)",
      "1.2 E1 Music, Saturday Morning Apocalypse, and future albums (2009 - present)",
      "2 Vocalist",
      "3 Members",
      "3.1 Current",
      "3.2 Former",
      "3.3 Session",
      "3.4 Touring",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Remix albums",
      "4.3 Extended plays",
      "4.4 Music videos",
      "4.5 Tributes",
      "5 See also",
      "6 References",
      "7 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "Powerglove is an American instrumental power metal cover band. They are known to play metal cover versions of classic video game themes. The band is named after the Power Glove, a NES controller accessory.\n"
      ]
   },
   "Title": "Powerglove (band) - Wikipedia",
   "Vocalist": {
      "text": [
         "At one point Powerglove was considering looking for a vocalist, but could never find the right fit for the music.[5] Guitarist Chris Marchiel stated that if they had lyrics, they would be phenomenally stupid and they would be funny at first, but get old very fast.[5] He stated that they take a lighthearted approach to their image and live show, but take their music very seriously, and there would be no way to write serious lyrics.[5]  On the album Saturday Morning Apocalypse, they collaborated with Sonata Arctica frontman Tony Kakko to record the theme song for the Pokémon anime series, which is their only song with complete lead vocals, and the Simpsons theme where he provides the eponymous title lyric and an ending choral section. On the album Continue? there was a song featuring DragonForce vocalist, Marc Hudson.\n"
      ]
   }
}