{
   "Name": "Rain (Japanese band)",
   "rawData": [
      "Ra:IN (an acronym for \"Rock and Inspiration\") is a Japanese instrumental rock band. Formed in 2002 by Pata, Michiaki and Tetsu, the group is signed to the Danger Crue label. Former hide with Spread Beaver keyboardist DIE joined the band in May 2007, and drummer Tetsu left in April 2014, being replaced by Ryu. They have released three albums, a single and a two track EP, and have toured extensively, including international shows in China, Taiwan, France, Italy, Germany, Spain and Russia.\n",
      "Ra:IN was formed in October 2002 with Pata on guitar, Michiaki on bass and Tetsu on drums. They were named by Masayoshi Kabe, Michiaki's bandmate in Zoku Zoku Kazoku. They went on their first tour in December, with their debut maxi-single \"The Border\" released in April of next year. It was followed by their first album The Line in November. They had their first overseas performances in 2004; Shanghai on April 24-25 and one in Taipei in July. RaIN performed three shows in Paris in May 2005, and at the closing of the hide museum on September 9 back in Japan.\n",
      "They released their second album Before the Siren, their first on popular independent record label Danger Crue, in March 2006 and embarked on tour in support of it, which included two more shows in Taipei. In 2007 they released the DVD Hard Rain and Rocks Live and performed two shows in Beijing, one of which was at the Beijing Pop Festival. That year keyboardist DIE joined the band. Their third album Metal Box was released in Japan in April 2008 and in France the following month. They also performed at the hide memorial summit at Ajinomoto Stadium on May 3.\n"
   ],
   "infobox": {
      "Origin": [
         "Japan"
      ],
      "Genres": [
         "Instrumental rock",
         "hard rock",
         "progressive rock"
      ],
      "Years active": [
         "2002–present"
      ],
      "Labels": [
         "Danger Crue"
      ],
      "Associated acts": [
         "X Japan",
         "hide with Spread Beaver",
         "Red Warriors",
         "Tensaw"
      ],
      "Website": [
         "Official site"
      ],
      "Members": [
         "Pata",
         "Michiaki",
         "DIE",
         "Ryu"
      ],
      "Past members": [
         "Tetsu"
      ]
   },
   "albums": [
      "The Line",
      "Before the Siren",
      "Metal Box"
   ],
   "prunedData": [
      "Ra:IN (an acronym for [SONG_NAME]) is a [GENRE] band. Formed in [YEAR] by Pata, [PERSON_NAME_FULL_2_MALE] and [PERSON_NAME_FULL_1_MALE], the group is signed to the Danger Crue label. Former hide with Spread Beaver keyboardist DIE joined the band in [MONTH] [YEAR], and drummer [PERSON_NAME_FULL_1_MALE] left in [MONTH] [YEAR], being replaced by [PERSON_NAME_FULL_0_MALE]. They have released three albums, a single and a two track EP, and have toured extensively, including international shows in China, Taiwan, France, Italy, Germany, Spain and Russia.\n",
      "Ra:IN was formed in [MONTH] [YEAR] with Pata on guitar, [PERSON_NAME_FULL_2_MALE] on bass and [PERSON_NAME_FULL_1_MALE] on drums. They were named by [PERSON_NAME_FULL_0_MALE], [PERSON_NAME_FULL_2_MALE]'s bandmate in Zoku Zoku Kazoku. They went on their first tour in [MONTH], with their debut maxi-single [SONG_NAME] released in [MONTH] of next year. It was followed by their first album The Line in [MONTH]. They had their first overseas performances in [YEAR]; Shanghai on [MONTH] 24-25 and one in Taipei in [MONTH]. RaIN performed three shows in Paris in [MONTH] [YEAR], and at the closing of the hide museum on [MONTH] 9 back in Japan.\n",
      "They released their second album Before the Siren, their first on popular independent record label Danger Crue, in [MONTH] [YEAR] and embarked on tour in support of it, which included two more shows in Taipei. In [YEAR] they released the DVD Hard [BAND_NAME] and Rocks Live and performed two shows in Beijing, one of which was at the Beijing Pop Festival. That year keyboardist DIE joined the band. Their third album Metal Box was released in Japan in [MONTH] [YEAR] and in France the following month. They also performed at the hide memorial summit at Ajinomoto Stadium on [MONTH] 3.\n"
   ]
}