{
   "Name": "The Redneck Manifesto (band)",
   "Sections": [
      "1 History",
      "2 Releases",
      "2.1 Albums",
      "2.2 Extended plays",
      "2.3 Singles",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "The Redneck Manifesto are an instrumental rock band from Dublin, Ireland. Its members are Richard Egan (bass), Niall Byrne (guitar) & Matthew Bolger (guitar).  Past members include Mervyn Craig (drums), Neil O'Connor (keyboards, percussion) & Glenn Keating (keyboards, percussion).\n"
      ]
   },
   "History": {
      "text": [
         "The Redneck Manifesto formed in August 1998[1] as a four-piece band. The band members had previously played separately in several Dublin bands - Niall Byrne in Jackbeast, Richie Egan in Black Belt Jones[2] and Sir Killalot,[3] and Matthew Bolger in The Waltons. Mervyn Craig had played in the Dundalk band Hylton Weir. Neil O'Connor joined the band in 2003, having previously played with the Connect 4 Orchestra. The band first started playing gigs in Dublin and released a number of 7\" singles on their own Greyslate label; as well as a split 7\" released on Road Relish.\n",
         "Their debut album Thirtysixstrings was recorded by Alan O'Boyle (Decal/Legion of Two) and released as a joint venture with French label Red F Records in 2001.[4] It was well received by press and fans, and was acclaimed 'Irish album of the year' for 2001 by the Event Guide (Dublin).[5]\n",
         "In March 2002 the band undertook their first headline European tour. In a bid to help defray tour costs they released a companion piece to 'Thirty Six Strings' in the form of an extended EP Cut Your Heart Off from Your Head. This was again recorded with producer Alan O'Boyle. Equally receiving very favourable reviews, and again being self-released, the band found it difficult to keep up with the sales demands the EP placed on them.[citation needed]\n",
         "In 2003 The Redneck Manifesto played to a capacity audience at the Witness festival in Ireland.[citation needed] Also in March that year, having featured on a number of BMX video soundtracks and received interest from the US BMX-ing community they travelled to play their first shows in the US, and at the 2003 South by South West music festival in Texas.[6]\n",
         "In March 2004 the band travelled to France to record their third album I Am Brazil. The album was recorded in Black Box Studios by producer Dave Odlum. It was the first recording as a five-piece band and as such shows an expanded and developed sound that moves on from 'Cut Your Heart Off From Your Head'.\n",
         "In 2006 the band released an EP RMNMN. It was intended as a free CDEP for those who attended their Vicar Street headline gig in 2006. The CD was meant to be available soon after the gig but due to financial and CD pressing issues, the release was pushed back from its June 1, 2006, release date. Owing to the number of lost tickets (tickets were required to collect the CD) the band put the EP up for download on their website along with hi res versions of the artwork. The EP also increased from being a two-track EP to a five-track with each member contributing a track.[7]\n",
         "Regarded as one of Ireland's finest live bands, the group are resolutely independent and have repeatedly bypassed normal music industry channels. The successes they have achieved to date - sold-out venues and snapped-up recordings issued on their own label - have been based entirely on their own merits, hard work and a phenomenal word-of-mouth reputation.[8]\n",
         "On 23 November 2008 a bulletin was posted on their MySpace page stating that they were working on an album and hoping to release it early the following year.[9] In March 2010 the record Friendship was finally released.[10]\n",
         "In May 2014, it emerged that two of the members, Egan and Bolger were living in Malmö in Sweden and had formed a new band called Dimman. Their first two-track EP was released on 21 May 2014.[11]\n",
         "Their next album, The How, was recorded in June 2017 in Donegal and was released in 2018. “The Rednecks has always been pure, a joyful thing, playing together for the purity of hearing what each other is going to play.\" Richie Egan told GoldenPlec[12] in an interview promoting their 20th anniversary show in Vicar Street on November 30th, 2018.\n"
      ]
   },
   "Releases": {
      "Albums": {},
      "Extended plays": {},
      "Singles": {
         "text": [
            "In Hindsight\nEugene's Hot Lunch\n",
            "He Threw Down His Rifle and Ran\n",
            "Go Goat Go\nBringing Back The Buffalo\n",
            "Hit Him In The Belly With A Hammer\n",
            "Loopy Lou Meet Jimmy Joe\nOK Frenchie\nPat Sherrill's Jokes\n"
         ]
      }
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Redneck Manifesto are an instrumental rock band from Dublin, Ireland. Its members are Richard Egan (bass), Niall Byrne (guitar) & Matthew Bolger (guitar).  Past members include Mervyn Craig (drums), Neil O'Connor (keyboards, percussion) & Glenn Keating (keyboards, percussion).\n",
      "The Redneck Manifesto formed in August 1998[1] as a four-piece band. The band members had previously played separately in several Dublin bands - Niall Byrne in Jackbeast, Richie Egan in Black Belt Jones[2] and Sir Killalot,[3] and Matthew Bolger in The Waltons. Mervyn Craig had played in the Dundalk band Hylton Weir. Neil O'Connor joined the band in 2003, having previously played with the Connect 4 Orchestra. The band first started playing gigs in Dublin and released a number of 7\" singles on their own Greyslate label; as well as a split 7\" released on Road Relish.\n",
      "Their debut album Thirtysixstrings was recorded by Alan O'Boyle (Decal/Legion of Two) and released as a joint venture with French label Red F Records in 2001.[4] It was well received by press and fans, and was acclaimed 'Irish album of the year' for 2001 by the Event Guide (Dublin).[5]\n",
      "In March 2002 the band undertook their first headline European tour. In a bid to help defray tour costs they released a companion piece to 'Thirty Six Strings' in the form of an extended EP Cut Your Heart Off from Your Head. This was again recorded with producer Alan O'Boyle. Equally receiving very favourable reviews, and again being self-released, the band found it difficult to keep up with the sales demands the EP placed on them.[citation needed]\n"
   ]
}