{
   "Name": "Rovo",
   "rawData": [
      "Rovo is a Japanese instrumental band founded in 1996 in Tokyo by former Boredoms guitarist Seiichi Yamamoto, Bondage Fruit electric violinist Yuji Katsui, and synthesizer/effects technician Tatsuki Masuko, and featuring Yasuhiro Yoshigaki on drums and percussion, Youichi Okabe on drums and percussion, and Jin Harada on bass guitar.  Rovo defines their music as \"man-drive trance,\" and many of their compositions have a repetitive minimalism, blended with progressive rock and psychedelic music, related to the style of bands such as Gong, Neu!, and Simple Minds (circa 1981).  They collaborated with Gong guitarist (and former Simple Minds producer) Steve Hillage's group System 7 on the 2013 album \"Phoenix Rising\". \n"
   ],
   "infobox": {
      "Origin": [
         "Tokyo, Japan"
      ],
      "Genres": [
         "Post-rock, psychedelic, avant-garde, electronic, trance"
      ],
      "Years active": [
         "1996–present"
      ],
      "Labels": [
         "Sony Music Entertainment, Warner Indies Network, Tzadik"
      ],
      "Associated acts": [
         "Boredoms, System 7"
      ],
      "Website": [
         "rovo.jp"
      ],
      "Members": [
         "Seiichi Yamamoto",
         "Yuji Katsui",
         "Tatsuki Masuko",
         "Yasuhiro Yoshigaki",
         "Jin Harada",
         "Youichi Okabe"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band founded in [YEAR] in Tokyo by former Boredoms guitarist Seiichi Yamamoto, Bondage Fruit electric violinist [PERSON_NAME_FULL_2_MALE], and synthesizer/effects technician [PERSON_NAME_FULL_4_MALE], and featuring [PERSON_NAME_FULL_0_MALE] on drums and percussion, [PERSON_NAME_FULL_1_MALE] on drums and percussion, and [PERSON_NAME_FULL_5_FEMALE] on bass guitar.  [BAND_NAME] defines their music as \"man-drive trance,\" and many of their compositions have a repetitive minimalism, blended with progressive rock and psychedelic music, related to the style of bands such as Gong, Neu!, and Simple Minds (circa [YEAR]).  They collaborated with Gong guitarist (and former Simple Minds producer) [PERSON_NAME_FULL_3_MALE]'s group System 7 on the [YEAR] album \"Phoenix Rising\". \n"
   ]
}