{
   "Name": "Saxon Shore (band)",
   "rawData": [
      "Saxon Shore was an American post-rock band consisting of members from Philadelphia, Pennsylvania, Brooklyn, New York, Los Angeles, CA, and Rochester, New York. The group released five albums: one packaged as an EP (Luck Will Not Save Us...) and four as full-lengths.\n",
      "Saxon Shore's overall sound has been compared to Caspian, Explosions in the Sky, Joy Wants Eternity, This Will Destroy You, and God is an Astronaut.\n",
      "Saxon Shore formed in 2001 as the joint project of guitarist Matthew Doty and drummer Josh Tillman. The two wrote several songs that, in time, were recorded for the duo's debut album Be a Bright Blue, released on Doty's own imprint, Broken Factory Records. Tillman's brother Zach was recruited for bass duties for multiple North American tours.\n"
   ],
   "infobox": {
      "Origin": [
         "Philadelphia, Pennsylvania, United States"
      ],
      "Genres": [
         "Post-rock",
         "instrumental rock",
         "ambient",
         "shoegaze"
      ],
      "Years active": [
         "2001–2009"
      ],
      "Labels": [
         "Broken Factory Records (2001-2002, 2009)",
         "Burnt Toast Vinyl (2003-2009)"
      ],
      "Associated acts": [
         "Warm Ghost",
         "Midnight Faces",
         "Certain Creatures",
         "Small Signals",
         "Soporus",
         "Williams Shift"
      ],
      "Website": [
         "Official website"
      ],
      "Members": [
         "Oliver Chapoy",
         "Matt Doty",
         "Stephen Roessner",
         "Will Stichter"
      ],
      "Past members": [
         "Josh Tillman",
         "Zach Tillman",
         "Matt Stone"
      ]
   },
   "albums": [
      "Be a Bright Blue",
      "Four Months of Darkness",
      "Be a Bright Blue",
      "Luck Will Not Save Us From a Jackpot of Nothing",
      "The Exquisite Death of Saxon Shore",
      "It Doesn't Matter"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band consisting of members from Philadelphia, Pennsylvania, Brooklyn, New York, Los Angeles, CA, and Rochester, New York. The group released five albums: one packaged as an EP (Luck Will Not [PERSON_NAME_FULL_0_MALE]...) and four as full-lengths.\n",
      "[BAND_NAME]'s overall sound has been compared to Caspian, Explosions in the Sky, Joy Wants Eternity, This [PERSON_NAME_FULL_0_MALE] You, and God is an [GENRE]",
      "[BAND_NAME] formed in [YEAR] as the joint project of guitarist Matthew Doty and drummer [PERSON_NAME_FULL_0_MALE]. The two wrote several songs that, in time, were recorded for the duo's debut album Be a Bright Blue, released on Doty's own imprint, Broken Factory Records. [PERSON_NAME_LAST_0]'s brother Zach was recruited for bass duties for multiple North American tours.\n"
   ]
}