{
   "Name": "Scale the Summit",
   "rawData": [
      "Scale the Summit is an American instrumental progressive metal band based out of Houston, Texas. It formed in 2004 and signed to Prosthetic Records.\nThe band is influenced by other progressive acts such as Cynic and Dream Theater. The band gained notice as part of the Progressive Nation 2009 tour with Dream Theater, Zappa Plays Zappa and Bigelf.\n",
      "Chris Letchford and Travis Levrier grew up in the same neighborhood, but never played music together until 2004, after they reconnected a few years earlier in a record store discussing a common interest, Between the Buried and Me. The duo formed a metal band in Houston that had trouble finding a bass guitarist and drummer. Letchford was set to attend the Los Angeles Musicians Institute a year after the band's formation, and Levrier decided to attend as well. The duo mainly hoped to meet new people to join their band, reasoning that their chances of doing so would be highest there, and after only a few months they met Jordan Eberhardt and Pat Skeffington, who joined on bass guitar and drums respectively. They first noticed Skeffington when they saw him wearing a Between the Buried and Me T-shirt with drumsticks protruding from his backpack, and Eberhardt joined in response to an ad the trio placed on Myspace. Reflecting on the experience, Letchford explained, \"I still think to this day that it was just meant to be, as moving out to Los Angeles didn't guarantee anything. I think we all just crossed paths at the perfect time.\"\n",
      "Although the band played typical technical metal with a vocalist in Houston, Letchford and Levrier noted a change in their sound when they started writing again in Los Angeles. After writing their first song, \"Rode In on Horseback\",  the duo realized the material sounded as if it was already complete, without being written for a singer, and so the duo dismissed the idea of finding another singer. The duo took two years of classes at the Institute, where their new band recorded four songs on a demo and played shows around the town. To make it easier to pursue a career in the band, Letchford and Levrier convinced Eberhardt and Skeffington, whom they had never met before attending school, to move to Houston with them instead of basing the band in Los Angeles. Letchford later explained that despite enjoying the area's natural beauty he felt the music scene in Los Angeles was too crowded and difficult to survive in. The band's formation was temporarily threatened by Levrier finding work for a band called Into the Moat, which he considered joining permanently, but Letchford sent him a demo recording of the song \"Omni\" (a song that would appear on the band's debut album, Monument), and Levrier changed his mind. Into the Moat disbanded in spite of touring with acts such as Between the Buried and Me and The Black Dahlia Murder. Levrier coined the name \"Scale the Summit\" when he perused a photography book and saw a picture titled \"The Summit\", and mentioned the name as soon as it came to mind; the group took the name immediately.\n"
   ],
   "infobox": {
      "Origin": [
         "Houston, Texas, U.S."
      ],
      "Genres": [
         "Progressive metal"
      ],
      "Years active": [
         "2004–present"
      ],
      "Labels": [
         "Prosthetic"
      ],
      "Associated acts": [
         "Angel Vivaldi",
         "Five Finger Death Punch"
      ],
      "Website": [
         "www.scalethesummit.com"
      ],
      "Members": [
         "Chris Letchford",
         "Kilian Duarte",
         "Charlie Engen"
      ],
      "Past members": [
         "Jordan Eberhardt",
         "Pat Skeffington",
         "Travis Levrier",
         "Mark Michell",
         "J. C. Bryant"
      ]
   }
}