{
   "Discography": {
      "Albums": {},
      "Compilation appearances": {},
      "Compilations": {},
      "EPs": {},
      "Soundtracks": {}
   },
   "External links": {},
   "History": {
      "text": [
         "The band's origins are in Calgary, where founding members Reid Diamond and Brian Connelly were members of the punk rock band Buick McKane in the 1970s.[4] After that band broke up, Diamond, Connelly and drummer Alex Koch moved to Toronto, where they joined with Don Pyle to form a new punk band, Crash Kills Five.[4] That band released one EP, What Do You Do At Night?, in 1980 before breaking up in 1981, and the members briefly pursued other projects before Diamond, Connelly and Pyle reunited in 1984 as Shadowy Men.\n",
         "Signed to Cargo Records, they released a string of EPs and singles throughout the 1980s and early 1990s. The group also appeared on many compilation albums, and played on some tracks of Fred Schneider's solo album, Just Fred.[5] The band won a Juno Award for Instrumental Artist of the Year at the Juno Awards of 1992.[6]\n",
         "Their 1993 album Sport Fishin': The Lure of the Bait, The Luck of the Hook was engineered by Steve Albini, who was such a fan of the band that he offered to work with them for free.[2]\n",
         "The group disbanded in 1996,[5] in part because Pyle and Diamond wanted to record an album with Jad Fair while Connelly did not.[4] Pyle and Diamond instead joined with Dallas Good of The Sadies to form Phono-Comb, and collaborated with Fair on the 1996 album Monsters, Lullabies...and the Occasional Flying Saucer.[7] Beverly Breckenridge from Fifth Column also later joined the Phono-Comb lineup.\n",
         "After the breakup, Connelly was in a short-lived trio called Heatseekers,[5] and toured and recorded with Neko Case and Her Boyfriends. He currently leads his own instrumental trio, Atomic 7.[4] Diamond later started Danny & Reid's Motion Machine, and Pyle teamed up with Andrew Zealley to form Greek Buck.\n",
         "Diamond died of cancer on February 17, 2001.[8]\n",
         "In March 2012, it was announced that the band would be reuniting for a pair of live performances, in Calgary on June 20 and Toronto on July 14, to mark the beginning of a series of reissues of all of their albums on Mammoth Cave Recording Co.[4] Dallas Good replaced Diamond on bass.[4] The reissues included the Crash Kills Five EP.[4] Following Mammoth Cave's closure in 2015, the albums were again reissued on Yep Roc Records in 2016 as the box set Oh, I Guess We Were a Fucking Surf Band After All.[3][9] The band have continued to perform occasional shows since the 2012 reunion, including the 2017 Gateway Festival[10] and the 2018 Northern Lights Festival Boréal.[11]\n"
      ]
   },
   "Members": {},
   "References": {},
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "3.1 Albums",
      "3.2 Compilations",
      "3.3 EPs",
      "3.4 Soundtracks",
      "3.5 Compilation appearances",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Shadowy Men on a Shadowy Planet are a Juno Award-winning Canadian instrumental rock band, formed in 1984.  They remain best known for the track \"Having an Average Weekend\", which was used as the theme to the Canadian sketch comedy TV show The Kids in the Hall.[1] Although commonly classified as a surf rock band[1] they rejected the label, going so far as to release a track called \"We're Not a Fucking Surf Band\",[2] although they also later released a compilation box set titled Oh, I Guess We Were a Fucking Surf Band After All.[3]\n"
      ]
   },
   "Title": "Shadowy Men on a Shadowy Planet - Wikipedia"
}