{
   "Name": "Shadowy Men on a Shadowy Planet",
   "rawData": [
      "Shadowy Men on a Shadowy Planet are a Juno Award-winning Canadian instrumental rock band, formed in 1984.  They remain best known for the track \"Having an Average Weekend\", which was used as the theme to the Canadian sketch comedy TV show The Kids in the Hall. Although commonly classified as a surf rock band they rejected the label, going so far as to release a track called \"We're Not a Fucking Surf Band\", although they also later released a compilation box set titled Oh, I Guess We Were a Fucking Surf Band After All.\n",
      "The band's origins are in Calgary, where founding members Reid Diamond and Brian Connelly were members of the punk rock band Buick McKane in the 1970s. After that band broke up, Diamond, Connelly and drummer Alex Koch moved to Toronto, where they joined with Don Pyle to form a new punk band, Crash Kills Five. That band released one EP, What Do You Do At Night?, in 1980 before breaking up in 1981, and the members briefly pursued other projects before Diamond, Connelly and Pyle reunited in 1984 as Shadowy Men.\n",
      "Signed to Cargo Records, they released a string of EPs and singles throughout the 1980s and early 1990s. The group also appeared on many compilation albums, and played on some tracks of Fred Schneider's solo album, Just Fred. The band won a Juno Award for Instrumental Artist of the Year at the Juno Awards of 1992.\n"
   ],
   "infobox": {
      "Origin": [
         "Toronto, Ontario, Canada"
      ],
      "Genres": [
         "Instrumental rock, surf rock"
      ],
      "Years active": [
         "1984–1996, 2012–present"
      ],
      "Labels": [
         "Cargo, K Records, Mammoth Cave"
      ],
      "Associated acts": [
         "Ancient Chinese Secret, Atomic 7, Black Heel Marks, Danny & Reid's Motion Machine, Greek Buck, Heatseekers, Phono-Comb, the Sadies"
      ],
      "Members": [
         "Don Pyle",
         "Brian Connelly",
         "Dallas Good"
      ],
      "Past members": [
         "Reid Diamond"
      ]
   },
   "albums": [
      "Dim the Lights, Chill the Ham",
      "Sport Fishin': The Lure of the Bait, The Luck of the Hook"
   ],
   "prunedData": [
      "[BAND_NAME] are a [MONTH]o Award-winning Canadian instrumental rock band, formed in [YEAR].  They remain best known for the track [SONG_NAME], although they also later released a compilation box set titled Oh, I Guess We Were a Fucking Surf Band After All.\n",
      "The band's origins are in Calgary, where founding members Reid Diamond and [PERSON_NAME_FULL_1_MALE] were members of the punk rock band Buick McKane in the [YEAR]s. After that band broke up, Diamond, [PERSON_NAME_LAST_1] and drummer Alex Koch moved to Toronto, where they joined with [PERSON_NAME_FULL_0_MALE] to form a [GENRE] band, Crash Kills Five. That band released one EP, What Do You Do At Night?, in [YEAR] before breaking up in [YEAR], and the members briefly pursued other projects before Diamond, [PERSON_NAME_LAST_1] and [PERSON_NAME_LAST_0] reunited in [YEAR] as Shadowy Men.\n",
      "Signed to Cargo Records, they released a string of EPs and singles throughout the [YEAR]s and early [YEAR]s. The group also appeared on many compilation albums, and played on some tracks of [PERSON_NAME_FULL_0_MALE]'s solo album, Just [PERSON_NAME_FIRST_0]. The band won a [MONTH]o Award for Instrumental Artist of the Year at the [MONTH]o Awards of [YEAR].\n"
   ]
}