{
   "Discography": {
      "Compilations": {},
      "EPs": {},
      "Remix albums": {},
      "Studio albums": {},
      "Unofficial releases": {}
   },
   "External links": {
      "Listening": {},
      "Reviews": {}
   },
   "Members": {
      "Current": {},
      "Former": {}
   },
   "References": {},
   "Sections": [
      "1 Members",
      "1.1 Current",
      "1.2 Former",
      "2 Discography",
      "2.1 Studio albums",
      "2.2 EPs",
      "2.3 Remix albums",
      "2.4 Unofficial releases",
      "2.5 Compilations",
      "3 References",
      "4 External links",
      "4.1 Reviews",
      "4.2 Listening"
   ],
   "Summary": {
      "text": [
         "The Six Parts Seven is an American post-rock band formerly based in Kent, Ohio. The band was founded in 1995 by brothers Allen and Jay Karpinski (playing guitar and drums, respectively), who had earlier played with Old Hearts Club, a band of similar style including vocals. In 1998, Tim Gerak was added to the core member line-up, playing guitar and also credited with additional engineering on the band's later recordings.\n",
         "Most of the group's music is instrumental, featuring multiple \"clean\" (undistorted) electric guitars, with electric bass and drums, as well as electric lap steel guitar, viola, and occasionally piano, vibraphone, or trumpet. Rather than relying primarily on strummed chords, songs are generally built by combining single-note melodic lines.\n",
         "The band has been through a plethora of line-up changes, and minor positions in the band have proved to be a revolving chair, while retaining the core force of the Karpinski brothers and Tim Gerak. Former vibraphonist Eric Koltnow left the band after the release of Everywhere and Right Here, as well as former lap steel player Ben Vaughan after the birth of his first child. Minor positions, such as the newly-added trumpet, have been filled by members of other bands from the Akron, Ohio area.\n",
         "The Six Parts Seven's name is based on a quote from Virginia Governor William Berkeley in 1676, \"How miserable that man is that governs a people where six parts of seven at least are poor, indebted, discontented and armed.\" A recent interview with another band member claims the name derives from a childhood game between brothers Jay and Allen.[1] Although its name is similar, The Six Parts Seven should not be confused with the British band Six by Seven.\n",
         "The group has toured the United States several times and performed in March 2006 at the South by Southwest festival in Austin, Texas. Since the early 21st century its music has been used frequently by National Public Radio's All Things Considered news program as transition music.[2] Group leader Allen Karpinski was interviewed about the group's music on the same program in September 2004.[3]\n"
      ]
   },
   "Title": "The Six Parts Seven - Wikipedia"
}