{
   "Name": "The Six Parts Seven",
   "rawData": [
      "The Six Parts Seven is an American post-rock band formerly based in Kent, Ohio. The band was founded in 1995 by brothers Allen and Jay Karpinski (playing guitar and drums, respectively), who had earlier played with Old Hearts Club, a band of similar style including vocals. In 1998, Tim Gerak was added to the core member line-up, playing guitar and also credited with additional engineering on the band's later recordings.\n",
      "Most of the group's music is instrumental, featuring multiple \"clean\" (undistorted) electric guitars, with electric bass and drums, as well as electric lap steel guitar, viola, and occasionally piano, vibraphone, or trumpet. Rather than relying primarily on strummed chords, songs are generally built by combining single-note melodic lines.\n",
      "The band has been through a plethora of line-up changes, and minor positions in the band have proved to be a revolving chair, while retaining the core force of the Karpinski brothers and Tim Gerak. Former vibraphonist Eric Koltnow left the band after the release of Everywhere and Right Here, as well as former lap steel player Ben Vaughan after the birth of his first child. Minor positions, such as the newly-added trumpet, have been filled by members of other bands from the Akron, Ohio area.\n"
   ],
   "infobox": {
      "Origin": [
         "Kent, Ohio, U.S."
      ],
      "Genres": [
         "Post-rock"
      ],
      "Years active": [
         "1995–2008 (Hiatus)"
      ],
      "Labels": [
         "Suicide Squeeze"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formerly based in Kent, Ohio. The band was founded in [YEAR] by brothers Allen and Jay Karpinski (playing guitar and drums, respectively), who had earlier played with Old Hearts Club, a band of similar style including vocals. In [YEAR], [PERSON_NAME_FULL_0_MALE] was added to the core member line-up, playing guitar and also credited with additional engineering on the band's later recordings.\n",
      "Most of the group's music is instrumental, featuring multiple \"clean\" (undistorted) electric guitars, with electric bass and drums, as well as electric lap steel guitar, viola, and occasionally piano, vibraphone, or trumpet. Rather than relying primarily on strummed chords, songs are generally built by combining single-note melodic lines.\n",
      "The band has been through a [GENRE] band have proved to be a revolving chair, while retaining the core force of the Karpinski brothers and [PERSON_NAME_FULL_1_MALE]. Former vibraphonist [PERSON_NAME_FULL_0_MALE] left the band after the release of Everywhere and Right Here, as well as former lap steel player Ben Vaughan after the birth of his first child. Minor positions, such as the newly-added trumpet, have been filled by members of other bands from the Akron, Ohio area.\n"
   ]
}