{
   "Discography": {},
   "External links": {},
   "Members": {},
   "Past members": {},
   "References": {},
   "Sections": [
      "1 Members",
      "2 Past members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Solaris are a Hungarian progressive rock band formed in 1980.\n",
         "Their music has a strong melodic content, often laced with Eastern European themes, and is highlighted by the use of dynamics and extended thematic development. There is a great deal of interplay among the lead instruments of flute, guitar and keyboard which is used regularly to develop their themes. The emphasis is not on providing solo spots for the various instruments, but rather in employing those instruments within the context of the development of the individual piece.\n",
         "The band's name is a reference to Stanisław Lem's philosophical Sci-Fi novel, Solaris. Their first album's title is a reference to The Martian Chronicles. The members have said that they were influenced by these, and other Sci-Fi books.\n",
         "The majority of Solaris' songs are instrumentals. The first track on their first LP, Marsbéli Krónikák, is an exception, with a few lines spoken over the music. The pitch-shifting, distortion, and album's theme have led many listeners to assume that the voiceover is in a putative Martian language, but it's actually  in Hungarian: \"Megrepedt tükrök (Cracked mirrors) / Kormos acélfalak (Sooty steel walls) / Halott szeméthegyek (Dead piles of garbage) / És szennyes tavak (And polluted lakes) / Azt mondod, itt élt valaha az ember? (Do you say mankind used to live here?)\". \n\"Egészséges Optimizmus\" (Healthy Optimism) from the SOLARIS 1990 LP also has an introductory voiceover in Hungarian, and chanting in Latin[verification needed] appears in several tracks on the album Nostradamus: Próféciák könyve.\n",
         "From 1986 to 1990, members of Solaris formed a new band, Napoleon Boulevard, with singer Lilla Vincze. The band had a more mainstream rock sound, and released five highly successful albums.\n",
         "In June 2003, Attila Kollár said in an interview that the band is still active, and they will start working on a new studio album that year.\n",
         "Following their studio albums (and a live double CD recorded in 1995 during the Progfest in Los Angeles), the band also started a 3-volume \"Official Bootleg\" series. As the title says, these contain recordings that were never officially released before and consist of mainly live material. The title track of the second volume was originally intended to appear on the first album but has never been recorded in the studio.\n",
         "In December 2007, drummer László Gömör told Alternative Press magazine that \"the band has made few attempts to reunite and it seems unlikely (Solaris) will reunite.\"\n",
         "Studio album 'Martian Chronicles II.' was released on October 26, 2014.[1]\n",
         "Album Nostradamus 2.0 - Returnity was released in 2019 [2]\n"
      ]
   },
   "Title": "Solaris (band) - Wikipedia"
}