{
   "Band members": {
      "text": [
         "\n"
      ]
   },
   "Discography": {
      "Collaboration albums": {},
      "Compilation albums": {},
      "Live albums": {},
      "Studio albums": {}
   },
   "External links": {},
   "Film and television": {
      "text": [
         "Los Straitjackets provided some of the music for the independent film Psycho Beach Party, and appeared briefly in the film.  They also recorded two albums of music specifically for television and commercial use, and their work is often heard as filler or background music on radio and television shows.\n",
         "In the late 1990s, Conan O'Brien had the band perform Christmas music each holiday season on his late-night television program.\n"
      ]
   },
   "History": {
      "text": [
         "Eddie Angel was a noted rockabilly guitarist who moved to Nashville in the early 1980s to record and perform with the Planet Rockers.[3] Danny Amis recorded and performed with the Raybeats, then worked as a sound engineer in Nashville. The two formed The Straitjackets in 1988 with Jimmy Lester, a Nashville session player who had worked and toured with Robert Gordon. They played several gigs during the summer of that year, but soon broke up.\n",
         "In 1994 they reformed as Los Straitjackets, adding bass player Scott Esbeck. Their first album, The Utterly Fantastic and Totally Unbelievable Sound of Los Straitjackets, was released the following year on Upstart Records.[2] In the post-Pulp Fiction surf revival, the group began attracting a following, though their music is not entirely surf-oriented.\n",
         "Over the next few years, the band developed a cult following through its tight instrumentation and stage shows. In its live performances, band members dress in identical black suits, gold Aztec medallions, and personalized Mexican wrestling masks.[1] Danny Amis, a fan of Luchador films and Mexican culture had suggested the band wear the masks he had purchased in Mexico at the band's first gig on a whim; the crowd went wild and a tradition was born.[4] Frontman Amis (aka \"Daddy-O Grande\")[5] was the sole spokesperson of the band, and would introduce the songs in fast, heavily accented Spanish.\n",
         "In 1998 Esbeck left the band during the recording of The Velvet Touch of Los Straitjackets and was replaced by Pete Curry, formerly of the Halibuts, a 1980s surf-revival group. In 2005 Lester left and was replaced by Jason \"Teen Beat\" Smay. They have become known as frequent collaborators, recording Sing Along with Los Straitjackets with a number of different artists. They were nominated for a Grammy Award for their collaboration with blues singer Eddy Clearwater, Rock 'N' Roll City.\n",
         "Their stage shows have become more elaborate and frequently feature choreography, guest vocalists such as Eddy \"The Chief\" Clearwater, Kaiser George of the Scottish band the Kaisers, Big Sandy, and the burlesque dancing troupe The World Famous Pontani Sisters. In recent years, they have staged festive Christmas shows during the holiday season.\n",
         "In 2010 Danny Amis was diagnosed with multiple myeloma.[6] He was sidelined from recording and touring while under treatment. Los Straitjackets recruited guitarist Greg \"Gregorio El Grande\" Townson to fill Amis' role during his absence. In 2012 Amis announced that his cancer was \"under control\" and he would return to recording and limited touring with Los Straitjackets in September 2012.[7] This coincided with the band's new studio release Jet Set and debut of new drummer Chris \"Sugar Balls\" Sprague. Amis now lives in Mexico City.\n",
         "In late 2016, Los Straitjackets were due to embark on a tour with NRBQ. Prior to the tour, Pete Curry had to undergo shoulder replacement surgery. While he was recovering, his replacements consisted of Eddie's son, Max, Todd Bradley of the Hi-Risers, and Juan Ugalde of The Outta Sites.\n",
         "On May 19, 2017, the band released What's So Funny About Peace, Love And..., a tribute to the music of Nick Lowe, on Yep Roc Records.[8] In 2019 the band embarked on a UK tour backing Lowe.[9] Their February 2019 single with Lowe, \"Love Starvation,\" was described by Rolling Stone magazine as \"a peppy-sounding old-school rock song that paints a bleak lyrical picture of romantic fallout.\" Lowe said of the band: \"Apart from being a fantastic rock ‘n’ roll band, they know how to play tons of different styles really well. They can knock you out a version of Bacharach and David's \"The Look of Love\" with no trouble at all.\"[10]\n"
      ]
   },
   "References": {
      "Notes": {},
      "Other sources": {}
   },
   "Sections": [
      "1 History",
      "2 Film and television",
      "3 Band members",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Live albums",
      "4.3 Collaboration albums",
      "4.4 Compilation albums",
      "5 References",
      "5.1 Notes",
      "5.2 Other sources",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Los Straitjackets is an American instrumental rock band that formed in Nashville, Tennessee, United States, in 1988. Originally comprising guitarists Danny Amis (formerly of the Raybeats), Eddie Angel and drummer L. J. \"Jimmy\" Lester under the name The Straitjackets, the band split up soon after forming, but reunited as Los Straitjackets in 1994 with the addition of bassist E. Scott Esbeck. Esbeck left the band in 1998 and was replaced by Pete Curry.[2] The current lineup also features Greg Townson on guitar and Chris Sprague on drums.\n",
         "The band has released fourteen studio albums, four collaboration albums and eight live albums.\n"
      ]
   },
   "Title": "Los Straitjackets - Wikipedia"
}