{
   "Name": "Los Straitjackets",
   "rawData": [
      "Los Straitjackets is an American instrumental rock band that formed in Nashville, Tennessee, United States, in 1988. Originally comprising guitarists Danny Amis (formerly of the Raybeats), Eddie Angel and drummer L. J. \"Jimmy\" Lester under the name The Straitjackets, the band split up soon after forming, but reunited as Los Straitjackets in 1994 with the addition of bassist E. Scott Esbeck. Esbeck left the band in 1998 and was replaced by Pete Curry. The current lineup also features Greg Townson on guitar and Chris Sprague on drums.\n",
      "The band has released fourteen studio albums, four collaboration albums and eight live albums.\n",
      "Eddie Angel was a noted rockabilly guitarist who moved to Nashville in the early 1980s to record and perform with the Planet Rockers. Danny Amis recorded and performed with the Raybeats, then worked as a sound engineer in Nashville. The two formed The Straitjackets in 1988 with Jimmy Lester, a Nashville session player who had worked and toured with Robert Gordon. They played several gigs during the summer of that year, but soon broke up.\n"
   ],
   "infobox": {
      "Also known as": [
         "The Straitjackets"
      ],
      "Origin": [
         "Nashville, Tennessee, United States"
      ],
      "Genres": [
         "Instrumental rock, garage rock, rock and roll, surf rock"
      ],
      "Years active": [
         "1988, 1994–present[1]"
      ],
      "Labels": [
         "Upstart, Spinout, Cavalcade, Yep Roc, LoveCat, Rounder"
      ],
      "Associated acts": [
         "Raybeats, The Neanderthals, Planet Rockers, Martian Denny Orchestra, The Halibuts, The Hi-Risers, Freddy Cannon, Nick Lowe"
      ],
      "Website": [
         "LosStraitjackets.com"
      ],
      "Members": [
         "Eddie Angel",
         "Pete Curry",
         "Chris \"Sugarballs\" Sprague",
         "Greg Townson"
      ],
      "Past members": [
         "Danny Amis ",
         " Scott Esbeck ",
         "Jimmy Lester",
         "Jason \"Teen Beat\" Smay"
      ]
   }
}