{
   "Name": "Strawberry Girls",
   "rawData": [
      "Strawberry Girls is an American rock band from Salinas, California, formed in 2011. The band is currently composed of guitarist Zac Garren, drummer Ben Rosett, and bassist Ian Jennings. All three members are multi-instrumentalists and record producers.\n",
      "Strawberry Girls formed shortly after guitarist Zachary Garren departed from post-hardcore band Dance Gavin Dance in February 2010. Garren then became acquainted with drummer Ben Rosett (formerly of The Trees) and subsequently began writing and recording music as Strawberry Girls. Soon after their first show as a duo, bassist Ian Jennings (also from The Trees) was added to complete the lineup. Garren spoke about the meaning behind the name Strawberry Girls in an interview with their label Tragic Hero Records. The name originally derives from a verse in the 1980 song \"Christine\" by English post-punk band Siouxsie and the Banshees. The band released their debut EP (extended play) album Italian Ghosts on October 28, 2011 independently. On June 25, 2012, the group released a cover of Carly Rae Jepsen's single \"Call Me Maybe\" which was reviewed as \"dark and sexy\" by The Air Space. The group also released a cover of Kendrick Lamar's single \"Swimming Pools (Drank)\" on December 2, 2012. The band recorded their debut studio album, French Ghetto, at Spirit Vision Studios in Carmel, California and was later released on April 20, 2013 to Bandcamp. The album was later re-released through Tragic Hero Records on September 20, 2013. French Ghetto features guest appearances from Kurt Travis of A Lot Like Birds (formerly of Dance Gavin Dance), Shane Smit of Overtone, Nic Newsham of Gatsby's American Dream, Gavin Mulkey, and Kathleen Delano. Garren spoke about the guest vocalists and musicians on French Ghetto, stating:\n",
      "\"We decided to have different guest vocalists for a few different reasons. Originally, we had written a couple songs for the album that were shorter, a bit chill compared to our normal stuff, and had more pop based structures. Since we didn't really plan on playing those two songs live, we thought it'd be cool to get Kurt Travis, who I used to play with in Dance Gavin Dance, to collaborate on a full song for old time’s sake.\""
   ],
   "infobox": {
      "Origin": [
         "Salinas, California, United States"
      ],
      "Genres": [
         "Progressive rock",
         "experimental rock[1]",
         "math rock"
      ],
      "Years active": [
         "2011–present"
      ],
      "Labels": [
         "Tragic Hero",
         "Spirit Vision Records"
      ],
      "Associated acts": [
         "Dance Gavin Dance",
         "Eternity Forever",
         "Ben Rosett",
         "Good Health",
         "Kinder Creatures",
         "The Trees"
      ],
      "Website": [
         "www.tragicherorecords.co/strawberry-girls"
      ],
      "Members": [
         "Zachary Garren ",
         " Ben Rosett ",
         " Ian Jennings"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Salinas, California, formed in [YEAR]. The band is currently composed of guitarist Zac Garren, drummer Ben Rosett, and bassist [PERSON_NAME_FULL_0_MALE]. All three members are multi-instrumentalists and record producers.\n",
      "[BAND_NAME] formed shortly after guitarist Zachary Garren departed from post-hardcore band Dance [PERSON_NAME_FIRST_2] Dance in [MONTH] [YEAR]. Garren then became acquainted with drummer [PERSON_NAME_FULL_7_MALE] (formerly of The Trees) and subsequently began writing and recording music as [BAND_NAME]. Soon after their first show as a duo, bassist [PERSON_NAME_FULL_6_MALE] (also from The Trees) was added to complete the lineup. Garren spoke about the meaning behind the name [BAND_NAME] in an interview with their label Tragic Hero Records. The name originally derives from a verse in the [YEAR] song \"Christine\" by English post-punk band Siouxsie and the Banshees. The band released their debut EP (extended play) album Italian Ghosts on [MONTH] 28, [YEAR] independently. On [MONTH] 25, [YEAR], the group released a cover of [PERSON_NAME_FULL_0_FEMALE]'s single \"Call Me [MONTH]be\" which was reviewed as \"dark and sexy\" by The Air Space. The group also released a cover of [PERSON_NAME_FULL_1_MALE]'s single \"Swimming Pools (Drank)\" on [MONTH] 2, [YEAR]. The band recorded their debut studio album, French Ghetto, at Spirit Vision Studios in Carmel, California and was later released on [MONTH] 20, [YEAR] to Bandcamp. The album was later re-released through Tragic Hero Records on [MONTH] 20, [YEAR]. French Ghetto features guest appearances from [PERSON_NAME_FULL_4_MALE] of A Lot Like Birds (formerly of Dance [PERSON_NAME_FIRST_2] Dance), Shane Smit of Overtone, [PERSON_NAME_FULL_5_MALE] of Gatsby's American Dream, [PERSON_NAME_FULL_2_MALE], and [PERSON_NAME_FULL_3_FEMALE]. Garren spoke about the guest vocalists and musicians on French Ghetto, stating:\n",
      "\"We decided to have different guest vocalists for a [GENRE] a couple songs for the album that were shorter, a bit chill compared to our normal stuff, and had more pop based structures. Since we didn't really plan on playing those two songs live, we thought it'd be cool to get [PERSON_NAME_FULL_0_MALE], who I used to play with in Dance Gavin Dance, to collaborate on a full song for old time’s sake.\""
   ]
}