{
   "Name": "The Surfaris",
   "Sections": [
      "1 Career",
      "2 \"Wipe Out\"",
      "3 Disbanding and reformation",
      "4 Members",
      "4.1 The Surfaris featuring Bob Berryhill",
      "5 Discography",
      "5.1 Albums",
      "5.2 Singles",
      "5.3 Compilations",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "The Surfaris are an American surf rock band formed in Glendora, California, United States, in 1962.[1][2] They are best known for two songs that hit the charts in the Los Angeles area, and nationally by May 1963: \"Surfer Joe\" and \"Wipe Out\", which were the A-side and B-side of the same 45 rpm single.\n",
         "The Surfaris were inducted into the Musicians Hall of Fame and Museum in 2019 for their hit instrumental song, \"Wipe Out\".\n"
      ]
   },
   "Career": {
      "text": [
         "The original band members were Ron Wilson (drums, vocals), Jim Fuller (lead guitar), Bob Berryhill (rhythm guitar), and Pat Connolly (bass).[1]\n",
         "In the fall of 1962, Southern California high school students Jim Fuller and Pat Connolly were a guitar duo before founding The Surfaris in high school after meeting drummer Ron Wilson at a high school dance. After practicing at fellow student Bob Berryhill's house, they added him as the fourth member. \n\"Wipe Out\" was written and recorded by the quartet later that winter, with the song reaching #2 nationally in 1963 before becoming an international hit.[1]\n",
         "Saxophone player Jim Pash joined after their \"Wipe Out\" / \"Surfer Joe\" recording sessions at Pal Studios.\n",
         "Ken Forssi, later of Love, played bass with The Surfaris after Pat Connolly.[1]\n"
      ]
   },
   "\"Wipe Out\"": {
      "text": [
         "Wilson's energetic drum solo made \"Wipe Out\" one of the best-remembered instrumental songs of the period. \"Wipe Out\" is also remembered particularly for its introduction. Before the music starts, Berryhill's dad broke a board (imitating a breaking surf board) near the mic, followed by a maniacal laugh and the words \"Wipe Out\" spoken by band manager Dale Smallin. \"Wipe Out\" was written in the studio by the four original members (Berryhill, Connolly, Fuller, and Wilson). It was initially issued on the tiny DFS label (#11/12) in January 1963. It was reissued on the tiny Princess label (#50) in February 1963. It was picked up by Dot (45-16479) in April 1963, and later reissued as Dot 45-144 in April 1965. It sold over one million copies and was awarded a gold disc.[3]\n",
         "Following the death of television personality Morton Downey Jr., news reports and obituaries incorrectly credited him as the composer of \"Wipe Out\" (as well as the Chantays' \"Pipeline\").[4] As of 2010[update], Downey's official website continued to make this claim but it has been changed to state he \"also played major roles in the production of the hit surf music-era songs \"Pipeline\" and \"Wipeout\".\"[5]\n"
      ]
   },
   "Disbanding and reformation": {
      "text": [
         "The band released a series of records, with two other singles, \"Surfer Joe\" (written and sung by Wilson) and \"Point Panic\" (another group-composed instrumental), having an impact on the charts. Point Panic is a renowned surfing venue in Hawaii after which the song was named.\n",
         "The original 1963 membership remained intact until August 1965 when Connolly departed before their Japanese tour. Ken Forssi replaced him on bass for the tour.[1] Fuller resigned after the tour and the band folded in early 1966. Forssi died from a brain tumor in 1998.[1]\n",
         "Pat Connolly left the music business in 1965.\n",
         "Ron Wilson died of a brain aneurysm on May 12, 1989, one month short of his 45th birthday. Wilson had released an album of his songs, entitled Lost In The Surf, on Bennet House Records of Grass Valley, California, which was recorded in June 1987. A very small number of cassettes of this album were produced. Lost in the Surf included a cover of \"Louie Louie\", complete with Scottish bagpipes.\n",
         "Jim Pash, who played saxophone in the earlier formation and was later a guitarist, died April 29, 2005 of heart failure at age 56.\n",
         "Jim Fuller played with main band, The Surfaris band that reformed in the 1980s with Pash. After Berryhill was released from the band in the mid-'80s, new members joined such as Kelly Lammers, Robert Watson, Jay Truax, Paul Johnson (Mr. Moto), and Dave Raven, among others all concurrent with his own band, Jim Fuller and the Beatnik until his passing on March 3, 2017 in Monrovia, California at age 69.[6][7]\n",
         "On June 25, 2019, The New York Times Magazine listed The Surfaris among hundreds of artists whose material was reportedly destroyed in the 2008 Universal fire.[8]\n",
         "Bob Berryhill currently performs worldwide as The Surfaris[1] who started performing in the 1990s. In 2015, he released a critically acclaimed album entitled The Surfaris Hurley Sessions.\n"
      ]
   },
   "Members": {
      "The Surfaris featuring Bob Berryhill": {},
      "text": [
         "Information on 1980’s reunited Surfaris lineups has currently not surfaced.\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Singles": {},
      "Compilations": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Surfaris are an American surf rock band formed in Glendora, California, United States, in 1962.[1][2] They are best known for two songs that hit the charts in the Los Angeles area, and nationally by May 1963: \"Surfer Joe\" and \"Wipe Out\", which were the A-side and B-side of the same 45 rpm single.\n",
      "The Surfaris were inducted into the Musicians Hall of Fame and Museum in 2019 for their hit instrumental song, \"Wipe Out\".\n",
      "The original band members were Ron Wilson (drums, vocals), Jim Fuller (lead guitar), Bob Berryhill (rhythm guitar), and Pat Connolly (bass).[1]\n",
      "In the fall of 1962, Southern California high school students Jim Fuller and Pat Connolly were a guitar duo before founding The Surfaris in high school after meeting drummer Ron Wilson at a high school dance. After practicing at fellow student Bob Berryhill's house, they added him as the fourth member. \n\"Wipe Out\" was written and recorded by the quartet later that winter, with the song reaching #2 nationally in 1963 before becoming an international hit.[1]\n"
   ]
}