{
   "Name": "This Patch of Sky",
   "rawData": [
      "This Patch of Sky were an Oregon instrumental post rock band, formed in 2010 in Eugene. The band typically composed cinematic instrumental pieces that combine subtle-nuanced melodies and wall-of-sound guitars to create a symphonic landscape.  The band was signed to German indie label Oxide-Tones in 2011 and released \"The Immortal, The Invisible\" and \"Newly Risen, How Brightly You Shine\".  In 2013 Oxide-Tones became extinct, resulting in the band releasing full-length album \"Heroes and Ghosts\" independently.  In August 2014, the band released a full length self-titled album independently. In September 2017, the band signed with Graphic Nature Records, an imprint of Equal Vision Records and released a full length \"These Small Spaces\". In September 2019, they disbanded. \n",
      "On December 30, 2014 This Patch of Sky's studio album Heroes and Ghosts was chosen as AmpKicker's Top 20 albums of 2013.\n",
      "In January 2014, This Patch of Sky was voted as \"Most Improved Artist\" in the annual Postrockstar 2013 Year End awards.\n"
   ],
   "infobox": {
      "Origin": [
         "Oregon"
      ],
      "Genres": [
         "Post-rock"
      ],
      "Years active": [
         "2010 (2010)–2019"
      ],
      "Website": [
         "facebook.com/thispatchofskymusic"
      ]
   },
   "prunedData": [
      "[BAND_NAME] were an [GENRE] band, formed in [YEAR] in Eugene. The band typically composed cinematic instrumental pieces that combine subtle-nuanced melodies and wall-of-sound guitars to create a symphonic landscape.  The band was signed to German indie label Oxide-Tones in [YEAR] and released \"The Immortal, The Invisible\" and \"Newly Risen, How Brightly You Shine\".  In [YEAR] Oxide-Tones became extinct, resulting in the band releasing full-length album \"Heroes and Ghosts\" independently.  In [MONTH] [YEAR], the band released a full length self-titled album independently. In [MONTH] [YEAR], the band signed with Graphic Nature Records, an imprint of Equal Vision Records and released a full length \"These Small Spaces\". In [MONTH] [YEAR], they disbanded. \n",
      "On [MONTH] 30, [YEAR] [BAND_NAME]'s studio album Heroes and Ghosts was chosen as AmpKicker's Top 20 albums of [YEAR].\n",
      "In [MONTH] [YEAR], [BAND_NAME] was voted as \"Most Improved Artist\" in the annual Postrockstar [YEAR] Year End awards.\n"
   ]
}