{
   "Name": "This Will Destroy You",
   "Sections": [
      "1 History",
      "1.1 Formation (2002–2005)",
      "1.2 Young Mountain (2004–2006)",
      "1.3 This Will Destroy You (2006–2008)",
      "1.4 Field Studies (2008–2009)",
      "1.5 Moving on the Edges of Things and Tunnel Blanket (2009–2014)",
      "1.6 Another Language and New Others Duology (2014–present)",
      "2 Musical style and influences",
      "3 Other projects",
      "4 Members",
      "4.1 Timeline",
      "5 Discography",
      "5.1 Studio albums",
      "5.2 Live albums",
      "5.3 EPs",
      "5.4 Singles",
      "5.5 Music videos",
      "5.6 Compilations and remixes",
      "6 Notes",
      "7 References",
      "8 Sources",
      "9 External links"
   ],
   "Summary": {
      "text": [
         "This Will Destroy You (abbreviated as TWDY) is an American post-rock band from San Marcos, Texas, formed in 2004. They typically compose lengthy atmospheric instrumental pieces, featuring layers of effects-laden guitar and a heavy usage of dynamics. Their fourth album Another Language, released in 2014, entered the Billboard Heatseekers Album Chart at number 7.[1]\n"
      ]
   },
   "History": {
      "Formation (2002–2005)": {
         "text": [
            "This Will Destroy You was formed by guitarists Jeremy Galindo and Chris King, bassist Raymond Brown and drummer Andrew Miller in San Marcos, Texas,[2] in 2005.[note 1][3] They had met through mutual friends,[4] and played together in various different bands throughout high school[5] before the lineup was finalized by around 2002.[6]\n",
            "Early iterations of the band featured Galindo on vocals[7] and \"sounded like Radiohead\",[8] but after recording some tracks they decided the results were \"awful\" and didn't fit in with the rest of their music.[9][10] After composing their next song \"The World Is Our___\", the band decided to write instrumental music instead.[8] Chris King said in an interview with BBC Radio Foyle, \"we were ... writing different kinds of songs and we wrote one [instrumental] song, and we were like, that works, let's go for it!\"[11]\n",
            "The band's name originated from a song that was to be called \"This Will Destroy You\", but this was rejected for being too pretentious. The band found it \"hilarious.\"[12] When asked whether he wished the band had chosen a different name, King said to Rock Sound, \"It's supposed to be a little bit obnoxious. There's something about people automatically hating you before you play that's kind of endearing. It gets to the point where it's over-the-top obnoxious. It's an attention-grabber and people will check it out I guess. Even if they hate it.\"[13]\n"
         ]
      },
      "Young Mountain (2004–2006)": {
         "text": [
            "This Will Destroy You self-recorded and self-produced their first EP, Young Mountain, in 2005.[14] They intended it to be just a demo,[15] and sold it as a CD-R after their concerts.[16] The release was reviewed by a number of critics and was generally praised. The band was contacted by Magic Bullet Records owner Brent Eyestone over the internet and he asked them to contribute a track to his label's It Came From The Hills Vol. 1 compilation.[17] The band sent Eyestone a copy of their demo to thank him, after which he invited them to tour with Sparrows Swarm and Sing.[18] This Will Destroy You then began to work with Magic Bullet on the basis of a verbal agreement;[19] in keeping with the labels DIY attitude, no written contract was ever signed.[17]\n",
            "In June 2006 Magic Bullet re-packaged and re-released Young Mountain.[20][21] The band began to gather mentions in more publications, including Pitchfork Media[22] and Rolling Stone.[20] A Sputnikmusic review said, \"TWDY's sound is near perfect. Production wise, everything is right where it should be. Tone wise, it doesn't get much better. The quiet parts are tear jerking. The loud parts, while equally tear jerking, are brutal.\"[23] The EP came in for particular praise from Rock Sound, who called it \"an astonishingly beautiful work that promises a bright future\";[24] editor Darren Taylor named it as the best release of 2006.[25]\n"
         ]
      },
      "This Will Destroy You (2006–2008)": {
         "text": [
            "The writing process for This Will Destroy You, the band's eponymous debut studio album, was initially a slow and fragmented one. The band members were all living in different cities within Texas, due to work and school commitments, and so could only meet irregularly. Chris King said to Rock Sound, \"[Writing] was a struggle; when we did meet up, sometimes the ideas would come flowing, but at others we'd just stand there for the whole time staring at each other.\"[26] In February 2007 the band began recording with producer John Congleton at a studio in Texas owned by the country music singer Willie Nelson,[27] a process that took several months.\n",
            "The band was booked to tour the United States during July and August, along with 65daysofstatic, Fear Before the March of Flames and Hot Cross.[28] However, after one of their concerts guitarist Jeremy Galindo fell ill; he was later diagnosed in hospital as suffering from Crohn's disease, an inflammatory bowel condition.[26] This led to the band having to cancel all their remaining summer tour dates.[29] Combined with financial problems, this caused the band to go on a three-month hiatus, a time where the future of the band was uncertain.[26]\n",
            "This Will Destroy You was released by Magic Bullet in January 2008.[30] It was generally positively received: Rock Sound compared it to \"the soundtrack to the impending apocalypse\"[14] and awarded it the fifth best album of the year,[31] while Drowned in Sound called it \"a true classic of its kind.\"[32] Shortly after the release of the album, the band parted company with bass guitar player Raymond Brown, who left in order to focus on his medical career.[26] The band auditioned a number of bassists,[26] before permanently recruiting Donovan Jones.[33] In March 2008 the band toured Europe for the first time,[34] playing at the Bevrijdingspop,[35] Out of the Crowd[36] and Rhâââ Lovely festivals.[37] The tour lasted for six weeks and included performances with Boris and Devil Sold His Soul.[34] The song \"The Mighty Rio Grande\" from the band's self-titled release was featured in the films Moneyball (2011), Earth to Echo (2014), and Room (2015), and in the series Lethal Weapon.\n"
         ]
      },
      "Field Studies (2008–2009)": {
         "text": [
            "The foundations for what would become the Field Studies EP were formed in late 2007. This Will Destroy You and Lymbyc Systym were touring the United States together and decided to collaborate on a split record; the members of both bands were good friends and had further plans to tour again together in the future.[38] They came together at John Congleton′s Texas studio in July 2008 to record their contributions; This Will Destroy You tracking two longer pieces to Lymbyc Systyms three shorter songs.[39]\n",
            "In September Lymbyc Systym released Love Your Abuser Remixed, a remix album of their previous record Love Your Abuser. It featured a This Will Destroy You version of the title track, the band's first official remix.[40]\n",
            "Field Studies was released in January 2009 on Magic Bullet[41] and received a generally positive critical reception, but was criticized for being \"nothing groundbreaking.\"[39] Rock Sound's Joe Marshall echoed similar sentiments by saying: “Of course, neither track is especially original and it’s fairly easy to predict the trajectories they take, but ultimately this is seriously beautiful music.”[38]\n",
            "The band then set out on a series of tours, including an appearance at the ATP festival in April, playing alongside bands such as Devo and The Jesus Lizard.[42] In July they played on the main stage at Rock Herk festival.[43] In October of the same year the band performed at Damnation Festival, where they shared a stage with Jesu.[44] In November the band parted company with Andrew Miller,[45] due to musical differences between the members.[46] They replaced him with Alex Bhore, their tour manager and former drummer for The New Frontiers.[47][48]\n"
         ]
      },
      "Moving on the Edges of Things and Tunnel Blanket (2009–2014)": {
         "text": [
            "The band began working on their second studio album, to be called Tunnel Blanket, in late 2009.\n",
            "On April 1 the band posted a message on their Tumblr announcing that they had split.[49] This was followed by a press release from their label, explaining the decision as being due to \"uncertainty placed upon them by the behaviors and disappearances of other members.\"[50] After it emerged that the whole incident was an April Fool's Day prank carried out by drummer Alex Bhore and Magic Bullet Records owner Brent Eyestone,[49] Daniel Hopkins from the Dallas Observer named it as one of \"the funniest april fool's day pranks in the local music scene.\"[51]\n",
            "In May 2010 the band released an exclusive track titled \"Their Celebrations\" as part of PEACE, a compilation in aid of Amnesty International,[52] after a request from the charity.[46] The band subsequently released a two-song 12\" EP titled Moving on the Edges of Things in August 2010,[53] before embarking on a September US tour, supporting the metal group Deftones.[54] This was followed by a September and October European tour, including a performance at the Incubate festival.[55] A 7\" single, Communal Blood, was released in December of the same year. This was the band's first single and featured two tracks from Tunnel Blanket.[56] This has been recorded and mixed by John Congleton,[45] and is set for release in Europe on May 9, 2011 on Monotreme Records,[57] and on May 10 on Suicide Squeeze Records for the rest of the world with exception of Australia / New Zealand, as released by Hobbledehoy Record Co..[58] The band is set to tour Europe in June and July to promote the record,[59] which will include an appearance at Dour Festival in Belgium.[60]\n",
            "In March 2013, This Will Destroy You performed their first ever Australian tour, supported by Perth act Tangled Thoughts of Leaving. In October 2013, the band released a live album, titled Live in Reykjavik, Iceland. During their performance at the Crescent Ballroom in Phoenix, Arizona on March 12, 2014, the group stated that they would release an album by the end of the year.[citation needed]\n"
         ]
      },
      "Another Language and New Others Duology (2014–present)": {
         "text": [
            "On June 23, 2014 Suicide Squeeze announced This Will Destroy You's third studio album, Another Language, which was released September 16, 2014.[61]\n",
            "The single from the album, Dustism, was released on their blog on June 25.[62]\n",
            "The band toured Australia, New Zealand and Asia in May–June 2015.[63][64][65] They subsequently announced that they will be going on tour with Deafheaven and Emma Ruth Rundle in early 2017.[66] The band announced on their Instagram that they are working on their fourth studio album, New Others Part One, which was released September 28, 2018.\"New Others Part Two\" was released on October 16, 2018 after the band had teased the release of new music just hours beforehand.[67]\n",
            "On May 1, 2020 the band released a compilation EP, Variations & Rarities: 2004-2019\" Vol. I. [68]\n",
            "On the 18th of August, 2020, the band announced on Facebook that they had parted ways with their longstanding guitarist, Chris King.[69] The Facebook post has since been deleted.\n"
         ]
      }
   },
   "Musical style and influences": {
      "text": [
         "The band's compositions typically feature a wide dynamic range,[70][26] with slow build-ups to a \"wall of noise\" crescendo.[14][71] The guitars are usually the most prominent feature of the band's sound,[72] combining ambient soundscapes with simple melodies,[14] and using a number of effects, such as reverb,[73] sustain and distortion.[14][74][32]\n",
         "Many reviews categorized the band's early releases as post-rock,[26][46][71] and compared them to other bands of the genre, most notably fellow Texas instrumental group Explosions in the Sky,[2][14][75] although the band members largely reject this description.[76]  In an interview with the Dallas Observer in 2009, Jeremy Galindo said, \"It can be aggravating. I think after this new album comes out, a lot of that is gonna stop. Because this next album is definitely gonna be sounding more like the stuff that we do listen to.\"[70] The band describe their new sound as being darker and heavier, referring to it as \"doomgaze\",[4][45][46] a portmanteau of doom metal and shoegaze.[77]\n"
      ]
   },
   "Other projects": {
      "text": [
         "Chris King is a member of the Austin-based ambient band Amasa Gana, who have yet to release an album.[78] They are signed to Light Lodge Records, a label run by King.[79] He also writes ambient electronica music under the moniker Mosh Patrol,[80] under which he has released a split record with Aughra, titled Is There Anyone Else Outside?[81] He currently makes solo music under SYMBOL\n",
         "Jeremy Galindo, along with Magic Bullet Records' Brent Eyestone, runs an independent film studio called We Tried Film. Their first production is set for release in summer 2012.\n"
      ]
   },
   "Members": {
      "Timeline": {},
      "text": [
         "\n",
         "\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Live albums": {},
      "EPs": {},
      "Singles": {},
      "Music videos": {},
      "Compilations and remixes": {}
   },
   "Notes": {},
   "References": {},
   "Sources": {},
   "External links": {},
   "coreData": [
      "This Will Destroy You (abbreviated as TWDY) is an American post-rock band from San Marcos, Texas, formed in 2004. They typically compose lengthy atmospheric instrumental pieces, featuring layers of effects-laden guitar and a heavy usage of dynamics. Their fourth album Another Language, released in 2014, entered the Billboard Heatseekers Album Chart at number 7.[1]\n",
      "This Will Destroy You was formed by guitarists Jeremy Galindo and Chris King, bassist Raymond Brown and drummer Andrew Miller in San Marcos, Texas,[2] in 2005.[note 1][3] They had met through mutual friends,[4] and played together in various different bands throughout high school[5] before the lineup was finalized by around 2002.[6]\n",
      "Early iterations of the band featured Galindo on vocals[7] and \"sounded like Radiohead\",[8] but after recording some tracks they decided the results were \"awful\" and didn't fit in with the rest of their music.[9][10] After composing their next song \"The World Is Our___\", the band decided to write instrumental music instead.[8] Chris King said in an interview with BBC Radio Foyle, \"we were ... writing different kinds of songs and we wrote one [instrumental] song, and we were like, that works, let's go for it!\"[11]\n",
      "The band's name originated from a song that was to be called \"This Will Destroy You\", but this was rejected for being too pretentious. The band found it \"hilarious.\"[12] When asked whether he wished the band had chosen a different name, King said to Rock Sound, \"It's supposed to be a little bit obnoxious. There's something about people automatically hating you before you play that's kind of endearing. It gets to the point where it's over-the-top obnoxious. It's an attention-grabber and people will check it out I guess. Even if they hate it.\"[13]\n"
   ]
}