{
   "Name": "Toe (band)",
   "rawData": [
      "Toe, stylized as toe, is a Japanese post-rock/math rock band from Tokyo. The group was founded in 2000, and consists of Kashikura Takashi (drums), Mino Takaaki (guitar), Yamane Satoshi (bass guitar), and Yamazaki Hirokazu (guitar).\n",
      "Toe is currently one of four bands on the indie label Machu Picchu, which was formed by the members of Toe, along with the bands Mouse on the Keys, Enemies, and Tangled Hair.\n",
      "The vast majority of the band's music is instrumental. The band has changed their sound over their musical tenure by incorporating acoustic guitars, Rhodes piano, and vibraphones in their most recent releases. The band tours regularly in Japan.\n"
   ],
   "infobox": {
      "Origin": [
         "Tokyo, Japan"
      ],
      "Genres": [
         "Post-rock, math rock"
      ],
      "Years active": [
         "2000–present"
      ],
      "Labels": [
         "Catune, Machu Picchu, Topshelf, Big Scary Monsters"
      ],
      "Associated acts": [
         "Pele, The Hiatus"
      ],
      "Website": [
         "www.toe.st"
      ],
      "Members": [
         "Kashikura Takashi",
         "Mino Takaaki",
         "Yamane Satoshi",
         "Yamazaki Hirokazu"
      ]
   },
   "albums": [
      "The Book About My Idle Plot on a Vague Anxiety",
      "For Long Tomorrow",
      "Hear You"
   ],
   "prunedData": [
      "[BAND_NAME], stylized as toe, is a [GENRE] band from Tokyo. The group was founded in [YEAR], and consists of Kashikura Takashi (drums), [PERSON_NAME_FULL_0_MALE] (guitar), Yamane Satoshi (bass guitar), and Yamazaki Hirokazu (guitar).\n",
      "[BAND_NAME] is currently one of four bands on the indie label Machu Picchu, which was formed by the members of [BAND_NAME], along with the bands Mouse on the Keys, Enemies, and Tangled Hair.\n",
      "The vast majority of the band's music is instrumental. The band has changed their sound over their musical tenure by incorporating acoustic guitars, Rhodes piano, and vibraphones in their most recent releases. The band tours regularly in Japan.\n"
   ]
}