{
   "Name": "Tortoise (band)",
   "Sections": [
      "1 History",
      "1.1 1990s",
      "1.2 2000s–present",
      "2 Musical style",
      "3 Discography",
      "3.1 Studio albums",
      "3.2 Other releases",
      "3.3 Remix albums and compilations",
      "3.4 Singles and music videos",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Tortoise is an American post-rock band formed in Chicago, Illinois in 1990.[1] The band incorporates krautrock, dub, minimal music, electronica and jazz into their music, a combination sometimes termed \"post-rock\". Tortoise have been consistently credited for the rise of the post-rock movement in the 1990s.\n"
      ]
   },
   "History": {
      "1990s": {
         "text": [
            "The group's origins lie in the late 1980s pairing of Doug McCombs (bassist with Eleventh Dream Day) and drummer John Herndon, who initially wanted to establish themselves as a freelance rhythm section (like reggae legends Sly and Robbie). The idea did not come to fruition, but their interest in grooving rhythms, as well as their recording studio knowledge led to partnerships with drummer John McEntire and bassist Bundy K. Brown (both formerly of Bastro) joining, followed by percussionist Dan Bitney. Though songs are credited to all the musicians, McEntire became perceived as the group's guiding force,[citation needed] as his contributions mainly took the form of being the recording engineer and mixer.\n",
            "Their first single was issued in 1993, and their self-titled debut album followed a year later.[2] Instrumental and mostly mid-tempo, Tortoise slowly garnered praise and attention, notably for its unusual instrumentation (two bass guitars, three percussionists switching between drums, vibraphones and marimbas). A remix album followed, Rhythms, Resolutions and Clusters.[2]\n",
            "Brown left and was replaced by David Pajo (formerly of Slint) for 1996's Millions Now Living Will Never Die,[2] which showed up on many year-end best of lists, and the 20 minute Djed was described by critic John Bush as proof that \"Tortoise made experimental rock do double duty as evocative, beautiful music.\"[3] Also in 1996, the band contributed to the AIDS benefit album Offbeat: A Red Hot Soundtrip produced by the Red Hot Organization.\n",
            "They also released a Japanese-only compilation featuring tracks from the eponymous debut, Rhythms, singles and compilation appearances. Named A Digest Compendium of the Tortoise's World on November 21, 1996 [4]\n",
            "In 1998, Tortoise released TNT, arguably their most jazz-inflected album.[2] Jeff Parker had joined as a guitarist alongside Pajo, who left the band following the album's completion.\n"
         ]
      },
      "2000s–present": {
         "text": [
            "2001 led to Standards, where Tortoise incorporated more electronic sounds and post-production into its music than in previous works. In 2001, the band curated an edition of the British All Tomorrow's Parties festival. They then returned in 2004 to curate another day of the same event.\n",
            "It's All Around You was released in 2004. In 2006, Tortoise collaborated with Bonnie 'Prince' Billy on an album of covers entitled The Brave and the Bold, and released A Lazarus Taxon, a box set containing two CDs of single tracks and remixes, a third CD with an expanded Rhythms, Resolutions and Clusters (out of print) and a DVD of videos and film of live performances. In 2001, the band recorded \"Didjeridoo\" for the Red Hot Organization's compilation album Red Hot + Indigo, a tribute to Duke Ellington, which raised money for various charities devoted to AIDS related causes.\n",
            "Bitney and McEntire also contributed to the Bright Eyes album Cassadaga. The group has worked with multi-instrumentalist Paul Duncan of the band Warm Ghost.[5]\n",
            "Tortoise released their previous to last album Beacons of Ancestorship on June 23, 2009.[6]  The band toured the Midwestern US in September and October 2009, and then in Europe in November and December.\n",
            "The band performed at the ATP New York 2010 music festival, which was held in Monticello, New York.\n",
            "In 2012, Tortoise wrote and recorded the soundtrack to Eduardo Sánchez's Lovely Molly, a psychological horror film partly inspired by traditional folk-songs.[7]\n",
            "In July 2013, photos and short videos of the band recording new music were posted to Tortoise's official Instagram and Facebook pages. On April 20, 2014, the band wrote on their Facebook page: \"Hello, Facebook. We are heading back into the studio next week – LP VII in progress. Tokyo, Osaka, Singapore, Kuala Lumpur, Hong Kong, Beijing, Shanghai and Taiwan – see you soon.\"[8]\n",
            "On October 6, 2015, it was announced that a new album, called The Catastrophist, would be released in early 2016 by Thrill Jockey.[9]  Additionally, a single from the new album, entitled Gesceap, was released and it is available on YouTube. Mail order pressings of the album are available through Thrill Jockey as of October 10, 2015.[10]\n"
         ]
      }
   },
   "Musical style": {
      "text": [
         "As Tortoise rose to prominence in their early career, their often instrumental music has been noted for its ambiguous categorization. The members have roots in Chicago's fertile music scene, playing in various indie rock and punk rock groups. Tortoise was among the first American indie rock bands to incorporate styles closer to krautrock, dub, minimal music, electronica and various jazz styles, rather than the strong rock and roll roots that had dominated the genre.\n",
         "Tortoise has been cited as being one of the prime forces behind the development and popularity of the post-rock movement.[11][12] CMJ writer Jim Allen highlighted the influence of progressive rock on Tortoise's post-rock style.[11]\n",
         "Other groups related to Tortoise include The Sea and Cake, Brokeback, Slint, Isotope 217, Chicago Odense Ensemble, Tar Babies, and the Chicago Underground Duo. Tortoise records on the Thrill Jockey label.\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Other releases": {},
      "Remix albums and compilations": {},
      "Singles and music videos": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Tortoise is an American post-rock band formed in Chicago, Illinois in 1990.[1] The band incorporates krautrock, dub, minimal music, electronica and jazz into their music, a combination sometimes termed \"post-rock\". Tortoise have been consistently credited for the rise of the post-rock movement in the 1990s.\n",
      "The group's origins lie in the late 1980s pairing of Doug McCombs (bassist with Eleventh Dream Day) and drummer John Herndon, who initially wanted to establish themselves as a freelance rhythm section (like reggae legends Sly and Robbie). The idea did not come to fruition, but their interest in grooving rhythms, as well as their recording studio knowledge led to partnerships with drummer John McEntire and bassist Bundy K. Brown (both formerly of Bastro) joining, followed by percussionist Dan Bitney. Though songs are credited to all the musicians, McEntire became perceived as the group's guiding force,[citation needed] as his contributions mainly took the form of being the recording engineer and mixer.\n",
      "Their first single was issued in 1993, and their self-titled debut album followed a year later.[2] Instrumental and mostly mid-tempo, Tortoise slowly garnered praise and attention, notably for its unusual instrumentation (two bass guitars, three percussionists switching between drums, vibraphones and marimbas). A remix album followed, Rhythms, Resolutions and Clusters.[2]\n",
      "Brown left and was replaced by David Pajo (formerly of Slint) for 1996's Millions Now Living Will Never Die,[2] which showed up on many year-end best of lists, and the 20 minute Djed was described by critic John Bush as proof that \"Tortoise made experimental rock do double duty as evocative, beautiful music.\"[3] Also in 1996, the band contributed to the AIDS benefit album Offbeat: A Red Hot Soundtrip produced by the Red Hot Organization.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, United States"
      ],
      "Genres": [
         "Post-rock"
      ],
      "Years active": [
         "1990–present"
      ],
      "Labels": [
         "Thrill Jockey, Warp, City Slang, Domino"
      ],
      "Associated acts": [
         "Bastro, The Sea And Cake, Bonnie \"Prince\" Billy, Eleventh Dream Day, Poster Children, Slint, The For Carnation, Brokeback, Isotope 217, Zwan, Beck"
      ],
      "Website": [
         "trts.com"
      ],
      "Members": [
         "Dan Bitney",
         "Doug McCombs",
         "Jeff Parker",
         "John Herndon",
         "John McEntire"
      ],
      "Past members": [
         "Bundy K. Brown",
         "David Pajo"
      ]
   }
}