{
   "Name": "Tortoise (band)",
   "rawData": [
      "Tortoise is an American post-rock band formed in Chicago, Illinois in 1990. The band incorporates krautrock, dub, minimal music, electronica and jazz into their music, a combination sometimes termed \"post-rock\". Tortoise have been consistently credited for the rise of the post-rock movement in the 1990s.\n",
      "The group's origins lie in the late 1980s pairing of Doug McCombs (bassist with Eleventh Dream Day) and drummer John Herndon, who initially wanted to establish themselves as a freelance rhythm section (like reggae legends Sly and Robbie). The idea did not come to fruition, but their interest in grooving rhythms, as well as their recording studio knowledge led to partnerships with drummer John McEntire and bassist Bundy K. Brown (both formerly of Bastro) joining, followed by percussionist Dan Bitney. Though songs are credited to all the musicians, McEntire became perceived as the group's guiding force, as his contributions mainly took the form of being the recording engineer and mixer.\n",
      "Their first single was issued in 1993, and their self-titled debut album followed a year later. Instrumental and mostly mid-tempo, Tortoise slowly garnered praise and attention, notably for its unusual instrumentation (two bass guitars, three percussionists switching between drums, vibraphones and marimbas). A remix album followed, Rhythms, Resolutions and Clusters.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, United States"
      ],
      "Genres": [
         "Post-rock"
      ],
      "Years active": [
         "1990–present"
      ],
      "Labels": [
         "Thrill Jockey, Warp, City Slang, Domino"
      ],
      "Associated acts": [
         "Bastro, The Sea And Cake, Bonnie \"Prince\" Billy, Eleventh Dream Day, Poster Children, Slint, The For Carnation, Brokeback, Isotope 217, Zwan, Beck"
      ],
      "Website": [
         "trts.com"
      ],
      "Members": [
         "Dan Bitney",
         "Doug McCombs",
         "Jeff Parker",
         "John Herndon",
         "John McEntire"
      ],
      "Past members": [
         "Bundy K. Brown",
         "David Pajo"
      ]
   }
}