{
   "Name": "Trans-Siberian Orchestra",
   "rawData": [
      "Trans-Siberian Orchestra (TSO) is an American rock band founded in 1996 by producer, composer, and lyricist Paul O'Neill, who brought together Jon Oliva and Al Pitrelli (both members of Savatage) and keyboardist and co-producer Robert Kinkel to form the core of the creative team. O'Neill died on April 5, 2017. The band gained in popularity when they began touring in 1999 after completing their second album, The Christmas Attic, the year previous. In 2007, the Washington Post referred to them as \"an arena-rock juggernaut\" and described their music as \"Pink Floyd meets Yes and the Who at Radio City Music Hall.\" TSO has sold more than 10 million concert tickets and over 10 million albums. The band has released a series of rock operas: Christmas Eve and Other Stories, The Christmas Attic, Beethoven's Last Night, The Lost Christmas Eve, their two-disc Night Castle and Letters From the Labyrinth. Trans-Siberian Orchestra is also known for their extensive charity work and elaborate concerts, which include a string section, a light show, lasers, moving trusses, video screens, and effects synchronized to music.\n",
      "Both Billboard Magazine and Pollstar have ranked them as one of the top ten ticket-selling bands in the first decade of the new millennium. Their path to success was unusual in that, according to O'Neill, TSO is the first major rock band to go straight to theaters and arenas, having never played at a club, never having an opening act and never being an opening act.\n",
      "Paul O'Neill managed and produced rock bands including Aerosmith, Humble Pie, AC/DC, Joan Jett, and Scorpions, later producing and co-writing albums by the progressive metal band Savatage, where he began working with Jon Oliva (who had left Savatage to spend time with his family and take care of personal matters), Al Pitrelli and Robert Kinkel. O'Neill took his first steps into rock music in the 1970s when he started the progressive rock band Slowburn, for whom he was the lyricist and co-composer. What was intended to be the band's debut album was recorded at Jimi Hendrix's Electric Lady Studios and engineered by Dave Wittman. Although Wittman's engineering was capturing the exact sound O'Neill was hearing in his head, O'Neill was having trouble with it because many of his melodies were between two and three octaves. Rather than releasing an album that he was not happy with, he shelved the project, but continued working in the industry at Contemporary Communications Corporation (also known as Leber & Krebs).\n"
   ],
   "infobox": {
      "Also known as": [
         "TSO"
      ],
      "Origin": [
         "Tampa, Florida, United States"
      ],
      "Genres": [
         "Symphonic metal[1][2]",
         "progressive rock[1][3]",
         "heavy metal[1]",
         "Christmas[1]",
         "hard rock[1]",
         "neoclassical metal[4]"
      ],
      "Years active": [
         "1996 (1996)–present"
      ],
      "Labels": [
         "Lava",
         "Atlantic",
         "Rhino",
         "Republic"
      ],
      "Associated acts": [
         "Savatage",
         "Jon Oliva's Pain"
      ],
      "Website": [
         "trans-siberian.com"
      ]
   },
   "albums": [
      "Christmas Eve and Other Stories",
      "The Christmas Attic",
      "The Ghosts of Christmas Eve",
      "Beethoven's Last Night",
      "The Lost Christmas Eve",
      "Night Castle",
      "Dreams of Fireflies (On a Christmas Night)",
      "Tales of Winter: Selections from the TSO Rock Operas",
      "Letters from the Labyrinth"
   ],
   "prunedData": [
      "[BAND_NAME] (TSO) is an [GENRE] band founded in [YEAR] by producer, composer, and lyricist Paul O'Neill, who brought together [PERSON_NAME_FULL_0_MALE] and Al Pitrelli (both members of Savatage) and keyboardist and co-producer [PERSON_NAME_FULL_1_MALE] to form the core of the creative team. O'Neill died on [MONTH] 5, [YEAR]. The band gained in popularity when they began touring in [YEAR] after completing their second album, The Christmas Attic, the year previous. In [YEAR], the Washington Post referred to them as [SONG_NAME] TSO has sold more than 10 million concert tickets and over 10 million albums. The band has released a series of rock operas: Christmas Eve and Other Stories, The Christmas Attic, Beethoven's Last Night, The Lost Christmas Eve, their two-disc Night Castle and Letters From the Labyrinth. [BAND_NAME] is also known for their extensive charity work and elaborate concerts, which include a string section, a light show, lasers, moving trusses, video screens, and effects synchronized to music.\n",
      "Both Billboard Magazine and Pollstar have ranked them as one of the top ten ticket-selling bands in the first decade of the new millennium. Their path to success was unusual in that, according to O'Neill, TSO is the first major rock band to go straight to theaters and arenas, having never played at a [GENRE] an opening act and never being an opening act.\n",
      "Paul O'Neill managed and produced rock bands including Aerosmith, Humble Pie, AC/DC, [PERSON_NAME_FULL_1_FEMALE], and Scorpions, later producing and co-writing albums by the progressive metal band Savatage, where he began working with [PERSON_NAME_FULL_2_MALE] (who had left Savatage to spend time with his family and take care of personal matters), Al Pitrelli and [PERSON_NAME_FULL_3_MALE]. O'Neill took his first steps into rock music in the [YEAR]s when he started the progressive rock band Slowburn, for whom he was the lyricist and co-composer. What was intended to be the band's debut album was recorded at Jimi Hendrix's Electric Lady Studios and engineered by [PERSON_NAME_FULL_0_MALE]. Although [PERSON_NAME_LAST_0]'s engineering was capturing the exact sound O'Neill was hearing in his head, O'Neill was having trouble with it because many of his melodies were between two and three octaves. Rather than releasing an album that he was not happy with, he shelved the project, but continued working in the industry at Contemporary Communications Corporation (also known as Leber & Krebs).\n"
   ]
}