{
   "Name": "Trans-Siberian Orchestra",
   "Sections": [
      "1 History",
      "1.1 Origins and formation",
      "1.2 Christmas Eve and Other Stories and The Christmas Attic (1996–1998, 2014)",
      "1.3 Beethoven's Last Night (1999–2000, 2010–2012)",
      "1.4 The Lost Christmas Eve (2004, 2013)",
      "1.5 Night Castle (2009–2011)",
      "1.6 Dreams of Fireflies (2012)",
      "1.7 Tales of Winter: Selections from the TSO Rock Operas (2013)",
      "1.8 Who I Am",
      "1.9 Merry Christmas Rabbi",
      "1.10 2017 deaths and subsequent touring",
      "2 TSO's influence",
      "2.1 Bands influenced",
      "2.2 Lighting displays",
      "2.3 Philanthropic activities",
      "2.4 Fans and crew",
      "3 Touring",
      "3.1 Wacken Open Air Festival 2015",
      "4 List of touring performers",
      "5 Discography",
      "6 See also",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Trans-Siberian Orchestra (TSO[5]) is an American rock band founded in 1996 by producer, composer, and lyricist Paul O'Neill, who brought together Jon Oliva and Al Pitrelli (both members of Savatage) and keyboardist and co-producer Robert Kinkel to form the core of the creative team. O'Neill died on April 5, 2017. The band gained in popularity when they began touring in 1999 after completing their second album, The Christmas Attic, the year previous. In 2007, the Washington Post referred to them as \"an arena-rock juggernaut\" and described their music as \"Pink Floyd meets Yes and the Who at Radio City Music Hall.\"[6] TSO has sold more than 10 million concert tickets and over 10 million albums.[5][7] The band has released a series of rock operas: Christmas Eve and Other Stories, The Christmas Attic, Beethoven's Last Night, The Lost Christmas Eve, their two-disc Night Castle and Letters From the Labyrinth.[5] Trans-Siberian Orchestra is also known for their extensive charity work and elaborate concerts, which include a string section, a light show, lasers, moving trusses, video screens, and effects synchronized to music.[3]\n",
         "Both Billboard Magazine and Pollstar have ranked them as one of the top ten ticket-selling bands in the first decade of the new millennium.[8][9] Their path to success was unusual in that, according to O'Neill, TSO is the first major rock band to go straight to theaters and arenas, having never played at a club, never having an opening act and never being an opening act.[10]\n"
      ]
   },
   "History": {
      "Origins and formation": {
         "text": [
            "Paul O'Neill managed and produced rock bands including Aerosmith, Humble Pie, AC/DC, Joan Jett, and Scorpions, later producing and co-writing albums by the progressive metal band Savatage, where he began working with Jon Oliva (who had left Savatage to spend time with his family and take care of personal matters), Al Pitrelli and Robert Kinkel. O'Neill took his first steps into rock music in the 1970s when he started the progressive rock band Slowburn, for whom he was the lyricist and co-composer. What was intended to be the band's debut album was recorded at Jimi Hendrix's Electric Lady Studios and engineered by Dave Wittman. Although Wittman's engineering was capturing the exact sound O'Neill was hearing in his head, O'Neill was having trouble with it because many of his melodies were between two and three octaves. Rather than releasing an album that he was not happy with, he shelved the project, but continued working in the industry at Contemporary Communications Corporation (also known as Leber & Krebs).[citation needed]\n",
            "Over the years, O'Neill continued to work as a writer, producer, manager, and concert promoter. In 1996, he accepted Atlantic Records' offer to start his own band.[11] He built the band on a foundation created by the marriage of classical and rock music and the artists he idolized (Emerson, Lake & Palmer, Queen, Yes, The Who, and Pink Floyd, and hard rock bands such as Aerosmith and Led Zeppelin and the multiple lead vocalists of the R&B groups the Temptations and the Four Tops).[12] He brought in Oliva, Kinkel, and Pitrelli to help start the project. O'Neill has stated, \"My original concept was six rock operas, a trilogy about Christmas and maybe one or two regular albums.\"[13]\n",
            "In the 1980s I was fortunate enough to have visited Russia. If anyone has ever seen Siberia, it is incredibly beautiful but incredibly harsh and unforgiving as well. The one thing that everyone who lives there has in common that runs across it in relative safety is the Trans-Siberian Railway. Life, too, can be incredibly beautiful but also incredibly harsh and unforgiving, and the one thing that we all have in common that runs across it in relative safety is music. It was a little bit overly philosophical, but it sounded different, and I like the initials, TSO.[citation needed]"
         ]
      },
      "Christmas Eve and Other Stories and The Christmas Attic (1996–1998, 2014)": {
         "text": [
            "Their debut album, the first installment of the intended Christmas Trilogy, was a rock opera called Christmas Eve and Other Stories, and was released in 1996.[12] It remains among their best-selling albums. It contains the instrumental \"Christmas Eve/Sarajevo 12/24\" which originally appeared on Savatage's rock opera, Dead Winter Dead, a story about the Bosnian War. Their 1998 release The Christmas Attic, the sequel to Christmas Eve and Other Stories followed a similar format. This album produced the hit \"Christmas Canon,\" a take on Johann Pachelbel's Canon in D major with lyrics and new melodies added.\nThe Christmas Attic was first performed live in 2014.\n"
         ]
      },
      "Beethoven's Last Night (1999–2000, 2010–2012)": {
         "text": [
            "Beethoven's Last Night was written and recorded in 1998 & 1999 and turned in to Atlantic Records late 1999 for release in 2000. The story begins when Mephistopheles appears before Beethoven, whom Paul O'Neill refers to as \"the world's first Heavy Metal Rock Star\",[14][15] to collect the great composer's soul. Of course Beethoven is horrified at the thought of eternal damnation, but the devil has an offer and the bargaining begins. There are numerous plot twists including the fate of his music and the ending is based on a true but little known fact about Beethoven. Also in 1998, at the request of Scott Shannon of WPLJ they performed live for the first time in a charity concert for Blythedale Children's Hospital. In 1999, at the urging of Bill Louis, a DJ for WNCX in Cleveland, they did their first tour, during which they debuted sections of Beethoven's Last Night. They performed the album in its entirety for the first time during the spring tour of 2010.  In October 2011, Beethoven's Last Night was released in Europe to coincide with their European tour with new cover art by Greg Hildebrandt and the missing pages of poetry from the original release.\n",
            "The Mephistopheles songs are sung by Jon Oliva.[16]\n",
            "To coincide with the 2012 spring tour, Beethoven's Last Night: The Complete Narrated Version, was released by Atlantic/Rhino/Warner Brothers Record.[17][18] This two-disc deluxe edition includes all of the music from the original release and, for the first time, the narration featured during live performances of the album. It comes packaged with a booklet filled with Hildebrandt's illustrations of the story, plus the full lyrics and narration. The narration is performed by Bryan Hicks, who has been handling the live narration on the tours for this album.  Creator Paul O'Neill explains, \"This is how I have always envisioned the story being experienced. Where the listener can relax, close their eyes and within minutes be wandering the streets of 1800s Vienna with Beethoven on the last great adventure of his life.\"[19]\n"
         ]
      },
      "The Lost Christmas Eve (2004, 2013)": {
         "text": [
            "Whenever the band was off the road they returned to the studio and in 2004 completed The Lost Christmas Eve, the final installment of the Christmas Trilogy. It is a story of loss and redemption that encompasses a rundown hotel, an old toy store, a blues bar, a Gothic cathedral and their respective inhabitants all intertwined on a single enchanted Christmas Eve in New York City. The next year they combined all three Christmas albums and released them in a box set titled The Christmas Trilogy, which also contained a DVD of their 1999 TV special The Ghosts of Christmas Eve[20] (Each of the albums still continue to be available individually.) The Lost Christmas Eve was first performed live in 2012 followed by a encore tour in 2013.[21] Critics once again called it \"stunning showmanship\"[22] \"that included every trick known to man kind including massive pyro, spectacular lasers, stages that hover over the audience,  hot back up singers all the while constantly connecting with their audience.\"[23]\n"
         ]
      },
      "Night Castle (2009–2011)": {
         "text": [
            "After another few years of touring, Night Castle, Trans-Siberian Orchestra's fifth album, was released on October 27, 2009 well received by fans and critics alike. It debuted at #5 on the Billboard Album Charts.[24] It was certified gold in eight weeks and is now platinum. \"Their most ambitious and adventurous work to date. It runs the gamut from hard rock to classical taking the listener on a journey through history detailing the triumphs and follies of man but is ultimately a story of transformation and love.\"[25] Initially intended to be their first regular, non rock opera, consisting of ten stand alone songs album, O'Neill credits Jon Oliva persistence that it was too early for such a move and that the fifth album had to be a rock opera. Insisting that \"TSO was not like any other band and that the fans expected a story. It was a little bit of a role reversal because when we were working in Savatage, I was always wanting to do a concept record.\"[26] The two-disc set includes a version of \"O Fortuna\" from Carmina Burana by Carl Orff, which was previewed live by the band during their 2004–2008 tours. An MP3 version of the album released through Amazon.com contains an additional track entitled \"The Flight of Cassandra.\"[27][28]\n",
            "The first half is a rock opera about a seven-year-old child on a beach who meets a stranger from New York City who tells her a story that takes her all around the world and through time where she encounters various characters, many of which are based on historical individuals such as Desiderius Erasmus. The second half pays homage to Trans-Siberian Orchestra's influences. It also contains new versions of several Savatage songs as well as \"Nut Rocker,\" originally by B. Bumble and the Stingers and previously made famous by Emerson, Lake & Palmer, featuring Greg Lake on bass guitar.\n",
            "In February 2011, Night Castle was released in Europe with two live bonus tracks (\"Requiem\" and \"Toccata-Carpimus Noctem\") added. Both live tracks were recorded on the 2010 spring tour at the Verizon Theatre at Grand Prairie, in Texas. Metal Kaoz, reviewed it as a two-hour plus double rock opera CD with, \"no filler\" that flows smoothly. \"The classical layers meet the beauty of Metal music and form the fine blend...  a wide range of emotions and musical colors...tracks that will blow your mind. Hit play and wander freely in TSO's, Night Castle.\"\n"
         ]
      },
      "Dreams of Fireflies (2012)": {
         "text": [
            "On October 30, 2012 Trans-Siberian Orchestra released a new five-song EP entitled Dreams of Fireflies (On a Christmas Night) on Lava Republic Universal Records. It debuted in Billboard Magazine's Top 200 Albums chart at number #9, and #1 in the rock charts.[24] It was the band's first EP and with a list price of five dollars or under was Trans-Siberian Orchestra's way of saying thank you to their fans.[29] Rather than containing the usual TSO story, it was more like a Harry Chapin album where a short story is contained within the song. For example, \"Someday\" is about how people have a tendency to put off saying thank you to individuals that they owe a great debt to and with the best of intention tell themselves that they will do it someday. Also each song is accompanied by a short poem.\n"
         ]
      },
      "Tales of Winter: Selections from the TSO Rock Operas (2013)": {
         "text": [
            "Released on October 11, 2013, this fifteen-track collection is Trans-Siberian Orchestra's first greatest hits collection and includes songs from all six prior releases. Cover art once again provided by Greg Hildebrandt.\n"
         ]
      },
      "Who I Am": {
         "text": [
            "On November 11, 2011, TSO released a new choral piece entitled, \"Who I Am\". This was originally released as a digital download to fans who purchased tickets through the band's ticket pre-sale but is now available through other music sites as well as being released on their 2015 album, Letters from the Labyrinth. The song was performed live as the opening number for the 2011 winter tour in acknowledgment of the rough times many people in the world were going through but bringing a message of hope by pointing out that together we can solve these problems as earlier generations have done in the past.[30] It was accompanied by sound and video clips of individuals who helped humanity progress forward or overcome seemingly impossible situations. The first quote and image was Reverend M.L. King's voice echoing \" I Have a dream...that all men will be judged by the content of their character,\" followed by President Kennedy's inaugural challenge, \"Ask not what your country can do for you; ask what you can do for your country.\" It included pictures of Jonas Salk, the scientist who cured polio, Saint \"Mother\" Theresa of Calcutta who spent her life caring for the unwanted and ended with Neil Armstrong taking the first step on the moon and the NASA's Gene Kranz paraphrased quote in regard to saving the astronauts aboard the damaged space capsule Apollo 13, that, \"Failure is not an option.\"\n"
         ]
      },
      "Merry Christmas Rabbi": {
         "text": [
            "In 2013 the band announced the late November release of a novella, Merry Christmas Rabbi. Referred to as the final missing piece to the Christmas Trilogy, it is the journal discovered by the girl in the Christmas Attic rock opera that leads into the song, \"Dream Child\". Press releases described it as \"the story of a fateful Christmas Eve and how one of the craziest gambles in human history leads to a second chance for a troubled youth who finds himself past the point of no return.\"[31][32]\n"
         ]
      },
      "2017 deaths and subsequent touring": {
         "text": [
            "O'Neill died on April 5, 2017, at age 61, while staying at an Embassy Suites by Hilton hotel on the University of South Florida campus in Tampa. Cause of death as determined by the Hillsborough County, Florida medical examiner’s Office, was intoxication from a mixture of methadone, codeine, Valium and doxylamine and the manner of death as drug abuse.[33]\n",
            "In June of 2017, the organization announced that they would continue with their Christmas-themed touring. The Ghosts of Christmas Eve story, which they had performed in 2015 and 2016, was announced as their story once again for the 2017 tour.[34]\n",
            "David Z, bassist for TSO, died on July 14, 2017, while touring with Adrenaline Mob for their \"We The People\" tour; a tractor-trailer veered off Interstate 75 in Florida and struck the RV that Adrenaline Mob was riding in. Fellow TSO and Adrenaline Mob member Russell Allen was also injured in the accident.[35][36]\n",
            "For the 20th annual TSO winter tour in 2018, the band decided to once again tour with The Ghosts of Christmas Eve story.[37] In 2019, TSO returned to the Christmas Eve and Other Stories show, which had previously been performed from the inaugural 1999 tour through 2011.[38] No tour will be held in 2020, due to continued mass gathering restrictions tied to the COVID-19 pandemic in the United States.[39] The band is instead doing a livestream performance for 2020 that fans can purchase tickets for and watch on December 18th online.[40]\n"
         ]
      }
   },
   "TSO's influence": {
      "Bands influenced": {
         "text": [
            "In 2009, a group of musicians from the metro New York area formed a band, called The Wizards of Winter, inspired by TSO.  The Wizards released their own limited-release Christmas album in 2011 while performing a mixture of TSO and original material in live concerts. In 2013, four of the original members of TSO — Tommy Farese, Guy LeMonnier, Tony Gaynor, and Michael Lanning toured as guests with The Wizards of Winter. Another original TSO vocalist, Joe Cerisano toured with them in 2014.  The band released two new Christmas albums (The Wizards of Winter and The Magic of Winter) with Guy LeMonnier and Tony Gaynor joining the band as full members.[41] The band now performs their own original material when touring, with a few TSO songs added.[42] In June 2018, long-time TSO drummer John O. Reilly also joined the Wizards of Winter as a full member.[43]\n"
         ]
      },
      "Lighting displays": {
         "text": [
            "In 2005 Carson Williams started a synchronized lighting race when he used 88 Light-O-Rama channels, over ten thousand lights and a small radio transmitter to illuminate his home to \"Wizards in Winter.\"[44] A video of the house quickly went viral on the internet and eventually was picked up by Miller Lite as the theme for their T.V. ads over the next two years. Other homes soon followed eventually crossing to single homes with over a million lights.[5]  Soon after entire cities like Denver and Chicago were lighting their downtown districts in a similar manner, as well as many major theme parks such as Disney World and Universal Studios.[45]\n"
         ]
      },
      "Philanthropic activities": {
         "text": [
            "Since Trans-Siberian Orchestra began touring, the band has donated over $10 million to a combination of local and national charities.  At every tour stop, the group donates one dollar or more from each ticket sold to a local charity in the city where they are performing.[46][47] A single day (two shows) in New Jersey's Izod arena yielded $40,000 to local charities.[48] The band helps any charity or group they think is in need but especially ones that protect and help children. In 2010 Paul O'Neill voiced the band's philosophy on the TSO's web site and also in the 2010 Winter Tour Book, \"We are all in this together. We must look out for the well being of each other, most of all the young. For the young are the architects of the future and we are the architects of the young. We can not tell those yet to be born that we did our best.\" Paul was a well known history buff.[11][49][50]\n"
         ]
      },
      "Fans and crew": {
         "text": [
            "Paul O'Neill constantly stated that the fans own the band: \"TSO's goal is to make the best albums and concerts we possibly can, sparing no amount of time or expense and then charge the lowest possible price.  No musician or singer is on the TSO flight deck for the money. We do it because we love the energy from the crowd especially the kids. Also in Trans Siberian Orchestra the crew are as much a member of the band as anyone on the flight deck. They actually have the hardest jobs. They are the first ones in and the last ones out. Watching them at work is like watching a well choreographed ballet or military operation. TSO could not be TSO without them and we know it.\"[51][52] Al Pitrelli summed it up more humorously, \"No one in TSO is paid to be on the stage, that we do for free. The money is to stay out of trouble on our off time.\"\n",
            "Over the years, O'Neill consistently thanks the audience,[48] referring to them as the second half of Trans-Siberian Orchestra and that without them TSO would just be notes and words echoing in an empty arena. \"The fans' enthusiasm and energy power the stage show as much, if not more, than any local electric company.\"[53]\n"
         ]
      }
   },
   "Touring": {
      "Wacken Open Air Festival 2015": {
         "text": [
            "On July 30, 2015, Trans-Siberian Orchestra and a reunited Savatage headlined the 26th edition of Wacken Open Air Festival in Germany, which is the largest metal festival in the world. The 2015 festival lasted three days and featured over one hundred bands.[62] This event marked both TSO's first outdoor festival appearance and first Savatage show in 13 years.[63] A massive set was designed so that the two main festival stages would be identical, although this aspect of the show was not revealed until the second half of the performance. For the first 40 minutes Savatage played a reunion show featuring Jon Oliva as the main lead singer for the first time in over 25 years, as well as Zak Stevens. This was followed by a Trans-Siberian Orchestra set on the next stage debuting several new songs. Following this, for the first time in music history, the entire band played a coordinated set spanning the two festival main stages, connected by a catwalk. This united Trans-Siberian Orchestra featured 4 guitarists, 4 keyboard players, 2 drummers, 2 bassists, a full string section, and 24 vocalists and dancers performing in sync for nearly 80,000 people.[64]\n",
            "In the televised broadcast a week after the show but right before the actual performance, Paul O'Neill and Al Pitrelli admitted to being blindsided by non-stop rain and mud on the night before which removed any chance to check the staging until the actual show.[65] Metal Recusants, which favorably reviewed the entire event said, \"If all the above shows were spectacular and memorable the Savatage's and Trans-Siberian Orchestra show is a whole new level of shows...I have never seen such a thing take place before and it was definitely a once in a lifetime experience.\"[66]\n"
         ]
      },
      "text": [
         "In 1999, TSO performed a stage adaptation of Christmas Eve and Other Stories for its first live tour.[54]\n",
         "In 2009, Billboard ranked TSO as one of the Top 25 Touring Artists of the past decade.[8] Live shows are known for their extensive use of pyrotechnics, lasers, and lights synchronized with the performance.[5][12][55]\n",
         "Between 2010 and 2012 spring tours were held, in which the entire Beethoven's Last Night album, and songs of Night Castle were played. In 2011, for the very first time in the band's history, a European leg was included, with venues predominantly in Germany, but also in Austria, Belgium, England, and Switzerland.[56] Initially, Savatage was announced to reunite at the end of the TSO setlist. However, the plans were scrapped, as the band cited undisclosed personal matters that held Jon Oliva from being available to tour.[57]\n",
         "Their 2012-2013 Fall/Winter tour, sponsored by the Hallmark Channel featured The Lost Christmas Eve album in place of Christmas Eve and Other Stories.[58]\n",
         "In 2013, TSO kicked off their second European tour with a performance on New Year's Eve 2013-14 in front of over 1 million fans at Berlin's Brandenburg Gate.[21] \"A daring feat in which the band played three shows across two continents in 27 hours.\"[59] The show was broadcast live to millions more on German television.[59]\n",
         "In August 2014 the band announced the first half of the winter tour they would feature The Christmas Attic, the only rock opera from the \"Christmas Trilogy\" never performed live up to that point.[60]\n",
         "In August 2019, TSO announced the return of Christmas Eve and Other Stories for the winter tour.[61]\n"
      ]
   },
   "List of touring performers": {
      "text": [
         "Guitarists:\n",
         "Bassists:\n",
         "Keyboardists:\n",
         "Electric Violinists:\n",
         "Drummers:\n",
         "Vocalists:\n",
         "Narrators:\n"
      ]
   },
   "Discography": {},
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Trans-Siberian Orchestra (TSO[5]) is an American rock band founded in 1996 by producer, composer, and lyricist Paul O'Neill, who brought together Jon Oliva and Al Pitrelli (both members of Savatage) and keyboardist and co-producer Robert Kinkel to form the core of the creative team. O'Neill died on April 5, 2017. The band gained in popularity when they began touring in 1999 after completing their second album, The Christmas Attic, the year previous. In 2007, the Washington Post referred to them as \"an arena-rock juggernaut\" and described their music as \"Pink Floyd meets Yes and the Who at Radio City Music Hall.\"[6] TSO has sold more than 10 million concert tickets and over 10 million albums.[5][7] The band has released a series of rock operas: Christmas Eve and Other Stories, The Christmas Attic, Beethoven's Last Night, The Lost Christmas Eve, their two-disc Night Castle and Letters From the Labyrinth.[5] Trans-Siberian Orchestra is also known for their extensive charity work and elaborate concerts, which include a string section, a light show, lasers, moving trusses, video screens, and effects synchronized to music.[3]\n",
      "Both Billboard Magazine and Pollstar have ranked them as one of the top ten ticket-selling bands in the first decade of the new millennium.[8][9] Their path to success was unusual in that, according to O'Neill, TSO is the first major rock band to go straight to theaters and arenas, having never played at a club, never having an opening act and never being an opening act.[10]\n",
      "Paul O'Neill managed and produced rock bands including Aerosmith, Humble Pie, AC/DC, Joan Jett, and Scorpions, later producing and co-writing albums by the progressive metal band Savatage, where he began working with Jon Oliva (who had left Savatage to spend time with his family and take care of personal matters), Al Pitrelli and Robert Kinkel. O'Neill took his first steps into rock music in the 1970s when he started the progressive rock band Slowburn, for whom he was the lyricist and co-composer. What was intended to be the band's debut album was recorded at Jimi Hendrix's Electric Lady Studios and engineered by Dave Wittman. Although Wittman's engineering was capturing the exact sound O'Neill was hearing in his head, O'Neill was having trouble with it because many of his melodies were between two and three octaves. Rather than releasing an album that he was not happy with, he shelved the project, but continued working in the industry at Contemporary Communications Corporation (also known as Leber & Krebs).[citation needed]\n",
      "Over the years, O'Neill continued to work as a writer, producer, manager, and concert promoter. In 1996, he accepted Atlantic Records' offer to start his own band.[11] He built the band on a foundation created by the marriage of classical and rock music and the artists he idolized (Emerson, Lake & Palmer, Queen, Yes, The Who, and Pink Floyd, and hard rock bands such as Aerosmith and Led Zeppelin and the multiple lead vocalists of the R&B groups the Temptations and the Four Tops).[12] He brought in Oliva, Kinkel, and Pitrelli to help start the project. O'Neill has stated, \"My original concept was six rock operas, a trilogy about Christmas and maybe one or two regular albums.\"[13]\n"
   ]
}