{
   "Name": "The Nuns",
   "rawData": [
      "The Nuns was an American rock band in San Francisco and New York City. Best known as one of the founding acts of the early San Francisco punk scene, the band went through a number of hiatuses and periodic reunions, lineup changes, and changes in style. Overall, The Nuns performed and recorded on and off from the mid-1970s into the 2000s. While the band was centered on Jennifer Miro and Jeff Olener through its various incarnations, Alejandro Escovedo, who went on to later success as an Americana and alternative country musician, was also a key member during its years of fame in late 1970s San Francisco.\n",
      "The band formed in 1975 in Marin County, California when Alejandro Escovedo and Jeff Olener, who were film students at College of Marin, wanted to make a low-budget film about a strung-out rock singer and a band that could not play its instruments, and decided to play the part themselves. This project evolved into The Nuns. While the band was in its formative phase, they practiced in a warehouse in Terra Linda. Jennifer Miro, who was in a Mill Valley-based band that covered Doobie Brothers songs, practiced at the same warehouse. Olener soon invited Miro to join his band; Miro, who was unhappy with the band she was in, jumped at the opportunity. The Nuns began performing around various venues in the San Francisco area in January 1976. They were the among the first punk bands in California and had difficulty finding regular venues. They played the first punk show at the Mabuhay Gardens in December 1976, and quickly became regulars. At their peak of popularity, they were playing two sold-out shows on consecutive weekend nights at the Mabuhay.\n",
      "The Nuns original manager was Edwin Heaven. In 1977, Heaven discovered them when they opened at The Mabuhay Gardens for The Ramones. Within half a year, he had created a worldwide buzz for the band, designed most of their now-classic posters and, basically, took them from playing at San Francisco's Fab Mab to playing such larger venues as Bill Graham's Winterland and LA's The Whisky.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, U.S."
      ],
      "Genres": [
         "New wave (Early)",
         "Punk Rock (Early)"
      ],
      "Years active": [
         "1975–1979, 1980, 1986–1994, 1997–2000s"
      ],
      "Labels": [
         "415 Records, Posh Boy Records, MT Records, Triple Silence Records"
      ],
      "Associated acts": [
         "The VIPs, 391, Rank and File"
      ],
      "Past members": [
         "Jennifer Miro",
         "Jeff Olener",
         " Alejandro Escovedo",
         "Delphine Volino",
         "Baron Rubenbauer",
         "Mistress Kris",
         "Mike Varney",
         "Richie Detrick",
         "Pat Ryan",
         "Leslie Q",
         "Jeff Raphael",
         "Scott Marshall",
         "Bret Domrose",
         "Leslie Spring",
         "Walter Atkinson",
         "Alex Havoc",
         "Brian Knott",
         "Michael Saintt George"
      ]
   },
   "albums": [
      "Rockin Rina's Women of 1970s Punk"
   ],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band in [PERSON_NAME_FULL_2_MALE] and New York City. Best known as one of the founding acts of the early [PERSON_NAME_FULL_2_MALE] punk scene, the band went through a number of hiatuses and periodic reunions, lineup changes, and changes in style. Overall, [BAND_NAME] performed and recorded on and off from the mid-[YEAR]s into the [YEAR]s. While the band was centered on Jennifer Miro and [PERSON_NAME_FULL_0_MALE] through its various incarnations, [PERSON_NAME_FULL_1_MALE], who went on to later success as an Americana and alternative country musician, was also a key member during its years of fame in late [YEAR]s [PERSON_NAME_FULL_2_MALE].\n",
      "The band formed in [YEAR] in [MONTH]in County, California when [PERSON_NAME_FULL_1_MALE] and [PERSON_NAME_FULL_0_MALE], who were film students at College of [MONTH]in, wanted to make a [GENRE] a strung-out rock singer and a band that could not play its instruments, and decided to play the part themselves. This project evolved into [BAND_NAME]. While the band was in its formative phase, they practiced in a warehouse in Terra Linda. Jennifer Miro, who was in a Mill Valley-based band that covered Doobie Brothers songs, practiced at the same warehouse. [PERSON_NAME_LAST_0] soon invited Miro to join his band; Miro, who was unhappy with the band she was in, jumped at the opportunity. [BAND_NAME] began performing around various venues in the San Francisco area in [MONTH] [YEAR]. They were the among the first punk bands in California and had difficulty finding regular venues. They played the first punk show at the Mabuhay Gardens in [MONTH] [YEAR], and quickly became regulars. At their peak of popularity, they were playing two sold-out shows on consecutive weekend nights at the Mabuhay.\n",
      "[BAND_NAME] original manager was Edwin Heaven. In [YEAR], Heaven discovered them when they opened at The Mabuhay Gardens for The Ramones. Within half a [GENRE] a worldwide buzz for the band, designed most of their now-classic posters and, basically, took them from playing at San Francisco's Fab Mab to playing such larger venues as [PERSON_NAME_FULL_0_MALE]'s Winterland and LA's The Whisky.\n"
   ]
}