{
   "Critical reception": {
      "text": [
         "CMJ New Music Monthly described Tristeza's style in a review of their album, Dream Signals in Full Circles: \"A typical Tristeza track involves a down-shifted take on emo's rhythmic lopsidedness, beds of washy, behind-the-beat keyboards, and Christopher Sprague's arpeggiated, effect-drenched guitar melodies.\"[4]\n"
      ]
   },
   "Discography": {},
   "Members": {
      "text": [
         "The group formed in San Diego in 1997, and included Christopher Sprague, Luis Hermosillo, Jimmy LaValle (The Album Leaf), James Lehner, and Stephen Swesey. This line-up recorded all material that was released through 2003, including the albums Spine and Sensory (1999) and Dream Signals in Full Circles (2000).  \n",
         "In January 2003, Tristeza played its last concert with Jimmy LaValle as a main member, but he has joined the band occasionally since.\n",
         "During 2004, the band enlisted guitarist Alison Ables and keyboardist Sean Ogilvie to begin writing songs for A Colores (2005). This line-up recorded all material that was released during 2005 and 2006.\n",
         "At the start of 2007, the core of Tristeza (Sprague, Lehner, and Hermosillo) with the assistance of Ogilvie, began collaborating with various musicians around the San Francisco Bay Area, including Camaron Stevens on guitar, and released the Fate Unfolds mini album in 2009.\n"
      ]
   },
   "Production": {
      "text": [
         "In 2010, Tristeza recorded their current album Paisajes with Tim Green, who recorded the band's first album.\n",
         "The Spine and Sensory album was recorded at Tim Green's Louder Studios, a basement studio in San Francisco.\nIt took one week to record and mix the album in the Autumn of 1998. Green has since left San Francisco and moved his studio to Grass Valley, California.[2]\n",
         "Dream Signals in Full Circles was recorded and produced in Chicago by Dave Trumfio at Kingsize Soundlabs during the Spring of 2000.\nThe album was recorded and mixed in 10 days.\n",
         "A Colores was recorded during three winter weeks of 2005 at Key Club Recording in Benton Harbor, Michigan by Bill Skibbe and Jessica Ruffins.\nThe album was mixed during the summer of 2005 by Alan Sanderson in San Diego.\n",
         "Paisajes was recorded and mixed Tim Green's Louder Studios in Grass Valley, California in the Winter and Spring of 2010.[3]\n",
         "Tristeza's many other various EPs, singles, tour CDs, demos, DVD, cassettes, etc. were mainly self-recorded by the band, as well by Matt Anderson, Alan Sanderson, Mike Hammel, and Pall Jenkins.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Members",
      "2 Production",
      "3 Critical reception",
      "4 Discography",
      "5 References"
   ],
   "Summary": {
      "text": [
         "Tristeza is an American post-rock band. The band is currently based in Oakland, California, and was established in San Diego in 1997.[1] The band has performed in 19 countries. \n"
      ]
   },
   "Title": "Tristeza (band) - Wikipedia"
}