{
   "Name": "The Ventures",
   "rawData": [
      "The Ventures are an American instrumental rock band, formed in 1958 in Tacoma, Washington, by Don Wilson and Bob Bogle.  The band, a quartet for most of its existence, helped to popularize the electric guitar in the United States and across the world during the 1960s. While their popularity in the United States waned in the 1970s, the group remains especially revered in Japan, where they tour regularly to this day. The classic lineup of the band consisted of Wilson (rhythm guitar), Bogle (initially lead guitar, switched to bass), Nokie Edwards(initially bass, switched to lead guitar), and Mel Taylor (drums).\n",
      "Their first wide-release single, \"Walk, Don't Run\", brought international fame to the group, and is often cited as one of the top songs ever recorded for guitar.\nIn the 1960s and early 1970s, 38 of the band's albums charted in the US, ranking them as the 6th best album chart performer during the 1960s, and the band had 14 singles in the Billboard Hot 100.\nWith over 100 million records sold, the Ventures are the best-selling instrumental band of all time.\n",
      "The Ventures have had an enduring impact on the development of music worldwide. The band was among the first to employ and popularize fuzz and flanging guitar effects, concept albums, and twelve-string guitars in rock music.  Their instrumental virtuosity, innovation, and unique sound influenced many musicians and bands, earning the group the moniker \"The Band that Launched a Thousand Bands\".\nTheir recording of \"Walk, Don't Run\" was inducted into the Grammy Hall of Fame for its lasting impact,\nand in 2008 the group was inducted into the Rock and Roll Hall of Fame.\n"
   ],
   "infobox": {
      "Also known as": [
         "The Versatones",
         "The New Ventures"
      ],
      "Origin": [
         "Tacoma, Washington, U.S."
      ],
      "Genres": [
         "Instrumental rock, surf rock"
      ],
      "Years active": [
         "1958–present"
      ],
      "Labels": [
         "Dolton, Liberty, United Artists, Capitol, GNP Crescendo, Blue Horizon"
      ],
      "Website": [
         "www.theventures.com"
      ],
      "Members": [
         "Bob Spalding",
         "Leon Taylor",
         "Ian Spalding",
         "Luke Griffin"
      ],
      "Past members": [
         "Nokie Edwards",
         "Don Wilson",
         "Bob Bogle",
         "Gerry McGee",
         "Howie Johnson",
         "Mel Taylor",
         "John Durrill",
         "Joe Barile",
         "Dave Carr",
         "Biff Vincent",
         "Leisha Soukary",
         "Jonell Calendar",
         "George T. Babbitt, Jr.",
         "Paul Warren",
         "JD Hoag",
         "Harvey Wicklund"
      ]
   }
}