{
   "Name": "The Ventures",
   "Sections": [
      "1 History",
      "1.1 Formation and rise to fame",
      "1.2 Classic lineup",
      "1.3 Resurgence and decline in the US",
      "1.4 Later years",
      "1.5 The Ventures today",
      "2 Guitars",
      "3 Legacy",
      "3.1 Special effects",
      "3.2 Influences",
      "4 Discography",
      "4.1 Selected studio albums",
      "5 Band members",
      "6 Timeline",
      "7 See also",
      "8 References",
      "9 Bibliography",
      "10 External links"
   ],
   "Summary": {
      "text": [
         "The Ventures are an American instrumental rock band, formed in 1958 in Tacoma, Washington, by Don Wilson and Bob Bogle.  The band, a quartet for most of its existence, helped to popularize the electric guitar in the United States and across the world during the 1960s.[1] While their popularity in the United States waned in the 1970s, the group remains especially revered in Japan, where they tour regularly to this day.[2] The classic lineup of the band consisted of Wilson (rhythm guitar), Bogle (initially lead guitar, switched to bass), Nokie Edwards[3](initially bass, switched to lead guitar), and Mel Taylor (drums).\n",
         "Their first wide-release single, \"Walk, Don't Run\", brought international fame to the group, and is often cited as one of the top songs ever recorded for guitar.[4][5][6][7]\nIn the 1960s and early 1970s, 38 of the band's albums charted in the US, ranking them as the 6th best album chart performer during the 1960s,[8] and the band had 14 singles in the Billboard Hot 100.[9]\nWith over 100 million records sold,[2] the Ventures are the best-selling instrumental band of all time.[10][1]\n",
         "The Ventures have had an enduring impact on the development of music worldwide. The band was among the first to employ and popularize fuzz and flanging guitar effects, concept albums, and twelve-string guitars in rock music.  Their instrumental virtuosity, innovation, and unique sound influenced many musicians and bands, earning the group the moniker \"The Band that Launched a Thousand Bands\".[11]\nTheir recording of \"Walk, Don't Run\" was inducted into the Grammy Hall of Fame for its lasting impact,[12]\nand in 2008 the group was inducted into the Rock and Roll Hall of Fame.[1]\n"
      ]
   },
   "History": {
      "Formation and rise to fame": {
         "text": [
            "Don Wilson and Bob Bogle first met in 1958, when Bogle was looking to buy a car from a used car dealership in Seattle owned by Wilson's father. Finding a common interest in guitars, the two decided to play together, while Wilson joined Bogle performing masonry work. They bought two used guitars in a pawn shop for about $10 each.[13] Initially calling themselves the Versatones, the duo played small clubs, beer bars, and private parties throughout the Pacific Northwest. Wilson played rhythm guitar, Bogle lead. When they went to register the band name, they found that it was already taken. Disappointed, they cast about for an appropriate name. Wilson's mother suggested the name \"The Ventures\", upon which they eventually agreed in 1959.[14]\n",
            "After watching Nokie Edwards play at a nightclub, they recruited him as bass player. Bogle owned a Chet Atkins LP, Hi-Fi in Focus, on which he heard the song \"Walk, Don't Run\".[15] Soon, the group was in a recording studio playing the new song, with Bogle on lead, Wilson on rhythm, Edwards on bass, and Skip Moore on drums. They pressed a number of 45s, which they distributed to several record companies. Later, Skip Moore opted out of the group to work at his family's gas station. When \"Walk, Don't Run\" was recorded, he also opted out of the royalties from the recording, taking $25 for the session instead. He later sued to collect royalties but failed because of his prior opt-out. \"Walk, Don't Run\" sold over one million copies, and was awarded a gold disc by the RIAA.[16]\n",
            "Needing a permanent drummer for the group after George T. Babbitt, Jr. dropped out because he was not old enough to play night clubs and bars, they hired Howie Johnson and, in the midst of a fast-paced touring schedule, recorded an album to capitalize on the success of the single. (Babbitt went on to become a 4-star general in the United States Air Force (USAF) and on March 1, 1998, he played live in uniform on drums with the band.)[17] The lineup of Bogle, Wilson, Edwards and Johnson remained intact until 1962.[15] The group found early success with a string of singles, but quickly became leaders in the album market. The Ventures were among the pioneers of concept albums (starting with 1961's The Colorful Ventures) where each song on several of their albums was chosen to fit a specific theme. Some of the Ventures' most popular albums at the time were a series of records of dance music. In the early 1960s \"golden age of hi-fi\", with the novelty of stereo still in its experimental stages, the Ventures found their characteristic style of recording each instrument in either the extreme left or right channel, with little (if any) cross-over, enhancing the stereo effect to its fullest limits.\n",
            "In 1961, Edwards, a talented guitarist in his own right, suggested that Bogle's lead guitar abilities were being stretched, and that they were in essence wasting Edwards' talents by keeping him on bass. Bogle agreed, and rapidly learned the bass parts to all their tunes, allowing Edwards to take lead guitar full-time, although he had played lead previously on several tracks on their first studio sessions/albums. This move would prove vital in modernizing the band's sound, ensuring success in an ever-changing market well into the late 1960s.\n"
         ]
      },
      "Classic lineup": {
         "text": [
            "In the fall of 1957, Johnson had been injured in an auto crash, which caused irreversible spinal damage.[15] This forced him to play with a neckbrace at first.  However, he was able to play without it shortly after joining the group.  Johnson played on the first four LPs and recorded on about half of the tracks on the fifth LP (Twist with the Ventures/Dance!) and about half of their sixth LP (Twist With The Ventures Vol. 2/Beach Party). He did not like spending so much time away from his new family (his second marriage) by having to commute from Seattle to Los Angeles to record, and because of this, he left the band.[15] Johnson continued to play locally in the Washington area with local groups until his death on May 5, 1988, at age 54.\n",
            "At the time Johnson quit the Ventures, Bogle and Wilson already knew Mel Taylor, house drummer at The Palomino in North Hollywood (the venue where they would play numerous shows during their resurgence in the 1980s). Taylor was known for a hard-hitting style of drumming. The group invited him to some recording sessions, which led Taylor to become a permanent member of the Ventures.[15]\n"
         ]
      },
      "Resurgence and decline in the US": {
         "text": [
            "The combination of Edwards on lead guitar, Taylor on drums, Bogle on bass and Wilson on rhythm guitar remained unchanged until Edwards left the band in 1968, to be replaced by Gerry McGee (born Gerald James McGee in Eunice, Louisiana; November 17, 1937 – October 12, 2019),[18] son of the famous Cajun fiddle player Dennis McGee.[15] Edwards came back in 1973 and remained with them until 1984, although he has toured and gigged with them dozens of times in the subsequent years. Edwards' replacement in 1984 was, once again, Gerry McGee. Mel Taylor left in 1972 (and was replaced by drummer Joe Barile)[15] to pursue a solo career when the Ventures became a nostalgia act. His intentions were to concentrate on new material and the progressive side of music. He returned in 1979 and stayed with the Ventures until his death from cancer in 1996. When Mel Taylor got sick he was replaced by his son, Leon Taylor. (Original drummer Howie Johnson had died in 1988; Skip Moore, the drummer on \"Walk, Don't Run\" is also deceased.)\n"
         ]
      },
      "Later years": {
         "text": [
            "Their commercial fortunes in the US declined sharply in the early 1970s due to changing musical trends. In the late 1970s and into the 1980s, a resurgence of interest in surf music led to some in the punk/new wave audience rediscovering the band. The Go-Go's wrote \"Surfin' And Spyin'\" and dedicated it to the Ventures. The Ventures recorded their own version and continue occasionally to perform the song. Their career again rejuvenated by Quentin Tarantino's use of the Lively Ones' version of Nokie Edwards' \"Surf Rider\" and several other classic surf songs in the soundtrack of the hit movie Pulp Fiction. The Ventures became one of the most popular groups worldwide thanks in large part to their instrumental approach—there were no language barriers to overcome. The Ventures are still the most popular American rock group in Japan, the world's second largest record market. One oft-quoted statistic is that the Ventures outsold the Beatles 2-to-1 in Japan.[2] They produced dozens of albums exclusively for the Japanese and European markets, and have regularly toured Japan from the 1960s through to the present. According to a January 1966 Billboard Magazine article, the Ventures had five of 1965's top 10 singles in Japan.\n"
         ]
      },
      "The Ventures today": {
         "text": [
            "On March 10, 2008, the Ventures were inducted into the Rock and Roll Hall of Fame with John Fogerty as their presenter. In attendance were original members Don Wilson and Nokie Edwards, late 1960s member John Durrill, current guitarist Bob Spalding, and current drummer Leon Taylor, son of Mel Taylor who, along with Mel Taylor's widow, Fiona, accepted on behalf of the Ventures' late drummer. Bob Bogle and Gerry McGee were unable to attend the ceremony. Fiona Taylor gave special mention to her husband's predecessor drummers Skip Moore and Howie Johnson. The Ventures performed their biggest hits, \"Walk, Don't Run\" and \"Hawaii Five-O\", augmented on the latter by Rock and Roll Hall Of Fame musical director Paul Shaffer and his band.\n",
            "Bob Bogle lived in Vancouver, Washington, for years and died there on June 14, 2009, of non-Hodgkin lymphoma; he was 75.[19]\n",
            "Nokie Edwards died on March 12, 2018, due to complications after hip surgery. He was 82.[20]\n",
            "Gerry McGee died on October 12, 2019, after collapsing onstage four days earlier in Japan. He was 81.[18][21]\n",
            "Don Wilson continues to record with the band, but retired from touring at the end of 2015. With Nokie Edwards' death in 2018, Wilson is now the lone surviving member of the original group.\n"
         ]
      }
   },
   "Guitars": {
      "text": [
         "During their first years (1958–1961), the Ventures played Fender guitars (a Jazzmaster, a Stratocaster and a Precision Bass) for both their live performances and their recording sessions. These instruments are prominently visible on the covers of two early albums: The Ventures and The Colorful Ventures. From 1962 to 1963 they used two Jazzmasters with a Precision Bass, shown on the album cover of \"Bobby Vee meets The Ventures\". Then in early 1963, California guitar manufacturer Mosrite re-branded their uniquely styled, futuristic-looking Mark 1 electric guitar model for the Ventures by applying decals that stated \"The Ventures Model\" on the headstock. The band adopted these guitars (which included a bass model) and first used them on The Ventures in Space (1963), one of their most influential albums because of the unique, otherworldly guitar sounds it contained. From 1963 through 1968, a statement on their album covers announced that the Ventures used Mosrite guitars \"exclusively\" (the Ventures and designer Semie Moseley were partners in the distribution of these instruments). After the expiration of their contract with Moseley, the Ventures returned to playing mainly Fender guitars. Only rarely have they used Mosrite guitars since that contract ended.\n",
         "In the mid-1990s, Fender issued a limited edition Ventures Signature Series of guitars consisting of a Jazzmaster, a Stratocaster, and a Fender Jazz Bass, all with specifications determined by the band.\n",
         "Aria Guitars and Wilson Brothers Guitars have subsequently issued Ventures Signature Model instruments. The Wilson Brothers guitar, in particular, is closely modeled physically on the original Mosrite design.\n"
      ]
   },
   "Legacy": {
      "Special effects": {
         "text": [
            "The Ventures pioneered the use of special effects on such songs as \"The 2000 Pound Bee\", recorded in late 1962, in which lead guitarist Nokie Edwards employed a fuzz pedal. Edwards' use of \"fuzz tone\" predated the \"King of Fuzz Guitar\", Davie Allan of The Arrows, by at least three years. In addition, Edwards was among the first to use the twelve-string guitar in rock. The 1964 The Ventures In Space album was a primer in the use of special guitar effects, and made pioneering use of 'reverse-tracking'. The Ventures In Space, because of its ethereal space-like effects, was deemed an influence on the later 1960s San Francisco psychedelic generation, as well as being cited as a favorite by Keith Moon of the Who.[26]\n",
            "The band's cover of the Tornados' \"Telstar\" (released in January 1963) featured one of the first instances of flanging on a pop record. The song \"Silver Bells\" on The Ventures' Christmas Album, released in November 1965, has one of the first recorded uses of a talk box as a musical effect, voiced by Red Rhodes.[27] Rhodes was responsible for devising many of the effects seen on Ventures records, and was the inventor of the fuzzbox.[citation needed]\n"
         ]
      },
      "Influences": {
         "text": [
            "The Ventures have had an influence on many musicians, both professional and amateur.[28][29][30] Their instructional album, Play Guitar with the Ventures, was the first such record to chart on the Billboard Top LPs list, peaking at No. 96, and taught thousands of budding guitarists how to play the guitar. George Harrison stated in a Guitar Player interview that he preferred the American guitar sound of the Ventures to British contemporaries. When asked to name the most influential rock guitar solos, Joe Walsh said he would have to include the entire song \"Walk, Don't Run\" because it changed so many guitar players' lives. John Fogerty, during his introduction of the Ventures at their Hall of Fame induction, said that it \"kicked open a whole movement in rock and roll... The sound of it became 'surf music' and the audacity of it empowered guitarists everywhere.\" Stephen Stills told Ventures guitarist Don Wilson that he learned to play on Ventures records. Jeff Baxter[31][32] and Gene Simmons were early members of the Ventures Fan Club.[33] Carl Wilson called the Ventures a major influence on his early guitar playing, stating that the Beach Boys had learned to play all of their songs by ear.[34]\n"
         ]
      },
      "text": [
         "The Ventures enjoyed their greatest popularity and success in the US and Japan in the 1960s, but they continue to perform and record. With over 110 million albums sold worldwide, the group remains the best selling instrumental rock group of all time. Thirty-eight Ventures albums (including a seasonal Christmas album) charted in the US, and six of fourteen chart singles made it into the Top 40, with three making it into the Top 10. Of their 38 chart albums, 34 of them occurred in the 1960s, and the Ventures rank as the 6th best pop album performer for that decade, according to \"Joel Whitburn's Top Pop Albums\".\n",
         "Among their achievements in America, in 1963 the Ventures had five LPs in the Billboard Top 100 of the albums chart at the same time. Additionally, they released a series of instructional LPs entitled Play Guitar with the Ventures and Play Electric Bass with the Ventures. Four LPs were released in this series, the first of which reached the Billboard Top 100 Album Chart—an achievement previously unheard of for an instructional LP. In a novelty achievement, the Ventures were the first act to place two different versions of the same song in the Top 10, those being \"Walk, Don't Run\" (#2) and \"Walk, Don't Run '64\" (#8).\n",
         "The Ventures were among the first rock acts able to sell albums based on a style and sound without needing hit singles on the albums. These albums are also some of the earliest examples of the concept album in rock music. Many of the Ventures' albums, starting with Colorful Ventures in 1961, were organized according to a central theme.[22]\n",
         "While they predated the advent of the terms surf guitar and surf rock, and they do not consider themselves a surf rock group, they were a major building block of surf music, if not the first to play the style. Guitar Player, in an article titled \"20 Essential Rock Albums\", cited elements of their 1960 Walk, Don't Run album which presaged the coming surf trend.\n",
         "The theme music of the television show Hawaii Five-O continues to be popular.[23] The tune was composed by Morton Stevens, who also composed numerous episode scores. The theme was recorded by the Ventures, whose version reached No. 4 on the Billboard Hot 100 pop chart.[24] Because of the tempo of the music, the theme gained popularity in the UK with followers of Northern soul and was popular on dance floors in the 1970s.[25]\n",
         "The Encyclopædia Britannica states that the Ventures \"served as a prototype for guitar-based rock groups.\"\n"
      ]
   },
   "Discography": {
      "Selected studio albums": {}
   },
   "Band members": {},
   "Timeline": {},
   "See also": {},
   "References": {},
   "Bibliography": {},
   "External links": {},
   "coreData": [
      "The Ventures are an American instrumental rock band, formed in 1958 in Tacoma, Washington, by Don Wilson and Bob Bogle.  The band, a quartet for most of its existence, helped to popularize the electric guitar in the United States and across the world during the 1960s.[1] While their popularity in the United States waned in the 1970s, the group remains especially revered in Japan, where they tour regularly to this day.[2] The classic lineup of the band consisted of Wilson (rhythm guitar), Bogle (initially lead guitar, switched to bass), Nokie Edwards[3](initially bass, switched to lead guitar), and Mel Taylor (drums).\n",
      "Their first wide-release single, \"Walk, Don't Run\", brought international fame to the group, and is often cited as one of the top songs ever recorded for guitar.[4][5][6][7]\nIn the 1960s and early 1970s, 38 of the band's albums charted in the US, ranking them as the 6th best album chart performer during the 1960s,[8] and the band had 14 singles in the Billboard Hot 100.[9]\nWith over 100 million records sold,[2] the Ventures are the best-selling instrumental band of all time.[10][1]\n",
      "The Ventures have had an enduring impact on the development of music worldwide. The band was among the first to employ and popularize fuzz and flanging guitar effects, concept albums, and twelve-string guitars in rock music.  Their instrumental virtuosity, innovation, and unique sound influenced many musicians and bands, earning the group the moniker \"The Band that Launched a Thousand Bands\".[11]\nTheir recording of \"Walk, Don't Run\" was inducted into the Grammy Hall of Fame for its lasting impact,[12]\nand in 2008 the group was inducted into the Rock and Roll Hall of Fame.[1]\n",
      "Don Wilson and Bob Bogle first met in 1958, when Bogle was looking to buy a car from a used car dealership in Seattle owned by Wilson's father. Finding a common interest in guitars, the two decided to play together, while Wilson joined Bogle performing masonry work. They bought two used guitars in a pawn shop for about $10 each.[13] Initially calling themselves the Versatones, the duo played small clubs, beer bars, and private parties throughout the Pacific Northwest. Wilson played rhythm guitar, Bogle lead. When they went to register the band name, they found that it was already taken. Disappointed, they cast about for an appropriate name. Wilson's mother suggested the name \"The Ventures\", upon which they eventually agreed in 1959.[14]\n"
   ],
   "infobox": {
      "Also known as": [
         "The Versatones",
         "The New Ventures"
      ],
      "Origin": [
         "Tacoma, Washington, U.S."
      ],
      "Genres": [
         "Instrumental rock, surf rock"
      ],
      "Years active": [
         "1958–present"
      ],
      "Labels": [
         "Dolton, Liberty, United Artists, Capitol, GNP Crescendo, Blue Horizon"
      ],
      "Website": [
         "www.theventures.com"
      ],
      "Members": [
         "Bob Spalding",
         "Leon Taylor",
         "Ian Spalding",
         "Luke Griffin"
      ],
      "Past members": [
         "Nokie Edwards",
         "Don Wilson",
         "Bob Bogle",
         "Gerry McGee",
         "Howie Johnson",
         "Mel Taylor",
         "John Durrill",
         "Joe Barile",
         "Dave Carr",
         "Biff Vincent",
         "Leisha Soukary",
         "Jonell Calendar",
         "George T. Babbitt, Jr.",
         "Paul Warren",
         "JD Hoag",
         "Harvey Wicklund"
      ]
   }
}