{
   "Discography": {
      "text": [
         "Studio albums\n",
         "EPs\n",
         "Live albums\n",
         "Compilation albums\n",
         "Unreleased\n",
         "Singles\n"
      ]
   },
   "External links": {},
   "History": {
      "text": [
         "In fall of 2002, Windsor Airlift was formed in Owatonna, Minnesota as a punk-pop band. On April 25, 2003, they released The Basement EP,[1] as well as played their very first show.[2] Between the release of The Basement EP and mid-2003, they played at several shows including Sunshine Festival, Bethel Church, and Ironwood Springs.\n",
         "After playing at Steele County's Battle of the Bands in mid-2003,[3] the band made a major change in genre direction. Abandoning nearly every aspect of pop/punk, they began writing music influenced by Unwed Sailor, and quickly released Selections for a Fallen Soldier. During late 2003, the band began work on Selections for a Fallen Soldier, Vol. II, while performing at events on the weekends. Selections for a Fallen Soldier, Vol. II, was released in early 2004, one year after the band's change in genre direction.\n",
         "They entered into the Club 3 Degrees band tournament in late 2004, playing music deemed math rock.[4] After making the third round, the band decided that it was in their best interest to remove themselves from the tournament. During this time period, the band also began creating short films to be played with their songs on old televisions at their concerts.[5]\n",
         "In the early 2005, the band released a four-song EP, Hotels.[6] Along with the release of the EP, they released two albums, Moonfish Parachutist and Qiu!. Both albums were recorded entirely in Young's basement. Throughout 2005 and 2006, they continued to play at shows and write music with an additional member, and long-time friend to the group, Michael DeMars.[7][8] In late 2006, the band released Ocean City Park.[9]\n",
         "In 2007, Young and Andy played several Windsor Airlift shows with each one consisting of new music. During this time, they played twice with Unwed Sailor, at The Vaudeville Mews in Des Moines, Iowa.[10]\n",
         "Over the next several months, the band went over a lull while Young's musical project Owl City was beginning to gain popularity. During this time, Young and Andy collaborated on a project via the Internet, and released the album Beneath The Crystal Waves.[11]\n",
         "In 2009, the group reunited to record the album We Rule!, two nights before Andy's wedding.  Due to his busy career as Owl City, We Rule! was also Adam Young's last release with the group at the present time.\n",
         "In October 2010, Windsor Airlift released the album Flight.[12][13]  Some unreleased recording bits the band did before Adam Young's departure were merged into the album as well.[14]  Around the same time of the album's release, the group decided to release a compilation album that contained the EPs, Ocean City Park and Beneath The Crystal Waves.[15]\n",
         "On December 22, 2011, Windsor Airlift started an album art contest for an upcoming album entitled The Meadow.[16][17] On March 9, 2011, the group released a demo from the album on their Myspace page. On January 20, 2012, Windsor Airlift released The Meadow.[18][19]  A few days after the release, Tony Johnson published a pair of posts via Windsor Airlift's Tumblr blog that shed light on inspiration for The Meadow.[20][21]\n",
         "On April 28, 2012, Windsor Airlift returned to its origin home of Owatonna, Minnesota for a homecoming concert of sorts.[22]  Former touring member, Michael DeMars joined them on the stage for the concert.[23]\n",
         "Two days later, Windsor Airlift played a show with Carinthia and Swimming With Dolphins at the Varsity Theater in Minneapolis, Minnesota in the neighborhood of Dinkytown.  Shortly after, on May 25, the band released their album Live at the Varsity Theater, which was recorded during the concert.[24][25]\n"
      ]
   },
   "Members": {
      "text": [
         "Current members\n",
         "Former members\n",
         "Touring musicians\n"
      ]
   },
   "Musical style and influence": {
      "text": [
         "Windsor Airlift brings a mixture of guitar, bass, piano, electronic keyboard, synthesizers, and drums. Since the band is instrumentally-based, they have no vocals (though some of their songs do have snippets from movies or famous speeches[44]). This has given the band their signature, as they play with their backs turned to the audience in an attempt to take the attention off themselves and onto the music.[45][46][47][48]\n",
         "When Windsor Airlift first started and was originally a punk-pop band, they were influenced by Christian bands such as Relient K, Philmore, and Ace Troubleshooter.[49]  The band's current ambient post-rock musical style is heavily drawn off Unwed Sailor.\n",
         "The group is also influenced by their Christian faith and worldview.[50]  An example of this is the song \"Owl\" (which features some audio snippets from the film Cast Away) off their 2005 EP, Hotels.[51]\n",
         "Tony Johnson stated in a Windsor Airlift documentary that in the early years, when the band need inspiration, they used to smash things.[52]  This, in turn, explains the multiple YouTube videos the band has posted of them throwing and wrecking old television sets and speakers.[53][54][55][56]\n"
      ]
   },
   "Other projects": {
      "text": [
         "In 2004, Andy Johnson, Tony Johnson, and Adam Young created an electronic project called The Atlantic.[57][58]  They released a few songs before the band went dormant for a number of years.\n",
         "In 2010, Andy and Tony Johnson resurrected and reformed the project under the name Glacier Island.[59][60][61]  Since then, the group has released two studio albums entitled From Pelican Shores (2010)[62][63] and The Campfire Lullabies (2012).[64][65][66]  Both albums were released on August 16, exactly two years apart.[67]\n",
         "Glacier Island's song \"Boat\" (off From Pelican Shores) echos back to the track \"Boat\" from Windsor Airlift's first release, The Basement EP, with a totally different sound and genre.[68][69]\n",
         "On May 2, 2013, an official music video for the song \"Nostalgia\" (off The Campfire Lullabies) was released via YouTube.[70]\n",
         "On May 10, 2013, Glacier Island played a show at Wooly's in Des Moines, Iowa. For this show, vocals were performed by Andy Johnson. Live footage from the show was published to YouTube by Johnson over the next few days.[71][72][73][74]\n",
         "In mid-2018, Glacier Island released a single entitled \"Arrows\" to their SoundCloud.[75]\n",
         "In 2006, Andy Johnson and Tony Johnson created a side project entitled The Perfect Theory.[76]  A good deal of the songs produced, centered around Waldorf College, the school that Andy and Anthony Johnson attended.[77]  Adam Young was featured in the project's songs \"Prom Night\" and \"Without You Baby\".  The project ran until 2009.\n",
         "In 2007, Andy Johnson, Tony Johnson, and Adam Young created the ambient instrumental project, Dolphin Park.[78]  The project released four songs which were later converted and re-recorded into Windsor Airlift's 2008 EP, Beneath The Crystal Waves.  Windsor Airlift's recurring single, \"The Theme for Moonglow\", also originated from the project.\n",
         "Andy Johnson, Tony Johnson, and Adam Young also did many more side projects throughout 2005 to 2007.\n",
         "In 2007, Andy and Tony Johnson created a minor one-song project entitled Casey's Pizza.[79]  The project's genre was intentionally bad rap.\n",
         "In early 2012, Andy Johnson released a solo worship album entitled Love Songs.[80][81]\n",
         "In late 2012, Andy Johnson created the project entitled Lantern Music.[82][83]  The goal of the project is to make Bible memorization easier and more fun for children.\n",
         "From time to time, Andy Johnson will do a cover of an Owl City song.[84][85]\n"
      ]
   },
   "Present": {
      "text": [
         "On May 30, 2013 the group made a YouTube video revealing  that they were working on a new album titled: Moonfish Parachutist 2.[26] The video is a music video for a song on the album called Silhouette Harbor.  The album is still in production and the song was later put on the album Music instead.\n",
         "In September 2013, Windsor Airlift revealed that they were raising money to create physical CD formats of their new album: Music. They also had an album artwork contest (as with their previous release The Meadow).[27][28] The album was released on September 34, 2013.[29][30]  Windsor Airlift announced the next day that Music was number #84 on the iTunes electronic charts.[31]  On October 13, the Johnson brothers did an interview with Flux9.com about the release and Windsor Airlift in general.[32]\n",
         "Around the time of the release of Music, on September 22, Windsor Airlift also released a three-song EP entitled The Forest Sings to Distant Shores.[33]\n",
         "On December 31, 2013, the band released a single entitled \"December\".[34][35]  The track, as of March 31, 2014 is available for free for a limited time only.[36]\n",
         "On April 6, 2014, the band released a small snippet to a track they were working on, via Instagram.[37]  A little over a week later, the band announced the song was entitled \"Beginnings\".[38]\n",
         "On August 10, 2014, Windsor Airlift re-released their debut album Moonfish Parachutist to the public for free download via DropBox.[39]\n",
         "On August 30, 2014, Windsor Airlift performed a show at the Vaudeville Mews in Des Moines, Iowa alongside Unwed Sailor.[40]  Once again, former member Michael DeMars joined the band on guitar for the performance.  The band uploaded a piece live footage from the performance on September 2, 2014.[41]\n",
         "On December 3, 2014, the band released a five-song Christmas EP entitled Music for Christmas.[42]\n",
         "On April 15, 2015, Windsor Airlift released a two-song EP, From the Archives.[43]\n",
         "On March 14, 2016, Windsor Airlift released The Moon's House.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Present",
      "3 Members",
      "4 Musical style and influence",
      "5 Discography",
      "6 Other projects",
      "7 References",
      "8 External links"
   ],
   "Summary": {
      "text": [
         "Windsor Airlift is an American ambient post-rock band formed by brothers Andy Johnson and Tony Johnson, and Adam Young (of Owl City fame). The band, to date, has released six studio albums, eight extended plays, one live album, and multiple singles.\n",
         "\"We are an instrumental post rock band. We love Jesus Christ. We love music. We love you.\" - Windsor Airlift"
      ]
   },
   "Title": "Windsor Airlift - Wikipedia"
}