{
   "Name": "Windsor Airlift",
   "rawData": [
      "Windsor Airlift is an American ambient post-rock band formed by brothers Andy Johnson and Tony Johnson, and Adam Young (of Owl City fame). The band, to date, has released six studio albums, eight extended plays, one live album, and multiple singles.\n",
      "\"We are an instrumental post rock band. We love Jesus Christ. We love music. We love you.\" - Windsor Airlift",
      "In fall of 2002, Windsor Airlift was formed in Owatonna, Minnesota as a punk-pop band. On April 25, 2003, they released The Basement EP, as well as played their very first show. Between the release of The Basement EP and mid-2003, they played at several shows including Sunshine Festival, Bethel Church, and Ironwood Springs.\n"
   ],
   "infobox": {
      "Origin": [
         "Owatonna, Minnesota, United States"
      ],
      "Genres": [
         "Ambient",
         "post-rock",
         "instrumental rock",
         "pop punk (early)"
      ],
      "Years active": [
         "2002–present"
      ],
      "Associated acts": [
         "Glacier Island",
         "The Perfect Theory",
         "Dolphin Park",
         "Owl City",
         "Unwed Sailor",
         "Swimming With Dolphins",
         "Carinthia"
      ],
      "Members": [
         "Andy Johnson",
         "Tony Johnson"
      ],
      "Past members": [
         "Adam Young",
         "Michael DeMars"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed by brothers Andy [PERSON_NAME_LAST_0] and [PERSON_NAME_FULL_0_MALE], and Adam Young (of Owl City fame). The band, to date, has released six studio albums, eight extended plays, one live album, and multiple singles.\n",
      "\"We are an [GENRE] band. We love Jesus Christ. We love music. We love you.\" - [BAND_NAME]",
      "In fall of [YEAR], [BAND_NAME] was formed in Owatonna, Minnesota as a [GENRE] band. On [MONTH] 25, [YEAR], they released The Basement EP, as well as played their very first show. Between the release of The Basement EP and mid-[YEAR], they played at several shows including Sunshine Festival, Bethel Church, and Ironwood Springs.\n"
   ]
}