{
   "Discography": {
      "Compilations": {
         "text": [
            "The Birth of Sol Music (The Demo Tapes)(1986 demos released in 2009)\n"
         ]
      },
      "DVD recordings": {
         "text": [
            "Live at W2\nDen Bosch. Netherlands. DVD + rock formations. (CD + DVD release)\nW2 Concertzaal\nJune 17, 2005\n"
         ]
      },
      "Studio recordings": {
         "Historical Graffiti (2016)": {},
         "Hotel Wrecking City Traders & Gary Arce LP - 2011": {},
         "Macedonian Lines (2019)": {},
         "Nomadic Pursuits - 2010": {},
         "Pot Head EP - 2005": {},
         "Rock Formations LP - 2005": {},
         "The Revolt Against Tired Noises (2018)": {},
         "Vista Point LP - 2007": {
            "text": [
               "(Combines Rock Formations and Pot Head into one release)\n"
            ]
         },
         "WaterWays / Sons of Alpha Centauri / Hotel Wrecking City Traders - 2012": {},
         "Yawning Man & Fatso Jetson – Split (2013)": {},
         "Yawning Sons - Ceremony to the Sunset - 2009": {},
         "Yawning Sons / WaterWays 7\" Split - 2010": {}
      }
   },
   "External links": {},
   "History": {
      "text": [
         "Yawning Man was formed in 1986, founded by members Gary Arce, Alfredo Hernández, Mario Lalli, and Larry Lalli. At this time, the band started to play marathon jams[clarification needed] during sets performed in the only readily available venues at the time: garages around town and impromptu concerts staged in the nearby desert. As word spread of these parties they evolved into what were called \"generator parties\" which were informal concerts held deep in the uninhabited desert outskirts of the cities in the Coachella valley, gradually attracting larger and larger crowds to their shows.\n",
         "\nTheir music heavily influenced the likes of John Garcia, Josh Homme, and Brant Bjork (who would later form the stoner rock band Kyuss) to name only a few. When Hernandez played in Kyuss on their last album ...And the Circus Leaves Town (1995) they recorded a cover of Yawning Man's song \"Catamaran\".",
         "Yawning Man was the sickest desert band of all time. You’d just be up there in the desert, everybody’d just be hanging, partying. And they’d show up in their van and just, mellow, drag out their shit and set up right about the time the sun was goin’ down, set up the generators, sometimes they’d just go up there and drink beers and barbecue. Sometimes it would be a scene; sometimes it would be very intimate. It was very casual and loose and everybody would like, while they’re playing, everyone would just lounge around. They were kinda like a house band. It wasn’t militant like Black Flag. It was very drugged, very stone-y, it was very mystical. Everyone’s just tripping, and they’re just playing away, for hours. Oh, they’re the GREATEST band I’ve ever seen.",
         "From 1986 to 1987, 30 to 40 songs were recorded on 2 different demos but no official Yawning Man material was ever released until 2005. Yawning Man's music began to mutate into strange loops with an almost dark/free-form jazz punk sound, and the name of the band just didn't fit the music anymore. The band changed name to The Sort of Quartet and in the mid '90s released three albums with SST Records and one with German label Hot Wax Crippled Dick. During this time, the Lalli cousins also achieved recognition with their band Fatso Jetson, which briefly included Arce.\n",
         "In 2005, Yawning Man's first LP Rock Formations was released on the Spanish label Alone Records. It is a collection of 10 tracks recorded in late 2004 and described as \"a melancholic mix of acoustic space rock with elements of surf music, as well as middle eastern guitar style\". Months later, Pot Head, a four-track EP, would be released. In 2006, Rock Formations was re-released with a limited edition bonus DVD recorded at W2 club in Den Bosch, Netherlands on June 17, 2005, during their European tour.\n",
         "In 2007, Yawning Man was to release a collection of past material on a double CD known as The Birth of Sol Music. It was to be a collection of 30 older songs from the late '80s with an extensive booklet including information about the band and the whole Palm Desert connection. According to band member Gary Arce, this release has been postponed indefinitely.[citation needed] In 2009, The Birth of Sol Music (The Demo Tapes) was released on iTunes as a two-disc set containing 24 songs.[citation needed]\n",
         "In 2007, an LP called Vista Point, a combination of the Rock Formations and Pot Head releases, was released.[2] In 2009, members of Yawning Man collaborated with British band Sons of Alpha Centauri to release the album Ceremony to the Sunset under the band name Yawning Sons. The album was well received by music critics, with Echoes and Dust labelling it a \"classic\".[3] In 2014, members of Sons of Alpha Centauri stated that a follow-up to the album would be considered once they released their own second album.[4]\n",
         "In 2010, Yawning Man released their second studio album Nomadic Pursuits under the imprint of Cobraside Records.[5] Its cover art was composed and delivered by Hernández.[6] Following the release of the album, the band embarked on a tour across Europe with Bill Stinson and Billy Cordell replacing Hernández and Mario Lalli as touring members respectively. The Nomadic Pursuits tour concluded with a headline show at the DesertFest in London and Berlin in April 2013 with Yawning Sons and Fatso Jetson. The band then self-released a dedicated tour vinyl with Fatso Jetson.[7]\n",
         "In August 2014, Yawning Man returned to Europe with Arce, Mario Lalli and Stinson for a tour that ran from August 29 to September 7, after which they undertook the Legends of the Desert Tour with Fatso Jetson from February 2 to 28, 2015.[8]\n",
         "In 2016, Yawning Man released their third studio album Historical Graffiti, which marked the first studio recordings to feature Stinson on drums. The album also featured Adolfo Trepiana in bandoneon, Sara Ryan in violin and Malene Arce in mellotron and it was recorded by Leonardo Checchia at Ion Studios in Buenos Aires, Argentina while the band were on tour. The first vinyl pressings were released by Lay Bare Records and later re-released by Cobraside Records.[9] In 2017, Yawning Man went on their first ever tour of the United States and Canada to support the album's release.[10]\n",
         "In 2018, Yawning Man released their fourth studio album The Revolt Against Tired Noises. The album was recorded at Gatos Trail Studio in Joshua Tree, CA and produced and engineered by friend and long time collaborator, Mathias Schneeberger (Mark Lanegan, Greg Duli, SUNN O))), Earth, The Obsessed). Six of the eight songs are in the instrumental tradition the band is mostly known for, however two tracks feature the rare appearance of a vocalist[11] (bassist Mario Lalli) alongside Gary Arce’s dream weaving guitar work and Bill Stinson's drums. One of these tracks of notable mention is the song “Catamaran”, a Yawning Man song made popular by the legendary influential desert rock band Kyuss on the 1995 Elektra release “And the Circus Leaves Town”. The Kyuss cover of Catamaran proved to be a favorite among Kyuss fans, spreading the word about Yawning Man’s unique rock music. On The Revolt Against Tired Noises, Yawning Man finally released this classic song, properly recorded for the first time in 30 years.[12]\n"
      ]
   },
   "Members": {},
   "References": {},
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "3.1 Studio recordings",
      "3.1.1 Rock Formations LP - 2005",
      "3.1.2 Pot Head EP - 2005",
      "3.1.3 Vista Point LP - 2007",
      "3.1.4 Yawning Sons - Ceremony to the Sunset - 2009",
      "3.1.5 Nomadic Pursuits - 2010",
      "3.1.6 Yawning Sons / WaterWays 7\" Split - 2010",
      "3.1.7 Hotel Wrecking City Traders & Gary Arce LP - 2011",
      "3.1.8 WaterWays / Sons of Alpha Centauri / Hotel Wrecking City Traders - 2012",
      "3.1.9 Yawning Man & Fatso Jetson – Split (2013)",
      "3.1.10 Historical Graffiti (2016)",
      "3.1.11 The Revolt Against Tired Noises (2018)",
      "3.1.12 Macedonian Lines (2019)",
      "3.2 Compilations",
      "3.3 DVD recordings",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Yawning Man is an American experimental rock band from La Quinta, California, United States. The band originally formed in 1986, although they released no studio recordings until 2005. They have been noted to be one of the first influential bands in the desert rock scene.\n"
      ]
   },
   "Title": "Yawning Man - Wikipedia"
}