{
   "Name": "Yawning Man",
   "rawData": [
      "Yawning Man is an American experimental rock band from La Quinta, California, United States. The band originally formed in 1986, although they released no studio recordings until 2005. They have been noted to be one of the first influential bands in the desert rock scene.\n",
      "Yawning Man was formed in 1986, founded by members Gary Arce, Alfredo Hernández, Mario Lalli, and Larry Lalli. At this time, the band started to play marathon jams during sets performed in the only readily available venues at the time: garages around town and impromptu concerts staged in the nearby desert. As word spread of these parties they evolved into what were called \"generator parties\" which were informal concerts held deep in the uninhabited desert outskirts of the cities in the Coachella valley, gradually attracting larger and larger crowds to their shows.\n",
      "\nTheir music heavily influenced the likes of John Garcia, Josh Homme, and Brant Bjork (who would later form the stoner rock band Kyuss) to name only a few. When Hernandez played in Kyuss on their last album ...And the Circus Leaves Town (1995) they recorded a cover of Yawning Man's song \"Catamaran\"."
   ],
   "infobox": {
      "Origin": [
         "La Quinta, California, United States"
      ],
      "Genres": [
         "Stoner rock, desert rock, psychedelic rock, neo-psychedelia, heavy psych"
      ],
      "Years active": [
         "1986–present"
      ],
      "Associated acts": [
         "Kyuss, Queens of the Stone Age, Brant Bjork and the Bros, Fatso Jetson, Ten East, The Sort of Quartet, Big Scenic Nowhere, Oddio Gasser, Yawning Sons, Dark Tooth Encounter, Waterways, Noon Day Mad Dogs, Across the River, Orquesta del Desierto, Dead Issue, Family Butcher, Gusto, Vic du Monte's Persona Non Grata"
      ],
      "Website": [
         "www.yawningman.com"
      ],
      "Members": [
         "Gary Arce",
         "Mario Lalli",
         "Bill Stinson",
         "Dino Von Lalli"
      ],
      "Past members": [
         "Billy Cordell",
         "Larry Lalli",
         "Alfredo Hernandez"
      ]
   },
   "albums": []
}