{
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "The band formed in 2009 out of informal collaborations between Bill Kreutzmann and Papa Mali. Kreutzmann had been featured as a special guest at several of Mali's concerts since 2008 (including a New Year's Eve 2008/2009 show on Maui billed as Bill Kreutzmann & Friends with multi-instrumentalist Matt Hubbard and Bonnie Raitt/BK3/Neville Brothers  bassist James \"Hutch\" Hutchinson) and the two decided to form an official band together with multi-instrumentalist Matt Hubbard, best known for his work with Willie Nelson, and Reed Mathis, of Tea Leaf Green.[2]\n",
         "Their name might be an adaptation of the lyrics of the Grateful Dead song \"The Eleven\", \"Six proud walkers on the jingle bell rainbow.\" They have also written and perform a song called \"7 Walkers.\"\n",
         "The band commenced a tour in late 2009 and another one in the spring of 2010. Due to touring commitments with Tea Leaf Green, Reed Mathis was replaced by George Porter Jr., of The Meters in spring 2010.[3] They released their debut album, 7 Walkers, on November 2, 2010.[4] It features new songs written by Robert Hunter. Reed Mathis and George Porter Jr. played bass on the album.[2] Willie Nelson also performs on the song \"King Cotton Blues.\"\n",
         "On a few occasions in 2010 and 2011, New Bohemians bassist Brad Houser filled in for George Porter Jr.[5]  Sousaphonist Kirk Joseph of the Dirty Dozen Brass Band also filled in for George on dates in 2011 and 2012.\n",
         "Although the 7 Walkers have not officially disbanded, they have not performed together since 2012.\n"
      ]
   },
   "Members": {},
   "References": {},
   "Sections": [
      "1 History",
      "2 Members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "7 Walkers was an American rock band featuring former Grateful Dead drummer Bill Kreutzmann, guitarist Papa Mali, multi-instrumentalist Matt Hubbard, and bassist George Porter Jr.[1]\n"
      ]
   },
   "Title": "7 Walkers - Wikipedia"
}