{
   "Name": "Al and the Transamericans",
   "Sections": [
      "1 History",
      "2 Discography",
      "3 See also",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Al and the Transamericans is a side project band formed by guitarist Al Schnier of moe. Hailing from the Northeast, the band is best described as a roots rock, alt country, Americana group. The music is a nice blend of bluegrass, country, and rock. All of the musicians have 'day jobs' in other bands (moe., Strangefolk, Okemah, the Gordon Stone Trio). These guys all come to this simply for the love of playing a good three chord song. Their shows typically feature everything from straight up acoustic bluegrass barnburners to balls out rock.\n"
      ]
   },
   "History": {
      "text": [
         "The band was started as a side project by Schnier in January 1999. They played four shows in the Northeast with their first show being at the Pontiac Grill in Philadelphia, Pennsylvania. The first incarnation of the band featured Schnier on guitar and vocals; Kirk Juhas of freebeer&chicken on keyboards, banjo, harmonica, and vocals; Jim Loughlin of Yolk on bass and vocals; Ted Marotta of Ominous Seapods on drums and vocals; and Rolf Witt of the Merry Danksters and Sonic Garden on mandolin, fiddle, and guitar.\n",
         "They would not perform again until March 2000, when they played three shows in the Northeast. The lineup remained the same except Vinnie Amico of moe. replaced Marotta on drums. A few months later, in June 2000, the band played three more shows making their way across Upstate New York (Buffalo, Utica, Albany). The last show, in Albany, included a guest appearance by Marotta on drums.  Their final show of 2000 was played at the first annual moe.down festival in Turin, NY. The festival is hosted by Schnier's band moe. over Labor Day weekend. Marotta once again made a guest appearance during this performance.\n",
         "Over a year later they would make their next appearance playing a moe. aftershow. The show, at the Lion's Den in New York City on Thanksgiving weekend, featured the same lineup minus Rolf Witt. In 2002 they played BerkFest, moe.down, and two other shows in the Northeast.\n",
         "The band's most active year was in 2003 when they played over twenty shows throughout the year. During this time the band was augmented; Al, Kirk (now of Okemah), and Vinnie remained, while Gordon Stone took over for Witt on banjo and pedal steel, and Erik Glockler from Strangefolk took over bass duties from Loughlin. Schnier's wife, Diane, also provided vocals from time to time. After moe.down IV, the band performed a series of dates in the Northeast in both the beginning of September and December. The tour was in support of their newly released album Analog, which was released on September 9, 2003.\n",
         "In late March 2004 the band did a small seven show tour that started in Austin, Texas, and went through Alabama, Georgia, Tennessee, and Kentucky. Eventually the tour made its way North and ended in Hoboken, NJ. Later that same year in late May they played four more shows in the Northeast. Eventually they would finish the year with a performance at moe.down V. During this show, Jay Barady of Woodenspoon sat in on mandolin since Gordon Stone was unable to appear. This performance also featured three songs written by Diane Schnier, who also played keyboards and drums. The songs would later appear on her first album Before Cowboys.\n",
         "For the only time since its inception, the band did not perform in 2005. However, Al, Kirk, and Vinnie along with Diane, Kenny Juhas, and Shannon Lynch performed as Before Cowboys. The band performed songs written by Diane Schnier at three separate shows throughout the year, including a set at moe.down VI. The Transamericans would return for one night in 2006, on July 15 they played at the Electric Company in Utica, New York.  Before Cowboys also made one appearance in 2006, once again playing a set at moe.down VII.\n",
         "Both bands would appear together on May 11, 2007, at the Electric Company in Utica, NY. Later that month the Transamericans would play another annual moe. festival, Summer Camp in Chillicothe, Illinois, over Memorial Day weekend. A return trip to the Electric Company for a moe. after show in July was followed by two Northeast dates in mid-August. Once again their last show of the year was a set at moe.down VIII.\n",
         "On October 31, 2008 Basemental Records officially released the band's second studio album This Day & Age. The new album features five brand new songs and is a limited edition series of only 1000 copies. Each copy is signed and numbered by Al Schnier. The album features the most frequent incarnation of the band; Al Schnier, Vinnie Amico, Erik Glockler, Kirk Juhas, and Gordon Stone. The band kicked off a tour to support the new album with a release party on Halloween night at the Electric Company in Utica, NY.  The tour consisted of dates in the Northeast and lasted midway through November.\n"
      ]
   },
   "Discography": {},
   "See also": {},
   "External links": {},
   "coreData": [
      "Al and the Transamericans is a side project band formed by guitarist Al Schnier of moe. Hailing from the Northeast, the band is best described as a roots rock, alt country, Americana group. The music is a nice blend of bluegrass, country, and rock. All of the musicians have 'day jobs' in other bands (moe., Strangefolk, Okemah, the Gordon Stone Trio). These guys all come to this simply for the love of playing a good three chord song. Their shows typically feature everything from straight up acoustic bluegrass barnburners to balls out rock.\n",
      "The band was started as a side project by Schnier in January 1999. They played four shows in the Northeast with their first show being at the Pontiac Grill in Philadelphia, Pennsylvania. The first incarnation of the band featured Schnier on guitar and vocals; Kirk Juhas of freebeer&chicken on keyboards, banjo, harmonica, and vocals; Jim Loughlin of Yolk on bass and vocals; Ted Marotta of Ominous Seapods on drums and vocals; and Rolf Witt of the Merry Danksters and Sonic Garden on mandolin, fiddle, and guitar.\n",
      "They would not perform again until March 2000, when they played three shows in the Northeast. The lineup remained the same except Vinnie Amico of moe. replaced Marotta on drums. A few months later, in June 2000, the band played three more shows making their way across Upstate New York (Buffalo, Utica, Albany). The last show, in Albany, included a guest appearance by Marotta on drums.  Their final show of 2000 was played at the first annual moe.down festival in Turin, NY. The festival is hosted by Schnier's band moe. over Labor Day weekend. Marotta once again made a guest appearance during this performance.\n",
      "Over a year later they would make their next appearance playing a moe. aftershow. The show, at the Lion's Den in New York City on Thanksgiving weekend, featured the same lineup minus Rolf Witt. In 2002 they played BerkFest, moe.down, and two other shows in the Northeast.\n"
   ]
}