{
   "Name": "Banyan (band)",
   "Sections": [
      "Summary"
   ],
   "Summary": {
      "text": [
         "Banyan is an art rock/alternative rock band with heavy jazz, and funk influence, based in Los Angeles, California.[1][2]\n",
         "The leader and co-founder is Stephen Perkins,[3] who first played drums for Jane's Addiction (1986–1991, plus later regroupings), and then for Porno for Pyros. He co-founded the group with Emit Bloch. The core members of the band are Nels Cline on guitar,  Willie Waldman on trumpet and Mike Watt (Minutemen) on bass. Mike Watt also sings on some Banyan songs. Both Mike Watt and Nels Cline generally play only West Coast dates and at various times the band has had Rob Wasserman and Daniel Shulman who played with Garbage on bass and Clint Wagner on guitar fill in when they are unavailable. Saxophone players Steve Mackay and Herman Green, guitar player Calvin Newborn, Dave Aron on clarinet, and bass player J. D. Westmoreland have also joined the band during select live shows.\n",
         "Los Angeles artist Norton Wisdom paints on a wet-erase board while the band plays, and the imagery he creates interprets the music much in the same way that lyrics might.[3] To see the band in more than one performance, you will see some images that recur and some that are new, since the songs are compositions whose structure remains the same while there is also a large amount of improvisation, in the jazz tradition.[3]\n",
         "The first EP featured Money Mark as keyboardist labeled as the Freeway Keyboardist. The first album was engineered by the Dust Brothers at their studio and produced by Turin and Perkins.\n",
         "Notable guest appearances on the second album Anytime at All include Flea,[4] John Frusciante[4] (both from the Red Hot Chili Peppers), Martyn LeNoble (Perkins' former bandmate from Porno for Pyros), Rob Wasserman[4] and Buckethead. It was produced by Dave Aron (Producer/Engineer/Mixer of Snoopdogg, Sublime and moe.) and Willie Waldman as the Blunt Brothers.\n",
         "For their third album Live At Perkins' Palace (named after the fact that it was recorded at Perkins' home studio, not after the live performance venue of the same name), the band reduced itself to a four-piece unit of Perkins, Watt, Cline, and Waldman.[4]\n",
         "Steve Kimock sat-in with Banyan during their August 26, 2007 performance at the Riverview Music Festival in Chicago, IL.\n",
         "In liner notes and personal conversations, members of the band cite Igor Stravinsky and Miles Davis as influences.\n"
      ]
   },
   "coreData": [
      "Banyan is an art rock/alternative rock band with heavy jazz, and funk influence, based in Los Angeles, California.[1][2]\n",
      "The leader and co-founder is Stephen Perkins,[3] who first played drums for Jane's Addiction (1986–1991, plus later regroupings), and then for Porno for Pyros. He co-founded the group with Emit Bloch. The core members of the band are Nels Cline on guitar,  Willie Waldman on trumpet and Mike Watt (Minutemen) on bass. Mike Watt also sings on some Banyan songs. Both Mike Watt and Nels Cline generally play only West Coast dates and at various times the band has had Rob Wasserman and Daniel Shulman who played with Garbage on bass and Clint Wagner on guitar fill in when they are unavailable. Saxophone players Steve Mackay and Herman Green, guitar player Calvin Newborn, Dave Aron on clarinet, and bass player J. D. Westmoreland have also joined the band during select live shows.\n",
      "Los Angeles artist Norton Wisdom paints on a wet-erase board while the band plays, and the imagery he creates interprets the music much in the same way that lyrics might.[3] To see the band in more than one performance, you will see some images that recur and some that are new, since the songs are compositions whose structure remains the same while there is also a large amount of improvisation, in the jazz tradition.[3]\n",
      "The first EP featured Money Mark as keyboardist labeled as the Freeway Keyboardist. The first album was engineered by the Dust Brothers at their studio and produced by Turin and Perkins.\n"
   ]
}