{
   "Name": "Benevento/Russo Duo",
   "rawData": [
      "The Benevento/Russo Duo (or The Duo for short) is an alternative jazz/rock band from New York City, featuring Marco Benevento on keyboard instruments and Joe Russo on drums.\n",
      "Benevento and Russo met while in junior high school in New Jersey. The Duo began in 2001 when Russo secured a weekly gig at New York's Knitting Factory music club, and asked Benevento to join him on the Hammond B3 organ. By 2003 the band had self-released two albums, Debut Album (sometimes referred to as Benevento/Russo Duo) and Darts. In 2005, Best Reason to Buy the Sun was released on Ropeadope Records to critical acclaim. Play Pause Stop was released on July 11, 2006.\n",
      "The Duo was the winner of New Groove of the Year in 2005, at the 5th Annual Jammys. Joe Russo has previously won the New Groove of the Year award in 2000, as a member of Fat Mama.\n"
   ],
   "infobox": {
      "Also known as": [
         "The Duo"
      ],
      "Origin": [
         "Brooklyn, New York, United States"
      ],
      "Genres": [
         "Indie rock, jazz fusion, experimental"
      ],
      "Years active": [
         "2001–2009, 2017-present (Hiatus: 2009-2017)"
      ],
      "Labels": [
         "Butter Problems"
      ],
      "Website": [
         "www.beneventorussoduo.com"
      ],
      "Members": [
         "Marco Benevento",
         "Joe Russo"
      ]
   },
   "albums": [
      "My Jackhammer",
      "Darts",
      "Best Reason to Buy the Sun",
      "Live from Bonnaroo 2005",
      "Play Pause Stop",
      "Split Sides, Volume 1"
   ],
   "prunedData": [
      "The [BAND_NAME] (or The Duo for short) is an [GENRE] band from New York City, featuring [MONTH]co Benevento on keyboard instruments and [PERSON_NAME_FULL_0_MALE] on drums.\n",
      "Benevento and Russo met while in junior high school in New Jersey. The Duo began in [YEAR] when Russo secured a weekly gig at New York's Knitting Factory music club, and asked Benevento to join him on the Hammond B3 organ. By [YEAR] the band had self-released two albums, Debut Album (sometimes referred to as [BAND_NAME]) and Darts. In [YEAR], Best Reason to Buy the Sun was released on Ropeadope Records to critical acclaim. Play Pause Stop was released on [MONTH] 11, [YEAR].\n",
      "The Duo was the winner of New Groove of the Year in [YEAR], at the 5th Annual Jammys. [PERSON_NAME_FULL_0_MALE] has previously won the New Groove of the Year award in [YEAR], as a [GENRE]"
   ]
}