{
   "Band members": {
      "Occasional band members": {},
      "The Duo": {}
   },
   "Discography": {},
   "External links": {},
   "History": {
      "text": [
         "Benevento and Russo met while in junior high school in New Jersey. The Duo began in 2001 when Russo secured a weekly gig at New York's Knitting Factory music club, and asked Benevento to join him on the Hammond B3 organ. By 2003 the band had self-released two albums, Debut Album (sometimes referred to as Benevento/Russo Duo) and Darts. In 2005, Best Reason to Buy the Sun was released on Ropeadope Records to critical acclaim. Play Pause Stop was released on July 11, 2006.\n",
         "The Duo was the winner of New Groove of the Year in 2005, at the 5th Annual Jammys. Joe Russo has previously won the New Groove of the Year award in 2000, as a member of Fat Mama.\n",
         "The band's unique style blends elements of rock, punk, acid jazz, and fusion. This distinctive sound is the product of a gradual evolution that began with the Hammond organ-driven jazz improvisation of their Knitting Factory days. Their music is powerful and danceable;overdriven keyboard riffs (often looped on an electronic sampler), outlandish noise effects and forceful, technical drumming are all characteristic of the Duo's musical style. They have been a staple in the jam band scene since 2003 and have appeared multiple times at popular music festivals such as Bonnaroo, Lollapalooza, and Wakarusa. Improvisation plays an important role in the Duo's live performances, but their focus is on tight rock arrangements.\n",
         "Like many acts associated with the jam band scene, the Duo has a small but dedicated fan base. Their association with Mike Gordon of Phish, who has become something of an unofficial third member of the group (not merely joining as a guest on some songs, but playing as their bassist for whole tours), has raised The Duo's visibility in the jam band scene.\n",
         "RANA guitarist Scott Metzger has been another frequent guest at The Duo shows, as well as guitarist Brad Barr of The Slip and Seattle, Washington-based saxophonist Skerik. Metzger and Ween bassist Dave Dreiwitz have been known to join The Duo for sets of Led Zeppelin covers, performing under the name Bustle in Your Hedgerow, a line from the Led Zeppelin classic Stairway to Heaven. Russo and Benevento (along with Metzger, Dreiwitz, and Tom Hamilton) are members of Joe Russo's Almost Dead, a Grateful Dead tribute band led by Joe Russo.\n",
         "In mid-2006 Trey Anastasio of Phish announced that he and Mike Gordon would join forces with the Duo for a nationwide tour. This announcement followed the success the four musicians had found while in the studio together recording and writing songs for Anastasio's album Bar 17. The tour began with GRAB (Gordon, Russo, Anastasio, Benevento) co-headlining a ten-date run with Phil Lesh and Friends. The tour kicked off with the \"Superjam\" at the 2006 Bonnaroo festival which saw Lesh joining GRAB for \"Casey Jones\" and other Grateful Dead numbers. GRAB went on to play seven headlining dates without Phil and Friends, and close out the tour with a performance at the 10,000 Lakes Festival in Detroit Lakes, Minnesota.\n",
         "The Duo can be heard in the CSI: NY episode Grand Murder at Central Station which aired on October 5, 2005.\n",
         "On April 28, 2016, Joe Russo announced via Instagram that The Duo would be performing at JamCruise 2017.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Band members",
      "2.1 The Duo",
      "2.2 Occasional band members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Benevento/Russo Duo (or The Duo for short) is an alternative jazz/rock band from New York City, featuring Marco Benevento on keyboard instruments and Joe Russo on drums.\n"
      ]
   },
   "Title": "Benevento/Russo Duo - Wikipedia"
}