{
   "Name": "The Big Wu",
   "rawData": [
      "The Big Wu is a rock jam band from Minnesota.  The group is composed of Al Oikari, Andy Miller, Chris Castino, Mark Joseph Grundhoefer, and Terry VanDeWalker.  The band made a mark on the jam band scene with a reputation for hook-oriented songwriting and as one of the earliest jam bands from the Midwest to achieve some national success.  Relentless touring in the late 1990s and early 2000s built a loyal fan base that call themselves \"family,\" many of whom get together for the band's recurring music festival, the Big Wu Family Reunion.  From 1998-2006, the band annually held the Family Reunion on Memorial Weekend, and they frequently hold a Wu Years Eve event on December 31.  The band has not toured extensively since the end of 2006, instead playing periodic shows in their home state of Minnesota and other nearby states.\n",
      "The Big Wu was founded in 1992 at St. Olaf College by students Chris Castino (guitar), Terry VanDeWalker (vocals), and Jason Fladager (guitar). Andrew Eklund (bass; now owns Ciceron, Inc.), Nathan Eklund (Keyboards; now with Kubla Khan), Chip House (drums, now a VP with ExactTarget) made up the rest of the regular lineup.  Julie Crumrine (vocals) and Julie Niksitch (vocals) made frequent appearances.\n",
      "The band played their first gig on February 14, 1992 in the Lion's Pause in the basement of the old Ytterboe Hall at St. Olaf College in Northfield, Minnesota.  Every song played was a cover by the Grateful Dead, Bob Dylan, or the Allman Brothers.  The Big Wu continued to play every three weeks or so in town above the Reub-n-Stein, the most popular local bar at the time.  Big Wu shows quickly became one of the biggest events on campus, and posters littered the cafeteria walls at both Carleton and St. Olaf.\n"
   ],
   "infobox": {
      "Origin": [
         "Northfield, Minnesota, U.S."
      ],
      "Genres": [
         "Rock, jazz fusion, progressive rock, jam band"
      ],
      "Years active": [
         "1992–present"
      ],
      "Labels": [
         "Phoenix Rising, BIVCO Records, Oarfin Records"
      ],
      "Associated acts": [
         "God Johnson, Cloudsplitter"
      ],
      "Members": [
         "Chris Castino (Guitar/Vocals)",
         "Andy Miller (Bassist)",
         "Terry VanDeWalker (Drummer/Vocals)",
         "Al Oikari (Keyboards)",
         "Mark Joseph Grundhoefer (Guitar/Vocals)"
      ],
      "Past members": [
         "Jason Fladager (1992-2002)",
         "Chip House (Drummer)",
         "Andrew Eklund (Bassist)",
         "Nathan Eklund (Keyboards)"
      ]
   }
}