{
   "Name": "The Big Wu",
   "Sections": [
      "1 History",
      "2 Albums",
      "3 Videos",
      "4 Documentary",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Big Wu is a rock jam band from Minnesota.  The group is composed of Al Oikari, Andy Miller, Chris Castino, Mark Joseph Grundhoefer, and Terry VanDeWalker.  The band made a mark on the jam band scene with a reputation for hook-oriented songwriting and as one of the earliest jam bands from the Midwest to achieve some national success.  Relentless touring in the late 1990s and early 2000s built a loyal fan base that call themselves \"family,\" many of whom get together for the band's recurring music festival, the Big Wu Family Reunion.  From 1998-2006, the band annually held the Family Reunion on Memorial Weekend, and they frequently hold a Wu Years Eve event on December 31.  The band has not toured extensively since the end of 2006, instead playing periodic shows in their home state of Minnesota and other nearby states.\n"
      ]
   },
   "History": {
      "text": [
         "The Big Wu was founded in 1992 at St. Olaf College by students Chris Castino (guitar), Terry VanDeWalker (vocals), and Jason Fladager (guitar). Andrew Eklund (bass; now owns Ciceron, Inc.), Nathan Eklund (Keyboards; now with Kubla Khan), Chip House (drums, now a VP with ExactTarget) made up the rest of the regular lineup.  Julie Crumrine (vocals) and Julie Niksitch (vocals) made frequent appearances.\n",
         "The band played their first gig on February 14, 1992 in the Lion's Pause in the basement of the old Ytterboe Hall at St. Olaf College in Northfield, Minnesota.  Every song played was a cover by the Grateful Dead, Bob Dylan, or the Allman Brothers.  The Big Wu continued to play every three weeks or so in town above the Reub-n-Stein, the most popular local bar at the time.  Big Wu shows quickly became one of the biggest events on campus, and posters littered the cafeteria walls at both Carleton and St. Olaf.\n",
         "On September 11, 1995, the Big Wu played for the first time at the Terminal Bar on Hennepin Avenue in Northeast Minneapolis. This gig started a run of shows that lasted from the end of 1995 into most of 1996.  A little over a month later on October 28, 1995, they debuted their first original song \"Silcanturnitova\".  Over the next four years an onslaught of new songs were written including \"Bloodhound\", \"Red Sky\", \"Precious Hands\", \"Kangaroo\", and \"Puerto Rico.\"  It was also at the Terminal Bar where the lineup was solidified, with Chip House, Andrew Eklund, and Nathan Eklund all leaving the band to pursue professional careers.  At the time the Big Wu was looking for a keyboardist and bass guitar player.  Andy Miller, also a St. Olaf College graduate, got the job playing bass, and several months later, Al Oikari sat in on keys and eventually became a member of the band.\n",
         "At the end of 1996, the Big Wu got the job as the house band at the legendary Cabooze Bar in Minneapolis.  Wednesday night became a regular night out for what became known as the \"Wu Family\", who served as the test market for new songs as the band reshaped their shows around original music and playful lyrics.\n",
         "On September 12, 1997, Tracking Buffalo Through the Bathtub, the Big Wu's debut CD was released.  Though a CD release party was held at the Cabooze, the CD itself did not arrive at the show due to shipping problems, and the album wasn't available for purchase until the following week.  Similar gaffes and logistical ironies would plague the band over the next several years, prompting a gentle self-mockery that became a staple of the band's onstage humor.\n",
         "On July 17, 1998, the Big Wu hosted the first ever Big Wu Family Reunion at Latch Lake Studios in Eagan, Minnesota – the local studio where Tracking Buffalo Through the Bathtub had been recorded the year before.  The next year, the Family Reunion was held at Harmony Park Music Garden in Geneva, Minnesota, and the event would be held at either Harmony Park or the Jamboree Campground in Black River Falls, Wisconsin thereafter.  The Family Reunion drew thousands of concert-goers each year during the early 2000s, and the festival served to introduce the Midwest to a number of jam bands that would later find a national audience.\n",
         "Short tours throughout the Midwest and periodic gigs in Colorado led the Big Wu to hit the road full-time in 1999, and they would average 150–200 shows a year for the next several years.\n",
         "On October 17, 2000, the band released their second album Folktales on a small jam band oriented record label out of New York called Phoenix Rising Records. The album enjoyed a good ride, but was quickly forced into the abyss when Phoenix filed for bankruptcy a little over a year later. For the following two years, the Big Wu were unable to sell CDs to the public because the assets of the record label (including Tracking Buffalo Through the Bathtub and Folktales) were tied up in bankruptcy court.\n",
         "While the band was in record label limbo, they took to recording a third CD, Spring Reverb. The album was produced by Bill Cutler, a veteran producer who had worked with the likes of the Grateful Dead. With Bill at the wheel, the Big Wu created what is generally their most well-regarded album, recording at Pachyderm Studio in Cannon Falls, Minnesota, and at Oar Fin Records in Minneapolis. At the end of the summer in 2002, the Big Wu's contract with Phoenix was nullified, and they were able to buy their assets back, making the release of the newly finished album possible.  The Big Wu played a CD release party for Spring Reverb at the Historic State Theatre on November 2, 2002.\n",
         "On June 21, 2002, The Big Wu's rising fame gave them the opportunity to open the first ever Bonnaroo Music Festival. Their afternoon set attracted over 50,000 fans and the band churned out a historic performance in the blazing sun. \"Rhode Island Red\" was selected from their performance to represent the band on the inaugural Live from Bonnaroo - Volume 2. This opportunity came just days following what was arguably the band's most critical booking of the millennium - the Edina High School Class of 2002 Graduation Party.\n",
         "During the 2002 Harvest Festival at Harmony Park Music Garden, the Big Wu played two long nights of music. The first ended up being guitarist Jason Fladager's last show. There was no announcement from stage, although the band knew that Fladager had no intent on returning for the second night. The second night of the festival, the Big Wu played a long set without one of their founding guitarists.  A few days later the band announced that Fladager had left the band to be closer to his family.  The guitarist's absence prompted the band to reinvent itself as a four-piece. Jason Fladager would go on to start his own band called God Johnson.[1]\n",
         "The Big Wu released Tool for Evening in 2004, their first record as a four-piece.  A live album followed in 2006.  Following the band's 2006 fall–winter tour, which included a run of shows in Japan, the band took some time off the road, playing only a handful of shows in 2007 in their home state of Minnesota.\n",
         "In 2009 The Big Wu announced that original member Jason Fladager was to re-join the group and they have since played a number of shows as the original five piece including a recent show at Festival Bella Madre. Big Wu Family Reunion 10 is scheduled for July 10–12, 2009 at the Harmony Park Music Garden. In addition to the Big Wu it features a number of Twin Cities acts.\n",
         "In 2012, The Big Wu re-established themselves as one of the premier jam-bands in the world.  Their conquest to reclaim glory began at Brent and Becky Ahrens' wedding on July 7, in Milwaukee Wisconsin at Lakefront Brewery.  Mark Joseph has joined the band full-time.  The band has begun playing new songs and is even hinting at an album release.\n",
         "Family Reunions of The Big Wu were held at Camp Maiden Rock West in Morristown, Minnesota in August 2015 and 2016.\n"
      ]
   },
   "Albums": {},
   "Videos": {},
   "Documentary": {
      "text": [
         "The Big Wu Way premiered April 9, 2016 as part of the 35th annual Minneapolis St. Paul International Film Festival.[2]\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Big Wu is a rock jam band from Minnesota.  The group is composed of Al Oikari, Andy Miller, Chris Castino, Mark Joseph Grundhoefer, and Terry VanDeWalker.  The band made a mark on the jam band scene with a reputation for hook-oriented songwriting and as one of the earliest jam bands from the Midwest to achieve some national success.  Relentless touring in the late 1990s and early 2000s built a loyal fan base that call themselves \"family,\" many of whom get together for the band's recurring music festival, the Big Wu Family Reunion.  From 1998-2006, the band annually held the Family Reunion on Memorial Weekend, and they frequently hold a Wu Years Eve event on December 31.  The band has not toured extensively since the end of 2006, instead playing periodic shows in their home state of Minnesota and other nearby states.\n",
      "The Big Wu was founded in 1992 at St. Olaf College by students Chris Castino (guitar), Terry VanDeWalker (vocals), and Jason Fladager (guitar). Andrew Eklund (bass; now owns Ciceron, Inc.), Nathan Eklund (Keyboards; now with Kubla Khan), Chip House (drums, now a VP with ExactTarget) made up the rest of the regular lineup.  Julie Crumrine (vocals) and Julie Niksitch (vocals) made frequent appearances.\n",
      "The band played their first gig on February 14, 1992 in the Lion's Pause in the basement of the old Ytterboe Hall at St. Olaf College in Northfield, Minnesota.  Every song played was a cover by the Grateful Dead, Bob Dylan, or the Allman Brothers.  The Big Wu continued to play every three weeks or so in town above the Reub-n-Stein, the most popular local bar at the time.  Big Wu shows quickly became one of the biggest events on campus, and posters littered the cafeteria walls at both Carleton and St. Olaf.\n",
      "On September 11, 1995, the Big Wu played for the first time at the Terminal Bar on Hennepin Avenue in Northeast Minneapolis. This gig started a run of shows that lasted from the end of 1995 into most of 1996.  A little over a month later on October 28, 1995, they debuted their first original song \"Silcanturnitova\".  Over the next four years an onslaught of new songs were written including \"Bloodhound\", \"Red Sky\", \"Precious Hands\", \"Kangaroo\", and \"Puerto Rico.\"  It was also at the Terminal Bar where the lineup was solidified, with Chip House, Andrew Eklund, and Nathan Eklund all leaving the band to pursue professional careers.  At the time the Big Wu was looking for a keyboardist and bass guitar player.  Andy Miller, also a St. Olaf College graduate, got the job playing bass, and several months later, Al Oikari sat in on keys and eventually became a member of the band.\n"
   ]
}