{
   "Albums discography": {
      "Compilations": {},
      "Studio & live albums": {}
   },
   "Career": {
      "text": [
         "In 1964, Elektra Records produced a compilation album of various artists entitled, The Blues Project, which featured several white musicians from the Greenwich Village area who played acoustic blues music in the style of black musicians. One of the featured artists on the album was a young guitarist named Danny Kalb, who was paid $75 for his two songs. Not long after the album's release, however, Kalb gave up his acoustic guitar for an electric one. The Beatles' arrival in the United States earlier in the year muted the folk and acoustic blues movement that had swept the US in the early 1960s.\n",
         "Kalb formed the Danny Kalb Quartet in early 1965, with rhythm guitarist  Artie Traum, Andy Kulberg on bass and drummer Roy Blumenfeld.[2] When Traum went to Europe during the summer, guitarist Steve Katz (like Kalb, a former pupil of guitarist Dave Van Ronk) joined as first a temporary replacement and then a permanent member. Later in 1965, the group added singer Tommy Flanders and changed its name to The Blues Project, as an allusion to Kalb's first foray on record.[3]\n",
         "Late in the year, the band auditioned for Columbia Records. During the session for the auditions, producer Tom Wilson hired session musician Al Kooper, who had worked with him on Bob Dylan's \"Like a Rolling Stone,\" to provide piano and organ.[3] Kooper, who had worked with Blumenfeld and Kulberg during sessions for his contribution to the What's Shakin' compilation,[4] was invited to join the group.\n",
         "When Columbia declined to sign the band, Wilson, who by late 1965 had moved to MGM Records, signed the Blues Project to MGM's Verve/Folkways subsidiary. The band began recording their first album live at Greenwich Village's Cafe Au Go Go in late November 1965.[1]  Entitled Live at The Cafe Au Go Go, the album was finished with another week of recordings in January 1966.[3] By that time, Flanders had left the band and, as a result, he appeared on only a few of the songs on this album.[1] Live at The Cafe Au Go Go was a moderate success, and the band toured the U.S. to promote it. While in San Francisco, California in April 1966, the Blues Project played at the Fillmore Auditorium to rave reviews. Members of the Grateful Dead who were in attendance were impressed with their performance.(Source: Rock Family Trees - television program)\n",
         "Returning to New York, the band recorded their second album Projections in the fall of 1966, with MGM releasing it in November.[3] Projections contained an eclectic set of songs that ran the gamut from blues, R&B, jazz, psychedelia, and folk-rock.[1] The centerpieces of the album were an 11-and-a-half minute version of Muddy Waters' blues standard \"Two Trains Running\" featuring Kalb on vocals and lead guitar, and Kooper's instrumental \"Flute Thing\" featuring Kulberg on flute.\n",
         "Soon after Projections was completed, however, the band began to fall apart. Kooper left the band in the spring of 1967,[3] and the band completed a third album, Live At Town Hall without him.[3] Despite the name, only one song was recorded live at Town Hall in New York; the other songs were live recordings from other venues, or studio outtakes with overdubbed applause to feign a live sound.[1]  One song in the latter category, Kooper's \"No Time Like the Right Time,\" was the band's only charting single.\n",
         "The Blues Project's last hurrah was at the Monterey International Pop Festival held in Monterey, California, in June 1967. By this time, however, half of the band's original line-up was gone. Katz left soon thereafter, followed by Kalb.[3] Kooper was at the festival in the capacity of \"assistant stage manager\" to \"Chip\" Monck.[5] A fourth album, 1968's Planned Obsolescence, featured only Blumenfeld and Kulberg from the original lineup, but was released under the Blues Project name at Verve's insistence. Future recordings by this lineup were released under a new band name, Seatrain.[3]\n",
         "In 1968, Kooper and Katz joined forces to fulfill a desire of Kooper's to form a rock band with a horn section. The result was Blood, Sweat & Tears.[3] While Kooper led the band on its first album, Child Is Father to the Man, he did not take part in any subsequent releases. Soon after, Kooper, then a producer for Columbia Records, recorded with Bloomfield, Stephen Stills and Harvey Brooks for the album entitled Super Session,[6] before doing several solo albums including one with Shuggie Otis. Katz, on the other hand, remained with the band into the 1970s.\n",
         "The Blues Project, with a modified line-up, reformed briefly in the early 1970s, releasing three further albums:  1971's Lazarus, 1972's Blues Project, and 1973's The Original Blues Project Reunion In Central Park (which featured Kooper but not Flanders).[3] These albums did little to excite the public and since then, the group's activity has been confined to a few sporadic reunion concerts, such as when the Blues Project played a fundraising concert at Valley Stream Central High School in New York, promoted by Bruce Blakeman with the proceeds going to the Youth Council and the US Olympic Committee.\n",
         "In 1969, flutist/bassist Andy Kulberg and drummer Roy Blumenfeld of Blues Project formed the band Seatrain with Jim Roberts, ex-Mystery Trend guitarist John Gregory, former Jim Kweskin Jug Band violinist/fiddler Richard Greene, and saxophonist Don Kretmar. Seatrain recorded their first album, Planned Obsolescence, in 1968, but had to release it as a Blues Project album for contractual reasons. In 1969, they released a self-titled A&M LP (Sea Train), but faced a major change in membership a few months later. Three more albums, 1970's Seatrain, 1971's The Marblehead Messenger (on Capitol) and 1973's Watch (on Warner Bros.) followed.\n",
         "In the period between 2001 and 2007, Roy Blumenfeld drummed in the Barry Melton Band (Melton of Country Joe and the Fish fame).[7]\n"
      ]
   },
   "External links": {},
   "Members": {
      "2012-Current": {},
      "Best-known lineup": {},
      "Later members": {}
   },
   "References": {},
   "Sections": [
      "1 Career",
      "2 Albums discography",
      "2.1 Studio & live albums",
      "2.2 Compilations",
      "3 Members",
      "3.1 Best-known lineup",
      "3.2 Later members",
      "3.3 2012-Current",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "The Blues Project is a band from the Greenwich Village neighborhood of New York City that was formed in 1965 and originally split up in 1967.[1] Their songs drew from a wide array of musical styles. They are most remembered as one of the most artful practitioners of pop music, influenced as it was by folk, blues, rhythm & blues, jazz and the pop music of the day.\n"
      ]
   },
   "Title": "The Blues Project - Wikipedia"
}