{
   "Name": "The Blues Project",
   "rawData": [
      "The Blues Project is a band from the Greenwich Village neighborhood of New York City that was formed in 1965 and originally split up in 1967. Their songs drew from a wide array of musical styles. They are most remembered as one of the most artful practitioners of pop music, influenced as it was by folk, blues, rhythm & blues, jazz and the pop music of the day.\n",
      "In 1964, Elektra Records produced a compilation album of various artists entitled, The Blues Project, which featured several white musicians from the Greenwich Village area who played acoustic blues music in the style of black musicians. One of the featured artists on the album was a young guitarist named Danny Kalb, who was paid $75 for his two songs. Not long after the album's release, however, Kalb gave up his acoustic guitar for an electric one. The Beatles' arrival in the United States earlier in the year muted the folk and acoustic blues movement that had swept the US in the early 1960s.\n",
      "Kalb formed the Danny Kalb Quartet in early 1965, with rhythm guitarist  Artie Traum, Andy Kulberg on bass and drummer Roy Blumenfeld. When Traum went to Europe during the summer, guitarist Steve Katz (like Kalb, a former pupil of guitarist Dave Van Ronk) joined as first a temporary replacement and then a permanent member. Later in 1965, the group added singer Tommy Flanders and changed its name to The Blues Project, as an allusion to Kalb's first foray on record.\n"
   ],
   "infobox": {
      "Origin": [
         "Greenwich Village, New York, United States"
      ],
      "Genres": [
         "Blues, rock, psychedelic rock, garage rock"
      ],
      "Years active": [
         "1965–1968; 1970–1973; sporadically 1973–present"
      ],
      "Labels": [
         "Verve",
         "Capitol"
      ],
      "Members": [
         "Danny Kalb",
         "Steve Katz",
         "Tommy Flanders",
         "Al Kooper",
         "Roy Blumenfeld"
      ],
      "Past members": [
         "Andy Kulberg",
         "John McDuffy",
         "David Cohen",
         "Don Kretmar",
         "John Gregory",
         "Bill Lussenden",
         "Eric Pearson",
         "Richard Greene"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a band from the Greenwich Village neighborhood of New York City that was formed in [YEAR] and originally split up in [YEAR]. Their songs drew from a wide array of musical styles. They are most remembered as one of the most artful practitioners of pop music, influenced as it was by folk, blues, rhythm & blues, jazz and the pop music of the day.\n",
      "In [YEAR], Elektra Records produced a compilation album of various artists entitled, [BAND_NAME], which featured several white musicians from the Greenwich Village area who played acoustic blues music in the style of black musicians. One of the featured artists on the album was a young guitarist named [PERSON_NAME_FULL_0_MALE], who was paid $75 for his two songs. Not long after the album's release, however, [PERSON_NAME_LAST_0] gave up his acoustic guitar for an electric one. The Beatles' arrival in the United States earlier in the year muted the folk and acoustic blues movement that had swept the US in the early [YEAR]s.\n",
      "Kalb formed the Danny Kalb Quartet in early [YEAR], with rhythm guitarist  [PERSON_NAME_FULL_2_MALE], [PERSON_NAME_FULL_0_MALE] on bass and drummer [PERSON_NAME_FULL_3_MALE]. When [PERSON_NAME_LAST_2] went to Europe during the summer, guitarist [PERSON_NAME_FULL_1_MALE] (like Kalb, a former pupil of guitarist Dave Van Ronk) joined as first a temporary replacement and then a permanent member. Later in [YEAR], the group added singer [PERSON_NAME_FULL_4_MALE] and changed its name to [BAND_NAME], as an allusion to Kalb's first foray on record.\n"
   ]
}