{
   "Name": "Blues Traveler",
   "rawData": [
      "Blues Traveler is an American rock band that formed in Princeton, New Jersey in 1987. The band's music spans a variety of genres, including blues rock, psychedelic rock, folk rock, soul, and Southern rock. They are known for extensive use of segues in live performances, and were considered a key part of the re-emerging jam band scene of the 1990s, spearheading the H.O.R.D.E. touring music festival.\n",
      "Currently, the group comprises singer and harmonica player John Popper, guitarist Chan Kinchla, drummer Brendan Hill, bassist Tad Kinchla, and keyboardist Ben Wilson. Tad Kinchla and Ben Wilson joined the band following the death of original bassist Bobby Sheehan in 1999.\n",
      "While Blues Traveler is best known among fans for their improvisational live shows, the general public is most familiar with the group from their Top 40 singles \"Run-Around\", \"Hook\", and \"But Anyway\". They gained mainstream popularity after their fourth studio album, four, released in 1994 and became a sleeper hit almost a year later. Sheehan's death and Popper's struggle with obesity put a damper on the group's success, and A&M dropped the band in 2002. In the years following, the band has bounced around through a succession of independent labels and record producers, and gotten increasingly experimental with their recorded output.\n"
   ],
   "infobox": {
      "Origin": [
         "Princeton, New Jersey, U.S."
      ],
      "Genres": [
         "Rock",
         "blues rock",
         "psychedelic rock",
         "folk rock",
         "jam band",
         "soul"
      ],
      "Years active": [
         "1987–present"
      ],
      "Labels": [
         "A&M",
         "Sanctuary",
         "429",
         "UD Factory"
      ],
      "Associated acts": [
         "Spin Doctors",
         "H.O.R.D.E.",
         "The John Popper Project"
      ],
      "Website": [
         "bluestraveler.com"
      ],
      "Members": [
         "John Popper",
         "Chan Kinchla",
         "Brendan Hill",
         "Tad Kinchla",
         "Ben Wilson"
      ],
      "Past members": [
         "Bobby Sheehan"
      ]
   },
   "albums": [
      "Blues Traveler",
      "Travelers and Thieves",
      "Save His Soul",
      "four",
      "Straight On till Morning",
      "Bridge",
      "Truth Be Told",
      "¡Bastardos!",
      "Cover Yourself",
      "North Hollywood Shootout",
      "Suzie Cracks the Whip",
      "Blow Up the Moon",
      "Hurry Up & Hang Around"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band that formed in Princeton, New Jersey in [YEAR]. The band's music spans a variety of genres, including blues rock, psychedelic rock, folk rock, soul, and Southern rock. They are known for extensive use of segues in live performances, and were considered a key part of the re-emerging jam band scene of the [YEAR]s, spearheading the H.O.R.D.E. touring music festival.\n",
      "Currently, the group comprises singer and harmonica player John Popper, guitarist [PERSON_NAME_FIRST_2] [PERSON_NAME_LAST_0], drummer Brendan Hill, bassist [PERSON_NAME_FULL_0_MALE], and keyboardist Ben Wilson. [PERSON_NAME_FULL_0_MALE] and Ben Wilson joined the band following the death of original bassist [PERSON_NAME_FULL_1_MALE] in [YEAR].\n",
      "While [BAND_NAME] is best known among fans for their improvisational live shows, the general public is most familiar with the group from their Top 40 singles [SONG_NAME]. They gained mainstream popularity after their fourth studio album, four, released in [YEAR] and became a [GENRE] a year later. Sheehan's death and Popper's struggle with obesity put a damper on the group's success, and A&M dropped the band in [YEAR]. In the years following, the band has bounced around through a succession of independent labels and record producers, and gotten increasingly experimental with their recorded output.\n"
   ]
}