{
   "Name": "Blues Traveler",
   "Sections": [
      "1 History",
      "1.1 Formation",
      "1.2 Early years",
      "1.3 First albums",
      "1.4 Mainstream breakthrough",
      "1.5 Sheehan's death and new lineup",
      "1.6 Independent years",
      "1.6.1 2010s",
      "2 Concert recordings",
      "3 Independence Day shows at Red Rocks",
      "4 Members",
      "5 Discography",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Blues Traveler is an American rock band that formed in Princeton, New Jersey in 1987. The band's music spans a variety of genres, including blues rock, psychedelic rock, folk rock, soul, and Southern rock. They are known for extensive use of segues in live performances, and were considered a key part of the re-emerging jam band scene of the 1990s, spearheading the H.O.R.D.E. touring music festival.\n",
         "Currently, the group comprises singer and harmonica player John Popper, guitarist Chan Kinchla, drummer Brendan Hill, bassist Tad Kinchla, and keyboardist Ben Wilson. Tad Kinchla and Ben Wilson joined the band following the death of original bassist Bobby Sheehan in 1999.\n",
         "While Blues Traveler is best known among fans for their improvisational live shows, the general public is most familiar with the group from their Top 40 singles \"Run-Around\", \"Hook\", and \"But Anyway\". They gained mainstream popularity after their fourth studio album, four, released in 1994 and became a sleeper hit almost a year later. Sheehan's death and Popper's struggle with obesity put a damper on the group's success, and A&M dropped the band in 2002. In the years following, the band has bounced around through a succession of independent labels and record producers, and gotten increasingly experimental with their recorded output.\n",
         "Blues Traveler's latest album, Hurry Up and Hang Around, was released in the fall of 2018.\n"
      ]
   },
   "History": {
      "Formation": {
         "text": [
            "The genesis of Blues Traveler was as a high school garage band formed in Princeton, New Jersey in the mid-1980s. Harmonicist, singer and guitarist John Popper and drummer Brendan Hill formed a group they called The Establishment (later renamed Blues Band) with Hill's brother on bass and a rotating roster of guitarists. The band produced a few cassette tape demos. In addition to some original songs, their repertoire included upbeat covers of \"Gloria\" and \"The Battle Hymn of the Republic\".\n",
            "The group added guitarist and football player Chan Kinchla. Although he was a promising athlete, Kinchla decided to commit to playing music instead after a knee injury. Popper met bassist Bobby Sheehan and the two became good friends, with Sheehan becoming the new bass player for Blues Band in 1987.[1]\n",
            "The quartet held a basement jam session (later christened The Black Cat Jam) which spawned the core grooves for several songs on their first album. A black cat happened to be nearby, and the group took this as a sign and adopted the Black Cat as their mascot figure.\n",
            "The group changed their name to Blues Traveler, taking the latter part from the name of the primary demon in the film Ghostbusters, Gozer the Traveler.[1]\n"
         ]
      },
      "Early years": {
         "text": [
            "After graduating from Princeton High School and moving to New York City, Popper, Hill, and Sheehan enrolled in the music program at The New School while Kinchla attended New York University. After much encouragement by friend David Gonzales, Blues Traveler began playing gigs along the New York-area club circuit, sometimes nightly;[1] the most prominent contract was playing Wednesday nights at a club called the Wetlands.[2][3] Another bar, The Nightingale, was a regular gig, and later became the setting for the song \"Defense and Desire\".[4][5]\n",
            "The group shared an apartment on Bergen Street[3] in Brooklyn, New York, along with their high school friend, singer Chris Barron.[2][6] A second band that Popper and Hill founded, called The Trucking Company, soon became The Spin Doctors with Barron as their frontman.[2] The two groups would often share the stage, playing non-stop concerts of multiple sets.[5] Their first show together was at a Columbia University fraternity party and their second was at a Jamaican-themed restaurant near Times Square in New York City. During this time, Blues Traveler acquired a devout follower, Gina-Z (subject of the band's song \"Gina\") who first became an unofficial \"band mom\" and later a tour manager, and is involved with the group's business to the present day.[7]\n",
            "At one New York show they were discovered by an A&M Records talent scout, Patrick Clifford, and the band signed their first recording contract. By 1990 all members had dropped out of college classes.[6] The group also attracted the attention of David Graham, son of the world-famous concert promoter Bill Graham, and David Graham became the group's manager. Blues Traveler then started a relentless touring schedule, expanding their reach up and down the east coast.\n"
         ]
      },
      "First albums": {
         "text": [
            "Blues Traveler released their self-titled debut album in 1990,[8] with the song \"But Anyway\" getting airplay on college radio stations. The album included Joan Osborne on backing vocals on two tracks.\n",
            "A second album, Travelers and Thieves, followed in 1991.[9] Upon Bill Graham's death that year, they released a live EP, On Tour Forever,[8] as a tribute to Graham, which featured guitarist Carlos Santana.\n",
            "Around this time, the mainstream national audience was exposed to Blues Traveler by television host David Letterman,[8] who has introduced them as \"[his] favorite band\". The band has since made more appearances on The Late Show than any musical artist. Letterman's band leader Paul Shaffer has played on a number of Blues Traveler recordings.\n",
            "In 1992, the group founded the H.O.R.D.E. festival as an alternative to others such as Lollapalooza, along with other bands such as Phish and Spin Doctors. Blues Traveler began recording their third album, Save His Soul. Recording was temporarily interrupted by John Popper's motorcycle accident, although the band resumed touring shortly thereafter with Popper in a wheelchair.[8] Two singles were released from the album, \"Defense & Desire\" and \"Conquer Me\", which reached No. 34 on the Mainstream Rock Tracks chart.\n"
         ]
      },
      "Mainstream breakthrough": {
         "text": [
            "The band's fourth album, titled four, was produced by the team of Michael Barbiero and Steve Thompson and released in late 1994. The upbeat pop single \"Run-Around\" became the group's first chart hit followed by the \"Hook\". \"Run-Around\" won a Grammy Award and broke a record for most weeks on the chart.[10][11]\n",
            "Blues Traveler appeared at Woodstock '94 and later became an opening act for The Rolling Stones. The band played on the 1995 season premiere of Saturday Night Live as a last-minute replacement for Prince. They were featured in an episode of the sitcom Roseanne, and later recorded the show's theme song for its final season. The 1996 comedy film Kingpin featured the group playing their song \"But Anyway\" during the closing credits.\n",
            "The group recorded the Johnny Rivers song \"Secret Agent Man\" for the film Ace Ventura: When Nature Calls at Icon Recording Studios in St. Louis, Missouri and the Bob Seger song \"Get Out of Denver\" for the film Things to Do in Denver When You're Dead, as well as Fats Domino's \"I'm Walkin'\" for Rebel Highway: Cool and the Crazy. Several previously recorded Blues Traveler songs were included on film soundtracks, including The Last Seduction, Speed, Very Bad Things, White Man's Burden, and The Truth About Cats & Dogs. The band also appeared in the film Blues Brothers 2000 and on its soundtrack, playing \"Maybe I'm Wrong\", an original composition with a classic blues-rock sound. Blues Traveler recorded the Sly & the Family Stone song \"I Want to Take You Higher\" for the NORML compilation album Hempilation and the John Lennon song \"Imagine\" for the Lennon tribute album Working Class Hero. The original song \"Christmas\" was included on the benefit album A Very Special Christmas 3.\n",
            "The double live album Live from the Fall was released in 1996. It featured recordings from the band's autumn 1995 concerts and showcased the strength of the band's live performances.\n",
            "The next studio album, Straight On till Morning, also produced by Barbiero/Thompson, was released in 1997. It achieved platinum status, reaching number 11 on the Billboard 200 albums chart, but did not perform as well as four. The single \"Carolina Blues\" peaked at number four on the Mainstream Rock Tracks.\n",
            "By the end of 1998, the band had prepared a concept album called The Sun, The Storm and The Traveler, based on Aesop's fable of The North Wind and the Sun, and they planned to record it after a recess in the fall of 1999. That summer, John Popper had emergency heart surgery due to artery blockage, forcing the band to cancel their annual July 4th Red Rocks shows at the last minute.\n",
            "During the hiatus, Popper released a solo album with a backing band consisting of Dave Matthews Band drummer Carter Beauford and members of the group Cycomotogoat.\n",
            "The band made an appearance performing as themselves in the 1998 movie Blues Brothers 2000 and the 1999 independent film Wildflowers, which had been filmed a couple of years earlier.\n"
         ]
      },
      "Sheehan's death and new lineup": {
         "text": [
            "On August 20, 1999, Bobby Sheehan was found dead in his New Orleans, Louisiana home, where he had been recording music with some friends the night before. Sheehan's death was ruled an accidental drug overdose, with cocaine, Valium, and heroin found in his system.\n",
            "The remaining members of Blues Traveler convened and agreed that Sheehan would have wanted them to continue as a band. Auditions for a new bassist were held in concert, and included Chan Kinchla's younger brother Tad, who was unanimously determined to be the best choice for the role. Additionally, an open call was sent for a permanent keyboard player, a role of which Sheehan had often been a proponent. In January 2000,[12] Ben Wilson of the jump blues band Big Dave & the Ultrasonics was chosen, and has since become a central contributor to the band's songwriting.\n",
            "The band discarded their concept album material, instead releasing a smaller online EP, Decisions of the Sky: A Traveler's Tale of Sun and Storm, and went to work collectively composing a new set of songs with the new lineup. The resulting album was Bridge, which had the working title Bridge Outta Brooklyn as a tribute to Sheehan (with both the acronym B.O.B. and his nickname \"Brooklyn Bobby\"). The songs \"Girl Inside My Head\" and \"Just for Me\" received airplay, but the album's sales fell somewhat short of expectations.\n",
            "The live album What You and I Have Been Through and the compilation Travelogue: Blues Traveler Classics were both released in 2002.\n"
         ]
      },
      "Independent years": {
         "2010s": {
            "text": [
               "In March 2012, Blues Traveler released a double-disc compilation titled 25 on Hip-O Records; the album commemorates the band's silver anniversary and includes their hit singles, new covers, and previously unreleased B-side material. It peaked at No. 49 in Canada.[15] The following studio album, Suzie Cracks the Whip, was released on June 26 of that year.[16]\n",
               "In September 2013, Blues Traveler signed with Las Vegas-based management firm, UD Factory.[17]\n",
               "On April 7, 2015, the band released their twelfth studio album, Blow Up the Moon which peaked at No. 29 on Independent Albums and No. 47 on Top Rock Albums Billboard charts.[18] As part of the album's promotion album, Blues Traveler released a music video using Rockstar editor in Grand Theft Auto V on September 14, 2015.[19] The music video features JC Chasez and 3OH!3. In 2016, Blues Traveler made a cameo appearance in the film The Meddler.[20] On December 7 the group released a cover version of \"Go Tell It on the Mountain\".[citation needed]\n",
               "In April 2017 the band announced a five-week U.S. tour to celebrate the 30th anniversary of the group's formation.[21] In May, social posts, and a video piece on Keyboard Magazine confirmed that of the band in the studio in Nashville, TN with record producer Matt Rollings.[22] The album Hurry Up & Hang Around was released on 12 October 2018 through BMG.\n",
               "On June 25, 2019, The New York Times Magazine listed Blues Traveler among hundreds of artists whose material was reportedly destroyed in the 2008 Universal fire.[23]\n"
            ]
         },
         "text": [
            "Blues Traveler were one of dozens of artists who were jettisoned as part of A&M's corporate restructuring. The band signed with Sanctuary Records for their next album, Truth Be Told, which achieved number 147 on The Top 200 chart.[citation needed] The band's 2003 Independence Day concerts at Red Rocks Amphitheatre were released on the CD Live on the Rocks and the DVD Thinnest of Air, and include Ziggy Marley singing on his father's song \"No Woman, No Cry\".\n",
            "The band left Sanctuary for Vanguard Records and released ¡Bastardos!, which was produced by Wilco's Jay Bennett and was touted as the band's return to music that they wanted to play. The album charted at 49 on the Independent Albums, and a live EP of songs from the album was released to independent record stores. The group recorded \"Rag Mama Rag\" for the 2007 tribute album Endless Highway: The Music of The Band, as well as \"Free Bird\" for Under the Influence: A Jam Band Tribute to Lynyrd Skynyrd.\n",
            "Blues Traveler have been featured on VH1's Behind the Music, A&E's Private Sessions,[13] and Austin City Limits. The group recorded the title track to the Sandra Boynton children's album Dog Train, which was also used as the promotional music for the American Kennel Club's National Championship event. The band's music has been used in video games (NASCAR 2000) and commercials (Busch Beer). The songs \"Business as Usual\" and \"Money Back Guarantee\" are used as transitional music on the public radio finance program Marketplace and its sister show Marketplace Money.\n",
            "In 2007, Blues Traveler released the album Cover Yourself, a \"best-of\" album of previously released songs re-recorded and reinterpreted with acoustic instrumentation. It was released October 30, 2007 through Columbia/Red Ink Records.[14] They did a national tour, with New Jersey-based singer/songwriter Lisa Bouchelle as opening act. After the tour John Popper and Lisa Bouchelle recorded the song \"Only The Tequila Talking\", which was released on her album Bleu Room with a Red Vase in 2010.\n",
            "Blues Traveler appeared at the 2008 Lollapalooza festival. At their June 2008 shows, the band debuted new songs off their new album North Hollywood Shootout (album). The album, which features a guest appearance by Bruce Willis, released in August 2008.\n"
         ]
      }
   },
   "Concert recordings": {
      "text": [
         "Blues Traveler allows and encourages fans to record and trade live performances,[24] provided that no money changes hands and no profit is made. The band has also given permission for live fan-made recordings to be hosted on websites such as Live Music Archive and eTree.org. Recordings available there span from 1986 through the present day.\n",
         "On more recent tours, they sell recordings of that very night's performance. Attendees can pre-purchase a copy of the show until 30 minutes into the performance and then pick up the CD after the show.\n"
      ]
   },
   "Independence Day shows at Red Rocks": {
      "text": [
         "Every year since 1994, with the exception of 1999 and 2020, Blues Traveler has headlined a show at Red Rocks Amphitheatre in Morrison, Colorado on the American Independence Day, July 4. The band usually plays two consecutive nights, starting on July 3.\n",
         "This tradition started in 1992 when Blues Traveler was opening for The Allman Brothers Band at the venue for two nights, July 3 and 4. The next year, the band booked the HORDE festival to play there on Independence Day, and in 1994 the current tradition began in earnest.\n",
         "These shows attract fans from all over the United States. The band frequently debuts new songs and brings back older songs, fallen out of rotation.\n",
         "The 2003 Independence Day concerts were recorded for a home video and live album release.\n"
      ]
   },
   "Members": {
      "text": [
         "Current\n",
         "\n",
         "Former\n",
         "\n",
         "Timeline\n"
      ]
   },
   "Discography": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Blues Traveler is an American rock band that formed in Princeton, New Jersey in 1987. The band's music spans a variety of genres, including blues rock, psychedelic rock, folk rock, soul, and Southern rock. They are known for extensive use of segues in live performances, and were considered a key part of the re-emerging jam band scene of the 1990s, spearheading the H.O.R.D.E. touring music festival.\n",
      "Currently, the group comprises singer and harmonica player John Popper, guitarist Chan Kinchla, drummer Brendan Hill, bassist Tad Kinchla, and keyboardist Ben Wilson. Tad Kinchla and Ben Wilson joined the band following the death of original bassist Bobby Sheehan in 1999.\n",
      "While Blues Traveler is best known among fans for their improvisational live shows, the general public is most familiar with the group from their Top 40 singles \"Run-Around\", \"Hook\", and \"But Anyway\". They gained mainstream popularity after their fourth studio album, four, released in 1994 and became a sleeper hit almost a year later. Sheehan's death and Popper's struggle with obesity put a damper on the group's success, and A&M dropped the band in 2002. In the years following, the band has bounced around through a succession of independent labels and record producers, and gotten increasingly experimental with their recorded output.\n",
      "Blues Traveler's latest album, Hurry Up and Hang Around, was released in the fall of 2018.\n"
   ]
}