{
   "Discography": {},
   "External links": {
      "Band press": {}
   },
   "References": {},
   "Sections": [
      "1 Discography",
      "2 References",
      "3 External links",
      "3.1 Band press"
   ],
   "Summary": {
      "text": [
         "The Brakes are a rock band formed in Philadelphia, Pennsylvania, United States in 2002.  The original five members were Zach Djanikian, Matt Kass, Derek Feinberg, Josh Sack, and Adam Flicker.  In 2006, they performed at SXSW Showcase, as well as many festivals such as All Good, High Sierra and Wakarusa.  Their national touring has also enabled them to share the stage with artists such as Dave Matthews Band, O.A.R., Willie Nelson, John Fogerty, Live, and Widespread Panic.\n",
         "The band has had multiple EP releases, regular rotation on station WXPN in Philadelphia, and near capacity headliners at TLA.  In 2002, The Brakes set the record for highest ticket sales at The Point in Bryn Mawr, Pennsylvania.[1]\n",
         "In early 2006, The Brakes joined forces with H&R Block and became the face of the company's \"TaxCut program\" advertising campaign.  The advertisements were featured on major national networks during shows like American Idol and The OC.   The \"TaxCut Program\"'s print campaign graced the back covers of Entertainment Weekly, Rolling Stone, and Us Weekly.[2]\n",
         "On Father's Day 2006, Djanikian was chosen to sing \"God Bless America\" during the seventh innings stretch at the Philadelphia Phillies game.\n",
         "Josh Sack, drummer for The Brakes, was diagnosed with acute myeloid leukemia in August, 2007 and he died on May 4, 2008, two days before the day of the release of their Hyena Records album, Tale of Two Cities.[3] The album is a tribute to Sack's life and a showcase of his talents as a performer.  Sack's successor, Spence Cohen, has been drumming with The Brakes since late April 2008.\n",
         "The Brakes are winners of the 8th annual Independent Music Awards Vox Pop vote for best Live Performance Album \"Tale of Two Cities\".\n"
      ]
   },
   "Title": "The Brakes - Wikipedia"
}