{
   "Name": "Brothers Past",
   "rawData": [
      "Brothers Past are an indie-electronic band from Philadelphia that has been called \"one of the most talked about independent acts in the nation.\" Since forming in 2000, the band has released three records and one EP, including the critically acclaimed This Feeling's Called Goodbye (SCI Fidelity Records) in 2005. The band has performed across the United States and Canada including appearances at Bonnaroo, SxSW, Wakarusa and Langerado. Brothers Past has been featured in Relix and their self-released albums have been reviewed in Urb Magazine, The Philadelphia Inquirer, Philadelphia Daily News and The Village Voice.\n",
      "The band was formed in 1998 by Tom Hamilton (vocals, guitar), Tom McKee (keyboards, vocals), Clay Parnell (aka \"Parnstar,\"bass, vocals), and Rick Lowenberg (drums). Hamilton and McKee have worked together since May 1998. After moving into a house together outside of West Chester, PA, the four musicians began writing material influenced by various elements of electronica (drum and bass, jungle, dub and house music.)  The band began a Thursday night residency at Rex's in West Chester, PA, where it performed weekly for almost two years, manned by Sean ford on the sound, building a small but dedicated following of fans. Not long after, the band began touring the East Coast and performing at regional festivals.\n",
      "Since then, Brothers Past toured nationally across the United States, playing more than 800 shows since their 2000 formation, including appearances at Wakarusa, Bonnaroo and SXSW. In the middle of 2006, it was announced that Lowenberg would be leaving the band to pursue environmental law and that Ilya Stemkovsky, formerly of OM Trio would take over for him. Stemkovsky performed with the band until Dec. 31, 2007, when the band announced a hiatus to focus on other interests. Hamilton and Parnell both turned their focus to side projects—Hamilton embraced his love of songwriting with the Americana-tinged stylings of American Babies and Parnell began working with world-renowned drummer Johnny Rabb as part of the drum and bass duo Biodiesel. McKee began teaching piano at the School of Rock in Downingtown, PA where he currently works as the school's Music Director.\n"
   ],
   "infobox": {
      "Origin": [
         "Philadelphia, Pennsylvania, USA"
      ],
      "Genres": [
         "Jam band, indie rock, electronica, progressive rock, livetronica[1]"
      ],
      "Years active": [
         "2000 – 2007, 2009 – 2014 (Hiatus)"
      ],
      "Labels": [
         "SCI Fidelity Records"
      ],
      "Website": [
         "www.brotherspast.com"
      ],
      "Members": [
         "Tom Hamilton",
         "Tom McKee",
         "Clay Parnell",
         "Rick Lowenberg (2000 - 2006, 2009)"
      ],
      "Past members": [
         "Ilya Stemkovsky (2006 — 2009)"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are an [GENRE] band from Philadelphia that has been called \"one of the most talked about independent acts in the nation.\" Since forming in [YEAR], the band has released three records and one EP, including the critically acclaimed This Feeling's Called Goodbye (SCI Fidelity Records) in [YEAR]. The band has performed across the United States and Canada including appearances at Bonnaroo, SxSW, Wakarusa and Langerado. [BAND_NAME] has been featured in Relix and their self-released albums have been reviewed in Urb Magazine, The Philadelphia Inquirer, Philadelphia Daily News and The Village Voice.\n",
      "The band was formed in [YEAR] by [PERSON_NAME_FIRST_1] Hamilton (vocals, guitar), [PERSON_NAME_FULL_1_MALE] (keyboards, vocals), Clay Parnell (aka \"Parnstar,\"bass, vocals), and [PERSON_NAME_FULL_0_MALE] (drums). Hamilton and [PERSON_NAME_LAST_1] have worked together since [MONTH] [YEAR]. After moving into a house together outside of West Chester, PA, the four musicians began writing material influenced by various elements of electronica (drum and bass, jungle, dub and house music.)  The band began a Thursday night residency at Rex's in West Chester, PA, where it performed weekly for almost two years, manned by Sean ford on the sound, building a small but dedicated following of fans. Not long after, the band began touring the East Coast and performing at regional festivals.\n",
      "Since then, [BAND_NAME] toured nationally across the United States, playing more than 800 shows since their [YEAR] formation, including appearances at Wakarusa, Bonnaroo and SXSW. In the middle of [YEAR], it was announced that Lowenberg would be leaving the band to pursue environmental law and that [PERSON_NAME_FULL_0_MALE], formerly of OM Trio would take over for him. [PERSON_NAME_LAST_0] performed with the band until [MONTH]. 31, [YEAR], when the band announced a [GENRE]"
   ]
}