{
   "Name": "Ryan Adams & the Cardinals",
   "Sections": [
      "1 History",
      "2 Band members",
      "3 Band members timeline",
      "4 Discography",
      "4.1 With Ryan Adams",
      "4.2 With Willie Nelson",
      "4.3 With Gin Wigmore",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Cardinals were an American rock band that were formed in 2004 by alternative country singer-songwriter Ryan Adams and fronted by him until 2009. The band was featured on Ryan Adams and the Cardinals albums, Cold Roses, Jacksonville City Nights, Follow the Lights, Cardinology and III/IV. Though credited as a solo Ryan Adams release, the 2007 album Easy Tiger also features the Cardinals.\n",
         "Regarding the band's name, Adams states that he \"suggested the Cardinals because it was my high school football team.\" [1]\n",
         "Along with their work with Adams, The Cardinals recorded an album with Willie Nelson in 2006, and following Adams' departure in 2009, The Cardinals recorded an album with singer-songwriter Gin Wigmore.[2]\n"
      ]
   },
   "History": {
      "text": [
         "The Cardinals first began as a duo when singer-songwriter Ryan Adams met J.P. Bowersock through his friend Ryan Gentles, manager of The Strokes, who were also Ryan Adams' neighbors in New York in 2001. J.P. Bowersock and Ryan Adams rehearsed and performed in New York at various clubs under the name The Cardinals and were eventually joined for a short time by G.E. Smith, of the SNL band fame during the late 1980s and 1990s.\n",
         "After recording the album, 29, Adams suggested to J.P. Bowersock that they might form a touring band. Brad Pemberton was the first member to join reuniting Ryan Adams and Pemberton who had toured together until Adams' Love is Hell album.  Following Pemberton, was Catherine Popper who initially played double bass for the band.\n",
         "The first touring lineup of Ryan Adams and the Cardinals consisted of Ryan Adams, Brad Pemberton, JP Bowersock, Catherine Popper, and Cindy Cashdollar. The band toured in 2004 and recorded Cold Roses. Cashdollar left in 2005. Jon Graboff was a hired replacement for the next two years until he became a full-time member for their final album as Ryan Adams and The Cardinals.\n",
         "The band toured worldwide without Cashdollar to promote Cold Roses, and during this period returned to the studio to record their second album, Jacksonville City Nights. Bowersock left after the album was recorded, and was replaced by Neal Casal.\n",
         "In 2006 Ryan Adams produced Willie Nelson's album Songbird and he and The Cardinals served as Nelson's backing band on the recordings.\n",
         "In 2006, Popper left the band and was replaced by Chris Feinstein prior to a European tour in 2006. In 2007, The Cardinals joined Ryan Adams to record his new album, Easy Tiger, and the album's producer, Jamie Candiloro, was added to the lineup on piano. Follow the Lights appeared later in the year, once again produced by Candiloro.\n",
         "Their final studio album, Cardinology, was released in October 2008, and, according to Pitchfork Media, Ryan Adams & the Cardinals may be known as simply \"The Cardinals\" from now on.[3]\n",
         "In January 2009, Adams announced that he would leave The Cardinals in order to \"step back\" from making music, citing hearing loss due to Ménière's disease as part of the reason for his decision. This move made drummer Brad Pemberton the only remaining original member of the band.[4][5][6]\n",
         "On March 20, 2009, The Cardinals played their final show with Adams, at the Fox Theatre in Atlanta, Georgia.\n",
         "In April 2009, when asked about the Cardinals' future, guitarist Neal Casal stated: \"I have absolutely no idea what the future holds. The Cardinals were the best band I've ever been in, and I would love to play with them again. Only time will tell what's going to happen. [...] I'll certainly miss it a lot.\"[7]\n",
         "In May 2009, drummer Brad Pemberton stated that: \"everyone was a bit fried, so it was the right time to step back for a minute. I encouraged Ryan to go and get married, and have a life and find some peace; the guy hasn’t really slowed down in ten years, and he needed it as much as we did. Ryan and I have shared too much and are too good of friends to not ever do anything again, but I think we all need to do our own thing for a minute.\"[8]\n",
         "In July 2009, it emerged that The Cardinals landed a gig with singer/songwriter Gin Wigmore in New Zealand. The band played on Wingmore's album Holy Smoke and performed with her live on numerous occasions.[2][9][10]\n",
         "On December 15, 2009, Cardinals' bassist Chris Feinstein died.\n",
         "In February 2010, Neal Casal published a book of tour photography titled Ryan Adams & the Cardinals: A View of Other Windows. The book documents his life on the road with Ryan Adams and the Cardinals.[11] On August 26, 2019, Casal died.\n"
      ]
   },
   "Band members": {},
   "Band members timeline": {
      "text": [
         "\n"
      ]
   },
   "Discography": {
      "With Ryan Adams": {},
      "With Willie Nelson": {},
      "With Gin Wigmore": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Cardinals were an American rock band that were formed in 2004 by alternative country singer-songwriter Ryan Adams and fronted by him until 2009. The band was featured on Ryan Adams and the Cardinals albums, Cold Roses, Jacksonville City Nights, Follow the Lights, Cardinology and III/IV. Though credited as a solo Ryan Adams release, the 2007 album Easy Tiger also features the Cardinals.\n",
      "Regarding the band's name, Adams states that he \"suggested the Cardinals because it was my high school football team.\" [1]\n",
      "Along with their work with Adams, The Cardinals recorded an album with Willie Nelson in 2006, and following Adams' departure in 2009, The Cardinals recorded an album with singer-songwriter Gin Wigmore.[2]\n",
      "The Cardinals first began as a duo when singer-songwriter Ryan Adams met J.P. Bowersock through his friend Ryan Gentles, manager of The Strokes, who were also Ryan Adams' neighbors in New York in 2001. J.P. Bowersock and Ryan Adams rehearsed and performed in New York at various clubs under the name The Cardinals and were eventually joined for a short time by G.E. Smith, of the SNL band fame during the late 1980s and 1990s.\n"
   ]
}