{
   "Name": "Chris Robinson Brotherhood",
   "rawData": [
      "Chris Robinson Brotherhood was an American blues rock band formed in 2011 by Black Crowes singer Chris Robinson while the Crowes were on hiatus. The original lineup consisted of Robinson (vocals, guitar), Neal Casal (lead guitar, backing vocals), Mark Dutton (bass guitar, backing vocals), George Sluppick (drums), and Adam MacDougall (keyboards). Since 2015, the band had undergone various personnel changes with Robinson and Casal remaining the only constant members. Following the death of Neal Casal in August 2019 the Chris Robinson Brotherhood announced it would disband.\n",
      "Chris Robinson Brotherhood began as an experiment but became a 'band' during their California residency tour. The original intention, according to Robinson, was to \"have a local L.A. band, just play in California, see where the music takes us and have a good time.\" They then embarked on a 118 date North American tour in 2011. Robinson names Grateful Dead members Phil Lesh and Bob Weir, who sat in with the band during CRB's run at the Great American Music Hall, as both musical inspirations and friends. As well as Robinson, the band features fellow Black Crowes member Adam MacDougall, Ryan Adams collaborator Neal Casal, bassist Mark Dutton, and drummer George Sluppick. Robinson describes the Brotherhood as a \"farm-to-table psychedelic band\".\n",
      "Chris Robinson Brotherhood released a version of \"Blue Suede Shoes\" (written by Carl Perkins) b/w a live version \"Girl, I Love You\" (written by Al Bell and Eddie Floyd) for Record Store Day on April 21, 2012. The CD version also features a cover of the Jimmy Reed song, \"Bright Lights Big City\".\n"
   ],
   "infobox": {
      "Also known as": [
         "CRB"
      ],
      "Origin": [
         "Los Angeles, California, United States"
      ],
      "Genres": [
         "Blues rock, psychedelic rock, southern rock, jam rock"
      ],
      "Years active": [
         "2011–2019"
      ],
      "Labels": [
         "Silver Arrow[1]"
      ],
      "Associated acts": [
         "The Black Crowes",
         "Phil Lesh and Friends",
         "The Cardinals"
      ],
      "Website": [
         "Official website"
      ],
      "Past members": [
         "Chris Robinson",
         "Neal Casal",
         "George Sluppick",
         "Mark Dutton",
         "Adam MacDougall",
         "Tony Leone",
         "Jeff Hill",
         "Joel Robinow"
      ]
   },
   "albums": []
}