{
   "Awards and nominations": {
      "text": [
         "Grammy Awards\n",
         "MTV Video Music Awards\n"
      ]
   },
   "Band members": {
      "text": [
         "Current members\n",
         "Touring members\n",
         "\n",
         "Former members\n",
         "\n",
         "Timeline\n"
      ]
   },
   "Discography": {
      "text": [
         "Studio albums\n"
      ]
   },
   "External links": {},
   "History": {
      "Crooked Teeth (2016–2018)": {
         "text": [
            "On January 26, 2016, Papa Roach announced that they will begin writing their new album the following week.[69] In July, they played live at the Alternative Press Music Awards.[70] In an interview they said, that the new record will be released in early 2017, with a first single appearing this year.[71] The recording of the album was supported through crowdfunding service PledgeMusic.[72]\n",
            "On November 1, 2016, \"Crooked Teeth\" was the first song to be released from the upcoming record.[73] The first official single, titled \"Help\" was released on February 17, 2017.[74] On March 24, 2017, the band announced the new album, Crooked Teeth to be released on May 19, 2017.[75] A second single, \"American Dreams\", was released in April 2017,[76] and a third single, \"Born for Greatness\", was released towards the end of the year.[77] \"Born for Greatness\" became the official main theme of WWE Raw in February 2018, replacing \"Enemies\" by Shinedown.[78] Both \"Help\" and \"Born for Greatness\" made it to #1 on the Mainstream Rock Charts, the first time the band had two songs off one album achieve the feat.[79]\n"
         ]
      },
      "Early years (1993–1995)": {
         "text": [
            "Papa Roach's formation began in January 1993, when lead singer Jacoby Shaddix and drummer Dave Buckner met on the Vacaville High School football field. They were later joined by lead guitarist Jerry Horton from nearby Vanden High School, trombonist Ben Luther and bassist Will James.[1] They decided to enter the school's talent show, performing a version of Jimi Hendrix's song \"Fire\". They ultimately ended up losing the talent show. In March 1993, Ben Luther left the band. At this point, Papa Roach was practicing every day and touring, playing every gig they could get. Their first tour van was called Moby Dick, where Shaddix was inspired to come up with his first stage name \"Coby Dick\". The band chose the name Papa Roach from the nickname of Shaddix's step-grandfather, Howard William Roatch.[2]\nIn 1994, Papa Roach released their first EP titled Potatoes for Christmas. Drummer Dave Buckner was temporarily replaced by Ryan Brown, as Buckner was spending the year in Seattle studying art. In 1995, they released a demo at Sound Farm Studios titled Caca Bonita. By this time Buckner was back. In 1996, they replaced original bassist Will James with longtime roadie Tobin Esperance, as James' involvement in a church summer camp would limit the band's summer practicing and touring.\n"
         ]
      },
      "F.E.A.R. (2014–2016)": {
         "text": [
            "On February 3, 2014 the band announced that they will be going into the studio, recording a new album.[57] On February 18, 2014 on Twitter Jerry stated that the first single should come out \"somewhere around July\".[58] They did a live studio chat on YouTube on February 25, 2014.[59] In the live chat they mentioned that they have already written 4 songs. They revealed the titles of three songs: 'Just As Broken As Me', 'Gravity' and 'War Over Me'. On April 24, 2014 on an interview for Loudwire Jacoby revealed a few more song titles from the upcoming album, the titles were 'Never Have To Say Goodbye' and 'Face Everything and Rise'.[60]\n",
            "On July 10, 2014, it was announced that the band will release their new album, titled F.E.A.R., in early 2015.[61][62] On October 9, 2014, it was announced that the new album will release on January 27, 2015 via Eleven Seven Music.[63][64] During an interview, bassist Tobin Esperance has admitted that the new release is heavier than previous albums and describes how F.E.A.R. is the first time they've allowed other artists to feature on their records.[65]\n",
            "On May 19, 2015, The band announced a co-headlining North American Tour with longtime friends Five Finger Death Punch. They will be accompanied by In This Moment as special guests with support from From Ashes To New for the tour.[66][67][68]\n"
         ]
      },
      "Mainstream success, Infest, Lovehatetragedy and Getting Away With Murder (2000–2005)": {
         "text": [
            "After signing with DreamWorks Records in October 1999, they immediately entered the studio to record their major-label debut  album titled Infest.[4][5] The album included old songs from their independent releases, these being \"Infest\", \"Last Resort\", \"Broken Home\", \"Dead Cell\" from the Warner Bros. demo CD; \"Revenge In Japanese\" as \"Revenge\" and \"Thrown Away\" from their 5 Tracks Deep EP; \"Legacy\", \"Binge\", \"Snakes\", and a softer version of the originally heavier \"Tightrope\" from the Let 'Em Know EP; which were re-recorded, and three additional newly written songs: \"Obsession\" (later known as \"Between Angels and Insects\"), \"Blood Brothers\", and \"Never Enough\". Infest was released on April 25, 2000, and sold 30,001 copies in its first week of release.[6]\n",
            "With their second album released, and the music video for \"Last Resort\" recorded, they embarked on the Vans Warped Tour and numerous other large tours, including the Anger Management Tour with Limp Bizkit and rap acts such as Eminem, E-40, Xzibit, and Ludacris.[7][8] They embarked on their headlining \"Master Bay\" tour in 2000, with support from Linkin Park and Hed PE.[9] The band was nominated for \"Best New Artist in a Video\" at the 2000 MTV Video Music Awards for \"Last Resort\".[10]\n",
            "In late 2000, they toured the United Kingdom, highlighting how quickly their popularity had spread worldwide. In 2001, the band toured Ozzfest, where they performed on the prestigious main stage, on both the United States and United Kingdom tours.[11] The song \"Blood Brothers\" was also featured on the popular video game Tony Hawk's Pro Skater 2.[12]\n",
            "After touring worldwide, the band returned to the studio to record their third album which was to be titled Born to Rock, but was later renamed to Lovehatetragedy.[13] The album was released in the United States on June 18, 2002, and though it did not outsell Infest, it managed to chart higher in both the United States and United Kingdom album charts. The album has sold over 500,000 copies and has been certified gold.[14] The album features a bigger focus on singing over rapping, though the band retained their nu metal sound. The album had two singles which were She Loves Me Not and  Time and Time Again, both had rapping and both had the rap metal sound of Infest.[15] The music video for the single \"Time and Time Again\" was featured on the Pepsi Blue commercial.[16] In 2002, Papa Roach also embark on some tours including the second Anger Management Tour in 2002.[17] The tour from Lovehatetragedy was from 2002 to early of 2003.\n",
            "In late 2003, Papa Roach wrote and recorded their third album with the working title Dancing In the Ashes, but released as Getting Away with Murder.[18] The band worked with well-recognized producer Howard Benson.[18] After completion, the band filmed a music video for the title track, \"Getting Away with Murder\", and went on a small summer club tour to warm-up for the tours that would follow.[19] The album introduced a different approach for the band, becoming their first album not to feature the nu metal style of their previous albums.[20] It was also the band's first album not to feature rapping.[20] Getting Away with Murder outsold Lovehatetragedy, mainly due to the popularity of the album's second single, \"Scars\". To date, the album has sold over one million copies and has been certified Platinum. On November 9, 2004, the band released their fifth EP, Rolling Stone Original, an EP only available digitally.[21] On November 22, 2005 they released their first live album, Papa Roach: Live & Murderous in Chicago.[22]\n",
            "In 2005, the band spent much of their time on tour. This included a full United States and European tour alongside bands such as Dead Poetic, Trust Company, Chronic Future, Skindred, 311 and Unwritten Law.[23][24][25]\n"
         ]
      },
      "Metamorphosis and tours (2008–2010)": {
         "text": [
            "In an interview in February 2008 with 99.7 The Blitz, Shaddix stated that the band was working on their next album, which was to be titled Days of War, Nights of Love. However, the album was renamed to Metamorphosis to mark the band's tenth anniversary of signing with DreamWorks Records in 1999 and all of the changes the band had experienced in that time.\n",
            "On April 15, Papa Roach announced they would be touring as part of Mötley Crüe's Crüe Fest, along with  Buckcherry, Sixx:A.M., and Trapt. The tour began on July 1 in West Palm Beach, Florida.[30] The release date for the album was confirmed as August 26 during Crüe Fest.\n",
            "The band also went on tour with Seether, Staind, and Red later in the year. They changed the release date of Metamorphosis to March 24, 2009 during that tour.\n",
            "On October 26, Papa Roach released the music video for the song, \"Hollywood Whore\", which was released as an EP in Canada and as a digital single on October 28. The album's first official single, \"Lifeline\", was released on the band's MySpace profile on January 9, 2009. The band also went on tour with Buckcherry, Avenged Sevenfold, and Burn Halo in early 2009. The Crüe Fest DVD was released on March 24, the same day Metamorphosis was released. The second single, \"I Almost Told You That I Loved You\", was released on June 1. On June 23, they released their ninth EP, Naked and Fearless: Acoustic EP. The EP is available through the Zune Marketplace, iTunes, and Rhapsody.\n",
            "\"Metamorphosis\" made it to top 10 on the Billboard 100, reaching number 8, the band's first top ten album since 2002.[31]\n",
            "Papa Roach toured with Nickelback on their Dark Horse Tour through Live Nation outdoor amphitheater's along with Hinder and Saving Abel in the summer, and ever Breaking Benjamin.\n",
            "\"Lifeline\" was nominated for Fuse TV's Best Video of 2009 contest, beating Metallica's \"All Nightmare Long\", Daughtry's \"No Surprise\", Shinedown's \"Sound of Madness\", and Paramore's \"Ignorance\", before finishing 2nd to Britney Spears for her song \"Circus\" in the final round.\n"
         ]
      },
      "Old Friends from Young Years and record deal (1996–1999)": {
         "text": [
            "On February 4, 1997, the band produced their debut studio album, entitled Old Friends from Young Years. Still touring heavily, they supported bands such as Incubus, Powerman 5000, Hed PE, Snot, Far, and Static-X.\n",
            "In 1998, they released an EP titled 5 Tracks Deep. It sold more than 1,000 copies in its first month of release. In 1999, they produced another EP, which would end up being their last independent release, titled Let 'Em Know. Its success caught the attention of Warner Music Group, who as part of a development deal provided a small amount of money for the production of a five-track promo-demo CD.[3] The band decided they wanted influential rock producer Jay Baumgardner on board to produce the record.[3] In an interview with HitQuarters, Baumgardner said, “At first I wasn’t really convinced it would work out, but then I saw a video of them performing at a club - I saw all these kids going wild, knowing the songs by heart - and that’s when I realized that they definitely had potential.”[3]\n",
            "Warner Bros. was not impressed with the demo, and elected not to sign them.[3] The unreleased disc included the songs \"Infest\", \"Last Resort\", \"Broken Home\", \"Dead Cell\", and \"She Loves Me Not\".\n",
            "Soon after, DreamWorks Records offered the band a recording contract.\n"
         ]
      },
      "The Connection (2012–2013)": {
         "text": [
            "Papa Roach entered the studio on November 2011 to work on their next album,[42] aiming for a mid-2012 release.[43] While in the studio, the band released the single, \"Even If I Could\", which appeared in The Avengers soundtrack.[44]\n",
            "On June 15, 2012 the band announced in a live chat with fans on YouTube that the next album would be released on October 2.[45] The album was later given the name, \"The Connection\".[46]\n",
            "Papa Roach started off touring for 2012 Co-Headlining dates with Shinedown, along with other supporting acts such as Adelitas Way and In This Moment. Following up the short Co-Headliner, Papa Roach headed out on a short headlining tour bringing out bands such as In This Moment, Art of Dying, and Mindset Evolution. Papa Roach participated on the main stage of the 2012 Uproar Festival alongside Shinedown, Godsmack, Staind, and Adelitas Way.[47][48]\n",
            "The band released their first music video for the album on August 30, 2012.[49] The video idea for Still \"Swingin'\" came from Jacoby's 8-year-old son.[50]\n",
            "On September 8, 2012, Papa Roach announced dates in Belarus, Russia, Poland, Italy, Switzerland, Germany, Netherlands, Belgium and the UK.[51] They will be playing two dates (December 10 and 11) in London co-headlining with rockers Stone Sour on their UK tour.[52] They only played on those two dates of the tour. They then toured the United States with Stone Sour starting on January 20, 2013,[53] and played at 2013 Download Festival at Donington Park, UK on the Main Stage on Friday, June 14.[54] In September, the band was rejoined by original drummer Buckner for a one-off performance of \"Last Resort\".[55] October 2013 saw the band perform across Canada and the US in support of The Connection with Pop Evil and Age of Days also on the bill.[56]\n"
         ]
      },
      "The Paramour Sessions and Buckner's departure (2006–2008)": {
         "text": [
            "On September 12, 2006 Papa Roach released their fourth album The Paramour Sessions. The band named the title after the recording location, the Paramour Mansion. The band came up with the idea of doing an album in a mansion while they were recording Getting Away with Murder, Shaddix stated that recording in a manor was becoming popular for the unique sound and feeling it generates (which is reflected on the lyrics). \"...To Be Loved\" was the first single to be released from the album, and was the official theme song for WWE Raw from 2006 to 2009 until it was replaced by \"Burn It to the Ground\" by Nickelback. The album continued in an alternative rock-based direction but still contained softer ballads akin to Getting Away with Murder. The album debuted at No. 16 on the Billboard 200 Charts.\n",
            "The band started touring in support of the album in August 2006, with an American tour followed by another in Europe. In October 2006, Papa Roach toured with bands such as Guns N' Roses, during their Chinese Democracy tour, and Deftones throughout the United States, having major success. They were also the special guest band during the Zippo Hot Tour with Hed PE and Stealing December.\n",
            "On October 10, 2006 a String Quartet tribute album entitled Perfect Murder: Strung Out on Papa Roach was released by Vitamin Records.[26]\n",
            "The band originally planned to release a compilation of acoustic recordings for their songs, such as \"Forever\", \"Scars\", and \"Not Coming Home\", which was recorded for KROQ-FM's charity Christmas album, Kevin and Bean's Super Christmas. The acoustic compilation was later shelved. In an interview with billboard.com,  Shaddix stated that he didn't think fans were ready for an acoustic direction from the band.[27]\n",
            "On April 25, 2007, it was announced that drummer Dave Buckner would be sitting out the band's touring schedule due to personal matters. He was expected to rejoin the group shortly afterwards.  Shaddix later confirmed in an interview with Launch Radio Networks that Dave had entered rehab to \"go clean his act up 'cause he was out of his mind.\" Unwritten Law drummer Tony Palermo filled in on drums.[28]\n",
            "In the summer of 2007 the band went on the Bad Boys of Rock tour, supporting Hinder. During the tour frontman Shaddix and Hinder lead singer Austin John created a very tight friendship, causing the band to tour with Hinder on multiple tours in later years. It was revealed in 2015 that Shaddix and Austin wrote and recorded a song together for a part of Austin John's solo project, although the two said they were not for sure if the song would ever see the light of day.[29]\n",
            "On January 28, 2008 Shaddix announced on Papa Roach's MySpace that Buckner would officially be parting ways with Papa Roach for good. He stated that Dave was still trying to get his life back together. Shaddix also mentioned that the band would be going back to the Paramour Mansion to begin work on their fifth studio album.\n",
            "On July 17, the band released their sixth EP, Live Session (iTunes Exclusive). On July 24, they released their seventh EP, Hit 3 Pack: Forever. Both EPs are available exclusively through iTunes.\n"
         ]
      },
      "Time for Annihilation (2010–2012)": {
         "text": [
            "On January 8, 2010, Shaddix announced on Papa Roach's official Twitter account that the band was about to start working on new material.[32] On February 8, Jerry Horton said that he was at the studio starting to write.\n",
            "On February 23, Jerry Horton officially announced that the band were releasing a new album, which was recorded on the last run of their 2009 co-headlining tour with Shinedown at the Binghamton, New York.[33]\n",
            "In April, the band played two new songs, \"Burn\" at the Chili Cook Off in Richmond, Virginia on April 17, and \"Kick In the Teeth\" on April 30. In May, Jerry Horton said in an interview that the name of the album would be Time for Annihilation, and would feature nine live tracks and five new songs, making it a combined live album and an EP. He also said that the first single would be \"Kick In the Teeth\" and that the band switched labels to Eleven Seven Music.[34] Later, Shaddix added on that the album would be released on August 31.[35] \"Kick In the Teeth\" was released as a single on June 22.[36]\n",
            "On June 29, the band's former label, Geffen Records, released a greatest hits compilation of the band's biggest hits, titled ...To Be Loved: The Best of Papa Roach. The band, however, told fans not to buy it, saying that the band was making no money off of the album's sales and that the label released the album against the band's will.[37] Masters and/or copyrights by Papa Roach are represented by Downtown Music Publishing.[38] The band no longer owns the rights to their songs, but continue to play them live.\n",
            "Time for Annihilation was released on August 31. The band announced that the next singles from the album would be \"Burn\" and \"No Matter What\". They also said they were interested in releasing another live DVD, but wanted to wait until they had a headlining show in Europe. In October, Papa Roach began the \"Monsters of Annihilation\" tour with Skillet. From November 15 to December 13, The band toured with Disturbed, Buckcherry and Halestorm on the Taste of Chaos tour, and from March 1 to 18, Papa Roach co-headlined the Canada leg of the Jägermeister Music Tour with Buckcherry, and special guests My Darkest Days and Bleeker Ridge.\n",
            "In an interview, guitarist Jerry Horton said that the band was going to release a new album in 2012. He also mentioned that Papa Roach would explore \"electronic sounds\" for this upcoming release.[39]\n",
            "In an interview with Upvenue, Tobin Esperance said of Time for Annihilation that \"We put out five major label, full-length records, and we were transitioning from a major label, going independent, and we wanted to do something different [...] we'd always talked about doing a live record, and it turned into 'let's add a couple of bonus songs' [...] and now it's half live, half new songs and it's kind of the past and present of Papa Roach, and I think it's a good representation and a good reminder of what this band's about, [...] and it gives you a look at where our sound can go.\"[40]\n",
            "Starting April 25, Papa Roach headlined the Raid The Nation tour, the first leg consisting of Finger Eleven, and the second leg with Escape the Fate, both legs of the tour also had special guests Pop Evil. On June 23 and 25, the band co-headlined the Sonisphere Festival with Linkin Park.\n",
            "Papa Roach played two intimate shows in London and Sheffield in July with the band Yashin.[41] They also co-headlined the Rock Allegiance Tour from August 24 to September 25 with Buckcherry. Also on the tour was Puddle of Mudd, P.O.D., Red, Crossfade, and Drive A.\n"
         ]
      },
      "Who Do You Trust? and Greatest Hits: Vol, 2 - The Better Noise years (2018–2021)": {
         "text": [
            "In October 2017, the band revealed they had already written six songs for the follow up to Crooked Teeth,[80] with plans to start work on recording the album in June 2018.[81] On October 5, 2018, Papa Roach released two singles, entitled \"Renegade Music\" and \"Who Do You Trust?\", with the latter being accompanied by a music video, where frontman and vocalist Jacoby Shaddix stars as news reporter Larry Dickman.[82] Later, information leaked that the new album will be called Who Do You Trust? and will be released on January 19, 2019. An interview with Papa Roach from November 9 confirmed this. On November 16, 2018, the band released the new song \"Not the Only One\".[83] A third single, \"Come Around\", was released in September 2019.\n"
         ]
      }
   },
   "Musical style and influences": {
      "text": [
         "Papa Roach has been described as alternative metal,[84] alternative rock,[85] hard rock,[86] nu metal,[86][87] and rap metal.[88] In their early independent releases and on their first two major label albums, Infest and Lovehatetragedy, the band tended to use nu metal and rap metal.[88][89][90] Before Papa Roach released their major label albums, Jacoby Shaddix's singing style was compared to Chino Moreno and Lynn Strait of Snot. Additionally, with their 2009 album, Metamorphosis, as the name expresses, the band felt that their music was going through a transformation to \"stuff that's...harder and faster\".[91] Allmusic has compared the band's recent work to 1980s glam metal,[84][92] Allmusic staff writer Stephen Thomas Erlewine wrote \"At the close of the 2000s, the quartet has shed the rap and the angst, ditching all the alt-metal accoutrements to become a knowing update of an '80s Sunset Strip sleaze rock outfit.\"[84] With the release of F.E.A.R., both MetalSucks and Metal Injection noted that the band has acquired some djent influences.[93][94]\n",
         "In 2004, frontman Jacoby Shaddix said the following in an interview with the Dallas Music Guide regarding the band no longer using rapping in their music: \"...the rapping's gone! I don't feel like rapping. I'm just over that...I just want to be a rocker. It's what I wanted to be when I was a kid\". Shaddix has added this remark in another interview: \"We’re a band that tries to walk that line between metal, hardcore, punk rock and pop music, and we do our best at trying to make it all cool\".[95]\n",
         "Prior to the release of The Connection, guitarist Jerry Horton said in an interview by VerdamMnis Magazine that \"It's kind of a natural thing for us, we've always been changing throughout the years. Of course, there are some things that stay the same in our sound but we do like to try new things to sort of stretch out a little bit our basis and therefore make it more interesting\". He also said that the band was going to explore \"electronic sounds for the next record\".[39]\n",
         "The band's influences include Faith No More, Social Distortion, Metallica, Red Hot Chili Peppers, Wu-Tang Clan, Fugees, Refused, Queen, and Led Zeppelin.[96][97][98][99] Jacoby Shaddix acknowledges Faith No More's Mike Patton and Social Distortion's Mike Ness as major influences, stating that \"the way that I sing, I definitely was inspired by Mike Patton\", \"but I like the storytelling that Mike Ness does so I kind of fused both those two guys together at an early age, and it inspired me to become my own thing.\"[96]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Early years (1993–1995)",
      "1.2 Old Friends from Young Years and record deal (1996–1999)",
      "1.3 Mainstream success, Infest, Lovehatetragedy and Getting Away With Murder (2000–2005)",
      "1.4 The Paramour Sessions and Buckner's departure (2006–2008)",
      "1.5 Metamorphosis and tours (2008–2010)",
      "1.6 Time for Annihilation (2010–2012)",
      "1.7 The Connection (2012–2013)",
      "1.8 F.E.A.R. (2014–2016)",
      "1.9 Crooked Teeth (2016–2018)",
      "1.10 Who Do You Trust? and Greatest Hits: Vol, 2 - The Better Noise years (2018–2021)",
      "2 Musical style and influences",
      "3 Band members",
      "4 Discography",
      "5 Awards and nominations",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "\n",
         "Papa Roach is an American rock band from Vacaville, California, formed in 1993. The original lineup consisted of lead vocalist Jacoby Shaddix, guitarist Jerry Horton, drummer Dave Buckner, bassist Will James, and trombonist Ben Luther.\n",
         "After two EPs, James left and was replaced by Tobin Esperance. The band independently released two more EPs before signing with DreamWorks Records in 1999. It released the triple-platinum Infest in 2000, the gold album Lovehatetragedy in 2002 and the platinum album Getting Away with Murder in 2004. A year after The Paramour Sessions, Buckner left in 2007, and was replaced by Tony Palermo. They then made Metamorphosis (2009), Time for Annihilation (2010), The Connection (2012), F.E.A.R. (2015),  and Crooked Teeth (2017). The tenth studio album, Who Do You Trust?, was released on January 18, 2019.\n",
         "Papa Roach has sold more than 30 million album copies worldwide and are known for their songs \"Last Resort\", \"Between Angels and Insects\", \"She Loves Me Not\", \"Getting Away with Murder\", \"Scars\", \"Forever\", \"Lifeline\", \"Face Everything and Rise\" and \"Help\".\n"
      ]
   },
   "Title": "Papa Roach - Wikipedia"
}