{
   "Name": "Clutch (band)",
   "rawData": [
      "Clutch is an American rock band from Germantown, Maryland. Since its formation in 1991, the band line-up has included Tim Sult (lead guitar), Dan Maines (bass), Jean-Paul Gaster (drums), and Neil Fallon (vocals, rhythm guitar, keyboards). To date, Clutch has released twelve studio albums, and several rarities and live albums. Since 2008, the band have been signed to their own record label, Weathermaker.\n",
      "Clutch was formed in 1991 by Dan Maines (bass), Jean-Paul Gaster (drums), Tim Sult (guitar), and Roger Smalls (vocals) in Germantown, Maryland. Before settling on the name Clutch, the band used the early names Glut Trip and Moral Minority. Smalls soon departed and was replaced by Neil Fallon, a longtime schoolmate of the other members at Seneca Valley High School. The band quickly gained notice through constant touring. The 12\" single Passive Restraints on the Earache label was Clutch's first commercial release, garnering attention from other labels. Their debut LP, Transnational Speedway League, was released in 1993. It was followed by a self-titled album two years later that gained Clutch mainstream exposure. The band moved to the larger Columbia label for the 1998 album The Elephant Riders. They followed it in 1999 with a self-released groove-based album Jam Room.\n",
      "The album Pure Rock Fury was released by Atlantic Records in 2001. The title track was initially released as the first single. The program director for North Carolina rock station WXQR (Rock 105), Brian Rickman, suggested that the label switch singles to another track from the album, \"Careful with That Mic\". Atlantic did so, and Clutch achieved a surprise hit single. The follow-up tracks, \"Immortal\" and \"Open Up the Border\", were also well received by American rock stations. In 2003 they issued Live at the Googolplex and the rarities record Slow Hole to China.\n"
   ],
   "infobox": {
      "Origin": [
         "Germantown, Maryland, U.S."
      ],
      "Genres": [
         "Hard rock[1]",
         "stoner rock[2][3]",
         "blues rock",
         "alternative metal[4]",
         "funk metal[5]"
      ],
      "Years active": [
         "1991–present"
      ],
      "Labels": [
         "Atlantic",
         "Columbia",
         "DRT",
         "Earache",
         "Eastwest",
         "Inner Journey",
         "Megaforce",
         "River Road",
         "Weathermaker"
      ],
      "Associated acts": [
         "The Bakerton Group",
         "Five Horse Johnson",
         "The Company Band",
         "King Hobo[6]"
      ],
      "Website": [
         "www.pro-rock.com"
      ],
      "Members": [
         "Tim Sult",
         "Dan Maines",
         "Jean-Paul Gaster",
         "Neil Fallon"
      ],
      "Past members": [
         "Mick Schauer",
         "Roger Smalls"
      ]
   },
   "albums": [
      "Transnational Speedway League",
      "Clutch",
      "The Elephant Riders",
      "Jam Room",
      "Pure Rock Fury",
      "Blast Tyrant",
      "Robot Hive/Exodus",
      "From Beale Street to Oblivion",
      "Strange Cousins from the West",
      "Earth Rocker",
      "Psychic Warfare",
      "Book of Bad Decisions"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Germantown, [MONTH]yland. Since its formation in [YEAR], the band line-up has included [PERSON_NAME_FULL_2_MALE] (lead guitar), Dan Maines (bass), [PERSON_NAME_FULL_1_MALE] (drums), and [PERSON_NAME_FULL_0_MALE] (vocals, rhythm guitar, keyboards). To date, [BAND_NAME] has released twelve studio albums, and several rarities and live albums. Since [YEAR], the band have been signed to their own record label, Weathermaker.\n",
      "[BAND_NAME] was formed in [YEAR] by Dan Maines (bass), [PERSON_NAME_FULL_1_MALE] (drums), [PERSON_NAME_FULL_2_MALE] (guitar), and Roger Smalls (vocals) in Germantown, [MONTH]yland. Before settling on the name [BAND_NAME], the band used the early names Glut Trip and Moral Minority. Smalls soon departed and was replaced by [PERSON_NAME_FULL_0_MALE], a [GENRE] band quickly gained notice through constant touring. The 12\" single Passive Restraints on the Earache label was [BAND_NAME]'s first commercial release, garnering attention from other labels. Their debut LP, Transnational Speedway League, was released in [YEAR]. It was followed by a self-titled album two years later that gained [BAND_NAME] mainstream exposure. The band moved to the larger Columbia label for the [YEAR] album The Elephant Riders. They followed it in [YEAR] with a self-released groove-based album Jam Room.\n",
      "The album Pure Rock Fury was released by Atlantic Records in [YEAR]. The title track was initially released as the first single. The program director for North Carolina rock station WXQR (Rock 105), [PERSON_NAME_FULL_0_MALE], suggested that the label switch singles to another track from the album, [SONG_NAME], were also well received by American rock stations. In [YEAR] they issued Live at the Googolplex and the rarities record Slow Hole to China.\n"
   ]
}