{
   "Discography": {
      "text": [
         "Studio albums\n"
      ]
   },
   "External links": {},
   "History": {
      "Commercial and critical success: 2004–2011": {
         "text": [
            "The album Blast Tyrant was released in 2004, their first for DRT Entertainment. The band once again enjoyed more rock radio airplay and heavy rotation on the Music Choice cable service thanks to the single \"The Mob Goes Wild\". Its accompanying video was directed by Bam Margera, and featured Margera's Viva La Bam co-stars; Ryan Dunn, Brandon DiCamillo, and Don Vito. The video was filmed at Rex's in West Chester, Pennsylvania.[11] The 2005 release Pitchfork & Lost Needles combined Clutch's 1991 Pitchfork 7-inch release with previously unreleased demos and early tracks. In 2005 the band saw their first lineup change since the early 1990s with the addition of organist Mick Schauer, who performed on the albums Robot Hive/Exodus (2005) and From Beale Street to Oblivion (2007). The later album was produced by Joe Barresi who has also produced for Kyuss, Melvins, Queens of the Stone Age, and Tool.\n",
            "The band's first live DVD, Full Fathom Five, and accompanying CD, produced and directed by Agent Ogden, were released in September 2008. The band also released a remastered version of Slow Hole to China: Rare and Unreleased on April 28, 2009. The band's ninth studio album Strange Cousins from the West, was released on July 14, 2009. Songs from the album were played live on tour prior to the album's recording. A two-disc DVD set Clutch Live at the 9:30 was released on May 11, 2010 by the band's own label, Weathermaker Music. The set includes the entire December 28, 2009 show at Washington, D.C.'s 9:30 club, in which the band performed its entire 1995 self-titled LP.\n",
            "On May 10, 2011, Clutch reissued their 2004 album Blast Tyrant on Weathermaker Music. The new edition contained a bonus album known as Basket of Eggs that includes unreleased songs as well as acoustic versions of previous hits.[12][13] In its first week of release Blast Tyrant sold close to three thousand copies nationally, landing it at No. 26 on the Billboard Hard Rock Top 100, more than seven years after the original version debuted at No. 15.\n"
         ]
      },
      "Early years and breakthrough: 1991–2003": {
         "text": [
            "Clutch was formed in 1991[10] by Dan Maines (bass), Jean-Paul Gaster (drums), Tim Sult (guitar), and Roger Smalls (vocals) in Germantown, Maryland. Before settling on the name Clutch, the band used the early names Glut Trip and Moral Minority. Smalls soon departed and was replaced by Neil Fallon, a longtime schoolmate of the other members at Seneca Valley High School. The band quickly gained notice through constant touring. The 12\" single Passive Restraints on the Earache label was Clutch's first commercial release, garnering attention from other labels. Their debut LP, Transnational Speedway League, was released in 1993. It was followed by a self-titled album two years later that gained Clutch mainstream exposure. The band moved to the larger Columbia label for the 1998 album The Elephant Riders.[1] They followed it in 1999 with a self-released groove-based album Jam Room.\n",
            "The album Pure Rock Fury was released by Atlantic Records in 2001. The title track was initially released as the first single. The program director for North Carolina rock station WXQR (Rock 105), Brian Rickman, suggested that the label switch singles to another track from the album, \"Careful with That Mic\". Atlantic did so, and Clutch achieved a surprise hit single. The follow-up tracks, \"Immortal\" and \"Open Up the Border\", were also well received by American rock stations. In 2003 they issued Live at the Googolplex and the rarities record Slow Hole to China.\n"
         ]
      },
      "Recent releases: 2012–present": {
         "text": [
            "On June 10, 2012, the band released a new single, \"Pigtown Blues\", backed with an acoustic version of \"Motherless Child\" from Strange Cousins from the West.\n",
            "On March 16, 2013 Clutch released their tenth album Earth Rocker which entered the Billboard Top 200 chart at No. 15 giving Clutch their highest chart position to date. It remained on the chart for a total of five weeks. The album also reached No. 4 on iTunes' overall Top 100 album charts and was No. 1 on their rock chart. Earthrocker won Album of the Year 2013 from British publication Metalhammer, and was rated highly on many rock and metal magazines' and websites' end-of-the-year \"top-tens\".\n",
            "In an interview on January 7, 2015 with music and entertainment company 88 Miles West, Fallon stated that the band was heading to Dripping Springs, Texas, to record their upcoming eleventh album. Fallon states the venture to Texas was due to the relocation of record producer Machine, with whom they worked on Blast Tyrant and Earth Rocker, and who recently opened a new studio there.  He stated in the interview that \"Septemberish, give or take a couple of months\" is when they hope to release the new album.[14]\n",
            "Their eleventh studio album is titled Psychic Warfare, and was released October 2, 2015. Fallon said the concept is influenced by science fiction author Philip K. Dick. \"His general philosophy and questions have always crept into my lyrics, because I share an interest in it\", he added. \"On Earth Rocker, 'Crucial Velocity' was definitely a Philip Dick song for me. On this record, 'X-Ray Visions' certainly is.\" Gaster described the new material as more diverse than ever.[15]\n",
            "In April 2018, Neil Fallon announced through the radio station The Eagle Rocks that the band's twelfth studio album would be titled Book of Bad Decisions. The album was released on September 7, 2018.[16] The album was recorded at Sputnik Sound Studio in Nashville, Tennessee, with producer and engineer Vance Powell.\n",
            "Former keyboardist Mick Schauer died in September 2019.[17]\n"
         ]
      }
   },
   "Members": {
      "text": [
         "Tim Sult\n",
         "Dan Maines\n",
         "Jean-Paul Gaster\n",
         "Neil Fallon\n",
         "Former members\n"
      ]
   },
   "Other projects": {
      "text": [
         "In the late 1990s, Clutch and its sibling project The Bakerton Group (an instrumental jam band composed of all four Clutch members) formed an independent record label, River Road Records, to release their own music. River Road does not sign any other artists. The Bakerton Group has released one three-track EP titled Space Guitars and two full-length albums titled The Bakerton Group and El Rojo respectively. Clutch/Bakerton Group now runs its own independent record label for its own releases, Weathermaker Music.[citation needed]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Early years and breakthrough: 1991–2003",
      "1.2 Commercial and critical success: 2004–2011",
      "1.3 Recent releases: 2012–present",
      "2 Other projects",
      "3 Members",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Clutch is an American rock band from Germantown, Maryland.[8][9] Since its formation in 1991, the band line-up has included Tim Sult (lead guitar), Dan Maines (bass), Jean-Paul Gaster (drums), and Neil Fallon (vocals, rhythm guitar, keyboards). To date, Clutch has released twelve studio albums, and several rarities and live albums. Since 2008, the band have been signed to their own record label, Weathermaker.[1]\n"
      ]
   },
   "Title": "Clutch (band) - Wikipedia"
}