{
   "Name": "The Codetalkers",
   "rawData": [
      "The Codetalkers were a jazz, rock and roll band from Savannah, Georgia, composed of Bobby Lee Rodgers, (lead vocals, electric banjo, guitar, \"air trombone\"), Mark Raudabaugh (drums, vocals) and Andrew Altman (bass, vocals). The band was formed in 1999, upon the meeting of Rodgers and Col. Bruce Hampton at a show at the Variety Playhouse in Atlanta.  The group toured for many years as a four-piece with the lineup of Rodgers, Hampton, Greenwell and Pecchio.  In the spring of 2006, the band announced they would be touring without Hampton, who was stepping down for a multitude of reasons. The band was aiming to undertake a heavy touring schedule in support of their recent release, in which Hampton was unwilling and unable to participate. He had lent his name to the project for years in order to help Rodgers gain the recognition Hampton felt he deserved, but as a touring musician for 40 years, the grueling demands that a national tour would place on him didn't seem very alluring.  Coincidentally, just as this announcement was to be made, Hampton trumped the press release by citing his own health reasons for leaving the band.\n",
      "Since 2006, the group had toured as a \"power trio\" first with Rodgers, Greenwell and Pecchio, and from June 2007 on with the latter two replaced by Raudabaugh and Altman, respectively.  Raudabaugh and Altman share Rodgers' college-level musical education in jazz and have helped bring Rodgers' vision for his music back to the place where he felt it was best represented.  During a show in Savannah, where Rodgers first met Raudabaugh and Altman, the songwriter confidently proclaimed that the sound and vision of his music that he had been searching for had been found.\n",
      "Their music has been described as a mix of jazz, rock, blues, bluegrass and funk with improvised jams being the main theme in their live performances.  Some of their unique sound comes from their use of a rotating Leslie cabinet used for Rodgers' guitar. \n"
   ],
   "infobox": {
      "Origin": [
         "Savannah, Georgia"
      ],
      "Genres": [
         "Rock, jazz, blues"
      ],
      "Years active": [
         "1999–2009"
      ],
      "Members": [
         "Bobby Lee Rodgers",
         "Mark Raudabaugh",
         "Andrew Altman"
      ],
      "Past members": [
         "Col. Bruce Hampton - vocals, electric guitar",
         "Tyler Greenwell - drums, punctuation",
         "Ted Pecchio - upright bass, bass, d",
         "Sean Peterson - Bass",
         "Nick \"Zeato\" Buda - Drums"
      ]
   }
}