{
   "Summary": {
      "text": [
         "The Codetalkers were a jazz, rock and roll band from Savannah, Georgia, composed of Bobby Lee Rodgers, (lead vocals, electric banjo, guitar, \"air trombone\"), Mark Raudabaugh (drums, vocals) and Andrew Altman (bass, vocals). The band was formed in 1999, upon the meeting of Rodgers and Col. Bruce Hampton at a show at the Variety Playhouse in Atlanta.  The group toured for many years as a four-piece with the lineup of Rodgers, Hampton, Greenwell and Pecchio.  In the spring of 2006, the band announced they would be touring without Hampton, who was stepping down for a multitude of reasons. The band was aiming to undertake a heavy touring schedule in support of their recent release, in which Hampton was unwilling and unable to participate. He had lent his name to the project for years in order to help Rodgers gain the recognition Hampton felt he deserved, but as a touring musician for 40 years, the grueling demands that a national tour would place on him didn't seem very alluring.  Coincidentally, just as this announcement was to be made, Hampton trumped the press release by citing his own health reasons for leaving the band.\n",
         "Since 2006, the group had toured as a \"power trio\" first with Rodgers, Greenwell and Pecchio, and from June 2007 on with the latter two replaced by Raudabaugh and Altman, respectively.  Raudabaugh and Altman share Rodgers' college-level musical education in jazz and have helped bring Rodgers' vision for his music back to the place where he felt it was best represented.  During a show in Savannah, where Rodgers first met Raudabaugh and Altman, the songwriter confidently proclaimed that the sound and vision of his music that he had been searching for had been found.\n",
         "Their music has been described as a mix of jazz, rock, blues, bluegrass and funk with improvised jams being the main theme in their live performances.  Some of their unique sound comes from their use of a rotating Leslie cabinet used for Rodgers' guitar. [1]\n",
         "The Codetalkers had a reputation among the jam band crowd for entertaining fans not only with their music, but with their antics on stage. They were also a taper friendly band, who encouraged the taping and trading of their live shows, provided that no money exchanges hands. The band was also known for having guest musicians frequently join them for all or part of a show.   Some notable on-stage guests of The Codetalkers have been Jimmy Herring, Derek Trucks, Bob Weir, Mike Gordon, Hubert Sumlin, Ron Holloway and Ike Stubblefield (about whom Rodgers has penned a song bearing his moniker).\n",
         "While primarily playing the bulk of their live performances east of the Mississippi River in the United States, the band also played several music festivals each year, such as Vegoose in 2005 and Bonnaroo in 2002 and 2006. In May 2008, the band played two shows in Tokyo and were invited back for a full-blown tour in early 2009 following the release of their next album.\n",
         "Bobby Lee Rodgers was the primary songwriter, responsible for the original material played by the band, and collaborated on a handful of songs with other band members through the years. He was one of the youngest professors ever to teach at the Berklee College of Music (the world's largest music college,) joining  Pat Metheny among those ranks.  His background is mostly in the jazz world (he was a professor of jazz studies at Berklee) but played bluegrass as a child (his first instrument was the upright bass, which he picked up at the age of seven.)  Rodgers' songwriting and instrumental/vocal skills has led him to great places, most recently as the band-leader for Herring/Rodgers/Sipe, formed with Jimmy Herring (Aquarium Rescue Unit, The Allman Brothers, The Dead, Phil Lesh & Friends & Widespread Panic)) Jeff Sipe (Aquarium Rescue Unit, Phil Lesh & Friends,Mark van Allen (Sugarland, Blueground Undergrass) and Neal Fountain (Fiji Mariners).  Herring/Rodgers/Sipe toured in late May and August 2006.  The vast majority of the songs played by H/R/S were written by Rodgers.\n",
         "According to his website, Bobby Lee Rodgers officially disbanded The Codetalkers in early 2009, not citing specific reasons; however, Rodgers stated in an interview later that year that the band's demise was related mostly to financial issues created by the management firm responsible for their livelihood at the time.[1]\n"
      ]
   }
}