{
   "Name": "Dark Star Orchestra",
   "rawData": [
      "Dark Star Orchestra is a Grateful Dead cover band formed in Chicago, Illinois. They serve as a tribute band to the rock group the Grateful Dead. Since 1997, the band has been \"celebrating the Grateful Dead concert experience.\"\n",
      "Dark Star Orchestra performs shows from among the nearly 2,500 performances of the Grateful Dead during their 30-year tenure as fathers of improvisational rock. On most, though not all of their performances, Dark Star Orchestra presents the complete original set list, song by song, and in order, while adapting their phrasing, voice arrangements and specific musical equipment for the various eras of the Grateful Dead shows in which they perform.\n",
      "Members of the Grateful Dead themselves, including rhythm guitarist/singer Bob Weir, bassist Phil Lesh, drummer Bill Kreutzmann, vocalist Donna Jean Godchaux, and keyboardists Vince Welnick and Tom Constanten, have all appeared on stage and performed with Dark Star Orchestra. In November 2011, the group played its 2,000th show in Ithaca, New York.\n"
   ],
   "infobox": {
      "Origin": [
         "Chicago, Illinois, USA"
      ],
      "Genres": [
         "Rock, psychedelic rock, jam band"
      ],
      "Years active": [
         "1997–present"
      ],
      "Associated acts": [
         "Furthur, Zen Tricksters, JGB, Phil Lesh & Friends, The Dead"
      ],
      "Website": [
         "http://www.darkstarorchestra.net"
      ],
      "Members": [
         "Lisa Mackey",
         "Skip Vangelas",
         "Rob Koritz",
         "Dino English",
         "Rob Eaton",
         "Rob Barraco",
         "Jeff Mattson"
      ],
      "Past members": [
         "John Kadlecik",
         "Scott Larned",
         "Mike Maraat",
         "Ahmer Nizam",
         "Michael Hazdra",
         "Mark Corsolini",
         "Dave Campbell",
         "John Sabal",
         "Bustar",
         "Jim Harris",
         "David Berg",
         "Gregg Koerner",
         "Kevin Rosen",
         "Tom Ryan",
         "Dan Klepinger",
         "Stu Allen",
         "Jim Allard"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is a [GENRE] band formed in Chicago, Illinois. They serve as a tribute band to the rock group the Grateful Dead. Since [YEAR], the band has been \"celebrating the Grateful Dead concert experience.\"\n",
      "[BAND_NAME] performs shows from among the nearly 2,500 performances of the Grateful Dead during their 30-year tenure as fathers of improvisational rock. On most, though not all of their performances, [BAND_NAME] presents the complete original set list, song by song, and in order, while adapting their phrasing, voice arrangements and specific musical equipment for the various eras of the Grateful Dead shows in which they perform.\n",
      "Members of the Grateful Dead themselves, including rhythm guitarist/singer Bob Weir, bassist [PERSON_NAME_FULL_1_MALE], drummer Bill Kreutzmann, vocalist [PERSON_NAME_FULL_2_FEMALE], and keyboardists [PERSON_NAME_FULL_0_MALE] and Tom Constanten, have all appeared on stage and performed with [BAND_NAME]. In [MONTH] [YEAR], the group played its 2,000th show in Ithaca, New York.\n"
   ]
}