{
   "Name": "The Dead (band)",
   "rawData": [
      "The Dead was an American rock band composed of some of the former members of the Grateful Dead.\n",
      "After the death of Jerry Garcia in 1995, Bob Weir, Phil Lesh, Mickey Hart, and Bill Kreutzmann formed the band The Other Ones, performing concert tours in 1998 (without Kreutzmann), 2000 (without Lesh), and 2002, and released one album, The Strange Remain.  In 2003, they changed their name to The Dead.\n",
      "In addition to Weir, Lesh, Hart and Kreutzmann, the 2003 lineup of the band included Jimmy Herring, Jeff Chimenti, Rob Barraco, and Joan Osborne. The band was first officially billed as The Dead on February 14, 2003 at the Warfield in San Francisco. Later that year, the band opened up their summer tour (titled as \"Summer Getaway\") on June 15 at the Bonnaroo Music Festival. They ended 2003 with two New Year's dates at the Oakland Coliseum on December 30 and 31.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, U.S."
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "2003–2004, 2008-2009"
      ],
      "Associated acts": [
         "Grateful Dead, The Other Ones, Furthur, RatDog, Phil Lesh and Friends, Gov't Mule, The Allman Brothers Band, Dead & Company"
      ],
      "Website": [
         "www.dead.net"
      ],
      "Past members": [
         "Bob Weir",
         "Phil Lesh",
         "Mickey Hart",
         "Bill Kreutzmann",
         "Jeff Chimenti",
         "Jimmy Herring",
         "Rob Barraco",
         "Joan Osborne",
         "Warren Haynes"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band composed of some of the former members of the Grateful Dead.\n",
      "After the death of Jerry Garcia in [YEAR], [PERSON_NAME_FULL_2_MALE], [PERSON_NAME_FULL_0_MALE], Mickey Hart, and [PERSON_NAME_FULL_1_MALE] formed the band The Other Ones, performing concert tours in [YEAR] (without [PERSON_NAME_LAST_1]), [YEAR] (without [PERSON_NAME_LAST_0]), and [YEAR], and released one album, The Strange Remain.  In [YEAR], they changed their name to [BAND_NAME].\n",
      "In addition to Weir, Lesh, Hart and Kreutzmann, the [YEAR] lineup of the band included Jimmy Herring, [PERSON_NAME_FULL_0_MALE], Rob Barraco, and [PERSON_NAME_FULL_1_FEMALE]. The band was first officially billed as [BAND_NAME] on [MONTH] 14, [YEAR] at the Warfield in San Francisco. Later that year, the band opened up their summer tour (titled as [SONG_NAME]) on [MONTH] 15 at the Bonnaroo Music Festival. They ended [YEAR] with two New Year's dates at the Oakland Coliseum on [MONTH] 30 and 31.\n"
   ]
}