{
   "Name": "Deep Banana Blackout",
   "rawData": [
      "Deep Banana Blackout is a funk/rock band formed in the summer of 1995 when a group of like minded musicians hailing from New York and Connecticut joined forces to play Soul and R&B covers from the 60’s and 70’s for the pure love of that music. As the band members chemistry became apparent, all other projects fell to the wayside so that they could focus on writing and arranging original material. The band soon became a highly acclaimed musical force on the East Coast underground live music scene. This eight piece musical outfit, with full horn section and soulful groove embedded in the roots of funk, is notorious for weaving their own compositions involving extended improvisation with songs by Sly and the Family Stone,  James Brown, Stevie Wonder, and Parliament/Funkadelic.\n",
      "In July 1997, DBB released their first studio effort entitled Live in the Thousand Islands. The album was recorded in Hartford, CT in the old Colt.45 building and was produced by the band members themselves. In February 1999, Deep Banana Blackout released their second recording, a double live CD called Rowdy Duty. The album was recorded in one night at the club 7 Willow St. in Port Chester, New York. Later on that year, the band's label Artkin Touchya Records released B'Gock!, a side project for DBB's guitarist Fuzz and his band \"On the Corner w/ Fuzz.\" Also in 1999 drummer Eric Kalb and percussioninst Johnny Durkin went to work on jazz legend John Scofield's Verve release Bump. The album was featured on Billboard jazz charts and pays homage to DBB through the title track (after DBB original tune \"Bump & Sway\"), and the track \"Blackout\", which features a rhythmic refrain imitative of an audience chant typical of DBB's live shows preceding the encore.\n",
      "Deep Banana Blackout has sold out such venues as the Webster Theater in Hartford, Connecticut (1200 capacity) and Irving Plaza in New York City (1100 capacity). They were featured at the Newport Jazz Festival in the summer of 2000, as well as being the focal point of a feature article in JazzTimes. In 2001, DBB played a co-bill with Maceo Parker in the new Denver Fillmore to 2750 fans, was featured at events such as Jazz Aspen/Snowmass, and the Gathering of the Vibes, toured with the Allman Brothers Band, and performed in Japan as well. In 2000, lead vocalist Jen Durkin left the band. Jen was replaced by vocalist/sax player Hope Clayburn. Durkin joined Bernie Worrell (of Parliament) and The Woo Warriors and became a member of the newly formed band The Bomb Squad (not to be confused w/ the rap producers). The Bomb Squad opened for DBB occasionally, and Durkin performed with them when their paths crossed.\n"
   ],
   "infobox": {
      "Origin": [
         "Fairfield County, Connecticut, USA"
      ],
      "Genres": [
         "Funk/Rock"
      ],
      "Years active": [
         "1995 – present"
      ],
      "Labels": [
         "Artkin, DCN Records, Flying Frog Records"
      ],
      "Website": [
         "https://www.deepbananablackout.net"
      ],
      "Members": [
         "left to right:",
         "Johnny Durkin",
         "Cyrus Madan",
         "Rob Volo",
         "Benj LeFevre",
         "Rob Somerville",
         "Eric Kalb",
         "James “Fuzz” Sangiovanni",
         "Jen Durkin"
      ],
      "Past members": [
         "Bryan Smith Hope Clayburn"
      ]
   }
}