{
   "Name": "Dirty Dozen Brass Band",
   "Sections": [
      "1 Beginnings",
      "2 Popularity",
      "3 Influence",
      "4 Discography",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "The Dirty Dozen Brass Band is a New Orleans, Louisiana, brass band. The ensemble was established in 1977 by Benny Jones and members of the Tornado Brass Band. The Dirty Dozen revolutionized the New Orleans brass band style by incorporating funk and bebop into the traditional New Orleans jazz style, and since has been a major influence on local music.\n"
      ]
   },
   "Beginnings": {
      "text": [
         "The Dirty Dozen Brass Band grew out of the youth music program established by Danny Barker at New Orleans' Fairview Baptist Church. In 1972, Barker started the Fairview Baptist Church Marching Band to provide young people with a positive outlet for their energies. The band achieved considerable local popularity and transformed itself into a professional outfit led by trumpeter Leroy Jones and known as the Hurricane Brass Band. By 1976, however, opportunities for brass bands were drying up; Jones left the group to play mainstream jazz and, after a brief period as the Tornado Brass Band, the group fell apart.\n",
         "A few of the musicians from the Tornado band—trumpeter Gregory Davis, sousaphonist Kirk Joseph, trombonist Charles Joseph, and saxophonist Kevin Harris–continued to rehearse together into 1977, and they were joined by Efrem Townes (trumpeter/lead singer) and Roger Lewis on saxophone and Benny Jones and Jenell Marshall on drums. By this point the popularity of brass band music in New Orleans was at a low ebb, and paying gigs were rare, a circumstance which influenced the early development of the band. As Davis describes it,\n",
         "In the beginning, there was a lot of rehearsal going on, ... [and] we started to develop a repertoire. ... We were just rehearsing, and we were interested in learning the chord progressions and the melodies. ... We were all free to bring in whatever we wanted to rehearsal. We weren't thinking about getting gigs.",
         "This sense of freedom allowed the band to incorporate bebop tunes and jazz standards into their repertoire, as well as lighthearted pieces like The Flintstones theme song.\n",
         "When Benny Jones, who was active in the social and pleasure club scene, was asked to get a band together for a parade, he would draw from this rehearsal group; before long, Gregory Davis assumed leadership of the band. \"I thought it would be better to use the same people as often as I could,\" he explains. \"That helped to keep it tight.\" The band initially called themselves the Original Sixth Ward Dirty Dozen, a name designed to show their strong connection to the Tremé neighborhood and the local social club scene, as represented by the Dirty Dozen Social and Pleasure Club.\n",
         "The band began playing regular Thursday night gigs at a Seventh Ward club called Daryl's, and later added a regular spot at the Glasshouse, a neighborhood bar in a black neighborhood of Uptown New Orleans, which lasted \"about seven or eight years\". The performances at Daryl's caught the attention of Jerry Brock, a radio broadcaster and co-founder of new local radio station WWOZ. Brock describes his initial reaction to the band:\n",
         "I'll never forget the first time I walked in there. ... The people were so exuberant—the floor was covered with people, rolling on the floor! ... This is what the Fairview band and the Hurricane Brass Band had been leading up to—the Dirty Dozen had renewed this music to the New Orleans community. The people were going wild. Going to Daryl's became the weekly ritual."
      ]
   },
   "Popularity": {
      "text": [
         "In 1980, Jerry Brock made the first professional recording of the Dirty Dozen Brass Band, which he played \"constantly\" on WWOZ. He also prepared a press kit for the group and, in his words, \"helped them to present themselves professionally\".\n",
         "Back in 1982, Brock had arranged a concert for the band at the well-known local music venue Tipitina's, which was the first time they had played at a \"white club\" in New Orleans.  It was a double bill with Danny Barker band.  Barker and The Dozen were both apprehensive about the match-up: Barker about being blown off the stage and The Dozen out of respect and knowledge of Barker's deep roots and knowledge.  The Dozen were recognized as the new energy and force that they were and Mr. Barker held his own as the elder statesman giving his blessing to the generations to come.  Afterwards the band had one of its first international appearances, when Kidd Jordan recommended the band to the organizers of Swingin' Groningen in the Netherlands.\n",
         "The band's popularity began to take off in 1984. Promoter George Wein booked them on a tour of southern Europe, and when they returned to the United States they secured engagements at two clubs in New York: Tramp's and The Village Gate, where their original short bookings were extended to six weeks. After a week at home in New Orleans the band travelled to California for four weeks, and before the year was out made three more trips to Europe. 1984 also saw the recording and release of the band's first album, My Feet Can't Fail Me Now, on the Concord Jazz label. Gregory Davis assesses the band's popularity at the time:\n",
         "Outside Louisiana, support was in pockets. It was okay in California, but our widest support was in Europe. ... There were many more festivals and clubs that featured jazz, and a high level of enthusiasm. We got the same sort of reception in Japan.",
         "In 1986, the band's set at the Montreux Jazz Festival in Montreux, Switzerland, was recorded and released as Mardi Gras at Montreux on Rounder Records. The album and the band's touring successes attracted major-label attention, and in 1987 the band signed a contract with Columbia. Their Columbia debut, 1987's Voodoo, featured guest appearances by Dr. John, Dizzy Gillespie, and Branford Marsalis. Later recordings saw them joined by a variety of special guests including Elvis Costello, DJ Logic, Norah Jones, and the man who started it all, Danny Barker. The group has also toured and recorded with jam band Widespread Panic, as well as spending almost all of 1995 as the opening act for The Black Crowes 'Amorica Or Bust' US Tour.\n",
         "In 1998, after a five-year hiatus from recording, the band switched labels to release Ears to the Wall on Mammoth Records. They followed it up in 1999 with Buck Jump which was produced by John Medeski of Medeski Martin & Wood. (Medeski also played Hammond B3 on the album.) Their next album, 2002's Medicated Magic, appeared on Ropeadope Records, as did their subsequent studio release, Funeral for a Friend, which appeared in 2004. Funeral for a Friend represents something of a return to the band's roots: it is a documentation of a New Orleans \"funeral with music\", the original environment of the brass band form. They appear on the 2005 benefit album A Celebration of New Orleans Music to Benefit MusiCares Hurricane Relief 2005, with the song \"Mardi Gras In New Orleans\". They were also featured on two tracks on Modest Mouse's album Good News for People Who Love Bad News: \"Horn Intro\" and \"This Devil's Workday.\" On August 29, 2006, the Dozen released What's Going On, their version of the entire 1971 Marvin Gaye landmark disc What's Going On as a response to the devastation of Hurricane Katrina that struck New Orleans exactly one year earlier.\n"
      ]
   },
   "Influence": {
      "text": [
         "From the beginning, the music of the Dirty Dozen was a departure from the traditional New Orleans brass band sound, and as the band's popularity increased the distance between them and more traditional groups only grew. When Kirk and Charles Joseph left the band suddenly in 1991, citing the pressures of the group's demanding touring schedule, Davis was forced to replace Kirk Joseph not with another sousaphonist but with an electric bass player. Similarly, in 1994 drummers Lionel Batiste (who had replaced Benny Jones on bass drum some years earlier) and Jenell Marshall left the group; Davis was unable to find a pair of drummers who met his expectations, and instead hired a single musician to play drum kit. The subsequent addition of a keyboard player and guitarist removed the band still further from its street band roots.  Finally, throughout the band's history they relied on written arrangements to a far greater extent than do most other New Orleans brass bands.\n",
         "Despite the Dirty Dozen's uniqueness, however, the band's success inspired a resurgence of New Orleans' brass band music, both in the city and nationwide. The band was most influential in the 1980s, when they demonstrated by example that brass band music could be successful by moving beyond a type of music that risked stagnation as nothing more than a tourist attraction. Before the Dirty Dozen band was formed the Olympia Brass Band was already mixing R&B and jazz influences in with traditional tunes; the Dirty Dozen took this farther, and gave the trend worldwide visibility. Bands which followed in their wake did not all follow their more jazz oriented stage band approach—only the Soul Rebels have gone in that direction—but a wide variety of bands, from the Rebirth Brass Band to Wisconsin's Youngblood Brass Band have been influenced by them in other ways. Rebirth has the most direct connection with the Dirty Dozen: they got their start playing at Daryl's when the Dirty Dozen was on the road.\n"
      ]
   },
   "Discography": {
      "text": [
         "The Dirty Dozen Brass Bands appear on:\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "The Dirty Dozen Brass Band is a New Orleans, Louisiana, brass band. The ensemble was established in 1977 by Benny Jones and members of the Tornado Brass Band. The Dirty Dozen revolutionized the New Orleans brass band style by incorporating funk and bebop into the traditional New Orleans jazz style, and since has been a major influence on local music.\n",
      "The Dirty Dozen Brass Band grew out of the youth music program established by Danny Barker at New Orleans' Fairview Baptist Church. In 1972, Barker started the Fairview Baptist Church Marching Band to provide young people with a positive outlet for their energies. The band achieved considerable local popularity and transformed itself into a professional outfit led by trumpeter Leroy Jones and known as the Hurricane Brass Band. By 1976, however, opportunities for brass bands were drying up; Jones left the group to play mainstream jazz and, after a brief period as the Tornado Brass Band, the group fell apart.\n",
      "A few of the musicians from the Tornado band—trumpeter Gregory Davis, sousaphonist Kirk Joseph, trombonist Charles Joseph, and saxophonist Kevin Harris–continued to rehearse together into 1977, and they were joined by Efrem Townes (trumpeter/lead singer) and Roger Lewis on saxophone and Benny Jones and Jenell Marshall on drums. By this point the popularity of brass band music in New Orleans was at a low ebb, and paying gigs were rare, a circumstance which influenced the early development of the band. As Davis describes it,\n",
      "In the beginning, there was a lot of rehearsal going on, ... [and] we started to develop a repertoire. ... We were just rehearsing, and we were interested in learning the chord progressions and the melodies. ... We were all free to bring in whatever we wanted to rehearsal. We weren't thinking about getting gigs."
   ]
}