{
   "Band members": {},
   "Camp Bisco": {
      "text": [
         "The first Camp Bisco took place in August 1999 in Cherrytree Pennsylvania, the band seeking to combine the creative effects of electronic DJs with improvisational rock. Over 17 years Camp Bisco has grown by leaps and bounds, with its lineup expanding to include acts such as Shpongle, Lotus, Pretty Lights, Bassnectar, Gramatik, and STS9.[10] D'Arcangelo, Sam https://jambands.com/features/2015/07/14/marc-brownstein-returns-to-camp/ Jambands.com  The band celebrated its fifteenth anniversary of the festival July 2017 on Montage Mountain in Scranton, Pennsylvania.[11]\n"
      ]
   },
   "Discography": {},
   "External links": {},
   "Filmography": {},
   "History": {
      "text": [
         "The Disco Biscuits formed in 1995 at the University of Pennsylvania. Marc, Jon, Aron and original drummer Samuel \"Sammy\" Altman shared an affinity for psychedelic rock, electronic music, soul, blues, jazz and classical music, and their shared interests led them to develop and perfect a distinctive style of live electronic music known as 'trance fusion'. The term references the band incorporating elements of Trance music - repetitive drum beats and melodic sections - into the instrumentation and conventions of a live jam-band, where guitar, bass, keyboards, and drums play structured songs with sections for exploratory improvisation. The band honed their style playing bars in the Philadelphia area in the mid-1990s and received particular acclaim in the jam-band fan scene during their 1999 tours. This era (sometimes referred to as 'the nine-nine' by Disco Biscuits fans) featured energetic musical improvisation that explored new musical styles while still remaining listenable to a general jam-band audience. In 2005 Drummer Sammy Altman Sammy left the band to pursue a career in medicine.[5] The band conducted a search for their next drummer, which culminated in a two-night, sold-out drum-off at the Borgata's Music Box in Atlantic City.[6] In December 2005 Allen Aucoin was announced as the newest member of the band.[7] Aucoin knew members of the Biscuits' road crew and had opened for the Biscuits in the past.[8] In 2006 the band purchased the Old City Philadelphia studio space that had previously belonged to DJ Jazzy Jeff. The space became a place for local musicians to congregate and work, culminating in the unique collaborations recorded in recording studio efforts known as the Planet Anthem sessions. Around the time of Planet Anthem, the Biscuits also collaborated with noted hip-hop producer Damon Dash on a variety of projects.[9]\n"
      ]
   },
   "Philanthropy": {
      "text": [
         "The Disco Biscuits are involved in a number of charitable efforts including food drives and raising money for hurricane relief.[12] In 2004, Marc (along with Andy Bernstein, author of The Pharmer's Almanac) founded HeadCount, a national, nonpartisan, non-profit, organization that partners with musicians to promote participation in democracy in the United States by registering voters at concerts. In 2010, the keyboardist Aron Magner was named to the Board of Directors for the Philadelphia Young Playwrights theatre arts program.[13]\n"
      ]
   },
   "References": {},
   "Rock Operas": {
      "text": [
         "Marc and Jon have each written rock operas. Gutwillig was first, writing the Hot Air Balloon sometime before its debut on December 31, 1998, at Silk City in Philadelphia. Marc wrote the Chemical Warfare Brigade in early 2000 while on hiatus from the band. It debuted at the Trocadero Theater in Philadelphia August 19, 2000, with his side project Electron. The Disco Biscuits played the Chemical Warfare Brigade for the first time at the Vanderbilt in Plainview, NY December 30, 2000.\n"
      ]
   },
   "Sections": [
      "1 History",
      "2 Camp Bisco",
      "3 Rock Operas",
      "4 Philanthropy",
      "5 Discography",
      "6 Band members",
      "7 Filmography",
      "8 See also",
      "9 References",
      "10 External links"
   ],
   "See also": {},
   "Summary": {
      "text": [
         "The Disco Biscuits are a jam band from Philadelphia, Pennsylvania. The band consists of Allen Aucoin (drums), Marc \"Brownie\" Brownstein  (bass guitar, vocals), Jon \"The Barber\" Gutwillig  (guitar, vocals), and Aron Magner (keyboards, synths, vocals).[1] The band incorporates elements from a variety of musical genres with a base of electronic and rock. Their style has been described as trance fusion.[2][3][4]\n"
      ]
   },
   "Title": "Disco Biscuits - Wikipedia"
}