{
   "Name": "Dispatch (band)",
   "rawData": [
      "Dispatch is an American indie/roots band. The band consists of Brad Corrigan (vocals, drums, guitar, percussion, and harmonica) and Chad Urmston (vocals, guitar, bass, and percussion). The band's original bassist, Pete Francis Heimbold, left in 2019.\n",
      "The band, which is based in the Boston area, was originally active from 1996 until 2002. The members then announced a hiatus, which would ultimately last for almost a decade; during this period, the band came together for reunion concerts in Boston (2004), New York City (2007), and Washington, D.C. (2009). The hiatus ended at the beginning of 2011, when the band announced a national tour. In May of the same year, Dispatch released an EP containing six new songs, their first all-new release since 2000. The band released both their first studio album in over a decade, Circles Around the Sun, and an iTunes session in 2012 and toured North America that summer in support of the album.  On April 22, 2013, Dispatch announced a double-disc live album called \"Ain't No Trip to Cleveland Vol. 1\", released on June 4, 2013. After a long hiatus, Dispatch returned with their new album, America, Location 12, released on June 2, 2017.\n",
      "Hermit Thrush and Woodriver Bandits merged into an all-acoustic band in the early 1990s as One Fell Swoop.  They soon changed their name to Dispatch after a dispute with another band of the same name. Chad Urmston, Brad Corrigan, and Pete Heimbold, who were all attending Middlebury College, comprised the band's lineup throughout their entire schooling. Their music drew upon several genres, such as acoustic folk-rock, reggae, and funk.  They did several concerts in their early years both in and around Middlebury, gaining a name for themselves at the college.\n"
   ],
   "infobox": {
      "Origin": [
         "Middlebury, Vermont, United States"
      ],
      "Genres": [
         "Jam band, indie folk, roots rock, reggae fusion, rap rock, ska"
      ],
      "Years active": [
         "1996–2002, 2004, 2007, 2009, 2011–present"
      ],
      "Labels": [
         "Bomber, DCN Records, Universal"
      ],
      "Associated acts": [
         "State Radio, Braddigan, Pete Francis"
      ],
      "Website": [
         "www.dispatchmusic.com"
      ],
      "Members": [
         "Chad Urmston",
         "Brad Corrigan"
      ],
      "Past members": [
         "Pete Heimbold"
      ]
   }
}