{
   "Discography": {},
   "External links": {},
   "Members": {
      "text": [
         "Nevins and Puryear share most of the songwriting duties. \n",
         "Past band members have included: keyboardists Joe Thrift, Richie Stearns and Kathy Ziegler; drummers Tom Gilbert, Shane Lamphier and Jimmy Triplett; guitarist and frequent vocalist, Jim Miller; bass players Jordon Puryear, Jeb's brother, and Jed Greenberg. On July 5, 2007, Jay Sanders replaced Bill Reynolds on bass, followed by Kyle Spark in January, 2010.\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 Members",
      "2 Discography",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Donna the Buffalo is a band from Trumansburg, New York. They play both original songs and covers.\n",
         "A musician friend suggested \"Dawn of the Buffalo\" as a name for the band, which was misheard as \"Donna the Buffalo,\" and over twenty years later, the band is still called \"Donna the Buffalo\".  The followers of the group are called The Herd, a self-organized \"tribe\" of people who found each other at the group's live events.[1]\n",
         "Donna the Buffalo is one of the founding and host bands of the annual Finger Lakes GrassRoots Festival of Music and Dance, and of the Shakori Hills Grassroots Festival; and is among the headliners at The Great Blue Heron Music Festival in Sherman, New York. Donna the Buffalo was featured in On The Bus, a documentary co-directed by Dave Sale.\n",
         "Donna the Buffalo has performed and recorded with a variety of musicians, including such prominent folk/roots performers as: Jim Lauderdale; father and son zydeco musicians, Preston and Keith Frank; Bela Fleck of Bela Fleck and the Flecktones; Malian musician, Mamadou Diabate; Claire Lynch; David Hidalgo of Los Lobos; The Duhks; and Amy Helm, among others. In 2009, Tara Nevins toured with former Grateful Dead drummer Bill Kreutzmann and his band, BK3.\n"
      ]
   },
   "Title": "Donna the Buffalo - Wikipedia"
}