{
   "Name": "Pansy Division",
   "rawData": [
      "Pansy Division is an American rock band formed in San Francisco, California, United States, in 1991 by singer-songwriter Jon Ginoli and bassist Chris Freeman.\n",
      "Conceived as the first openly gay rock band featuring predominantly gay musicians, Pansy Division's music, a mix of pop punk and power pop, focuses mainly on LGBT issues, sex and relationships, often presented in a humorous light. In 1993, the band signed to punk label Lookout! Records and received international notoriety touring with Green Day in 1994, becoming the most commercially successful band of the queercore movement which began in the 1980s.\n",
      "Pansy Division have released seven studio albums and three B-side compilations, among other recordings. In 2008, the band were the subject of the documentary film entitled Pansy Division: Life in a Gay Rock Band.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, United States"
      ],
      "Genres": [
         "Pop punk,[1][2] alternative rock, power pop, queercore"
      ],
      "Years active": [
         "1991–present"
      ],
      "Labels": [
         "Outpunk",
         "Alternative Tentacles",
         "Mint",
         "Lookout"
      ],
      "Website": [
         "www.pansydivision.com"
      ],
      "Members": [
         "Jon Ginoli",
         "Chris Freeman",
         "Luis IlladesJoel Reader"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in San Francisco, California, United States, in [YEAR] by singer-songwriter [PERSON_NAME_FULL_0_MALE] and bassist Chris Freeman.\n",
      "Conceived as the first openly gay rock band featuring predominantly gay musicians, [BAND_NAME]'s music, a [GENRE] a humorous light. In [YEAR], the band signed to punk label Lookout! Records and received international notoriety touring with Green Day in [YEAR], becoming the most commercially successful band of the queercore movement which began in the [YEAR]s.\n",
      "[BAND_NAME] have released seven studio albums and three B-side compilations, among other recordings. In [YEAR], the band were the subject of the documentary film entitled [BAND_NAME]: Life in a [GENRE]"
   ]
}