{
   "Name": "əkoostik hookah",
   "rawData": [
      "\nəkoostik hookah is a jam band from Columbus, Ohio. Formed in 1991, the band has made multiple national tours in the US, as well as performing in overseas locales like Amsterdam and Jamaica, although they may more commonly be found playing local Columbus, Ohio venues like Newport Music Hall, and Lifestyle Communities Pavilion. They are fixtures in many fine venues across the midwest. The band has shared the stage with many of today's top touring \"jam bands\", as well as stars such as Willie Nelson, Arlo Guthrie, Bob Weir, and Bruce Hornsby.\n",
      "The band's name, pronounced \"Acoustic Hookah,\" was taken from dictionary entries for the two words.  The phonetic spellings were chosen, and the schwa (ə) became the band's official symbol.  \"Schwa\" is also the title of a song by keyboardist and primary songwriter Dave Katz. The band endorses a number of charitable causes; among them, Pittsburgh's ongoing BurghSTOCK Concert Series that benefits area non-profits that assist homeless and disabled military veterans.\n",
      "Hookahville is a semi-annual music festival featuring performances from many local and regional bands and usually hosted and headlined by əkoostik hookah.  Formerly located at Legend Valley in Thornville, Ohio or at Frontier Ranch in Kirkersville, Ohio, it was moved to Zane Shawnee Caverns in Bellefontaine, Ohio in 2017 where Hookahville 50 was held in September 2018 and was əkoostik hookah's reunion show with eh2.0. Hookahville 51 was held at Brushy Fork Phamily Ranch in Newark, OH in May 2019. Hookahville 52 was held at Clear Fork Adventure Resort in Butler, Ohio where eh2.0 returned for one more performance. Spring Hookahville is held the weekend before Memorial Day weekend; the end of summer version is held during Labor Day weekend. In November, 2020, an event was held online due to the COVID-19 pandemic but is not considered the official Hookahville 53 which has been postponed.\n"
   ],
   "infobox": {
      "Origin": [
         "Columbus, Ohio"
      ],
      "Genres": [
         "Rock, psychedelic rock, jam band"
      ],
      "Years active": [
         "1991–present"
      ],
      "Associated acts": [
         "Katz-n-Jammers",
         "Screamin Peach",
         "The Spikedrivers",
         "John Mullins Band",
         "One Under"
      ],
      "Website": [
         "www.ekoostik.com"
      ],
      "Members": [
         "Dave Katz",
         "Steve Sweney",
         "Eric Lanese",
         "Eric Sargent",
         "Matt Paetsch"
      ],
      "Past members": [
         "John Mullins",
         "Cliff Starbuck",
         "Ed McGee",
         "Johnny Polansky",
         "Steve Frye",
         "Donald Safrenek",
         "Phil Risko"
      ]
   },
   "prunedData": [
      "\n[BAND_NAME] is a [GENRE] band from Columbus, Ohio. Formed in [YEAR], the band has made multiple national tours in the US, as well as performing in overseas locales like Amsterdam and Jamaica, although they may more commonly be found playing local Columbus, Ohio venues like Newport Music Hall, and Lifestyle Communities Pavilion. They are fixtures in many fine venues across the midwest. The band has shared the stage with many of today's top touring \"[GENRE] bands\", as well as stars such as [PERSON_NAME_FULL_0_MALE], Arlo Guthrie, [PERSON_NAME_FULL_1_MALE], and Bruce Hornsby.\n",
      "The band's name, pronounced \"Acoustic Hookah,\" was taken from dictionary entries for the two words.  The phonetic spellings were chosen, and the schwa (ə) became the band's official symbol.  \"Schwa\" is also the title of a song by keyboardist and primary songwriter [PERSON_NAME_FULL_0_MALE]. The band endorses a number of charitable causes; among them, Pittsburgh's ongoing BurghSTOCK Concert Series that benefits area non-profits that assist homeless and disabled military veterans.\n",
      "Hookahville is a [GENRE] bands and usually hosted and headlined by [BAND_NAME].  Formerly located at Legend Valley in Thornville, Ohio or at Frontier Ranch in Kirkersville, Ohio, it was moved to Zane Shawnee Caverns in Bellefontaine, Ohio in [YEAR] where Hookahville 50 was held in [MONTH] [YEAR] and was [BAND_NAME]'s reunion show with eh2.0. Hookahville 51 was held at Brushy Fork Phamily Ranch in Newark, OH in [MONTH] [YEAR]. Hookahville 52 was held at Clear Fork Adventure Resort in Butler, Ohio where eh2.0 returned for one more performance. Spring Hookahville is held the weekend before Memorial Day weekend; the end of summer version is held during Labor Day weekend. In [MONTH], [YEAR], an event was held online due to the COVID-19 pandemic but is not considered the official Hookahville 53 which has been postponed.\n"
   ]
}