{
   "Name": "Furthur (band)",
   "Sections": [
      "1 History",
      "1.1 Performances",
      "1.1.1 2009",
      "1.1.2 2010",
      "1.1.3 2011",
      "1.1.4 2012",
      "1.1.5 2013",
      "1.1.6 2014",
      "1.2 Special appearances",
      "2 Members",
      "2.1 Furthur",
      "2.2 Guest performers",
      "2.3 Tour staff & crew",
      "3 References",
      "4 External links"
   ],
   "Summary": {
      "text": [
         "Furthur was a rock band founded in 2009 by former Grateful Dead members Bob Weir and Phil Lesh. The original lineup also included John Kadlecik of the Dark Star Orchestra on lead guitar, RatDog's Jeff Chimenti on keyboards and Jay Lane on percussion, and Joe Russo of the Benevento/Russo Duo on drums.[1] Named after the famous touring bus used by Ken Kesey and the Merry Pranksters in the 1960s, Furthur was an improvisational jam band that performed music primarily from the extensive Grateful Dead songbook, as well as their own original music and that of several other well-known artists. In addition to the original members (with the exception of Jay Lane, who left the band in March 2010 to rejoin his previous band, Primus), the band's lineup included backup vocalists Sunshine Becker of the a cappella ensemble SoVoSó and Jeff Pehrson of the folk rock bands Box Set and the Fall Risk.\n"
      ]
   },
   "History": {
      "Performances": {
         "2009": {
            "text": [
               "The band debuted with performances on September 18, 19, and 20, 2009, at the Fox Theatre in Oakland, California. The band Vice (now known as Maiden Lane), featuring Phil's son, Grahame, opened for Furthur on Saturday, September 19.[5] They then performed for a single night on November 20 at the 200-person-capacity 19 Broadway in Fairfax, California, advertised only by a last-minute announcement, and with tickets available only at the door on a first come, first served basis.[6] The Oakland debut shows were followed by five additional concerts in the Northeast (New York, Connecticut, and New Jersey) in December 2009,[7] as well as live rehearsal sessions[8] and two New Year's shows in Mill Valley, California, and San Francisco, respectively. During the New Year's Eve performances, the band introduced backing vocalists Sunshine Becker and Zoe Ellis,[9] who remained in the lineup for the remainder of the winter tour.[10][11]\n"
            ]
         },
         "2010": {
            "text": [
               "Additional live rehearsal sessions continued for the first half of January 2010 in Mill Valley. The band then toured the U.S. (primarily East Coast, with a few shows in Miami, Chicago, Broomfield, Colorado, and Portland, Oregon) from February 2 through March 8, 2010, and performed in San Francisco on March 12, 2010 to celebrate Phil Lesh's upcoming 70th birthday.[12] On March 18, 2010, Phil Lesh posted on popular fansite PhilZone.com an announcement that drummer Jay Lane had left Furthur to rejoin his prior group, Primus.[13] Zoe Ellis also left the group at this time to focus on her a cappella ensemble, SoVoSó. Backup vocalist Jeff Pehrson subsequently joined Furthur, debuting May 24, 2010.[14]\n",
               "In February 2010, official announcements were released that the group would be performing at three music festivals in the summer of 2010, including the Nateva Music & Camping Festival in Oxford, Maine, on July 4, the All Good Music Festival in Masontown, West Virginia, on July 9, and the Gathering of the Vibes[15] festival in Bridgeport, Connecticut, on July 30. Additional stops on the tour, which ran from June 25 until July 30 and included 17 shows, included Rochester, New York, Brooklyn, Jim Thorpe, Pennsylvania, Lowell, Massachusetts, Columbus, Ohio, Mohawk, New York, Stroudsburg, Pennsylvania (which replaced a canceled show in Shelburne, Vermont[16]), Ottawa, Lewiston, New York, Philadelphia, and New York.  In addition to the three festivals on the East Coast, Furthur resurrected the \"Furthur Festival\" at Mountain Aire in Angels Camp, California on Memorial Day weekend May 28-30th, 2010, at which they played six of their classic albums live.[17]\n",
               "Following a performance on August 14, 2010 in Golden Gate Park at the Outside Lands Music and Arts Festival, Furthur initiated their first West Coast tour, commencing September 16, 2010 in Eugene, Oregon, and ending September 26, 2010 in Morrison, Colorado, at Red Rocks Amphitheatre. A short Midwest/East Coast tour followed, beginning on November 8, 2010 in Minneapolis and ending on November 21, 2010 at Madison Square Garden in New York. Two New Year's shows concluded the year, with Furthur having performed a total of 77 shows and 18 live rehearsal sessions since their September 2009 inception.[5]\n"
            ]
         },
         "2011": {
            "text": [
               "Furthur began 2011 with three shows at the Odeum Colorado in February 2011 (announced December 3, 2010), followed shortly thereafter by a 24-show East Coast tour (announced January 6, 2011) beginning on March 4 in Boston and ending on April 6 in Boca Raton, Florida. This tour featured several multi-night runs in mid-size venues including five nights at Best Buy Theater in New York, five nights at Tower Theater in Upper Darby, Pennsylvania (outside Philadelphia), and three nights at Radio City Music Hall in New York. The 2011 summer tour (announced on April 8, 2011) began on June 3 at Shoreline Amphitheatre in Mountain View, California, and concluded on July 31 at Verizon Wireless Amphitheatre at Encore Park in Alpharetta, Georgia, with the bulk of the shows on the East Coast.\n",
               "A 2011 West Coast tour (announced on June 4, 2011) began on September 23 at Cuthbert Amphitheatre in Eugene, Oregon, and ended on October 8 at Monterey County Fairgrounds in Monterey, California. A 2011 East Coast/Midwest fall tour (announced on September 9, 2011) began November 3 at Verizon Wireless Arena in Manchester, New Hampshire,[18] and ended November 21 at Old National Center in Indianapolis.[19] Due to \"unforeseen production complications\", the November 15 show at the Bryce Jordan Center in State College, Pennsylvania, was canceled and replaced with a performance the same day at the Times Union Center in Albany, New York.[20] A three-show New Year's Eve run (announced on October 14, 2011) took place on December 29, 30, and 31 at Bill Graham Civic Auditorium in San Francisco.[21]\n"
            ]
         },
         "2012": {
            "text": [
               "A 2012 East Coast spring tour (announced on December 9, 2011), which included only three venues, began on April 5 at Wang Theatre in Boston and ended with an eight-night run at the Beacon Theatre in New York, including an April 7 show at Toyota Presents: The Oakdale Theatre in Wallingford, Connecticut.[22]  Preceding the spring tour Furthur played two shows at the Wanee Festival in Live Oak, Florida, on April 20–21. The band played a rare single \"extended\" set show both nights with no set break. For the April 21 show Jeff Chimenti did not play the Hammond B3 organ because of the rain. A warm up before the summer tour took place at Phil Lesh's Terrapin Crossroads June 27–30. A summer tour of the East and Midwest (announced on March 2, 2012) took place in July. The tour began at McCoy Stadium in Pawtucket, Rhode Island, on July 5 and ended at the Meadow Brook Music Festival in Rochester Hills, Michigan, on July 18. A West Coast Tour in September began with a 3-night run at Red Rocks Amphitheatre in Morrison, Colorado and ended on October 7 at the Santa Barbara Bowl in Santa Barbara, California.[23] Furthur's traditional New Year's Eve run took place on December 29, 30, and 31 at Bill Graham Civic Auditorium.\n"
            ]
         },
         "2013": {
            "text": [
               "Furthur began touring in 2013 with four surprise shows at the tiny Sweetwater Music Hall in Mill Valley, California on January 16, 17, 18, and 19. They later booked a winter tour, on which they played at only two venues: the Ogden Theatre in Denver on February 21, and the 1stBank Center in Broomfield, Colorado on the 22nd, 23rd, and 24th. In April Furthur began a spring tour with ten nights at the Capitol Theatre in Port Chester, New York on April 15–25, a show at the Boardwalk Hall in Atlantic City on the 27th, originally culminating in an appearance at the BottleRock Napa Valley Festival on May 9. The band withdrew from Bottlerock, due to injuries guitarist Bob Weir sustained after a fall on the final night of the Capitol Theatre run. Furthur has also announced a summer/autumn tour, starting at the Barclays Center in Brooklyn on July 11 and ending at the Greek Theatre in Los Angeles on October 6. During this tour Furthur played at All Good music festival in Thornville, Ohio July 20 and 21. Furthur also began their early fall tour by headlining 3 nights (4 sets) at the first Lockn' Music Festival in Arrington Virginia on September 6, 7 and 8.  Furthur then played four nights at Red Rocks, in Morrison, Colorado, starting with the full moon show September 19 and concluding on Sunday, September 22 with guest Branford Marsalis.\n"
            ]
         },
         "2014": {
            "text": [
               "Furthur announced that they would be taking a hiatus in 2014 so that Bob and Phil might do some solo projects.[24]\n",
               "On April 30, 2014 it was announced that Furthur would be playing their only set of 2014 at the Lockn festival in Virginia. This performance was to feature the original Furthur lineup consisting of Phil Lesh, Bob Weir, Jeff Chimenti, John Kadlecik, Jay Lane, and Joe Russo.[25] This performance was later cancelled.\n",
               "On November 4, 2014, it was announced via their website that Furthur had broken up.\n"
            ]
         }
      },
      "Special appearances": {
         "text": [
            "On Monday, August 9, 2010, the San Francisco Giants held a Jerry Garcia Tribute Night at AT&T Park, sponsored by Ben & Jerry's, the Rex Foundation, and the 8th Annual Jerry Day. The Giants played the Chicago Cubs, and the National Anthem was sung by Phil Lesh, Bob Weir, and Jeff Pehrson.[26][27] Later that season, the Giants played the Philadelphia Phillies in the National League Championship Series, and on Thursday, October 21, 2010 (Game 5 of the NLCS), the National Anthem was once again sung by Lesh, Weir, and Pehrson.[28][29] The following year, on Tuesday, August 9, 2011, the Giants celebrated the 2nd annual Grateful Dead Night (on Jerry Day), playing the Pittsburgh Pirates. The National Anthem was sung by Lesh, Weir, and Giants' 3rd base coach and singer-songwriter Tim Flannery, and the 7th inning stretch was led by Mickey Hart and Bill Walton.[30][31]\n",
            "On Tuesday, June 7, 2011, Furthur performed live at Tamalpais Research Institute (a.k.a. TRI Studios) in San Rafael, California. TRI is a virtual music venue created by Bob Weir.[32][33][34] The event, billed as \"Furthur Experiments at TRI\", was broadcast in real time over the internet in HD video with stereo sound and was available to those who ordered the pay-per-view event for $19.95. The performance included 13 songs (counting Terrapin Suite as one song), had no break, and lasted about two-and-a-half hours, beginning 6:00PM PDT. On December 23, 2011, TRI rebroadcast, without charge, the June 7, 2011 Furthur event, rebilled as \"The Night Before the Night Before Christmas\", at 4:00 PM PST and 7:00 PM PST.[35] On December 25, 2011, TRI announced that RatDog will reunite for a free webcast on January 25, 2011 at 5:00 PM PST.[36]\n",
            "On March 29, 2011, Phil Lesh posted a statement on the Furthur.net site community message board that he was planning to open a new live music venue in Marin County, California, in the near future. Said Lesh, \"We're taking the first steps to make a long time dream—a permanent musical home—come true. We are purchasing a building in Marin, and plan on remodeling it to feel like an old barn; we're calling it Terrapin Landing. We will continue with Furthur while making music at Terrapin Landing when we are at home.\"[37][38][39]  On January 2, 2012 Lesh announced that the venue, now known as Terrapin Crossroads, would be located at the current location of the Seafood Peddler in San Rafael. Furthur had done some rehearsal shows in their Palm Ballroom.\n"
         ]
      },
      "text": [
         "Four months after Jerry Garcia's death in August 1995, the Grateful Dead officially disbanded.[2] However, band members continued to perform over the subsequent years in other bands such as RatDog, Phil Lesh and Friends, the Rhythm Devils, the Other Ones, and the Dead. After a four-year hiatus following their \"Wave That Flag\" summer tour in 2004, the Dead performed two 2008 shows supporting the Obama campaign, billed as \"Deadheads for Obama\" and \"Change Rocks\", as well at one of the Obama inaugural balls in 2009, ultimately giving rise to a 2009 spring tour. During this reunion, Weir and Lesh, who admitted having great fun playing together again, decided to form a new band. In August 2009, the musicians announced that they had formed a new band, Furthur, with Kadlecik, Chimenti, Lane, and Russo.[1][3]\n",
         "The band was named after the 1939 International Harvester psychedelic multicolored bus used by novelist Ken Kesey and his Merry Pranksters to tour America in 1964 when they attended the New York World's Fair for the debut of Kesey's second novel, Sometimes A Great Notion. \"Furthur\" was the inscription on the destination placard of the bus and was also the name given to the multicolored bus. \"In many ways, the 'Furthur' destination of the bus—piloted by Neal Cassady, inspiration for the character Dean Moriarty in Jack Kerouac's On the Road—represented the mind-set of the transition from Beat Generation culture to the more heavily drug-infused hippie culture and the LSD-based psychedelic culture, with Ken Kesey, Neal Cassady, the Merry Pranksters, and the Grateful Dead—all alumni of the Acid Tests—as ambassadors and guides on that cognitive and conceptual journey\". The Grateful Dead performed as the house band for many of the Acid Tests, which ran from 1965 to 1966.[4]\n",
         "Furthur retained much of the characteristic style and texture of the Dead. In addition to performing many of the songs regularly played in concert by the Dead, Furthur tried to \"keep it fresh\" by routinely adding new material to their setlists. This included many songs resurrected from the Grateful Dead's extensive songbook, including several rarely or never performed live, like \"Alice D. Millionaire\", as well as several cover songs from bands including the Beatles, the Rolling Stones, Bob Dylan, the Band, Pink Floyd, Led Zeppelin, Ryan Adams, Van Morrison and the Clash. They also regularly performed some new, original material.\n"
      ]
   },
   "Members": {
      "Furthur": {},
      "Guest performers": {},
      "Tour staff & crew": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Furthur was a rock band founded in 2009 by former Grateful Dead members Bob Weir and Phil Lesh. The original lineup also included John Kadlecik of the Dark Star Orchestra on lead guitar, RatDog's Jeff Chimenti on keyboards and Jay Lane on percussion, and Joe Russo of the Benevento/Russo Duo on drums.[1] Named after the famous touring bus used by Ken Kesey and the Merry Pranksters in the 1960s, Furthur was an improvisational jam band that performed music primarily from the extensive Grateful Dead songbook, as well as their own original music and that of several other well-known artists. In addition to the original members (with the exception of Jay Lane, who left the band in March 2010 to rejoin his previous band, Primus), the band's lineup included backup vocalists Sunshine Becker of the a cappella ensemble SoVoSó and Jeff Pehrson of the folk rock bands Box Set and the Fall Risk.\n",
      "Four months after Jerry Garcia's death in August 1995, the Grateful Dead officially disbanded.[2] However, band members continued to perform over the subsequent years in other bands such as RatDog, Phil Lesh and Friends, the Rhythm Devils, the Other Ones, and the Dead. After a four-year hiatus following their \"Wave That Flag\" summer tour in 2004, the Dead performed two 2008 shows supporting the Obama campaign, billed as \"Deadheads for Obama\" and \"Change Rocks\", as well at one of the Obama inaugural balls in 2009, ultimately giving rise to a 2009 spring tour. During this reunion, Weir and Lesh, who admitted having great fun playing together again, decided to form a new band. In August 2009, the musicians announced that they had formed a new band, Furthur, with Kadlecik, Chimenti, Lane, and Russo.[1][3]\n",
      "The band was named after the 1939 International Harvester psychedelic multicolored bus used by novelist Ken Kesey and his Merry Pranksters to tour America in 1964 when they attended the New York World's Fair for the debut of Kesey's second novel, Sometimes A Great Notion. \"Furthur\" was the inscription on the destination placard of the bus and was also the name given to the multicolored bus. \"In many ways, the 'Furthur' destination of the bus—piloted by Neal Cassady, inspiration for the character Dean Moriarty in Jack Kerouac's On the Road—represented the mind-set of the transition from Beat Generation culture to the more heavily drug-infused hippie culture and the LSD-based psychedelic culture, with Ken Kesey, Neal Cassady, the Merry Pranksters, and the Grateful Dead—all alumni of the Acid Tests—as ambassadors and guides on that cognitive and conceptual journey\". The Grateful Dead performed as the house band for many of the Acid Tests, which ran from 1965 to 1966.[4]\n",
      "Furthur retained much of the characteristic style and texture of the Dead. In addition to performing many of the songs regularly played in concert by the Dead, Furthur tried to \"keep it fresh\" by routinely adding new material to their setlists. This included many songs resurrected from the Grateful Dead's extensive songbook, including several rarely or never performed live, like \"Alice D. Millionaire\", as well as several cover songs from bands including the Beatles, the Rolling Stones, Bob Dylan, the Band, Pink Floyd, Led Zeppelin, Ryan Adams, Van Morrison and the Clash. They also regularly performed some new, original material.\n"
   ]
}