{
   "Name": "The Gabe Dixon Band",
   "rawData": [
      "The Gabe Dixon Band was a three-piece band that was formed in the fall of 1998 at the University of Miami. The band played piano-driven rock and was named after Gabe Dixon, the lead vocalist and pianist of the band. After the band broke-up in 2010, Dixon has continued as a solo artist.\n",
      "In 1999, the band worked with producer/engineer Eddie Kramer to independently release their debut album, More Than It Would Seem. Upon graduation from the University of Miami, they relocated to New York City and were signed to Reprise by David Kahne. They released their major label debut, On a Rolling Ball, in 2002. Three years later, they released the Live at World Cafe EP, which featured the song \"All Will Be Well,\" which was featured in promos for the NBC show Conviction.\n",
      "Prior to the release of On a Rolling Ball, Dixon played keyboards and sang backing vocals on Paul McCartney's 2001 album, \"Driving Rain.\" Dixon also performed live with McCartney at the Concert For New York City, a September 11 fundraiser. McCartney offered Dixon the opportunity to join his world tour, but Dixon declined the position to focus on the production of On a Rolling Ball.\n"
   ],
   "infobox": {
      "Origin": [
         "United States"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1998–2010"
      ],
      "Past members": [
         "Gabe Dixon",
         "Jano Rix ",
         "Chandler Webber"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was a [GENRE] band that was formed in the fall of [YEAR] at the University of Miami. The band played piano-driven rock and was named after [PERSON_NAME_FULL_0_MALE], the lead vocalist and pianist of the band. After the band broke-up in [YEAR], [PERSON_NAME_LAST_0] has continued as a solo artist.\n",
      "In [YEAR], the band worked with producer/engineer [PERSON_NAME_FULL_0_MALE] to independently release their debut album, More Than It Would Seem. Upon graduation from the University of Miami, they relocated to New York City and were signed to Reprise by [PERSON_NAME_FULL_1_MALE]. They released their major label debut, On a Rolling Ball, in [YEAR]. Three years later, they released the Live at World Cafe EP, which featured the song \"All Will Be Well,\" which was featured in promos for the NBC show Conviction.\n",
      "Prior to the release of On a Rolling Ball, Dixon played keyboards and sang backing vocals on Paul McCartney's [YEAR] album, \"Driving Rain.\" Dixon also performed live with McCartney at the Concert For New York City, a [MONTH] 11 fundraiser. McCartney offered Dixon the opportunity to join his world tour, but Dixon declined the position to focus on the production of On a Rolling Ball.\n"
   ]
}