{
   "Name": "Ghosts of Jupiter",
   "Sections": [
      "Summary",
      "Ghosts of Jupiter: Music Experience at the Museum of Science"
   ],
   "Summary": {
      "text": [
         "Ghosts of Jupiter is a psychedelic rock band based out of the Boston area, previously known as the Nate Wilson Group.  Led by former Percy Hill keyboardist Nate Wilson, the band features a loud, riff-heavy sound inspired by classic rock groups such as Led Zeppelin, Black Sabbath, and Cream.  GOJ features Adam Terrell (also of Assembly of Dust) and Jason Cohen (formerly of the Ryan Montbleau Band), while MIT graduate bassist Tommy Lada and drummer Tom Arey (also touring with J. Geils Band) hold down the band's rhythm section.\n",
         "Band leader, Wilson, a New England Conservatory of Music graduate, has also worked as a freelance and session musician, appearing on stage and in the studio with artists such as Chuck Berry, John Scofield, Peter Bernstein, Stephen Perkins of Jane’s Addiction, and members of Phish and the Allman Brothers Band.\n",
         "Ghosts of Jupiter’s self-titled album was released in November, 2011.\n",
         "In the spring of 2012, Ghosts of Jupiter competed in the 23rd annual WBCN Rock & Roll Rumble .\n",
         "The band is currently in the studio, targeting the release of their next album, Great Bright Horses, in the fall of 2016.\n"
      ]
   },
   "Ghosts of Jupiter: Music Experience at the Museum of Science": {
      "text": [
         "On June 22, 2012 Ghosts of Jupiter: Music Experience premiered at the Boston Museum of Science’s Charles Haydn Planetarium.  Ghosts of Jupiter: Music Experience combines the band’s eponymous album with 45 minutes of animations created exclusively for the show.\n"
      ]
   },
   "coreData": [
      "Ghosts of Jupiter is a psychedelic rock band based out of the Boston area, previously known as the Nate Wilson Group.  Led by former Percy Hill keyboardist Nate Wilson, the band features a loud, riff-heavy sound inspired by classic rock groups such as Led Zeppelin, Black Sabbath, and Cream.  GOJ features Adam Terrell (also of Assembly of Dust) and Jason Cohen (formerly of the Ryan Montbleau Band), while MIT graduate bassist Tommy Lada and drummer Tom Arey (also touring with J. Geils Band) hold down the band's rhythm section.\n",
      "Band leader, Wilson, a New England Conservatory of Music graduate, has also worked as a freelance and session musician, appearing on stage and in the studio with artists such as Chuck Berry, John Scofield, Peter Bernstein, Stephen Perkins of Jane’s Addiction, and members of Phish and the Allman Brothers Band.\n",
      "Ghosts of Jupiter’s self-titled album was released in November, 2011.\n",
      "In the spring of 2012, Ghosts of Jupiter competed in the 23rd annual WBCN Rock & Roll Rumble .\n"
   ]
}