{
   "Name": "God Street Wine",
   "rawData": [
      "God Street Wine (also known as GSW) is a jam band from New York City. Their music is an amalgam of rock, jazz, bluegrass, funk, psychedelia, pop, Americana, reggae, progressive, and more. The band broke up in 1999 and reunited in 2009. GSW played a significant role in the development of the improvisational jam band scene of the early 1990s. Their earliest days include playing Nightingale's and The Wetlands Preserve in New York City where their contemporaries were The Spin Doctors, Blues Traveler, Jono Manson and the Dreyer Brothers. From their earliest days, fans of the band were known as Winos. This group of dedicated fans would follow them from gig to gig. When their touring base expanded Winos would sometimes drive hours to see the band. GSW was an early adapter of internet marketing, acquiring a domain name and electronic mailing list ahead of many others in the scene.  They also maintained a snail mail list and telephone hotline fans could call to get tour dates from a recorded message. Occasionally callers would be surprised by a band member answering the phone and replying to their inquiry personally.\n",
      "Numerous bands and musicians that went on to achieve major success opened for them over the years ranging from Dave Matthews Band, Sheryl Crow and Hootie and the Blowfish to the Ominous Seapods, G. Love & Special Sauce and Dispatch. God Street Wine toured the U.S. with H.O.R.D.E. four times and opened for the Black Crowes and The Allman Brothers Band.\n",
      "The band is composed of Lo Faber (lead vocals, guitar), Aaron Maxwell (lead vocals, guitar), Tom Osander (drums, percussion, backing vocals), Dan Pifer (bass, backing vocals), and Jon Bevo (keyboards). Lo Faber and Dan Pifer met as students at NYU in 1986. Eventually they both transferred to Manhattan School of Music, to study jazz, where they met Aaron Maxwell (Lieberman). As it happened, his father Hal Lieberman was a trumpet and Jazz Improvisation teacher at Manhattan School of Music. Faber and Tom Osander were high school friends who had previously been in bands together. Pifer had met Jon Bevo earlier at NYU and he jammed with them on keyboards, eventually joining when the band began to coalesce.\n"
   ],
   "infobox": {
      "Also known as": [
         "GSW"
      ],
      "Origin": [
         "New York, NY, U.S."
      ],
      "Genres": [
         "Jam Band, Jazz, Rock, Americana, Reggae, Pop, Psychedelia, Bluegrass, Progressive, Funk"
      ],
      "Years active": [
         "1988–1999, 2001, 2009–present"
      ],
      "Labels": [
         "Ripe and Ready, Mercury/PolyGram, Geffen/MCA"
      ],
      "Associated acts": [
         "Ominous Seapods, moe., Blues Traveler, Spin Doctors, Strangefolk"
      ],
      "Website": [
         "godstreetwine.com"
      ],
      "Members": [
         "Aaron Maxwell (Lieberman)",
         "Dan Pifer",
         "Jon Bevo (Liebowitz)",
         "Tom Osander (Tomo)",
         "Lo Faber"
      ],
      "Past members": [
         "Howard Collins",
         "Peter Levin",
         "Aubrey Dayle",
         "Jason Crosby"
      ]
   }
}