{
   "Name": "God Street Wine",
   "Sections": [
      "1 History",
      "1.1 1988: Official beginnings and first gig",
      "1.2 1989-1990: The 712 Club",
      "1.3 1991: The Great Northern and full time commitment",
      "1.4 1992: Recording of Bag",
      "1.5 1993: New management and release of Who's Driving?",
      "1.6 1994: The road goes on, Geffen Records and $1.99 Romances",
      "1.7 1995-1996: Emancipation from Geffen contract, recording and release of Red",
      "1.8 1997: Release of God Street Wine",
      "1.9 1998: Departure of Bevo and Osander, recording of Hot! Sweet! and Juicy!",
      "1.10 1999: End of the road",
      "1.11 2000: Good To The Last Drop",
      "1.12 2001: Closing of The Wetlands Preserve and First Reunion",
      "2 Return",
      "2.1 2008: Bring Back God Street Wine",
      "2.2 2009: Death of Paul Ducharme and second reunion",
      "2.3 2010: Reunion to benefit The National Multiple Sclerosis Society",
      "2.4 2011: Jam Cruise, jamming with Bob Weir, Lo & Aaron Gigs",
      "2.5 2012: West Coast and return to Gramercy Theatre",
      "2.6 2013: Terrapin with Phil and Friends, The Capitol Theater and 25th Anniversary",
      "2.7 2014: Return of JBLO",
      "3 Recent activities",
      "3.1 2016: New recording, dates with Strangefolk",
      "3.2 2017: Peach Fest and new music",
      "3.3 2018: Summer tour and 30th Anniversary",
      "3.4 2019: Summer tour and new album, This Fine Town",
      "4 Band members",
      "4.1 Current members",
      "4.2 Former members",
      "5 Discography",
      "6 Live audio",
      "7 Side projects",
      "8 References",
      "9 External links"
   ],
   "Summary": {
      "text": [
         "God Street Wine (also known as GSW) is a jam band from New York City. Their music is an amalgam of rock, jazz, bluegrass, funk, psychedelia, pop, Americana, reggae, progressive, and more. The band broke up in 1999 and reunited in 2009. GSW played a significant role in the development of the improvisational jam band scene of the early 1990s.[1] Their earliest days include playing Nightingale's and The Wetlands Preserve in New York City where their contemporaries were The Spin Doctors, Blues Traveler, Jono Manson and the Dreyer Brothers. From their earliest days, fans of the band were known as Winos.[2] This group of dedicated fans would follow them from gig to gig. When their touring base expanded Winos would sometimes drive hours to see the band. GSW was an early adapter of internet marketing, acquiring a domain name and electronic mailing list ahead of many others in the scene.  They also maintained a snail mail list and telephone hotline fans could call to get tour dates from a recorded message. Occasionally callers would be surprised by a band member answering the phone and replying to their inquiry personally.[3]\n",
         "Numerous bands and musicians that went on to achieve major success opened for them over the years ranging from Dave Matthews Band, Sheryl Crow and Hootie and the Blowfish to the Ominous Seapods, G. Love & Special Sauce and Dispatch. God Street Wine toured the U.S. with H.O.R.D.E. four times and opened for the Black Crowes and The Allman Brothers Band.[4]\n",
         "The band is composed of Lo Faber (lead vocals, guitar), Aaron Maxwell (lead vocals, guitar), Tom Osander (drums, percussion, backing vocals), Dan Pifer (bass, backing vocals), and Jon Bevo (keyboards). Lo Faber and Dan Pifer met as students at NYU in 1986. Eventually they both transferred to Manhattan School of Music, to study jazz, where they met Aaron Maxwell (Lieberman). As it happened, his father Hal Lieberman was a trumpet and Jazz Improvisation teacher at Manhattan School of Music. Faber and Tom Osander were high school friends who had previously been in bands together. Pifer had met Jon Bevo earlier at NYU and he jammed with them on keyboards, eventually joining when the band began to coalesce.[5]\n"
      ]
   },
   "History": {
      "1988: Official beginnings and first gig": {
         "text": [
            "As the band came together in the second half of 1988 they recorded songs at the studio Sounds of Joy on West 46th Street where Pifer was working. ” Electrocute,” “Freight Train,” “She Said Dark,” ”Fortress of Solitude” and “Other Shore” were recorded. Most of those tunes have remained live staples throughout their career.  On December 13, 1988 God Street Wine played their first public gig at Nightingale's on Second Avenue in Lower Manhattan. This club becomes a regular haunt for them.[5] Other bands that got their start at the legendary Lower East Side venue include Blues Traveler and the Spin Doctors.[6]\n"
         ]
      },
      "1989-1990: The 712 Club": {
         "text": [
            "During 1989 the band became regulars at The Nightingale bar downtown and at The 712 Club on 125th Street. God Street Wine also started playing every downtown bar they could, many of them on Bleecker Street. They went into the studio and recorded an 8-song, cassette only release. John Popper of Blues Traveler was a guest soloist on one song.  In 1990 they recorded three nights at The 712 Club and eventually released “Live at the 712 Club.”[7]\n"
         ]
      },
      "1991: The Great Northern and full time commitment": {
         "text": [
            "1991 stands as a major turning point for God Street Wine. The decision was made to strive for being something greater than a bar band. All 5 members of the band and their crew moved into a single house in Ossining NY, which they dubbed \"The Great Northern.\" They quit their jobs and focused only on music and the business of being God Street Wine. This allowed them to rehearse at any time of day or night. In addition to their playing they also worked on their harmonies which were increasingly becoming a signature part of their sound.[3]\n"
         ]
      },
      "1992: Recording of Bag": {
         "text": [
            "By 1992 the band had been living together in Ossining, NY at The Great Northern for the better part of a year. With an entire house to themselves they wrote and rehearsed incessantly. By this point God Street Wine had been playing gigs for nearly 4 years and it was time to record a full-length release. They recorded their debut album Bag at the House of Music in West Orange, New Jersey, and Crossroads Studio in Manhattan. God Street Wine financed Bag themselves with the help of friends and sold it at shows before making a distribution deal with Ripe 'n' Ready.[5]\n"
         ]
      },
      "1993: New management and release of Who's Driving?": {
         "text": [
            "Scott Reilly who was running Bullethead Management in New York City became God Street Wine's manager.[8] By this point in time the band is recording most of their shows. Later in the year they released a live album Who's Driving? Their song of the same name does not make it onto the album.[9] They celebrated the release with at return to Irving plaza on October 9, 1993.\n"
         ]
      },
      "1994: The road goes on, Geffen Records and $1.99 Romances": {
         "text": [
            "In the mid 1990s God Street Wine was on the road all but constantly. 1994 was no exception to this. The work they had done in the last few years was paying off as they were playing increasingly larger venues and getting booked for lucrative college gigs and the like.[3] Their spring 1994 tour ended with a headline appearance at Port Chester's Capitol Theater. In January of that year they had signed with Geffen Records.  After time spent finding the right producer for their major label debut the band decamped to Memphis. They spent 6 weeks at Beale Street Studios with producer Jim Dickinson and engineer Malcom Springer. The recording sessions were fruitful but fraught with tension between the band and Dickinson who threatened to drown the masters in the Mississippi river.  Despite the strain Faber insists there were benefits to working with Dickinson, “One of the best things Jim did was bring in a vocal coach named Sanchez Harley. He was a black, gospel choir director. He taught us over the course of two weeks, of twelve hour days, four part church harmonies and apply it to all our songs.[10] It made a huge difference in the sound of the band.” The final mix was completed in New York City. “$1.99 Romances” was releases by Geffen / Eleven Records in September 1994.\n"
         ]
      },
      "1995-1996: Emancipation from Geffen contract, recording and release of Red": {
         "text": [
            "Having had a less than stellar experience with Geffen Records, during the recording and promotion of $1.99 Romances, the band was relieved in 1995 to be released from their contract. They turned their house into a 52 track recording studio and started work on their next album. Free from the constraints of a label, and financing the project themselves, God Street Wine took a different approach to recording. Previous projects were based on road tested songs that in some cases had been played live for years. In this case they chose to write new songs during the recording sessions. In addition they recorded in a segmented fashion, finishing one tune before moving on to the next.[3] When the album (Red) was complete the band released it themselves. Some months later they signed to Mercury Records who re-released and distributed “Red.”[11] In 1996 the band shot a video for the song \"RU 4 Real\".\n"
         ]
      },
      "1997: Release of God Street Wine": {
         "text": [
            "On April 3, 1997 God Street Wine returned to The Wetlands Preserve billed as \"Jon Bevo's Love Orchestra.\" They used the return to their old home venue to test out songs for their next album. Of the 25 songs they played, 10 would appear on their new album which they entered the studio to record one week later. On October 7, 1997 God Street Wine released their self-titled fourth studio album through Mercury Records. The album was produced by Bill Wray and included guest contributions from Little Feat co-founder Bill Payne.[12]\n"
         ]
      },
      "1998: Departure of Bevo and Osander, recording of Hot! Sweet! and Juicy!": {
         "text": [
            "In January 1998 God Street Wine announced a two-week Shindig Tour. The tour featured them performing a combination of re-arranged songs in a mostly acoustic format and also tackling some new covers. The format was tested out with a 2 night stand in early January 1998 at The Wetlands Preserve. In the spring of 1998 Osander and Bevo expressed a desire to curtail touring. Pifer, Faber & Maxwell had no desire to curb their touring activities so Bevo and Osander chose to step away from God Street Wine.[13] After holding auditions in New York City Aubrey Dayle and Peter Levin were recruited on drums and keyboards respectively. Their first public performance with the band was a two night stand at The Rhinecliff where they billed themselves as Aaron Maxwell's Intimacy Workshop. In late summer of 1998 God Street Wine entered Long View Farms Studio in rural Massachusetts to record their 3rd album for Mercury Records. Along with new members Levin and Dayle, they were joined in the studio by Jon Bevo. The Eighteen Songs they recorded included both brand new compositions, a few of their oldest songs that hadn't been recorded prior, and a cover of Paul McCartney's “Maybe I’m Amazed.”  While they were recording the album Mercury Records, as well as its parent company Polygram were bought out by Seagram's / Universal. When the album was turned in to the label they rejected it as unfinished, a claim the band flatly disputed. God Street Wine was forced to sue to receive payment for the album.  The legal process was long and protracted. The resulting album, “Hot! Sweet! and Juicy!” remains unreleased to this day. Demos of several songs that were intended for that album later made it to their 25th Anniversary Box Set.[14]\n"
         ]
      },
      "1999: End of the road": {
         "text": [
            "Towards the end of 1999 God Street Wine announced that they would be retiring from the road and disbanding. The possibility of future recording projects was left open. To put a close to this chapter the band announced a three night run (December 21–23, 1999) at The Wetlands Preserve, the club that had served as home base during their upward trajectory. The shows marked the return of Osander and Bevo who had left midway through 1998. Peter Levin, Aubrey Dayle, and Jason Crosby participated alongside the original lineup. On the first night, God Street Wine played a 3 set show, the first acoustic, the next two electric. The second night saw bluegrass band Phineas Gage fronted by Ominous Seapods co-founder Max Verna open up. Special guests sit-ins with GSW that night included John Popper of Blues Traveler and Oteil Burbridge of the Allman Brothers Band. The final night featured known GSW associates Ominous Seapods as the opener. Over 3 nights and 7 sets of music God Street Wine repeated a single song, \"Into The Sea\", one of their signature tunes.[15] Order Forms at the merchandise table advertised a double live album to be released from these shows. Some months later, \"Good To the Last Drop\" was released as a double CD.\n"
         ]
      },
      "2000: Good To The Last Drop": {
         "text": [
            "On July 11, 2000 God Street Wine released the double CD Live Album Good To The Last Drop.[16] The nearly ​2 1⁄2-hour set was culled from their 3 final shows at The Wetlands Preserve the December prior.\n"
         ]
      },
      "2001: Closing of The Wetlands Preserve and First Reunion": {
         "text": [
            "In the Summer of 2001 it was announced that The Wetlands Preserve, the downtown NYC Club that had become a haven for the Jam band scene and an early home club for God Street Wine was closing at the end of September. Several bands, such as Spin Doctors, reunited to honor the club's legacy. God Street Wine reunited their original lineup and played on September 3, 2001.[17]  The show appropriately began with \"Home Again\" from Bag, their initial release from nearly a decade earlier. Max Verna & Dana Monteith from GSW Associates Ominous Seapods appeared as one of several opening acts.[18] One of recordings of the show at archive.org is the most accessed recording of any God Street Wine show available on that platform.\n"
         ]
      }
   },
   "Return": {
      "2008: Bring Back God Street Wine": {
         "text": [
            "On July 8, 2008, Long Island's David Katz created the fan Facebook page \"Bring Back God Street Wine\".  In Katz's own words, “I was listening to some GSW in my office and thought, I miss these guys, I wish they would play again - I decided to search Facebook and see if there were any like-minded individuals - when I searched God Street Wine all I found were a few people who listed them on the section of music they liked - so i decided to start a page and see if I could get some attention.”  Soon after starting it long time winos and eventually members of the band themselves joined the group. This made Bring Back God Street Wine (BBGSW) the new virtual home for fans. During the 1990s it was fine-wine the email discussion group. The existence of the page and the fan community finding a new home, helped the band realize there would be an audience if they chose to play.[19]\n"
         ]
      },
      "2009: Death of Paul Ducharme and second reunion": {
         "text": [
            "In early 2009 Paul Ducharme, a beloved friend of the band passed away. Ducharme was among the earliest and most passionate supporters of the band as well as a one time employee. For the first time since they reunited when Wetlands Preserve was closing, they reformed in the afternoon of May 30 with their original lineup to play a tribute show in Ridgewood, NJ. Later that evening the band played a second semi-private show in Wyckoff, NJ that lasted way into the early morning hours.[20] Winos in attendance at the evening performance felt certain this would lead to future reunions.\n"
         ]
      },
      "2010: Reunion to benefit The National Multiple Sclerosis Society": {
         "text": [
            "On March 5, 2010 God Street Wine announced an updated website and said, \"We thought it wise to alert you to this change and more importantly we have some additional news we hope you find pleasing. Check back on one of the links listed below anytime after 12:01am ET this Monday the 8th of March for a very special announcement.\"[21] They followed up on March 8, 2010, announcing on the band's website, that it would be reuniting its original lineup for two shows at New York's Gramercy Theatre. The concerts would take place on July 9 and 10, and all proceeds were to benefit the National Multiple Sclerosis Society. These shows sold out within minutes during the pre-sale. Several days later God Street Wine announced two additional shows a week later July 16. and 17th. This would mark their return to Irving Plaza, a venue they were the first unsigned band to sell out,[7] after more than a decade.[22] The fan Facebook page Bring Back God Street Wine was nominated for the a VH1 Do Something Award in the Category \"Do Something on Facebook.\"[23] This was a culmination of the group inspiring the band to reunite and the result of the reunion being shows for charity.\n"
         ]
      },
      "2011: Jam Cruise, jamming with Bob Weir, Lo & Aaron Gigs": {
         "text": [
            "In the spring of 2010, soon after the band announced shows at Gramercy Theater and Irving Plaza, offers for other gigs started to pour in. Most of those were turned down as each of the band members had careers and other commitments. One offer however, would prove too tempting to say no to. The organizers of Jam Cruise, which already had 8 successful excursions under its belt offered God Street Wine a spot on the 9th edition and they accepted. From January 4 through 9th of 2011 God Street Wine participated in Jam Cruise 9 aboard MSC Poesia. Other participants included Bob Weir, Karl Denson's Tiny Universe, Anders Osborne, George Porter and many more. GSW performed two full sets, one in an indoor theater and another on the Main Stage on the Deck of the ship. For their Theater performance they were joined by Bob Weir from the Grateful Dead.[24] While Jam Cruise would be God Street Wine's only full band performances of the year, subsets of the band collaborated. Lo Faber and Aaron Maxwell played a string of dates throughout the year as an acoustic duo. On some occasions they were joined by Bevo and Pifer.  Notably, on July 22, 2011 Bevo, Faber, Pifer, and Maxwell backed by Joe Russo on drums, and accompanied by Jason Crosby on fiddle, appeared at The Gathering of the Vibes in Bridgeport, CT.[25]\n"
         ]
      },
      "2012: West Coast and return to Gramercy Theatre": {
         "text": [
            "In March 2012 God Street Wine announced via their website and social media that they would be returning to play in California for the first time in nearly 15 years. Their trip out west included a show at Bob Weir's TRI Studios. The TRI show was webcast live and the band recreated their 1994 album  $1.99 Romances in its entirety. Later in the set Bob Weir joined them once again for a number of songs as did Shana Morrison, daughter of Van.[26] Later that evening they played another set at errapin Crossroads. There they were joined onstage by club proprietor and Grateful Dead bassist Phil Lesh.[27] While out west the band played two shows at Sweetwater Music Hall, a venue owned by Bob Weir. A week later, back on the east coast, they played three sold out nights at Gramercy Theatre, a venue that has become their de facto home since reuniting in 2009. Musician Jason Crosby a one time member of the band joined them for all of the summer 2012 shows.[28]\n"
         ]
      },
      "2013: Terrapin with Phil and Friends, The Capitol Theater and 25th Anniversary": {
         "text": [
            "In January 2013 God Street Wine returned to the Bay Area and played 3 nights at Phil Lesh's Terrapin Crossroads as part the bassists \"Phil & Friends\" series. In addition to serving as Lesh's band each night they also opened all three shows with sets of original God Street Wine music. For the first of these shows Bob Weir sat in for the entire second set.[29]\nThe summer of 2013 found God Street Wine performing two nights in New York City at Brooklyn Bowl, their first shows at that venue. They capped the summer off with their first appearance at Port Chester's The Capitol Theatre since the mid 1990s.[30] Both venues are run by former Wetlands owner Peter Shapiro, a longtime supporter of the band.[31]\n",
            "In November 2013, God Street Wine announced their first official release in 13 years, the 7-disc 25th Anniversary Boxed Set.[32] Included in the lavish box-set is a feature-length documentary on the band's history, entitled All The Way To Here. This documentary was directed by Lynn Kestenbaum, a longtime wino and friend of the band. The other 6 discs include remixes of the albums Bag and Who's Driving?. The live version of $1.99 Romances recorded at TRI Studios in 2012 with special guest Bob Weir,  and a two-disc collection of unreleased rarities and concert-staples, called Gots To Rewind make up the rest of the set. God Street Wine ended their busiest year since reuniting with two celebratory nights (December 20 and 21) at the Gramercy Theatre In New York City. As opposed to the average God Street Wine show that often includes a few covers, the band stuck to original material, save for a Christmas instrumental. They also eschewed any guest sit-ins and kept it to the original 5 of Maxwell, Bevo, Faber, Pifer and Osander.[33]\n"
         ]
      },
      "2014: Return of JBLO": {
         "text": [
            "In the 1990s when God Street Wine was a full-time touring band they occasionally played undersell shows at venues they had outgrown. On these occasions they most often billed themselves as Jon Bevo's Love Orchestra. In July 2014 they brought the alias back and played Garcia's at The Capitol Theater in Port Chester, NY. The show was recorded by WPKN 89.5 in Bridgeport, CT and broadcast by them the following week. This would stand as the band's only activity of 2014.[34]\n"
         ]
      }
   },
   "Recent activities": {
      "2016: New recording, dates with Strangefolk": {
         "text": [
            "In January 2016 God Street Wine played shows with Strangefolk and Assembly of Dust at the Capitol Theater in Port Chester, New York and the Paradise Rock Club in Boston, MA.[35] In advance of those shows the band released Oh Wonderful One, their first new recording in 19 years.[36] The song was made available on all major download and streaming services. \nIn November 2016 God Street Wine performed a sold-out show at The Cutting Room in New York City.[37] They played a seated acoustic set followed by a fully plugged electric set. Discussion on the fan Facebook page \"Bring Back God Street Wine\" indicated that fans found this to be one of the favorite performances since the band has reunited.\n"
         ]
      },
      "2017: Peach Fest and new music": {
         "text": [
            "In the summer of 2017, God Street Wine made their debut at The Peach Music Festival in Scranton, PA. This festival was started by The Allman Brothers Band. They also played Brighton Music Hall in Boston and once again returned to The Gramercy Theater in New York City.[38]\nThis trio of shows was not the biggest news from the band in 2017. Fans were treated to seven brand new recordings throughout the year. Six of them were recently written songs and one, \"Souvenir\", was a rearranged Jon Bevo composition from the 1990s. Most of the songs were released leading up to the summer shows, but one \"Five Tunnels\" came out on New Year's Eve and capped off the year in style for the band and their fans. All of the new music was made available for download and streaming through major services.\n"
         ]
      },
      "2018: Summer tour and 30th Anniversary": {
         "text": [
            "In the spring of 2018, God Street Wine announced a 5 city tour to begin the celebration of their 30th Anniversary. Starting on July 29 in Chicago and travelling to Washington D.C., Philadelphia, Boston, and New York City the band played 4 City Winery locations as well as Ardmore Music Hall (Philadelphia). On June 15, 2018 God Street Wine announced that their seminal 1994 album \"$1.99 Romances\" was once again available after spending two decades out of print. In addition to availability on streaming services such as Spotify, it was also made available for purchase at cdbaby and Bandcamp.[39] In advance of their Summer 2018 Tour God Street Wine released two new studio recordings \"Smile on us Sarah\", and \"On The Shores of Silver Lake\". \"Simle On Us Sarah\" was notable for being the first of the band's post-reunion batch of songs to feature Aaron Maxwell as lead vocalist.[40]\nIn early December 2018 God Street Wine released a video to their YouTube channel featuring a performance of the instrumental composition \"Stupid Hat\". This performance is notable for being recorded remotely. Pifer, Bevo and Maxwell in New York, Osander in Berlin, and Faber in New Orleans. Later that month they capped off their 30th Anniversary year with a career spanning 3 set performance at New York's Gramercy Theater.[40]\n"
         ]
      },
      "2019: Summer tour and new album, This Fine Town": {
         "text": [
            "On April 3, 2019,  announced via their Facebook page that they will participate in moe.down, a festival in Upstate New York organized by their contemporary's moe.[41] This will mark God Street Wine's first appearance at this festival. Lo Faber previously played the festival in with the Lo Faber Band days before the first God Street Wine reunion. moe. has been hosting this festival since 2000.[42]\n",
            "On April 16, 2019, God Street Wine announced via social media and their website that they will play seven shows in the summer of 2019, in addition to their previously announced appearance at moe.down.[43] Asbury Park, NJ, Richmond VA, Fairfield, Ct, and Hampton, NH are cities the band has not yet visited since reforming in 2009.\n",
            "One June 4, 2019, God Street Wine announced a new album This Fine Town and made it immediately available via all major online music streaming and download services. God Street Wine also announced that a limited edition, signed, physical copies of This Fine Town would also be for sale on their summer tour. The album was composed of eight tracks. Several had long been live staples that had never been recorded in the studio. Some were chestnuts from their earliest days that had not been played often in recent times. This marked their first new album length release of original material since 2000.[44]\n",
            "On June 13, 2019, God Street Wine announced the addition of a ninth date to their 2019 \"Birds and Bees\" Summer Tour. Max Verna and Tom Pirozzi from Ominous Seapods will fill in for Dan Pifer and Aaron Maxwell, and Pirozzi will fill in for Pifer during August and September. Jason Crosby will appear in the last four shows of Summer Tour.\n"
         ]
      }
   },
   "Band members": {
      "Current members": {},
      "Former members": {}
   },
   "Discography": {
      "text": [
         "+ Cassette Only\n"
      ]
   },
   "Live audio": {
      "text": [
         "Like most artists in the Jam Band community, God Street Wine has always allowed Audio Recording of their Live Shows. Many of them are available on the Live Music Archive. Here are 10 of the most popular shows.[46]\n"
      ]
   },
   "Side projects": {
      "text": [
         "In 2001 Lo Faber recorded and released the double album rock opera Henry’s House in upstate New York at his home Studio, The Great Northern.[47] In the fall of that year he assembled the Lo Faber Band which included 3 former members of Ominous Seapods. They toured the country for the next year playing large swaths of the album as well as God Street Wine material. In the summer of 2002 “Henry’s House” was recreated on stage at Hubbard Hall in Cambridge, NY.[48] The entire Lo Faber Band participated and was augmented for the Hubbard Hall residency by other musicians and actors.\nIn the fall of 2003 Faber released Friday Night Freakshow, a second double album rock opera. On November 22, 2019, Faber released the album Bottomland under the pseudonym Doctor Lo, featuring a new focus on bluegrass and folk.[49] He subsequently toured on the material with bassist Tom Pirozzi of the Ominous Seapods.[50]\n",
         "Upon leaving God Street Wine in 1998 Tom Osander relocated to Ireland.  After a short period playing with the band Poor Uncle Henry he recorded and toured for a number of years with Damien Rice.[51] He continued with Rice until 2007 when he left to work full-time with Lisa Hannigan. He recorded and toured with her until 2010. More recently he has played with and produced Hanna Lees, among other artists.[52][53]\n",
         "Aaron Maxwell (Lieberman) has played for much of the last decade with Metropolitan Hot Club, a Gypsy Jazz band. Their focus is music written, popularized or inspired by Django Reinhardt. Lieberman also plays in Swing Vipers whose focus is the music of the Great American Songbook. In February 2019 it was announced that Lieberman joined the Bruce Katz Band as guitarist and vocalist.[54]\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "God Street Wine (also known as GSW) is a jam band from New York City. Their music is an amalgam of rock, jazz, bluegrass, funk, psychedelia, pop, Americana, reggae, progressive, and more. The band broke up in 1999 and reunited in 2009. GSW played a significant role in the development of the improvisational jam band scene of the early 1990s.[1] Their earliest days include playing Nightingale's and The Wetlands Preserve in New York City where their contemporaries were The Spin Doctors, Blues Traveler, Jono Manson and the Dreyer Brothers. From their earliest days, fans of the band were known as Winos.[2] This group of dedicated fans would follow them from gig to gig. When their touring base expanded Winos would sometimes drive hours to see the band. GSW was an early adapter of internet marketing, acquiring a domain name and electronic mailing list ahead of many others in the scene.  They also maintained a snail mail list and telephone hotline fans could call to get tour dates from a recorded message. Occasionally callers would be surprised by a band member answering the phone and replying to their inquiry personally.[3]\n",
      "Numerous bands and musicians that went on to achieve major success opened for them over the years ranging from Dave Matthews Band, Sheryl Crow and Hootie and the Blowfish to the Ominous Seapods, G. Love & Special Sauce and Dispatch. God Street Wine toured the U.S. with H.O.R.D.E. four times and opened for the Black Crowes and The Allman Brothers Band.[4]\n",
      "The band is composed of Lo Faber (lead vocals, guitar), Aaron Maxwell (lead vocals, guitar), Tom Osander (drums, percussion, backing vocals), Dan Pifer (bass, backing vocals), and Jon Bevo (keyboards). Lo Faber and Dan Pifer met as students at NYU in 1986. Eventually they both transferred to Manhattan School of Music, to study jazz, where they met Aaron Maxwell (Lieberman). As it happened, his father Hal Lieberman was a trumpet and Jazz Improvisation teacher at Manhattan School of Music. Faber and Tom Osander were high school friends who had previously been in bands together. Pifer had met Jon Bevo earlier at NYU and he jammed with them on keyboards, eventually joining when the band began to coalesce.[5]\n",
      "As the band came together in the second half of 1988 they recorded songs at the studio Sounds of Joy on West 46th Street where Pifer was working. ” Electrocute,” “Freight Train,” “She Said Dark,” ”Fortress of Solitude” and “Other Shore” were recorded. Most of those tunes have remained live staples throughout their career.  On December 13, 1988 God Street Wine played their first public gig at Nightingale's on Second Avenue in Lower Manhattan. This club becomes a regular haunt for them.[5] Other bands that got their start at the legendary Lower East Side venue include Blues Traveler and the Spin Doctors.[6]\n"
   ]
}