{
   "Name": "Gov't Mule",
   "rawData": [
      "Gov't Mule (pronounced Government Mule) is an American Southern rock jam band, formed in 1994 as a side project of The Allman Brothers Band by guitarist Warren Haynes and bassist Allen Woody.  Fans often refer to Gov't Mule simply as Mule.\n",
      "The band released their debut album, Gov't Mule, in 1995, and have since released an additional nine studio albums, plus numerous EPs and live releases. Gov't Mule has become a staple act at music festivals across North America, with both its members and frequent guests boasting members from other notable bands, adding various funk and blues rock elements to the band's sound.\n",
      "When The Allman Brothers Band reformed in 1989, partially in response to the popularity of their Dreams box set, Warren Haynes was added as a permanent lead guitarist and vocalist, and Allen Woody was recruited as bass guitarist. The two shared a love for 1960s power trios like Cream, The Jimi Hendrix Experience, the James Gang, and Mountain. Haynes, Woody, and drummer Matt Abts, who played with Haynes in Dickey Betts' band, came together as Gov't Mule during Allman Brothers breaks. They released their debut album Gov't Mule, produced by Michael Barbiero, in 1995.  Live at Roseland Ballroom was released in 1996, consisting of their 1995 New Year's Eve set opening for Blues Traveler.\n"
   ],
   "infobox": {
      "Genres": [
         "Southern rock, blues rock, hard rock"
      ],
      "Years active": [
         "1994–present"
      ],
      "Labels": [
         "Relativity, Foundation, Capricorn, ATO, Evil Teen, Provogue"
      ],
      "Associated acts": [
         "The Allman Brothers Band, Blue Floyd, Phil Lesh and Friends, Planet of the Abts, The Dead, Dave Schools"
      ],
      "Website": [
         "mule.net"
      ],
      "Members": [
         "Warren Haynes",
         "Matt Abts",
         "Danny Louis",
         "Jorgen Carlsson"
      ],
      "Past members": [
         "Allen Woody",
         "Andy Hess"
      ]
   }
}