{
   "Name": "Gov't Mule",
   "Sections": [
      "1 History",
      "1.1 1990s",
      "1.2 2000–2003",
      "1.3 2004–2008",
      "1.4 2009",
      "1.5 2010–2014",
      "1.6 2017",
      "2 Members",
      "3 Discography",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "\n",
         "Gov't Mule (pronounced Government Mule) is an American Southern rock jam band, formed in 1994 as a side project of The Allman Brothers Band by guitarist Warren Haynes and bassist Allen Woody.  Fans often refer to Gov't Mule simply as Mule.\n",
         "The band released their debut album, Gov't Mule, in 1995, and have since released an additional nine studio albums, plus numerous EPs and live releases. Gov't Mule has become a staple act at music festivals across North America, with both its members and frequent guests boasting members from other notable bands, adding various funk and blues rock elements to the band's sound.\n"
      ]
   },
   "History": {
      "1990s": {
         "text": [
            "When The Allman Brothers Band reformed in 1989, partially in response to the popularity of their Dreams box set, Warren Haynes was added as a permanent lead guitarist and vocalist, and Allen Woody was recruited as bass guitarist. The two shared a love for 1960s power trios like Cream, The Jimi Hendrix Experience, the James Gang, and Mountain.[1][2] Haynes, Woody, and drummer Matt Abts, who played with Haynes in Dickey Betts' band, came together as Gov't Mule during Allman Brothers breaks. They released their debut album Gov't Mule, produced by Michael Barbiero, in 1995.  Live at Roseland Ballroom was released in 1996, consisting of their 1995 New Year's Eve set opening for Blues Traveler.\n",
            "When The Allman Brothers Band were not forthcoming with any new material, Haynes and Woody left to concentrate full-time on Gov't Mule in 1997. Their second studio effort, Dose, also produced by Barbiero, was released in early 1998. They were joined by members of the Allman Brothers, the Black Crowes, Parliament/Funkadelic and The Derek Trucks Band for their 1998 New Year's Eve concert, released both in a two and four CD version as Live... With a Little Help from Our Friends. The performances exposed some of the bands' influences, covering Neil Young, Free, Traffic, Jimi Hendrix, Little Feat, Humble Pie and Black Sabbath.\n"
         ]
      },
      "2000–2003": {
         "text": [
            "In February 2000, the band released Life Before Insanity, to critical praise,[3] and although the band had already experienced  previous successes, they anticipated a greater commercial success with this album. Unfortunately, Allen Woody was found dead in New York City on August 26 of that year.[4]  On September 21, 2000 a benefit concert was organized called \"One for Woody\",[5] with the proceeds going to Woody's daughter, Savannah Woody, intended for her education. The Allman Brothers, The Black Crowes, Phil Lesh and Friends, Jimmy Herring, Edwin McCain and several more of Woody's friends also performed at the concert. Haynes and Abts continued to do limited touring in the Fall of 2000 supporting Ben Harper & The Innocent Criminals as an homage to Woody. Their subsequent \"Smile at Half Mast Tour\" that followed  was named in reference to a poem Haynes wrote for Woody's funeral.\n",
            "At the \"One for Woody\" performance and subsequently at other shows, Haynes began appearing with The Allman Brothers Band again. With Dickey Betts' departure from the Allmans, Haynes came back full-time to the band at the beginning of 2001 and has continued splitting his time between the Allman Brothers, Gov't Mule and for a period Phil Lesh and Friends and other re-formed Grateful Dead bands.\n",
            "The next year, Barbiero, Haynes and Abts began to record a tribute album.[6] using some of Woody's favorite bass players.  These sessions resulted in two CDs The Deep End, Volume 1 (2001) and The Deep End, Volume 2 (2002).  A documentary of the recording sessions was also made by Phish bassist Mike Gordon called Rising Low. Bass contributions to the CDs came from Jack Bruce, formerly of Cream, John Entwistle of The Who, Mike Watt of Minutemen, Les Claypool of Primus, Flea of the Red Hot Chili Peppers, Chris Squire of Yes and Stefan Lessard of Dave Matthews Band among others.\n",
            "A revolving door of keyboardists and bassists were used to fulfill touring engagements in support of the Deep End recordings. Keyboardists included Chuck Leavell, Rob Barraco, Page McConnell and Danny Louis.  Bassists included, among others, Dave Schools of Widespread Panic, Oteil Burbridge who already had filled Woody's former place in The Allman Brothers, Les Claypool of Primus, Victor Wooten of the Flecktones, George Porter, Jr. of The Meters, Jason Newsted (formerly of Metallica), Greg Rzab formerly of The Black Crowes and the Buddy Guy Band, and Andy Hess, also formerly of The Black Crowes. Louis and Hess were eventually named as permanent members[7][8] of Gov't Mule.\n"
         ]
      },
      "2004–2008": {
         "text": [
            "The first CD with Louis and Hess, Deja Voodoo, was released in September 2004. The album won the Jammy award for Best Album and was the last studio album involving Michael Barbiero as producer and engineer. Additional material from those sessions was released in 2005 as Mo' Voodoo. The new lineup's second full release, High & Mighty, was released on August 22, 2006, and it was followed in 2007 by a dub/reggae album called Mighty High - including versions of covers and original songs with special guest appearances by Michael Franti, Toots Hibbert, and Willi Williams.\n",
            "Gov't Mule continues to tour extensively and has become a staple act at many music festivals including Bonnaroo, Wakarusa, Mountain Jam, Vegoose, All Good, and their annual New Orleans Jazzfest night show (where they filmed and recorded the last show of the Deepest End tours, with 17 guest musicians in a six-hour show).\n",
            "Every year since 1989, Warren Haynes hosts the Annual Christmas Jam in his hometown of Asheville, North Carolina.[9] The concert usually takes place the first weekend in December at the Asheville Civic Center, as a fundraiser for Habitat For Humanity. Many artists who play at the Christmas Jam also perform separate gigs in various Asheville clubs, usually the day before the Jam proper. The Pre-Jam, as it is called, features many of the same artists, in smaller clubs. The 19th edition of the Jam took place on December 15, 2007[10] with performances by Kevn Kinney, Grace Potter and The Nocturnals, Shelly Colvin, Jason Isbell and the 400 Unit, Jackson Browne, G. Love, Bruce Hornsby and Peter Frampton among others. Gov't Mule headlined.\n",
            "On June 28, 2008, while keyboardist Danny Louis was drafted by Cheap Trick [11] to revisit Sgt. Pepper at the Hollywood Bowl, Gov't Mule performed as a power trio[12] for the first time since 2000, this time with its regular bassist Andy Hess. The band titled their set \"Old School Mule\" and ran through some of their older songs such as \"Wandering Child\" and \"Thorazine Shuffle.\"\n",
            "On September 15, 2008, Haynes' wife, Stefani Scamardo [13] announced on her \nSirius radio show[14] that Andy Hess would be leaving the band and a new bassist would be in place for the fall tour. Hess was subsequently replaced by Jorgen Carlsson,[15] who had been rehearsing with the band for six months.\n"
         ]
      },
      "2009": {
         "text": [
            "On August 17, 2009, it was announced on the band's official website that Gov't Mule's eighth studio album, entitled By a Thread,[16] was on schedule for release on October 27, 2009.[17]On the same date, the first track of the new album, \"Broke Down on the Brazos\" (featuring Billy Gibbons of ZZ Top), was made available for listening on the website.[18]\n",
            "On October 31, 2009, Gov't Mule gave a special Halloween concert at the Tower Theater in Philadelphia. From the Gov't Mule web site: \"Following in the tradition of 2007's Holy Haunted House and last year's Pink Floyd spectacular, the band, once again, has something very special planned for the occasion.\" [19] This third in their series of Halloween shows featured a first set of over two hours, composed entirely of Rolling Stones covers. Previous sold-out shows had featured covers of Led Zeppelin's Houses of the Holy and an assortment of Pink Floyd compositions.\n"
         ]
      },
      "2010–2014": {
         "text": [
            "Gov't Mule played at the \"Island Exodus\" in Negril, Jamaica in January 2010, at the all-inclusive resort The Grand Lido Negril. The First Island Exodus consisted of three Gov't Mule shows and a Warren Haynes solo show. Also appearing at this event were Grace Potter & The Nocturnals, Ron Holloway, and DJ Logic.[20]\n",
            "Gov't Mule also played at the Hangout Music festival on Saturday, May 15, 2010 and at the Azkena Rock Festival in Vitoria-Gasteiz, Spain, on June 24, 2010. The band also opened up for the Dave Matthews Band on Friday, July 30, 2010 at Cruzan Amphitheatre, in West Palm Beach, Florida.\n",
            "In October 2010, Gov't Mule celebrated Halloween at the Fox Theater in Oakland, California. Warren Haynes and company used their first set to cover The Who's album Who's Next in its entirety.\n",
            "Except for its regular festival appearances, the band was mostly on hiatus during the early part of the decade while band members pursued other projects, particularly Haynes and his Warren Haynes Band.  In the summer of 2013, the band gave details on their upcoming album Shout!, their first studio album in four years and their first release on Blue Note Records, which was released on September 24 of that year.  In what Haynes contends is a first, the album included a bonus disc consisting of covers of the album's tracks by artists including Elvis Costello, Dr. John, Grace Potter and Steve Winwood.[21]\n",
            "On December 31, 2013, Gov't Mule performed with Robby Krieger, the guitarist from The Doors, at the Beacon Theatre in New York City.[22]\n",
            "The following year, they performed at the Beacon Theatre again with Myles Kennedy of Alter Bridge. They performed 18 classic AC/DC songs in a second set with Kennedy on vocals for the New Year's Eve \"Back at the Beacon\" show.[23]\n"
         ]
      },
      "2017": {
         "text": [
            "On June 9, 2017, Gov't Mule released their tenth studio album Revolution Come... Revolution Go on Fantasy Records. Following the Rolling Stone premiere of \"Stone Cold Rage\", \"Sarah, Surrender\" was premiered exclusively at KBCO, and the album launched for pre-orders on April 12. When talking about \"Stone Cold Rage\", Haynes points out that the song represents \"the divide that's going on in our country right now.\" He explains that \"even though it was written before the election, it was written knowing that whichever way the results went, we were going to have close to fifty percent of the nation very angry. Musically, it's an aggressive up-tempo rock song that reflects the anger of the lyrics, but with a sense of sarcasm and humor.\"[24]\n",
            "On the heels of the release of their new record, Revolution Come... Revolution Go, Gov't Mule kicked off their extensive tour, including stops at New Orleans Jazz & Heritage Festival with Soulive, New York and Philadelphia with Chris Robinson Brotherhood, a return to Europe, 14 dates with Galactic up and down the East Coast/Mid-West, a night at Red Rocks, festival sets at The Peach Music Festival, Lockn' Festival, Summer Camp Music Festival and Del Fest, and four shows with Blackberry Smoke. Appearing as festival-closing headliner for the King Biscuit Blues Festival, the band was joined in a 40 minute encore by blues legends Larry McCray and Bob Margolin. In 2019, the Mule released a full-length concert film and accompanying recording, Bring on the Music, which was recorded at Port Chester, NY's Capitol Theatre. [25]\n"
         ]
      }
   },
   "Members": {
      "text": [
         "Current members\n",
         "\n",
         "Former members\n",
         "\n",
         "Timeline\n"
      ]
   },
   "Discography": {
      "text": [
         "Following is a listing of Gov't Mule's major releases. Nearly every concert that Gov't Mule plays is recorded and sold online in both high- and low-resolution MP3 format, and in the lossless FLAC format.[26]\n"
      ]
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Gov't Mule (pronounced Government Mule) is an American Southern rock jam band, formed in 1994 as a side project of The Allman Brothers Band by guitarist Warren Haynes and bassist Allen Woody.  Fans often refer to Gov't Mule simply as Mule.\n",
      "The band released their debut album, Gov't Mule, in 1995, and have since released an additional nine studio albums, plus numerous EPs and live releases. Gov't Mule has become a staple act at music festivals across North America, with both its members and frequent guests boasting members from other notable bands, adding various funk and blues rock elements to the band's sound.\n",
      "When The Allman Brothers Band reformed in 1989, partially in response to the popularity of their Dreams box set, Warren Haynes was added as a permanent lead guitarist and vocalist, and Allen Woody was recruited as bass guitarist. The two shared a love for 1960s power trios like Cream, The Jimi Hendrix Experience, the James Gang, and Mountain.[1][2] Haynes, Woody, and drummer Matt Abts, who played with Haynes in Dickey Betts' band, came together as Gov't Mule during Allman Brothers breaks. They released their debut album Gov't Mule, produced by Michael Barbiero, in 1995.  Live at Roseland Ballroom was released in 1996, consisting of their 1995 New Year's Eve set opening for Blues Traveler.\n",
      "When The Allman Brothers Band were not forthcoming with any new material, Haynes and Woody left to concentrate full-time on Gov't Mule in 1997. Their second studio effort, Dose, also produced by Barbiero, was released in early 1998. They were joined by members of the Allman Brothers, the Black Crowes, Parliament/Funkadelic and The Derek Trucks Band for their 1998 New Year's Eve concert, released both in a two and four CD version as Live... With a Little Help from Our Friends. The performances exposed some of the bands' influences, covering Neil Young, Free, Traffic, Jimi Hendrix, Little Feat, Humble Pie and Black Sabbath.\n"
   ]
}