{
   "Name": "Hot Tuna",
   "rawData": [
      "Hot Tuna is an American blues rock band formed in 1969 by former Jefferson Airplane members Jorma Kaukonen (guitarist/vocals) and Jack Casady (bassist). Although it has always been a fluid aggregation, with musicians coming and going over the years, the band's name has essentially become a metonym for Kaukonen and Casady's ongoing collaboration.\n",
      "Hot Tuna began as a side project to Jefferson Airplane, intended to mark time while Grace Slick recovered from throat node surgery that had left her unable to perform. The band's name came from someone Jorma Kaukonen referred to as a \"witty wag\" who called out, \"hot tuna\" after hearing the line 'What's that smell like fish, oh baby,' from the song \"Keep On Truckin'.\" Kaukonen, Jack Casady, Paul Kantner and new drummer Joey Covington played several shows around San Francisco, including the Airplane's original club, The Matrix, before Jefferson Airplane resumed performing to support Volunteers. (Although Covington had been hired by Jefferson Airplane, he only performed at select engagements, with Spencer Dryden continuing to perform as the band's principal drummer until his 1970 dismissal). Once the Airplane had resumed touring, Tuna found itself opening for the Airplane. Their early repertoire derived mainly from Kaukonen's Airplane material and covers of American country and blues artists such as Reverend Gary Davis, Jelly Roll Morton, Bo Carter and Blind Blake.\n",
      "In September 1969, Kaukonen and Casady employed the moniker for a week of acoustic-based concerts at the New Orleans House in Berkeley, California; recordings culled from this engagement were released as the band's eponymous debut album in 1970. This album has become affectionately known by the group's fans as the \"breaking glass album\", because of the sound of breaking beer glasses during the recording of \"Uncle Sam Blues.\" Some tracks included Will Scarlett on harmonica.  After the album was recorded, Jorma's brother Peter Kaukonen soon replaced Kantner on rhythm guitar and Jefferson Airplane co-lead vocalist Marty Balin joined on vocals for the electric songs. In 1970, the younger Kaukonen was replaced by Paul Ziegler.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, USA"
      ],
      "Genres": [
         "Blues rock,[1] Americana[2]"
      ],
      "Years active": [
         "1969–1977, 1983, 1986–present"
      ],
      "Labels": [
         "RCA/Grunt, Relix, Eagle, Red House"
      ],
      "Associated acts": [
         "Jefferson Airplane"
      ],
      "Website": [
         "www.hottuna.com"
      ],
      "Members": [
         "Jack Casady",
         "Jorma Kaukonen"
      ],
      "Past members": [
         "Will Scarlett",
         "Joey Covington",
         "Paul Kantner",
         "Marty Balin",
         "Peter Kaukonen",
         "Paul Ziegler",
         "Papa John Creach",
         "Sammy Piazza",
         "Bob Steeler",
         "Michael Falzarano",
         "Shigemi Komiyama",
         "Joey Balin",
         "Joey Stefko",
         "Harvey Sorgen",
         "Galen Underwood",
         "Pete Sears",
         "Erik Diaz",
         "Skoota Warner",
         "Barry Mitterhoff"
      ]
   },
   "albums": []
}