{
   "Name": "The Heavy Pets",
   "Sections": [
      "1 Early years",
      "2 Big breaks",
      "3 Album history",
      "3.1 Whale (March 2007)",
      "3.2 Slow Motion Conductor (March 2008)",
      "3.3 The Heavy Pets (April 2010)",
      "3.4 Swim Out Past The Sun (October 2011)",
      "3.5 Two Horses (October 2013)",
      "3.6 Rags And Aces (May 2014)",
      "3.7 Stolen Smile (November 2014)",
      "4 Touring",
      "5 Discography",
      "5.1 Studio albums",
      "5.2 Live albums",
      "6 Line-up",
      "6.1 Current members",
      "6.2 Previous members",
      "7 Management",
      "8 References",
      "9 External links"
   ],
   "Summary": {
      "text": [
         "The Heavy Pets are an American jam band based in Fort Lauderdale, Florida, renowned for their funk, jazz and reggae-infused brand of rock and roll. Officially formed in 2005, the band tours nationwide and appears regularly on the summer music festival circuit. Currently, the group is composed of guitarists Jeff Lloyd and Mike Garulli, keyboardist Jim Wuest, bassist Tony D'Amato, and drummer Jamie Newitt. In 2010 they released their second studio LP The Heavy Pets. The album was dubbed a \"Top 10 Album of 2010\" by The Huffington Post.[1]\n"
      ]
   },
   "Early years": {
      "text": [
         "Original members Jeff Lloyd, Mike Garulli, Jesse Margiotta, and Joe Dupell befriended each other at Goshen Central High School in upstate Goshen, New York.[2][3][4] Garulli was in a hardcore band named Strep Nine when he met Lloyd. Together the quartet formed Anthem, the first iteration of their band loosely named after the 1938 Anthem Ayn Rand novella because they were still interested in Rush.[5] The group practiced under several more names (such as My Friends Band) before sticking with The Heavy Pets, only to fizzle apart when members left for college.[4][5] While at Syracuse University Lloyd befriended classmate and keyboardist Jim Wuest.[2] Lloyd and Wuest played regular gigs together with bassist Robert \"Chops\" Froehlich and Syracuse University drummer Kinyatta King under the name My Friends Band, but the group disbanded after 2003. The high school crew partially regrouped after college, but remained a completely underground band.[5]\n",
         "In 2004 Lloyd got a call from former Heavy Pets bassist Joe Dupell, who had moved to Fort Lauderdale, Florida to start an internet marketing company. Dupell invited him to visit, and Lloyd saw it as an opportunity to leave New York.[5] Garulli followed, and The Heavy Pets were officially formed. Wuest arrived soon after.[2]\n",
         "Lloyd had his first Florida debut jamming with George Clinton and Parliament/Funkadelic on New Years between 2004 and 2005.[3][4] Their first South Florida show was late in 2005, on a patio in a Broward County, Florida condominium just after Hurricane Wilma.[5] Afterwards the band recorded a demo and began booking at Florida venues such as Fat Cats, Alligator Alley, and Tobacco Road, Miami.[6] By April 2006, they had already played over 350 gigs and shared the stage with Bernie Worrell, Oteil Burbridge and the Peacemakers, and Tea Leaf Green.[4]\n",
         "The lineup changed several times after the release of Whale, with drummer Jamie Newitt joining the group just before 2008 Langerado Music Festival, right before a heavy summer touring schedule. Dupell left the band suddenly in late 2008, and bassists Mark White of the Spin Doctors and Felix Pastorious (son of Jaco Pastorius) began moonlighting at shows.[2][7] Philadelphia bassist Justin Carney joined the group as Dupell's permanent replacement in mid-2009. He left the band in the summer of 2012, and was replaced by Tony D'Amato, a longtime musical collaborator and high school friend of Newitt.[2][5]\n"
      ]
   },
   "Big breaks": {
      "text": [
         "Langerado 2006\nThe band's breakthrough came in March 2006. They were selected by popular local vote out of 350 other local unsigned bands to perform at the 2006 Langerado Music Festival. While there they played along bands such as Ben Harper, The Flaming Lips, G Love, and Robert Randolph.[3]\n",
         "High Times\nThat May they were selected as the High Times \"Unsigned Band of the Week\".[4] In July 2006 the band embarked on an East Coast festival tour, hitting as far as upstate New York.[4] That September they also performed at the Symbiosis Gathering in Angel's Camp, CA.[3]\n",
         "Jam Cruise\nThe Heavy Pets were invited to perform on Jam Cruise, specifically the annual music-festival-at-sea's 10th voyage in January 2012. The Heavy Pets donated a portion of proceeds from Swim Out Past The Sun sales between its release and the band's inaugural voyage upon Jam Cruise in support of Positive Legacy's community outreach projects in Haiti.[8]\n"
      ]
   },
   "Album history": {
      "Whale (March 2007)": {
         "text": [
            "In March 2007 the band released their first studio effort Whale. The album was recorded from September 2005 to March 2007 at Dreamfactory Studios in Boynton Beach, Florida. It featured the original line up, with Ryan Neuburger on drums and Joe Dupell on bass.[1] The double-disc debut has 21 tracks ranging from rock, to reggae, to folk.[3] The hit tracks \"Operation of Flight\" and \"Sleep\" were rotated heavily on Sirius Jam-On, earning the band \"most-played\" status for an unsigned act.[9][10][11] They toured heavily in Florida to promote the album in the fall of 2007.\n"
         ]
      },
      "Slow Motion Conductor (March 2008)": {
         "text": [
            "In 2008 they released a three track EP entitled Slow Motion Conductor.[12]\n"
         ]
      },
      "The Heavy Pets (April 2010)": {
         "text": [
            "In 2010 the band signed with the label and management team 102° and traveled to Marin County, California to record a new album.[7] That winter they spent six weeks recording the album in Scott Mathews' TikiTown studio.[13] The band had self-produced everything up to that point, but Mathews produced the album. As a Multi-Platinum award winner, some of Matthews' previous projects have included Brian Wilson and The Beach Boys, Johnny Cash, Eric Clapton, Joey Ramone, Elvis Costello, Van Morrison, Steve Perry, Ry Cooder and Neil Young.[7][14] It was mastered by Grammy Award winner Vlado Meller of Universal Mastering Studios NYC, and released on both CD and vinyl.[9][15] Tom Lueken served as engineer.\nJohn Popper of Blues Traveler made a guest appearance on the track \"Girl You Make Me Stupid\" with a harmonica solo.[9] An old college friend of Wuest and Lloyd, Mike Kammers, arranged horns.[7][14]\n"
         ]
      },
      "Swim Out Past The Sun (October 2011)": {
         "text": [
            "The band returned to their acoustic roots on Swim Out Past The Sun. Featuring a three song sit-in by longtime Jerry Garcia collaborator David Grisman, Swim Out Past The Sun was again produced by Scott Mathews and mastered by Vlado Meller. Its cover art was contributed by American painter Mark T. Smith.\n"
         ]
      },
      "Two Horses (October 2013)": {
         "text": [
            "The release of Two Horses marked a new era in The Heavy Pets' process of recording their prolific song catalog. By utilizing the world-class, hometown Power Station Recording Studios, the band was able to self-produce \"Last Babies\" and \"Keep Me Running\" while maintaining their rigorous performance schedules. Two Horses was recorded and mixed by Paul Kronk at Power Station Recording Studios, mastered by Paul Gold at Salt Mastering, produced by The Heavy Pets and executive produced by Brotherly Love Productions.  The two tracks are in rotation on Sirius XM Jam-On.[16]\n"
         ]
      },
      "Rags And Aces (May 2014)": {
         "text": [
            "Rags and Aces, the second in a series of self-produced EPs The Heavy Pets have been working on amidst their rigorous tour schedule. Following the success of their first in the series, Two Horses, the Pets stuck to the same formula of tracking and mixing close to home at South Florida's Power Station Recording Studios. Although the Pets attribute the writing credits of every song to the band as a whole, the three-track recording features one penned by each of the band's principle songwriters. Mike Garulli's \"Movie Star\" debuted live as a bluegrass/Americana number before getting shelved, reworked and recorded as a catchy indie pop tune with an abundance of witty lyricism. Jim Wuest's double-headed \"Dewpoint\" commemorates a friend's success in a poker tournament and kicks off with a serious funk groove paralleling the ups-and-downs of the game before taking off into a celebratory disco dance party. Jeff Lloyd's \"Chew\" depicts a long night of indulgence that can only be set at a music festival.\n"
         ]
      },
      "Stolen Smile (November 2014)": {
         "text": [
            "Stolen Smile, the third in a series of self-produced EPs with tracking and mixing completed at South Florida's Power Station Recording Studios on the release which again showcases the work from multiple THP contributors. The two-track recording features another fresh tune penned by Mike Garulli in the down-tempo atmospheric \"Giant Birds,\" first heard live in the Fall of 2013 while \"Sigismondi\" is another of Jim Wuest's dynamic dance numbers which has matured over a longer road life but developed into the unique sonic journey captured in a fresh light for this release.\n"
         ]
      }
   },
   "Touring": {
      "text": [
         "A longtime fixture on the summer festival scene, The Heavy Pets have taken the stage at Bonnaroo, Jam Cruise, High Sierra Music Festival, Gathering of the Vibes, moe.down, Langerado, Summer Camp Music Festival, All Good Music Festival, Wakarusa Music Festival, Wanee Festival, The Peach Music Festival, Hulaween, Bear Creek, Mountain Jam Festival and their namesake PetZoo. They tour nationwide and have played over 1000 shows since their late 2005 inception.\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Live albums": {}
   },
   "Line-up": {
      "Current members": {
         "text": [
            "[17]\n"
         ]
      },
      "Previous members": {}
   },
   "Management": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Heavy Pets are an American jam band based in Fort Lauderdale, Florida, renowned for their funk, jazz and reggae-infused brand of rock and roll. Officially formed in 2005, the band tours nationwide and appears regularly on the summer music festival circuit. Currently, the group is composed of guitarists Jeff Lloyd and Mike Garulli, keyboardist Jim Wuest, bassist Tony D'Amato, and drummer Jamie Newitt. In 2010 they released their second studio LP The Heavy Pets. The album was dubbed a \"Top 10 Album of 2010\" by The Huffington Post.[1]\n",
      "Original members Jeff Lloyd, Mike Garulli, Jesse Margiotta, and Joe Dupell befriended each other at Goshen Central High School in upstate Goshen, New York.[2][3][4] Garulli was in a hardcore band named Strep Nine when he met Lloyd. Together the quartet formed Anthem, the first iteration of their band loosely named after the 1938 Anthem Ayn Rand novella because they were still interested in Rush.[5] The group practiced under several more names (such as My Friends Band) before sticking with The Heavy Pets, only to fizzle apart when members left for college.[4][5] While at Syracuse University Lloyd befriended classmate and keyboardist Jim Wuest.[2] Lloyd and Wuest played regular gigs together with bassist Robert \"Chops\" Froehlich and Syracuse University drummer Kinyatta King under the name My Friends Band, but the group disbanded after 2003. The high school crew partially regrouped after college, but remained a completely underground band.[5]\n",
      "In 2004 Lloyd got a call from former Heavy Pets bassist Joe Dupell, who had moved to Fort Lauderdale, Florida to start an internet marketing company. Dupell invited him to visit, and Lloyd saw it as an opportunity to leave New York.[5] Garulli followed, and The Heavy Pets were officially formed. Wuest arrived soon after.[2]\n",
      "Lloyd had his first Florida debut jamming with George Clinton and Parliament/Funkadelic on New Years between 2004 and 2005.[3][4] Their first South Florida show was late in 2005, on a patio in a Broward County, Florida condominium just after Hurricane Wilma.[5] Afterwards the band recorded a demo and began booking at Florida venues such as Fat Cats, Alligator Alley, and Tobacco Road, Miami.[6] By April 2006, they had already played over 350 gigs and shared the stage with Bernie Worrell, Oteil Burbridge and the Peacemakers, and Tea Leaf Green.[4]\n"
   ],
   "infobox": {
      "Origin": [
         "Goshen, New York"
      ],
      "Genres": [
         "Rock, Funk, Reggae, Jam"
      ],
      "Years active": [
         "2005 (2005)–present"
      ],
      "Website": [
         "www.theheavypets.com"
      ],
      "Members": [
         "Jeff Lloyd",
         "Mike Garulli",
         "Jim Wuest",
         "Jamie Newitt",
         "Tony D'Amato"
      ],
      "Past members": [
         "Justin Carney",
         "Joe Dupell",
         "Ryan Neuberger",
         "Felix Pastorious",
         "Julius Pastorius",
         "Mark White"
      ]
   }
}