{
   "Name": "The Heavy Pets",
   "rawData": [
      "The Heavy Pets are an American jam band based in Fort Lauderdale, Florida, renowned for their funk, jazz and reggae-infused brand of rock and roll. Officially formed in 2005, the band tours nationwide and appears regularly on the summer music festival circuit. Currently, the group is composed of guitarists Jeff Lloyd and Mike Garulli, keyboardist Jim Wuest, bassist Tony D'Amato, and drummer Jamie Newitt. In 2010 they released their second studio LP The Heavy Pets. The album was dubbed a \"Top 10 Album of 2010\" by The Huffington Post.\n",
      "Original members Jeff Lloyd, Mike Garulli, Jesse Margiotta, and Joe Dupell befriended each other at Goshen Central High School in upstate Goshen, New York. Garulli was in a hardcore band named Strep Nine when he met Lloyd. Together the quartet formed Anthem, the first iteration of their band loosely named after the 1938 Anthem Ayn Rand novella because they were still interested in Rush. The group practiced under several more names (such as My Friends Band) before sticking with The Heavy Pets, only to fizzle apart when members left for college. While at Syracuse University Lloyd befriended classmate and keyboardist Jim Wuest. Lloyd and Wuest played regular gigs together with bassist Robert \"Chops\" Froehlich and Syracuse University drummer Kinyatta King under the name My Friends Band, but the group disbanded after 2003. The high school crew partially regrouped after college, but remained a completely underground band.\n",
      "In 2004 Lloyd got a call from former Heavy Pets bassist Joe Dupell, who had moved to Fort Lauderdale, Florida to start an internet marketing company. Dupell invited him to visit, and Lloyd saw it as an opportunity to leave New York. Garulli followed, and The Heavy Pets were officially formed. Wuest arrived soon after.\n"
   ],
   "infobox": {
      "Origin": [
         "Goshen, New York"
      ],
      "Genres": [
         "Rock, Funk, Reggae, Jam"
      ],
      "Years active": [
         "2005 (2005)–present"
      ],
      "Website": [
         "www.theheavypets.com"
      ],
      "Members": [
         "Jeff Lloyd",
         "Mike Garulli",
         "Jim Wuest",
         "Jamie Newitt",
         "Tony D'Amato"
      ],
      "Past members": [
         "Justin Carney",
         "Joe Dupell",
         "Ryan Neuberger",
         "Felix Pastorious",
         "Julius Pastorius",
         "Mark White"
      ]
   }
}