{
   "Name": "Jerry Garcia Acoustic Band",
   "rawData": [
      "The Jerry Garcia Acoustic Band (JGAB) was a  band formed by Jerry Garcia of the Grateful Dead.  They played a number of  concerts in 1987 and 1988, and subsequently released two  live albums.\n",
      "Garcia and Rothman had played together in The Black Mountain Boys, a bluegrass band. The JGAB formed in 1987 and made their first public appearance at The Fillmore on March 17, 1987 at a benefit concert for Artist Rights Today.\n",
      "The JGAB played the Lunt-Fontanne Theatre for a two-week Broadway run, then continued with appearances at The Warfield in San Francisco and the Wiltern Theatre in Los Angeles. Other performances included the Electric on the Eel concert, the Creating a Better Future benefit in Marin County, California, as well as appearances at the Cotati Cabaret (an exclusive club in Sonoma County, California), and the Frost Amphitheater at Stanford University.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California, USA"
      ],
      "Genres": [
         "Acoustic music"
      ],
      "Years active": [
         "1987-88"
      ],
      "Labels": [
         "Grateful Dead Records"
      ],
      "Associated acts": [
         "Grateful Dead",
         "Jerry Garcia Band"
      ],
      "Website": [
         "jerrygarcia.com"
      ],
      "Past members": [
         "Jerry Garcia",
         "David Nelson",
         "Sandy Rothman",
         "John Kahn",
         "Kenny Kosek",
         "David Kemper"
      ]
   },
   "prunedData": [
      "The [BAND_NAME] (JGAB) was a  band formed by Jerry Garcia of the Grateful Dead.  They played a number of  concerts in [YEAR] and [YEAR], and subsequently released two  live albums.\n",
      "Garcia and Rothman had played together in The Black Mountain Boys, a [GENRE] band. The JGAB formed in [YEAR] and made their first public appearance at The Fillmore on [MONTH] 17, [YEAR] at a benefit concert for Artist Rights Today.\n",
      "The JGAB played the Lunt-Fontanne Theatre for a [GENRE] a Better Future benefit in [MONTH]in County, California, as well as appearances at the Cotati Cabaret (an exclusive club in Sonoma County, California), and the Frost Amphitheater at Stanford University.\n"
   ]
}