{
   "Name": "Jerry Garcia Band",
   "Sections": [
      "1 History",
      "2 Discography",
      "3 Personnel",
      "3.1 Timeline",
      "4 See also",
      "5 References",
      "6 Further reading",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "The Jerry Garcia Band was a San Francisco Bay Area rock band led by Jerry Garcia of the Grateful Dead. Garcia founded the band in 1975; it remained the most important of his various side projects until his death in 1995.  The band regularly toured and recorded sporadically throughout its twenty-year existence, generally, but not always, during breaks in the Grateful Dead's schedule.[1][2]\n"
      ]
   },
   "History": {
      "text": [
         "Over the years, the lineup of the Jerry Garcia Band changed many times. The one constant member besides Garcia himself was bassist John Kahn, who served as Garcia's principal musical collaborator outside of the Grateful Dead after 1970. Melvin Seals had the next longest tenure, serving as keyboardist from 1980 onward.\n",
         "Jerry Garcia's musical interests were famously varied, and this was reflected in the diverse music played by his band. Like the Grateful Dead, the Jerry Garcia Band played rock music that was influenced by blues, folk, country, and jazz in an improvisatory milieu that largely served as a framework for Garcia's solos. However, the group eschewed the former band's avant-garde and world music influences in favor of a slower, groove-based \"bar band\" approach strongly oriented toward rhythm and blues (the band often featured female backing vocalists characteristic of the genre), gospel music and reggae. Rock versions of contemporary Americana were also prominent. The relatively languorous tempos were dictated by Garcia and Kahn, much to the chagrin of longtime drummer David Kemper: \"[I]t bothered me from the very beginning. I’d say, ‘You know we need some uptempo material, it’s just putting me to sleep; the band is putting me to sleep.’ At first I’d say these things, and then I just decided to go with it. It is what it is, and who was I to say anything? This band preceded me; the whole concept of the band preceded me.\"[3]\n",
         "Staples of the band's repertoire included Holland–Dozier–Holland's \"How Sweet It Is (To Be Loved by You)\" (widely perceived as the group's signature song and their most-performed song), Peter Rowan's \"Midnight Moonlight,\" Jimmy Cliff's \"The Harder They Come\" and \"Sitting in Limbo,\" the Sensational Nightingales' \"My Sisters and Brothers,\" Hank Ballard's \"Tore Up Over You,\" Bob McDill and Allen Reynolds' \"Catfish John,\" John Lennon's \"Dear Prudence,\" Jesse Stone's \"Don't Let Go,\" Allen Toussaint's \"I'll Take a Melody\" and \"Get Out of My Life, Woman\", Little Milton's \"That's What Love Will Make You Do,\" Chuck Berry's \"Let It Rock\" and \"You Never Can Tell,\" Bruce Cockburn's \"Waiting for a Miracle,\" Irving Berlin's \"Russian Lullaby,\" Smokey Robinson's \"The Way You Do the Things You Do\" and \"I Second That Emotion,\" Peter Tosh's \"Stop That Train,\" Bob Marley's \"Stir It Up,\" Robbie Robertson's \"The Night They Drove Old Dixie Down,\" the Manhattans' \"Shining Star,\" Van Morrison's \"And It Stoned Me\" and \"Bright Side of the Road\" and Norton Buffalo's \"Ain't No Bread in the Breadbox.\" The band also performed Jerome Kern and Oscar Hammerstein II's \"Ol' Man River\" and Miles Davis' \"So What\" on one occasion apiece. As with the Grateful Dead, Jerry Garcia regularly covered many songs by Bob Dylan with the group, including \"Tangled Up in Blue,\" \"Simple Twist of Fate,\" \"Knockin' on Heaven's Door,\" \"Forever Young,\" \"Señor (Tales of Yankee Power),\" \"Tears of Rage,\" \"Tough Mama\" and \"When I Paint My Masterpiece.\"\n",
         "The group did not perform between November 1978 and October 1979; during that year, Garcia, Kahn and keyboardist Merl Saunders (who performed with Garcia and Kahn from 1971 to 1975 in the Saunders/Garcia Band and Legion of Mary) briefly performed in Reconstruction, a more egalitarian jazz-funk ensemble.\n",
         "According to Linda Kahn in a 2017 Reddit Ask Me Anything prompt, much of the band's repertoire was curated by her husband: \"[H]e did bring most of the cover material to the table. He has a big record collection and they're all in really good shape, he was pretty anal about his records. I think as far as picking songs, he listened to records all the time, so it depends on whoever was in the band and whatever group was playing at the time and that influenced John a lot.\"[4]\n",
         "Although the repertoire was strongly tilted toward covers, several Garcia-Robert Hunter originals (including \"Run for the Roses,\" \"Mission in the Rain,\" \"Gomorrah,\" \"Cats Under the Stars\" and \"Reuben and Cherise\") were performed exclusively or near-exclusively by the Jerry Garcia Band. Some of the band's original repertoire (most notably \"Deal,\" \"They Love Each Other,\" \"Sugaree,\" and \"Friend of the Devil\") was shared with the Grateful Dead.\n",
         "During Garcia's lifetime, the Jerry Garcia Band released one studio album, Cats Under the Stars, and one live album, Jerry Garcia Band. Several more live albums were released posthumously. \n",
         "The group was an indirect beneficiary of the commercial success of the Grateful Dead's  In the Dark (1987); as the latter group transitioned to summer stadium tours and multi-night arena engagements during their autumn and spring tours, the tour itineraries of the Garcia Band (hitherto confined to clubs and small theaters) came to encompass arenas (primarily in Garcia's key northeastern United States market) and outdoor amphitheaters favored by the Grateful Dead in the early 1980s. During this period, the group continued to play as many as fifteen concerts a year in an informal residency at The Warfield, a 2,300-capacity theater in San Francisco. Clarence Clemons also guested with them on tour for a brief time in 1989 and 1990.[5]\n",
         "Kahn briefly led the group (rechristened JGB) following Garcia's death in 1995. Seals became the bandleader after Kahn's death in 1996; as of 2017, he is the only remaining member from the final iteration of the Jerry Garcia Band in JGB.\n"
      ]
   },
   "Discography": {},
   "Personnel": {
      "Timeline": {},
      "text": [
         "Following are the lineups for the Jerry Garcia Band's live performances.[6]\n[7]\n"
      ]
   },
   "See also": {},
   "References": {},
   "Further reading": {},
   "External links": {},
   "coreData": [
      "The Jerry Garcia Band was a San Francisco Bay Area rock band led by Jerry Garcia of the Grateful Dead. Garcia founded the band in 1975; it remained the most important of his various side projects until his death in 1995.  The band regularly toured and recorded sporadically throughout its twenty-year existence, generally, but not always, during breaks in the Grateful Dead's schedule.[1][2]\n",
      "Over the years, the lineup of the Jerry Garcia Band changed many times. The one constant member besides Garcia himself was bassist John Kahn, who served as Garcia's principal musical collaborator outside of the Grateful Dead after 1970. Melvin Seals had the next longest tenure, serving as keyboardist from 1980 onward.\n",
      "Jerry Garcia's musical interests were famously varied, and this was reflected in the diverse music played by his band. Like the Grateful Dead, the Jerry Garcia Band played rock music that was influenced by blues, folk, country, and jazz in an improvisatory milieu that largely served as a framework for Garcia's solos. However, the group eschewed the former band's avant-garde and world music influences in favor of a slower, groove-based \"bar band\" approach strongly oriented toward rhythm and blues (the band often featured female backing vocalists characteristic of the genre), gospel music and reggae. Rock versions of contemporary Americana were also prominent. The relatively languorous tempos were dictated by Garcia and Kahn, much to the chagrin of longtime drummer David Kemper: \"[I]t bothered me from the very beginning. I’d say, ‘You know we need some uptempo material, it’s just putting me to sleep; the band is putting me to sleep.’ At first I’d say these things, and then I just decided to go with it. It is what it is, and who was I to say anything? This band preceded me; the whole concept of the band preceded me.\"[3]\n",
      "Staples of the band's repertoire included Holland–Dozier–Holland's \"How Sweet It Is (To Be Loved by You)\" (widely perceived as the group's signature song and their most-performed song), Peter Rowan's \"Midnight Moonlight,\" Jimmy Cliff's \"The Harder They Come\" and \"Sitting in Limbo,\" the Sensational Nightingales' \"My Sisters and Brothers,\" Hank Ballard's \"Tore Up Over You,\" Bob McDill and Allen Reynolds' \"Catfish John,\" John Lennon's \"Dear Prudence,\" Jesse Stone's \"Don't Let Go,\" Allen Toussaint's \"I'll Take a Melody\" and \"Get Out of My Life, Woman\", Little Milton's \"That's What Love Will Make You Do,\" Chuck Berry's \"Let It Rock\" and \"You Never Can Tell,\" Bruce Cockburn's \"Waiting for a Miracle,\" Irving Berlin's \"Russian Lullaby,\" Smokey Robinson's \"The Way You Do the Things You Do\" and \"I Second That Emotion,\" Peter Tosh's \"Stop That Train,\" Bob Marley's \"Stir It Up,\" Robbie Robertson's \"The Night They Drove Old Dixie Down,\" the Manhattans' \"Shining Star,\" Van Morrison's \"And It Stoned Me\" and \"Bright Side of the Road\" and Norton Buffalo's \"Ain't No Bread in the Breadbox.\" The band also performed Jerome Kern and Oscar Hammerstein II's \"Ol' Man River\" and Miles Davis' \"So What\" on one occasion apiece. As with the Grateful Dead, Jerry Garcia regularly covered many songs by Bob Dylan with the group, including \"Tangled Up in Blue,\" \"Simple Twist of Fate,\" \"Knockin' on Heaven's Door,\" \"Forever Young,\" \"Señor (Tales of Yankee Power),\" \"Tears of Rage,\" \"Tough Mama\" and \"When I Paint My Masterpiece.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Marin County, California, USA"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1975–1995"
      ],
      "Labels": [
         "Arista",
         "Grateful Dead"
      ],
      "Associated acts": [
         "Grateful Dead",
         "Legion of Mary",
         "Reconstruction",
         "Jerry Garcia Acoustic Band",
         "JGB"
      ],
      "Website": [
         "jerrygarcia.com"
      ],
      "Past members": [
         "Jerry Garcia",
         "John Kahn",
         "Ron Tutt",
         "Nicky Hopkins",
         "James Booker",
         "Keith Godchaux",
         "Donna Godchaux",
         "Maria Muldaur",
         "Buzz Buchanan",
         "Ozzie Ahlers",
         "Johnny D’Fonseca",
         "Greg Errico",
         "Melvin Seals",
         "Jimmy Warren",
         "Daoud Shaw",
         "Essra Mohawk",
         "Liz Stires",
         "Bill Kreutzmann",
         "Jaclyn LaBranch",
         "DeeDee Dickerson",
         "David Kemper",
         "Gloria Jones",
         "Gaylord Birch",
         "Donny Baldwin"
      ]
   }
}