{
   "Name": "JGB (band)",
   "rawData": [
      "JGB is an American rock band led by Melvin Seals, who plays electric organ.  Its mission is to continue the musical legacy of the Jerry Garcia Band, of which Seals was a longtime member.\n",
      "As noted in Rolling Stone, \"... when Garcia died in 1995, and the Grateful Dead went on hiatus, Seals took charge. Under his leadership, the slightly renamed 'JGB Band' pays tribute to Garcia by performing his songs and remaining faithful to his style.\"\n",
      "In 1996, Seals played several concerts with Jerry Garcia Band bassist John Kahn and other former members of that band.  Their idea was to continue playing the same music with everyone except Garcia himself.  However, Kahn died three weeks later, and Seals and the others continued without him.  The membership of JGB has continued to evolve over the years.\n"
   ],
   "infobox": {
      "Also known as": [
         "Melvin Seals and JGB"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1995-Present"
      ],
      "Labels": [
         "House of Blues, Blues Planet"
      ],
      "Associated acts": [
         "Jerry Garcia Band"
      ],
      "Website": [
         "www.melvinsealsandjgb.com"
      ],
      "Members": [
         "Melvin Seals",
         "Lady Chi",
         "Mary-eL",
         "Pete Lavezzoli",
         "John Kadlecik",
         "John-Paul McLean"
      ],
      "Past members": [
         "Sunshine Becker",
         "John Kahn",
         "Jackie LaBranch",
         "Zach Nugent",
         "Gloria Jones",
         "David Kemper",
         "Ozzie Ahlers",
         "Donny Baldwin",
         "Armin Winter",
         "Ronnie Penque",
         "Johnny Markowski",
         "Elgin Seals",
         "Judah Gold",
         "Stu Allen",
         "Dave Hebert",
         "Jimmy Tebeau",
         "Jimmy Hubbard",
         "Justin Purtill",
         "Martin Holland",
         "Sam Howard",
         "Rob Wenig",
         "Mark Corsolini",
         "Judith Harris Colman",
         "Elizabeth Holland",
         "Gail Muldrow",
         "Robert Sheldon Coons",
         "Joe White",
         "Cheryl Rucker",
         "Shirley Starks"
      ]
   },
   "albums": [
      "Welcome to Our World (For Members Only)",
      "Keepers of the Flame"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band led by Melvin Seals, who plays electric organ.  Its mission is to continue the musical legacy of the [PERSON_NAME_FULL_0_MALE], of which Seals was a longtime member.\n",
      "As noted in Rolling Stone, [SONG_NAME]\n",
      "In [YEAR], Seals played several concerts with Jerry Garcia Band bassist [PERSON_NAME_FULL_0_MALE] and other former members of that band.  Their idea was to continue playing the same music with everyone except Garcia himself.  However, [PERSON_NAME_LAST_0] died three weeks later, and Seals and the others continued without him.  The membership of [BAND_NAME] has continued to evolve over the years.\n"
   ]
}