{
   "Name": "The Jimmy Swift Band",
   "rawData": [
      "The Jimmy Swift Band (JSB) is a Canadian indie rock band from Halifax, Nova Scotia that combines elements of rock, jam, and electronica. Composed of Craig Mercer on guitar and vocals, Mike MacDougall on bass, Aaron Collier on keyboards and effects, and Nick Wombolt on drums, the band has been most often described as rocktronica.\n",
      "Formed in the late 1990s by members of the now defunct band PF Station, JSB draw their name from the name of the subject of one of PF Station's songs, \"A Night in the Life of Fly Jimmy Swift\".  Before eventually choosing their current name, the band was known for a time as Fly Jimmy Swift.\nCombining intricate guitar and a distinctly electronica keyboard sound with a hard hitting and rock solid rock rhythm section, the band is known for its exciting live show full of lengthy progressive instrumental jams that always get the crowd up and moving.\n",
      "The band has released 5 studio albums, 2 live albums, a live 5.1 concert DVD, a remix album, and a greatest hits package on 8-track tape. They've won three East Coast Music Awards, and numerous Music Industry Association of Nova Scotia (MIANS/Music Nova Scotia) awards over the past 15 years.\n"
   ],
   "infobox": {
      "Also known as": [
         "Fly Jimmy Swift, JSB"
      ],
      "Origin": [
         "Halifax, Nova Scotia, Canada"
      ],
      "Genres": [
         "indie rock"
      ],
      "Years active": [
         "1999–2014"
      ],
      "Labels": [
         "BelowMeMusic"
      ],
      "Associated acts": [
         "Grand Theft Bus, Slowcoaster, Dr. dFunkt, Scientists of Sound"
      ],
      "Website": [
         "thejimmyswiftband.com"
      ],
      "Members": [
         "Craig Mercer",
         "Mike MacDougall",
         "Aaron Collier",
         "Nick Wombolt"
      ],
      "Past members": [
         "Jake Smith",
         "Aaron Farr",
         "Bob Deveau",
         "Keith Mullins",
         "Paul Christian",
         "Douglas Cameron"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (JSB) is a [GENRE] band from Halifax, [MONTH]a Scotia that combines elements of rock, jam, and electronica. Composed of Craig Mercer on guitar and vocals, [PERSON_NAME_FULL_0_MALE] on bass, Aaron Collier on keyboards and effects, and [PERSON_NAME_FULL_1_MALE] on drums, the band has been most often described as rocktronica.\n",
      "Formed in the late [YEAR]s by members of the now defunct band PF Station, JSB draw their name from the name of the subject of one of PF Station's songs, \"A Night in the Life of Fly Jimmy Swift\".  Before eventually choosing their current name, the band was known for a [GENRE] a distinctly electronica keyboard sound with a hard hitting and rock solid rock rhythm section, the band is known for its exciting live show full of lengthy progressive instrumental jams that always get the crowd up and moving.\n",
      "The band has released 5 studio albums, 2 live albums, a [GENRE] a remix album, and a greatest hits package on 8-track tape. They've won three East Coast Music Awards, and numerous Music Industry Association of [MONTH]a Scotia (MIANS/Music [MONTH]a Scotia) awards over the past 15 years.\n"
   ]
}