{
   "Name": "Joe Russo's Almost Dead",
   "Sections": [
      "1 Performances",
      "1.1 2013",
      "1.2 2014",
      "1.3 2015",
      "1.4 2016",
      "1.5 2017",
      "1.6 2018",
      "2 Musical Style",
      "3 Members",
      "3.1 Live Substitutes",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Joe Russo's Almost Dead is an American rock band formed in 2013 that mainly covers the music of the Grateful Dead. Formed by Furthur and Benevento/Russo Duo drummer Joe Russo, the band played their first show on January 26, 2013 at the Brooklyn Bowl in Brooklyn, New York. In addition to drummer Joe Russo, the band also includes Ween's bassist Dave Dreiwitz, keyboardist Marco Benevento, Scott Metzger on guitar and vocals, and Tom Hamilton of Brothers Past and American Babies on guitar and vocals.\n"
      ]
   },
   "Performances": {
      "2013": {
         "text": [
            "The band's first concert was on January 26, 2013, at the Brooklyn Bowl in Brooklyn, New York for the second night of the Freaks Ball XIII. As Joe Russo recalls in the September 2017 Relix Magazine interview, he was supposed to play in the Dean Ween Group (Mickey Melchiondo from Ween's side project) on that second night but shortly before the date, Mickey cancelled the Dean Ween Group appearance and Joe pulled together Bustle In Your Hedgerow (Russo, Dreiwitz, Metzger and Benevento's Led Zeppelin band) and added Tom Hamilton to form Joe Russo's Almost Dead.[1] JRAD played one more show that year at the Capitol Theatre in Port Chester, New York on December 27, 2013.\n"
         ]
      },
      "2014": {
         "text": [
            "JRAD slowly began playing more shows in 2014, including several sets at summer festivals including the Gathering of the Vibes in Bridgeport, Connecticut, Hardly Strictly Blue Grass Festival in San Francisco, California, and String Cheese Incident's Hulaween Festival in Live Oak, Florida. They played two nights in Chicago and two nights in Colorado ending in a New Year's run on December 29, 30, and 31, at the Capitol Theatre, in Port Chester, New York, with the Grateful Dead's own Phil Lesh on bass filling in for Dreiwitz. The JRAD run with Phil Lesh was dubbed \"PhilRAD.\" JRAD played a total of 10 shows in 2014.\n"
         ]
      },
      "2015": {
         "text": [
            "Forty-six shows were listed on the band's website for 2015, including performances at Electric Forest, All Good Festival, Mountain Jam and High Sierra Music Festival.[2]\n"
         ]
      },
      "2016": {
         "text": [
            "JRAD had their debut appearance on Jam Cruise in January performing two consecutive nights in the Pantheon Theatre and a Pool Deck set.[3] In July they would play their first show at Red Rocks Amphitheatre in support of Umphrey's McGee.[4] In February 2016, it was announced that Joe Russo's Almost Dead would play a three show run at Brooklyn Bowl for Freak's Ball XVI, from March 24-March 26.\n",
            "With Ween returning to tour, Dave Dreiwitz missed JRAD's five-night 2016 New England spring tour. Jon Shaw of Shakey Graves and Cass McCombs filled in for Dreiwitz.[5] In August, they played two performances at Lockn' Festival in Virginia, which featured two headline performances by Ween and Phish.[6]\n",
            "Keyboardist Jeff Chimenti filled in for Benevento at two performances in New Orleans in April 2016.[7]\n",
            "JRAD played a total of 36 shows in 2016.[8]\n"
         ]
      },
      "2017": {
         "text": [
            "In 2017 JRAD performed forty shows including their first headlining indoor arena show, their first headlining Red Rocks Amphitheatre show and a return to the Dominican Republic for their second year in a row at Dominican Holidaze. Their first headlining arena show at the 1stBank Center in Broomfield, Colorado was a sold-out show originally scheduled for Red Rocks Amphitheatre but due to a late spring snowstorm, the concert was relocated overnight to the 1stBank Center.[9] The band also performed twelve sold out nights at the Brooklyn Bowl in New York City during the Spring and Fall of 2017. On March 9, the first night of the spring Brooklyn Bowl run and the band's one-hundredth concert, they premiered Russo and Hamilton's \"Keeping it Simple\", their first-ever original song.[10] For three of the Brooklyn Bowl performances Oteil Burbridge filled in for Dreiwitz while on Ween tour.[11]  On August 31, 2017 the band headlined a sold-out performance at Red Rocks with Oteil Burbridge on bass guitar filling in for Dreiwitz out on Ween tour.  In October, between the dates of the 5th-7th and the 12th-14th, the band performed the latter six sold-out shows at the Brooklyn Bowl.  JRAD's 125th show saw John Mayer, current lead-guitarist of Dead & Company, sitting in on guitar on Friday, October 13 in the first and second set of the show.[12]\n"
         ]
      },
      "2018": {
         "text": [
            "JRAD started off 2018 with three sold-out nights in January at the Capitol Theatre in Port Chester, New York[13] followed by a spring tour beginning on February 15 in Nashville, Tennessee with guest vocalist Nicole Atkins performing 'Doin' That Rag'.[14]\n",
            "Rolling Stone named JRAD's Peach Festival performance \"Best Scene-Stealer\", saying that, \"JRAD takes improvisational jam rock to the nth degree.\"\n"
         ]
      }
   },
   "Musical Style": {
      "text": [
         "JRAD is known for their intermingling of the Grateful Dead's recognizable folk-rock and Americana sound with more contemporary Progressive Rock and Jazz Fusion influences. Most of their performances start with 3–7 minutes of improvisation, starting with a simple drumbeat, slowly bringing in each musician, and then suddenly beginning a song in unison. Each of the musicians all have their own projects outside of the band, giving them a depth and breadth of different experiences in composition and improvisation which enables them to steer improvisations in myriad directions during their solos. Their live performance is highly regarded for its long, exploratory improvisation, high energy playing, alternating solos, and rapid juxtaposition in tempo and dynamics. Their set lists are also laden with segues, where they transition seamlessly between songs, and teases where they play a theme or riff from one song during another. Some notable examples of this include Tom Hamilton playing the guitar riff to \"Feel Like a Stranger\" during his solos or the band jumping back and forth between \"The Wheel\" and \"Uncle John's Band\".\n",
         "Keyboardist Marco Benevento is known for having at least one extended solo during each show where the band will stop playing entirely. During these solos Marco has led his solo improvisation to tease many different songs such as Tchaikovsky's \"Dance of the Sugar Plum Fairy\", Radiohead's \"Paranoid Android\" and Radiohead's \"Everything in Its Right Place\". These extended solos, after exploring a different sonic space, often build in energy and lead to the band rapidly joining in, leading the improvisation to a peak and getting quiet again rapidly.\n"
      ]
   },
   "Members": {
      "Live Substitutes": {}
   },
   "References": {},
   "External links": {},
   "coreData": [
      "Joe Russo's Almost Dead is an American rock band formed in 2013 that mainly covers the music of the Grateful Dead. Formed by Furthur and Benevento/Russo Duo drummer Joe Russo, the band played their first show on January 26, 2013 at the Brooklyn Bowl in Brooklyn, New York. In addition to drummer Joe Russo, the band also includes Ween's bassist Dave Dreiwitz, keyboardist Marco Benevento, Scott Metzger on guitar and vocals, and Tom Hamilton of Brothers Past and American Babies on guitar and vocals.\n",
      "The band's first concert was on January 26, 2013, at the Brooklyn Bowl in Brooklyn, New York for the second night of the Freaks Ball XIII. As Joe Russo recalls in the September 2017 Relix Magazine interview, he was supposed to play in the Dean Ween Group (Mickey Melchiondo from Ween's side project) on that second night but shortly before the date, Mickey cancelled the Dean Ween Group appearance and Joe pulled together Bustle In Your Hedgerow (Russo, Dreiwitz, Metzger and Benevento's Led Zeppelin band) and added Tom Hamilton to form Joe Russo's Almost Dead.[1] JRAD played one more show that year at the Capitol Theatre in Port Chester, New York on December 27, 2013.\n",
      "JRAD slowly began playing more shows in 2014, including several sets at summer festivals including the Gathering of the Vibes in Bridgeport, Connecticut, Hardly Strictly Blue Grass Festival in San Francisco, California, and String Cheese Incident's Hulaween Festival in Live Oak, Florida. They played two nights in Chicago and two nights in Colorado ending in a New Year's run on December 29, 30, and 31, at the Capitol Theatre, in Port Chester, New York, with the Grateful Dead's own Phil Lesh on bass filling in for Dreiwitz. The JRAD run with Phil Lesh was dubbed \"PhilRAD.\" JRAD played a total of 10 shows in 2014.\n",
      "Forty-six shows were listed on the band's website for 2015, including performances at Electric Forest, All Good Festival, Mountain Jam and High Sierra Music Festival.[2]\n"
   ]
}