{
   "Name": "Joe Russo's Almost Dead",
   "rawData": [
      "Joe Russo's Almost Dead is an American rock band formed in 2013 that mainly covers the music of the Grateful Dead. Formed by Furthur and Benevento/Russo Duo drummer Joe Russo, the band played their first show on January 26, 2013 at the Brooklyn Bowl in Brooklyn, New York. In addition to drummer Joe Russo, the band also includes Ween's bassist Dave Dreiwitz, keyboardist Marco Benevento, Scott Metzger on guitar and vocals, and Tom Hamilton of Brothers Past and American Babies on guitar and vocals.\n",
      "The band's first concert was on January 26, 2013, at the Brooklyn Bowl in Brooklyn, New York for the second night of the Freaks Ball XIII. As Joe Russo recalls in the September 2017 Relix Magazine interview, he was supposed to play in the Dean Ween Group (Mickey Melchiondo from Ween's side project) on that second night but shortly before the date, Mickey cancelled the Dean Ween Group appearance and Joe pulled together Bustle In Your Hedgerow (Russo, Dreiwitz, Metzger and Benevento's Led Zeppelin band) and added Tom Hamilton to form Joe Russo's Almost Dead. JRAD played one more show that year at the Capitol Theatre in Port Chester, New York on December 27, 2013.\n",
      "JRAD slowly began playing more shows in 2014, including several sets at summer festivals including the Gathering of the Vibes in Bridgeport, Connecticut, Hardly Strictly Blue Grass Festival in San Francisco, California, and String Cheese Incident's Hulaween Festival in Live Oak, Florida. They played two nights in Chicago and two nights in Colorado ending in a New Year's run on December 29, 30, and 31, at the Capitol Theatre, in Port Chester, New York, with the Grateful Dead's own Phil Lesh on bass filling in for Dreiwitz. The JRAD run with Phil Lesh was dubbed \"PhilRAD.\" JRAD played a total of 10 shows in 2014.\n"
   ],
   "infobox": {
      "Also known as": [
         "Almost Dead, JRAD"
      ],
      "Origin": [
         "Brooklyn, New York, United States"
      ],
      "Genres": [
         "Rock, jam band"
      ],
      "Years active": [
         "2013 (2013)–present"
      ],
      "Associated acts": [
         "Grateful Dead, Ween, Benevento/Russo Duo, Phil Lesh & Friends, Billy & the Kids, American Babies"
      ],
      "Members": [
         "Joe Russo",
         "Dave Dreiwitz",
         "Marco Benevento",
         "Scott Metzger",
         "Tom Hamilton"
      ]
   },
   "albums": [],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in [YEAR] that mainly covers the music of the Grateful Dead. Formed by Furthur and Benevento/[PERSON_NAME_LAST_0] Duo drummer [PERSON_NAME_FULL_0_MALE], the band played their first show on [MONTH] 26, [YEAR] at the Brooklyn Bowl in Brooklyn, New York. In addition to drummer [PERSON_NAME_FULL_0_MALE], the band also includes Ween's bassist [PERSON_NAME_FULL_2_MALE], keyboardist [MONTH]co Benevento, Scott Metzger on guitar and vocals, and [PERSON_NAME_FULL_1_MALE] of Brothers Past and American Babies on guitar and vocals.\n",
      "The band's first concert was on [MONTH] 26, [YEAR], at the Brooklyn Bowl in Brooklyn, New York for the second night of the Freaks Ball XIII. As [PERSON_NAME_FULL_0_MALE] recalls in the [MONTH] [YEAR] Relix Magazine interview, he was supposed to play in the Dean Ween Group (Mickey Melchiondo from Ween's side project) on that second night but shortly before the date, Mickey cancelled the Dean Ween Group appearance and [PERSON_NAME_FIRST_0] pulled together Bustle In Your Hedgerow ([PERSON_NAME_LAST_0], Dreiwitz, Metzger and Benevento's Led Zeppelin band) and added [PERSON_NAME_FULL_1_MALE] to form [BAND_NAME]. JRAD played one more show that year at the Capitol Theatre in Port Chester, New York on [MONTH] 27, [YEAR].\n",
      "JRAD slowly began playing more shows in [YEAR], including several sets at summer festivals including the Gathering of the Vibes in Bridgeport, Connecticut, Hardly Strictly Blue Grass Festival in San Francisco, California, and String Cheese Incident's Hulaween Festival in Live Oak, Florida. They played two nights in Chicago and two nights in Colorado ending in a New Year's run on [MONTH] 29, 30, and 31, at the Capitol Theatre, in Port Chester, New York, with the Grateful Dead's own [PERSON_NAME_FULL_0_MALE] on bass filling in for Dreiwitz. The JRAD run with [PERSON_NAME_FULL_0_MALE] was dubbed [SONG_NAME] JRAD played a total of 10 shows in [YEAR].\n"
   ]
}