{
   "Name": "Kingfish (band)",
   "rawData": [
      "Kingfish was an American rock band led by Matthew Kelly, a musician, singer, and songwriter who plays guitar and harmonica.  Kelly co-founded Kingfish in 1973 with New Riders of the Purple Sage bass player Dave Torbert and fellow San Francisco Bay Area musicians Robbie Hoddinott (lead guitar), Chris Herold (drums), and Mick Ward (keyboards). Ward died in a car accident later that year, and was replaced by Barry Flast, another keyboardist from San Francisco.\n",
      "In 1974, Kingfish became more well known, and signed their first record contract, after Grateful Dead guitarist and singer Bob Weir, a long-time friend of Kelly's, joined the band.  (Kelly had previously been a guest musician on the Grateful Dead album Wake of the Flood.)  Weir toured with Kingfish and was a band member on their first two albums, Kingfish and Live 'n' Kickin'.  When the Dead started touring again in 1976, Weir left Kingfish, along with Hoddinott and Herold, who were then replaced by Michael O'Neill (lead guitar) and David Perper (drums).  (Kelly later appeared on the Grateful Dead albums Shakedown Street and The Closing of Winterland, and on Weir's album Bobby and the Midnites.  In 1995 he became a founding member of Weir's band Ratdog.)\n",
      "The lineup of the band continued to change, with Kelly and Torbert remaining at the core.  Then, in 1979 Torbert and Kelly parted ways and Torbert formed a new lineup with Danny \"Rio\" DeGennaro and Michael O'Neill on guitars and sharing lead vocals. Also part of that lineup were Steve Shive (drums) and Ralph Liberto (keyboards, saxophone). Dave Torbert died of a heart attack in 1982.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco, California"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1973 - present"
      ],
      "Labels": [
         "Round Records ",
         " Relix Records ",
         " Phoenix Rising"
      ],
      "Associated acts": [
         "Ratdog",
         "Grateful Dead"
      ],
      "Past members": [
         "Matthew Kelly ",
         " Dave Torbert ",
         " Robbie Hoddinott ",
         " Chris Herold ",
         " Mick Ward ",
         " Barry Flast ",
         " Bob Weir ",
         " David Merrill ",
         " Arthur Steinhorn ",
         " Bill Kreutzmann ",
         " Barry Sless ",
         " Steve Kimock ",
         " Ken Emerson ",
         " Steve Shive ",
         " Danny DeGennaro ",
         " Michael O'Neill ",
         " David Perper ",
         " Anna Rizzo ",
         " Garth Webber ",
         " Terry Baker ",
         " Red Davidson ",
         " Rahni Raines ",
         " Dave Margen ",
         " Fred Campbell ",
         " Darrell Verdusco ",
         " Ralph Kolarik ",
         " Bill Hendrickson ",
         " Mookie Siegal ",
         " Steve Evans ",
         " Mark Neilsen ",
         " Ron Eglit ",
         " Ralph Liberto ",
         " Michael White ",
         " Bob Thompson"
      ]
   },
   "albums": [
      "Kingfish",
      "Live 'n' Kickin'",
      "Trident",
      "Kingfish",
      "Alive in Eighty Five",
      "Kingfish in Concert: King Biscuit Flower Hour",
      "Relix's Best of Kingfish",
      "A Night in New York",
      "Sundown on the Forest",
      "Live",
      "From the Front Row... Live",
      "Greatest Hits Live",
      "I Hear You Knockin'"
   ]
}