{
   "Name": "Kikagaku Moyo",
   "rawData": [
      "Kikagaku Moyo (Japanese: 幾何学模様, Hepburn: Kikagaku Moyō) are a Japanese psychedelic band from Tokyo. The band's name translates to \"geometric patterns.\"\n",
      "Kikagaku Moyo have come a long way –both literally and metaphorically– since their humble beginnings busking on the streets of Tokyo back in 2012. \nA tight-knit group of five friends who bonded over the desire to play freely, and explore music associated with space and psychedelica, their initial ambitions were modest semi-regular slots in the cramped clubs of the city’s insular music scene. Yet the band’s progressive, folk-influenced take on psychedelica marked them out from their peers and re-started Japan’s psych rock scene; it also brought them international acclaim.\n",
      "With a settled line up – Go Kurosawa (drums, vox), Tomo Katsurada (guitar, vox), Kotsuguy (bass), Daoud Popal (guitar), Ryu Kurosawa (sitar), –\nand a signature sound that blended classical Indian music, Krautrock, traditional folk, 70s rock, and acid-tinged psych, the band sold out shows across Europe and founded their own label, Guruguru Brain, to showcase not just their own work, but the under-represented music scene in East Asia. To date, the label has released music from over ten different artists alongside their own albums, and in 2017 Kurosawa and Katsurada relocating permanently to Amsterdam, The Netherlands. The move placed both Kikagaku Moyo and Guruguru Brain at the heart of Europe and eased the logistical challenges of long tours for bands on their label and release schedules while catering to Western audiences.\n"
   ],
   "infobox": {
      "Origin": [
         "Tokyo, Japan"
      ],
      "Genres": [
         "Psychedelic folk, psychedelic rock"
      ],
      "Years active": [
         "2012 (2012)–present"
      ],
      "Labels": [
         "Guruguru Brain"
      ],
      "Website": [
         "www.kikagakumoyo.com"
      ],
      "Members": [
         "Go Kurosawa",
         "Tomo Katsurada",
         "Kotsu Guy",
         "Daoud Popal",
         "Ryu Kurosawa"
      ]
   },
   "prunedData": [
      "[BAND_NAME] (Japanese: 幾何学模様, Hepburn: Kikagaku Moyō) are a [GENRE] band from Tokyo. The band's name translates to \"geometric patterns.\"\n",
      "[BAND_NAME] have come a long way –both literally and metaphorically– since their humble beginnings busking on the streets of Tokyo back in [YEAR]. \nA tight-knit group of five friends who bonded over the desire to play freely, and explore music associated with space and psychedelica, their initial ambitions were modest semi-regular slots in the cramped clubs of the city’s insular music scene. Yet the band’s progressive, folk-influenced take on psychedelica marked them out from their peers and re-started Japan’s psych rock scene; it also brought them international acclaim.\n",
      "With a settled line up – Go Kurosawa (drums, vox), [PERSON_NAME_FULL_1_MALE] (guitar, vox), Kotsuguy (bass), [PERSON_NAME_FULL_0_MALE] (guitar), Ryu Kurosawa (sitar), –\nand a signature sound that blended classical Indian music, Krautrock, traditional folk, 70s rock, and acid-tinged psych, the band sold out shows across Europe and founded their own label, Guruguru Brain, to showcase not just their own work, but the under-represented music scene in East Asia. To date, the label has released music from over ten different artists alongside their own albums, and in [YEAR] Kurosawa and [PERSON_NAME_LAST_1] relocating permanently to Amsterdam, The Netherlands. The move placed both [BAND_NAME] and Guruguru Brain at the heart of Europe and eased the logistical challenges of long tours for bands on their label and release schedules while catering to Western audiences.\n"
   ]
}