{
   "Name": "Lake Trout (band)",
   "rawData": [
      "Lake Trout are a rock band based in Baltimore. Their music is a combination of rock, ambient, jazz, and many other styles, including influences from post-rock and post-punk. The band has released six albums since its inception, four in-studio and two live. Their most recent album entitled \"Live\" was released in December 2008.\n",
      "Lake Trout first came together in 1994.  Their first album is self-titled and consists of eight songs with a heavy dose of jazz.  It was released independently in 1997.  The band's second album, released in 1998, is also on SNS Records.  Volume for the Rest of It consists of 16 tracks total and has a more developed feel.\n",
      "Lake Trout's third album, Alone at Last - Live with DJ Who is a live album and was recorded on December 9, 1999 at Trax in Charlottesville, Virginia.  It was released by Phoenix Rising Records in 2000.  This album, as would be expected with the addition of a DJ, has a harder and more electronic sound than the band's earlier work.  It has a slightly darker feel than the previous two records and incorporates elements of drum and bass music into the sound. Mike Lowry has stated that Amon Tobin was a significant influence on him at the time, driving his development of breakbeat and jungle drumming techniques and textures. The group's electronic experiments influenced the developing livetronica scene, although Lowry told Relix magazine in 2014 that the group \"never really felt  a part of that scene.\"\n"
   ],
   "infobox": {
      "Origin": [
         "Baltimore, Maryland"
      ],
      "Genres": [
         "Ambient, post-rock, post-punk"
      ],
      "Years active": [
         "1994–2010"
      ],
      "Labels": [
         "Palm Pictures"
      ],
      "Associated acts": [
         "Big in Japan",
         "Unkle"
      ],
      "Website": [
         "laketrout.com"
      ],
      "Members": [
         "James Griffith",
         "Ed Harris",
         "Mike Lowry",
         "Matt Pierce",
         "Woody Ranere"
      ]
   },
   "prunedData": [
      "[BAND_NAME] are a [GENRE] band based in Baltimore. Their music is a combination of [GENRE], ambient, jazz, and many other styles, including influences from post-[GENRE] and post-punk. The band has released six albums since its inception, four in-studio and two live. Their most recent album entitled \"Live\" was released in [MONTH] [YEAR].\n",
      "[BAND_NAME] first came together in [YEAR].  Their first album is self-titled and consists of eight songs with a heavy dose of jazz.  It was released independently in [YEAR].  The band's second album, released in [YEAR], is also on SNS Records.  Volume for the Rest of It consists of 16 tracks total and has a more developed feel.\n",
      "[BAND_NAME]'s third album, Alone at Last - Live with DJ Who is a live album and was recorded on [MONTH] 9, [YEAR] at Trax in Charlottesville, Virginia.  It was released by Phoenix Rising Records in [YEAR].  This album, as would be expected with the addition of a DJ, has a harder and more electronic sound than the band's earlier work.  It has a slightly darker feel than the previous two records and incorporates elements of drum and bass music into the sound. [PERSON_NAME_FULL_0_MALE] has stated that Amon Tobin was a significant influence on him at the time, driving his development of breakbeat and jungle drumming techniques and textures. The group's electronic experiments influenced the developing livetronica scene, although [PERSON_NAME_LAST_0] told Relix magazine in [YEAR] that the group \"never really felt  a part of that scene.\"\n"
   ]
}