{
   "Discography": {
      "Alone at Last, Live with DJ Who (2000)": {},
      "Another One Lost (2002)": {},
      "Lake Trout (1997)": {},
      "Live (2008)": {},
      "Not Them, You (2005)": {
         "text": [
            "Tracks 17-21 were added after the original release of the album.  They can be bought from the iTunes Music Store.\n"
         ]
      },
      "Volume for the Rest of It (1998)": {}
   },
   "External links": {},
   "History": {
      "Big in Japan": {
         "text": [
            "Big in Japan is a Lake Trout side project.[5]  Until 2009 its members were James Griffith, Matt Pierce, and Mike Lowry.  Its music was instrumental, very improvisational, and ambient.\n",
            "In 2009, while James Griffith stayed in London working on the new UNKLE record, guitarist Ed Harris started playing bass for the group.[5] More recent shows have included many guest sit-ins such as fellow Lake Trout member Woody Ranere, Katrina Ford of Celebration,[5][6] Dave Heumann of Arboretum, Matt Naas of The Expotentials, Steve Strohmeier, and Mike Kuhl.\n",
            "Since the summer of 2007, Big in Japan (in its original form) has been the touring band for UNKLE. James Griffith co-wrote Unkle's 2008 full-album release End Titles... Stories for Film and has been working on the most recent recording scheduled for release in early 2010.\n"
         ]
      },
      "Early Music": {
         "text": [
            "Lake Trout first came together in 1994.  Their first album is self-titled and consists of eight songs with a heavy dose of jazz.[2]  It was released independently in 1997.[1]  The band's second album, released in 1998, is also on SNS Records.  Volume for the Rest of It consists of 16 tracks total and has a more developed feel.\n",
            "Lake Trout's third album, Alone at Last - Live with DJ Who is a live album[2] and was recorded on December 9, 1999 at Trax in Charlottesville, Virginia.  It was released by Phoenix Rising Records in 2000.  This album, as would be expected with the addition of a DJ, has a harder and more electronic sound than the band's earlier work.  It has a slightly darker feel than the previous two records and incorporates elements of drum and bass music into the sound.[2] Mike Lowry has stated that Amon Tobin was a significant influence on him at the time, driving his development of breakbeat and jungle drumming techniques and textures. The group's electronic experiments influenced the developing livetronica scene, although Lowry told Relix magazine in 2014 that the group \"never really felt [like] a part of that scene.\"[3]\n"
         ]
      },
      "The \"Shift in Sound\"": {
         "text": [
            "With the release of their fourth album, Another One Lost (2003, released by Palm/RX Records), the band made a decided shift towards a more indie rock-oriented sound.[2]  The relationship between the \"new sound\" and the \"old sound\" is clearly evident, but the shift is obvious.[2]  Some fans lament this change in the band's sound, preferring the more jazz-oriented earlier work.  Many enjoy the change, however, seeing a clear progression in the band's sound.\n",
            "On September 13, 2005, the band released the album, Not Them, You on Palm/RX Records.[4]  This album continues with the evolution of the \"new sound.\"\n",
            "In December 2008, the band released a live album containing songs from the groups live set that had not been previously recorded as well as select songs from the most recent two studio albums.\n"
         ]
      },
      "Touring": {
         "text": [
            "In 2007 the band put a halt to its previous ongoing touring schedule.[4] Since then the band has re-appeared every year for a few shows on the east coast. James Griffith, Matthew Pierce and Mike Lowry have toured extensively as part of UNKLE's touring band since June 2007.[4]\n"
         ]
      }
   },
   "Members": {
      "text": [
         "Lake Trout consists of:[1]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "1.1 Early Music",
      "1.2 The \"Shift in Sound\"",
      "1.3 Touring",
      "1.4 Big in Japan",
      "2 Members",
      "3 Discography",
      "3.1 Lake Trout (1997)",
      "3.2 Volume for the Rest of It (1998)",
      "3.3 Alone at Last, Live with DJ Who (2000)",
      "3.4 Another One Lost (2002)",
      "3.5 Not Them, You (2005)",
      "3.6 Live (2008)",
      "4 References",
      "5 External links"
   ],
   "Summary": {
      "text": [
         "Lake Trout are a rock band based in Baltimore. Their music is a combination of rock, ambient, jazz, and many other styles, including influences from post-rock and post-punk.[1] The band has released six albums since its inception, four in-studio and two live. Their most recent album entitled \"Live\" was released in December 2008.\n"
      ]
   },
   "Title": "Lake Trout (band) - Wikipedia"
}