{
   "Name": "Legion of Mary (band)",
   "rawData": [
      "Legion of Mary was an American rock band, formed by Jerry Garcia of the Grateful Dead and his friend and musical collaborator Merl Saunders.  The band existed from December 1974 to July 1975, and played about 60 live shows.  Its members were Garcia (guitar and vocals), Saunders (keyboards), John Kahn (bass guitar), Martin Fierro (saxophone and flute) and Ron Tutt (drums).  The previous lineup of the band, with Paul Humphrey on drums, is sometimes also referred to as Legion of Mary, but later research has shown that they did not use the Legion of Mary name.\n",
      "In their concerts, Legion of Mary played rock music that had an eclectic mix of influences, including blues, funk, reggae, rock and roll, and especially jazz. Performances included extended improvisational solos, which Garcia made famous with his role in the Grateful Dead.\n",
      "Legion of Mary: The Jerry Garcia Collection, Vol. 1 is a two-CD album recorded live at various shows from December 1974 to July 1975.  It was released by Rhino Records on August 23, 2005.\n"
   ],
   "infobox": {
      "Origin": [
         "San Francisco Bay Area"
      ],
      "Genres": [
         "Rock"
      ],
      "Years active": [
         "1974–1975"
      ],
      "Labels": [
         "Rhino"
      ],
      "Associated acts": [
         "Grateful Dead, Jerry Garcia Band"
      ],
      "Past members": [
         "Jerry Garcia",
         "Merl Saunders",
         "Martin Fierro",
         "John Kahn",
         "Ron Tutt"
      ]
   },
   "prunedData": [
      "[BAND_NAME] was an [GENRE] band, formed by Jerry Garcia of the Grateful Dead and his friend and musical collaborator [PERSON_NAME_FULL_1_MALE].  The band existed from [MONTH] [YEAR] to [MONTH] [YEAR], and played about 60 live shows.  Its members were Garcia (guitar and vocals), [PERSON_NAME_LAST_1] (keyboards), John Kahn (bass guitar), [MONTH]tin Fierro (saxophone and flute) and [PERSON_NAME_FULL_0_MALE] (drums).  The previous lineup of the band, with Paul Humphrey on drums, is sometimes also referred to as [BAND_NAME], but later research has shown that they did not use the [BAND_NAME] name.\n",
      "In their concerts, [BAND_NAME] played rock music that had an [GENRE]",
      "[BAND_NAME]: The Jerry Garcia Collection, Vol. 1 is a two-CD album recorded live at various shows from [MONTH] [YEAR] to [MONTH] [YEAR].  It was released by Rhino Records on [MONTH] 23, [YEAR].\n"
   ]
}