{
   "Name": "Lotus (American band)",
   "rawData": [
      "Lotus is an instrumental electronic jam band formed in Indiana in 1999 now based in Philadelphia, PA and Denver, CO.\n",
      "Luke Miller formed Lotus at Goshen College in 1998  Indiana and the band's more permanent lineup coalesced in 1999. After a few years of playing what they describe as \"jamtronica\", Lotus recruited percussionist Chuck Morris in 2001 and shifted their focus to instrumental music, taking inspiration from electronic musicians such as The Orb.  The band's first album, Vibes, a compilation of live performances from their 2001 tour, was released in 2002, after which they signed to Harmonized Records, releasing a live album and two studio albums between 2003 and 2006. 2004's Nomad went to the top of the Home Grown Music Network charts and by the end of the year was the HGMN Best Seller. It was also nominated for a \"New Groove of the Year\" Jammy award. The album saw the band described by Allmusic as \"an electronically inclined jazz-funk outfit\", with Glide magazine stating \"Nomad exhibits Lotus' tight ability to blend shades of organic groove with elements of urban house\". The band's last album on Harmonized, The Strength of Weak Ties was described by PopMatters as \"instrumentals that - for the most part - don't go anywhere, but occasionally pulling out something that is genuinely thrilling\". The band then signed to SCI Fidelity Records, debuting on the label with the live double album, Escaping Sargasso Sea, which was nominated for a Jammy award by Guitar Player magazine for \"Best Live Album of 2007\". The album was described by Relix magazine as \"sexy and sophisticated dance music, mature enough to be played in the club or the living room\". The band followed this with Copy/Paste/Repeat, an album of remixes of tracks from their previous two studio albums, by bands and producers including Lymbyc Systym, Juan Maclean, DJ Harry and Telepath. The album was positively received by PopMatters, who said \"Copy/Paste/Repeat reinvents the jam band’s music as dance floor jams, with hip hop and trance-influenced beats and mind-warping electronic synth burbles\".\n",
      "The album, Hammerstrike was released on SCI Fidelity in 2008 to positive reviews. The band followed the album's release with a forty seven-date North American tour.  On Oct. 6, 2009 Lotus released a set of 2 EPs titled Oil on Glass/Feather on Wood featuring music recorded during the Hammerstrike sessions and 3 remixes of tracks from Hammerstrike. Before the band's 2009 fall tour, original drummer Steve Clemens left the band and was replaced by current drummer Mike Greenfield. The loss of Clemens triggered a gradual departure from the band's improvisational roots and a stylistic shift from organic electronica and jazz/funk fusion to electro-pop, indie rock and hip-hop.\n"
   ],
   "infobox": {
      "Origin": [
         "Indiana, United States"
      ],
      "Genres": [
         "Jam Band",
         "Electronic",
         "Livetronica[1]"
      ],
      "Years active": [
         "1999–present"
      ],
      "Labels": [
         "SCI Fidelity"
      ],
      "Website": [
         "http://Lotusvibes.com"
      ],
      "Members": [
         "Mike Greenfield ",
         "Mike Rempel",
         "Luke Miller",
         "Jesse Miller",
         "Chuck Morris"
      ],
      "Past members": [
         "Steve Clemens"
      ]
   },
   "albums": [
      "Vibes",
      "Germination",
      "Nomad",
      "The Strength of Weak Ties",
      "Escaping Sargasso Sea",
      "Copy/Paste/Repeat",
      "Hammerstrike",
      "Oil on Glass/Feather on Wood",
      "Lotus",
      "Build",
      "Monks",
      "Gilded Age",
      "Eat the Light",
      "Frames Per Second",
      "Free Swim"
   ],
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band formed in Indiana in [YEAR] now based in Philadelphia, PA and Denver, CO.\n",
      "Luke Miller formed [BAND_NAME] at Goshen College in [YEAR]  Indiana and the band's more permanent lineup coalesced in [YEAR]. After a few years of playing what they describe as [SONG_NAME].\n",
      "The album, Hammerstrike was released on SCI Fidelity in [YEAR] to positive reviews. The band followed the album's release with a forty seven-date North American tour.  On [MONTH]. 6, [YEAR] [BAND_NAME] released a set of 2 EPs titled Oil on Glass/Feather on Wood featuring music recorded during the Hammerstrike sessions and 3 remixes of tracks from Hammerstrike. Before the band's [YEAR] fall tour, original drummer Steve Clemens left the band and was replaced by current drummer [PERSON_NAME_FULL_0_MALE]. The loss of Clemens triggered a gradual departure from the band's improvisational roots and a stylistic shift from organic electronica and jazz/funk fusion to electro-pop, indie rock and hip-hop.\n"
   ]
}