{
   "Discography": {},
   "External links": {
      "Articles": {},
      "Interviews": {},
      "Other media": {},
      "Reviews": {}
   },
   "History": {
      "text": [
         "Luke Miller formed Lotus at Goshen College in 1998 [2] Indiana and the band's more permanent lineup coalesced in 1999.[3] After a few years of playing what they describe as \"jamtronica\", Lotus recruited percussionist Chuck Morris in 2001 and shifted their focus to instrumental music, taking inspiration from electronic musicians such as The Orb.[4]  The band's first album, Vibes, a compilation of live performances from their 2001 tour,[5] was released in 2002, after which they signed to Harmonized Records, releasing a live album and two studio albums between 2003 and 2006. 2004's Nomad went to the top of the Home Grown Music Network charts and by the end of the year was the HGMN Best Seller.[6] It was also nominated for a \"New Groove of the Year\" Jammy award.[4] The album saw the band described by Allmusic as \"an electronically inclined jazz-funk outfit\",[7] with Glide magazine stating \"Nomad exhibits Lotus' tight ability to blend shades of organic groove with elements of urban house\".[8] The band's last album on Harmonized, The Strength of Weak Ties was described by PopMatters as \"instrumentals that - for the most part - don't go anywhere, but occasionally pulling out something that is genuinely thrilling\".[9] The band then signed to SCI Fidelity Records, debuting on the label with the live double album, Escaping Sargasso Sea, which was nominated for a Jammy award by Guitar Player magazine for \"Best Live Album of 2007\".[10] The album was described by Relix magazine as \"sexy and sophisticated dance music, mature enough to be played in the club or the living room\".[11] The band followed this with Copy/Paste/Repeat, an album of remixes of tracks from their previous two studio albums, by bands and producers including Lymbyc Systym, Juan Maclean, DJ Harry and Telepath.[4][12] The album was positively received by PopMatters, who said \"Copy/Paste/Repeat reinvents the jam band’s music as dance floor jams, with hip hop and trance-influenced beats and mind-warping electronic synth burbles\".[13]\n",
         "The album, Hammerstrike was released on SCI Fidelity in 2008 to positive reviews.[14][15][16] The band followed the album's release with a forty seven-date North American tour.[17]  On Oct. 6, 2009 Lotus released a set of 2 EPs titled Oil on Glass/Feather on Wood featuring music recorded during the Hammerstrike sessions and 3 remixes of tracks from Hammerstrike. Before the band's 2009 fall tour, original drummer Steve Clemens left the band and was replaced by current drummer Mike Greenfield. The loss of Clemens triggered a gradual departure from the band's improvisational roots and a stylistic shift from organic electronica and jazz/funk fusion to electro-pop, indie rock and hip-hop.\n",
         "The album Lotus was released on Sept. 13, 2011.  The band recorded the album between December 2009 and October 2010 with Bill Moriarty in Philadelphia, with additional recordings made in the home studios of Jesse and Luke Miller and at various locations around the country.  David Wrench mixed a number of the tracks, and a few tracks were mixed by Bill Moriarty, along with Jesse Miller and Luke Miller.  The band released its first music video for Golden Ghost in August 2011.[18]\n",
         "The band has built much of their following on word of mouth, encouraging the recording and trading of live shows and playing between 90-115 live shows per year.[5]\n",
         "In addition to touring, Lotus has headlined the intimate Summer Dance Music Festival at Nelson Ledges Quarry Park in Garrettsville, OH for six out of the festival's seven years. The festival has been held since 2008, and Lotus has headlined every year with the exception of 2012, when Gramatik headlined instead.[19]\n"
      ]
   },
   "Live shows": {
      "text": [
         "Lotus is known for concerts with a complex light setup  [20][21] and varying set lists that employ frequent group improvisation. The concerts are often recorded by amateur engineers (tapers) and posted online for others to listen to.[22] Beginning with their January 27, 2008 show in Charleston, South Carolina, Lotus has sold their own soundboard recordings of certain shows on the site LiveDownloads.com; they are available in both MP3 and FLAC formats. The band has undertaken a number of tours and have performed at festivals including Jam on the River (Philadelphia, PA 2007,2008, 2014 and 2015), Wakarusa (KS 2005, 2006, 2007), Rothbury Music Festival in July 2008, 2009, 2013 and 2015, and All Good Music & Arts Festival 2010 and 2012[23] The band played a concert in New York City in September 2008 in which the new album Hammerstrike was played in full.[24] They also played at the Summer Camp Music Festival in Chillicothe, IL in 2008, 2009, 2011, 2012, 2014, 2016, and 2019. Other festivals include All Good Festival, Outside Lands, Bonnaroo, Camp Bisco, Fuji Rock,[25] and Ultra.\n",
         "Lotus has toured in Japan six times, performing at clubs and festivals including Fuji Rock, Metamorphose and Green Room Festival.\n",
         "The band has performed several themed shows.  On October 31, 2008, at the TLA in Philadelphia the show was billed as \"Live Fast Die Young: the 27 Conspiracy\".  Each of the 5 members dressed as a rock star who died at the age of 27 (Kurt Cobain, Jimi Hendrix, Brian Jones, Ron “Pigpen” McKernan, and Jim Morrison) and the show featured covers by each of the respective bands.  On Dec. 31, 2008 the band performed a show that included robot themed covers including Styx - \"Mr. Roboto\", Alan Parson's Project - \"I Robot\", Flaming Lips - \"Yoshimi Battles the Pink Robots: Part I\", Radiohead - \"Paranoid Android\", and Daft Punk - \"Robot Rock\". On Oct. 31, 2009 at Sonar in Baltimore the Halloween show was presented as \"Protein Pills in the Labyrinth\".  The band members dressed as different David Bowie characters (including Ziggy Stardust, Thin White Duke, and Jareth) and played \"Under Pressure,\" \"Fame,\" \"I'm Afraid of Americans,\" \"Space Oddity,\" \"Let's Dance,\" \"Rebel, Rebel\" and \"Suffragette City,\" along with original Lotus material. These David Bowie songs have occasionally appeared thereafter during the rest of the Fall 2009 tour.  On Feb. 22, 2010 at Schuba's in Chicago the band's first of two sets focused on post-rock music featuring covers of Tortoise, Trans Am and This Will Destroy You along with Lotus's own post-rock compositions.  On Oct. 30, 2010 at the Roseland in Portland, OR the band performed a Black Sabbath themed show.  For the second set the band came on stage dressed as Black Sabbath and performed remixed versions of side A of the album Paranoid (War Pigs, Paranoid, Planet Caravan, Iron Man), celebrating 40 years since its release.  On Oct. 31, 2010 at the Showbox in Seattle, WA the band paid tribute to video game music.  They performed versions of Pac-Man (Power Pills Remix), Contra (Jungle Theme), MegaMan2 (Dr. Wiley's Theme), Tetris theme and Zelda (Overworld and Underworld themes).  On Dec. 31, 2011 at Festival Pier in Philadelphia Lotus nodded to some of the most influential modern dance producers covering Daft Punk \"Da Funk\", Justice \"Phantom Part II\" and DeadMau5 \"Ghosts 'n' Stuff\". On Oct. 29, 2016 at Town Ballroom in Buffalo, NY the band played a Space Disco set. Jesse Miller used a Juno-106, Moog Minitaur and modular synth rack for the set focused on the space disco genre.\n",
         "Lotus was featured on the cover of the tour industry's leading magazine in October 2008 Pollstar.[26]\n"
      ]
   },
   "Members": {},
   "Musical style": {
      "text": [
         "Expanding upon a wide range of styles and sounds, Lotus is considered a multi-genre band.  The group incorporates elements of rock, electronica, jazz, jam, hip-hop, funk and other influences.[4][7][27][28] The band originally played as a jamband that leaned heavily on the sounds of funk, rock and jazz and with improvisational styles similar to Phish, Allman Brothers and The Grateful Dead.[29] Jesse Miller said of the band's sound: \"I truly believe Lotus' sound comes from the roots of rock 'n' roll mixed with electronic beats that are popular today. It took a long time for us to finally find a sound we all agreed on. But believe me, we experimented plenty before deciding what sound we were looking for\".[30] Lotus has also been known to experiment with a diverse set of genres regularly incorporating hip-hop and dubstep sounds and samples into their live shows.[31]\n",
         "Influenced heavily by the band's love for dance music and artists like The Orb, Aphex Twin, Kraftwerk, Talking Heads, Brian Eno, and Air the band's style has gravitated toward elements of the electronic genre while maintaining the foundation of jamrock.[4][17][32][33]\n",
         "Since 2006 the band has fused elements of progressive and post rock into their sound. Artists like Trans Am, Tortoise, Broken Social Scene and Beck have influenced Lotus.[16]\n"
      ]
   },
   "References": {},
   "Sections": [
      "1 History",
      "2 Live shows",
      "3 Musical style",
      "4 Members",
      "5 Discography",
      "6 References",
      "7 External links",
      "7.1 Reviews",
      "7.2 Articles",
      "7.3 Interviews",
      "7.4 Other media"
   ],
   "Summary": {
      "text": [
         "Lotus is an instrumental electronic jam band formed in Indiana in 1999 now based in Philadelphia, PA and Denver, CO.\n"
      ]
   },
   "Title": "Lotus (American band) - Wikipedia"
}