{
   "Name": "The Marshall Tucker Band",
   "rawData": [
      "The Marshall Tucker Band is an American rock band from Spartanburg, South Carolina. Noted for incorporating blues, country, jazz, into eclectic sound, the Marshall Tucker Band helped establish the Southern rock genre in the early 1970s.   While the band had reached the height of its commercial success by the end of the decade, it has recorded and performed continuously under various lineups for 45 years. Lead vocalist Doug Gray remains the only original member still active with the band.\n",
      "The original lineup of the Marshall Tucker Band, formed in 1972, included lead guitarist, steel guitarist, vocalist, and primary songwriter Toy Caldwell (1947–1993), lead vocalist Doug Gray (born 1948), keyboard player, saxophone player, and flautist Jerry Eubanks (born 1950), rhythm guitarist George McCorkle (1947–2007), drummer Paul Riddle (born 1953), and bassist Tommy Caldwell (1949–1980). They signed with Capricorn Records and released their first album in 1973, The Marshall Tucker Band.\n",
      "After Tommy Caldwell was killed in a car accident in 1980, he was replaced by bassist Franklin Wilkie. Most of the original band members had left by the mid-1980s to pursue other projects. The band's current lineup consists of Gray on vocals, keyboard player, saxophonist and flautist Marcus James Henderson, guitarists Chris Hicks and Rick Willis, bassist Tony Black and drummer B.B. Borden.\n"
   ],
   "infobox": {
      "Origin": [
         "Spartanburg, South Carolina, U.S."
      ],
      "Genres": [
         "Southern rock",
         "blues rock",
         "country rock",
         "jazz-rock",
         "progressive country[1]"
      ],
      "Years active": [
         "1972–present"
      ],
      "Labels": [
         "Capricorn, Warner Bros., Mercury, Cabin Fever, Ramblin'"
      ],
      "Associated acts": [
         "Charlie Daniels, The Allman Brothers Band, Eric Quincy Tate, Lynyrd Skynyrd"
      ],
      "Website": [
         "marshalltucker.com"
      ],
      "Members": [
         "Doug Gray (original member)",
         "Marcus James Henderson",
         " Chris Hicks",
         " Rick Willis",
         "Tony Black",
         "B.B. Borden"
      ],
      "Past members": [
         "Jerry Eubanks (original member)",
         "Toy Caldwell (original member) (d. 1993)",
         "George McCorkle (original member) (d. 2007)",
         "Paul Riddle (original member)",
         "Tommy Caldwell (original member) (d. 1980)",
         "Franklin Wilkie",
         "Stuart Swanlund (d. 2012)",
         "Andy Parks",
         "Rusty Milner",
         "Tim Lawter",
         "Ronnie Godfrey",
         "Bobby Ogdin",
         "Bob Wray",
         "James Stroud",
         "Tom Robb",
         "Ace Allen",
         "Don Cameron",
         "Frank Toler",
         "Mark Pettey",
         "Ronald Radford",
         "Todd Davis",
         "Paul Thompson",
         "Garry Guzzardo",
         "David Muse",
         "Clay Cook",
         "James Harold Brown",
         "Tony Heatherly",
         "Pat Elwood"
      ]
   },
   "prunedData": [
      "[BAND_NAME] is an [GENRE] band from Spartanburg, South Carolina. Noted for incorporating blues, country, jazz, into eclectic sound, the [MONTH]shall Tucker Band helped establish the Southern rock genre in the early [YEAR]s.   While the band had reached the height of its commercial success by the end of the decade, it has recorded and performed continuously under various lineups for 45 years. Lead vocalist [PERSON_NAME_FULL_0_MALE] remains the only original member still active with the band.\n",
      "The original lineup of the [MONTH]shall Tucker Band, formed in [YEAR], included lead guitarist, steel guitarist, vocalist, and primary songwriter Toy Caldwell ([YEAR]–[YEAR]), lead vocalist Doug Gray (born [YEAR]), keyboard player, saxophone player, and flautist [PERSON_NAME_FULL_1_MALE] (born [YEAR]), rhythm guitarist George McCorkle ([YEAR]–[YEAR]), drummer [PERSON_NAME_FULL_0_MALE] (born [YEAR]), and bassist Tommy Caldwell ([YEAR]–[YEAR]). They signed with Capricorn Records and released their first album in [YEAR], [BAND_NAME].\n",
      "After Tommy Caldwell was killed in a car accident in [YEAR], he was replaced by bassist [PERSON_NAME_FULL_0_MALE]. Most of the original band members had left by the mid-[YEAR]s to pursue other projects. The band's current lineup consists of Gray on vocals, keyboard player, saxophonist and flautist [MONTH]cus James Henderson, guitarists [PERSON_NAME_FULL_2_MALE] and Rick Willis, bassist [PERSON_NAME_FULL_1_MALE] and drummer B.B. Borden.\n"
   ]
}