{
   "Name": "The Marshall Tucker Band",
   "Sections": [
      "1 Origin of the name",
      "2 History",
      "2.1 Early history",
      "2.2 1970s",
      "2.3 1980s",
      "2.4 1990s",
      "2.5 21st century",
      "3 Music style",
      "4 Discography",
      "4.1 Studio albums",
      "4.2 Live albums",
      "4.3 Compilation albums",
      "4.4 Singles",
      "5 Music videos",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "The Marshall Tucker Band is an American rock band from Spartanburg, South Carolina. Noted for incorporating blues, country, jazz, into eclectic sound, the Marshall Tucker Band helped establish the Southern rock genre in the early 1970s.[2]   While the band had reached the height of its commercial success by the end of the decade, it has recorded and performed continuously under various lineups for 45 years.[2] Lead vocalist Doug Gray remains the only original member still active with the band.\n",
         "The original lineup of the Marshall Tucker Band, formed in 1972, included lead guitarist, steel guitarist, vocalist, and primary songwriter Toy Caldwell (1947–1993), lead vocalist Doug Gray (born 1948), keyboard player, saxophone player, and flautist Jerry Eubanks (born 1950), rhythm guitarist George McCorkle (1947–2007), drummer Paul Riddle (born 1953), and bassist Tommy Caldwell (1949–1980). They signed with Capricorn Records and released their first album in 1973, The Marshall Tucker Band.\n",
         "After Tommy Caldwell was killed in a car accident in 1980, he was replaced by bassist Franklin Wilkie. Most of the original band members had left by the mid-1980s to pursue other projects.[3] The band's current lineup consists of Gray on vocals, keyboard player, saxophonist and flautist Marcus James Henderson, guitarists Chris Hicks and Rick Willis, bassist Tony Black and drummer B.B. Borden.[4]\n"
      ]
   },
   "Origin of the name": {
      "text": [
         "The \"Marshall Tucker\" in the band's name does not refer to a band member, but rather a blind piano tuner from Columbia, South Carolina.[5]  While the band was discussing possible band names one evening in an old warehouse they had rented for rehearsal space, someone noticed that the warehouse's door key had the name \"Marshall Tucker\" inscribed on it, and suggested they call themselves \"The Marshall Tucker Band,\" not realizing it referred to an actual person.  It later came to light that Marshall Tucker, the blind piano tuner, had tuned a piano in that rented space before the band, and his name was inscribed on the key.[6] Music historian Joel Whitburn erroneously attributes \"Marshall Tucker\" to the owner of the band's rehearsal hall in his book, Top Pop Singles, 1955-2002.[7]\n"
      ]
   },
   "History": {
      "Early history": {
         "text": [
            "The original members (and some later members) of the Marshall Tucker Band had been playing in various lineups under different band names around the Spartanburg area since the early 1960s.  In 1966, members of several such bands merged to form the Toy Factory, named after guitarist Toy Caldwell.  The Toy Factory's constantly shifting lineup included, at times, Caldwell, his younger brother Tommy, Doug Gray, Jerry Eubanks, George McCorkle, and Franklin Wilkie.  In the late 1960s, four of the bandmembers served in the U.S. Armed Forces;[8][9][10] Toy Caldwell was in the USMC, received Purple Heart after being wounded in Vietnam.[11]\n",
            "By the 1970s, Toy Caldwell and George McCorkle had returned to Spartanburg, and the Toy Factory had resumed playing in area clubs.[12]  In 1970 the Toy Factory was the opening act for the Allman Brothers when the Allmans played at the \"Sitar\" music lounge in Spartanburg.[citation needed]\n",
            "In 1972, Caldwell and McCorkle once again revamped the band's lineup, eventually settling on Tommy Caldwell on bass, George McCorkle rhythm guitar, vocalist Doug Gray, and Jerry Eubanks, flute/tenor sax, while adding Paul Riddle on drums; the new lineup adopted the name \"Marshall Tucker Band.\" Wet Willie lead singer Jimmy Hall told Toy Caldwell to book the band at Grant's Lounge in Macon which he did. After hearing the band play at Grant's, Buddy Thornton and Paul Hornsby recorded the band's demo at Capricorn Studios in Macon, Ga.  Frank Fenter and Phil Walden signed the Marshall Tucker Band based on those demos.\n"
         ]
      },
      "1970s": {
         "text": [
            "The Marshall Tucker Band's self-titled debut, produced by Paul Hornsby, was released in 1973, and certified gold in 1975.[13] All of the tracks were written by Toy Caldwell, including \"Can't You See\", which was released in 1973 on Capricorn 0023 (\"Bubbled Under\" at No. 108 on 1 September 1973) and re-released in 1977 on Capricorn 0278 (peaked at No. 75 on 24 September 1977). After the album's release, the band began touring, playing upwards of 300 shows per year throughout the decade.[13] Southern rock fiddler Charlie Daniels later recalled that the Marshall Tucker Band \"came onstage and just blew it out from start to finish.\"[14]\n",
            "Daniels' first of many collaborations with the Marshall Tucker Band came on the band's second album, A New Life,[14] which was released in 1974, and certified gold in 1977.[13]  Daniels and blues guitarist Elvin Bishop were among several musicians that joined the band for Where We All Belong,[14] a double-album (one studio album and one live album) released by the band in 1974 and certified gold that same year.  The following year the band's Searchin' for a Rainbow was also certified gold the year of its release, and contained the track \"Fire on the Mountain,\" which peaked at No. 38 on the Billboard charts. Long Hard Ride, the band's fifth consecutive gold album, was released in 1976,[14] and its instrumental title track (which again features Charlie Daniels on fiddle) was nominated for a Grammy.[15] Carolina Dreams, released in 1977 and certified platinum that same year, proved to be the band's most commercially successful album, and included the track \"Heard It in a Love Song,\" which reached No. 14 on the Billboard charts.[13]  The band's final Capricorn release came with 1978's Together Forever, which was produced by Stewart Levine.[14] Following the bankruptcy of Capricorn, the Marshall Tucker Band moved to Warner Bros. Records for their ninth album, Running Like the Wind (the band's eighth release was a compilation album entitled Greatest Hits), and they retained Levine as the album's producer.\n"
         ]
      },
      "1980s": {
         "text": [
            "On April 22, 1980, following the completion of the band's tenth album Tenth (ninth studio release), bassist and co-founder Tommy Caldwell suffered massive head trauma in a car wreck and died six days later. Former Toy Factory bassist Franklin Wilkie replaced Caldwell for their next album, Dedicated, but the band was never able to recapture its commercial success of the 1970s. On 1982's Tuckerized, only two songs were written by band members; 'Sea, Dreams & Fairy Tales' by Toy Caldwell and 'Sweet Elaine' by George McCorkle. Main songwriter Toy Caldwell only contributed three songs to each of the two albums released in 1983; Just Us and Greetings from South Carolina. After 1983's Greetings from South Carolina, all the rest of the original band members split, sans Doug Gray and Jerry Eubanks.[2]\n",
            "In 1988 Gray and Eubanks recorded the album Still Holdin' On, their one and only release on the Mercury Records label. Although Gray and Eubanks added new members Rusty Milner, Stuart Swanlund, and Tim Lawter, Still Holdin' On was primarily recorded with studio musicians. The newer members (including newly added keyboardist Don Cameron) had a much greater role, however, on the band's 1990 album, Southern Spirit, released on the Sisaspa label. The album marked a return to the band's country and blues roots.[16]\n"
         ]
      },
      "1990s": {
         "text": [
            "In 1992, the Marshall Tucker Band produced its first album for the Cabin Fever label, Still Smokin', which managed to crack the top 70 on the Billboard charts. The band's 1993 release, Walk Outside the Lines, marked a transition to a more country sound, relying less on long improvised jams that were the trademark of the band's early career.[17] The album's title track was co-written by country music star Garth Brooks, a long-time fan of the band who considered writing a track for them a \"milestone\" in his career.[13]\n",
            "For 1998's Face Down In the Blues, the band added Spartanburg-area guitarist Ronald Radford and Firefall's multi-instrumentalist David Muse, the latter replacing Jerry Eubanks, who had retired in 1996.[14] Gospel, the band's 1999 album, featured the band's rendition of traditional songs such as \"The Wayfaring Stranger\" and \"Will the Circle Be Unbroken\", and several original tracks.\n"
         ]
      },
      "21st century": {
         "text": [
            "The Marshall Tucker Band continued recording and performing into the 21st century, playing between 150 and 200 shows per year.[6] The band reissued many of its albums from the 1970s on its new Ramblin' Records label, as well as two two-disc compilations, the first (Anthology) being a 30-year retrospective and the second (Where a Country Boy Belongs) being a collection of the band's country songs. In 2004, they released another studio album, Beyond the Horizon, and the following year released a Christmas album, Carolina Christmas.\n",
            "Can't You See was used for the opening and closing credits of the Kevin Costner 2008 motion picture Swing Vote. Take the Highway was also used in the movie.\n",
            "\"Can't You See\" is also used in the 2001 film Blow, and the 2017 film I, Tonya.\n"
         ]
      }
   },
   "Music style": {
      "text": [
         "Tommy Caldwell described the Marshall Tucker Band's music as progressive country, explaining that the band played country music structures and riffs combined with jazz improvisation upon which more complex structures were built from the country music foundation.[1] The band has incorporated throughout its career elements of diverse genres into its sound, most frequently blues,[18][19][20][21] country[18][19][21] and jazz.[18][21] The band has also drawn from boogie,[20] psychedelic,[22] R&B,[22] gospel,[22] folk[22] and rock and roll.[19] According to Allmusic's Jeff Tamarkin, Toy Caldwell's guitar playing style was categorized by \"flashy, jazzy licks\"; the band has also been noted for extensive jamming.[23]\n",
         "Remembering the early years in 2012, Doug Grey describes the band as being like ''a bowl of soup like your mom would cook. Whatever was in the refrigerator was all thrown in there, and however it tasted was what it was.'' As he remarks, the result was so eclectic that the press didn't really know what to make of them as they failed to fit neatly in any pigeonhole.[24]\n",
         "The band's eclectic musical style has predominately been categorized as Southern rock.[19][21][25][26][27][28] The band's music has also been categorized as blues rock,[23] country rock,[25] jazz rock[25] and as a \"proto-jam band\".[23] Billboard charts have categorized the band as country, blues and adult contemporary.[21]\n",
         "The band's self-titled debut album was categorized as country rock,[22] progressive rock[25] and \"a Southern rock classic\".[29] Guitarist/songwriter Toy Caldwell drew heavily from bluegrass and country while writing songs for the band's debut.[20] The follow-up album, A New Life, was categorized as having more of a country sound.[18][30] Where We All Belong has been described as a \"classic rock and roll album\".[31] The band's 1979 album Running Like the Wind features a pop rock and jazz fusion sound.[25] The follow-up Tenth album featured a boogie rock sound.[32] The band's 1998 album Face Down in the Blues consisted, as its title implies, entirely of blues music.[21]\n"
      ]
   },
   "Discography": {
      "Studio albums": {},
      "Live albums": {},
      "Compilation albums": {},
      "Singles": {}
   },
   "Music videos": {},
   "References": {},
   "External links": {},
   "coreData": [
      "The Marshall Tucker Band is an American rock band from Spartanburg, South Carolina. Noted for incorporating blues, country, jazz, into eclectic sound, the Marshall Tucker Band helped establish the Southern rock genre in the early 1970s.[2]   While the band had reached the height of its commercial success by the end of the decade, it has recorded and performed continuously under various lineups for 45 years.[2] Lead vocalist Doug Gray remains the only original member still active with the band.\n",
      "The original lineup of the Marshall Tucker Band, formed in 1972, included lead guitarist, steel guitarist, vocalist, and primary songwriter Toy Caldwell (1947–1993), lead vocalist Doug Gray (born 1948), keyboard player, saxophone player, and flautist Jerry Eubanks (born 1950), rhythm guitarist George McCorkle (1947–2007), drummer Paul Riddle (born 1953), and bassist Tommy Caldwell (1949–1980). They signed with Capricorn Records and released their first album in 1973, The Marshall Tucker Band.\n",
      "After Tommy Caldwell was killed in a car accident in 1980, he was replaced by bassist Franklin Wilkie. Most of the original band members had left by the mid-1980s to pursue other projects.[3] The band's current lineup consists of Gray on vocals, keyboard player, saxophonist and flautist Marcus James Henderson, guitarists Chris Hicks and Rick Willis, bassist Tony Black and drummer B.B. Borden.[4]\n",
      "The \"Marshall Tucker\" in the band's name does not refer to a band member, but rather a blind piano tuner from Columbia, South Carolina.[5]  While the band was discussing possible band names one evening in an old warehouse they had rented for rehearsal space, someone noticed that the warehouse's door key had the name \"Marshall Tucker\" inscribed on it, and suggested they call themselves \"The Marshall Tucker Band,\" not realizing it referred to an actual person.  It later came to light that Marshall Tucker, the blind piano tuner, had tuned a piano in that rented space before the band, and his name was inscribed on the key.[6] Music historian Joel Whitburn erroneously attributes \"Marshall Tucker\" to the owner of the band's rehearsal hall in his book, Top Pop Singles, 1955-2002.[7]\n"
   ],
   "infobox": {
      "Origin": [
         "Spartanburg, South Carolina, U.S."
      ],
      "Genres": [
         "Southern rock",
         "blues rock",
         "country rock",
         "jazz-rock",
         "progressive country[1]"
      ],
      "Years active": [
         "1972–present"
      ],
      "Labels": [
         "Capricorn, Warner Bros., Mercury, Cabin Fever, Ramblin'"
      ],
      "Associated acts": [
         "Charlie Daniels, The Allman Brothers Band, Eric Quincy Tate, Lynyrd Skynyrd"
      ],
      "Website": [
         "marshalltucker.com"
      ],
      "Members": [
         "Doug Gray (original member)",
         "Marcus James Henderson",
         " Chris Hicks",
         " Rick Willis",
         "Tony Black",
         "B.B. Borden"
      ],
      "Past members": [
         "Jerry Eubanks (original member)",
         "Toy Caldwell (original member) (d. 1993)",
         "George McCorkle (original member) (d. 2007)",
         "Paul Riddle (original member)",
         "Tommy Caldwell (original member) (d. 1980)",
         "Franklin Wilkie",
         "Stuart Swanlund (d. 2012)",
         "Andy Parks",
         "Rusty Milner",
         "Tim Lawter",
         "Ronnie Godfrey",
         "Bobby Ogdin",
         "Bob Wray",
         "James Stroud",
         "Tom Robb",
         "Ace Allen",
         "Don Cameron",
         "Frank Toler",
         "Mark Pettey",
         "Ronald Radford",
         "Todd Davis",
         "Paul Thompson",
         "Garry Guzzardo",
         "David Muse",
         "Clay Cook",
         "James Harold Brown",
         "Tony Heatherly",
         "Pat Elwood"
      ]
   }
}