{
   "Additional Projects": {
      "text": [
         "Murawaski has received recognition with BK3 (aka Bill Kreutzmann Trio, KBM, Three) which also includes Bill Kreutzmann of the Grateful Dead and Bonnie Raitt bassist James \"Hutch\" Hutchinson.  In addition, he tours with Phish bassist Mike Gordon side projects. Other members currently include Robert Walter, Craig Myers, John Kimock.  Depth Quartet is another band Scott Murawski also plays in alongside former Max Creek drummer, Greg Vasso.  In addition, Murawski and Mercier often play acoustic duo concerts.\n",
         "Mercier has two side projects.  One is \"The Marks Brothers\" which includes himself on keyboards and vocals, Mark Paradis from The Mark Paradis Band on guitar and vocals, Dave Stoltz formerly of Dickey Betts and Great Southern on bass and Brian \"Duke\" Konopka formerly from S.L.A.P. and The Mark Paradis Band on drums.   His other band that plays a few shows throughout the year is \"The Mark Mercier Band.\"  Mercier and Paradis often play acoustic duo gigs around the CT area as well, at times joined by Rider on Bass.\n",
         "Bill Carbone regularly appears in \"The Z3,\" an organ trio dedicated to the music of Frank Zappa featuring organist Beau Sasser (Alan Evans Trio, Akashic Record) and  guitarist Tim Palmieri (Breakfast, Kung Fu).\n"
      ]
   },
   "External links": {},
   "History": {
      "text": [
         "Max Creek was formed in 1971 when Hartt College of Music students Dave Reed (acoustic guitar) and John Rider (electric bass) met and shared their original songs and love of American folk music.  They initially rehearsed in the basement of John's frat house in Hartford, CT, but later moved to a 'band house' in Feeding Hills, MA.  Dave eventually asked his high school friend, drummer Bob Gosselin to join, making them a trio.[1] The band originally played folk, singer/songwriter and country rock music. In 1972, Dave Reed invited one of his music students, 15-year-old electric guitarist Scott Murawski, to attend a rehearsal at the 'band house'.  Scott's playing blew the guys away and he was asked to come on board the MC train.  Strangely, Scott's early original association with the band ended abruptly when he was banned from a Hartford, CT club that the band played at regularly for \"being under age\". In 1973 Dave Reed came down with appendicitis, so Mark Mercier was brought in on keyboards to fill in, and Scott was invited back to play lead guitar. Due to the influence of the Grateful Dead, the band decided to incorporate more improvisation into the music becoming more electrified.[2] The music of the psychedelic era had a heavy influence on the band, leading to a  sound and style more like that of the Grateful Dead and the rest of the San Francisco Bay scene. Eventually, Dave left the band to pursue bluegrass, country rock and acoustic ragtime music as a solo act and with the short-lived Hatchett Hill String Band.  In the '80s, Dave went on to form Tamboura Productions where he has recorded several albums and fronted a number of bands including Tamboura (1992) and The Introverts (2016); he is an avid builder/player of cigar box guitars.\n",
         "Percussionist Rob Fried joined the band in 1979. Known for his elaborate stage setup, often with dozens drums and percussion pieces, Fried could always be easily identified in a club or hall thanks to his trademark Panama hat, Hawaiian shirt and dark glasses. Fried left the band in 2004 and died of cancer on September 6, 2006.\n",
         "Amy (Barefoot) Fazzano was a vocalist with the band from July 1976 until September 10, 1983.\n",
         "Bob Gosselin left the band in 1985 and was replaced on drums by Greg DeGuglielmo.\n",
         "Bob Bloom was an occasional second drummer and percussionist in 1976.\n",
         "Greg Vasso replaced DeGuglielmo in 1991, and stayed until 1996. At that point, Scott Allshouse took over and was with the band until 2011 when Bill Carbone replaced him. Jamemurrell Stanley is the band's current percussionist.\n",
         "As of 2019, Max Creek is still actively playing shows, most recently celebrating their 40th anniversary in Costa Rica with Bill Kreutzmann of the Grateful Dead in a series of shows dubbed Jungle Jam.\n",
         "The band influenced a new generation of touring musicians. Mike Gordon once sent his dad to record a Max Creek show with his gear while he was in college. [3] Guster drummer Brian Rosenworcel was an outspoken fan growing up.[4]\n"
      ]
   },
   "Members": {
      "Current members": {},
      "Former Members": {}
   },
   "Music": {
      "Discography": {},
      "Live Recordings": {
         "text": [
            "A number of the band's live performances are available for download from Archive.org.[7]\n"
         ]
      },
      "text": [
         "Max Creek's style of intense improvised jams were a significant influence on such later bands as Phish, whose bassist Mike Gordon has referred to Max Creek as one of his “favorite bands,” and has sat in with the band several times over the past few years.[5]  On January 5, 2008, Gordon played with Max Creek's Scott Murawski, as well as the Grateful Dead's Bill Kreutzmann, at a benefit concert in Costa Rica.[6]  Live shows are the band's forte, often lasting three hours or more. Creek, as they are known, peaked in popularity in the late 1980s, when they would play more than 200 shows a year.  They decided to cut back drastically on touring in the early 1990s to concentrate on family, and today play only a handful of shows a year.  The loss of sound engineer John Archer and his Crystal Clear sound system in the early 1990s was a devastating blow for Creek and their fans, as was the decision to stop touring at the time that the jam band scene was heating up.\n"
      ]
   },
   "Notes": {},
   "References": {},
   "Sections": [
      "1 History",
      "2 Members",
      "2.1 Current members",
      "2.2 Former Members",
      "3 Music",
      "3.1 Discography",
      "3.2 Live Recordings",
      "4 Additional Projects",
      "5 Notes",
      "6 References",
      "7 External links"
   ],
   "Summary": {
      "text": [
         "Max Creek is an American rock band that was formed by Dave Reed, John Rider and Bob Gosselin in 1971. Max Creek has a loyal following, and put on an annual music festival at Indian Lookout Country Club in upstate New York, dubbed Camp Creek, and was one of the longest running festivals on the East Coast when it took a hiatus in 2008. Camp Creek was held in Maine in 2011, and returned to Indian Lookout Country Club in 2014. After another hiatus, Camp Creek was held in 2019 at Odetah Camping Resort in Bozrah, CT. \n"
      ]
   },
   "Title": "Max Creek - Wikipedia"
}