{
   "Name": "Medeski Martin & Wood",
   "Sections": [
      "1 History",
      "2 Side projects",
      "3 Discography",
      "3.1 Albums",
      "3.2 Live Albums",
      "3.3 EPs",
      "3.4 Compilations",
      "3.5 Box Sets",
      "3.6 DVDs",
      "4 See also",
      "5 References",
      "6 External links"
   ],
   "Summary": {
      "text": [
         "Medeski Martin & Wood (or MMW) is an American avant-jazz-funk band formed in 1991, consisting of John Medeski on keyboards, Billy Martin on drums, and Chris Wood on bass. The band is influenced by musical traditions including funk and hip hop and is known for an unconventional style sometimes described as \"avant-groove\".\n",
         "MMW has found moderate mainstream success, often working with guitarist John Scofield and touring on the jam band circuit.\n"
      ]
   },
   "History": {
      "text": [
         "The band members were introduced to each other by jazz drummer Bob Moses, who had performed with Medeski and Wood, and was Martin's instructor. \n",
         "Medeski Martin & Wood's first performances together were at the Village Gate, a popular New York jazz club. Though they started out with a more-or-less straightforward piano-bass-drums jazz setup, the threesome expanded their sound with unusual configurations. Their first album, Notes from the Underground, is a record of their entirely-acoustic era, but Medeski  soon added electric piano (outfitted with distortion pedals and other effects), and began switching back and forth among Hammond organ, Clavinet, Mellotron and other keys. Wood alternated between stand-up and bass guitar, stuck paper behind his strings for a “snare” effect and occasionally employed a drumstick as a slide.[1] Wood entirely eschewed the electric bass for MMW's first three albums, and still relies heavily on the acoustic upright bass in recordings and during live performances. Their earlier albums reveal a Hip Hop influenced updating of classic soul jazz sounds, which is the primary theme of their well-known 1996 album, Shack-man. \n",
         "The band received some of their first significant exposure outside of the New York City jazz scene by performing with Phish at their October 14, 1995 concert, which led to the association of the group as a jam band.[2] In addition, their performance on John Scofield's 1997 album A Go Go helped to further their exposure.  The band collaborated further with Scofield again in 2006, releasing the album Out Louder under the name Medeski Scofield Martin & Wood.  This was the first album released on MMW's own Indirecto Records.\n",
         "From 1998 to 2005, MMW were signed to jazz label Blue Note Records, and showed them delving deeper into dense, electronic funk than their earlier albums, although the band continued to experiment with free jazz and free improvisation both on their albums and in concert. \n",
         "In 1999 the band performed in Toronto, Ontario.[3]\n",
         "In 2001 MMW performed several songs for the Red Hot Organization's compilation album Red Hot + Indigo, a tribute to Duke Ellington, which raised money for various charities devoted to increasing AIDS awareness and fighting the disease. \n",
         "Medeski Martin & Wood's live performances are renowned for their exploratory nature. Their concerts usually involve extended improvisations, which may be both arrhythmic and atonal, an aspect of their musicianship that is rarely documented in the studio. They occasionally tour using only acoustic instruments, reverting to the instrumentation that they began their career with. Their album Tonic is an example of these more contemporary acoustic performances. They have also done short tours of entirely improvisatory performances. These shows usually consisted of two sets of improvisation, followed by an encore of a song from an album.\n"
      ]
   },
   "Side projects": {
      "text": [
         "Each of the trio's three members is involved in a large music community, and has participated in numerous side projects over the years.  \n",
         "In 2001 John Medeski collaborated with the North Mississippi Allstars and steel guitarist Robert Randolph; together, these five musicians formed The Word, a bluesy gospel instrumental jam band. They released two albums and toured extensively.\n",
         "Beginning around 2005 Chris Wood formed The Wood Brothers with his brother, blues guitarist Oliver Wood. They have released several albums to date and continue to tour and record together. \n",
         "In 2007 John Medeski and Billy Martin released an album as a duo, called Mago. They performed that material together at the 2007 Bonnaroo Music Festival.[4]\n",
         "In 2016, John Medeski formed supergroup Saudade with Chino Moreno of Deftones, Team Sleep, Palms, and Crosses; guitarist Dr. Know of Bad Brains; bassist Chuck Doom of Crosses and Team Sleep; and drummer Mackie Jayson of Cro-Mags and Bad Brains.[5] In 2018 John Medeski formed John Medeski's Mad Skillet with two members of the Dirty Dozen Brass Band, releasing an album and touring under the name.\n",
         "In March 2020 during the COVID-19 pandemic, Medeski and Martin released a free, hour-long, live in-studio video performance as \"Bandemic\" with John Scofield and Jesse Murphy under their Woodstock Sessions label.[6]\n"
      ]
   },
   "Discography": {
      "Albums": {},
      "Live Albums": {},
      "EPs": {},
      "Compilations": {},
      "Box Sets": {},
      "DVDs": {},
      "text": [
         "(Artist name if not Medeski Martin & Wood)\n"
      ]
   },
   "See also": {},
   "References": {},
   "External links": {},
   "coreData": [
      "Medeski Martin & Wood (or MMW) is an American avant-jazz-funk band formed in 1991, consisting of John Medeski on keyboards, Billy Martin on drums, and Chris Wood on bass. The band is influenced by musical traditions including funk and hip hop and is known for an unconventional style sometimes described as \"avant-groove\".\n",
      "MMW has found moderate mainstream success, often working with guitarist John Scofield and touring on the jam band circuit.\n",
      "The band members were introduced to each other by jazz drummer Bob Moses, who had performed with Medeski and Wood, and was Martin's instructor. \n",
      "Medeski Martin & Wood's first performances together were at the Village Gate, a popular New York jazz club. Though they started out with a more-or-less straightforward piano-bass-drums jazz setup, the threesome expanded their sound with unusual configurations. Their first album, Notes from the Underground, is a record of their entirely-acoustic era, but Medeski  soon added electric piano (outfitted with distortion pedals and other effects), and began switching back and forth among Hammond organ, Clavinet, Mellotron and other keys. Wood alternated between stand-up and bass guitar, stuck paper behind his strings for a “snare” effect and occasionally employed a drumstick as a slide.[1] Wood entirely eschewed the electric bass for MMW's first three albums, and still relies heavily on the acoustic upright bass in recordings and during live performances. Their earlier albums reveal a Hip Hop influenced updating of classic soul jazz sounds, which is the primary theme of their well-known 1996 album, Shack-man. \n"
   ],
   "infobox": {
      "Origin": [
         "Brooklyn, New York, U.S."
      ],
      "Genres": [
         "Jazz, jazz-funk, jazz fusion, acid jazz, soul jazz, jam band"
      ],
      "Years active": [
         "1991–present"
      ],
      "Labels": [
         "Blue Note, Gramavision, Indirecto, Ropeadope"
      ],
      "Associated acts": [
         "John Scofield, Nels Cline"
      ],
      "Website": [
         "medeskimartinandwood.com"
      ],
      "Members": [
         "John Medeski",
         "Billy Martin",
         "Chris Wood"
      ]
   }
}